{
    "title": "Are homeless people really homeless globally? - Quora",
    "tags": [
        "Homelessness"
    ],
    "response": [
        {
            "author_info": {
                "name": "Eric Takabayashi",
                "href": "/profile/Eric-Takabayashi-1"
            },
            "answer_text": "I believe that any homeless I have encountered who admit to being so are for real. Why? One reason being, anyone who ever asked me for money did not appear homeless, or did not claim to be homeless. No one on the street ever gave me a sad story about being e.g., a homeless disabled Vietnam veteran or a woman escaping from an abusive relationship and asked for anything (other than more of the food I was serving). In Hawaii, one can keep reasonably clean and presentable showering at the beach or cleaning and grooming oneself in a public bathroom. I’ve seen it done. Certain beaches or public parks may look like below, with homeless being the number one complaint of tourists. As Waikiki moves homeless out of tourist zones, some fear perpetual displacement - The Guardian Aloha and Welcome to Paradise. Unless You’re Homeless. - The New York Times Homelessness in Waikiki - Hawaii Business  Unseen by the public, homeless in Hawaii may live like this:  What do they gain by pretending? Professional panhandlers on the mainland I read about who hang out in highly trafficked areas like outside Walmart or along highway onramps who can collect more than a working wage, and go to their homes at the end of the day in new SUVs? Don’t know any. Can’t say I’ve ever seen any. A few months ago, I was walking out of Walmart with my daughter, and a caucasian man walked up to the trash can at the entrance, fished a box lunch out of the trash and started eating the leftovers without even making eye contact. I gave him some money and suggested he buy something inside. My daughter asked if I knew him. “No,” I replied. “Rich” homeless in Hawaii, like people with jobs who can’t afford $3,000 a month rent or $600,000 houses, live like this: Ford E-150 Van runs and drives, mechanics special - $400  The most expensive places to live in America - CNBC Hawaii: Average home price: $1,044,462",
            "date": "Answered November 4, 2018",
            "views": "218",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Rosemary Smith",
                    "user_href": "/profile/Rosemary-Smith-1"
                },
                {
                    "user_id": "Laura Adkins",
                    "user_href": "/profile/Laura-Adkins-4"
                },
                {
                    "user_id": "John Himuka",
                    "user_href": "/profile/John-Himuka-日向-ジョン"
                }
            ]
        },
        {
            "author_info": {
                "name": "Jenny Frank",
                "href": "/profile/Jenny-Frank-7"
            },
            "answer_text": "To truly understand how vulnerable you feel when you’re homeless I suggest trying it. Leave your wallet, and cell phone inside your house. You will need to bring with you $5 in change. Put it in your pocket. (I would suggest not bringing any money so you can experience the humiliation of begging first hand. If you do need to panhandle/beg for money, make sure once this little experiment is over you give that money back to someone who is really homeless.) Don’t eat breakfast. Don’t shower. Don’t brush your hair, teeth, or put on deodorant. Just walk out the front door, and keep walking for a bit. Don’t go anywhere too dangerous but also don’t walk around your “comfort zone”. Find a park, sit down. It should be lunch time, and you’re hungry. Figure it out. Enjoy the day. You have no worries to speak of. Maybe go to the library. Use the internet. It’s dinner time. And probably getting a little dark. You’ll need to find a place to sleep. Shelters are not a good place. If you think they are then prior to this experiment, go talk to someone at the local shelter, explain what you’re doing, and that you don’t want to take resources from those who need it but would like to experience the intake process as a homeless person would. They may or may not accommodate your request. Otherwise - find blankets. Boxes. ANYTHING you can to provide shelter and to make you as invisible as possible. Also find a place to sleep. Abandoned store fronts. Alleys. Behind your neighbors garage. Sleep. Do it all again the next day, but this time you’ll have even less money. And you’ll have to hide your sleeping blankets/shelter, carry it with you, or discard it and hope you can find something better later. Now you will have an idea of how vulnerable homelessness feels. What you will not have is the feeling of utter despair and hopelessness that begins long before someone becomes homeless. The mountain of debt, stress of losing income, traumatic life event or whatever it is that causes someone to become homeless is exhausting. It deflates your self-worth, leaves you feeling that nothing you can do will help you out of the situation your in. All that happens before you actually become homeless. Your “experience” will give you some idea of how vulnerable it feels to actually be homeless, you will not have that dark cloud hanging over you. You’ll also know there’s a home to go back to. ",
            "date": "Answered April 27, 2019",
            "views": "151",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Mike Montgomery",
                    "user_href": "/profile/Mike-Montgomery-59"
                },
                {
                    "user_id": "Yon Kromis",
                    "user_href": "/profile/Yon-Kromis"
                },
                {
                    "user_id": "Fabio Anders",
                    "user_href": "/profile/Fabio-Anders"
                }
            ]
        },
        {
            "author_info": {
                "name": "Adam Lee Chadwick",
                "href": "/profile/Adam-Lee-Chadwick"
            },
            "answer_text": "How vulnerable are the homeless: One thing I learned about homeless people and also been a homeless in my life. Almost everywhere, homeless people are vulnerable in many ways because they have no shelters to go to, to live and survive. The streets are the survivor way to make day by day living. But, what I learned so much about Las Vegas, Nevada is that homeless people are vulnerable and invisible at the same time and I will show you how that is. Living in the Hidden Tunnels of Las Vegas. Many new homeless people in Las Vegas do not know that this place exist. Only the locals know and understand this place. It is the Dark and Underground World of Homeless Lifestyle in Las Vegas.  Welcome to the Real World of Homeless Lifestyle in Las Vegas, Nevada inside the Tunnels of beneath Strip of Las Vegas.  The homeless lifestyle inside the many tunnels of underneath of the STRIP of Las Vegas.  Las Vegas Homeless people are invisible in many ways like James Bond 007. Visible in one moment and then disappear in minutes. That is the homeless lifestyle in Las Vegas, Nevada. I lived it personally because I was homeless at one time in my life in Las Vegas.",
            "date": "Answered April 27, 2019",
            "views": "388",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Louis Frayser",
                    "user_href": "/profile/Louis-Frayser"
                },
                {
                    "user_id": "Fabio Anders",
                    "user_href": "/profile/Fabio-Anders"
                },
                {
                    "user_id": "Ginny Morgan",
                    "user_href": "/profile/Ginny-Morgan-4"
                }
            ]
        },
        {
            "author_info": {
                "name": "Jean Rafenski Reynolds",
                "href": "/profile/Jean-Rafenski-Reynolds"
            },
            "answer_text": "I’ve had several homeless friends. I don’t know what you mean by “for real.” Do you think they have homes somewhere and are pretending to be homeless? Or are you thinking they’re choosing to be homeless? Or…? How about volunteering at a soup kitchen? Or just befriending a homeless person you see regularly and spending a few minutes each week getting to know them? ",
            "date": "Answered November 4, 2018",
            "views": "44",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Louis Frayser",
                    "user_href": "/profile/Louis-Frayser"
                }
            ]
        },
        {
            "author_info": {
                "name": "Gerald Crawford",
                "href": "/profile/Gerald-Crawford-12"
            },
            "answer_text": "They are for real - they have lost there own self-worth and self respect. All the ask is that you acknowledge there presence. In modern-day society we tend to ignore them and see them as inadvisable. That is a condemnation on us. I dare you. Put yourself into there shoes for a day. ",
            "date": "Answered November 4, 2018",
            "views": "27",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Tammy Eagle",
                "href": "/profile/Tammy-Eagle-2"
            },
            "answer_text": "I live in a big little city. Many homeless downtown. They have been, ridiculed,starving, addicted, begging, some beaten,raped in full view if these are not vulnerabilities I dont know what. I help with whatever I have which sometimes is a few dollars. We also make lunches for them. Give food. But it's so sad. Most homeless are veterans. ",
            "date": "Answered April 27, 2019",
            "views": "26",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Ian Williams",
                "href": "/profile/Ian-Williams-93"
            },
            "answer_text": "This is a stupid question, and I'm getting sick of seeing questions like this in my feed. If someone is homeless, they are homeless, simple as that. ",
            "date": "Answered May 1, 2019",
            "views": "129",
            "upvotes": " View 2 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Mary Lou",
                    "user_href": "/profile/Mary-Lou-153"
                },
                {
                    "user_id": "Linda Eustice",
                    "user_href": "/profile/Linda-Eustice"
                }
            ]
        },
        {
            "author_info": {
                "name": "Anna Shannon",
                "href": "/profile/Anna-Shannon-3"
            },
            "answer_text": "No, there’s no other homeless people in other countries and yes all the homeless people you see are ALL prentending because.. well why not??? ; ) ",
            "date": "Answered November 4, 2018",
            "views": "16",
            "upvotes": " Answer requested by Angelita Seidler"
        },
        {
            "author_info": {
                "name": "Felix Kubin",
                "href": "/profile/Felix-Kubin"
            },
            "answer_text": "A lot of them lives in their cars, sometimes in friends houses, sometimes in hotels, and just a very few lives on the streets directly. It means, when we see a thousands who sleep on the streets, there are few times more who lives all around with no stable situation. ",
            "date": "Answered April 2, 2017",
            "views": "234",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "T.L. Brink",
                "href": "/profile/T-L-Brink"
            },
            "answer_text": "Extremely. Physical disorders include dermatological (e.g., abrasions, exposure) and contact with pathogens and infections. The lack of sleep exacerbates psychiatric disorders. The greatest vulnerability is to predators, especially of the human species. ",
            "date": "Answered April 27, 2019",
            "views": "25",
            "upvotes": "0"
        }
    ]
}