{
    "title": "Are there any publishers friendly to LGBT authors? - Quora",
    "tags": [
        "Friendly",
        "Publishers",
        "LGBTQ Issues",
        "Homosexuality",
        "LGBTQ"
    ],
    "response": [
        {
            "author_info": {
                "name": "Kelly Kinkade",
                "href": "/profile/Kelly-Kinkade-1"
            },
            "answer_text": "It depends what you mean by \"friendly\".  If you mean publishers who won't reject you manuscript because you're LGBT, that describes pretty much the entire field of publication houses other that those that specifically cater to religiously or politically conservative authors and readers.  If you mean publishers who will be more inclined to accept your manuscript for publication because you are LGBT, there are still a few of those around, but they are rapidly losing relevance because the mainstream publication industry, for the most part, really doesn't care if the authors they deal with are LGBT or not. If you are looking to publish LGBT-themed works, that's a bit harder. That is a niche market and there are not many publishers willing to front for works that they don't see as having a good chance of recovering the publication and promotional expenses. You can probably find publishers, but you'll have to look a bit harder to find them. I've heard of a few names for the science fiction area, but I don't remember them at the moment, and even that's become less relevant since Tom Doherty and the gang at TOR (itself a Macmillan imprint) have become fairly willing to publish SF and fantasy with LGBT themes of late. Hell, I qualify as LGBT and I find that most of the LGBT themed works out there are dreck that you couldn't pay me to read. I'd rather read back issues of Industrial Engineering Quarterly than most of the LGBT themed fiction I've had the misfortune to have inflicted on me. ",
            "date": "Answered November 13, 2015",
            "views": "799",
            "upvotes": " View 5 Upvoters",
            "upvoters": [
                {
                    "user_id": "Kencana Maria",
                    "user_href": "/profile/Kencana-Maria"
                },
                {
                    "user_id": "Pedro Henrique Bernardinelli",
                    "user_href": "/profile/Pedro-Henrique-Bernardinelli"
                },
                {
                    "user_id": "Esteban Madrigal",
                    "user_href": "/profile/Esteban-Madrigal"
                },
                {
                    "user_id": "Tony Li",
                    "user_href": "/profile/Tony-Li-19"
                },
                {
                    "user_id": "Barry Rountree",
                    "user_href": "/profile/Barry-Rountree"
                }
            ]
        },
        {
            "author_info": {
                "name": "Erica Friedman",
                "href": "/profile/Erica-Friedman"
            },
            "answer_text": "There are many LGBTQ-friendly publishers. There are even publishers who specialize in LGBTQ books. More than you can count on both hands and toes. ^_^ To find them, start by looking up your country and  gay (or lesbian) and publisher, \"gay novels,\" LGBTQ fiction\" and a other keyword/phrase searches designed to hone in on your area of interest. Bookmark the ones that seem to intersect with what you are looking for. If you want to be published, visit the publisher sites and read their pages around submissions and pitches. Look the publishers up online and see what people say about pitching to them. Check out their books, look for their editors online. Follow them, read what they say about slush piles, talk to them about their craft, find out what they want to see. See if any of them are going to be at events in your area, and go talk them face to face.  Read some books by that publisher, get to know what they are looking for. Find author's pages, they often do blogs about their work. And while you're doing all this, you better be writing. None of this is difficult and if you hope to be a writer it is part of your work. If you're just looking for books to read, that first step will net you loads of suggestions. You'll notice I don't actually mention any publishers. I can think of a dozen off the top of my head, including several major publishing houses that publish LGBTQ stuff in their larger catalogs, but none of them will be useful to you, you need to do your research and find out who is publishing what you want to write/read. Have fun...there's a world of stuff out there! ",
            "date": "Updated December 8, 2015",
            "views": "967",
            "upvotes": " View 12 Upvoters",
            "upvoters": [
                {
                    "user_id": "Pat Brown",
                    "user_href": "/profile/Pat-Brown-10"
                },
                {
                    "user_id": "Ellis Alberti",
                    "user_href": "/profile/Ellis-Alberti"
                },
                {
                    "user_id": "Kencana Maria",
                    "user_href": "/profile/Kencana-Maria"
                },
                {
                    "user_id": "Camille Angel",
                    "user_href": "/profile/Camille-Angel"
                },
                {
                    "user_id": "Dan Holliday",
                    "user_href": "/profile/Dan-Holliday"
                },
                {
                    "user_id": "Josh Gonik",
                    "user_href": "/profile/Josh-Gonik"
                },
                {
                    "user_id": "Heinrich Müller",
                    "user_href": "/profile/Heinrich-Müller"
                },
                {
                    "user_id": "Jagir Jhaveri",
                    "user_href": "/profile/Jagir-Jhaveri"
                },
                {
                    "user_id": "Debra Klopfenstein",
                    "user_href": "/profile/Debra-Klopfenstein"
                },
                {
                    "user_id": "Mithil Kamble",
                    "user_href": "/profile/Mithil-Kamble"
                },
                {
                    "user_id": "Miguel Valdespino",
                    "user_href": "/profile/Miguel-Valdespino"
                },
                {
                    "user_id": "Leah Diane",
                    "user_href": "/profile/Leah-Diane"
                }
            ]
        }
    ]
}