{
    "title": "Are frequent novels releases more profitable for the modern ebook authors than novels? - Quora",
    "tags": [
        "Book Publishing",
        "Publishing",
        "eBooks",
        "Novels",
        "Writers and Authors"
    ],
    "response": [
        {
            "author_info": {
                "name": "Lisa Oliver",
                "href": "/profile/Lisa-Oliver-84"
            },
            "answer_text": "Hello Domo, For self-published authors, I do think so, and as Rebecca noted, also especially in the romance genre. Romance readers are very loyal and will read almost any book from an author they enjoy. But there is so much competition in that genre, that if an author takes too long between books, especially if they are writing a series, then the readers can lose interest. I currently write I think it is seven series, and I put a new release out almost every month. Even then, I get readers who enjoy one specific series more than the others writing to me in the months between releases for that series, asking when their favorite is coming out. My goal for 2019 is to have less series lol. I always suggest to new writers who have planned a series to write the first two books before publishing the first - I know some authors recommend writing the whole series first. But if you want to keep your reader’s interest, then you don’t want to leave it too long between release dates. ",
            "date": "Answered October 20, 2018",
            "views": "142",
            "upvotes": " View 4 Upvoters ",
            "upvoters": [
                {
                    "user_id": "M. Vincent Holguin",
                    "user_href": "/profile/M-Vincent-Holguin"
                },
                {
                    "user_id": "Daniel O'Neil",
                    "user_href": "/profile/Daniel-ONeil-27"
                },
                {
                    "user_id": "Jim Byrom",
                    "user_href": "/profile/Jim-Byrom"
                },
                {
                    "user_id": "Thomas P. Buehner",
                    "user_href": "/profile/Thomas-P-Buehner"
                }
            ]
        },
        {
            "author_info": {
                "name": "Falcon Storm",
                "href": "/profile/Falcon-Storm-1"
            },
            "answer_text": "Generally speaking, no. Just like authors look for ROI when doing their marketing, readers look for ROI in their book buying habits. You can build a catalog very quickly with rapid-fire novella releases, but then the question is, why not just write a novel? And a large backlist really doesn’t mean much if you can’t convert your readers and convince them to buy all those novellas. There are ways to sell novellas, but it’s much easier and cheaper to sell fewer novels rather than trying to sell a huge list of novellas. ",
            "date": "Answered October 21, 2018",
            "views": "124",
            "upvotes": " Answer requested by Daniel O'Neil",
            "upvoters": [
                {
                    "user_id": "கோஸ்ட் லவர்",
                    "user_href": "/profile/கோஸ்ட்-லவர்"
                }
            ]
        },
        {
            "author_info": {
                "name": "Paul Austin Ardoin",
                "href": "/profile/Paul-Austin-Ardoin"
            },
            "answer_text": "There are some authors—Hugh Howey, and the writing duo of Johnny B Truant and Sean Platt come to mind—who have found a lot of success by writing episodic (and frequent) novellas. However, it looks like the majority of self-published authors make more money from novels in series than novellas in series, no matter how rapidly published. I looked at a web tool that searches Amazon for estimates of sales, and it looks to me like novels are more lucrative in general, although I caution that the tool estimates earnings, so it could be wrong. ",
            "date": "Answered October 22, 2018",
            "views": "108",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Claire Youmans",
                "href": "/profile/Claire-Youmans"
            },
            "answer_text": "I prefer novels and won’t buy novellas. I use shorts as freebies for my list, and I will likely collect them into a book someday. But I find novellas just too short. ",
            "date": "Answered October 20, 2018",
            "views": "29",
            "upvotes": " View 1 Upvoter"
        }
    ]
}