{
    "title": "Are homeless shelters an effective way to help the homeless? - Quora",
    "tags": [
        "Effectiveness",
        "Homeless Shelters",
        "Homelessness",
        "Philosophy of Everyday Life",
        "Life and Living"
    ],
    "response": [
        {
            "author_info": {
                "name": "Amy Witt",
                "href": "/profile/Amy-Witt"
            },
            "answer_text": "Homeless shelters all provide for immediate needs of shelter and often food, but there is a huge range of long-term effectiveness. I think The Bridge in Dallas, TX is an excellent model of an effective homeless shelter and services provider. They have temporary shelter, which consists of mats in a large indoor pavilion and is available nightly to all who are homeless, including those who are physically or mentally disabled, drunk, high, and/or have criminal records - people who are often turned away from other homeless shelters. Thanks to a security team and a well-run system of checking and issuing IDs, they hardly ever have security issues, which are usually just small fights that are quickly stopped. The Bridge also has a kennel for pets, as some homeless people will not stay in shelters if it means leaving their pets. What I believe is crucial are transitional housing and incentives for homeless people to become self-sufficient and no longer dependent on the homeless shelter. Transitional housing at The Bridge is much nicer than the temporary shelter, and to keep their room, each guest must regularly meet with their Care Manager, assigned once they are accepted to transitional housing. The Care Managers monitor the guests' job readiness and help them deal with addictions and other problems. With their Care Managers' approval, guests can use the computer lab to search for jobs and prepare their resumes. Those who are unable to become self-sufficient due to physical or mental disability can be admitted to Permanent Supportive Housing. But the majority are able to find jobs that can support rent and other living expenses and move beyond the homeless shelter. This should be the goal of homeless shelters: to be no longer needed by homeless people they have assisted so they can continue to help others. ",
            "date": "Answered July 29, 2011",
            "views": "33",
            "upvotes": " View 35 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Dinah Cox",
                    "user_href": "/profile/Dinah-Cox"
                },
                {
                    "user_id": "Laura Wrzeski",
                    "user_href": "/profile/Laura-Wrzeski"
                },
                {
                    "user_id": "Alice Folk",
                    "user_href": "/profile/Alice-Folk"
                },
                {
                    "user_id": "Cindy Hu",
                    "user_href": "/profile/Cindy-Hu-55"
                },
                {
                    "user_id": "Kathy White",
                    "user_href": "/profile/Kathy-White-123"
                },
                {
                    "user_id": "Jessie TeWinkel",
                    "user_href": "/profile/Jessie-TeWinkel"
                },
                {
                    "user_id": "Brenda Eiland",
                    "user_href": "/profile/Brenda-Eiland-1"
                },
                {
                    "user_id": "Darla Olson",
                    "user_href": "/profile/Darla-Olson-4"
                },
                {
                    "user_id": "Anzhela Nishanova",
                    "user_href": "/profile/Anzhela-Nishanova"
                },
                {
                    "user_id": "Sus Tae",
                    "user_href": "/profile/Sus-Tae"
                },
                {
                    "user_id": "Kelli Mistry",
                    "user_href": "/profile/Kelli-Mistry"
                },
                {
                    "user_id": "Danielle Kullman",
                    "user_href": "/profile/Danielle-Kullman"
                },
                {
                    "user_id": "Marco Patino",
                    "user_href": "/profile/Marco-Patino"
                },
                {
                    "user_id": "Herbert Clark",
                    "user_href": "/profile/Herbert-Clark"
                },
                {
                    "user_id": "Steven Faltenovich",
                    "user_href": "/profile/Steven-Faltenovich"
                },
                {
                    "user_id": "Ace Grushkin",
                    "user_href": "/profile/Ace-Grushkin-1"
                },
                {
                    "user_id": "Philippa Mayall",
                    "user_href": "/profile/Philippa-Mayall"
                },
                {
                    "user_id": "Caroline Zeller",
                    "user_href": "/profile/Caroline-Zeller-2"
                },
                {
                    "user_id": "Adora Myers",
                    "user_href": "/profile/Adora-Myers"
                },
                {
                    "user_id": "Gayla Stahl",
                    "user_href": "/profile/Gayla-Stahl"
                },
                {
                    "user_id": "Janet Davis",
                    "user_href": "/profile/Janet-Davis-12"
                },
                {
                    "user_id": "Derek Weiss",
                    "user_href": "/profile/Derek-Weiss"
                },
                {
                    "user_id": "Kevia Jackson",
                    "user_href": "/profile/Kevia-Jackson"
                },
                {
                    "user_id": "Josef Winniger",
                    "user_href": "/profile/Josef-Winniger"
                },
                {
                    "user_id": "Stephanie Sobottke",
                    "user_href": "/profile/Stephanie-Sobottke"
                },
                {
                    "user_id": "Nabeel Qureshi",
                    "user_href": "/profile/Nabeel-Qureshi"
                },
                {
                    "user_id": "Nancy Huang",
                    "user_href": "/profile/Nancy-Huang-3"
                },
                {
                    "user_id": "William Zachary Wood",
                    "user_href": "/profile/William-Zachary-Wood"
                },
                {
                    "user_id": "Coleman Foley",
                    "user_href": "/profile/Coleman-Foley"
                },
                {
                    "user_id": "AJ Minich",
                    "user_href": "/profile/AJ-Minich"
                },
                {
                    "user_id": "Jamie Turley",
                    "user_href": "/profile/Jamie-Turley"
                },
                {
                    "user_id": "Nathan Ketsdever",
                    "user_href": "/profile/Nathan-Ketsdever"
                },
                {
                    "user_id": "Marc Bodnick",
                    "user_href": "/profile/Marc-Bodnick"
                },
                {
                    "user_id": "Will Loubier",
                    "user_href": "/profile/Will-Loubier"
                },
                {
                    "user_id": "Kat Li",
                    "user_href": "/profile/Kat-Li"
                }
            ]
        },
        {
            "author_info": {
                "name": "Jeff Ward",
                "href": "/profile/Jeff-Ward-40"
            },
            "answer_text": "Here’s the first thing I would say - When we discuss “the homeless” that’s a very broad group of people. Some people have been homeless for many years (“chronic homeless”). Some people for a short time (maybe they lost their job, had a medical emergency, etc). Some homeless are highly educated and some are struggling with mental health issues. So, one thing we need to be careful of is treating the entire bucket of “homeless” all the same and approaching the issue with one-size-fits-all approach. But to your question, yes, there are homeless shelters that do a pretty good job of meeting the immediate need of homelessness. Here in Dallas, we have about 3–4,000 homeless on a given night. The reality is that a large percentage of homeless on the streets are struggling with mental illness or drug addiction and do not take advantage of the shelters that are available. Some do not like the structure or accountability that shelters provide, and choose the dangerous option of staying on the streets. The best shelters are those that take the time to get to know the people they are serving and address the root causes of that particular person’s homelessness and provide holistic support - mental health, recovery, financial/job readiness - and because I personally believe that heart transformation must accompany every intervention, faith-based systems provide the most helpful response. Here in Dallas, Union Gospel Mission, OurCalling (which has an amazing free app that you can download with all the resources across the city), and Dallas Life Foundation are a few. 45% of homes in Dallas are asset poor, meaning that they are one job loss, one medical emergency, or financial emergency away from dipping below the poverty line. Others that I have met, are released from prison, but don’t have safety net of friends and family - and also have a criminal record that makes it very difficult to find employment. That means, many people are homeless temporarily as they seek housing and work. I love working with this group - they understand the value of work, the impact of their choices, and are ready to make the changes necessary to better their lives. For these folks, they tell me time and again, that they do not want “free food” and “free clothes” (which while well intentioned can be de-valuing and degrading). Rather, they are simply looking for someone to build a relationship with and help them find work. Our church works with homeless by building relationships, discipleship, financial literacy training, medical care, and job creation/matching. We believe that all people are created in God’s image and have inherent dignity, value, and worth, and work to empower people to be all that God intended. If you’d like to read some excellent books on this, I would highly recommend “When Helping Hurts” by Brian Fikkert and Steve Corbett and “Toxic Charity” by Bob Lupton. I have also done some speaking and blog posts on how to handle the “man on the corner” - do we give money to panhandlers and what is the best way to approach that situation - if you’re interested. Thanks for the terrific question! ",
            "date": "Answered August 7, 2016",
            "views": "13",
            "upvotes": " View 16 Upvoters",
            "upvoters": [
                {
                    "user_id": "Rico A. Snovez",
                    "user_href": "/profile/Rico-A-Snovez"
                },
                {
                    "user_id": "Loweta Carroll",
                    "user_href": "/profile/Loweta-Carroll"
                },
                {
                    "user_id": "David Reggimenti",
                    "user_href": "/profile/David-Reggimenti"
                },
                {
                    "user_id": "Daniel Grund",
                    "user_href": "/profile/Daniel-Grund-1"
                },
                {
                    "user_id": "Amanda Cardenas",
                    "user_href": "/profile/Amanda-Cardenas-6"
                },
                {
                    "user_id": "Rebecca J Lee",
                    "user_href": "/profile/Rebecca-J-Lee"
                },
                {
                    "user_id": "Jessie TeWinkel",
                    "user_href": "/profile/Jessie-TeWinkel"
                },
                {
                    "user_id": "Brenda Eiland",
                    "user_href": "/profile/Brenda-Eiland-1"
                },
                {
                    "user_id": "Anzhela Nishanova",
                    "user_href": "/profile/Anzhela-Nishanova"
                },
                {
                    "user_id": "Sherman Cline",
                    "user_href": "/profile/Sherman-Cline"
                },
                {
                    "user_id": "Danielle Kullman",
                    "user_href": "/profile/Danielle-Kullman"
                },
                {
                    "user_id": "Sonia Williams",
                    "user_href": "/profile/Sonia-Williams-38"
                },
                {
                    "user_id": "Philippa Mayall",
                    "user_href": "/profile/Philippa-Mayall"
                },
                {
                    "user_id": "Adora Myers",
                    "user_href": "/profile/Adora-Myers"
                },
                {
                    "user_id": "Jay Kreusch",
                    "user_href": "/profile/Jay-Kreusch"
                },
                {
                    "user_id": "Gayla Stahl",
                    "user_href": "/profile/Gayla-Stahl"
                }
            ]
        },
        {
            "author_info": {
                "name": "Derek Book",
                "href": "/profile/Derek-Book-1"
            },
            "answer_text": "The basic concept of shelters is helpful: Give somebody a resource (a roof for a period of time) and see if they can turn things around for themselves. This really works when the homelessness is caused by economic factors alone. Heck, those people usually just sleep in their cars until they can save enough to rent again. However, what purpose does it serve to temporarily shelter people with long term difficulties like mental health issues, addiction, etc? The shelter I worked at used to shelter people for a week, and then kick them out for the rest of the month. Shelters by definition need to be temporary, but inconsistent help is probably the worst thing you can do for somebody with mental health issues. Shelters are like bandages, and while you need them to stop the bleeding, you also need to get to the source of the bleeding at some point. The “Housing First” method beats all others in terms of success-- nevermind the shelter, take those funds and get people housed immediately with support. It is so much cheaper, more dignified, and simply more effective. I know we prefer to herd homeless people like cattle and have them line up at cafeteria-type places for 3 meals each day. We are comfortable with these institutions. Yet, people sink miserably under these conditions, and millions are stuck in this endless cycle. Forget shelters, put your money into housing and support networks. ",
            "date": "Answered March 5, 2018",
            "views": "16",
            "upvotes": " View 27 Upvoters ",
            "upvoters": [
                {
                    "user_id": "David Reggimenti",
                    "user_href": "/profile/David-Reggimenti"
                },
                {
                    "user_id": "John Glenn",
                    "user_href": "/profile/John-Glenn-56"
                },
                {
                    "user_id": "Gina Illcitesam",
                    "user_href": "/profile/Gina-Illcitesam"
                },
                {
                    "user_id": "Jessie TeWinkel",
                    "user_href": "/profile/Jessie-TeWinkel"
                },
                {
                    "user_id": "Alexander Thegreat",
                    "user_href": "/profile/Alexander-Thegreat-12"
                },
                {
                    "user_id": "Donna Mae Baukat",
                    "user_href": "/profile/Donna-Mae-Baukat"
                },
                {
                    "user_id": "Catherine Freed",
                    "user_href": "/profile/Catherine-Freed-1"
                },
                {
                    "user_id": "Jerry Chrane-Shafer",
                    "user_href": "/profile/Jerry-Chrane-Shafer"
                },
                {
                    "user_id": "Kathryn Hedges",
                    "user_href": "/profile/Kathryn-Hedges-1"
                },
                {
                    "user_id": "Margaret Ruth",
                    "user_href": "/profile/Margaret-Ruth"
                },
                {
                    "user_id": "Joy Ciccketti Augevich",
                    "user_href": "/profile/Joy-Ciccketti-Augevich"
                },
                {
                    "user_id": "Daniel Svitek",
                    "user_href": "/profile/Daniel-Svitek"
                },
                {
                    "user_id": "Brienn Boyd",
                    "user_href": "/profile/Brienn-Boyd"
                },
                {
                    "user_id": "Moe Uraijah",
                    "user_href": "/profile/Moe-Uraijah"
                },
                {
                    "user_id": "Liam N. O' Ceallaigh",
                    "user_href": "/profile/Liam-N-O-Ceallaigh"
                },
                {
                    "user_id": "Aaron Bludworth",
                    "user_href": "/profile/Aaron-Bludworth"
                },
                {
                    "user_id": "Cat Volz",
                    "user_href": "/profile/Cat-Volz"
                },
                {
                    "user_id": "Stephanie Jackson",
                    "user_href": "/profile/Stephanie-Jackson-129"
                },
                {
                    "user_id": "Byron Reyna",
                    "user_href": "/profile/Byron-Reyna"
                },
                {
                    "user_id": "Robert Walker",
                    "user_href": "/profile/Robert-Walker-213"
                },
                {
                    "user_id": "Cynthia Coleman",
                    "user_href": "/profile/Cynthia-Coleman-1"
                },
                {
                    "user_id": "Barbara Hallanger",
                    "user_href": "/profile/Barbara-Hallanger"
                },
                {
                    "user_id": "Robin Porter",
                    "user_href": "/profile/Robin-Porter-4"
                },
                {
                    "user_id": "Gus Prieto",
                    "user_href": "/profile/Gus-Prieto-1"
                },
                {
                    "user_id": "Tiffany McLeod",
                    "user_href": "/profile/Tiffany-McLeod-4"
                },
                {
                    "user_id": "Helen Kram Ball",
                    "user_href": "/profile/Helen-Kram-Ball"
                },
                {
                    "user_id": "Terrence Yang",
                    "user_href": "/profile/Terrence-Yang-4"
                }
            ]
        },
        {
            "author_info": {
                "name": "Karen Lococo",
                "href": "/profile/Karen-Lococo"
            },
            "answer_text": "Shelters are effective in meeting basic needs of shelter, usually a meal and a shower. Caseworkers can assist in linking to other supports or identifying housing options. They are (in the USA) one of the entry points to begin documenting eligibility for federal and state housing options. In the winter, they keep people alive. Since I have moved to Australia and working in homeless services here (as I did at home) I have had many people question me about shelters with a preconceived opinion that in the USA we are warehousing people experiencing homelessness. I have to explain the differences between the system here and the one at home—mainly that the safety net here in Australia is much more robust than the nonexistent one in the USA. Here, people who are not disabled are able to collect Newstart even if they are able to work. Theoretically they should be searching for employment but it doesn’t always happen that way. Anyway, here they go into shared rooming house facilities and pay a portion of their income as rent—because they can. Both systems have their uses but at the end of the day are merely bandaids. They are options that are costly to taxpayers and are not really sustainable long term. People who experience long term homelessness deal with traumatic events often, their lives are hard—maybe using alcohol or other drugs, some with physical disabilities or mental health issues. This leads to increased use of emergency services, hospitals, court, prisons etc. To really make a difference the resources would be better spent on increasing permanent housing options. Research has shown that it costs less to get people into housing than to maintain them in the shelter/crisis system. And most importantly, I will never understand why in some of the wealthiest nations in the world, people are denied essentials of basic living. It makes me sick and I have been in this field for years. ",
            "date": "Answered March 8, 2018",
            "views": "937",
            "upvotes": " View 11 Upvoters",
            "upvoters": [
                {
                    "user_id": "Bemnet Gizachew",
                    "user_href": "/profile/Bemnet-Gizachew-1"
                },
                {
                    "user_id": "Katherine Anderson",
                    "user_href": "/profile/Katherine-Anderson-158"
                },
                {
                    "user_id": "Christopher Montgomery",
                    "user_href": "/profile/Christopher-Montgomery-48"
                },
                {
                    "user_id": "Darla Olson",
                    "user_href": "/profile/Darla-Olson-4"
                },
                {
                    "user_id": "James Menneg",
                    "user_href": "/profile/James-Menneg"
                },
                {
                    "user_id": "Anzhela Nishanova",
                    "user_href": "/profile/Anzhela-Nishanova"
                },
                {
                    "user_id": "Jerry Chrane-Shafer",
                    "user_href": "/profile/Jerry-Chrane-Shafer"
                },
                {
                    "user_id": "Kathryn Hedges",
                    "user_href": "/profile/Kathryn-Hedges-1"
                },
                {
                    "user_id": "Jenna Peacock Moore",
                    "user_href": "/profile/Jenna-Peacock-Moore"
                },
                {
                    "user_id": "Liam N. O' Ceallaigh",
                    "user_href": "/profile/Liam-N-O-Ceallaigh"
                },
                {
                    "user_id": "Helen Kram Ball",
                    "user_href": "/profile/Helen-Kram-Ball"
                }
            ]
        },
        {
            "author_info": {
                "name": "Damien Sawyer",
                "href": "/profile/Damien-Sawyer-1"
            },
            "answer_text": "I think that a homeless shelter is just a shelter. Either you can plan to migrate between shelters, or you can make plans to leave shelters for good. Until recently, I stayed away from shelters because I know their reputation. They usually harbor filth, unsavory people with bad hygiene and morals. They steal and gossip. I think that the ones who have never had to contemplate living at a shelter are sometimes worse off, too, because they have people to trust that haven’t let them down too far just yet. If you are just trying to cook some food or have a hot meal they are fine. It’s actually an adventure to figure out how to clean your clothes, shower, and dress while living at a shelter. If you are disorganized it’ll be costly because, for example, the first week I stayed in a shelter I was reassigned a different bed three times in one night. It’s hard to get sleep at a shelter and the entire lifestyle that you would have is somewhat debilitating if you have a very physical job, because you won’t have that much sleep and you have to depend a lot on your own performance in order to be able to leave. Also, privacy can be had, but only at shelters where you only have maybe just one roommate. Because of this, sexual urges can be very difficult to control. It’s basically jail without so much control, better food, and slightly better furnishings. A piece of advice would be to find a shelter that serves the youth because usually they are much better organized and operated. The effectiveness would depend on how long it is before you are forced to return to a shelter. ",
            "date": "Answered December 27, 2017",
            "views": "388",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Jessie TeWinkel",
                    "user_href": "/profile/Jessie-TeWinkel"
                },
                {
                    "user_id": "Kathryn Hedges",
                    "user_href": "/profile/Kathryn-Hedges-1"
                },
                {
                    "user_id": "Inci Arkan",
                    "user_href": "/profile/Inci-Arkan"
                }
            ]
        },
        {
            "author_info": {
                "name": "Jon Mixon",
                "href": "/profile/Jon-Mixon-1"
            },
            "answer_text": "If they are properly run and managed, they can be. They can provide transitional housing for people who are experiencing financial difficulties, they can assist in getting the mentally ill in touch with services for their conditions and they can assist in finding people jobs. Where they fail, in my experience, is they provide a crutch for people who are unwilling to seek  treatment for the substance abuse and personal conduct issues that have caused, or are causing, their homelessness. They also lack security in many areas and are unable to protect their residents from victimization. More cities should create  homeless policies to deal with their homelessness situations and should ensure that all of their facilities are run in a professional manner and according to a stringent set of regulations. This would likely make more shelters become effective resources for the homeless. ",
            "date": "Updated March 17, 2013",
            "views": "72",
            "upvotes": " View 12 Upvoters",
            "upvoters": [
                {
                    "user_id": "Dicle Kırmızıoğlu",
                    "user_href": "/profile/Dicle-Kırmızıoğlu"
                },
                {
                    "user_id": "Jerry Chrane-Shafer",
                    "user_href": "/profile/Jerry-Chrane-Shafer"
                },
                {
                    "user_id": "Philippa Mayall",
                    "user_href": "/profile/Philippa-Mayall"
                },
                {
                    "user_id": "Adora Myers",
                    "user_href": "/profile/Adora-Myers"
                },
                {
                    "user_id": "Gayla Stahl",
                    "user_href": "/profile/Gayla-Stahl"
                },
                {
                    "user_id": "Dylan Brumley",
                    "user_href": "/profile/Dylan-Brumley"
                },
                {
                    "user_id": "Martijn Sjoorda",
                    "user_href": "/profile/Martijn-Sjoorda"
                },
                {
                    "user_id": "Jaspal Singh",
                    "user_href": "/profile/Jaspal-Singh-15"
                },
                {
                    "user_id": "James H. Kelly",
                    "user_href": "/profile/James-H-Kelly"
                },
                {
                    "user_id": "Anirudh Joshi",
                    "user_href": "/profile/Anirudh-Joshi"
                },
                {
                    "user_id": "Matt Brenner",
                    "user_href": "/profile/Matt-Brenner-3"
                },
                {
                    "user_id": "Coleman Foley",
                    "user_href": "/profile/Coleman-Foley"
                }
            ]
        },
        {
            "author_info": {
                "name": "Todd Murphy",
                "href": "/profile/Todd-Murphy-10"
            },
            "answer_text": "No. They are fraught with latent tuberculosis (a non-communicable form of TB, with a full range of respiratory symptoms), and have no privacy or any place to store possessions, so they can’t look for work without showing up with a backpack. That will kill their chances for employment. They’re also loud at night, with snoring and gurgling coughs from older ‘guests’. The overall feeling about shelters among the homeless is that they’re humiliating. Most homeless don’t go to shelters, so you can’t help them by making more of them. They need humane housing, no matter how small the units might be. Note: Symptoms of latent TB include: a cough (beginning dry and progressive to productive with possible blood in the sputum)flu-like symptoms.fever.night sweats.weight loss.fatigue.other symptoms such as chest pain, shortness of breath etc.SOURCE",
            "date": "Updated September 14, 2018",
            "views": "408",
            "upvotes": " View 10 Upvoters",
            "upvoters": [
                {
                    "user_id": "Lynn Granata",
                    "user_href": "/profile/Lynn-Granata-7"
                },
                {
                    "user_id": "Dawn Scopel",
                    "user_href": "/profile/Dawn-Scopel"
                },
                {
                    "user_id": "Kathryn Hedges",
                    "user_href": "/profile/Kathryn-Hedges-1"
                },
                {
                    "user_id": "Art Davies",
                    "user_href": "/profile/Art-Davies"
                },
                {
                    "user_id": "Kan Pam",
                    "user_href": "/profile/Kan-Pam-1"
                },
                {
                    "user_id": "Seth Benton",
                    "user_href": "/profile/Seth-Benton"
                },
                {
                    "user_id": "Bethany Sewell",
                    "user_href": "/profile/Bethany-Sewell-1"
                },
                {
                    "user_id": "Lisa Emard",
                    "user_href": "/profile/Lisa-Emard"
                },
                {
                    "user_id": "Jim Tatar",
                    "user_href": "/profile/Jim-Tatar"
                },
                {
                    "user_id": "Angele Roy",
                    "user_href": "/profile/Angele-Roy"
                }
            ]
        },
        {
            "author_info": {
                "name": "Ben Baert",
                "href": "/profile/Ben-Baert"
            },
            "answer_text": "They are effective in the sense that they provide immediate relief from many of the threats that homelessness can present, such as exposure to the elements, violence, and a lack of medical care. Their long-term effectiveness, in itself, is rather limited. They can provide a basis for a long-term plan, but unless there are other facilities, such as counseling, legal advice, and access to social services, very little will actually be done to truly improve their situation long-term. In conclusion, there is without a doubt a role for shelters, and they are part of an effective plan to tackle homelessness, but other facilities are required to truly help homeless people. ",
            "date": "Answered November 16, 2017",
            "views": "306",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Lisa M Byers",
                "href": "/profile/Lisa-M-Byers"
            },
            "answer_text": "They don’t really solve the problem of homelessness, but they do provide important help. Shelters stop people dying of exposure in winter, and most provide food as well as a place to sleep. They have bathrooms, and some offer basic medical care and even washing machines (or a clothes exchange, where people can trade in their dirty clothes for clean ones. The dirty stuff is washed when possible and goes back into circulation) Ironically, many homeless people don’t want to use the shelters that most cities provide because they are afraid to have their stuff stolen. One problem shelters have is that the people who come there WILL steal everything that isn’t nailed down. My church ran a donation drive for our local shelter last year. When asked what was needed (apart from money), they asked us to get soaps, shampoos and toothpaste in miniature packs, because if they left a bottle in the bathroom for everyone to use, the first person would take it, so they switched to giving everybody their own mini items. People would steal pillows and blankets and bedsheets. ",
            "date": "Answered November 14, 2017",
            "views": "400",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Kathryn Hedges",
                    "user_href": "/profile/Kathryn-Hedges-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Nathan Ketsdever",
                "href": "/profile/Nathan-Ketsdever"
            },
            "answer_text": "I visited a rather innovative faith-based homeless shelter in San Fransisco when I visited during a conference last year.  Glide is a:  A radically inclusive, just and loving community mobilized to alleviatesuffering and break the cycles of poverty and marginalization. They focus on four core areas of service to homeless individuals:  Our methodology is radically simple: love, acceptance, and  compassion, which we apply through programs in Wellness, Growth, Spirit,  and Leadership. You can learn more about their innovative model by checking out their various services here: http://www.glide.org/page.aspx?pid=425  ",
            "date": "Answered August 18, 2011",
            "views": "824",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Deborah Higgins",
                    "user_href": "/profile/Deborah-Higgins-9"
                },
                {
                    "user_id": "Gayla Stahl",
                    "user_href": "/profile/Gayla-Stahl"
                },
                {
                    "user_id": "Tom Clark",
                    "user_href": "/profile/Tom-Clark-24"
                }
            ]
        },
        {
            "author_info": {
                "name": "Denise Meehan",
                "href": "/profile/Denise-Meehan-5"
            },
            "answer_text": "They feed them and let them stay in the shelter, they give them clothes, psychological counseling,and try to get them to give up any addiction they may have acquired The shelters get the homeless medical help, if necessary, and look for jobs for them. ",
            "date": "Answered November 11, 2019",
            "views": "29",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Beth Gammon",
                    "user_href": "/profile/Beth-Gammon"
                }
            ]
        },
        {
            "author_info": {
                "name": "Michael Webb",
                "href": "/profile/Michael-Webb-63"
            },
            "answer_text": "Nope. Its like being an intern - they don't provide expected services unless you fly by their rules for about a year. I can accomplish the expected services without them in about 4 days on my own. ",
            "date": "Answered December 29, 2017",
            "views": "11",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Kelli Mistry",
                "href": "/profile/Kelli-Mistry"
            },
            "answer_text": "I believe that Outreach centers that are also shelters are the best way to help the homeless. These type of places offer a hand up not a hand out. ",
            "date": "Answered March 1, 2018",
            "views": "6",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Amy Hayes",
                "href": "/profile/Amy-Hayes-181"
            },
            "answer_text": "For a warm and dry place to sleep yes. But can't get in any because all of the beds are taken by junkies and drunks. ",
            "date": "Answered February 8, 2020",
            "views": "11",
            "upvotes": "0"
        }
    ]
}