{
    "title": "Are there any good tips for comedy script writing? - Quora",
    "tags": [
        "Identifying and Locating Specific Written Texts",
        "Screenwriting",
        "Creative Writing",
        "Comedy",
        "Existence Question"
    ],
    "response": [
        {
            "author_info": {
                "name": "Eli Magers",
                "href": "/profile/Eli-Magers"
            },
            "answer_text": "The only way to determine if you wrote a good comedy script is if you think it's funny. Comedy is too subjective to have an accurate poll of deciding whether something is funny. Because of that, I outlined a few things to keep in mind for writing a comedy script you'd like: 1. Quantity over Quality If you spend all your time and energy on one idea and concept, chances are it's going to be terrible in the eyes of whoever reads it. Not because you're a terrible writer, but because -as I said earlier- comedy is subjective. There is no true way to determine if something is funny or not.  The only way to increase your chances of writing a good comedy script is by writing a lot of comedy scripts.  Names and shows become successful because they create a certain style of comedy that people enjoy. From there, more people, who enjoy this certain style of comedy, will support the names and shows. It all comes back to finding your niche style and creating a lot of products.  Don't be tied to one idea.  2. Write what makes you laugh I actually dislike writing, but I love the value it gives to other people. The only way I enjoy writing is by writing about something I enjoy. The same goes for comedy.  Don't write something you think someone will like, (we already determined it's impossible to do that) but instead write about what you'd like to see or watch.  3. Prove you're a terrible writer Writer and producer Dan Harmon (Community) has a powerful strategy of overcoming writer's block. This strategy is proving that you're a terrible writer. This sounds bad, I know, but hear me out on this one.  When you try to become a terrible writer, you aim for failure. The reason why you write terrible scripts is -often- because you are stuck on writing something that everyone will enjoy. Stop. Don't do that. Aim for failure and you will fall short every time.  Writing something terrible will get you in the mood to write (which can be difficult for some people, like me). This will get ideas flowing in your head and allow you to expand on ideas you think are better. Also, the pressure and hesitation from attempting to write something hilarious will go away.  4. Rewrite your script at least 3 times When you first write something, it's terrible. When you rewrite that one thing, you eliminate 5% of the terrible. When you rewrite that one thing again, you eliminate 10% and so on.  The standard I hold myself to is rewriting something at least 3 times.  Also, don't be afraid to kill your baby. Be honest with yourself. I play the \"hell no/yes\" rule when I rewrite. If I don't love what I wrote, I rewrite it until I do.  Final note I hope this helps you write a good comedy script. I've won a few rewards for making some comedy short films. Nothing fancy by any means. But, these are the writing strategies I use when coming up with ideas or scripts. Keep me posted on your successes! ",
            "date": "Answered May 22, 2015",
            "views": "11",
            "upvotes": " View 8 Upvoters",
            "upvoters": [
                {
                    "user_id": "Brian Willott",
                    "user_href": "/profile/Brian-Willott"
                },
                {
                    "user_id": "Selen A",
                    "user_href": "/profile/Selen-A-2"
                },
                {
                    "user_id": "Fake Fiction",
                    "user_href": "/profile/Fake-Fiction"
                },
                {
                    "user_id": "Kartikeya Anchan",
                    "user_href": "/profile/Kartikeya-Anchan"
                },
                {
                    "user_id": "Badhu Sha",
                    "user_href": "/profile/Badhu-Sha-1"
                },
                {
                    "user_id": "Sumit Das",
                    "user_href": "/profile/Sumit-Das-330"
                },
                {
                    "user_id": "Nitesh Anand",
                    "user_href": "/profile/Nitesh-Anand-12"
                },
                {
                    "user_id": "Khaaksar Fotography",
                    "user_href": "/profile/Khaaksar-Fotography"
                }
            ]
        },
        {
            "author_info": {
                "name": "Jon Meckes",
                "href": "/profile/Jon-Meckes-1"
            },
            "answer_text": "think of funny people you know and mentally cast them as the characters. you will find that facial expressions, body language and gestures, costumes, etc. are as important to comedy as script.  write those into the script.  make funny things happen with the props that characters carry. make your characters caricatures and larger than life.  they should be experts at something truly absurd and unnecessary.  they should have interests that at first seem inconsequential but then later become some all important plot factor, rendering them indispensable. flip that and have a character with a serious interest or skill that is later rendered absurd or unimportant to the plot.  this fool/sage -> sage/fool is excruciating in its irony and helps people laugh at themselves at the same time as feeling kinda bad for laughing.  keeps you on your toes too and helps you from getting to serious. also have a really deep moral implication to the plot but be irreverent about it.  our comedy was called \"McVision\" and it's about veganism, so we ate like 10 boxes of chicken wings during filming.   ",
            "date": "Answered April 5, 2015",
            "views": "724",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Isabelle Barnes",
                "href": "/profile/Isabelle-Barnes-8"
            },
            "answer_text": "Guys, who of you are aware about the comedy script writing at the moment? Well, for those who are not aware about it yet, I have prepared the most important information in this answer and I hope that you will really use it in your work.  So, first of all, I would like all of you just to take a look at this list below: Tina FeyAdam McKayChris RockWill Ferrell.And from now you can easily use the list of these names and to search for some detailed information in google. And also please do remember about the fact that you will need to share all the received information with all the readers on that web page in the comments below. And I hope that you will be satisfied with the result and its level of quality as well as we will. So please enjoy it now. ",
            "date": "Answered October 19, 2018",
            "views": "202",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Sai Bhimaneni",
                "href": "/profile/Sai-Bhimaneni"
            },
            "answer_text": "Hi, There is no different technique or skill to separately describe the writing of comedy script. Writing comedy and in fact any of the core emotions of human is more of intuitional,I say it so because you write what you know and you know by what you read and observe. If you need inspiration, look around you and observe your daily life, you may find something funny and hilarious, and make use of it as a base point for your script or as a sequence in your script. One more thing, watch as many comedy movies as you can, they may also help. As Michelangelo said “ Art is never original, it is always inspired” Cheers. ",
            "date": "Answered August 6, 2017",
            "views": "349",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Pulkit Bhardwaj",
                    "user_href": "/profile/Pulkit-Bhardwaj-14"
                }
            ]
        },
        {
            "author_info": {
                "name": "Jay Robert Baer",
                "href": "/profile/Jay-Robert-Baer"
            },
            "answer_text": "Comedy is a tough one. The old saying it is easier to make someone cry than laugh is no joke. You have to know the ins and outs of screenwriting, character building etc.. Remember every character has to solve a problem. What's your characters problem? is it funny? Will the solution be funny? Screenplay Writing Online & in NYC | WriteYourScreenplay has a class on comdey writing. Good luck. ",
            "date": "Answered August 14, 2014",
            "views": "551",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Rita Evelyn Yanez",
                    "user_href": "/profile/Rita-Evelyn-Yanez"
                },
                {
                    "user_id": "Christine Leigh Langtree",
                    "user_href": "/profile/Christine-Leigh-Langtree"
                }
            ]
        },
        {
            "author_info": {
                "name": "Stan Hayward",
                "href": "/profile/Stan-Hayward-1"
            },
            "answer_text": "Much here on comedy writing Unsorted list.Have fun.MakeMovies DatabaseMake Movies Blog - v2.0 ",
            "date": "Updated November 6, 2014",
            "views": "807",
            "upvotes": " View 6 Upvoters",
            "upvoters": [
                {
                    "user_id": "Dhruvansh Gupta",
                    "user_href": "/profile/Dhruvansh-Gupta"
                },
                {
                    "user_id": "Marci Hafemeister",
                    "user_href": "/profile/Marci-Hafemeister"
                },
                {
                    "user_id": "Karin Buchen",
                    "user_href": "/profile/Karin-Buchen"
                },
                {
                    "user_id": "Rajan Dhaka",
                    "user_href": "/profile/Rajan-Dhaka"
                },
                {
                    "user_id": "Humay Wasim",
                    "user_href": "/profile/Humay-Wasim"
                },
                {
                    "user_id": "Faris Montis",
                    "user_href": "/profile/Faris-Montis"
                }
            ]
        },
        {
            "author_info": {
                "name": "Glenn Charles",
                "href": "/profile/Glenn-Charles-1"
            },
            "answer_text": "Query successful writers and see if they can guide you.  This isn't the place to ask. ",
            "date": "Answered April 5, 2015",
            "views": "113",
            "upvotes": "0"
        }
    ]
}