{
    "title": "Are they interchangeable, 'turn the chair this way', 'turn the chair to this way' and 'turn the chair to face this way'? - Quora",
    "tags": [
        "English Idioms",
        "Learning English",
        "Vocabulary of the English Language",
        "English Grammar"
    ],
    "response": [
        {
            "author_info": {
                "name": "Elizabeth Henderson",
                "href": "/profile/Elizabeth-Henderson-40"
            },
            "answer_text": "You can delete the second variant immediately: we never say “turn it to this way”. The other two may be interchangeable, but it is not absolutely necessary that turning a chair in a particular direction will make it “face” that way. Suppose I have a chair with its back against a wall and its seat facing me. If I move to stand by the wall myself and say, “Turn the chair to face this way”, then of course you will turn it so that its seat is facing me and its side is against the wall. But if I merely say, “Turn the chair this way” you would not be wrong if you turned its back towards me. ",
            "date": "Answered July 22, 2020",
            "views": "16",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Mark Jones",
                "href": "/profile/Mark-Jones-203"
            },
            "answer_text": "They are not interchangeable. The second statement is incorrect, so the comparison applies to the other two. The third, with face, has a single and specific meaning: you are instructing someone to orient the chair. The first sentence can mean the same thing, but it can also be used to show someone how to turn the chair. In this case, the speaker is doing the turning, not the person spoken to. You cannot use the third statement for this meaning. Thanks for the A2A. Enjoy the view from where you put the chair. ",
            "date": "Answered July 19, 2020",
            "views": "29",
            "upvotes": " View 3 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Elizabeth Henderson",
                    "user_href": "/profile/Elizabeth-Henderson-40"
                },
                {
                    "user_id": "Robert Tinker",
                    "user_href": "/profile/Robert-Tinker-9"
                },
                {
                    "user_id": "Hung Ha Manh",
                    "user_href": "/profile/Hung-Ha-Manh"
                }
            ]
        },
        {
            "author_info": {
                "name": "Marc Josloff",
                "href": "/profile/Marc-Josloff"
            },
            "answer_text": "“Turn the chair this way” is fine as is. It has an economy of words! “Turn the chair to face this way” is correct, but clumsy. Better would be “Turn the chair in this direction.” “Turn the chair to this way” is incorrect, but you could say “Turn the chair to face this way.” All correct versions would mean the same thing and be interchangeable. ",
            "date": "Answered July 19, 2020",
            "views": "32",
            "upvotes": " View 2 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Rick Darrow Butler",
                    "user_href": "/profile/Rick-Darrow-Butler"
                },
                {
                    "user_id": "Charles L McClenon",
                    "user_href": "/profile/Charles-L-McClenon"
                }
            ]
        },
        {
            "author_info": {
                "name": "Jeff Modzelewski",
                "href": "/profile/Jeff-Modzelewski-1"
            },
            "answer_text": "One might use your first and third examples interchangeably. The second example would not be said by a native speaker; the inclusion of the preposition “to” makes it sound odd. But, after thinking about it for several minutes, I confess that I cannot say that it is grammatically improper. Perhaps the reason is simply idiomatic - that a preposition is just not used with “turn” + “way.” (The “to” would be fine, for example, in “Turn the chair to the right.”) ",
            "date": "Answered July 20, 2020",
            "views": "19",
            "upvotes": " Answer requested by Hung Ha Manh",
            "upvoters": [
                {
                    "user_id": "Hung Ha Manh",
                    "user_href": "/profile/Hung-Ha-Manh"
                }
            ]
        },
        {
            "author_info": {
                "name": "Leon Glover",
                "href": "/profile/Leon-Glover"
            },
            "answer_text": "They all mean the same thing but it is rare that people would say the second version as the ‘to’ is unnecessary and makes the sentence cumbersome. The first version is the most commonly used, IMO, and the one I would suggest using. 😊 ",
            "date": "Answered July 19, 2020",
            "views": "8",
            "upvotes": " Answer requested by Hung Ha Manh"
        },
        {
            "author_info": {
                "name": "William Keeton",
                "href": "/profile/William-Keeton-9"
            },
            "answer_text": "I would say the two of these that are nearly seamless or interchangeable would be the first: “turn the chair this way” and third: “turn the chair to face this way.” The middle one is not exact in its usage and word placement in a lot of traditional senses. ",
            "date": "Answered July 20, 2020",
            "views": "9",
            "upvotes": " View 1 Upvoter "
        }
    ]
}