{
    "title": "Are Harry Potter novels good for vocabulary development in English? - Quora",
    "tags": [
        "Characters of the Wizarding World",
        "Harry Potter (book series)",
        "Harry Potter (movie series)",
        "Novels",
        "Harry Potter (creative franchise)"
    ],
    "response": [
        {
            "author_info": {
                "name": "Edward Cherlin",
                "href": "/profile/Edward-Cherlin"
            },
            "answer_text": "Reading anything interesting is good for vocabulary development in whatever language. I encountered thousands of new words in the Spanish translations of Harry Potter that I read. It turns out that reading Harry Potter books is good for reducing racism, which is much more consequential. They have many other virtues, too. Watching Harry Potter movies with captions can help illiterate people learn to read. Actually, any movies. Musicals that the audience wants to see multiple times and sing along with have turned out to be the most effective, in a program in India called Same Language Subtitles. You can get a similar effect with some YouTube videos that have captions. ",
            "date": "Answered February 4, 2018",
            "views": "427",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Shreyash Shreekant",
                "href": "/profile/Shreyash-Shreekant"
            },
            "answer_text": "Well, almost all of the western authors, were born with english, whereas us Easterners had to adopt it. Naturally, their ability to craft and write stories, is accompanied with a higher understanding(generally speaking, the Eastern world has never lacked scholars) of English. So, whatever novel you pick up, you will learn from it. But will you enjoy reading it? Now, I would recommend Harry Potter, because by reading it, you will definitely add to your vocabulary and enjoy the book as well. ",
            "date": "Answered May 21, 2019",
            "views": "197",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Aditya Biswas",
                    "user_href": "/profile/Aditya-Biswas-4"
                }
            ]
        }
    ]
}