{
    "title": "Are sentence fragments okay? - Quora",
    "tags": [
        "Sentences (language)",
        "Grammar",
        "English Grammar"
    ],
    "response": [
        {
            "author_info": {
                "name": "Derek McNeil",
                "href": "/profile/Derek-McNeil-3"
            },
            "answer_text": "They can be, depending on the context. Fragments don’t have an complete subject/predicate combination usually required to express a complete thought, but there are some cases in which that is allowed. For one, interjections followed by an exclamation point are not complete sentences in themselves, but aren’t grammatically incorrect. For example, “Darn! I wish I had thought of that!” is perfectly acceptable. Also, when you are directly answering a question, a sentence fragment can often be an acceptable response. It is not necessary to reiterate information contained in the question itself. For example, if you are asked “Where did he go?”, you might answer: “To the store.” You could answer “He went to the store,” but you don’t have to. The preceding question makes it clear who the subject is (‘he’) and what the action was (‘going’). ",
            "date": "Answered December 27, 2019",
            "views": "22",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "George Guthridge",
                "href": "/profile/George-Guthridge"
            },
            "answer_text": "Contrary to the way such things are generally taught, there are three forms — Sentences Minor sentences Fragments The “sense” in sentence does not refer to meaning; to semantics. t refers to syntax; that is, to word-order. Does it sound right? “It landed” is a sentence. Why? Because it sounds like a sentence even though, out of context, we do not know what ‘it’ refers to. A fragment is a group of words that does not sound “natural.” There are two types of minor sentences: Independent - these are groups of words that are not true sentences but can stand on their own. The most obvious are things like Wow! and Hello? There are a host of others. Dependent - these are groups of words that need the previous or next sentence for clarification. For example, notice the difference: I bought a boat for my brother, which was a waste of money. But let’s say that you want more emphasis. You break the sentence into a sentence and a minor sentence: I bought a boat for my brother. Which was a waste of money. Professional writers use minor sentences all the time. But with students, it’s more of an advanced technique. If students do it naturally, fine. But if you teach it, then many students will try using the concept — sometimes with disastrous results. ",
            "date": "Answered December 24, 2019",
            "views": "115",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Chris Whitham",
                "href": "/profile/Chris-Whitham-7"
            },
            "answer_text": "Sure! But it depends on the context, and the type of communication. My initial answer (“Sure!”) is officially a fragment, but due to the context as an answer to a question, it communicates exactly what I want to say - so it is OK. One might call it “an abbreviated sentence” - it is the sentence “Surely sentence fragments are OK!” with the unnecessary parts omitted. In a different context, this would not work. If we met in the street and my first words were “Sure!” or even “Yes; they are”, it would not make sense; it would not communicate anything useful. In formal writing, sentence fragments are not often used - they can seem too ‘slangy’ or colloqial for the style of the text. ",
            "date": "Answered December 24, 2019",
            "views": "21",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Ann Boyer",
                "href": "/profile/Ann-Boyer-10"
            },
            "answer_text": "Whether sentence fragments are “OK” depends on the context. (As usual, in fact as always, so much depends on context.). A sentence fragment can be used for emphasis. Just don't use too many or they will give an uncomfortably ignorant or breathless effect. Unless that’s what you want a fictiional character to be saying. (Last phrase there would be an example.) ",
            "date": "Answered December 24, 2019",
            "views": "10",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Susan Morgan",
                "href": "/profile/Susan-Morgan-11"
            },
            "answer_text": "It depends on the situation. The safest course of action is not using them. However, I would recommend that you study the best writers you can find: people whose work has won major literary awards, for example. As you learn from them, you will gain a better understanding of when and how to break the rules, and you will also see how playing with the rules affects readability. ",
            "date": "Answered December 25, 2019",
            "views": "14",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Carol Seymour",
                "href": "/profile/Carol-Seymour-1"
            },
            "answer_text": "No, sentence fragments are not ok. They blurr the communication flow for the reader. All sentences need a subject and predicate so the reader can get a good understanding on what the author is trying to convey. ",
            "date": "Answered December 24, 2019",
            "views": "42",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Rodney Dowling",
                "href": "/profile/Rodney-Dowling"
            },
            "answer_text": "Generally speaking, they are not because they are not grammatically correct. Use full sentences. However, as an answer to a question you can often use a sentence fragment if it provides the questioner with the information he/she is seeking. How often do you drink coffee? (I drink coffee ) from morning to night. ",
            "date": "Answered December 24, 2019",
            "views": "9",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Nadine Gallo",
                "href": "/profile/Nadine-Gallo"
            },
            "answer_text": "Depends on the context. Conversation is often made up of sentence fragments because that’s how people talk. ",
            "date": "Answered December 24, 2019",
            "views": "6",
            "upvotes": "0"
        }
    ]
}