{
    "title": "As a writer, I feel like my characters are all an aspect of myself and that they are really similar to me. Many people have told me that their characters speak to them. What am I doing wrong? - Quora",
    "tags": [
        "Fiction Writing",
        "Creative Writing",
        "Fictional Characters",
        "Writers and Authors",
        "Writing Advice",
        "Character and Personality",
        "Writing"
    ],
    "response": [
        {
            "author_info": {
                "name": "Dia Stone",
                "href": "/profile/Dia-Stone"
            },
            "answer_text": "You must write the characters personality based on how he/she is presented in the story. It is fine to use some of your very own personality traits, But you must look outside of the box! Look around at people, friends, family write some of their attributes. In writing, Authors must display their talent, and no reader wishes to read a novel that they can not distinguish one character from the other. In writing, each and every character that you are introducing, if possible no similarities.. Example: Mark was a very thrifty man, he worked hard, bought a new car every 2 years, Bought a home at age 28, saved his money so that he could be afforded living the good life.. Sam, barely kept a job, and when he did it lasted only about 3 months! He envied Mark for being able to hold a steady job with a great income. Mark lived a much better life than he.. When the two of them would encounter people that they both knew, they would always remark. You two are so different, and to think that you are brothers.. Your characters must be different in every aspect in order to capture the readers, and not have the same personality traits.. Hope This Helps, Regards, DIA ",
            "date": "Answered June 13, 2020",
            "views": "144",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Zaira Karam",
                    "user_href": "/profile/Zaira-Karam"
                }
            ]
        },
        {
            "author_info": {
                "name": "Sallie Loftin",
                "href": "/profile/Sallie-Loftin-1"
            },
            "answer_text": "You’re not doing anything wrong. Most writers early in their practice have the same sort of characters … OK, there are a few that don’t, but most of us use the closest template we have: ourselves. So don’t really worry about that. Some writers do have characters that speak to them. I do. But that doesn’t mean it’s the only way to do it. I’ve noticed that more “by the seat of their pants” writers do the character speaking to them things than those that plot things out, which includes the characters and their talents/personalities, etc. If you’re not getting that feeling of them talking to you, it’s probably because you already know where you’re going. So, keep up the good work! Best of luck to you! ",
            "date": "Answered June 15, 2020",
            "views": "45",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Zaira Karam",
                    "user_href": "/profile/Zaira-Karam"
                }
            ]
        },
        {
            "author_info": {
                "name": "Ken Farmer",
                "href": "/profile/Ken-Farmer-5"
            },
            "answer_text": "Your characters will never come to life until you lose all awareness of the self. In other words, get the hell out of the way. ‘Nuff said. ",
            "date": "Answered June 13, 2020",
            "views": "46",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Zaira Karam",
                    "user_href": "/profile/Zaira-Karam"
                }
            ]
        },
        {
            "author_info": {
                "name": "Jeremey-Stuart de Fishberg",
                "href": "/profile/Jeremey-Stuart-de-Fishberg-1"
            },
            "answer_text": "What do your readers say ? If your characters work for you, they do. If they don’t, perhaps model your characters’ behaviour and speech patterns after people — or combinations of people — with whom you are familiar. ",
            "date": "Answered June 13, 2020",
            "views": "49",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Zaira Karam",
                    "user_href": "/profile/Zaira-Karam"
                }
            ]
        },
        {
            "author_info": {
                "name": "Srinivas S",
                "href": "/profile/Srinivas-S-297"
            },
            "answer_text": "Yes! It's natural for a writer to have personal bias drawn out of his life experiences. The way he has been brought up in life largerly influences his perception, attitude and outlook in general. This naturally tends to get reflected in his writings or of evolving a character and situational plot in his storyline, unless he is conscious enough to write beyond what he believes in. ",
            "date": "Answered June 13, 2020",
            "views": "132",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Zaira Karam",
                    "user_href": "/profile/Zaira-Karam"
                }
            ]
        },
        {
            "author_info": {
                "name": "Bill Johnson",
                "href": "/profile/Bill-Johnson-31"
            },
            "answer_text": "Give your characters an internal life that is separate and different from yours. Bill ",
            "date": "Answered June 13, 2020",
            "views": "20",
            "upvotes": "0"
        }
    ]
}