{
    "title": "As a PhD student, how much time is needed to read a thesis of 300 pages? - Quora",
    "tags": [
        "Ph.D. Careers",
        "Ph.D. Students"
    ],
    "response": [
        {
            "author_info": {
                "name": "Christopher VanLang",
                "href": "/profile/Christopher-VanLang"
            },
            "answer_text": "Assuming that I was fairly proficient on the subject matter Kristina Kučanda's guesstimate of 3 days sounds pretty accurate.  My advisor went through my 8 chapter thesis of 200 pages at a rate of 2 chapters/day with grammatical revisions. Which means, that he actually read and upstood the subject matter. A 300 page thesis is roughly the length of 4-8 research articles + supplemental information. Furthermore, it is likely to be well written and revised if you're reading a completed thesis and not a draft. Given that I would routinely go through ~3-5 papers a day, going through a 300 page thesis with great detail in a few days sounds reasonably possible if I was forced to do so.  Currently as a peer reviewer, 100 pages a day sounds like a realistic pace (in my field). ",
            "date": "Answered June 9, 2015",
            "views": "17",
            "upvotes": " View 7 Upvoters",
            "upvoters": [
                {
                    "user_id": "Thomas Morton",
                    "user_href": "/profile/Thomas-Morton-5"
                },
                {
                    "user_id": "David Güera",
                    "user_href": "/profile/David-Güera"
                },
                {
                    "user_id": "Jack Yu",
                    "user_href": "/profile/Jack-Yu-1"
                },
                {
                    "user_id": "Alex Suchman",
                    "user_href": "/profile/Alex-Suchman"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/Natalia-Nezvanova"
                },
                {
                    "user_id": "Zach Sekaran",
                    "user_href": "/profile/Zach-Sekaran"
                },
                {
                    "user_id": "Marc Bodnick",
                    "user_href": "/profile/Marc-Bodnick"
                }
            ]
        },
        {
            "author_info": {
                "name": "James Gay",
                "href": "/profile/James-Gay"
            },
            "answer_text": "It really depends on why I'm reading it. It would be very rare that you actually need to read all of a thesis, you might need to read a chapter or two at most. Especially given that the first couple of chapters of a thesis are going to be introductory and you'll probably know all that stuff anyway or could get it from somewhere else more easily. If I wanted to read and get the gist of the proofs in a thesis, maybe a couple of days. A week if I had to translate it from French first (this happens to me more than you'd think). If I just wanted to skim through the theorems, then maybe an hour. If I really wanted to understand it in depth, then it could take between a week and a couple of months, depending on how good my background in that area is. ",
            "date": "Answered May 28, 2015",
            "views": "23",
            "upvotes": " View 19 Upvoters",
            "upvoters": [
                {
                    "user_id": "Fujiwara Kiel",
                    "user_href": "/profile/Fujiwara-Kiel"
                },
                {
                    "user_id": "Vaibhav Krishan",
                    "user_href": "/profile/Vaibhav-Krishan"
                },
                {
                    "user_id": "Jake Januzelli",
                    "user_href": "/profile/Jake-Januzelli"
                },
                {
                    "user_id": "Ng Kuan Rei",
                    "user_href": "/profile/Ng-Kuan-Rei"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/Nam-Ho-42"
                },
                {
                    "user_id": "Dhruv Motwani",
                    "user_href": "/profile/Dhruv-Motwani"
                },
                {
                    "user_id": "WonTaek Chung",
                    "user_href": "/profile/WonTaek-Chung"
                },
                {
                    "user_id": "Christopher VanLang",
                    "user_href": "/profile/Christopher-VanLang"
                },
                {
                    "user_id": "Anurag Bishnoi",
                    "user_href": "/profile/Anurag-Bishnoi"
                },
                {
                    "user_id": "Adam Merberg",
                    "user_href": "/profile/Adam-Merberg"
                },
                {
                    "user_id": "Timothy Johnson",
                    "user_href": "/profile/Timothy-Johnson-6"
                },
                {
                    "user_id": "Jessica Su",
                    "user_href": "/profile/Jessica-Su"
                },
                {
                    "user_id": "Zsolt Adam Wagner",
                    "user_href": "/profile/Zsolt-Adam-Wagner"
                },
                {
                    "user_id": "Tugce Kasikci",
                    "user_href": "/profile/Tugce-Kasikci"
                },
                {
                    "user_id": "Yu Zhou",
                    "user_href": "/profile/Yu-Zhou-23"
                },
                {
                    "user_id": "Steve Stevens",
                    "user_href": "/profile/Steve-Stevens-9"
                },
                {
                    "user_id": "Shreyas",
                    "user_href": "/profile/Shreyas-17"
                },
                {
                    "user_id": "Joseph Heavner",
                    "user_href": "/profile/Joseph-Heavner"
                },
                {
                    "user_id": "Atef Alaaeddine Sarraj",
                    "user_href": "/profile/Atef-Alaaeddine-Sarraj"
                }
            ]
        },
        {
            "author_info": {
                "name": "Sam Adams",
                "href": "/profile/Sam-Adams-128"
            },
            "answer_text": "Depends. How fast can you read? And do you want to understand it? But if want a serious answer that depends on a lot of things beyond your reading speed. One of them is the subject matter - I’m sure I can read a history paper in a lot less time than I could read a math paper of the same length (and that assumes that the math paper is in the same area as my own doctoral thesis). I know that I read mathematics far more slowly than I read English language text - in order to understand a statement you have to be able to read formulae and equations almost character by character. And you’ll often find yourself having to digress by reading other papers in order to understand a technique or theorem that the author of the paper you’re reading used. While I can easily read a three hundred page novel in a couple of days I can’t say the same about a mathematics text. ",
            "date": "Answered October 24, 2020",
            "views": "18",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Tugce Kasikci",
                "href": "/profile/Tugce-Kasikci"
            },
            "answer_text": "James Gay gave the great answer but why would you need a whole thesis? I mean really, why? What's the main purpose? Do you think you'll understand anything by just reading it? Then maybe you rather have to study it. I feel that right now instead of 'reading' it, start to understand what he is talking about. Read the abstract then look at the literature review see what he's talking about then look at how he set up the chapter and start reading papers from literature review. Of course, my wording here as 'reading' rather contributes to studying those papers. If you think, you are capable of understanding the thesis, now you can start. However, you can't just read a thesis. This is a waste of time. Take notes, prepare yourself a reminder document that you can go back and see what you have read. If you do a great job, you'll be able to understand within a week.My advice? Don't read the whole thesis. I'm sure there are parts you can use, and parts that are complete trash for you. Save your time. Time is important. Good luck! ",
            "date": "Answered May 29, 2015",
            "views": "18",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Vinay Neekhra",
                    "user_href": "/profile/Vinay-Neekhra"
                },
                {
                    "user_id": "Atef Alaaeddine Sarraj",
                    "user_href": "/profile/Atef-Alaaeddine-Sarraj"
                },
                {
                    "user_id": "Hached Ahmed",
                    "user_href": "/profile/Hached-Ahmed"
                }
            ]
        },
        {
            "author_info": {
                "name": "Kristina Kučanda",
                "href": "/profile/Kristina-Kučanda-1"
            },
            "answer_text": "In every detail? About 3 days -.- (that is when I proofread for colleagues, or at least I don't remember ever reading the whole thing for any other reason, except one rather short MSc thesis I read to learn how to write my own... actually none of them was 300 pages, but I estimate the 100 pages/workday rate from the 100-200 pages ones). The way I usually read them, skipping just to the parts that may be of my interest? Depends on how much of it is of my interest and if I am able to pdf-search or actually need to skim everything, but I'd say usually less than an hour. ",
            "date": "Updated May 29, 2015",
            "views": "12",
            "upvotes": " View 5 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Vasu Jaganath",
                    "user_href": "/profile/Vasu-Jaganath"
                },
                {
                    "user_id": "Martin J Pitt",
                    "user_href": "/profile/Martin-J-Pitt"
                },
                {
                    "user_id": "Christopher VanLang",
                    "user_href": "/profile/Christopher-VanLang"
                },
                {
                    "user_id": "James Gay",
                    "user_href": "/profile/James-Gay"
                },
                {
                    "user_id": "Atef Alaaeddine Sarraj",
                    "user_href": "/profile/Atef-Alaaeddine-Sarraj"
                }
            ]
        },
        {
            "author_info": {
                "name": "Adam Merberg",
                "href": "/profile/Adam-Merberg"
            },
            "answer_text": "If a math thesis were 300 pages long, I could probably easily spend the better part of a year trying to understand it in detail, particularly if it's not very self-contained or well-written. However, I can't remember ever encountering a thesis of this length in mathematics. ",
            "date": "Answered June 8, 2015",
            "views": "12",
            "upvotes": " View 6 Upvoters",
            "upvoters": [
                {
                    "user_id": "Ricky Saket",
                    "user_href": "/profile/Ricky-Saket"
                },
                {
                    "user_id": "Jake Januzelli",
                    "user_href": "/profile/Jake-Januzelli"
                },
                {
                    "user_id": "Yotam Dvir",
                    "user_href": "/profile/Yotam-Dvir"
                },
                {
                    "user_id": "Vidhyalakshmi Kalaichelvan",
                    "user_href": "/profile/Vidhyalakshmi-Kalaichelvan"
                },
                {
                    "user_id": "Joseph Heavner",
                    "user_href": "/profile/Joseph-Heavner"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/Natalia-Nezvanova"
                }
            ]
        },
        {
            "author_info": {
                "name": "Kim Lindsey",
                "href": "/profile/Kim-Lindsey"
            },
            "answer_text": "The answer to this question depends on which thesis and and why I'm reading it. If it's an interesting and relevant thesis, like... that of the student who came before me in the lab, it might take a very long time for me to study it closely, including reading some number of the references cited (could be months).  If it's not interesting and relevant, then I might just glance at the title and move on. ",
            "date": "Answered May 28, 2015",
            "views": "548",
            "upvotes": " View 2 Upvoters ",
            "upvoters": [
                {
                    "user_id": "James Gay",
                    "user_href": "/profile/James-Gay"
                },
                {
                    "user_id": "Atef Alaaeddine Sarraj",
                    "user_href": "/profile/Atef-Alaaeddine-Sarraj"
                }
            ]
        }
    ]
}