{
    "title": "Books: How many words is the typical business book? - Quora",
    "tags": [
        "Business Books",
        "Textbooks",
        "Words",
        "Business"
    ],
    "response": [
        {
            "author_info": {
                "name": "Ashley Nau",
                "href": "/profile/Ashley-Nau-1"
            },
            "answer_text": "As a new author, I did a lot of researching on this prior to writing my first book (and am in the process of writing the second - so the research continues!) I found that the best selling business books are around 100–150 pages - but this translates into 30,000–40,000 words which is a more accurate number because of fonts, page sizes, margins, etc. Most business books in general are 200 or less simply because after that point it becomes very repetitive or the content gets very specific, limiting the audience of the book. This also did not include business books for a specific function - such as a mathematical explanation textbook on option pricing. Yes, this is a business book but with a very narrow focus and specific implication. I did research on general topic business books, not specifically used in an academic setting - which also tend to have higher page numbers due to the nature of the writing. For my next book, I’m aiming for 35,000 - over half way there! ",
            "date": "Answered April 18, 2020",
            "views": "577",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Lucas Sawyer",
                "href": "/profile/Lucas-Sawyer-2"
            },
            "answer_text": "I'm not sure about the number of words, but most business books get very repetitive after about 200 pages. After that, the author usually finds multiple ways of describing the same concept. Stick to books of 200 pages or less and you'll learn a lot without wasting much time. Lucas Sawyer http://MiniCerts.com ",
            "date": "Answered October 11, 2018",
            "views": "12",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Josh McCormack",
                "href": "/profile/Josh-McCormack"
            },
            "answer_text": "This article (How to Write a Bestselling Business Book) has a good, concise, logical answer on the ideal length today for a business book - less than 100 pages. According to this cool site, readinglength.com, The One Minute Manager, talked about in that article, has 34,410 words on 111 pages. ",
            "date": "Answered March 24, 2017",
            "views": "33",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Robert Charles Lee",
                "href": "/profile/Robert-Charles-Lee"
            },
            "answer_text": "Essentially unanswerable because that depends on the page dimensions, the layout, the typeface used, the point size, the linespace leading, and one or two other factors. Source: I'm in the printing business. ",
            "date": "Answered June 27, 2015",
            "views": "18",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Michele DeFilippo",
                    "user_href": "/profile/Michele-DeFilippo"
                }
            ]
        }
    ]
}