{
    "title": "Can anybody write a book? - Quora",
    "tags": [
        "Book Writing",
        "Writing Advice",
        "Writing"
    ],
    "response": [
        {
            "author_info": {
                "name": "Jody Lebel",
                "href": "/profile/Jody-Lebel"
            },
            "answer_text": "Yes. BUT… The man on top of the mountain didn’t just fall there. Things take time. If you wanted to fly a plane, what would you do? You'd find a ground school and take lessons. If you wanted to play the piano, what would you do? You'd find a piano teacher and take classes. What makes writing any different? Writing is an art, but it’s a learned art. To ask someone how to write a story is like asking “How do I climb a mountain?” You don’t, unless you’ve had the training. And no, it’s not rocket science, but writing is something that needs to be studied and practiced. Anybody can sit down and write crap. You see it all the time in self pubbed books. Most people will tell you to just start writing, and keep writing, but I don't agree. It's not enough to just write every day if you don't know what you're doing or how to improve something. That just means days and weeks and months of useless writing. It's like not knowing how to knit so you just keep making loops with the yarn. You can't get better, you can't turn that into a scarf ... you have the desire, but you don't know how. I'm going to give you my stock answer that I give everyone who asks me this question. I'm going to give you some good advice on how to learn the craft, and give you a place to send in some of your work when you're ready. In order to write stories that people want to read you will need to understand how to put one together. There is a definite pattern and rhythm to it. And there are certain expectations from the editors and publishing houses as to how your story is laid out. You will need a good imagination, one that can look at a situation and picture all sorts of different scenarios. You need to be able to ask 'what if' and come up with twists and lines that are new and fresh. You will need to be able to research things. For example I wrote a story set in Iran where there was a wedding. I had to research how the wedding would take place, the food, the customs, common Iranian names, clothing, etc. in order to write an interesting yet correct story. Take classes in writing; grammar and punctuation (very important... lots of self published books are swimming in glaring errors and typos), character building, dialogue, plotting, pacing, point of view (POV), inner and outer conflicts, subplots, scenes and sequels, genres, story boards, twists, chapter hooks, suspense, killer opening lines, and satisfying endings. If you're going to write sci-fi you will need to take classes in world building. Each genre of book has its own set of expectations from the reader that you will need to fulfill. For example a murder mystery must have clues for the reader to try and solve. A romance needs a happen ever after ending, known to writers as an HEA. A thriller needs fast pacing and danger. There are classes in short story writing. Where to find these classes? Local community colleges often offer writing classes. My local library has classes seasonally. Best of all there are hundreds of classes you can take on-line. They run about $25-$35 each and range from 2 to 4 weeks. Google on-line writing classes and you will get lots of sites. Try www.oirwa.com or www.savvyauthors.com. They have classes year round. You don’t have to join either one but if you do you get a discount on their classes. Just because a class might be about writing romances, writing is writing; many of the same principles apply to other genres. So don’t hesitate to take a course on character building or writing scenes just because the site caters to romance. There are sites that offer expensive classes, so be careful. I’d recommend starting with a few less expensive ones to see if you really like writing and want to continue. IMO it is not necessary to have a degree or to take an expensive course to write well. Read a lot. Get a feel for how a story is told; how it starts, how it progresses through the story to a satisfying end. See how your favorite author keeps you interested. I don't know your age, but when you are able join some writing groups, even online groups are helpful. Oftentimes these groups offer lectures and classes in writing. They share their work and critique each other. Once you start taking classes and get a good feel for how to put a story together, write some short stories (800 - 1500 words). The more you write, the better you will become. You will make new writer mistakes, we all did. But that's how you learn. I say start with short stories because they are, well short, and don't take years to complete like a novel does. You can share your stories with others and get feedback. Take the feedback and use what you feel is constructive for you and ignore the others. Some people don't give good feedback, or there is a motive behind their negative comments. You have to learn which ones to take and learn from and which ones to disregard. And when you are reading and critiquing other's stories, be kind, give good feedback, and find something positive to say to them. It's hard to hear harsh things about your writing. It's tough love. But it works when you get it and understand why the comment was made and you go and make your piece better because of it. Submitting to contests is another way to get good feedback because the judges are usually editors and agents who have their finger on the pulse of good writing that sells. Once you feel you have written a great short story, be brave and submit it to a magazine that publishes fiction in the genre you wrote. Don't worry about rejections. They will come. Oftentimes it's not because your story is not good, it's because the story doesn't fit their needs. They are running a business after all, and they pick the stories that they feel will best entertain their readers. All authors get rejections. It's part of the 'hunt'. Here’s a place to start submitting. Check out their guidelines carefully. FLASH FICTION ONLINE http://flashfictiononline.com/main/submission-guidelines/ We publish stories from 500 to 1,000 words in length. They’re very short, but they are still stories. That means the best ones have strong, interesting characters, plots, and (to some extent, at least) settings. We’re not that concerned about genre. Many of us have a fondness for science fiction and fantasy, but we also like literary fiction; and in any case, great flash stories aren’t always easily classified. If you wrote it, and you love it, then submit it. No erotica, porn, graphic sex, or violence. Pays $60 per story. Buys reprints at two cents/word. Once you are good enough to sell a few short stories, then you will have the skills to think about plotting out a whole book. ",
            "date": "Answered March 27, 2017",
            "views": "46",
            "upvotes": " View 10 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Jake Lawrence",
                    "user_href": "/profile/Jake-Lawrence-27"
                },
                {
                    "user_id": "Shiva Surya Lolla",
                    "user_href": "/profile/Shiva-Surya-Lolla"
                },
                {
                    "user_id": "Runushree Gupta",
                    "user_href": "/profile/Runushree-Gupta"
                },
                {
                    "user_id": "James H. Jenkins",
                    "user_href": "/profile/James-H-Jenkins"
                },
                {
                    "user_id": "Haisu Npanme",
                    "user_href": "/profile/Haisu-Npanme"
                },
                {
                    "user_id": "Ushmil Rimjha",
                    "user_href": "/profile/Ushmil-Rimjha"
                },
                {
                    "user_id": "David Marshall",
                    "user_href": "/profile/David-Marshall-206"
                },
                {
                    "user_id": "Suvanssh Mahajan",
                    "user_href": "/profile/Suvanssh-Mahajan"
                },
                {
                    "user_id": "N. J. Wilder",
                    "user_href": "/profile/N-J-Wilder"
                },
                {
                    "user_id": "Naresh Katari",
                    "user_href": "/profile/Naresh-Katari"
                }
            ]
        },
        {
            "author_info": {
                "name": "Skip Press",
                "href": "/profile/Skip-Press"
            },
            "answer_text": "Every person has a story. Putting it into book form is not difficult, particularly with technology these days. If you have a computer or even a smartphone, there is software that lets you dictate anything on your mind and even transcribe it as you talk via artificial intelligence. Otter Voice Meeting Notes is the one I use most, but I can do that directly on my Mac laptop. The question then becomes, is the book readable? You might be surprised how difficult that can be. I interviewed the great playwright Tennessee Williams once for a magazine and he autographed and gave me a copy of his memoir. I found it difficult to read because it rambled a bit. Nevertheless, he had a great story. As an editor, I’ve done life stories that I wrote, others I edited from existing text, and have edited and ghostwritten many books and novels. With each type of book, there’s usually an accepted form that you need to at least know, even if you haven’t perfected it. Some people probably cannot write a book alone. For example, the Governor of California, Gavin Newsom, is dyslexic and might have trouble doing a book by himself. Other people might have disabilities that prevent them, or maybe just can’t find the time to write a book. Last year I took a novel that was a long time in the writing and cut it by 1/3 and improved it quite a bit and it’s now on the market. I also shaped dictation from an octogenarian Air Force veteran into a memoir for his family. All this is to say, tons of people can get a book’s worth of material into some kind of form, but it usually takes a professional like myself to shape it into something they love. ",
            "date": "Answered June 7, 2020",
            "views": "450",
            "upvotes": " Answer requested by Jackson Carter",
            "upvoters": [
                {
                    "user_id": "Juliana Marie Radulescu",
                    "user_href": "/profile/Juliana-Marie-Radulescu"
                },
                {
                    "user_id": "Krishna Sinha",
                    "user_href": "/profile/Krishna-Sinha-138"
                },
                {
                    "user_id": "Barbara Carr",
                    "user_href": "/profile/Barbara-Carr-31"
                },
                {
                    "user_id": "Andre Matthews",
                    "user_href": "/profile/Andre-Matthews-2"
                }
            ]
        },
        {
            "author_info": {
                "name": "Severine Riise",
                "href": "/profile/Severine-Riise"
            },
            "answer_text": "Provided that they are literate, I suppose that is very possible. While not completely impossible when illiterate, it becomes all the more challenging to come up with and write a compelling story when you also have to engage in a hit or miss game of what stroke to put where so it looks like something similar to a letter and coincidentally happens to be one. But if you are literate, there are the previously mentioned challenges as well. You have to come up with an idea you think people would be interested in reading. And if/when you do so, you need to write it in a way that makes it readable. You could sit on the best idea of a story known to mankind, supported by an imagination that just keeps the good ideas coming, but without a proper way to convey it making people want to read it would be difficult. Getting abstracts down on paper is surprisingly difficult, and combined with poor writing skills it can easily kill the grandest of plots. Very similarly you should have a grand idea (possibly coupled with an equally grand imagination if what you plan to write is fictional in nature) to write if you do possess the gift of writing things. Bad plots have become very readable because of good articulation. Imagine if such skills were applied to a good one! But most of all, what you need to write that book is time. It doesn’t help with neither writing skills or imagination if you simply have a life too hectic to put any of them to use. So yes. Everyone can write a book, but to write a really good one you should have four skills (though there are exceptions from the rule), in addition to one prerequisite: LiteracyImaginationArticulationTimeAn ideaI hope this helps. ",
            "date": "Answered March 27, 2017",
            "views": "15",
            "upvotes": " View 4 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Anna Rockabella",
                    "user_href": "/profile/Anna-Rockabella"
                },
                {
                    "user_id": "Matthew Hsu",
                    "user_href": "/profile/Matthew-Hsu-8"
                }
            ]
        },
        {
            "author_info": {
                "name": "Noah Tackett",
                "href": "/profile/Noah-Tackett"
            },
            "answer_text": "With the right dedication, love, and wordcraft, anyone can. Books are a labor of love, and one I’ve been working for years to get good at. I personally think that I still haven’t gotten good yet, but that’s okay. Really, I was born in ‘98, and it takes a long time to write a good story. I think my biggest problem at this point is worldbuilding, which is something I’m trying to work on as I write. My advice: write what you’ve always wanted to write, practice writing frequently, and read a lot of various books, regardless of what they’re classified as. Some middle grade books have wonderful stories, some YA books are entertaining(Percy Jackson in particular, Riordan is awesome), there’s Lord of the Rings, and a lot of others that have wildly varying styles that can help you find your style of writing. Hope this helps, good luck! ",
            "date": "Answered July 9, 2017",
            "views": "625",
            "upvotes": " Answer requested by Antanas Bibkevicius",
            "upvoters": [
                {
                    "user_id": "Anush",
                    "user_href": "/profile/Anush-15"
                },
                {
                    "user_id": "Ganesh Mane",
                    "user_href": "/profile/Ganesh-Mane-197"
                },
                {
                    "user_id": "Ozzy Saikel",
                    "user_href": "/profile/Ozzy-Saikel"
                },
                {
                    "user_id": "Vaishak",
                    "user_href": "/profile/Vaishak-17"
                },
                {
                    "user_id": "Emma Lilola",
                    "user_href": "/profile/Emma-Lilola"
                },
                {
                    "user_id": "Manpreet. Singh",
                    "user_href": "/profile/Manpreet-Singh-639"
                },
                {
                    "user_id": "Brian Good",
                    "user_href": "/profile/Brian-Good-6"
                },
                {
                    "user_id": "Jordan Forth",
                    "user_href": "/profile/Jordan-Forth-4"
                }
            ]
        },
        {
            "author_info": {
                "name": "Perry Constantine",
                "href": "/profile/Perry-Constantine"
            },
            "answer_text": "Yes, anyone can write a book. Particularly now because anyone can publish a book by just uploading it to Amazon’s Kindle platform or Smashwords. But just because everyone has the ability to write a book doesn’t mean everyone will write a book. Many people have the idea of, “I should write a book some day,” not realizing that it actually is a lot of work and a lot of dedication to sit down and bang out a story that’s enough to last the length of a complete novel. If you’re willing to put in the time and dedicate yourself to finishing the story, then you can write a book. If you aren’t, then you won’t get more than maybe fifty pages in. ",
            "date": "Answered June 25, 2017",
            "views": "19",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Mandy Holzer",
                    "user_href": "/profile/Mandy-Holzer"
                },
                {
                    "user_id": "Lena Seckman",
                    "user_href": "/profile/Lena-Seckman"
                },
                {
                    "user_id": "Gaurav Karki",
                    "user_href": "/profile/Gaurav-Karki-21"
                },
                {
                    "user_id": "Akshay Kunnavil",
                    "user_href": "/profile/Akshay-Kunnavil"
                },
                {
                    "user_id": "Akhil Gupta",
                    "user_href": "/profile/Akhil-Gupta-198"
                },
                {
                    "user_id": "Wade Spencer",
                    "user_href": "/profile/Wade-Spencer"
                },
                {
                    "user_id": "Eric Garcia",
                    "user_href": "/profile/Eric-Garcia-190"
                },
                {
                    "user_id": "Louise D. Jewell",
                    "user_href": "/profile/Louise-D-Jewell"
                },
                {
                    "user_id": "Oloyede Folabayo Taofeek",
                    "user_href": "/profile/Oloyede-Folabayo-Taofeek"
                },
                {
                    "user_id": "Trinity Marsh",
                    "user_href": "/profile/Trinity-Marsh-1"
                },
                {
                    "user_id": "Kunvar Thaman",
                    "user_href": "/profile/Kunvar-Thaman-3"
                },
                {
                    "user_id": "Mairon Aulendil",
                    "user_href": "/profile/Mairon-Aulendil"
                },
                {
                    "user_id": "Jim Miller",
                    "user_href": "/profile/Jim-Miller-139"
                },
                {
                    "user_id": "Barbara Hinther",
                    "user_href": "/profile/Barbara-Hinther"
                },
                {
                    "user_id": "Lesley Ann Barklay",
                    "user_href": "/profile/Lesley-Ann-Barklay"
                },
                {
                    "user_id": "Jody Nye",
                    "user_href": "/profile/Jody-Nye"
                },
                {
                    "user_id": "Tiago João",
                    "user_href": "/profile/Tiago-João-3"
                },
                {
                    "user_id": "Gregory Rivera",
                    "user_href": "/profile/Gregory-Rivera-6"
                },
                {
                    "user_id": "Steven J Owens",
                    "user_href": "/profile/Steven-J-Owens"
                },
                {
                    "user_id": "James Welch",
                    "user_href": "/profile/James-Welch-26"
                },
                {
                    "user_id": "Göran Lovén",
                    "user_href": "/profile/Göran-Lovén"
                },
                {
                    "user_id": "Toni Lichtenstein Bogolub",
                    "user_href": "/profile/Toni-Lichtenstein-Bogolub"
                },
                {
                    "user_id": "Mike L. McDonald",
                    "user_href": "/profile/Mike-L-McDonald"
                },
                {
                    "user_id": "Jonathan Sullivan",
                    "user_href": "/profile/Jonathan-Sullivan-10"
                },
                {
                    "user_id": "Cathy Cretsinger",
                    "user_href": "/profile/Cathy-Cretsinger"
                },
                {
                    "user_id": "Alan Thomson",
                    "user_href": "/profile/Alan-Thomson-63"
                },
                {
                    "user_id": "Clare Celea",
                    "user_href": "/profile/Clare-Celea"
                },
                {
                    "user_id": "Ward Van Frost",
                    "user_href": "/profile/Ward-Van-Frost"
                },
                {
                    "user_id": "Trevor Mccarthy",
                    "user_href": "/profile/Trevor-Mccarthy-20"
                },
                {
                    "user_id": "Lucas Souza",
                    "user_href": "/profile/Lucas-Souza-36"
                },
                {
                    "user_id": "Robin Moore",
                    "user_href": "/profile/Robin-Moore-199"
                },
                {
                    "user_id": "Vix Clarke",
                    "user_href": "/profile/Vix-Clarke"
                },
                {
                    "user_id": "Razeen Hossain",
                    "user_href": "/profile/Razeen-Hossain"
                },
                {
                    "user_id": "Mikayla Garber",
                    "user_href": "/profile/Mikayla-Garber"
                },
                {
                    "user_id": "Jenni Juvonen",
                    "user_href": "/profile/Jenni-Juvonen"
                },
                {
                    "user_id": "Margaret Bernard",
                    "user_href": "/profile/Margaret-Bernard-4"
                },
                {
                    "user_id": "Pru Comben",
                    "user_href": "/profile/Pru-Comben"
                },
                {
                    "user_id": "Jonathan Galliher",
                    "user_href": "/profile/Jonathan-Galliher"
                },
                {
                    "user_id": "Bhagya V Ashar",
                    "user_href": "/profile/Bhagya-V-Ashar"
                },
                {
                    "user_id": "Jim Young",
                    "user_href": "/profile/Jim-Young-79"
                },
                {
                    "user_id": "Paul Mannering",
                    "user_href": "/profile/Paul-Mannering"
                },
                {
                    "user_id": "Kim McGarghan",
                    "user_href": "/profile/Kim-McGarghan"
                },
                {
                    "user_id": "Janet Sked",
                    "user_href": "/profile/Janet-Sked"
                },
                {
                    "user_id": "Andrew",
                    "user_href": "/profile/Andrew-4090"
                },
                {
                    "user_id": "Shayne May",
                    "user_href": "/profile/Shayne-May-1"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/Ignotus-Seventeen"
                },
                {
                    "user_id": "Joan A. Cecil",
                    "user_href": "/profile/Joan-A-Cecil"
                },
                {
                    "user_id": "Sucheta Frankel",
                    "user_href": "/profile/Sucheta-Frankel"
                },
                {
                    "user_id": "S. Suleman Hamid",
                    "user_href": "/profile/S-Suleman-Hamid-1"
                },
                {
                    "user_id": "Casey Cooper",
                    "user_href": "/profile/Casey-Cooper-38"
                },
                {
                    "user_id": "George Sawyer",
                    "user_href": "/profile/George-Sawyer-1"
                },
                {
                    "user_id": "Josie Black",
                    "user_href": "/profile/Josie-Black-15"
                },
                {
                    "user_id": "Nanette Francis",
                    "user_href": "/profile/Nanette-Francis"
                },
                {
                    "user_id": "Thomas Ross",
                    "user_href": "/profile/Thomas-Ross-95"
                },
                {
                    "user_id": "Gadi Migdal",
                    "user_href": "/profile/Gadi-Migdal"
                },
                {
                    "user_id": "Mike Lloret",
                    "user_href": "/profile/Mike-Lloret"
                },
                {
                    "user_id": "Nusrat Subah",
                    "user_href": "/profile/Nusrat-Subah"
                },
                {
                    "user_id": "Laura Lin",
                    "user_href": "/profile/Laura-Lin-33"
                },
                {
                    "user_id": "Torshie Torto",
                    "user_href": "/profile/Torshie-Torto"
                },
                {
                    "user_id": "Mike Kearney",
                    "user_href": "/profile/Mike-Kearney-10"
                },
                {
                    "user_id": "Yakir Vaks",
                    "user_href": "/profile/Yakir-Vaks"
                },
                {
                    "user_id": "Laura Botsford",
                    "user_href": "/profile/Laura-Botsford"
                },
                {
                    "user_id": "Chuck Matthews",
                    "user_href": "/profile/Chuck-Matthews"
                },
                {
                    "user_id": "Mark Lewis",
                    "user_href": "/profile/Mark-Lewis-264"
                },
                {
                    "user_id": "Melissa Wickersham",
                    "user_href": "/profile/Melissa-Wickersham-3"
                },
                {
                    "user_id": "Ellen McBee",
                    "user_href": "/profile/Ellen-McBee"
                },
                {
                    "user_id": "Dirk Hooper",
                    "user_href": "/profile/Dirk-Hooper"
                },
                {
                    "user_id": "Peter Flom",
                    "user_href": "/profile/Peter-Flom"
                },
                {
                    "user_id": "Patricia Hassett",
                    "user_href": "/profile/Patricia-Hassett-1"
                },
                {
                    "user_id": "Alex Kirwan",
                    "user_href": "/profile/Alex-Kirwan-4"
                },
                {
                    "user_id": "Kimberly Ryan",
                    "user_href": "/profile/Kimberly-Ryan-75"
                },
                {
                    "user_id": "David Collins",
                    "user_href": "/profile/David-Collins-266"
                },
                {
                    "user_id": "David Croft",
                    "user_href": "/profile/David-Croft-6"
                },
                {
                    "user_id": "Kadin Astfalck",
                    "user_href": "/profile/Kadin-Astfalck-1"
                },
                {
                    "user_id": "P.J. Hendrickson",
                    "user_href": "/profile/P-J-Hendrickson"
                },
                {
                    "user_id": "Patricia Rahikainen",
                    "user_href": "/profile/Patricia-Rahikainen"
                },
                {
                    "user_id": "Marilyn Robinson",
                    "user_href": "/profile/Marilyn-Robinson-23"
                },
                {
                    "user_id": "Alexis Arblaster",
                    "user_href": "/profile/Alexis-Arblaster"
                },
                {
                    "user_id": "Jack Lurhstaap Romero",
                    "user_href": "/profile/Jack-Lurhstaap-Romero"
                },
                {
                    "user_id": "David Larkin",
                    "user_href": "/profile/David-Larkin-26"
                },
                {
                    "user_id": "Susanna Fisher",
                    "user_href": "/profile/Susanna-Fisher"
                },
                {
                    "user_id": "Jordan Yates",
                    "user_href": "/profile/Jordan-Yates-4"
                },
                {
                    "user_id": "James H. Jenkins",
                    "user_href": "/profile/James-H-Jenkins"
                },
                {
                    "user_id": "Subhranil Ghoshal",
                    "user_href": "/profile/Subhranil-Ghoshal-1"
                },
                {
                    "user_id": "Danijar Dreger",
                    "user_href": "/profile/Danijar-Dreger"
                },
                {
                    "user_id": "Susan Bertolino",
                    "user_href": "/profile/Susan-Bertolino"
                },
                {
                    "user_id": "Praveen Gupta",
                    "user_href": "/profile/Praveen-Gupta-776"
                },
                {
                    "user_id": "Nathan Beard",
                    "user_href": "/profile/Nathan-Beard-6"
                },
                {
                    "user_id": "David Lourne",
                    "user_href": "/profile/David-Lourne-1"
                },
                {
                    "user_id": "Sarah Lynn Johnson",
                    "user_href": "/profile/Sarah-Lynn-Johnson"
                },
                {
                    "user_id": "Leonie Boyes",
                    "user_href": "/profile/Leonie-Boyes"
                },
                {
                    "user_id": "Stephanie Vardavas",
                    "user_href": "/profile/Stephanie-Vardavas"
                },
                {
                    "user_id": "Sonia Fanucchi",
                    "user_href": "/profile/Sonia-Fanucchi"
                },
                {
                    "user_id": "Lisa Jain Thompson",
                    "user_href": "/profile/Lisa-Jain-Thompson"
                },
                {
                    "user_id": "Lance Berg",
                    "user_href": "/profile/Lance-Berg-2"
                },
                {
                    "user_id": "Holly Root-Gutteridge",
                    "user_href": "/profile/Holly-Root-Gutteridge"
                },
                {
                    "user_id": "Les Howie",
                    "user_href": "/profile/Les-Howie"
                },
                {
                    "user_id": "Ron Barry",
                    "user_href": "/profile/Ron-Barry-2"
                },
                {
                    "user_id": "Glenn Fogle",
                    "user_href": "/profile/Glenn-Fogle"
                },
                {
                    "user_id": "Dylan McGrath",
                    "user_href": "/profile/Dylan-McGrath-9"
                },
                {
                    "user_id": "Joshua Millins",
                    "user_href": "/profile/Joshua-Millins"
                },
                {
                    "user_id": "Shivam Dubey",
                    "user_href": "/profile/Shivam-Dubey-28"
                },
                {
                    "user_id": "Jacqueline George",
                    "user_href": "/profile/Jacqueline-George-1"
                },
                {
                    "user_id": "Edward Conway",
                    "user_href": "/profile/Edward-Conway"
                },
                {
                    "user_id": "Naveen Durgaraju",
                    "user_href": "/profile/Naveen-Durgaraju"
                },
                {
                    "user_id": "Robert Tobber",
                    "user_href": "/profile/Robert-Tobber"
                },
                {
                    "user_id": "Xander Backus",
                    "user_href": "/profile/Xander-Backus"
                },
                {
                    "user_id": "Wendy Griffin Anderson",
                    "user_href": "/profile/Wendy-Griffin-Anderson"
                },
                {
                    "user_id": "Olya Ianovskaia",
                    "user_href": "/profile/Olya-Ianovskaia"
                },
                {
                    "user_id": "Joyce Yang",
                    "user_href": "/profile/Joyce-Yang-28"
                },
                {
                    "user_id": "Courtenay Rule",
                    "user_href": "/profile/Courtenay-Rule"
                },
                {
                    "user_id": "Mary Nelson",
                    "user_href": "/profile/Mary-Nelson-4"
                },
                {
                    "user_id": "Steven P Robinson",
                    "user_href": "/profile/Steven-P-Robinson"
                },
                {
                    "user_id": "Ayu Nazrah",
                    "user_href": "/profile/Ayu-Nazrah"
                },
                {
                    "user_id": "Jane Adams",
                    "user_href": "/profile/Jane-Adams-130"
                },
                {
                    "user_id": "Ashutosh Agrawal",
                    "user_href": "/profile/Ashutosh-Agrawal-264"
                },
                {
                    "user_id": "Muhammad Irfan Perdana",
                    "user_href": "/profile/Muhammad-Irfan-Perdana"
                },
                {
                    "user_id": "Chris Nash",
                    "user_href": "/profile/Chris-Nash-10"
                },
                {
                    "user_id": "Helgi Briem",
                    "user_href": "/profile/Helgi-Briem"
                },
                {
                    "user_id": "Gordon Clason",
                    "user_href": "/profile/Gordon-Clason"
                },
                {
                    "user_id": "Melissa Hoy",
                    "user_href": "/profile/Melissa-Hoy-2"
                },
                {
                    "user_id": "Thomas Teply",
                    "user_href": "/profile/Thomas-Teply"
                },
                {
                    "user_id": "Jennifer Sittinger",
                    "user_href": "/profile/Jennifer-Sittinger"
                },
                {
                    "user_id": "Lakshay Sood",
                    "user_href": "/profile/Lakshay-Sood"
                },
                {
                    "user_id": "John Joss",
                    "user_href": "/profile/John-Joss"
                },
                {
                    "user_id": "Bridget Swain",
                    "user_href": "/profile/Bridget-Swain"
                },
                {
                    "user_id": "Andrew Grabauskas",
                    "user_href": "/profile/Andrew-Grabauskas"
                },
                {
                    "user_id": "Mike Winslade",
                    "user_href": "/profile/Mike-Winslade"
                },
                {
                    "user_id": "Mari Bezhashvili",
                    "user_href": "/profile/Mari-Bezhashvili-1"
                },
                {
                    "user_id": "Shiloh Jay Edsitty",
                    "user_href": "/profile/Shiloh-Jay-Edsitty"
                },
                {
                    "user_id": "Alexandra Torres",
                    "user_href": "/profile/Alexandra-Torres-20"
                },
                {
                    "user_id": "Isabelle Grey",
                    "user_href": "/profile/Isabelle-Grey-2"
                },
                {
                    "user_id": "Paul Ryberg",
                    "user_href": "/profile/Paul-Ryberg"
                },
                {
                    "user_id": "George Corley",
                    "user_href": "/profile/George-Corley"
                },
                {
                    "user_id": "Isa Shah",
                    "user_href": "/profile/Isa-Shah-1"
                },
                {
                    "user_id": "Bobby Lynn",
                    "user_href": "/profile/Bobby-Lynn-8"
                },
                {
                    "user_id": "Daniel James Berger",
                    "user_href": "/profile/Daniel-James-Berger"
                },
                {
                    "user_id": "Rae Chaffee",
                    "user_href": "/profile/Rae-Chaffee-1"
                },
                {
                    "user_id": "Jess Mulligan",
                    "user_href": "/profile/Jess-Mulligan"
                },
                {
                    "user_id": "Camden Weck",
                    "user_href": "/profile/Camden-Weck"
                },
                {
                    "user_id": "Lucia R. Hicks",
                    "user_href": "/profile/Lucia-R-Hicks"
                },
                {
                    "user_id": "Christine Takada",
                    "user_href": "/profile/Christine-Takada-1"
                },
                {
                    "user_id": "William Zhang",
                    "user_href": "/profile/William-Zhang-127"
                },
                {
                    "user_id": "Barbara Pavey",
                    "user_href": "/profile/Barbara-Pavey"
                },
                {
                    "user_id": "Aryan Mathur",
                    "user_href": "/profile/Aryan-Mathur-5"
                },
                {
                    "user_id": "Anna Vale",
                    "user_href": "/profile/Anna-Vale-2"
                },
                {
                    "user_id": "Navin Niish",
                    "user_href": "/profile/Navin-Niish"
                },
                {
                    "user_id": "Andrew Weill",
                    "user_href": "/profile/Andrew-Weill"
                },
                {
                    "user_id": "Tommy Laurin",
                    "user_href": "/profile/Tommy-Laurin"
                },
                {
                    "user_id": "Vainamoinen Leisti",
                    "user_href": "/profile/Vainamoinen-Leisti"
                },
                {
                    "user_id": "Carrie Cadwallader",
                    "user_href": "/profile/Carrie-Cadwallader"
                },
                {
                    "user_id": "Ashwath S",
                    "user_href": "/profile/Ashwath-S-16"
                },
                {
                    "user_id": "Daniel Schwarz Carigiet",
                    "user_href": "/profile/Daniel-Schwarz-Carigiet"
                },
                {
                    "user_id": "Abhiram",
                    "user_href": "/profile/Abhiram-77"
                },
                {
                    "user_id": "Nishant Verma",
                    "user_href": "/profile/Nishant-Verma-58"
                },
                {
                    "user_id": "Rohit Gajendragadkar",
                    "user_href": "/profile/Rohit-Gajendragadkar"
                },
                {
                    "user_id": "Hrishikesh",
                    "user_href": "/profile/Hrishikesh-92"
                },
                {
                    "user_id": "Abdul Hingwala",
                    "user_href": "/profile/Abdul-Hingwala"
                },
                {
                    "user_id": "Barbara Robson",
                    "user_href": "/profile/Barbara-Robson-1"
                },
                {
                    "user_id": "Terry Verduin",
                    "user_href": "/profile/Terry-Verduin-1"
                },
                {
                    "user_id": "Tom Lynch",
                    "user_href": "/profile/Tom-Lynch-139"
                },
                {
                    "user_id": "Anthony Hoad",
                    "user_href": "/profile/Anthony-Hoad-1"
                },
                {
                    "user_id": "Robert Miller",
                    "user_href": "/profile/Robert-Miller-231"
                },
                {
                    "user_id": "Ari Dayton",
                    "user_href": "/profile/Ari-Dayton"
                }
            ]
        },
        {
            "author_info": {
                "name": "Kamila Miller",
                "href": "/profile/Kamila-Miller-2"
            },
            "answer_text": "People who can’t read and write will have greater difficulty composing a book, as will people who don’t think in words or don’t communicate in words or word constructions based on gesture or alternate expression. Such people may require a translator or some other sort of assistance to produce a book. In other words, the answer is almost always yes, though some people will need more help than others, and the book may not be in a strictly traditional form. It might be a series of paintings that suggest a narrative (aka ‘picture book’) or it may be electronic and/or interactive – a coded book. Whether everyone has the determination and desire to write a book is a different matter. A book doesn’t come into being just because a person had the ability. They also have to have the time, the passion, the vision, the resources, and in many cases the support, to write a book. ",
            "date": "Answered June 26, 2017",
            "views": "888",
            "upvotes": " View 8 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Breege Doherty",
                    "user_href": "/profile/Breege-Doherty-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Michael Jensen",
                "href": "/profile/Michael-Jensen-171"
            },
            "answer_text": "Everyone has the ability to write a book, but I would say not everyone has the ability to write good enough to be published. I think it may be similar to what is said about the general population in regards to the ability to visualize 3-dimensional images in their mind. That is, 1/3 can do it naturally, 1/3 can learn how to do it, and 1/3 just can't do it. That goes with Brandon Sanderson saying you should focus on what is in your control and not worrying about what is out of your control, and being okay with the result. That the result can still be fulfilling. As an example he said he would never be a pro NBA star and that's okay. ",
            "date": "Answered June 7, 2020",
            "views": "77",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "John Grigsby",
                "href": "/profile/John-Grigsby-3"
            },
            "answer_text": "Sure. Anyone can put words on paper and have it bound. Can anyone write a book well or a book that will sell? That's another question entirely. Writing is not easy, regardless of what people think. Anyone who says, “Anybody can write a book,” has never tried to write one. It requires discipline, a strong command of grammar in the language you are writing in, and a lot of imagination. It is hard work. You have to put in a set number of hours everyday, just as if you were working (because you are). The task requires concentration, motivation, and dedication. And don't expect to get rich. Authors often make enough to live on while they write their next book. ",
            "date": "Answered March 27, 2017",
            "views": "432",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Mercedes R. Lackey",
                "href": "/profile/Mercedes-R-Lackey"
            },
            "answer_text": "Sure, anyone with enough determination can write a book. Not everyone can write a good book. Even fewer can write a great book. It takes talent, skill, and practice to write a good book. All it takes to write “a” book is determination. ",
            "date": "Answered December 18, 2019",
            "views": "39",
            "upvotes": " View 164 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Michael Joy",
                    "user_href": "/profile/Michael-Joy-7"
                }
            ]
        },
        {
            "author_info": {
                "name": "Misha Gerrick",
                "href": "/profile/Misha-Gerrick"
            },
            "answer_text": "I want to say yes. In fact, I routinely tell people that everyone has at least one story in them. But that’s really just to get them to try. There are a lot of other things about writing books that most people don’t have. So while I welcome and encourage everyone who wants to try writing, I know that only 1% or something like that of people who have ever tried to write a book will actually finish writing it and actually get as far as publishing it. So anyone could write a book, but not everyone is capable of it. But the only way to know whether you are is by writing and sticking it out for as far as you possibly can. (Having heard from people who gave up, writing can be rather soul destroying if it’s not for you.) ",
            "date": "Answered July 4, 2019",
            "views": "213",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "K. Van Kramer",
                    "user_href": "/profile/K-Van-Kramer"
                },
                {
                    "user_id": "Marie Pedersen",
                    "user_href": "/profile/Marie-Pedersen-7"
                }
            ]
        },
        {
            "author_info": {
                "name": "Daniel Schwarz Carigiet",
                "href": "/profile/Daniel-Schwarz-Carigiet"
            },
            "answer_text": "Writing a book is in principle something that anyone who can write at all can do. They just need to sit down and start writing. And keep at it until the book is done. Writing a GOOD book, a book that others will WANT to read? Ah… That’s another story. No, this is something that not everyone can do. This is something that takes talent, discipline and a generous truckload of experience (all three of which I lack, incidentally - but I still managed to finish a book that I like just fine). I rather like Neil Gaiman’s statement: “This is how you do it: you sit down at the keyboard and you put one word after another until its done. It's that easy, and that hard.” ",
            "date": "Answered December 18, 2019",
            "views": "340",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Eman Dawood",
                "href": "/profile/Eman-Dawood-8"
            },
            "answer_text": "Yeah of course, but You need patience and you should believe in yourself that you can do it even if it is hard you should work for your goals and if people start to give you negativity and telling you that you can’t do it just run away from them and do not listen to them because those people is trying to put you down. Also you need a good title that is attractive and you should read about how to write a book and about the rules of writing (depends on what type of writing) and the most important part that you should love something called writing I mean you should not do it if someone force you to write a book because you are not going to have patience or you are not going to love writing so that cause unattractive book and most people will dislike it so you need to love what you are doing. ❤ I HOPE YOU LIKE MY OPINION ABOUT THIS QUESTION AND I HOPE YOU TOOK SOME BENEFITS OF WHAT I WROTE ❤ ",
            "date": "Answered June 7, 2020",
            "views": "132",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Steve Lyon",
                    "user_href": "/profile/Steve-Lyon-4"
                }
            ]
        },
        {
            "author_info": {
                "name": "Daniel Gooch",
                "href": "/profile/Daniel-Gooch"
            },
            "answer_text": "Even short stories are hard! Almost every time I read one of mine I find a typo or something that got messed up when pasting something in or somesuch. It takes a few dozen rewrites just to keep me from cringing when I read it! If it were not for the concepts or other things I want to work out I wouldn’t even bother. That doesn’t even take in the dialogue, people don’t talk like they do on soap operas, but they are written that way because there is no narrator. Good writers are good because they can show us a world that exists in their mind without it sounding like some one just talking about it. It flows into your mind as if you are seeing it for yourself. Writing a book is possible for anyone, writing a book that people will want to read is far more difficult. ",
            "date": "Updated July 3, 2017",
            "views": "455",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Michael Joy",
                    "user_href": "/profile/Michael-Joy-7"
                },
                {
                    "user_id": "Garry Taylor",
                    "user_href": "/profile/Garry-Taylor-5"
                }
            ]
        },
        {
            "author_info": {
                "name": "Dave Payton",
                "href": "/profile/Dave-Payton-1"
            },
            "answer_text": "Thanks for the A2A. Yes, but it takes time and experience to learn how to craft stories that are ready for publication and consumption. That’s one of the reasons one of my pieces of advice is that if someone wants to write books, that they should start writing stories now, when they’re thinking about it, rather than waiting X number of years to start. The longer someone writes, the more ready they will be to publish, when that time comes around, and regardless of when they start writing, time management will always be an issue. Most writers have to have day jobs to support themselves, on top of their writing. ",
            "date": "Answered December 19, 2019",
            "views": "206",
            "upvotes": " Answer requested by Jaida Williams, Kara Soylular and 1 more",
            "upvoters": [
                {
                    "user_id": "Richa Das",
                    "user_href": "/profile/Richa-Das-15"
                }
            ]
        },
        {
            "author_info": {
                "name": "Jim Gleeson",
                "href": "/profile/Jim-Gleeson-3"
            },
            "answer_text": "Sure anyone can write a book, but I don’t think that anyone can write a good one. A good book takes time, effort, some talent, and patience to write. The less talent you have, the more effort, time, and patience it is going to take. Also, if the book isn’t that good, but in a form that you think is good enough for publishing, you will then have to consider self-publishing. At that point, it will require more effort to typeset and format your book, or consider paying for an editor and typesetter, not to mention an artist to create the cover of the book. But the short answer is yes, but with the caveat that not anyone can write a good one. ",
            "date": "Answered June 27, 2017",
            "views": "446",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Jackson Carter",
                    "user_href": "/profile/Jackson-Carter-68"
                }
            ]
        },
        {
            "author_info": {
                "name": "Elizabeth Emond",
                "href": "/profile/Elizabeth-Emond-5"
            },
            "answer_text": "Given: the widespread illiteracy in this world, andthe conditions of poverty that some people have to endure, robbing them of time, energy, and resources,I think the question should be “Does every person have the potential to write a book?” And to that, I answer yes. Maybe not a long book, maybe not a good book, but a book nonetheless. ",
            "date": "Answered June 7, 2020",
            "views": "48",
            "upvotes": " Answer requested by Jackson Carter",
            "upvoters": [
                {
                    "user_id": "Harvey Ardman",
                    "user_href": "/profile/Harvey-Ardman-1"
                },
                {
                    "user_id": "Lalie Vleugels",
                    "user_href": "/profile/Lalie-Vleugels"
                },
                {
                    "user_id": "Rajasekhar",
                    "user_href": "/profile/Rajasekhar-45"
                },
                {
                    "user_id": "Sunil Sharma",
                    "user_href": "/profile/Sunil-Sharma-1799"
                },
                {
                    "user_id": "Sandeept (Ankit) Dhakal",
                    "user_href": "/profile/Sandeept-Ankit-Dhakal"
                },
                {
                    "user_id": "Aleena Afzal",
                    "user_href": "/profile/Aleena-Afzal"
                }
            ]
        },
        {
            "author_info": {
                "name": "Evelyn Elwell Uyemura",
                "href": "/profile/Evelyn-Elwell-Uyemura"
            },
            "answer_text": "Oh heavens, no. Most people do not have the imagination to create a work of fiction, and I know that I have a hard time remembering the plot of a long book long enough to read it—which takes maybe 10 days, while an author has to keep the story straight in their mind for a year or so. Plus, when people do NaNoWriMo, they write 50,000 words of a novel during the thirty days of November. or about 1600 words a day.(about 6 pages, double-spaced.) Most people find that very very challenging, to sit down every day and add 1600 words to their story—but a real novel is more like 80,000–100,000 words or more. And almost nothing publishable comes out of it—ok, well, 14 books have. 14 NaNoWriMo Books That Have Been Published ",
            "date": "Answered June 7, 2020",
            "views": "78",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Jonathan Chiu",
                    "user_href": "/profile/Jonathan-Chiu-27"
                },
                {
                    "user_id": "Elizabeth Emond",
                    "user_href": "/profile/Elizabeth-Emond-5"
                },
                {
                    "user_id": "Garry Taylor",
                    "user_href": "/profile/Garry-Taylor-5"
                }
            ]
        },
        {
            "author_info": {
                "name": "Paul Larkin",
                "href": "/profile/Paul-Larkin-9"
            },
            "answer_text": "Does every person have the ability to write a book? = Yes. We can all write something. Just write down what has happened to you in life. Bang. You have written a book. The question is - is it interesting and will anyone read it? It is the quality of the writing that prevents people from writing a book. They fear the ridicule if it is not ‘good enough’ so they never start. But yes, everyone has the potential to write a book. ",
            "date": "Answered June 7, 2020",
            "views": "47",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "David Marshall",
                    "user_href": "/profile/David-Marshall-206"
                }
            ]
        },
        {
            "author_info": {
                "name": "Francisco Ojeda",
                "href": "/profile/Francisco-Ojeda-12"
            },
            "answer_text": "I believe that anyone can write. Then, there are some that can develop a story. There are then less than can build a coherent story. Finally, there are few that have the patience, tolerance, discipline, organization, and forthright to complete their written project, edit, query an agent, then submit for traditional publishing or proceed through self-publishing. ",
            "date": "Answered June 8, 2020",
            "views": "36",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Christy Long",
                    "user_href": "/profile/Christy-Long-11"
                },
                {
                    "user_id": "Royall Osmund",
                    "user_href": "/profile/Royall-Osmund"
                },
                {
                    "user_id": "Lela Aldis",
                    "user_href": "/profile/Lela-Aldis"
                }
            ]
        },
        {
            "author_info": {
                "name": "Frank Elliott",
                "href": "/profile/Frank-Elliott-5"
            },
            "answer_text": "That’s a “loaded question.” Sure. Even a two-year-old “can” (is allowed to) write a book. But given infant-sized controls, would you trust a two-year-old to drive your vehicle (before they learn enough rules of the road to do so safely)? There is nothing stopping you from writing a book. Millions have done that over millennia. However having your book published is something else entirely. ",
            "date": "Answered June 26, 2017",
            "views": "260",
            "upvotes": " Answer requested by Antanas Bibkevicius",
            "upvoters": [
                {
                    "user_id": "Uday Kachhela",
                    "user_href": "/profile/Uday-Kachhela"
                },
                {
                    "user_id": "Wu Emily",
                    "user_href": "/profile/Wu-Emily-5"
                }
            ]
        },
        {
            "author_info": {
                "name": "Nick Travers",
                "href": "/profile/Nick-Travers-2"
            },
            "answer_text": "Yes…and No. Yes, anyone can attempt to write a book, either fiction or non-fiction. No, not everyone will have the dedications/time/stubbornness, to complete a book or learn the skills required. But, don’t let that hold you back: make a start, have a go, see where it leads. Nick ",
            "date": "Answered June 26, 2017",
            "views": "468",
            "upvotes": " View 6 Upvoters",
            "upvoters": [
                {
                    "user_id": "Renee Goodwin",
                    "user_href": "/profile/Renee-Goodwin-4"
                },
                {
                    "user_id": "Sue Sanders",
                    "user_href": "/profile/Sue-Sanders-3"
                }
            ]
        },
        {
            "author_info": {
                "name": "Brian Dodd",
                "href": "/profile/Brian-Dodd-17"
            },
            "answer_text": "Christopher Hitchens said: “Everybody does have a book in them, but in most cases that’s where it should stay.” In other words, just because you can write a book doesn’t mean it’ll be any good. ",
            "date": "Answered June 7, 2020",
            "views": "31",
            "upvotes": " View 3 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Jackson Carter",
                    "user_href": "/profile/Jackson-Carter-68"
                }
            ]
        },
        {
            "author_info": {
                "name": "Armando Anguiano",
                "href": "/profile/Armando-Anguiano-4"
            },
            "answer_text": "Yes, I think so. An autobiography or something where they can relay first-hand information and experience. It could be part fiction just to make it more interesting, as long as names and dates have been changed to protect the innocent. I have been toying with the idea myself, it's on my bucket list. First I need to think of a title and probably work backwards. I’m leaning towards, “The Return of the Romantic Busboy, or If This is Tuesday, We must be in Disneyland” ",
            "date": "Answered June 7, 2020",
            "views": "23",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Malindu Kumaradasa",
                "href": "/profile/Malindu-Kumaradasa"
            },
            "answer_text": "Yes. If you have good imagination and strong will, there’s nothing to stop you. Any book will not be a success. But every writer learns through experience. Eventhough I'm not even a published writer yet, my years of experience gave me lots of good and bad; the good which gave me more hope and bad which gave me more motivation to continue my fight. So I say, the will is the most important. Thank you! ",
            "date": "Answered March 30, 2017",
            "views": "203",
            "upvotes": " View 1 Upvoter "
        },
        {
            "author_info": {
                "name": "Mia Utami",
                "href": "/profile/Mia-Utami"
            },
            "answer_text": "yes of course. everyone can write a book, and nowadays it’s so easy to write and post it into everywhere, many platforms are available such as Amazon’s Kindle, Smashwords or any others you could find on internet. ",
            "date": "Answered August 5, 2019",
            "views": "52",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Aakash Punatar",
                "href": "/profile/Aakash-Punatar"
            },
            "answer_text": "Anyone can write a book. I have wrote one without any writing experience. Believe me writing is the beautiful things. It's like you are the creator of beautiful world and you woven your feelings with medical words. Listen to heart by Aakash Punatar is my first book. http://www.amazon.in/Listen-Heart-Aakash-Punatar/dp/1482859025 ",
            "date": "Answered June 29, 2017",
            "views": "378",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Nicole Chen Robles",
                "href": "/profile/Nicole-Chen-Robles"
            },
            "answer_text": "Of course you can. Everyone can. You just need to learn how to trust yourself first that you would be able to write something remarkable. Everyone starts off from scratch and once you have a few ideas playing inside your head, that’s when it’ll all start rolling in. You just need determination and believe in yourself to do so xx ",
            "date": "Answered July 11, 2019",
            "views": "142",
            "upvotes": " View 3 Upvoters"
        },
        {
            "author_info": {
                "name": "Regina Addison Riley",
                "href": "/profile/Regina-Addison-Riley"
            },
            "answer_text": "Well, yes, anyone can write a book. Anyone can also publish a book through self-publishing or vanity publishing. Will the book sell or will anyone read it? It’s easy to publish a book, it’s hard to get anyone to read it or review it. ",
            "date": "Answered June 23, 2019",
            "views": "35",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Adam E. Badenhorst",
                "href": "/profile/Adam-E-Badenhorst"
            },
            "answer_text": "Yes, anyone can write a book provided they have 3 fundamental things : Compelling story to tellDeterminationSupport structure including an editor or proofreaderYou need these three as they work together and help the author continue. There may be other factors like research but those other items depend on the specific book and topic. ",
            "date": "Answered December 18, 2019",
            "views": "60",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Carlos Ortet",
                "href": "/profile/Carlos-Ortet"
            },
            "answer_text": "If you have ever read a book, you can write one. I would add that to write a book does not necessarily makes you a writer. As in many other practices the question is why you’d write a book rather that if you ‘can’ do it. Anyone that has got a good reason or a specific motivation or if someone simply enjoy doing so, surely can write a book. ",
            "date": "Answered June 26, 2017",
            "views": "241",
            "upvotes": " View 2 Upvoters"
        },
        {
            "author_info": {
                "name": "Thomas Hockman",
                "href": "/profile/Thomas-Hockman-1"
            },
            "answer_text": "Lots of people can write a book, but there are few editors, and fewer authors who will listen to their editor. The best bet is a ghost writer who interviews you for your life story, then they write it and sign your name. ",
            "date": "Answered June 7, 2020",
            "views": "21",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Mohamed Ibrahim",
                "href": "/profile/Mohamed-Ibrahim-771"
            },
            "answer_text": "Indeed ,any one can write anything but it is not the point it depends on what he writes about and if he can continue writing because the writer has passion for writing and he won't write a book if he doesn't have that ",
            "date": "Answered July 10, 2017",
            "views": "93",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Lawrence Watt-Evans",
                "href": "/profile/Lawrence-Watt-Evans"
            },
            "answer_text": "No; you need to be literate, or at least capable of speech. ",
            "date": "Answered June 22, 2019",
            "views": "35",
            "upvotes": " View 2 Upvoters "
        },
        {
            "author_info": {
                "name": "Steven Gale",
                "href": "/profile/Steven-Gale-3"
            },
            "answer_text": "To an extent, yes. Even someone with a below-average writing ability can still use a proofreader and editor before publication. Alternatively, write whatever you want and put it up on Amazon Kindle. ",
            "date": "Answered June 26, 2017",
            "views": "120",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Claude Lambert",
                "href": "/profile/Claude-Lambert-1"
            },
            "answer_text": "Sure, there are about a million new books every year. A large number of these books are written by “anybody”, and some are very good and some not so much. ",
            "date": "Answered June 25, 2017",
            "views": "142",
            "upvotes": " Answer requested by Antanas Bibkevicius"
        },
        {
            "author_info": {
                "name": "Brian Hoffman",
                "href": "/profile/Brian-Hoffman-138"
            },
            "answer_text": "Yes. The real question is are you willing to put the work in to actually do it. Study and practice is the secret. Then apply what you’ve learned and write a better piece. Repeat. ",
            "date": "Answered June 7, 2020",
            "views": "18",
            "upvotes": " Answer requested by Jackson Carter"
        },
        {
            "author_info": {
                "name": "David Townsend",
                "href": "/profile/David-Townsend-37"
            },
            "answer_text": "A large percentage of people can barely put a sentence together, let alone write a book. Besides, you have to have something to say to write a book, even if it’s ghost written by somebody else. ",
            "date": "Answered June 7, 2020",
            "views": "23",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Rebecca Forster",
                "href": "/profile/Rebecca-Forster-10"
            },
            "answer_text": "Yes, every person has the ability, the question will be do they have the will? The creativity? The discipline? ",
            "date": "Answered June 7, 2020",
            "views": "24",
            "upvotes": " View 1 Upvoter "
        },
        {
            "author_info": {
                "name": "Brian Good",
                "href": "/profile/Brian-Good-6"
            },
            "answer_text": "Probably everybody who has the persistence can write a manuscript of 200 pages. Maybe they will have difficulty finding a publisher,maybe not. ",
            "date": "Answered June 7, 2020",
            "views": "24",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "R.G Woodhar",
                "href": "/profile/R-G-Woodhar"
            },
            "answer_text": "Yes. It is very possible for anyone to write a book. It’s a matter of whether you are prepared to put the time and dedication in. ",
            "date": "Answered June 27, 2019",
            "views": "14",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "John Giarla",
                "href": "/profile/John-Giarla"
            },
            "answer_text": "No alot of people. Can't. Reador write. ",
            "date": "Answered June 7, 2020",
            "views": "22",
            "upvotes": "0"
        }
    ]
}