{
    "title": "Can myths be real? - Quora",
    "tags": [
        "Mythical Creatures",
        "Common Misconceptions",
        "Myths, Legends and Untruths",
        "Reality",
        "Mythology",
        "Belief and Beliefs",
        "Religion",
        "Psychology of Everyday Life"
    ],
    "response": [
        {
            "author_info": {
                "name": "Steven Ussery",
                "href": "/profile/Steven-Ussery"
            },
            "answer_text": "Some philosophers and psychologists believe that myths are actually allegories that represent a metaphor for a symbolic truth that is hidden in the story they tell. Folk tales or stories have a similar effect. I am not sure if this is always the case, but it is certainly true some of the time. The subconscious mind sometimes communicates in metaphors and allegories. Or, so Sigmund Freud thought. This is one of the rare cases where I think he was actually substantially correct. ",
            "date": "Answered January 24, 2020",
            "views": "127",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Rachita Chandra",
                    "user_href": "/profile/Rachita-Chandra-4"
                }
            ]
        },
        {
            "author_info": {
                "name": "Dion Shaw",
                "href": "/profile/Dion-Shaw-3"
            },
            "answer_text": "By definition, a myth: a traditional or legendary story, usually concerning some being or hero or event, with or without a determinable basis of fact or a natural explanation, especially one that is concerned with deities or demigods and explains some practice, rite, or phenomenon of nature. (From dictionary dot com)However, as Steven Ussery points out, some myths are consider as allegories for previous events. While an event may have happened, a myth would blow it out of proportion and through retelling is modified from the original event. ",
            "date": "Answered January 24, 2020",
            "views": "98",
            "upvotes": "0"
        }
    ]
}