{
    "title": "Can a teacher talk about their religious views in class? - Quora",
    "tags": [
        "Teachers",
        "Teaching"
    ],
    "response": [
        {
            "author_info": {
                "name": "Colin Jensen",
                "href": "/profile/Colin-Jensen"
            },
            "answer_text": "First off, there's no way you can get your teacher in trouble.  If you're at a public school, the principal can scare her into being silent; and at a private school they could fire her (but they don't have any religion rules at a private school.)  And in either case, if she knows you're the one who jokes about it, she'll retaliate and good luck being able to prove that. I am not a lawyer, so this answer is for entertainment purposes only, but I was a teacher and a Principal: Your teacher can answer any questions.  The limits are on what she can volunteer, especially out of place within the context of the subject and the class.  Meaning she could say \"Hangover tricks?  I don't know; you guys know I don't drink for religious reasons,\" but not \"Hangover tricks?  Well the Bible says drinking is defiling the temple of your body, and that's good enough for me!\"She cannot be forced to do what she considers lying or to violate her conscience.  If she's sincerely anti-evolution (and you'll statistically never find someone who is, but that's a specter atheists bring up), she can't be forced to say she believes in evolution.She doesn't have to hide her religion.  Meaning she can wear a cross, or keep a bible on her desk, as long as it's not overtly kept in view for advocacy purposes.She, any judge, and anyone involved knows about \"tacit approval.\"  That means that not saying anything is still saying something.  She thus cannot be forced to stay silent when she believes that staying silent will be taken as approval of something that religiously offends her.  So if you say \"everyone has pre-marital sex!\" she cannot be withheld from saying \"Everyone does not.  I think that's a very bad idea.\"  etc.  She doesn't have to have a rational argument for why she thinks it's a bad idea--it's inherently a cultural argument, so when people say \"well she should just stay out of it because it's a science class and it's not science!\" that's the equivalent of saying \"you have to give your stamp of approval to this idea, and because the kids can't tell you apart from your ethnicity, you're basically telling them all Methodists believe that this thing that offends you is what God wants!\"  Again, kindergarteners have different ears than college kids.She can't lead a prayer, nor pray in front of students (because that's leading a prayer), but she can pray on her own.  She also can't stop students from praying.  When I was in high school our principal was so afraid of lawsuits that he'd stop students from praying.  That's crazy.She's of course totally free if what you're describing is just a euphemism to her--meaning if \"The square root of infinity?  I dunno... God?\" is no more religious than saying \"Oh My God!\"Note that everything is dependent on the audience.  If she's teaching kindergarteners, then it's virtually impossible not to have some kid talk about God in every class.  And everything she says will be taken as truth.  If she's teaching college kids, they're adults, they should be able to handle a variety of ideas, and they're old enough to disagree without having cops silence the challenging idea.  The sweet spot is impressionable junior high and high school kids, who aren't old enough to talk back, who idolize their teachers and project all kinds of authority onto teachers in general, whose parents are paranoid and paying attention, and those are the kids most likely to try to get you in trouble anyway.She can't advocate her religion or a particular religion.  As a former principal, I'd call the same on someone who advocated atheism.  Teachers are of course stand-ins both for the government here, so balancing their personal rights and in loco parentis rights, they are bound by the Constitution.  But also remember that there are literally millions of pages interpreting the Constitution, so don't go insisting your casual face-value reading is the one the court would hold up.And of course she can be as religiously active on her own time as she wants, and that may spill over, as her picture is in the paper for some community event.  She doesn't have to pretend she doesn't know kids who go to her church, or pretend she doesn't remember where she knows them from.  Or if some kid calls her Sister Brown, she doesn't have to pretend she doesn't hear them.This also means the school can't not-hire her for any of the above reasons.  A lot of HR people are afraid to hire applicants for whom it is in any way obvious what religion they are from their resume (including simply what college they went to, or if they worked or volunteered for a church, etc.)  That's not only silly, but highly illegal, and could net that applicant enough that they'll never have to work again.See these (and note where they agree and disagree): Religion in the Public SchoolsTeaching Tolerance - Diversity, Equity and JusticeJoint Statement of Current Law on Religion in the Public SchoolsA million bonus points if you read all three of those.  Just note that they're all fuzzy opinions on fuzzy rules, and literally everything in there could change or could be incorrect.  And those lists were from 3 generally anti-religious groups.  That's why there's judges and juries and whatever. ",
            "date": "Answered April 1, 2016",
            "views": "55",
            "upvotes": " View 7 Upvoters",
            "upvoters": [
                {
                    "user_id": "Eugene Vivino",
                    "user_href": "/profile/Eugene-Vivino"
                },
                {
                    "user_id": "Alisia Mahoney",
                    "user_href": "/profile/Alisia-Mahoney"
                },
                {
                    "user_id": "Tom Clemans",
                    "user_href": "/profile/Tom-Clemans"
                },
                {
                    "user_id": "Allen Craig Bishop",
                    "user_href": "/profile/Allen-Craig-Bishop"
                },
                {
                    "user_id": "Israel Ramirez",
                    "user_href": "/profile/Israel-Ramirez"
                },
                {
                    "user_id": "Joe Vozzo",
                    "user_href": "/profile/Joe-Vozzo"
                },
                {
                    "user_id": "Glen Tarr",
                    "user_href": "/profile/Glen-Tarr"
                }
            ]
        },
        {
            "author_info": {
                "name": "Matt Johnson",
                "href": "/profile/Matt-Johnson-8"
            },
            "answer_text": "I see. This one can be tricky. Let me start off by saying that I don't know the specific context. It is entirely possible that were I in your classroom, I'd have no issue with what the teacher was saying. But I have been bothered by stuff like this myself. Both when I was a student and since I've become a teacher. Here's what I believe: If a teacher is really focused on the nature of science with a solid philosophical basis, then science and religion shouldn't need to conflict with each other. Science is a process for figuring out the physical world, religion is more of a personal journey coming to turns with your own life & death and what it means to you. I talk about this early in the year with my students both because I want my students to really understand what science is and what it is not, and because I want kill off any tendency in my students to think that I intend to be in competition with their religious beliefs. In doing so I try to avoid talking about my religious beliefs, because doing so would only undermine my authority, but I do talk some about \"God\". Sounds like your teacher doesn't really think it through like that, and that's too bad, but it's also to be expected that this happens. There isn't anything along the way that's required for a future science teacher to keep this from happening, and even if something like this was in your teacher's background, this alone wasn't going to cause the teacher to flunk out of the preparation. So it doesn't sound great, and that's too bad. The question is: How serious is it? I can't answer that for you, but what I would say is that if it were serious enough, I'd tell someone at your school about it - either directly, or have my parents do it.  Be careful though, and not just because in doing so you're potentially putting yourself in the middle of conflict. While what you're talking about is an issue, you should do your best to really ask yourself how big of an issue it is compared to other issues at your school. That's asking you to be pragmatic, which I know can be tough, but you're only going to want to say something if you think it can make things better, and I will tell you that it would be pretty hard to imagine this teacher getting fired or reassigned just with this issue unless the teacher reacts really poorly in response to be asked about it. Last let me say: In case it wasn't clear, if the teacher is generally reasonably, the most likely action to make things better would be just to talk to them about it, or leave them a note. Teachers don't typically want to make their students uncomfortable, and so it's quite possible this teacher has no idea the effect they're having. ",
            "date": "Answered April 1, 2016",
            "views": "23",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Nikita Gupta",
                    "user_href": "/profile/Nikita-Gupta-121"
                },
                {
                    "user_id": "Jason Whyte",
                    "user_href": "/profile/Jason-Whyte"
                },
                {
                    "user_id": "Marc Bodnick",
                    "user_href": "/profile/Marc-Bodnick"
                },
                {
                    "user_id": "Colin Jensen",
                    "user_href": "/profile/Colin-Jensen"
                }
            ]
        },
        {
            "author_info": {
                "name": "C.S. Friedman",
                "href": "/profile/C-S-Friedman"
            },
            "answer_text": "Can they?  Yes.  Should they?  No.  It is possible that students who do not share your beliefs will be upset or confused by something you say -- particularly young kids raised to different beliefs--and since you are a teacher they will not feel comfortable talking to you about it.  Furthermore, since a teacher's word is seen as authoritative, your words may have impact beyond \"i'm just telling them what I believe\".  in today's world, that is particularly sensitive. that does not mean you cannot identify what faith you belong to, if asked, but any discussion should be limited to a non personal explanation of what that religion believes, just as any other subject would be studied.   Teachers are not supposed to talk to kids about their religious beliefs for the same reason they are not supposed to talk to kids about their political beliefs.  The class should be a neutral environment where kids will not feel inhibited by awareness of the teacher's bias.  a teacher explainig why he thinks one faith is \"right\"implies that he thinks other faiths are \"wrong\".  That may include the child's own belief system. ",
            "date": "Answered April 1, 2016",
            "views": "12",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Juliane Purves",
                    "user_href": "/profile/Juliane-Purves"
                },
                {
                    "user_id": "Colin Jensen",
                    "user_href": "/profile/Colin-Jensen"
                }
            ]
        },
        {
            "author_info": {
                "name": "Spencer Johnston",
                "href": "/profile/Spencer-Johnston-13"
            },
            "answer_text": "Is she saying it jokingly, half joking, or seriously? Your teacher is treading on thin ice, depending on where you are. In this day and age it would be very easy in many places for a student to complain to parents who would see it as a violation of their rights. That could easily be interpreted as advocating for the belief in God to students, a big no-no for public school teachers. I think she could very well get fired in many states. Maybe it would be harder in states with strong teachers unions, but it`s not impossible. She would be accused of violating Constitutional rights after all. In other places, though, it would be more tolerated, as in communities where most people share similar religious views. ",
            "date": "Answered February 8, 2017",
            "views": "843",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Scott Martin",
                "href": "/profile/Scott-Martin-274"
            },
            "answer_text": "If your science teacher offers God as an answer for anything scientific, she shouldn't be a science teacher.  She's doing you all a great disservice. I'll assume that your school district's science curricula don't include teaching students that God is the explanation for any scientific question.  So it stands to reason that your teacher is wrong scientifically and officially to bring God into the science classroom.   You might consult a school student adviser on this, or you might go as far as to register an official complaint.  Don't let it stand.    ",
            "date": "Answered April 1, 2016",
            "views": "672",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Teresa Gemellaro",
                    "user_href": "/profile/Teresa-Gemellaro"
                },
                {
                    "user_id": "Dan Pres",
                    "user_href": "/profile/Dan-Pres-1"
                },
                {
                    "user_id": "Glen Tarr",
                    "user_href": "/profile/Glen-Tarr"
                }
            ]
        }
    ]
}