{
    "title": "Can anyone write a poem about a poem? - Quora",
    "tags": [
        "Writing Poetry",
        "Poems",
        "Poetry",
        "Creative Writing",
        "Literature"
    ],
    "response": [
        {
            "author_info": {
                "name": "John James Morton",
                "href": "/profile/John-James-Morton"
            },
            "answer_text": "Nihilist Your desire: the poem as immaculate starTo coruscate above the arctic pole.Unattainable aloneness. Crystal fire.Praising ascetics who died in perfectMuteness — sickened of humored mortality;Those who despised the muck of settlements,The villages of hearths, sad jokes and snowshoes.We, the tramping neighbors, keep the legends,Storing tall tales, crazed feats and expeditions;Though when we perish, vanished in the blizzard,It’s not for ice light-blinded frenzied vision,But only from our accidental lives. We know the dripping eaves that tap out madness,The cave within the blackest of the nights,The howl that twists our guts in growing older,The wind that blasts our ears with rage of loss.We do not button up to get quite cozy;It merely fends off chill in being us.Brisk ballads have us dance our melancholy,Knit quondam joys in flash of quilted rags.Do woven words seem something less than art?They clothe the naked self in warmth of need. You cannot stave the fear that makes you run.May dreams awake you. Sleep is the rising sun. ",
            "date": "Updated July 15, 2020",
            "views": "385",
            "upvotes": " View 3 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Patricia Falanga",
                    "user_href": "/profile/Patricia-Falanga"
                },
                {
                    "user_id": "Jacquelyn McBain",
                    "user_href": "/profile/Jacquelyn-McBain"
                },
                {
                    "user_id": "Tanya",
                    "user_href": "/profile/Tanya-417"
                }
            ]
        },
        {
            "author_info": {
                "name": "Abhishek Rijwani",
                "href": "/profile/Abhishek-Rijwani"
            },
            "answer_text": "A Poem about a poem is a challenging thing, It's like a poet's love and engagement ring. Emotions, feelings, gratitude, philosophy..... For a literature lover, a poem is a morning coffee. A combination of 26 alphabets, Collectively describes the depth and the crest ! The soul is submerged while a poem is composed, The veins are high, goose bumps froze ! Deep inside lies a beautiful world, Experiences matter to share with the world. A poem is not a poem indeed.... It's your heart's addiction just as weed ! Expressing the feelings into words, Freedom to fly just like birds ! A door once opened never shuts, Once a poet, always a Poet ! Edit 1: I've written few more. You can check it out @ www.loveatstroke.blogspot.in ",
            "date": "Updated June 13, 2016",
            "views": "737",
            "upvotes": " View 11 Upvoters",
            "upvoters": [
                {
                    "user_id": "Kurt Aristide",
                    "user_href": "/profile/Kurt-Aristide"
                },
                {
                    "user_id": "Ruchi Chavda",
                    "user_href": "/profile/Ruchi-Chavda"
                },
                {
                    "user_id": "Sasikanth Reddy E",
                    "user_href": "/profile/Sasikanth-Reddy-E"
                },
                {
                    "user_id": "Pooja Hariom Singh",
                    "user_href": "/profile/Pooja-Hariom-Singh"
                },
                {
                    "user_id": "Abhilash Unnikrishnan",
                    "user_href": "/profile/Abhilash-Unnikrishnan-2"
                },
                {
                    "user_id": "Bharati",
                    "user_href": "/profile/Bharati-36"
                },
                {
                    "user_id": "Vivek Kumar Tiwari",
                    "user_href": "/profile/Vivek-Kumar-Tiwari-6"
                },
                {
                    "user_id": "Prafulla Patwardhan",
                    "user_href": "/profile/Prafulla-Patwardhan"
                },
                {
                    "user_id": "Aditya Pandey",
                    "user_href": "/profile/Aditya-Pandey-88"
                },
                {
                    "user_id": "Arshia Sangwan",
                    "user_href": "/profile/Arshia-Sangwan"
                },
                {
                    "user_id": "Urvashi Chaudhary",
                    "user_href": "/profile/Urvashi-Chaudhary-9"
                }
            ]
        },
        {
            "author_info": {
                "name": "Metta Ramesh",
                "href": "/profile/Metta-Ramesh"
            },
            "answer_text": "As i have entered into my 30 , i thought of writing a series of poems with name : “A Coffee and a Poem” - that contains poems about i value most in my life and without it a day cannot pass that easily .. :-) I wrote this series of poems on 6 most important things in my life 1) A coffee - a valueble medicine for my mind 2) A poem - a timepass for my soul 3) 3 valuable women in my life - without whom , there is not existence 4) The Great Michigan Lake - this poem speaks about things i learnt in past 30 years. 5) Insider - an insight into my future  Here i paste my poem on Poem :-) which i wrote in Telugu. I tried my best to translate in English though i’m not satisfied with my translation. appreciate if some one can translate it :-)!! Series Name : A Coffee and a Poem .... 2. కవిత ( a Poem )||Saturday, May 14, 2016 CDT||(c) Ramesh Metta----------------------------------------------------------- ప్రతి రోజు ... ( Every day )ఒక కొత్త జన్మ. ( a new Birth .. )ఒక కొత్త జీవితం. ( A new life ..)ఓ నూతన కోణం. ( A new perspective )రాసుకున్న రాతలు మాత్రం నిన్నటివి. ( but the things that are written are from yesterday) ట్రైన్ ఉరకలు పెడుతూంది ( train is running on it way ..)డౌన్ టౌన్ వైపు .. !! ( towards Downtown )అన్నీ వెనకకు జారుకుంటున్నాయి. ( Everything is being moved towards past)చెట్టు ( a tree )పుట్ట ( a hill )ప్రాణి సమస్తాన్ని, ( everyting from a living to living being )గడిచిన క్షణం అనే గునపంతో ( a shovel like a “second” that was passed )గతం అనే మట్టికుప్పలోకి ( into A clod of earth like “past” )కప్పేస్తోంది కాలం.. !! Destiny is burying with a shovel called “ s passed second” into A clod of earth like “past” everything from a living to living being గాలికి ఎగిరే , అందమయిన యువతి సన్నటి ముంగురులు ( a fluttering stack of hair of a beautiful women due to a a thin and cold breeze)మేని కాంతి మెరుపులు , వంపుల సమూహాలు. ( a shine of her skin , a her beautiful curves )చిన్న పాప పసితనపు నవ్వులు, ( a small child laughter )ఆటల చేష్టలు. ( and her playing )యువకుల వేషాల పోకడలు. (youth styles and their attire)వ్రుద్దుల పూర్వజ్ఞాపకాల,ముడతలు. ( a past like folding on face of old citizen)మనల్ని చూస్తున్నఅజ్ఞాత వ్యక్తుల కళ్ళల్లో,మనపట్ల అభిప్రాయపు మాటలు. ( a first impression of an unknown on US in his eyes )ఇలా మనిషి మనిషి అంతారాల్లో ఏదో మెదులుతుందన్నసంకేతాలు. (like this many feelings that were being passed in a human layer ). ఇవన్నీ కవిమస్థిష్కంలో జరుగుతున్నతీక్షనపు ఆలోచనలు. ( all these are being observed , recorded by a poet by his deep thoughts and observations) ప్రక్రుతి సోయగాలు ( a style and beauty of nature)మనుషుల భిన్న మనస్తత్వాలు. ( different perspectives of humans)స్ప్రుషించిన ప్రతీది ... ( everything that was created )ఆస్వాదించిన ప్రతీది .. ( everything that was felt )అనుభూతి చెందిన ప్రతీది... ( everythinf that was experienced )నిన్నటి జ్ఞాపకాలు ( yesteday’s memories )నేటి అనుభూతులు ( today’s experinces )రేపటి అపేక్షలు.. ( tomorrow’s expectations )మనసు నిక్షిప్తం చేసినవి ( the feelings that were recorded in heart )మనసు నిర్లక్ష్యం చేసినవి ... !! ( the feelings that were ignored by heart ) ఇలా సమస్తంలో జీవించి,కవిత అనే మూటలో,భావుకత్వ పదాలను పోసికవిత్వమనే తాడుతో కట్టి,పదిలంగా నిక్షిప్తపరిచిమరణిస్తాడుమళ్ళీ ప్రపంచాన్ని కొత్తగాచూడడం కోసం.. !! This is the way , a poet will live in everything, and pack his every feelings and thoughts safely and securely in a Sack called Poem, and will tie it with a rope called poetry and then he will die immediately , to see this world again in new perspective. మళ్ళి .. ( again .. ) మరో రోజు.. ( Another Day .. )ఒక కొత్త జన్మ. ( with a new Birth )ఒక కొత్త జీవితం. ( With a new Life .. )ఓ నూతన కోణం. ( With a new perspecive )రాసుకున్న రాతలు మాత్రం నిన్నటివి.. !! but the things that were written are from yesterday) ",
            "date": "Answered June 29, 2016",
            "views": "1",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Auro Sista (ఆరో శిష్ఠా)",
                    "user_href": "/profile/Auro-Sista-ఆరో-శిష్ఠా"
                }
            ]
        },
        {
            "author_info": {
                "name": "Auro Sista (ఆరో శిష్ఠా)",
                "href": "/profile/Auro-Sista-ఆరో-శిష్ఠా"
            },
            "answer_text": "This is a poem written by the great Telugu poet Sri Sri (Srirangam Srinivasa Rao) ‘మహాకవి శ్రీశ్రీ’ (శ్రీరంగం శ్రీనివాసరావు గారు). Krishna Sameer Achanta has already written an answer with a rendition of the poem in Telugu here కవితా! ఓ కవితా! (Kavita! O Kavita!). Kavita is a Telugu word for Poem. Here is a translation of the poem in English. Kavita! O Kavita! In my youthful ambitions Surrounded by the aura of fragrant flowers In the days when I thought of you as A beauty that one can meet in auspicious moments In a beautiful garden, a beauty unreachable! The one that wanders on the paths of the sky! For you, my life a tapas* In my quest those minutes, that intoxication Your form invisible surrounded as you Were by the circles illusionary, feign. Weren’t there times when I pined for you in my My cave, my pit, my darkness, in loneliness? Under your influence In my trained glances of perpetual pursuit In trances tranquil An invocation to the Poetic Muse In my brain which hung like Flowered arch of heaven What roars what languages and what pictures Passed through? What colourful and strange shades of Light and darkness did I see? Through what energies did My song acquire life? The collectives of battle cries from all the corners In sounds I had chosen for you; In the cloudy midnight sky Full of rain, the trumpets of the conch The beat of the drums in the Ferocious winds that reverberated in the Waves of the mid-ocean; That same night, In the thick of the forests Are they cries of different animals Crossing the boundaries of any rhythm? The deep inner endless music Within the stars, Earthquakes, the collapse of governments Rebellion, war Everything in your consciousness, The appearing as of your cosmic form Are they then the pictures that my mind’s eye shows, The commentaries I hear When I think of you? The diamond that blossomed in the pond of fire The flying metal horse The music of the drum In the feverish cannon What else did I hear? In the sleepy midnight The inner music of a young mother, dreaming- Hugging her infant, just born, The sound of the infant dreaming Of an ancient life in strange sleep, In the hospital the sound of the blood flowing In the veins of a patient lying with closed eyes With the trance of the surgeon’s spell In the twilight zones between life and death; The mad ravings of an alcoholic Slipping into a drain in an inebriated state! The starving stomach of a prostitute In wild demonic sex with half closed eyes Her sad experiences erupt in music, terrible The secrets that a head, beheaded, reveal A mad man’s crazy mind sees cinemas And cries out, like a wolf The workers who have gone on strike The fires of hunger, the cries of the wives And children of workers on strike Screams! Cries of anguish The words of one million stars The songs of one billion waterfalls A hundred thousand echoes of waves of the sea I heard them! I heard them all, My Mother! The things I saw and heard They came In great numbers Crossing the graveyards like lexicons Breaking through the chains of grammar Leaving the tight python-like hold of the meter They came, the words In a fast pace, running, galloping They entered my heart! In that whirlwind circles of words That manifested the change In what streets I wandered Going in circles when In the music I thus created My sins and weakness purged And a joyous exhilaration filled my heart I awakening for you and with all my senses alert Whatever I wrote saw Breathed, my life entering a trance like State of Samadhi* The inspiration that mesmerized me Surrendering to that divine experience The music that emerged by The meeting of love under the star crazed... My veins as the strings of veena The kiss of the divine music At the end of my life, death at my doorstep The procession of those instruments of music That held me in the wild grip like an eagle’s beak The music transcends the joys and sorrows A wonderful, profound, thoughtful, unparalleled Solitary, unique, transient and eternal moment divine! The Muse’s heart who has given me this bliss Melting my heart, Grace Incarnate, Kavita! O Kavita! Perhaps on the day You created hunger feeding My ego while I was in my mother’s womb Shapeless and sleeping, Infusing life to my inner and outer senses And sensibilities As I entered this world Experiencing the joys and sorrows And as traveller and a mendicant was In this world’s journey Going about in confusion You, Kavita, appeared with a hand of assurance Drew me into your fold Made me clean and pure! The Graceful and The compassionate, Anupamita, One with no parallel Aparimita, One who is limitless! Kavita! O Kavita! Now, today, can you hear the sighs Behind my bold imaginations? That I will write some things and That my writings would reflect my world My passion shall reach fruition and My songs will reverberate in the hearts Of my race as an incantation I strive to bring my sky closer to my world My ideas will be the sparks that light the diamonds Which I shall share with my brethren The ends of your stole Fluttering causing waves My word as your temple My song as an offering to you I will offer heartily My creative fragrance sprinkled As pollen from flowers! Oho! Delight divine! Treasure trove! Mother! O Kavita! Kavita! Kavita! O Kavita! *tapas - Pennance; *Samadhi - Deep state of meditation Source: Avakaaya.com ",
            "date": "Answered June 27, 2016",
            "views": "665",
            "upvotes": " View 6 Upvoters",
            "upvoters": [
                {
                    "user_id": "Shreyash Saripalli",
                    "user_href": "/profile/Shreyash-Saripalli"
                },
                {
                    "user_id": "Shafeea",
                    "user_href": "/profile/Shafeea"
                },
                {
                    "user_id": "Bharath Ballamudi (భరత్ బళ్ళమూడి)",
                    "user_href": "/profile/Bharath-Ballamudi-భరత్-బళ్ళమూడి"
                },
                {
                    "user_id": "Deepak KM",
                    "user_href": "/profile/Deepak-KM-4"
                },
                {
                    "user_id": "Metta Ramesh",
                    "user_href": "/profile/Metta-Ramesh"
                },
                {
                    "user_id": "Krishna Sameer Achanta",
                    "user_href": "/profile/Krishna-Sameer-Achanta"
                }
            ]
        },
        {
            "author_info": {
                "name": "Amith Chhabria",
                "href": "/profile/Amith-Chhabria"
            },
            "answer_text": "Oh, yes. One such poem was an actual inspiration for me to start writing poems. I present to you a poem by Kenn Nesbitt, a children's poet. I Have to Write a Poem[1] From the book The Tighty-Whitey Spider I have to write a poembut I really don’t know how.So maybe I’ll just make a rhymewith something dumb, like “cow.” Okay, I’ll write about a cow,but that’s so commonplace.I think I’ll have to make her be…a cow from outer space! My cow will need a helmetand a space suit and a ship.Of course, she’ll keep a blasterin the holster on her hip. She’ll hurtle through the galaxyon meteoric flightsto battle monkey aliensin huge karate fights. She’ll duel with laser saberswhile avoiding lava sprayto vanquish evil emperorsand always save the day. I hope the teacher likes my tale,“Amazing Astro Cow.”Yes, that’s the poem I will writeas soon as I learn how. Footnotes[1] I Have to Write a Poem",
            "date": "Answered June 19, 2017",
            "views": "193",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Deepak P. Chhabria",
                    "user_href": "/profile/Deepak-P-Chhabria"
                }
            ]
        },
        {
            "author_info": {
                "name": "Denis Martindale",
                "href": "/profile/Denis-Martindale"
            },
            "answer_text": ": CAN ANYONE WRITE A POEM ABOUT A POEM? : : When I was but a little lad, As quiet as a mouse, I looked up to my Mum and Dad Who walked about the house… I crawled upon the floor below, Not knowing how to stand, But God gave me the chance to grow For greater things still planned… : And so, one day, I stood upright, Upon my legs so frail And gave my parents quite a fright, In fact, each one went pale… But time passed by and I walked well And later on, could run, But sometimes I’d just sit a spell, Read poems one-by-one… : I vowed a poet I’d soon be, With great enchantments shared, Such that the world could know of me, If I took time and cared, Then edited to do my best And thought and thought and thought, So that my readers could be blessed By poems long and short… : Two thousand poems have been penned, Typed out, then put on-line, Sometimes a poem’s like a friend, Much more so when it’s mine… And I can write one on the spot, Just like I’m doing now, Without a single theme or plot, Just start it off somehow… : Not everyone could write like that, Some really take their time, I’ve finished in five minutes flat Before they’ve got a rhyme… But if their written work looks great, Well, that’s alright by me, Because I’m glad to celebrate Theirs and my poetry! : : Denis Martindale June 2016. : : ",
            "date": "Answered June 13, 2016",
            "views": "134",
            "upvotes": " View 2 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Vivek Kumar Tiwari",
                    "user_href": "/profile/Vivek-Kumar-Tiwari-6"
                },
                {
                    "user_id": "Aditya Pandey",
                    "user_href": "/profile/Aditya-Pandey-88"
                }
            ]
        },
        {
            "author_info": {
                "name": "Karen Tsakos",
                "href": "/profile/Karen-Tsakos"
            },
            "answer_text": "Here is a very silly poem that fits the bill: Infractions I’m well off the road,busy with paper and penwhen the daylight I’m in starts to strobe white and red:a state trooper’s car is behind me.“I don’t know if you write poems, Sir,”I chirp in voice so twee,“but lots of poets have writing hot spots, and this Palisades Parkway is mine. . . .” I’m appraised through mirrored sunglasses and the Trooper extends his hand:“Can I see that please, Ma’am?”Shamed by my weak second stanza, I hand it over. He reads the poem for way too long. What can I have done wrong?Heinous infractions whirl through my head Like bees choosing places to strike. At last, unsmiling, he gives my pages back.One hand on the window frame, one on his holstered gun he leans in toward me, big teeth in a grimace. “The second stanza needs work,” he says.He straightens up and, fists on hips,glares into the distance.“Have a good day, Ma’am. Try not to strain for effect.” ",
            "date": "Answered August 15, 2019",
            "views": "106",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "John James Morton",
                    "user_href": "/profile/John-James-Morton"
                },
                {
                    "user_id": "Milen Semkov",
                    "user_href": "/profile/Milen-Semkov"
                }
            ]
        },
        {
            "author_info": {
                "name": "Yash Shah",
                "href": "/profile/Yash-Shah-184"
            },
            "answer_text": " ​ Once upon a time is how it all starts,From past to present the train departs.Comical, emotional, drama, feels,All kinds of stations she deals.As she sets her wheels on motion,Enclosed with deep jungles of words,Riding through tunnels of emotion,Midst skies with metaphorical birds.As she stretches new roads,Through rivers of wisdom's abode.Nothing stops her on its way,Fueled with ink, graphite and digital grays.Higher she climbs,On mountains of rhymes,Doing her zigzag schemes,Absconding the ghats behind.But now the time has come to part,For it must end and leave its mark,The tracks, the banks and the empty roads,All will witness her embarked codes. ",
            "date": "Answered June 10, 2016",
            "views": "286",
            "upvotes": " View 10 Upvoters",
            "upvoters": [
                {
                    "user_id": "Atharva Dhatingan",
                    "user_href": "/profile/Atharva-Dhatingan"
                },
                {
                    "user_id": "Vivek Kumar Tiwari",
                    "user_href": "/profile/Vivek-Kumar-Tiwari-6"
                },
                {
                    "user_id": "Ritwik Butte",
                    "user_href": "/profile/Ritwik-Butte"
                },
                {
                    "user_id": "Urvashi Chaudhary",
                    "user_href": "/profile/Urvashi-Chaudhary-9"
                },
                {
                    "user_id": "Annie Jones",
                    "user_href": "/profile/Annie-Jones-28"
                },
                {
                    "user_id": "Mayank Jain",
                    "user_href": "/profile/Mayank-Jain-101"
                },
                {
                    "user_id": "Pranav Pandey",
                    "user_href": "/profile/Pranav-Pandey-9"
                },
                {
                    "user_id": "Kanika Sharma",
                    "user_href": "/profile/Kanika-Sharma-189"
                },
                {
                    "user_id": "Aditya Pandey",
                    "user_href": "/profile/Aditya-Pandey-88"
                },
                {
                    "user_id": "Paraj Nagdive",
                    "user_href": "/profile/Paraj-Nagdive"
                }
            ]
        },
        {
            "author_info": {
                "name": "Vignesh Ramamurthi",
                "href": "/profile/Vignesh-Ramamurthi"
            },
            "answer_text": "'கவிதை'யே → A simple Tamil Poem about a Tamil Poem உனை வர்ணிக்கவோ சொற்கள் போதவில்லை; மெருகேற்ற கற்பனையும் போதவில்லை… (Words in my language are not enough and my imagination is also not enough to portray your beauty) ………………………………………………………………………………………………………….. ஆயிரம் அணிகளை அணிந்தவளே, பல்லாயிரம் பைத்தியங்களை உருவாக்கிவிட்டாய்... (You beautify yourself with thousands of ornaments and made thousands of people go mad on you) → In Tamil we classify each poem on it’s sense(Ornaments - humor/sarcasm/Distress) and poets go to another world (without conscience - mad)while writing ………………………………………………………………………………………………………….. மூன்றெழுழுத்துக்களால் ஆனவளே முவ்வுலகினையும் ஈர்த்துவிட்டாய்... (You are just a three letter word but attracted all the three worlds with your beauty)→(கவிதை - which means poem in Tamil, its a three letter word and it has attracted all the three worlds (according to Tamil classics, we classify the worlds as மேலோகம் (Sky) / பூலோகம் (our world) / பாதாள உலகம் (Underworld) )) ………………………………………………………………………………………………………….. எண்ணில்லா தோற்றங்களில் வருபவளே எவ்வளவு ஏற்றங்களை கண்டுவிட்டாய்... (You have different shapes and sizes and your beauty is growing day by day due to the improvisation made by poets on you) → (There are so many types of Poems depending on the stances and the number of words in each line,etc., and this has been improvised in so any different ways by each poet) உணர்ந்து எழுதுகிறேன் உன்னை, உன்னால் கனவில் தொடுகிறேன் விண்ணை... (Dear Poem, I really feel you inside me when I write you and touch the sky while writing you) ………………………………………………………………………………………………………….. மெய்மறந்து, மெய்கலந்து, கற்பனையென்ற கடலில் விழுந்து, தேடினேன் முத்துக்களை... (I don’t feel that I have a body but feeling only the presence of my soul while writing you and I am writing only the truth. To enhance you beauty, i am searching in my dream of ocean for pearls ) ………………………………………………………………………………………………………….. எடுத்ததோ சில முத்தில்லா சிப்பிகளை; கிடைத்ததைக் கோர்த்துள்ளேன் மாலையாக, ………………………………………………………………………………………………………….. உனைக் கற்பனை செய்ததோ ஐம்பொன் சிலையாக, ஏற்றுக்கொள் பிடித்திருந்தால்... (But my imagination is not enough to get you pearls but some oysters without pearls with which I have made a garland for you imagining you as a precious statue) ………………………………………………………………………………………………………….. மன்னித்துக்கொள் தவறிருந்தால்... (Accept if you like and forgive if there is any mistake) ",
            "date": "Answered June 8, 2017",
            "views": "574",
            "upvotes": " View 5 Upvoters",
            "upvoters": [
                {
                    "user_id": "Niruthiya Priyan Baskaran",
                    "user_href": "/profile/Niruthiya-Priyan-Baskaran"
                },
                {
                    "user_id": "Vijay Bhaskaran",
                    "user_href": "/profile/Vijay-Bhaskaran-3"
                },
                {
                    "user_id": "Mallika Seshadri",
                    "user_href": "/profile/Mallika-Seshadri"
                },
                {
                    "user_id": "Shiva Maathesh",
                    "user_href": "/profile/Shiva-Maathesh"
                },
                {
                    "user_id": "Balaje Sundar",
                    "user_href": "/profile/Balaje-Sundar"
                }
            ]
        },
        {
            "author_info": {
                "name": "Rajan Bawa",
                "href": "/profile/Rajan-Bawa-8"
            },
            "answer_text": "Joyce Kilmer did. He (was a man: Full Name Alfred Joyce Kilmer) Alfred Joyce Kilmer was an American writer and poet mainly remembered for a short poem titled \"Trees\", which was published in the collection Trees and Other Poems in 1914. Wikipedia Here is the poem (read till the end) below: Trees BY JOYCE KILMER I think that I shall never see A poem lovely as a tree. A tree whose hungry mouth is prest Against the earth’s sweet flowing breast; A tree that looks at God all day, And lifts her leafy arms to pray; A tree that may in Summer wear A nest of robins in her hair; Upon whose bosom snow has lain; Who intimately lives with rain. Poems are made by fools like me, But only God can make a tree. ",
            "date": "Answered February 26, 2020",
            "views": "211",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Michael Durcan",
                "href": "/profile/Michael-Durcan-1"
            },
            "answer_text": "I wrote one after taking up the challenge from this question: I am far too literal minded and struggle to understand poetry. Could you please write a poem to explain what a reasonably well known poem of your choice really means? Here is the result: Michael Durcan's answer to I am far too literal minded and struggle to understand poetry. Could you please write a poem to explain what a reasonably well known poem of your choice really means? This answer took me the longest time to write of any of my answers so far on Quora. OQ: Can anyone write a poem about a poem? ",
            "date": "Answered May 1, 2019",
            "views": "89",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Karen Carmichael",
                    "user_href": "/profile/Karen-Carmichael-7"
                }
            ]
        },
        {
            "author_info": {
                "name": "Krishna Sameer Achanta",
                "href": "/profile/Krishna-Sameer-Achanta"
            },
            "answer_text": " Kavitha O Kavitha. A Telugu poetry about poetry by Mahakavi Sri Sri. In this poem, the poet addresses directly to the art of writing poems, mesmerized by its beauty. Sri Sri is one of the most respected modern poets of Telugu. His book Maha Prasthanam (The Great Journey), an anthology of poems, is one of his major works. Nenu Saitham is another one of his famous compositions taken from Maha Prasthanam used in the movie Rudraveena.  ",
            "date": "Answered June 25, 2016",
            "views": "296",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Deepthi M",
                    "user_href": "/profile/Deepthi-M-60"
                },
                {
                    "user_id": "Ashwini Polasani",
                    "user_href": "/profile/Ashwini-Polasani"
                },
                {
                    "user_id": "Auro Sista (ఆరో శిష్ఠా)",
                    "user_href": "/profile/Auro-Sista-ఆరో-శిష్ఠా"
                },
                {
                    "user_id": "Suresh Karri",
                    "user_href": "/profile/Suresh-Karri-5"
                }
            ]
        },
        {
            "author_info": {
                "name": "Sampoorna Gonella",
                "href": "/profile/Sampoorna-Gonella"
            },
            "answer_text": "Legend says poetry is a boiling pot of expressiontailored to fit the whims of a meter. I say poetry is rivulets churning from a turbulent soul,words melding like they belong together,stirring you from sleepuntil torment quietensto tranquility. ",
            "date": "Answered December 8, 2017",
            "views": "325",
            "upvotes": " View 5 Upvoters",
            "upvoters": [
                {
                    "user_id": "Shravasti Misra",
                    "user_href": "/profile/Shravasti-Misra"
                },
                {
                    "user_id": "Katherine Grey",
                    "user_href": "/profile/Katherine-Grey-5"
                },
                {
                    "user_id": "Sowmya Vaddadi",
                    "user_href": "/profile/Sowmya-Vaddadi-1"
                },
                {
                    "user_id": "Laeela Waryono",
                    "user_href": "/profile/Laeela-Waryono"
                },
                {
                    "user_id": "Matthew Hsu",
                    "user_href": "/profile/Matthew-Hsu-8"
                }
            ]
        },
        {
            "author_info": {
                "name": "Pranav Batra",
                "href": "/profile/Pranav-Batra-7"
            },
            "answer_text": "Lets try on this very instant. Poems are words reflecting who? May be me or just few Words are magicians in small formations Show their true colors with imaginative transformations Colors which will change the speed of light and distance of stars Colors which hypnotize you to travel with them at an unknown hour Where reflections are talking and so do silence Where flowers are walking cutting the path of violence Where creativity is your escape and solidarity your power Where words are speaking to the reader from where he starts Poems are a garage, garage where doors are plenty Plenty for imagination and a place where even words looks empty Where walls are your companion as they act like a silent friend Who will not get disturb even if you stare them till the night end Poems are reflections of words and words are hollow as reflection As they take shape when you give them direction The air is a free blackboard for a poet to see To draw something in it which someone might have forget to perceive So draw as air is plenty and rainbow could be more bright if you like to color it with a poem telling it HOW TO BE ALIVE? ",
            "date": "Answered June 13, 2016",
            "views": "271",
            "upvotes": " View 3 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Vivek Kumar Tiwari",
                    "user_href": "/profile/Vivek-Kumar-Tiwari-6"
                },
                {
                    "user_id": "Abhishek Srivastava",
                    "user_href": "/profile/Abhishek-Srivastava-315"
                },
                {
                    "user_id": "Samaksh Rawal",
                    "user_href": "/profile/Samaksh-Rawal"
                }
            ]
        },
        {
            "author_info": {
                "name": "Akhil Mathew(bombaybeing)",
                "href": "/profile/Akhil-Mathew-bombaybeing"
            },
            "answer_text": "Nothing! It may look, easy you may feel. Poem that are short can say many things. Lucky you may say, People who can think. Poems don't need time, love is all you need. Living is a skill, writing is a thing. Poem is a song, for inner feelings. Love is a desire, scarcely ever seen! Poems are written when, pain is everything. ~bombaybeing ",
            "date": "Answered July 20, 2020",
            "views": "13",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "James Henry",
                "href": "/profile/James-Henry-105"
            },
            "answer_text": "John Hollander’s Rhymes Reason is a guide to English verse, with each entry in the form it describes. A lot of poets have written sonnets on the sonnet, but this - I think - is unique. Sonnet on the Sonnet on the Sonnet Peter Dickinson Scorn not the sonnet on the sonnet, critic;It is a bank where poets love to lieAnd praise each other’s ingenuityIn finding such a form. The analyticReader may stigmatise as parasiticThe mirror-image of a mystery,The echo of lost voices, find it dry,And intellectually paralytic. Yet ‘tis a child of Fancy, light and live,A fragile veil of Nature, scarcely worn(Of Wordsworth’s two, of Shakespeare’s none, survive);Empty not then the vials of scorn upon it.Nor, since we’re on the subject, should you scornThe sonnet on the sonnet on the sonnet. ",
            "date": "Answered June 30, 2017",
            "views": "55",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Prafulla Patwardhan",
                "href": "/profile/Prafulla-Patwardhan"
            },
            "answer_text": "I thought a lot, what actually could be the reason for me to pen my thoughts and then I came up with POEM - POEM - 'Pure Observation Engaging ( my thoughs to go in ) Motion ! A walk under sky andmy thoughts start to wander, sometimes gloomy,sometime as clear as blue sky! I go in deep thoughts,I go in deep talks,asking myself how toexpress my thoughts ? POEM - 'Pure Observation engaging ( my thought to go in ) motion !so I end up expressingmy mind, my heart..in few lineswhere every word in itself shines very bright! ",
            "date": "Answered June 14, 2016",
            "views": "92",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Vivek Kumar Tiwari",
                    "user_href": "/profile/Vivek-Kumar-Tiwari-6"
                },
                {
                    "user_id": "Sravani Katta",
                    "user_href": "/profile/Sravani-Katta-2"
                }
            ]
        },
        {
            "author_info": {
                "name": "Cal So",
                "href": "/profile/Cal-So"
            },
            "answer_text": "Poetry bleeds from my fingertips, Seeping through the pages. The sight searing through the rounds of your eyes, The scent brushing upon the tip of your nose, The taste lingering in the back of your throat, And as quick as it appeared, it disappeared. How poetry lives and dies is a wonder to us all. ",
            "date": "Answered August 4, 2017",
            "views": "45",
            "upvotes": "0"
        }
    ]
}