{
    "title": "Can the title of a story be a question? - Quora",
    "tags": [
        "Short Story Writing",
        "Storytelling"
    ],
    "response": [
        {
            "author_info": {
                "name": "John J Moran",
                "href": "/profile/John-J-Moran-1"
            },
            "answer_text": "Yes…There area unit several articles and stories that have its title as a matter. It is a lot of attention-grabbing and catchy things that takes the readers a lot of in attention-grabbing .people who area unit wring a commentary principally seeking queries a title as a result of it offers a lot of powerful gap thereto writing. It is common to use a matter title in verse form article essay or story. title ought to would like a catchy that means it ought to be boring. In colleges and schools there area unit several writing tasks thus it's neccessary to to form title and stories in writing. we can get readers' attention with Associate in Nursing intriguing question or clever phrase, however certify your title clearly conveys your essay topic. Begin with Associate in Nursing attention unpleasant person. the eye unpleasant person you utilize is up to you, however here area unit some ideas: ... If the eye unpleasant person was solely a sentence or 2, add one or 2 a lot of sentences that may lead the reader from your gap to your thesis statement. . Students don’t skills to the way to write a essay and what all steps required to follow it. Submitting dangerous quality essay for his or her teachers cause failure of their grade and students troubled lots with this. In order to resolve this issue essay writing services area unit build. Essay writing service will facilitate students professionally and create their tutorial life hassle free. Essay writing service can counsel specialists to induce your essay done. There area unit many ways to decide on best essay writing services. Check the rating of the service. A best essay writing service might have well expertise therein field. several services provide skilled writers to complete the tasks. the simplest essay writing services perpetually bear the requirements of their customers. browse this site ",
            "date": "Answered January 20, 2018",
            "views": "14",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Rhik Majumder",
                "href": "/profile/Rhik-Majumder"
            },
            "answer_text": "Obviously. A title of a story is actually a short form of the story. It tells about the whole narrative. A title should be short, meaningful and attractive. Anyone try the thing which looks or sounds attractive. If your story has a boring title, peopeople will overlook it and if it has no connection with your story people will give negative feedback. So whenever you go to write a story, keep these things in your mind. ",
            "date": "Answered March 21, 2019",
            "views": "193",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "SaPna Singh",
                "href": "/profile/SaPna-Singh-417"
            },
            "answer_text": "Yes Infact a question makes people curious about the story so it's better to keep it a question. But the title which is a question should be well versed to compile the whole story as an conclusion . The last thing you should know to give an answer to that question throughout the story otherwise it'll make the readers disappointed. You don't have to make it clear in words but the feelings and actions you were talking about should give the answer by their own. ",
            "date": "Answered February 2, 2019",
            "views": "284",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Jasmine Reynolds",
                    "user_href": "/profile/Jasmine-Reynolds-10"
                }
            ]
        },
        {
            "author_info": {
                "name": "Monika Srivastava",
                "href": "/profile/Monika-Srivastava-124"
            },
            "answer_text": "Yes. Of course it can be. It doesn't matters whether the title of a story is a question or exclamation. The thing that matters the most is title should be attractive, well justified so that people yearn to read it just because of the title. For instance, I just read the book “ Few things left unsaid” because I got attract towards the title. ",
            "date": "Answered November 23, 2018",
            "views": "150",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Mayank Verma",
                "href": "/profile/Mayank-Verma-1030"
            },
            "answer_text": "yes why not, short friction stories which are based on a small time interval ( anyone walking from one end to another of a street). mainly these stories does not have any perfect end; they always end with a questioning sentence which is sometimes the title also. ",
            "date": "Answered August 4, 2020",
            "views": "17",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Chavi Gandhi",
                "href": "/profile/Chavi-Gandhi"
            },
            "answer_text": "yes the title of the story can be question several books , stories were written by famous writers which have the the title as question one of the most famous work which has question as title is : who will cry when you die ? by Robin Sharma ",
            "date": "Answered February 11, 2018",
            "views": "158",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Saranya Sridharan",
                "href": "/profile/Saranya-Sridharan-2"
            },
            "answer_text": "Yes. The thing is it should justify your story, if it does no issue in choosing it. In my personal preference, question in title add curiosity in reader. Because we can’t stand looking at the question alone , we try to find answer in the story. ",
            "date": "Answered April 13, 2018",
            "views": "271",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Gnaneshwar Ambala",
                    "user_href": "/profile/Gnaneshwar-Ambala"
                }
            ]
        },
        {
            "author_info": {
                "name": "Prash Wal",
                "href": "/profile/Prash-Wal"
            },
            "answer_text": "Yeah sure… Eg: Can It Be Forever(I know, so original) Or Are You Afraid of The Dark(It's an actual Sidney Sheldon Novel) Or What Happens When The Cuckoo Calls(that rings a bell, doesn't it?) ",
            "date": "Answered January 21, 2019",
            "views": "34",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Sanchana Santhoz Santhoz",
                "href": "/profile/Sanchana-Santhoz-Santhoz"
            },
            "answer_text": "It depends. In most cases it does work and build interest towards your work. It's better if it's not too formal. Something simple and not a very Wh question should be good. ",
            "date": "Answered November 14, 2018",
            "views": "15",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Abhishek Singh",
                "href": "/profile/Abhishek-Singh-9042"
            },
            "answer_text": "Yes, most of the time question as a title helps in generating intrest in readers mind. ",
            "date": "Answered April 6, 2018",
            "views": "54",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Bismah Qu",
                "href": "/profile/Bismah-Qu"
            },
            "answer_text": "Yes it is fine to have a question as a title of story. ",
            "date": "Answered November 14, 2018",
            "views": "6",
            "upvotes": "0"
        }
    ]
}