{
    "title": "Can I use English cursive while writing in German? - Quora",
    "tags": [
        "Literature of Germany",
        "Cursive",
        "Handwriting",
        "Learning German"
    ],
    "response": [
        {
            "author_info": {
                "name": "Tilman Ahr",
                "href": "/profile/Tilman-Ahr"
            },
            "answer_text": "I'll have to disagree with the answers posted before this. Umlaute and ß are not going to be a problem. Place two dots above your regular os, as and us, and you'll be fine. Use ß where appropriate.  The problem is that proper English Cursive is fairly different from the two sorts of cursive that are taught in German Schools. A nice, well-developed English Cursive handwriting is a bit hard to read for most Germans - mind you: not as hard as the German Cursive/Sütterlin type scripts in use in Germany up to roughly WW2, but still... With a simplified Cursive / Block hybrid, you should do fine, really. It'll be quite similar to most Germans' everyday handwriting. If you're going to handwrite longish texts that need to be read by others frequently, you might want to stick with Block letters,  but otherwise, I wouldn't worry about it much. ",
            "date": "Answered March 13, 2016",
            "views": "14",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Surya Sankarasubramanian",
                    "user_href": "/profile/Surya-Sankarasubramanian"
                }
            ]
        },
        {
            "author_info": {
                "name": "Hans Bauer",
                "href": "/profile/Hans-Bauer-3"
            },
            "answer_text": "You can do that if you write the Umlaute \"oe\" \"ue\" and \"ae\". But the ß will be a problem since if you write \"ss\" it will be a misspelling. Especially because 20 years ago \"dass\" was spelled \"daß\" and many other words. So it's not always as well. Because of that everyone is aware of the difference and they might think it is a mistake, which might take you a few points in an exam. But just for communication it's totally fine. ",
            "date": "Answered March 9, 2016",
            "views": "534",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Hasan Moukalled",
                    "user_href": "/profile/Hasan-Moukalled"
                }
            ]
        },
        {
            "author_info": {
                "name": "Bastian Pott",
                "href": "/profile/Bastian-Pott"
            },
            "answer_text": "Sure.Except from the \"Umlaute\" (äöü) and our \"sharp s\" (ß) there are no different characters. Hence any German should be able to easily read your letters. (I struggle daily with my colleagues' chicken scratch handwriting.) Be aware about dates, though.Our syntax goes DD.MM.YYYY.It'd be awkward to mix up i.e. 10.04.2016 (US: 04/10/2016) with 04.10.2016 (US 10/04/2016). ",
            "date": "Answered March 8, 2016",
            "views": "714",
            "upvotes": " View 6 Upvoters",
            "upvoters": [
                {
                    "user_id": "Ivonne Elbegdordsch",
                    "user_href": "/profile/Ivonne-Elbegdordsch"
                },
                {
                    "user_id": "Gjergji Papamihal",
                    "user_href": "/profile/Gjergji-Papamihal"
                },
                {
                    "user_id": "Surya Sankarasubramanian",
                    "user_href": "/profile/Surya-Sankarasubramanian"
                },
                {
                    "user_id": "Hans Bauer",
                    "user_href": "/profile/Hans-Bauer-3"
                },
                {
                    "user_id": "Eva Nowack",
                    "user_href": "/profile/Eva-Nowack"
                },
                {
                    "user_id": "Hasan Moukalled",
                    "user_href": "/profile/Hasan-Moukalled"
                }
            ]
        }
    ]
}