{
    "title": "Can a plot twist work in the middle of a book? - Quora",
    "tags": [
        "Plot Twists"
    ],
    "response": [
        {
            "author_info": {
                "name": "Delaney Smith",
                "href": "/profile/Delaney-Smith-11"
            },
            "answer_text": "Absolutely. The climax of a book isn't the only place for a plot twist— It's just one of the places a plot twist fits. The core purpose of a plot twist is to throw the reader off and send the story hurtling forward in a new direction. However, well-executed plot twists don't just appear out of the blue— they're foreshadowed. Subtly hint at the coming of your plot twist until it happens, and when it does happen, your readers will have something of an “oh sh*t!! That makes sense!” moment, either right as it happens or after thinking about it for a bit. Regardless of where in the story the plot twist occurs, if it's done right it'll have a great effect. ",
            "date": "Answered December 20, 2017",
            "views": "229",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Ani Jaya",
                    "user_href": "/profile/Ani-Jaya-1"
                },
                {
                    "user_id": "Brandon Michon-Cave",
                    "user_href": "/profile/Brandon-Michon-Cave-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Colleen Farrelly",
                "href": "/profile/Colleen-Farrelly-1"
            },
            "answer_text": "Yes, it's better to put twists earlier in the work, as the climax and ending are typically the culmination of the entire work and resolution stages. Readers don't always appreciate twists that aren't anticipated or don't fit with the rest of the book, particularly towards the end. The middle and late middle are typically the better choices if you're going to use a plot twist. ",
            "date": "Answered December 21, 2017",
            "views": "295",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Tim Glatzer",
                    "user_href": "/profile/Tim-Glatzer"
                }
            ]
        },
        {
            "author_info": {
                "name": "Shana Chen",
                "href": "/profile/Shana-Chen-3"
            },
            "answer_text": "Absolutely! It’s all about execution. Remember the hero’s journey of storytelling. The climax needs to near the end, but there are plenty of books with multiple plot twists throughout the book. Some as early as the first chapter! ",
            "date": "Answered December 20, 2017",
            "views": "169",
            "upvotes": "0"
        }
    ]
}