{
    "title": "Can you come up with a short horror story? - Books that influenced You - Quora",
    "tags": [
        "Novels",
        "Book Recommendations"
    ],
    "response": [
        {
            "author_info": {
                "name": "Yogendra Singh Rathore",
                "href": "/profile/Yogendra-Singh-Rathore-9"
            },
            "answer_text": "Let’s give it a shot, and for your information, dear readers, this would be my first attempt in this genre. ****************************** The Broken Tooth ****************************** This lockdown has locked us all up in our rooms, especially for college teenagers like me who are living all alone far away from their homes. Finally, after the end of the lockdown, I decided to go out and get some fresh air. I took the lift and went to the parking near my car, from back came a voice : Watchmen: “Where are you going Sir?” Me: “Just to get some fresh air, Why?” Watchmen: “Sir, she is my daughter ‘Preeti’, it’s been months since she has gone out, Do you mind taking her out with you for some time?” Watchmen: “Actually, my wife is not here, and I cannot leave because of my duty, can you please take her out with you, please sir.” His words were very hopeful and above all, I looked at her, a 4-year-old girl with a cute pony tale holding her doll looked at me with the cutest smile and a broken middle tooth. I couldn’t resist her smile and agreed to take her out with me. She was utterly quiet and did not speak a word but kept on smiling shyly at my poor jokes while I was driving. “You know what, you can have my extra teeth if you want, anyways it’s of no use for me,” I said making another lame joke just to break the silence. For the first time she looked right at me into my eyes and with no smile at all, it was weird. There was something weird about the look that she gave me. The car had become completely silent, no more lame jokes from me and not a single word from her. It was so silent that I could hear the air inside the car. A few moments later she pointed out to a dental clinic, she looked at me as if she desperately wanted to stop me at the dental clinic but I kept driving ahead, and all of sudden her eyes started turning reddish. Her look, her eyes, the silence, all of this had started making me dizzy. So I drove as fast as I could to return back to my hostel. With the heavy breathing and sweat falling all over my face, I finally managed to reach my hostel. At the entrance, I saw the watchmen. Even though he was close to me I shouted out loud, “Watchmen”. He came running at me. Me: “Take away your daughter with you” Watchmen: “Who Sir? I have no daughter, I am not even married” Me: “Then who is she?” I said with anger in my voice. Watchmen: “A doll” I looked at the seat, there was no one but just the doll. I became dreaded, having no idea of what was happening. Have I been watching too many horror movies lately, I asked myself and parked my car and with shaking legs and fearsome body I somehow managed to came to the lift. The lift’s gate opens, there she is, looks at me and smiles with her broken tooth and says “Give me your extra teeth”.  P.S.: If you liked my attempt please shower your love in the comments below. ",
            "date": "October 20, 2020",
            "views": "765",
            "upvotes": " View 9 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Warm Mafia",
                    "user_href": "/profile/Warm-Mafia-1"
                },
                {
                    "user_id": "Yamini Bhardwaj",
                    "user_href": "/profile/Yamini-Bhardwaj-9"
                },
                {
                    "user_id": "Achal Mehta",
                    "user_href": "/profile/Achal-Mehta-11"
                },
                {
                    "user_id": "Harshita Bisht",
                    "user_href": "/profile/Harshita-Bisht-70"
                },
                {
                    "user_id": "Sai Bharath",
                    "user_href": "/profile/Sai-Bharath-233"
                },
                {
                    "user_id": "Panthagani Armstrong",
                    "user_href": "/profile/Panthagani-Armstrong"
                },
                {
                    "user_id": "Ayush Borkar",
                    "user_href": "/profile/Ayush-Borkar-3"
                },
                {
                    "user_id": "Neha Gore",
                    "user_href": "/profile/Neha-Gore-13"
                },
                {
                    "user_id": "Qudsiya Fatima",
                    "user_href": "/profile/Qudsiya-Fatima-3"
                }
            ]
        },
        {
            "author_info": {
                "name": "June",
                "href": "/profile/June-677"
            },
            "answer_text": "This is a short humoro-horror story: “Shona, come on!” Ikel cried out from across the chasm. “No, I can’t!” Leaves rustled nearby. “Ikel, I can’t! I’m too scared!” “Okay, calm down! I’m coming there!” “No! The rope won’t take it!” “Shona, either way, you have to take the risk. I know you can do it!” “Grrr!” the monster growled behind me. Without realizing what I was doing, I held onto the rope tight and swung myself across the chasm. As I did so, I felt the monster’s paws score my back. Shrieking, I fell on Ikel. “Okay, now RUN!” We ran as fast as our legs would allow. The monster stamped close behind us. It was near dawn now. We’ve been running in this jungle the whole night, just because of Ikel’s stupid idea of an adventure. Due to bad weather, we had halted our boat on this island. I was brought back into reality by Ikel’s cry. He had stumbled. “Oh, you, be careful,” I said as I helped him back on his feet. “I’m too tired.” “Come on, we’re close to the shore.” My tired eyes searched the surroundings. “Ikel, that cave!” “Where?” “Down there, come!” I dragged us down the slope and our limp bodies rolled themselves into the cave. Our breathing was ragged now. “Are we safe here?” “Hope so.” “I’m hungry.” “Me too.” “Shona, see!” he muttered, excited. I searched in the filtered morning light and found ourselves surrounded by Willow trees. “Great! Knife?” “Here!” he said, handing me his Swiss knife. I creeped out of the cave and carefully scratched a switch of Willow tree. It’s more than enough in this situation. I turned towards the cave but was shocked to see Ikel’s pale face. My body shivered at the thought. Though I knew it was behind me, I fell onto the ground when I faced it. In daylight, I saw it clearly for the first time. Eight feet tall, covered with wild mossy hair and his ugly teeth dripping with saliva, it was ready to pounce on me. I was paralyzed with fear. “Shona, the knife!” Ikel cried out. The monster looked up at him. There’s no way I’m going to let this devil harm my brother! In the next instant, he leaped towards Ikel and I sliced the knife into his belly. Grunting, the monster fell hard on the ground. His blood was sprinkled all over me. Trembling, Ikel walked up to me. “Let’s get out of here.” We hastily dragged ourselves to our boat. When finally on the boat, we checked for any major damages. Thankfully, apart from our soiled clothes and a lost knife, we were alright. “Hurry, start the engine!” “He won’t follow us into the boat!” “I don’t know. I just want to be out of here!” The engine roared to life and we sailed far away from the wretched island. I stood at the deck, watching the sun rise and the islands fade into nothingness. By - June STP Earth Headquarters ",
            "date": "October 25, 2020",
            "views": "212",
            "upvotes": " View 2 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Death Sword",
                    "user_href": "/profile/Death-Sword-1"
                },
                {
                    "user_id": "Qudsiya Fatima",
                    "user_href": "/profile/Qudsiya-Fatima-3"
                }
            ]
        },
        {
            "author_info": {
                "name": "Shivam Datt",
                "href": "/profile/Shivam-Datt"
            },
            "answer_text": "We bought an old house, my boyfriend and I. He's in charge of the \"new\" construction – converting the kitchen in to the master bedroom for instance, while I'm on wallpaper removal duty. The previous owner papered EVERY wall and CEILING! Removing it is brutal, but oddly satisfying. The best feeling is getting a long peel, similar to your skin when you're peeling from a sunburn. I don't know about you but I kinda make a game of peeling, on the hunt for the longest piece before it rips.Under a corner section of paper in every room is a person’s name and a date. Curiosity got the best of me one night when I Googled one of the names and discovered the person was actually a missing person, the missing date matching the date under the wallpaper! The next day, I made a list of all the names and dates. Sure enough each name was for a missing person with dates to match. We notified the police who naturally sent out the crime scene team. I overhead one tech say \"yup, it's human.\" Human? What's human? \"Ma'am, where is the material you removed from the walls already? This isn't wallpaper you were removing.\" ",
            "date": "October 28, 2020",
            "views": "229",
            "upvotes": " View 2 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Toi Karga",
                    "user_href": "/profile/Toi-Karga"
                },
                {
                    "user_id": "Sudarshana Mukherjee",
                    "user_href": "/profile/Sudarshana-Mukherjee"
                }
            ]
        }
    ]
}