{
    "title": "Can I write multiple articles with same focused keyword? - Quora",
    "tags": [
        "Keyword Research",
        "SEO Tools"
    ],
    "response": [
        {
            "author_info": {
                "name": "Sivakumar",
                "href": "/profile/Sivakumar-143"
            },
            "answer_text": "Google love multiple articles with same focused topic rather than keyword. - Welcome to the age of topical optimization.  Traditionally, SEO has focused on optimizing pages for a single keyword or phrase in order to help that page appear higher in the search engine results. Beginning with the release of Google’s Hummingbird algorithm, the most forward-thinking members search engine marketing industry now believe that semantic search, or “real language” queries are now the way forward. With Topical Optimization, the goal is to write effectively about a topic, theme, or subject rather than trying to work around just one keyword. This will help make your content more effective in reaching more people, mostly due to increased traffic from “long tail” searches about that topic. Topical Optimization Versus Keyword Optimization  Maybe in the past, you felt that you could only optimize one keyword per page, or maybe you were already grouping keywords together like this. So where does the whole topical optimization come in? Topical optimization doesn’t mean you have to have a single page or post that covers everything that needs to be said on the topic. Not only does that limit the number of entry points, it also doesn’t necessarily help searchers to land on the page that best represents their intent. Instead of optimizing your site for keywords and hoping to rank here and there, focus on building the site out to dominate a topic with multiple pages and blog posts. Each page or post will target a tightly correlated group of keywords, but all built around a slightly broader topic. That gives you a chance to dominate a topic through multiple related pages, each focused on a specific visitor intent. That’s tough to beat. ",
            "date": "Answered April 11, 2016",
            "views": "24",
            "upvotes": " View 9 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Rudolf Jantos",
                    "user_href": "/profile/Rudolf-Jantos-1"
                },
                {
                    "user_id": "Maneesh Garg",
                    "user_href": "/profile/Maneesh-Garg-2"
                },
                {
                    "user_id": "Lei Haiqiang",
                    "user_href": "/profile/Lei-Haiqiang"
                },
                {
                    "user_id": "Pavel Morava",
                    "user_href": "/profile/Pavel-Morava"
                },
                {
                    "user_id": "Rangula Lakshmi",
                    "user_href": "/profile/Rangula-Lakshmi"
                },
                {
                    "user_id": "Rohit Jain",
                    "user_href": "/profile/Rohit-Jain-1978"
                },
                {
                    "user_id": "Mark Aaron",
                    "user_href": "/profile/Mark-Aaron-1"
                },
                {
                    "user_id": "Ané Wiese",
                    "user_href": "/profile/Ané-Wiese"
                },
                {
                    "user_id": "Carlos Perez",
                    "user_href": "/profile/Carlos-Perez-110"
                }
            ]
        },
        {
            "author_info": {
                "name": "David Dakarai",
                "href": "/profile/David-Dakarai"
            },
            "answer_text": "Yes, You may write multiple articles by using same keywords. But you can write articles about different topics which are related to keywords. By writing articles you must follow the SEO rules. You can submit these articles in different submissions sites to more benefits. Because we can get backlinks or traffic for those keywords from different domains, which is more useful for a website. The usage of keywords in a article not more than 3%, helps to SEO.  If you use more than 3%, website will be penalized. ",
            "date": "Answered April 11, 2016",
            "views": "874",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Rebelute Digital Solutions",
                "href": "/profile/Rebelute-Digital-Solutions-1"
            },
            "answer_text": "Yes, you can write multiple articles with same focused keyword. But do one thing that articles should go on multiple sites too. Like if you have 3 piece of content with same focused keyword in it. Put one content on your blog or website, second on one of the popular article submission site and third on the guest blogging site.  In this way you will receive a backlinks, credibility and engagement from multiple sites for your content too. Thanks ",
            "date": "Answered April 7, 2016",
            "views": "434",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Trick Point",
                    "user_href": "/profile/Trick-Point"
                }
            ]
        },
        {
            "author_info": {
                "name": "Vipin Nayar",
                "href": "/profile/Vipin-Nayar"
            },
            "answer_text": "Why do you want to write multiple article, that is based on same focus keywords. I would suggest you to write One in-depth article with focused keywords, and try to build link to that article and get rank that article in search engine. In sort build link for that Article when it gets good amount of links. the page value of this article will increase automatically. you can check that through PA and DA in moz bar tools. then you build internal link for the page which you want to rank with multiple article. Hope you got my point, if not let me know. you can connect me on vipin nayar (@vipinnayar) | Twitter ",
            "date": "Answered April 6, 2016",
            "views": "12",
            "upvotes": " View 5 Upvoters",
            "upvoters": [
                {
                    "user_id": "Martin Leon",
                    "user_href": "/profile/Martin-Leon-12"
                },
                {
                    "user_id": "Trick Point",
                    "user_href": "/profile/Trick-Point"
                },
                {
                    "user_id": "Anju Bharathan -Acodez",
                    "user_href": "/profile/Anju-Bharathan-Acodez"
                },
                {
                    "user_id": "Nijeesh Kumar",
                    "user_href": "/profile/Nijeesh-Kumar-2"
                },
                {
                    "user_id": "Savita Singh",
                    "user_href": "/profile/Savita-Singh-43"
                }
            ]
        },
        {
            "author_info": {
                "name": "Vignesh Kumar",
                "href": "/profile/Vignesh-Kumar-445"
            },
            "answer_text": "Yes, you can write multiple articles on the focused keyword it will increase your keyword density of your web page and overall website. But make sure that keyword has a higher search volume. It also has a major disadvantage, that is if you focus on a particular keyword and not giving importance to other keywords then chances of people visiting your site with another keyword search will be reduced. ",
            "date": "Answered April 14, 2016",
            "views": "707",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Dakshraj Enterprise",
                "href": "/profile/Dakshraj-Enterprise"
            },
            "answer_text": "Yes you can write multiple articles with same focused keyword but I will recommend you to use variation keywords.. It will save you from penalty.. ",
            "date": "Answered April 5, 2016",
            "views": "127",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Jennifer Aniston",
                "href": "/profile/Jennifer-Aniston-13"
            },
            "answer_text": "Yes, of-course you can write multiple articles with same keywords but remember some things.  Content of your every article should be unique. Should not publish one article on different sites.",
            "date": "Answered April 8, 2016",
            "views": "570",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Bryan Marcus",
                "href": "/profile/Bryan-Marcus-5"
            },
            "answer_text": "Yes you can, But try to avoid keyword stuffing and anchoring to the keyword rich text inside the article which can trigger Penguin algorithm.. Thanks Team MGSI ",
            "date": "Answered April 11, 2016",
            "views": "419",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Moulik Jain",
                "href": "/profile/Moulik-Jain-4"
            },
            "answer_text": "Change anchor text regularly.  Don't focus on single landing page. ",
            "date": "Answered April 6, 2016",
            "views": "85",
            "upvotes": "0"
        }
    ]
}