{
    "title": "Can you co-author on Medium? - Quora",
    "tags": [
        "Medium (social media)",
        "Content Writing",
        "Bloggers",
        "Blogs",
        "Blogging",
        "Writers and Authors"
    ],
    "response": [
        {
            "author_info": {
                "name": "Doug Stevenson",
                "href": "/profile/Doug-Stevenson-30"
            },
            "answer_text": "You are looking for something but co writing or ghost writing is almost a waste. a psychic is not co writing for another and the simple is the concepts to be known and then to be understood. What has been your own life experience and how does that compare to the co writer. Then you are looking for the friend companion you have grown up with. Then the two reflect on those life experiences. often with “oh yeah i remember that”. I do disseminate to the world what ever i come across. My inputs are unstoppable and new ideas which a psychic will not even consider are all original thoughts. Too often the thoughts, seem to become the way of life soon after. Admittedly i do hear at times from people who say “ i don’t understand you”. Some do consider a five year old can learn algebra by anyone, but not even know math. Trump learns everything he says simply by picking up that book. Knowing more than anyone else in government. so while beating people out of the way and gassing them with a noxious gas, and they had done nothing except to BE in EXISTENCE in front of his need to make a photo opportunity.   Ask him what he absorbed from holding the bible.  I do find some which are advancing and often just upvote them for their own idea. ",
            "date": "Answered August 13, 2020",
            "views": "11",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Dexter Roona",
                    "user_href": "/profile/Dexter-Roona"
                }
            ]
        },
        {
            "author_info": {
                "name": "Ron Cabs",
                "href": "/profile/Ron-Cabs-2"
            },
            "answer_text": "I don't know if this counts, but on the technicality side of the platform, this can help. Manage publication editors and writers Your publication can have multiple editors and writers with different permission levels. Managing editors & writers You can manage your publication staff from your publication's settings page. Desktop Go to your publication homepage.Click the publication icon next to your profile picture.Click Homepage and settings.Scroll down to the section People.Adding and removing editors and writers Desktop To add a writer or an editor, type in their name or username and select them from the drop-down list. You can remove writers and editors from your publication in the same way. Be sure to click \"Save\" to confirm your changes. To see the full list of editors and writers in your publication, click View all below Writers or go to your publication's About page by clicking the link in the footer. Note: Only publication owners can add or remove publication editors. Publication permissions Once a user gets added to a publication, they will be given permissions based on their role.  ONLINE PUBLICIST ",
            "date": "Answered October 21, 2020",
            "views": "135",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Dexter Roona",
                    "user_href": "/profile/Dexter-Roona"
                }
            ]
        },
        {
            "author_info": {
                "name": "Esther Spurrill-Jones",
                "href": "/profile/Esther-Spurrill-Jones"
            },
            "answer_text": "Yes. If two or more people are editors in a Medium publication, you will both have access to edit any drafts that are created in or submitted to that publication. Therefore, if you wish to co-author, one of you can create a draft in the publication and then both of you can write and edit in the draft. However, the author of the piece will show only the person who created it and there will be a small note at the bottom that says “Thanks to [co-author’s name].” You will have to type your own byline at the top both for author’s names. ",
            "date": "Answered July 20, 2020",
            "views": "16",
            "upvotes": " View 7 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Michael Barnard",
                    "user_href": "/profile/Michael-Barnard-14"
                },
                {
                    "user_id": "Junjie Yazu",
                    "user_href": "/profile/Junjie-Yazu"
                },
                {
                    "user_id": "R.J. Matheson",
                    "user_href": "/profile/R-J-Matheson"
                },
                {
                    "user_id": "Kennedy Montecue",
                    "user_href": "/profile/Kennedy-Montecue"
                },
                {
                    "user_id": "Shawn Forno",
                    "user_href": "/profile/Shawn-Forno"
                },
                {
                    "user_id": "Destiny Vaughan",
                    "user_href": "/profile/Destiny-Vaughan-8"
                },
                {
                    "user_id": "Dexter Roona",
                    "user_href": "/profile/Dexter-Roona"
                }
            ]
        },
        {
            "author_info": {
                "name": "Shawn Forno",
                "href": "/profile/Shawn-Forno"
            },
            "answer_text": "You can easily co-author an article on Medoum with another writer - that’s essentially what editors do when you submit to a publication. But whoever created the draft will be the “author.” I think what you’re really asking is can two authors share the byline on a Medium article. And the answer to that, unfortunately is, no. One cool work around is “@“ tagging the other writer at the beginning of the piece. It’s not perfect but it’s better than nothing. ",
            "date": "Answered August 8, 2020",
            "views": "456",
            "upvotes": " View 4 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Amy Allworden",
                    "user_href": "/profile/Amy-Allworden"
                },
                {
                    "user_id": "R.J. Matheson",
                    "user_href": "/profile/R-J-Matheson"
                },
                {
                    "user_id": "Nick Byrd",
                    "user_href": "/profile/Nick-Byrd"
                },
                {
                    "user_id": "Dexter Roona",
                    "user_href": "/profile/Dexter-Roona"
                }
            ]
        },
        {
            "author_info": {
                "name": "Carl Lane",
                "href": "/profile/Carl-Lane-29"
            },
            "answer_text": "I’m not sure, but I would be really concerned about doing so. There is no way set up to share the proceeds and on a platform as casual as Medium, it would be hard to get an actual contract set up for each piece. This is the Second Time that Writing Has Saved My Life As a reader, I’ve found the quality of coauthored work to be lacking in quality. It seems like the presence of the second writer keeps the first from working as hard. The difference in writing styles also tends to be pretty obvious and lacks coherence. ",
            "date": "Answered September 18, 2020",
            "views": "215",
            "upvotes": " Answer requested by Dexter Roona",
            "upvoters": [
                {
                    "user_id": "Dexter Roona",
                    "user_href": "/profile/Dexter-Roona"
                }
            ]
        },
        {
            "author_info": {
                "name": "Shannon Hilson",
                "href": "/profile/Shannon-Hilson"
            },
            "answer_text": "To the best of my understanding, there is no way for two authors to officially share credit for any one story. However, I suppose you could get close enough for government work if you own a publication that you co-edit with other people. Technically any number of the editors can add whatever they want to any document in the pub, but credit and earnings would still go to whomever the original author was. True co-authoring would be a really interesting future development, though. ",
            "date": "Answered September 22, 2020",
            "views": "193",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Shana Chen",
                    "user_href": "/profile/Shana-Chen-3"
                },
                {
                    "user_id": "Dexter Roona",
                    "user_href": "/profile/Dexter-Roona"
                }
            ]
        },
        {
            "author_info": {
                "name": "Udom Owodiong",
                "href": "/profile/Udom-Owodiong"
            },
            "answer_text": "You can actually. If you have two or more people as editors in a Medium publication, both of you will have access to edit any drafts that are created or submitted to that publication. If you wish to co-author on medium, one of you can take up responsibility to create a draft in the publication and then both of you can write and edit the draft. ",
            "date": "Answered September 25, 2020",
            "views": "84",
            "upvotes": " View 2 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Kuromi Jenkins",
                    "user_href": "/profile/Kuromi-Jenkins-1"
                },
                {
                    "user_id": "Nicolas Nelson",
                    "user_href": "/profile/Nicolas-Nelson-2"
                },
                {
                    "user_id": "Ashley Robertson",
                    "user_href": "/profile/Ashley-Robertson-174"
                },
                {
                    "user_id": "Dexter Roona",
                    "user_href": "/profile/Dexter-Roona"
                }
            ]
        },
        {
            "author_info": {
                "name": "Alex Boast",
                "href": "/profile/Alex-Boast-4"
            },
            "answer_text": "Hi there, No, you can’t co-author on Medium as your posts are linked to your individual profile like this:  I can think of a couple ways around this. You could call your account two names and share an email with someone, though that might cause all sorts of issues. Or you could join a publication as an editor and list yourself as the coauthor of each post. ",
            "date": "Answered March 22, 2020",
            "views": "873",
            "upvotes": " View 4 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Dexter Roona",
                    "user_href": "/profile/Dexter-Roona"
                }
            ]
        },
        {
            "author_info": {
                "name": "Hamail Attique",
                "href": "/profile/Hamail-Attique"
            },
            "answer_text": "Yes. If two or more people are editors in a Medium publication, you will both have access to edit any drafts that are created in or submitted to that publication. Therefore, if you wish to co-author, one of you can create a draft in the publication and then both of you can write and edit in the draft. ",
            "date": "Answered October 24, 2020",
            "views": "31",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Asif Ifteker",
                    "user_href": "/profile/Asif-Ifteker"
                },
                {
                    "user_id": "Dexter Roona",
                    "user_href": "/profile/Dexter-Roona"
                }
            ]
        },
        {
            "author_info": {
                "name": "Mostafa Wasif",
                "href": "/profile/Mostafa-Wasif-3"
            },
            "answer_text": "I have worked on medium before and yes you can co-author on medium if there are multiple editors everyone will have access to edit on draft or published content. ",
            "date": "Answered September 28, 2020",
            "views": "60",
            "upvotes": " View 2 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Nicolas Nelson",
                    "user_href": "/profile/Nicolas-Nelson-2"
                },
                {
                    "user_id": "Dexter Roona",
                    "user_href": "/profile/Dexter-Roona"
                }
            ]
        },
        {
            "author_info": {
                "name": "Njide Mkparu",
                "href": "/profile/Njide-Mkparu"
            },
            "answer_text": "I have read articles co authored on medium. Even if any is written by two or more writers, credit is always given to a single author whose profile is used in publishing the story. ",
            "date": "Answered June 29, 2020",
            "views": "348",
            "upvotes": " View 2 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Dexter Roona",
                    "user_href": "/profile/Dexter-Roona"
                },
                {
                    "user_id": "David Alexander",
                    "user_href": "/profile/David-Alexander-14"
                }
            ]
        },
        {
            "author_info": {
                "name": "Tree Langdon",
                "href": "/profile/Tree-Langdon-1"
            },
            "answer_text": "You can collaborate but one person is the designated author. Medium will give the other person credit for the article in a small note at the bottom. ",
            "date": "Answered October 9, 2020",
            "views": "40",
            "upvotes": " View 2 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Dexter Roona",
                    "user_href": "/profile/Dexter-Roona"
                }
            ]
        },
        {
            "author_info": {
                "name": "Emily James",
                "href": "/profile/Emily-James-332"
            },
            "answer_text": "No, you can’t co-author on medium, because medium is only for a standalone writer as medium doesn’t have option to give access to another user. ",
            "date": "Answered October 17, 2020",
            "views": "87",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Dexter Roona",
                    "user_href": "/profile/Dexter-Roona"
                }
            ]
        },
        {
            "author_info": {
                "name": "Jayasree Padmanabhan",
                "href": "/profile/Jayasree-Padmanabhan-2"
            },
            "answer_text": "I have no idea. I never explored Medium. I have no plans as well. My full focus is on my business/ store/ entrepreneurship. In case, any, approach with such an option from the editorial side, where I can keep my IP with myself, then I would think about it. As of now, zero plan as well as zero intentions.😊 Intellectual property - Wikipedia. All the very best! Regards, Swaroopa. ",
            "date": "Answered October 25, 2020",
            "views": "28",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Dexter Roona",
                    "user_href": "/profile/Dexter-Roona"
                }
            ]
        },
        {
            "author_info": {
                "name": "Karen Madej",
                "href": "/profile/Karen-Madej"
            },
            "answer_text": "I don’t see why not. Only one name would appear on the story though. The co-author would have to be mentioned in the body of the story. ",
            "date": "Answered October 12, 2020",
            "views": "32",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Kishan Salian",
                    "user_href": "/profile/Kishan-Salian"
                }
            ]
        },
        {
            "author_info": {
                "name": "Allison Fleck",
                "href": "/profile/Allison-Fleck-4"
            },
            "answer_text": "No. Well, you can work together on a piece of writing on Medium and you can provide a link to your coauthor’s profile. But only one person is the designated author on Medium. ",
            "date": "Answered October 19, 2020",
            "views": "20",
            "upvotes": " Answer requested by Dexter Roona",
            "upvoters": [
                {
                    "user_id": "Dexter Roona",
                    "user_href": "/profile/Dexter-Roona"
                }
            ]
        },
        {
            "author_info": {
                "name": "Anupam Chugh",
                "href": "/profile/Anupam-Chugh"
            },
            "answer_text": "As an editor, you can get mentions at the bottom of the story. Something like this:  For that to happen, as an editor, you need to modify the draft—drop notes. ",
            "date": "Answered April 5, 2020",
            "views": "326",
            "upvotes": " View 1 Upvoter"
        },
        {
            "author_info": {
                "name": "Bren Anne-Writer",
                "href": "/profile/Bren-Anne-Writer"
            },
            "answer_text": "tbh I am not sure if officially it would show on both profiles. But one can definitely tag another profile of a writer in the article credits ",
            "date": "Answered July 14, 2020",
            "views": "224",
            "upvotes": " View 1 Upvoter "
        },
        {
            "author_info": {
                "name": "The Stricker",
                "href": "/profile/The-Stricker-1"
            },
            "answer_text": "Medium is a costly social medium platform. It has many restrictions. You can ao-author on medium but it depends on which package you have purchased. ",
            "date": "Answered August 21, 2020",
            "views": "107",
            "upvotes": " Answer requested by Dexter Roona"
        },
        {
            "author_info": {
                "name": "Nate Ryan",
                "href": "/profile/Nate-Ryan-42"
            },
            "answer_text": "No, you can’t co-author on Medium. As your posts are linked to a specific profile and account. ",
            "date": "Answered September 29, 2020",
            "views": "25",
            "upvotes": " Answer requested by Dexter Roona"
        }
    ]
}