{
    "title": "Can military police give orders to an officer? - Quora",
    "tags": [
        "Military Police",
        "Police Procedures"
    ],
    "response": [
        {
            "author_info": {
                "name": "Will Bentley",
                "href": "/profile/Will-Bentley-11"
            },
            "answer_text": "Yes, if the MP is in the performance of his duties. While in the performance of his duties, meaning “in the line of his duties and within the established norms of his experience, training, and special and general orders,” an MP is in charge. Here is the actual requirement to obey the orders of sentinels or armed forces police — in the performance of their duties — as listed in the Manual for Courts-Martial (MCM), Uniform Code of Military Justice (UCMJ) punitive Article 92c(2)(c)(ii). See page IV-24 of: http://www.au.af.mil/au/awc/awcgate/law/mcm.pdf Follow the bouncing ball and drill down to the actual punitive Article at issue in this question and answer: Article 92—Failure to obey order or regulation a. Text of statute. Any person subject to this chapter who— (1) violates or fails to obey any lawful general order or regulation; (2) having knowledge of any other lawful order issued by a member of the armed forces, which it is his duty to obey, fails to obey the order; or (3) is derelict in the performance of his duties; shall be punished as a court-martial may direct. . . . → c. Explanation. . . . → (2) Violation of or failure to obey other lawful order. (a) Scope. Article 92(2) includes all other lawful orders which may be issued by a member of the armed forces, violations of which are not chargeable under Article 90, 91, or 92(1). It includes the violation of written regulations which are not general regulations. See also subparagraph (1)(e) above as applicable. (b) Knowledge. In order to be guilty of this offense, a person must have had actual knowledge of the order or regulation. Knowledge of the order may be proved by circumstantial evidence. (c) Duty to obey order. (i) From a superior. A member of one armed force who is senior in rank to a member of another armed force is the superior of that member with authority to issue orders which that member has a duty to obey under the same circumstances as a commissioned officer of one armed force is the superior commissioned officer of a member of another armed force for the purposes of Articles 89 and 90. See paragraph 13c(1). (ii) From one not a superior. Failure to obey the lawful order of one not a superior is an offense under Article 92(2), provided the accused had a duty to obey the order, such as one issued by a sentinel or a member of the armed forces police. See paragraph 15b(2) if the order was issued by a warrant, noncommissioned, or petty officer in the execution of office. I was once present when an officer was belligerent to an MP (for no good reason), and before I could intervene, the MP determined that apprehending (arresting) the officer was the way to proceed — because of the perceived violation of punitive Article 92c(2)(c)(ii) of the UCMJ, which is a violation of a lawful order from a subordinate, but that order was issued by a servicemember under the UCMJ with authority to issue that order that compelled even a superior servicemember to obey, e.g., in this case an enlisted MP gave an order to a commissioned officer. This ended up ruining both of their careers, because hot-heads got in the way of proper procedures. The officer was wrong because of failure to act like a gentleman and accept the fact they had done a minor misdeed that needed to be corrected, right away, at the initial polite request of the MP. The MP failed because they allowed belligerence by an officer to influence their good judgement, causing them to become physical, restraining an officer using unapproved methods of force outside of established training and SOP. In the absence of a compelling reason to physically restrain an officer, and then formally apprehend them, the “resisting arrest” type charge could not withstand the preliminary inquiry, let alone the full investigations later that would have led to either Article 32 or non-judicial/Article 15 punishment. (Article 32 inquiries are the military justice system’s equivalent of grand juries; they investigate and review the case, and determine if there is enough evidence to go to a general court-martial (which is required in the case of an officer, because lower courts-martial have no jurisdiction over officers). Article 15 disciplinary hearings are “nonjudicial,” but don’t feel that way to the accused (or convicted), and the damage they can do to a servicemember’s career, paycheck, and rank is substantial. For an officer, only a Commanding General can hold Article 15 hearings, so the full complement of possible disciplinary and administrative actions are available for sentencing.) The officer was admonished, performance evaluations devastating, stripped of pending promotion, and denied further service, after which separated from the service. MP was admonished, unit performed internal disciplinary actions that eventually resulted in that Marine being denied promotion and further service… All over a parking spot at zero-dark thirty…what a waste. Later in my career, I was subject to a routine traffic stop on a military base. I was TAD to that base, driving a rental car, in civilian clothing, and didn’t know my way around well in the dark. I was pulled over a couple of car lengths from the front gate, on my way to my off-base hotel for the night. Upon the lights behind, I pulled over. The MA (“Master at Arms” — Navy “MP’s,” it was a Navy base) told me I had been stopped for speeding. Ok. I never saw the sign, but so be it because I didn’t actually know the speed limits although I don’t drive fast anywhere. MA takes my rental car contract (my registration), my driver’s license, military ID as an officer, and even my personal car insurance I always carry even when on official orders with a rental car (just never know!). MA takes an awful long time…another MA pulls up, both of them approach (bad sign for me), and politely ask that I step out of the vehicle. Ok. Moved to the trunk area, Terry frisked, placed in restraints (handcuffs) in a very tight set of cuffs. In quite a cold and windy night, without a jacket or gloves or hat, placed seated on the curb while they searched my car. My one request to know what they were doing and why I was restrained was unanswered. But…I knew also not to make a scene or start bellowing…so I just sat and froze in the wind and suffered quietly. Eventually, first MA turned to me and told me (possibly 15 minutes after the stop) that the reason he searched the car and put me in cuffs was because the rental vehicle had been reported stolen several months before, in a different state. Hmmm…ok. I continued to wait, seated, cuffed. The better part of an hour passes. I am by now almost frost-bitten and numb (try wearing metal hinge-type cuffs tightly applied for 45 minutes in the windchill…). And quite angry, because not only am I a field grade officer clearly identified by my ID, but the MA’s have failed to follow protocol to request a supervisor, or the Officer of the Day to the scene, and are clearly taking their time…without ever once asking me if I was cold, if I could put on my jacket (in my rental vehicle), or be placed into the back seat of one of their police cars. But I’m quiet…and watching…and listening. Almost a full hour, the MA helps me to my feet, uncuffs me, hands me my documents, and tells me it’s all cleared up, the car wasn’t stolen after all. Wow. All that for apparently nothing? I take note of his name tag and grade insignia, the time/date/place, his fellow MA’s name, and get back into my car and drive away, never to return to that base again (my duties there were over). I receive no paperwork, no verbal warnings, no case number, etc. Just a “Have a nice night, sir.” I say nothing, and drive away. But I forget nothing. So…after I return to my permanent duty station (safely about 10 states away), I report the encounter to my Boss, because it might have been added to the “Blotter” where criminal incidents are recorded on military bases (and then shared with other bases if their people were involved). I then call the Commanding Officer of the base where I was detained. I speak to the CO of the Base there, tell him of the issues, and the treatment I received, and asked him to have one of his people go over to the MA House (or police station, whatever it was called), and find out whether everything was done exactly as per SOP and training. Within a few hours, I get a call from the senior MA on the installation, a Master Chief (E-9), who wants to get my side of the story, straight from my mouth. I explain, carefully, and factually, without emotionally clogging up the story. I tell him that not only am I a long-serving investigations officer and school-trained legal officer and have perhaps 20 years on the job of those duties, but I served as a full time sworn civilian police officer for 1.5 years, and as a sworn auxiliary officer for 1 more year…so I knew what they were doing and why. This poor Master Chief must apologize because THERE IS NO RECORD WHATSOEVER of the entire incident. Nothing in the blotter. Nothing in the individual MA’s own logbooks for that day, no recordings transcribed from the records check for myself and my rental vehicle…Hmmm… He brings in the two MA’s to his office. They were both off-duty, so I don’t know where he found them, but I’m sure they were unhappy campers. He puts the speaker phone on, and asks them questions. When their answers deviate from what I had written down as soon as I got to my hotel room, in excruciating detail, everything I remembered as I froze to numbness, then I fill in the gaps, reading from my notes “verbatim.” After they realized they could not outflank their Boss, or me on the phone, they simply shut up because they were probably close to multiple violations of the UCMJ. I had looked up a list of the possible Articles of the UCMJ I could submit a Charge Sheet against them, if I needed to. Then the Master Chief started yelling at them, drill instructor-style. I suppose he wanted me to hear how he was punishing them…but I figured at that time it was “Master Chief time” and no longer my business as an officer. My business was done. I hung up the phone. But wait, there’s more! I am called back the next day by the Base XO, who is my own grade, my peer. He apologizes, asked if I suffered any permanent physical injury from the cold or the event, and he then explains that because those two MA’s failed to use proper agency procedures, failed to make reports, failed to notify superiors in the chain that they had made a “felony hot stop” with a possible stolen car and then detained an officer in restraints for an hour without providing reasonable precautions against frost-bite…well, let’s say it ended poorly for the young MA’s. Very poorly. Because although they have the power over anyone they encounter while they are performing their duties….they have to perform their duties correctly, with skill and professionalism. Once they detain someone, that person is in their custody (however temporary or long), and they must provide reasonable accommodations for disabilities, weather (hot or cold), pain, etc. And they must use all the agency-specific regulations and laws that apply, and use them correctly. So, bottom line: yes, military police can give orders to officers. Provided it is within the scope of their employment, they have the authority and the right. But, they must use the proper procedures when giving those orders, and exercising their lawful authorities over anyone, whether it be officer, enlisted, or civilian. Even a fellow law enforcement officer. And I still have the notebook with the events of that day…should it ever be relevant… Lessons for the Quorians: Be quiet with cops, listen, remember, then go write everything down, everything! Right away before you do anything else or forget any details.Do exactly what they say, don’t complain or struggle unless you are in severe pain, and then give lots of warning (“my shoulder is bad, my back is cramping…”).When it is over, say and do nothing that further prolongs the incident; your goal is to leave safely and quickly, so you can go somewhere and write down everything that happened!Then, engage with the supervisory level of the police agency; find somebody there who cares, whether first line supervisor, Captains, internal affairs, or go to the Chief or Sheriff and bring your complaint in writing with notes. Sit in their waiting room looking at their secretary all day if you must…insist on seeing someone with authority.Ask them to do an internal check, to see whether everything was done according to their own Agency policies, and State/Federal/local/Tribal laws.Stay civil, but firm, in requesting answers…This is the accountability that most police agencies need to stay honest and transparent. The citizens must ask questions, and get answers.Here are the references for those Quorians who wish for a “deep dive” into the complex world of military law. All references from the Manual for Court-Martial (MCM), which also contains the Uniform Code of Military Justice (UCMJ). See: http://www.au.af.mil/au/awc/awcgate/law/mcm.pdf 1. Rule for Court-Martial (RCM) 302. Apprehension. (Page II-17) (a) Definition and scope. (1) Definition. Apprehension is the taking of a person into custody. → Discussion Apprehension is the equivalent of “arrest” in civilian terminology. (In military terminology, “arrest” is a form of restraint. See Article 9; R.C.M. 304.) See subsection (c) of this rule concerning the bases for apprehension. An apprehension is not required in every case; the fact that an accused was never apprehended does not affect the jurisdiction of a court-martial to try the accused. However, see R.C.M. 202(c) concerning attachment of jurisdiction. An apprehension is different from detention of a person for investigative purposes, although each involves the exercise of government control over the freedom of movement of a person. An apprehension must be based on probable cause, and the custody initiated in an apprehension may continue until proper authority is notified and acts under R.C.M. 304 or 305. An investigative detention may be made on less than probable cause (see Mil. R. Evid. 314(f)), and normally involves a relatively short period of custody. Furthermore, an extensive search of the person is not authorized incident to an investigative detention, as it is with an apprehension. See Mil. R. Evid. 314(f) and (g). (b ) Who may apprehend. The following officials may apprehend any person subject to trial by court-martial: (1) Military law enforcement officials. Security police, military police, master at arms personnel, members of the shore patrol, and persons designated by proper authorities to perform military criminal investigative, guard, or police duties, whether subject to the code or not, when in each of the foregoing instances, the official making the apprehension is in the execution of law enforcement duties; Discussion Whenever enlisted persons, including police and guards, and civilian police and guards apprehend any commissioned or warrant officer, such persons should make an immediate report to the commissioned officer to whom the apprehending person is responsible. The phrase “persons designated by proper authority to perform military criminal investigative, guard or police duties” includes special agents of the Defense Criminal Investigative Service. (2) Commissioned, warrant, petty, and noncommissioned officers. All commissioned, warrant, petty, and noncommissioned officers on active duty or inactive duty training. Discussion Noncommissioned and petty officers not otherwise performing law enforcement duties should not apprehend a commissioned officer unless directed to do so by a commissioned officer or in order to prevent disgrace to the service or the escape of one who has committed a serious offense. (3) Civilians authorized to apprehend deserters. Under Article 8, any civilian officer having authority to apprehend offenders under laws of the United States or of a State, Territory, Commonwealth, or possession, or the District of Columbia, when the apprehension is of a deserter from the armed forces. Discussion The code specifically provides that any civil officer, whether of a State, Territory, district, or of the United States may apprehend any deserter. However, this authority does not permit state and local law enforcement officers to apprehend persons for other violations of the code. See Article 8. (c) Grounds for apprehension. A person subject to the code or trial thereunder may be apprehended for an offense triable by court-martial upon probable cause to apprehend. Probable cause to apprehend exists when there are reasonable grounds to believe that an offense has been or is being committed and the person to be apprehended committed or is committing it. Persons authorized to apprehend under subsection (b)(2) of this rule may also apprehend persons subject to the code who take part in quarrels, frays, or disorders, wherever they occur. Discussion “Reasonable grounds” means that there must be the kind of reliable information that a reasonable, prudent person would rely on which makes it more likely than not that something is true. A mere suspicion is not enough but proof which would support a conviction is not necessary. A person who determines probable cause may rely on the reports of others. (d) How an apprehension may be made. (1) In general. An apprehension is made by clearly notifying the person to be apprehended that person is in custody. This notice should be given orally or in writing, but it may be implied by the circumstances. (2) Warrants. Neither warrants nor any other authorization shall be required for an apprehension under these rules except as required in subsection (e)(2) of this rule. (3) Use of force. A person authorized under these rules to make an apprehension may use such force and means as reasonably necessary under the circumstances to effect the apprehension. Discussion In addition to any other action required by law or regulation or proper military officials, any person making an apprehension under these rules should maintain custody of the person apprehended and inform as promptly as possible the immediate commander of the person apprehended, or any official higher in the chain of command of the person apprehended if it is impractical to inform the immediate commander. (e) Where an apprehension may be made. (1) In general. An apprehension may be made at any place, except as provided in subsection (e)(2) of this rule. (2) Private dwellings. A private dwelling includes dwellings, on or off a military installation, such as single family houses, duplexes, and apartments… 2. Military Rule of Evidence (MRE) 314. Searches not requiring probable cause. (Page III-12) (a) General rule. Evidence obtained from reasonable searches not requiring probable cause conducted pursuant to this rule is admissible at trial when relevant and not otherwise inadmissible under these rules. . . . (f) Searches incident to a lawful stop. (1) Stops. A person authorized to apprehend under R.C.M. 302(b) and others performing law enforcement duties may stop another person temporarily when the person making the stop has information or observes unusual conduct that leads him or her reasonably to conclude in light of his or her experience that criminal activity may be afoot. The purpose of the stop must be investigatory in nature. (2) Frisks. When a lawful stop is performed, the person stopped may be frisked for weapons when that person is reasonably believed to be armed and presently dangerous. Contraband or evidence located in the process of a lawful frisk may be seized. (3) Motor vehicles. When a person lawfully stopped is the driver or a passenger in a motor vehicle, the passenger compartment of the vehicle may be searched for weapons if the official who made the stop has a reasonable belief that the person stopped is dangerous and that the person stopped may gain immediate control of a weapon. (g) Searches incident to a lawful apprehension. (1) General rule. A person who has been lawfully apprehended may be searched. (2) Search for weapons and destructible evidence. A search may be conducted for weapons or destructible evidence, in the area within the immediate control of a person who has been apprehended. The area within the person’s “immediate control” is the area which the individual searching could reasonably believe that the person apprehended could reach with a sudden movement to obtain such property; provided, that the passenger compartment of an automobile, and containers within the passenger compartment may be searched as a contemporaneous incident of the apprehension of an occupant of the automobile, regardless whether the person apprehended has been removed from the vehicle. 3. Military Rule of Evidence (MRE) 316. Seizures. (Page III-16) (a) General rule. Evidence obtained from seizures conducted in accordance with this rule is admissible at trial if the evidence was not obtained as a result of an unlawful search and if the evidence is relevant and not otherwise inadmissible under these rules. (b ) Seizure of property. Probable cause to seize property or evidence exists when there is a reasonable belief that the property or evidence is an unlawful weapon, contraband, evidence of crime, or might be used to resist apprehension or to escape. (c ) Apprehension. Apprehension is governed by R.C.M. 302. (e) Power to seize. Any commissioned officer, warrant officer, petty officer, noncommissioned officer, and, when in the execution of guard or police duties, any criminal investigator, member of the Air Force security police, military police, or shore patrol, or individual designated by proper authority to perform guard or police duties, or any agent of any such person, may seize property pursuant to this rule. —-> Punitive Articles, Excerpts from MCM that may have been applicable in this situation, and others of similar scenarios: Articles: 81, 92, 93, 97, 98, 107, 121, 128, 131, 134(95), 134(99). 5. Article 81—Conspiracy a. Text of statute. Any person subject to this chapter who conspires with any other person to commit an offense under this chapter shall, if one or more of the conspirators does an act to effect the object of the conspiracy, be punished as a court-martial may direct. 16. Article 92—Failure to obey order or regulation a. Text of statute. Any person subject to this chapter who— (1) violates or fails to obey any lawful general order or regulation; (2) having knowledge of any other lawful order issued by a member of the armed forces, which it is his duty to obey, fails to obey the order; or (3) is derelict in the performance of his duties; shall be punished as a court-martial may direct. 17. Article 93—Cruelty and maltreatment a. Text of statute. Any person subject to this chapter who is guilty of cruelty toward, or oppression or maltreatment of, any person subject to his orders shall be punished as a court-martial may direct. 21. Article 97—Unlawful detention a. Text of statute. Any person subject to this chapter who, except as provided by law, apprehends, arrests, or confines any person shall be punished as a court-martial may direct. 22. Article 98—Noncompliance with procedural rules a. Text of statute. Any person subject to this chapter who — (1) is responsible for unnecessary delay in the disposition of any case of a person accused of an offense under this chapter; or (2) Knowingly and intentionally fails to enforce or comply with any provision of this chapter regulating the proceedings before, during, or after trial of an accused; shall be punished as a court-martial may direct. 31. Article 107—False official statements a. Text of statute. Any person subject to this chapter who, with intent to deceive, signs any false record, return, regulation, order, or other official document, knowing it to be false, or makes any other false official statement knowing it to be false, shall be punished as a court-martial may direct. 46. Article 121—Larceny and wrongful appropriation a. Text of statute. (a ) Any person subject to this chapter who wrongfully takes, obtains, or withholds, by any means, from the possession of the owner or of any other person any money, personal property, or article of value of any kind — (1) with intent permanently to deprive or defraud another person of the use and benefit of property or to appropriate it to his own use or the use of any person other than the owner, steals that property and is guilty of larceny; or (2) with intent temporarily to deprive or defraud another person of the use and benefit of property or to appropriate it to his own use or the use of any person other than the owner, is guilty of wrongful appropriation. (b ) Any person found guilty of larceny or wrongful appropriation shall be punished as a court-martial may direct. 54. Article 128—Assault a. Text of statute. (a) Any person subject to this chapter who attempts or offers with unlawful force or violence to do bodily harm to another person, whether or not the attempt or offer is consummated, is guilty of assault and shall be punished as a court-martial may direct. (b) Any person subject to this chapter who — (1 ) commits an assault with a dangerous weapon or other means or force likely to produce death or grievous bodily harm; or (2) commits an assault and intentionally inflicts grievous bodily harm with or without a weapon; is guilty of aggravated assault and shall be punished as a court-martial may direct. 57. Article 131—Perjury a. Text of statute. Any person subject to this chapter who in a judicial proceeding or in a course of justice willfully and corruptly — (1) upon a lawful oath or in any form allowed by law to be substituted for an oath, gives any false testimony material to the issue or matter of inquiry; or (2) in any declaration, certificate, verification, or statement under penalty of perjury as permitted under section 1746 of title 28, United States Code, subscribes any false statement material to the issue or matter of inquiry; is guilty of perjury and shall be punished as a court-martial may direct. 95. Article 134—(Misprision of serious offense) a. Text of statute. See paragraph 60 (below): Par. 60. Article 134, The Basic Article: Though not specifically mentioned in this chapter, all disorders and neglects to the prejudice of good order and discipline in the armed forces, all conduct of a nature to bring discredit upon the armed forces, and crimes and offenses not capital, of which persons subject to this chapter may be guilty, shall be taken cognizance of by a general, special, or summary court-martial, according to the nature and degree of the offense, and shall be punished at the discretion of that court.b. Elements. (1) That a certain serious offense was committed by a certain person; (2) That the accused knew that the said person had committed the serious offense; (3) That, thereafter, the accused concealed the serious offense and failed to make it known to civilian or military authorities as soon as possible; (4) That the concealing was wrongful; and . . . 99. Article 134—(Public record: altering, concealing, removing, mutilating, obliterating, or destroying) a. Text of statute. See paragraph 60 (as above). b. Elements. (1) That the accused altered, concealed, removed, mutilated, obliterated, destroyed, or took with the intent to alter, conceal, remove, mutilate, obliterate, or destroy, a certain public record; (2) That the act of the accused was willful and unlawful; and (3) That, under the circumstances, the conduct of the accused was to the prejudice of good order and discipline in the armed forces or was of a nature to bring discredit upon the armed forces. c . Explanation. “Public records” include records, reports, statements, or data compilations, in any form, of public offices or agencies, setting forth the activities of the office or agency, or matters observed pursuant to duty imposed by law as to which matters there was a duty to report. “Public records” includes classified matters. ",
            "date": "Updated April 6, 2019",
            "views": "101",
            "upvotes": " View 20 Upvoters",
            "upvoters": [
                {
                    "user_id": "Dave Calhoun",
                    "user_href": "/profile/Dave-Calhoun-1"
                },
                {
                    "user_id": "Hokan Hadiartha",
                    "user_href": "/profile/Hokan-Hadiartha"
                },
                {
                    "user_id": "Nathan Edwards",
                    "user_href": "/profile/Nathan-Edwards-109"
                },
                {
                    "user_id": "Ventus Plitheon",
                    "user_href": "/profile/Ventus-Plitheon"
                },
                {
                    "user_id": "Ben Collins",
                    "user_href": "/profile/Ben-Collins-219"
                },
                {
                    "user_id": "Durojaye Olufunmilayo",
                    "user_href": "/profile/Durojaye-Olufunmilayo"
                },
                {
                    "user_id": "Akhilesh Gutta",
                    "user_href": "/profile/Akhilesh-Gutta-1"
                },
                {
                    "user_id": "Sara Corry",
                    "user_href": "/profile/Sara-Corry-1"
                },
                {
                    "user_id": "Alexis Spearritt",
                    "user_href": "/profile/Alexis-Spearritt"
                },
                {
                    "user_id": "Scott M. Stolz",
                    "user_href": "/profile/Scott-M-Stolz"
                },
                {
                    "user_id": "Dannielle Yarnold",
                    "user_href": "/profile/Dannielle-Yarnold"
                },
                {
                    "user_id": "Ste Cork",
                    "user_href": "/profile/Ste-Cork"
                },
                {
                    "user_id": "Mike Freeman",
                    "user_href": "/profile/Mike-Freeman-47"
                },
                {
                    "user_id": "Karl Smith",
                    "user_href": "/profile/Karl-Smith-54"
                },
                {
                    "user_id": "Derrill Reed",
                    "user_href": "/profile/Derrill-Reed"
                },
                {
                    "user_id": "Tyler Thompson",
                    "user_href": "/profile/Tyler-Thompson-8"
                },
                {
                    "user_id": "Edward Conway",
                    "user_href": "/profile/Edward-Conway"
                },
                {
                    "user_id": "William Stynetski",
                    "user_href": "/profile/William-Stynetski"
                },
                {
                    "user_id": "Keith Hayes",
                    "user_href": "/profile/Keith-Hayes"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/The-Vigilant-Gamer"
                }
            ]
        },
        {
            "author_info": {
                "name": "Michael P. Cronin",
                "href": "/profile/Michael-P-Cronin"
            },
            "answer_text": "We have a different term for MPs in the Air Force, but the function is mostly the same, so I’ll use the term MP. Within the scope of their official duties, and without being disrespectful, yes, they can give orders to officers. Outside of that context, no. An example: An officer is driving under the influence on base. The MPs treat him or her just the same as any other violator - command them to pull over, perform road-side sobriety tests, and perhaps arrest the officer. An officer who tries to order the MPs not to do their job under such circumstances is giving illegal orders; the MPs must respectfully not obey them! Officers know this and most respect the MPs. Likewise, most MPs remember that their authority applies in very narrow circumstances and act accordingly. ",
            "date": "Answered October 5, 2016",
            "views": "49",
            "upvotes": " View 17 Upvoters",
            "upvoters": [
                {
                    "user_id": "Dave Calhoun",
                    "user_href": "/profile/Dave-Calhoun-1"
                },
                {
                    "user_id": "Gary Meyers",
                    "user_href": "/profile/Gary-Meyers-14"
                },
                {
                    "user_id": "Joseph Ma",
                    "user_href": "/profile/Joseph-Ma-11"
                },
                {
                    "user_id": "Matthew Dupree",
                    "user_href": "/profile/Matthew-Dupree-1"
                },
                {
                    "user_id": "Richard Banton",
                    "user_href": "/profile/Richard-Banton-1"
                },
                {
                    "user_id": "Scott M. Stolz",
                    "user_href": "/profile/Scott-M-Stolz"
                },
                {
                    "user_id": "Elliott Rodgers",
                    "user_href": "/profile/Elliott-Rodgers-3"
                },
                {
                    "user_id": "Bubba Watson",
                    "user_href": "/profile/Bubba-Watson-3"
                },
                {
                    "user_id": "Sarah Seton",
                    "user_href": "/profile/Sarah-Seton"
                },
                {
                    "user_id": "Tim Chauvin",
                    "user_href": "/profile/Tim-Chauvin"
                },
                {
                    "user_id": "Mike Jackson",
                    "user_href": "/profile/Mike-Jackson-15"
                },
                {
                    "user_id": "Sai Prasanth",
                    "user_href": "/profile/Sai-Prasanth-46"
                },
                {
                    "user_id": "Gabriele Alfredo Pini",
                    "user_href": "/profile/Gabriele-Alfredo-Pini"
                },
                {
                    "user_id": "Alex Roedel",
                    "user_href": "/profile/Alex-Roedel"
                },
                {
                    "user_id": "Cory Kruger",
                    "user_href": "/profile/Cory-Kruger"
                },
                {
                    "user_id": "Christopher Steuart",
                    "user_href": "/profile/Christopher-Steuart"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/The-Vigilant-Gamer"
                }
            ]
        },
        {
            "author_info": {
                "name": "Jim Doherty",
                "href": "/profile/Jim-Doherty-11"
            },
            "answer_text": "In the context of doing their duty as cops, a US Army Military Policeman (or the equivalent in the other four services) can order a superior to comply with regulations, or to submit to an apprehension (miltary for “arrest”; “arrest” in a military context has a different meaning than it does in the civilian world). ",
            "date": "Answered October 28, 2016",
            "views": "21",
            "upvotes": " View 7 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Will Bentley",
                    "user_href": "/profile/Will-Bentley-11"
                },
                {
                    "user_id": "Scott M. Stolz",
                    "user_href": "/profile/Scott-M-Stolz"
                },
                {
                    "user_id": "Joakim Welde",
                    "user_href": "/profile/Joakim-Welde"
                },
                {
                    "user_id": "Benjamin Talbot",
                    "user_href": "/profile/Benjamin-Talbot"
                },
                {
                    "user_id": "Tim Dees",
                    "user_href": "/profile/Tim-Dees"
                },
                {
                    "user_id": "Prasidh Naik",
                    "user_href": "/profile/Prasidh-Naik"
                },
                {
                    "user_id": "Joe Smith",
                    "user_href": "/profile/Joe-Smith-1350"
                }
            ]
        },
        {
            "author_info": {
                "name": "JD Havard",
                "href": "/profile/JD-Havard"
            },
            "answer_text": "Absolutely. But if a MP is going to apprehend, or is having trouble with an officer, they usually call the duty officer to handle it. But we were taught to tell officers not to confuse our rank with our authority. ",
            "date": "Answered October 15, 2016",
            "views": "13",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Will Bentley",
                    "user_href": "/profile/Will-Bentley-11"
                },
                {
                    "user_id": "Scott M. Stolz",
                    "user_href": "/profile/Scott-M-Stolz"
                }
            ]
        },
        {
            "author_info": {
                "name": "Dan Robb",
                "href": "/profile/Dan-Robb-2"
            },
            "answer_text": "An enlisted MP can usually only give orders to an officer under exigent circumstances; if possible, they would they would request the presence of an MP officer. ",
            "date": "Answered October 21, 2016",
            "views": "11",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Michael Lee",
                    "user_href": "/profile/Michael-Lee-27"
                }
            ]
        }
    ]
}