{
    "title": "Can I write 11 months an experience a year in resume? - Quora",
    "tags": [
        "Work Experience",
        "Résumé and CV writing",
        "Résumés and CVs",
        "Jobs and Careers"
    ],
    "response": [
        {
            "author_info": {
                "name": "Scott McNulty",
                "href": "/profile/Scott-McNulty-1"
            },
            "answer_text": "I put “month/yr to month/yr” for places worked on a resume. If I’m writing how much experience with a piece of software or computer language, I would probably write 1 year experience with it if I had 11 months. One difference being that if the software is part of the job in a technical environment I will be tested. Another is that 11 months with most software is about the same as 1 year. But the other situation, how long you’ve worked at a particular place, will probably come back and bite you on the ass if you don’t keep it as correct as possible. If they background check you, they may decide that you had fudged the truth and then you’re going to have to explain when they ask you about it. That’s not the kind of question you want. ",
            "date": "Answered September 27, 2020",
            "views": "232",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Roy Chambers",
                "href": "/profile/Roy-Chambers-1"
            },
            "answer_text": "I normally recommend just putting the years that you worked in places. It is simpler, takes up less space and easier to read. Most companies don’t ask for the months of employment only the years. So they don’t care either. Of course if you worked for a few days from December 31 to Jan 1, you put down 2017 to 2018 and it looks like you have over a years experience. ",
            "date": "Answered December 30, 2019",
            "views": "11",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "John Long",
                    "user_href": "/profile/John-Long-587"
                }
            ]
        },
        {
            "author_info": {
                "name": "Lei Lani Lucero",
                "href": "/profile/Lei-Lani-Lucero"
            },
            "answer_text": "If you choose to list employment dates in the form of “from month-year to month-year” then there is no ambiguity. If you are just referring to lengths of experience, then it’s your call. Some employers might see rounding up experience as cause for termination. Some might see it as creativity, and applaud your effort to pad your resume. ",
            "date": "Answered March 17, 2019",
            "views": "18",
            "upvotes": "0"
        }
    ]
}