{
    "title": "Can goals help to change your life? How? - Quora",
    "tags": [
        "Setting Goals",
        "Goals",
        "Personal Goals",
        "Self-Improvement",
        "Life and Living"
    ],
    "response": [
        {
            "author_info": {
                "name": "Preeti Singh",
                "href": "/profile/Preeti-Singh-822"
            },
            "answer_text": "Yes…definitely! Your goals can push you towards a better life. When there are goals in your life then you start act according to your goals and they lead you to a positive and a better life. Goals are most important for everyone to make their life meaningful and interesting. When you set some goals it simply means that you know very well that what do you want to do with your life, what do you want to achieve and where do you want to go in your future. Goals give you a direction. When there are goals in your life then there are more the chances of your success and you'll succeed much faster. And your Goals can be small or big…. “ Big goals are important. You should always have a clear vision of where you would ultimately like to be. But be sure to set yourself a number of small goals along the way. Accomplishments drives ambition. The dream might be the destination, but the little triumphs will get you there.” ",
            "date": "Updated November 28, 2018",
            "views": "519",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Jaya Tripathi",
                    "user_href": "/profile/Jaya-Tripathi-52"
                },
                {
                    "user_id": "Prashant Vikram",
                    "user_href": "/profile/Prashant-Vikram-8"
                },
                {
                    "user_id": "Chhaya Chauhan",
                    "user_href": "/profile/Chhaya-Chauhan-5"
                }
            ]
        },
        {
            "author_info": {
                "name": "Sunoze Yang",
                "href": "/profile/Sunoze-Yang"
            },
            "answer_text": "Yes. It would give you a motivation to strive for that goal. To see through questions and reach that goal. Short story. A cousin of mine met a girl at 7 years old. His goal was to marry her! Pretty shocking but yeah. He worked hard and earned a lot of big degrees in college and he married her! They both had the same goal when they first met and when they were a kid. ",
            "date": "Answered November 22, 2018",
            "views": "122",
            "upvotes": "0"
        }
    ]
}