{
    "title": "Can anyone help me with calligraphy pen? - Quora",
    "tags": [
        "Lettering",
        "Calligraphy"
    ],
    "response": [
        {
            "author_info": {
                "name": "Sandeep Jakhere",
                "href": "/profile/Sandeep-Jakhere"
            },
            "answer_text": "If you are a beginner and just want your handwriting to look different and better , then try the pens which are easy to use and manipulate. If you plan to pursue professional calligraphy then its a different thing.   I have written with 3 different pens in the same amount of time without taking any extra effort. Montex MINI ball pen : 10 INRParker Vector Calligraphy pen : 200 INRHero Calligraphy pen 5028 series : 375 INRYou can use the Parker and the Hero pen on a daily basis provided you are not writing on a very absorbent paper. These calligraphy pens use humongous amounts of ink and would actually completely soak a absorbent paper. Check out a couple of nibs with different widths and find out which ones suit you the best. A Parker beginner calligraphy set is easily available on Amazon and provides different nib widths with a single pen. Practice with all the different pens you can get your hands on. And one day you will find the one that suits you the best. Its like finding your own dragon in the fairy tales . The moment you touch it , you will know that your minds connected. ",
            "date": "Answered September 27, 2016",
            "views": "14",
            "upvotes": " View 5 Upvoters",
            "upvoters": [
                {
                    "user_id": "Stephanie Davis",
                    "user_href": "/profile/Stephanie-Davis-680"
                },
                {
                    "user_id": "Deepa Thakur",
                    "user_href": "/profile/Deepa-Thakur-24"
                },
                {
                    "user_id": "Gaurav Chhajed",
                    "user_href": "/profile/Gaurav-Chhajed"
                },
                {
                    "user_id": "Jennifer Chandrasegaran",
                    "user_href": "/profile/Jennifer-Chandrasegaran"
                },
                {
                    "user_id": "Aishwarya Roy",
                    "user_href": "/profile/Aishwarya-Roy-4"
                }
            ]
        },
        {
            "author_info": {
                "name": "Janine Rinker",
                "href": "/profile/Janine-Rinker"
            },
            "answer_text": "It depends what you want to do with it. Sharpie chisel tip markers will work as a very large nib width calligraphy pen (if you want to make posters or something similar). Personally I like the cartridge pen sets for writing. If you are taking a class, you may want one of the old “dip” pens with a “C” nib, and India ink, which is pricey. Permanent ink will gum up your nib. It also depends on what lettering style you want to make. The “classical” calligraphy style uses a “C” nib, but more typography-like styles use other nibs, such as “B”. Akhil, would you give us some more details on what kind of calligraphy you’re interested in? And may your writing endeavors go well. ",
            "date": "Answered October 14, 2016",
            "views": "625",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Jigyasha Sharma",
                    "user_href": "/profile/Jigyasha-Sharma-10"
                }
            ]
        },
        {
            "author_info": {
                "name": "Agastya Chandrakant",
                "href": "/profile/Agastya-Chandrakant"
            },
            "answer_text": "Oh, as per the discussion in comments, I can answer this. Since I am self taught, I would say buy a calligraphy set like this one.    I actually owned this one. Bought it from a stationary store. You can get it on Amazon(.)in (I am not advertising them). Here is the link. SKY GOLD CALLIGRAPHY PEN SET on Amazon  It comes with 6 nibs of varying sizes, and is just perfect for the beginners. But, if you want something more,...Maybe first you should master with this set. Well, there is a type of calligraphy, called Copperplate calligraphy. You need a nib meant for only that calligraphy, and a holder that is capable of holding that particular nib.  Hope that helps.  ",
            "date": "Answered February 1, 2016",
            "views": "751",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Jigyasha Sharma",
                "href": "/profile/Jigyasha-Sharma-10"
            },
            "answer_text": " I suggest you to use the Tombow Fudenosuke or The pentel Fude touch calligraphy pens as a beginner. It will be really easy for you to handle. And you will really love the experience of using them 😊! The photo attached is an example where I used The Tombow Fudenosuke brush pens to do the lettering and calligraphy. !😊❤ ",
            "date": "Answered October 12, 2020",
            "views": "24",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Dipti Pal",
                    "user_href": "/profile/Dipti-Pal-32"
                }
            ]
        },
        {
            "author_info": {
                "name": "ASHISH SOOD",
                "href": "/profile/ASHISH-SOOD-36"
            },
            "answer_text": "If money is not a concern then I would suggest Pilot Parallel Pen Set Its one of the best . I am using it for the past 2–3 years Full set of 4 pens will cost approx 4k ( with Cartridges ) I do not use its cartridge and use it as a Dip pen Set of 4 Pilot Parallel Calligraphy Pens 1.5, 2.4, 3.8, 6.0 mm Regards Ashish ( Follow me on Facebook and @ Instagram \"Calligraphybyashish\" ",
            "date": "Answered September 27, 2016",
            "views": "454",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Prem Kumar",
                "href": "/profile/Prem-Kumar-7161"
            },
            "answer_text": " Try this ",
            "date": "Answered November 22, 2018",
            "views": "34",
            "upvotes": "0"
        }
    ]
}