{
    "title": "Can I write “Dear Professor”? - Quora",
    "tags": [
        "College and University Faculty",
        "Writing Advice"
    ],
    "response": [
        {
            "author_info": {
                "name": "T.Y. Freberg",
                "href": "/profile/T-Y-Freberg"
            },
            "answer_text": "Using “Dear” as a salutation is civilly (socially) accepted; it’s a very too common act… Or that doesn’t mean it’s good: however, it’s sometimes difficult to find a better word for a professional greeting (salutation). And then that’s why “Dear” is consistently chosen! “Please, Professor” sounds like a whiny beggar. “Attention” without please seems kind of commandeering. “Good day, Professor” sounds like good bye before hello. “Greetings, Professor Last Name”, “Professor Last Name”, “Attention: Professor Last Name” “Beseeching Professor Last Name”… So, most letter writers use the standard “Dear, Whomever Whatever” and no one seems to consider it’s foul or too familiar. [I would just write—after the address bar, date and/or attention line—“Professor Last Name” without the “Dear”.] ",
            "date": "Answered November 12, 2019",
            "views": "536",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Larry Winebrenner",
                "href": "/profile/Larry-Winebrenner"
            },
            "answer_text": "Yes, no, maybe. Yes, unless the professor is a snob or it is not customary in your school or school country. Check it out to be sure. Ask a professor you like and trust. No, if it is against school policy, not a custom where you attend school, or it might be misunderstood, e.g. a male student writing to a female professor in a very bpe5rsonal tone. Maybe if it is considered an option the professor permits for non-personal questions and advice. Sometimes it is more proper to write, “Dear Doctor [last name]. You can write “Dear Professor” to me any time—rememberingI’m approaching 90 and have been married to the same woman 66 years. I love you. Doctor Larry Winebrenner ",
            "date": "Answered November 13, 2019",
            "views": "324",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Ron Brown",
                "href": "/profile/Ron-Brown-120"
            },
            "answer_text": "I would have welcomed it from any of my students - it’s a perfectly valid salutation. (And certainly better than just “Hey … “ or something.) I think how to address someone in a communication is always a little bit fraught if it is the first contact. I welcomed emails from my students - and usually tried to respond fairly soon (at my convenience). And it was fairly common to have students be a bit uncertain how to start. I was always fairly informal in class and in my emails to the class, but most students would still start with “Prof. Brown,” or “Dr. Brown,” or sometimes “Dear Professor,” or maybe just “Hi Professor, this is Sally from your physics class” or something. ",
            "date": "Answered November 11, 2019",
            "views": "326",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Mohammed Saiful Alam Siddiquee",
                    "user_href": "/profile/Mohammed-Saiful-Alam-Siddiquee"
                }
            ]
        }
    ]
}