{
    "title": "Can anyone write a paragraph about things that make one feel happy? - Quora",
    "tags": [
        "Paragraphs",
        "Developing and Maintaining Happiness"
    ],
    "response": [
        {
            "author_info": {
                "name": "Ramakant Baunthiyal",
                "href": "/profile/Ramakant-Baunthiyal-रमाकांत-बौंठियाल"
            },
            "answer_text": "I am worried about my career, woman in my life, kids, property, and family. So you do you. What if I told you at the end nothing matters so you can leave that stress for a while. Eventually, you will get a job you wanted, you will love your job, new work and slowly you will feel trapped in corporate conditions. You will look for another trap that will pay higher and entangle you with a bundle of responsibilities. You would have less time with your friends and family and less time to thinking alone. Don’t you think this is the best time to have fun? You will love a woman and she will love you the hell out of your life, you will feel surrender your feeling with someone which you are holding back for a long, and one day she will break your heart and you will be single again, wondering what I did? Don’t you think this is the best time to enjoy being single? You will end up buying properties, one to another, you will build a house for the family to live together. And one day your kids will go to college too far from your home, your wife may land a job in another city. You may get transferred to another city. All family members may live in a different room in a large house, so you would be living alone in your room. Don’t you think you can enjoy living alone in a small house right now? For a moment forget these worries and appreciate what you are right now, what you have right now, and what you are doing right now? This is the only way to get everything tomorrow. ",
            "date": "Answered June 4, 2020",
            "views": "763",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Jovanna Recine",
                "href": "/profile/Jovanna-Recine"
            },
            "answer_text": "What makes me happy doesn’t necessarily help you or anyone else. However if find this question interesting since it activates me to reflect on what triggers an happy moment or life perhaps? It happens in a second. As soon as i feel hope or delight about something i start feeling happy that I will be doing and being something that uplifts me. That is why it is important to visualize a state or project that will bring happiness. I suppose that the thing that will make me happy will not stir everybody the same way. However it is about your passions and the experiences you look forward to.. thus is important to know yourself and be aware. Now i imagine the healing effects of the infra red light and its warmth and that is beautiful. I cannot wait to feel that with the actual light here. I know this sounds simple but i have been watching my feelings for years and it takes many acts of consciousness to know that it is working very deeply when you have even passing thoughts and emotions. Also another exercise is to look at what experience you wish to have and focus on it and it’s details. That brings happiness and can also turn around situations that were not that healthy from the start. Enjoy your trip on earth. It was not meant to be easy to live on earth but a lesson on becoming your higher self. ",
            "date": "Answered May 6, 2018",
            "views": "13",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Wenceslaus Muenyi",
                "href": "/profile/Wenceslaus-Muenyi"
            },
            "answer_text": "Makes one feel happy? Well, I can save you time and write just one sentence about it: If the thing is outside of yourself, you’re going the wrong way. Your happiness must come from within you. How do you get that happiness, you take care of, respect, and love yourself. Once you do that, you’ll start to feel a real appreciation in your life. Side note, happiness isn’t worth going after, go for joy. Going for happiness means you want to ignore your other emotions, and that’s not being loving to yourself and to the experience of life. Those emotions are also part of you and so you should love them too if you want to fully love yourself. Wanting only happiness is like wanting a rollercoaster that never goes down, where’s the fun in that? You’re better off striving for joy, because its enjoying life regardless of the experience it throws your way. ",
            "date": "Answered July 23, 2018",
            "views": "662",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Daniel Ramer",
                    "user_href": "/profile/Daniel-Ramer-2"
                },
                {
                    "user_id": "Christine Grimm Bendes",
                    "user_href": "/profile/Christine-Grimm-Bendes"
                }
            ]
        },
        {
            "author_info": {
                "name": "Shashi Saini",
                "href": "/profile/Shashi-Saini-73"
            },
            "answer_text": "Everybody has their own way to entertain their own life at home and outside. I can write about my own way. I feel happier when I get up early. I prepare breakfast which keeps me healthy and it is always light as I stay home. I prefer to go to bed at 10 pm but if I have to finish chores I take a nap and finish them anyway because I do not feel happy in a messy house. I do not argue with the next person till things go wrong. I discuss my point of view but do not force others to follow what I like. I let them follow their own path until it does not affect his well being( my husband). Everybody is not perfect so I give him space to learn by experience. Good results give me happiness but bad results give him lessons. Same my husband applies. ",
            "date": "Answered July 24, 2018",
            "views": "18",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "John Tsu",
                "href": "/profile/John-Tsu"
            },
            "answer_text": "I’m not sure but let me try. If i was a poet, it would just be four lines because four lines would make my stanza but i’m not. That’s okay because i’m awesome at letting things go and just being me. I like nature because that makes me happy. Next time in the woods, i will bring my notebook and write a poem. Imagine me walking in the woods with pen and paper in hand and birds and deer gather around me to hear my poem. “Wait. Wait. I haven’t written anything yet, and you guys are so lovely and eager.” ",
            "date": "Answered August 24, 2018",
            "views": "630",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "D Kent Deubner",
                "href": "/profile/D-Kent-Deubner"
            },
            "answer_text": "You could. You may need to be a better writer than me, but it is possible. I am happy because of the support and love I receive and perceive from my family and friends. From there my happiness is affirmed by my sense of faith in God through my relationship with Christ. Altogether I have found a sense of happiness that holds moments of brokenness in check. Paragraph? Maybe? Be full of care. ",
            "date": "Answered May 5, 2018",
            "views": "1",
            "upvotes": "0"
        }
    ]
}