{
    "title": "Can someone have autism and schizophrenia at the same time? - Quora",
    "tags": [
        "Clinical Psychology",
        "Schizophrenia",
        "Autism Spectrum Disorders",
        "Asperger Syndrome",
        "Autism",
        "Psychiatry",
        "Mental Illness",
        "Psychology",
        "Mental Health"
    ],
    "response": [
        {
            "author_info": {
                "name": "Susan Canaday",
                "href": "/profile/Susan-Canaday-1"
            },
            "answer_text": "Yes, I’ve been a helper and respite care giver to several young folks with both disorders. It is very, very hard on a person and his family. But please don’t conclude that an autistic person has schizophrenia just because his behavior is odd. That doesn’t necessarily mean he has schizophrenia too. And some with autism have some symptoms of several mental illnesses but can’t be clearly diagnosed with one or the other. They used to get diagnosed with mood disorder NOS, psychosis NOS (not otherwise specified). And a fair number of people with Childhood Disintegrative Disorder also have various symptoms of psychosis. I think I counted 2 out of 8 of the case studies in ‘When Autism Strikes’ had psychotic symptoms, possibly 3 out of 8 (I’ll recount them, my memory is fuzzy on it). And some studies have found around 30% of people with mild autism will develop a psychotic disorder, though results may vary depending on how people are recruited for the study. Some time ago when Kanner ruled the roost a person had to be rediagnosed without autism if he showed symptoms of psychosis as Kanner insisted people didn’t get autism and psychosis. Even though his own research showed it at a high rate. The truth is that the genetics of the two are very close and many people with autism wind up with other disorders as well. It stinks, but that’s the truth of it. ",
            "date": "Answered August 27, 2019",
            "views": "689",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Jennifer Jones",
                    "user_href": "/profile/Jennifer-Jones-1841"
                },
                {
                    "user_id": "Rachel Harris",
                    "user_href": "/profile/Rachel-Harris-105"
                },
                {
                    "user_id": "Dean Crose",
                    "user_href": "/profile/Dean-Crose"
                }
            ]
        },
        {
            "author_info": {
                "name": "Dean Crose",
                "href": "/profile/Dean-Crose"
            },
            "answer_text": "Yes, we can have anything anyone else can. But interestingly, many decades ago autism was often misdiagnosed as schizophrenia. We do experience things differently than others do since our bodies are processing sensory data differently or not at all. I think there is some relationship between the two disorders as well as with anxiety disorders, OCD, and the egocentric disorders (NPD, ASPD). ",
            "date": "Answered October 14, 2019",
            "views": "272",
            "upvotes": " Answer requested by Xander Becker",
            "upvoters": [
                {
                    "user_id": "Emma Skinner",
                    "user_href": "/profile/Emma-Skinner-5"
                }
            ]
        },
        {
            "author_info": {
                "name": "Rachel Harris",
                "href": "/profile/Rachel-Harris-105"
            },
            "answer_text": "Yes this does happen.’ Genetic changes and affected biochemical pathways are associated with the metabolism of lipids and responses to oxidative stress – important factors in neurological development’ \"The identification of shared pathways and disease-relevant genes provides biological insights into autism spectrum disorder and schizophrenia,\" says Ozaki. We Just Got Even More Evidence That Autism And Schizophrenia Share Genetic Roots Thanks Xander for your A2A ",
            "date": "Answered October 14, 2019",
            "views": "299",
            "upvotes": " View 1 Upvoter "
        },
        {
            "author_info": {
                "name": "Lucas Jerzy Portela",
                "href": "/profile/Lucas-Jerzy-Portela"
            },
            "answer_text": "No, those are mutually excludent diagnostics: if a person is properly psychotic, they can not be autistic as there is some objectual relationship which the lack ther off is the very definition of autism. ",
            "date": "Answered August 27, 2019",
            "views": "134",
            "upvotes": " Answer requested by Xander Becker"
        },
        {
            "author_info": {
                "name": "Jan Forsberg",
                "href": "/profile/Jan-Forsberg"
            },
            "answer_text": "That is an interesting question that I do not know the answer to but when I read the DSM 5 handbook I notice that schizofrenia is not an issue under the heading “comorbidity” ",
            "date": "Answered August 27, 2019",
            "views": "94",
            "upvotes": " Answer requested by Xander Becker"
        }
    ]
}