{
    "title": "Can I take ownership of America's abandoned buildings? - Quora",
    "tags": [
        "Urban Renewal",
        "Urban Exploration",
        "Abandoned Buildings",
        "Buildings",
        "Architecture",
        "Real Estate"
    ],
    "response": [
        {
            "author_info": {
                "name": "Fred Landis",
                "href": "/profile/Fred-Landis"
            },
            "answer_text": "As it happens in the last few days I have seen several examples of exactly this on French and Brazilian TV, with government support. A former governor of Rio publicly urged the poor to take over abandoned buildings.The context was that it was common for real estate speculators to collect the deposits of hundreds of condo owners and the building was never finished. The government hoped that occupation of the buildings would force the issue. The French government has been selling off abandoned prisons, schools, and entire towns for almost nothing. French historical preservation groups protest that this is going to foreign speculators. I believe the US is far too legalistic to tolerate common-sense solutions to abandoned buildings. ",
            "date": "Answered February 20, 2014",
            "views": "912",
            "upvotes": " View 5 Upvoters",
            "upvoters": [
                {
                    "user_id": "Jessica Velasquez",
                    "user_href": "/profile/Jessica-Velasquez-10"
                },
                {
                    "user_id": "Ryan Taylor",
                    "user_href": "/profile/Ryan-Taylor-66"
                },
                {
                    "user_id": "Chris Savvopoulos",
                    "user_href": "/profile/Chris-Savvopoulos"
                },
                {
                    "user_id": "Gail Noble",
                    "user_href": "/profile/Gail-Noble"
                },
                {
                    "user_id": "Christopher Ogden",
                    "user_href": "/profile/Christopher-Ogden"
                }
            ]
        },
        {
            "author_info": {
                "name": "Mike Prozan",
                "href": "/profile/Mike-Prozan"
            },
            "answer_text": "I am going to give Matthew Bohrer's answer in reverse and put a more positive spin on it. There is a doctrine called adverse possession, or, basically, squatters rights.  If a building is abandoned, you move in, and occupy it for some period of time (we're talking years), and nobody tries to throw you out, you can claim ownership.  My guess is this only applies to private property, not government property as is shown in some of the pictures. Yes, taking things from the property, destroying it, etc. involves legal wrongs. ",
            "date": "Answered February 21, 2014",
            "views": "651",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Paul Beaton",
                    "user_href": "/profile/Paul-Beaton-8"
                },
                {
                    "user_id": "Jon Mixon",
                    "user_href": "/profile/Jon-Mixon-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Laura Brown",
                "href": "/profile/Laura-Brown-7"
            },
            "answer_text": "The problem with moving into an abandoned place is that someone does own it.  This means they are responsible for what happens on or to the property. If someone is hurt - even trespassers or squatters, the property owner (and whatever insurance they have or wish they had) will be responsible for bodily harm, fires, etc.  If you move in and try to live in a place you do not own or have rights to the actual owner can throw you out. So you can at any time be told to leave. Depending on local law this could be a violent eviction or just an angry one. ",
            "date": "Answered January 24, 2015",
            "views": "393",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Matthew Bohrer",
                "href": "/profile/Matthew-Bohrer"
            },
            "answer_text": "\"Abandoned\" just means the owner is not attending to it.  It doesn't mean the property is up for grabs. Removing property from such a building is theft. Damaging property is malicious destruction. etc. That said, research \"adverse possession\" for one of the things you can do with such buildings. ",
            "date": "Answered February 20, 2014",
            "views": "12",
            "upvotes": " View 10 Upvoters",
            "upvoters": [
                {
                    "user_id": "Dante Boccarossa Jrr",
                    "user_href": "/profile/Dante-Boccarossa-Jrr"
                },
                {
                    "user_id": "Dork Vania",
                    "user_href": "/profile/Dork-Vania"
                },
                {
                    "user_id": "John Arceneaux",
                    "user_href": "/profile/John-Arceneaux-1"
                },
                {
                    "user_id": "Jon Mixon",
                    "user_href": "/profile/Jon-Mixon-1"
                },
                {
                    "user_id": "Laura Brown",
                    "user_href": "/profile/Laura-Brown-7"
                },
                {
                    "user_id": "David de la Fuente",
                    "user_href": "/profile/David-de-la-Fuente"
                },
                {
                    "user_id": "Bruce Feldman",
                    "user_href": "/profile/Bruce-Feldman"
                },
                {
                    "user_id": "Dana H. Shultz",
                    "user_href": "/profile/Dana-H-Shultz"
                },
                {
                    "user_id": "Miles Dolphin",
                    "user_href": "/profile/Miles-Dolphin"
                },
                {
                    "user_id": "Christopher Ogden",
                    "user_href": "/profile/Christopher-Ogden"
                }
            ]
        }
    ]
}