{
    "title": "Can teenagers write good books? - Quora",
    "tags": [
        "Book Writing",
        "Writing",
        "Teenagers and Teenage Years"
    ],
    "response": [
        {
            "author_info": {
                "name": "William D. Richards",
                "href": "/profile/William-D-Richards"
            },
            "answer_text": "Yes. The argument from highly experienced people in the writing industry states that teenagers don’t have enough life experience to tell a good story. Well, my argument is, “Who knows more about being a teenager than a teenager?” Truth is, both are valid arguments. Kids who read a lot learn how to write from reading those examples. I could explain to you how to hit a tennis ball with a racket for the better part of an hour, diagraming vectors, calculating velocities and acceleration, etc. Or, I could just pick up a racket and show you in roughly two seconds. That being said, it takes practice to perfect just how to do something. A LOT of practice. Also, just because you haven’t done something doesn’t mean you can’t write about it. Just ask any science fiction author how many aliens they’ve met in their lifetime. What, then, qualifies them to write about aliens in their stories? I like to point out to budding and aspiring writers that first draft manuscripts almost always suck. So don’t worry about it. Just write! This is why we have editors, to help writers fix what doesn’t work and turn their meanderings into an actual, readable book. Getting published might be a little harder because of your age. Agents and publishers won’t take you seriously. But a good story is a good story and good writing is good writing. If it reads well, they won’t care about your age. A good book will sell and make money. For story ideas that just don’t work today, don’t throw them away. They could become the seeds for future books when you figure out how to make them work. Robert Heinlein’s first novel was For Us, The Living. It was never published; it was absolutely terrible. He wrote it in 1938, it was published in 2003, some 15 years after his death. Yet, as bad as it is, it is an amazing look into the mind of the now famous author. You can see all the different characters, ideas, and scenes that would be used to become some of his biggest and most famous novels stuffed into this one volume. Write because you enjoy it! ",
            "date": "Answered April 23, 2019",
            "views": "857",
            "upvotes": " View 8 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Georgie",
                    "user_href": "/profile/Georgie-42"
                },
                {
                    "user_id": "Nishi Tandon",
                    "user_href": "/profile/Nishi-Tandon-4"
                },
                {
                    "user_id": "Chenmeng Yu",
                    "user_href": "/profile/Chenmeng-Yu-1"
                },
                {
                    "user_id": "Raven Alexandra",
                    "user_href": "/profile/Raven-Alexandra-2"
                },
                {
                    "user_id": "Jincy Bassilia",
                    "user_href": "/profile/Jincy-Bassilia"
                },
                {
                    "user_id": "Isabelle Grey",
                    "user_href": "/profile/Isabelle-Grey-2"
                },
                {
                    "user_id": "Ushmil Rimjha",
                    "user_href": "/profile/Ushmil-Rimjha"
                },
                {
                    "user_id": "Dimitar Ivanov",
                    "user_href": "/profile/Dimitar-Ivanov-13"
                }
            ]
        },
        {
            "author_info": {
                "name": "Serena",
                "href": "/profile/Serena-312"
            },
            "answer_text": "I certainly believe so. Or, I hope so. Everyone has different styles of writing, and each is unique and perfect in its own way. Plus, one thing I’ve noticed is that teenagers have a very wild imagination and can seemingly imagine anything they want. And, if they're writing teen fiction or young adult, they know their genre well; they're the readers! I’m a fourteen-year-old with a published fantasy novel, which has received praise multiple times. It's not big or anything, but it is published. In my life, I've written over 750,000 words with different collections of novels and stories. I have a few hit fanfictions on Wattpad as well. I tend to fight for the teens for this reason. Think of it; look how many teens have written magnificent literature works! Anne Frank, suggested earlier, wrote her journal, which is widespread and amazing. Additionally, the book Eragon was written by a fifteen-year-old. With enough practice, writing can become natural and beautiful for anyone of any age. Just Google it, and you'll find lots of different types of proof. As long as someone has the practice, patience, and stamina, a book can be written! ",
            "date": "Answered May 5, 2017",
            "views": "385",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Georgie",
                    "user_href": "/profile/Georgie-42"
                },
                {
                    "user_id": "Armin Sony",
                    "user_href": "/profile/Armin-Sony"
                },
                {
                    "user_id": "Anushka Borgohain",
                    "user_href": "/profile/Anushka-Borgohain"
                }
            ]
        },
        {
            "author_info": {
                "name": "Erica Smith",
                "href": "/profile/Erica-Smith-71"
            },
            "answer_text": "Anne Frank was fifteen when she finished her diary. Mary Shelley was eighteen when she wrote Frankenstein. If you want a more modern example, the movie The DUFF is based on Kody Keplinger's novel of the same name, written when she was seventeen. Quality is subjective. I've read books by adults that aren't good at all. I regularly go to writing conferences, conventions, and book signings where I talk to authors, and many of them started writing as teenagers. They all agree that the books they write today are better than what they wrote as teenagers, but that's because their twentieth book is better than their first book. It's not due (entirely) to age or life experience, but writing experience. Teenagers can most definitely write books and they should if they want to be good at it as adults. ",
            "date": "Answered December 15, 2015",
            "views": "691",
            "upvotes": " View 14 Upvoters",
            "upvoters": [
                {
                    "user_id": "Chris Septiceye",
                    "user_href": "/profile/Chris-Septiceye"
                },
                {
                    "user_id": "Isobel Smith",
                    "user_href": "/profile/Isobel-Smith-44"
                },
                {
                    "user_id": "Dimitar Ivanov",
                    "user_href": "/profile/Dimitar-Ivanov-13"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/Djcool-Beat"
                },
                {
                    "user_id": "Foxy Go",
                    "user_href": "/profile/Foxy-Go"
                },
                {
                    "user_id": "Roberta Chaim",
                    "user_href": "/profile/Roberta-Chaim-1"
                },
                {
                    "user_id": "Peace Altınova",
                    "user_href": "/profile/Peace-Altınova"
                },
                {
                    "user_id": "Sophia Schmitz",
                    "user_href": "/profile/Sophia-Schmitz"
                },
                {
                    "user_id": "Xiaoyanse",
                    "user_href": "/profile/Xiaoyanse"
                },
                {
                    "user_id": "Gary Allen",
                    "user_href": "/profile/Gary-Allen-23"
                },
                {
                    "user_id": "Stijn Hommes",
                    "user_href": "/profile/Stijn-Hommes"
                },
                {
                    "user_id": "Film Girlz",
                    "user_href": "/profile/Film-Girlz"
                },
                {
                    "user_id": "Jake Mcspirit",
                    "user_href": "/profile/Jake-Mcspirit"
                },
                {
                    "user_id": "Joshua Prince",
                    "user_href": "/profile/Joshua-Prince-9"
                }
            ]
        },
        {
            "author_info": {
                "name": "Kajsa Makarainen",
                "href": "/profile/Kajsa-Makarainen"
            },
            "answer_text": "Françoise Sagan wrote Bonjour Tristesse when she was eighteen. This short novel has become a classic. Taking place on a holiday in Southern France it's the story of a girl who doesn't like the new girlfriend of her divorced father. It's not the most complex or intellectual book, but it's written in a poetic and fluent style, and you can easily relate to the emotions of the main character - a young girl not unlike the French author herself. She has written twenty novels in total, but her debut is still her most popular work.   Other examples: Mary Shelley was nineteen when she wrote Frankenstein.Arthur Rimbaud wrote his best poems when he was seventeen to twenty. He practically stopped writing at twenty-one.Anne Frank wrote her diary when she was thirteen to fifteen years old.So the real question seems to be: \"Can teenagers who wrote a good book equal that after they turned twenty?\" ",
            "date": "Answered December 16, 2015",
            "views": "983",
            "upvotes": " View 8 Upvoters",
            "upvoters": [
                {
                    "user_id": "Alexander Fortier",
                    "user_href": "/profile/Alexander-Fortier"
                },
                {
                    "user_id": "Shea Francis Patrick Moran",
                    "user_href": "/profile/Shea-Francis-Patrick-Moran"
                },
                {
                    "user_id": "Luis Ortiz",
                    "user_href": "/profile/Luis-Ortiz-39"
                },
                {
                    "user_id": "Gary Allen",
                    "user_href": "/profile/Gary-Allen-23"
                },
                {
                    "user_id": "Tikhon Jelvis",
                    "user_href": "/profile/Tikhon-Jelvis"
                },
                {
                    "user_id": "Anita Sanz",
                    "user_href": "/profile/Anita-Sanz"
                },
                {
                    "user_id": "Yves Granger",
                    "user_href": "/profile/Yves-Granger"
                },
                {
                    "user_id": "Joshua Prince",
                    "user_href": "/profile/Joshua-Prince-9"
                }
            ]
        },
        {
            "author_info": {
                "name": "Haleigh Whitlock",
                "href": "/profile/Haleigh-Whitlock"
            },
            "answer_text": "Origional Question: Can I write and publish a book? I’m 12 years old. This is really two questions- Can you write a book?Yes, absolutely! In fact, if you enjoy writing I would highly encourage you to try it, 12 is about the age I started writing seriously. It can be a very fun and rewarding hobby. 2. Can you publish a book? As someone else has stated, technically yes but realistically no. Anyone can self publish these days, but can you write a book thats worth publishing? That people will actually buy (keep in mind the average self published book sells under 50 copies) With professional editing/ covers? Probably not. This isn’t to say anything about your age or talent, but writing is a game of experience and practice. Most authors have several manuscripts under their belt before they try to publish. They go through dozens of revisions, betta readers, and editors. 5 years from now you’ll look back at your current writing and laugh, and five years from then you’ll look at that writing and laugh. For now, focus on improving your skills, on learning how to tell a story and bring characters to life. Then you can worry about building a marketing platform and querying agents. ",
            "date": "Answered August 8, 2017",
            "views": "476",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Abhay Mishra",
                    "user_href": "/profile/Abhay-Mishra-22"
                },
                {
                    "user_id": "Felicia Green",
                    "user_href": "/profile/Felicia-Green-12"
                },
                {
                    "user_id": "Guillermo René Ramírez Bonilla",
                    "user_href": "/profile/Guillermo-René-Ramírez-Bonilla"
                }
            ]
        },
        {
            "author_info": {
                "name": "Mary Ann Slavcheff",
                "href": "/profile/Mary-Ann-Slavcheff"
            },
            "answer_text": "Teens can write classics. Take of Ann Frank for example; she  was 13 when she started writing her famous diary. Mary Shelley was 16 when she wrote Frankenstein, and we have all heard about that story. it is almost a genre all by itself and it is the theme book of modern times when man’s creations outdo him. S.E. Hinton was still a teen when she wrote “The Outsiders.” I love that book. Those are some of my favorites. Wikipedia has a list of teenaged authors that you can look up.  ",
            "date": "Answered December 16, 2015",
            "views": "326",
            "upvotes": " View 2 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Joel Barkus",
                    "user_href": "/profile/Joel-Barkus"
                },
                {
                    "user_id": "Film Girlz",
                    "user_href": "/profile/Film-Girlz"
                }
            ]
        },
        {
            "author_info": {
                "name": "Sarah Bowman",
                "href": "/profile/Sarah-Bowman-28"
            },
            "answer_text": "I suggest you go ahead and write one, rather than ask. Then we’ll know. I personally don’t know all the authors that exist in the English language, let alone the rest of the world. There could well be books authored by teenagers, for all I know. But I’m quite sure they’re not written by the kind of person who sit on Quora asking if it can be done. They’re the kind of person who squeeze their writing into any spare moment they can find, never asking whether it can be done. They do it. ",
            "date": "Answered August 9, 2017",
            "views": "114",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Rhea Kaur",
                    "user_href": "/profile/Rhea-Kaur-10"
                }
            ]
        },
        {
            "author_info": {
                "name": "Matthew Daneman",
                "href": "/profile/Matthew-Daneman"
            },
            "answer_text": "It's possible, sure. There's an annual anthology in the US, The Best Teen Writing, that collects fiction, essays and poetry by teen writers who received a National Medal in the Scholastic Art & Writing Awards.   The Best Teen Writing of 2014  The Best Teen Writing of 2013  Now, no one teen wrote any of these collections. But all of these are, in aggregate, written by teens.  ",
            "date": "Answered December 15, 2015",
            "views": "485",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Shea Francis Patrick Moran",
                    "user_href": "/profile/Shea-Francis-Patrick-Moran"
                },
                {
                    "user_id": "Film Girlz",
                    "user_href": "/profile/Film-Girlz"
                },
                {
                    "user_id": "Jake Mcspirit",
                    "user_href": "/profile/Jake-Mcspirit"
                }
            ]
        },
        {
            "author_info": {
                "name": "Daniel Slosberg",
                "href": "/profile/Daniel-Slosberg-1"
            },
            "answer_text": "Absolutely. We have published authors from age 3 to age 70 and many ages in between. At Rainbowdash Publishers LLC our publishing decisions are primarily based on quality, and after that our preference is for new authors under 25 years old trying to break out (because we feel other publishers discriminate against this demographic). Best of luck with your book and think of us when it is ready for a publisher. ",
            "date": "Answered August 12, 2017",
            "views": "141",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Col Queen",
                "href": "/profile/Col-Queen"
            },
            "answer_text": "Anyone can write a good book. As long as you've got the creativity, ideas, and grammar you're good to go. Also: 'good' is subjective -- what one person thinks is a literary masterpiece another could see as garbage (a concept that only furthers the idea that any person of any age can write a 'good' novel). ",
            "date": "Answered December 15, 2015",
            "views": "231",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Film Girlz",
                    "user_href": "/profile/Film-Girlz"
                },
                {
                    "user_id": "Shashikant Shukla",
                    "user_href": "/profile/Shashikant-Shukla-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Charlotte Henley Babb",
                "href": "/profile/Charlotte-Henley-Babb"
            },
            "answer_text": "It has happened. I wish I had started writing as a teen rather than waiting until I was middle-aged. Even if what I wrote was crap, I'd at least have the experience when I had something else to write about.  Write now. Write what you know.  Take a class or go to a writers' workshop.  Write.  ",
            "date": "Answered December 18, 2015",
            "views": "436",
            "upvotes": " View 3 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Rhea Kaur",
                    "user_href": "/profile/Rhea-Kaur-10"
                },
                {
                    "user_id": "Shea Francis Patrick Moran",
                    "user_href": "/profile/Shea-Francis-Patrick-Moran"
                },
                {
                    "user_id": "Xiaoyanse",
                    "user_href": "/profile/Xiaoyanse"
                }
            ]
        },
        {
            "author_info": {
                "name": "Joan Kerr",
                "href": "/profile/Joan-Kerr-2"
            },
            "answer_text": "The Australian writer Sonya Hartnett wrote her first novel at 13 and was 15 when it was published.  She has since published many books for adults and for children and has won numerous awards including the Astrid Lindgren Memorial Award. The key is that she is a genuinely original writer with a strong and individual imagination, not simply a teenager writing run-of-the-mill books about teenage angst.  ",
            "date": "Answered December 19, 2015",
            "views": "245",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Anton Blanche",
                "href": "/profile/Anton-Blanche"
            },
            "answer_text": "No. ",
            "date": "Answered December 16, 2015",
            "views": "24",
            "upvotes": "0"
        }
    ]
}