{
    "title": "Can you help me edit my college application essay? - Quora",
    "tags": [
        "Editing (writing)",
        "College Application Essays",
        "Essay Writing Help",
        "Essays",
        "Creative Writing",
        "Grammar",
        "Writing"
    ],
    "response": [
        {
            "author_info": {
                "name": "Parke Muth",
                "href": "/profile/Parke-Muth"
            },
            "answer_text": "Thank you for the A2A.  I am not sure I can be of much help to you at the moment as I am unsure whether this essay is for a specific scholarship program for a specific school, whether it is for a national program of some sort or whether it is an answer to the common application prompt or something altogether different. What I can say at this point is that you have an outline of essay that might help you, but it is not specific enough to convince me you will persuade people to give you funding. Your battle with Crohn’s is something that will be looked at carefully if you can be more specific about how this has affected you, not just as a student but as a person. You say you have had to learn what’s important to you but most of what you have written is abstract rather than specific. I don’t get much of a sense of who you really are. The more detail you can provide about your life and experience the more this essay will speak to others in a way that will let them get to know you. The more you depend on abstractions the more the essay will come across as generic and this is not something you want.  Try to think of it this way. You have to make a two-minute video. Let those who read your words SEE the world you are in. Let them see, hear, touch your world with the details you provide. What does Crohn’s done that makes your world different than others? How have you coped specifically etc.? The more you let us into the world you live in the more it will speak to us. I hope this helps some. Best of luck. ",
            "date": "Answered July 5, 2015",
            "views": "58",
            "upvotes": " View 7 Upvoters",
            "upvoters": [
                {
                    "user_id": "Sofia Guedes",
                    "user_href": "/profile/Sofia-Guedes-1"
                },
                {
                    "user_id": "Aya Alzebda",
                    "user_href": "/profile/Aya-Alzebda-1"
                },
                {
                    "user_id": "Lessa Scherrer",
                    "user_href": "/profile/Lessa-Scherrer"
                },
                {
                    "user_id": "Matthew Kunin",
                    "user_href": "/profile/Matthew-Kunin"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/Enny-2"
                },
                {
                    "user_id": "Bob Perker",
                    "user_href": "/profile/Bob-Perker"
                },
                {
                    "user_id": "Weijia Shi",
                    "user_href": "/profile/Weijia-Shi-2"
                }
            ]
        },
        {
            "author_info": {
                "name": "James Lopez",
                "href": "/profile/James-Lopez-32"
            },
            "answer_text": "Applying to college or university is one of the very most exciting yet troubled times in someone's life. Of all elements of a solid application, writing a distinctive and convincing personal affirmation can be challenging specifically. It isn't uncommon for even the most talented writers to end up fighting their admissions essays. These essays ask students to create in-depth personal narratives, an intimidating prospect that requires a rhetorical style very different from most high school or school assignments. As admissions become competitive at every level increasingly, one needn't wonder why more students would like the advice of a specialist as it pertains to crafting meaningful admissions essays.You could send any best essay writing service to do your article editing from the web.  ",
            "date": "Answered April 11, 2016",
            "views": "278",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Sarah Malters",
                "href": "/profile/Sarah-Malters"
            },
            "answer_text": "If you are a student or have been one, then you know how much critical essay writing is during your academic years. As the time has passed, the students have started using useful tools like grammar checkers or plagiarism checkers to good effect. The tools didn’t stop at the ‘check’ services, and students are now even hiring essay writers for themselves. From services like: 999Papers - This service offers great writing, qualified writers, cheap prices and an awesome customer support.EssaysPaperBox - is a favourite of students across the globe. They are reliable, fast and extremely easy to work with.PaperCheapHelp - Good essay writing services like this one are hard to find. to hiring local writers for help, students find an easy way to get their tasks completed. While people don’t find anything wrong with such practices of buying a piece of writing and then using it for the purpose of their own, it is the professors who believe it to be a wrong way to get the assignments done. Although most of the services take the content from the hirer and then make an essay out of it, there is still mixed reactions among its use by the teachers and students. The question here arises, why do students even use essay writing services? The answers to it are different. Largely the students to whom English is a second language, doing part time jobs or are just lazy, use these services. The students for whom the English language is not a native language, it’s hard to come up with persuasive essays. These are usually international students and although they might have good enough English to understand the teaching or to write an exam, but when compared to the native English speaking students, the quality of writing of international students isn’t the greatest in most of the cases. The second category of the students who use the writing services, students doing jobs, usually don’t find enough time to write essays required in the schools. To cope up with the work and studying, these students utilize the writing services to their effect. The third kind of students who use these services, lazy ones, do not just get excited by the idea of writing. To write a long, painful essay does not attract their interest and they rather rely on the writing services. There is another group of students who have their significant share among the users of writing services, and these are Ph.D. students. The number of Ph.D. students using writing services shouldn’t be surprising when you consider the stakes for which they write. It is mostly the thesis, for which the Ph.D. students hire writers. Because the thesis is, kind of, prestigious to these students, they trust the writing skills of the professionals instead of trying on their own. The thesis by Ph.D. students is available for anyone in the world to read, and ending up having a typo or committing plagiarism would be the last thing on the list the students would want to have. So, what is it that the writing services provide, which the students don’t trust themselves for doing? Writing services usually provide the hirers with the professional writer(s). These professional writers have naturally better writing skills than a regular student have. They take less time and take the writing load off the students. They are like a shortcut to the right grades for some students too. They can put up the content provided by the students into writing in a much better way. As the hiring students have full rights over the printed material and there is no definitive way for the professors to know who writes which essay, they just have to accept it. The assurance of quality with these professionals is guaranteed, and they also check for the plagiarism not being committed. The service providers allow the service users to be in contact with the writers to mold the writing papers in exactly the way the students want to. Even during university degree or Ph.D., the skills of writers are used by students to produce excellent quality writing. The papers in the case of Ph.D. thesis become majorly important as it can make or break careers. Is it correct to use the writing services? Professors can probably digest the fact that students use grammar checking software or some other editing tools. At the end of the day, it is the teachers who evaluate the essays, and it is better to go by their way. The risk of getting caught after using a writing service isn’t worth taking if your degree depends on it. Having mentioned the teacher’s side, it is equally important for teachers to understand the situation of the international students and could probably allow using writers or at least translators if such students need them.  About the students, who work with their studying, could use some flexibility by the professors with the deadlines. When it comes to the student’s side, it is probably better to use the teacher’s or study group’s help instead of getting the work done by the professional writers. But when it comes to the Ph.D. students, we believe that there must be some provision that allows them to use writers for the complete or some part of their thesis. To work on the research, and creating content for the thesis is already an enormous task, and to burden the students to come up with impressive writings is maybe too much to ask for. Having a writer for help would aid these students to relieve the pressure of putting up words good enough to make a mark over the professors. So, having a writer in some cases would not be such a bad idea. Conclusion You cannot entirely discard the writing services help to the students in the academics. It is a good idea to let the international students or part-time students take the help of writers or probably some less strictness in grading when it comes to grading their essays. These services can also help the Ph.D. students to come up with a better thesis. To let the students of junior or high school should be discouraged as students using it at an early stage would always rely on it to get their work done. Having to write themselves during early schooling would probably make it easier for the students to write essays without any service help. U.S. students are under a lot of pressure from several different angles. The cost of college is high. Students are continuously attempting to complete more work in less time. Many students of all ages are woefully underprepared to write at an appropriate level, and English isn't the first language for many. Unfortunately, this is just a high-level list. There are even more reasons U.S. students must apply for academic essay writing services to succeed. To afford their education, many college students have to work and go to school at the same time. Working leaves little time for school work and even less time for friends and family. The arrangement isn't a practical one long term, and so college attendees spend a significant amount of mental effort trying to come up with ways to save time. One of the easiest ways to do this is to hire someone else to do your work. Math, science, and similar fields don't allow for homework to be completed by someone else. If you let someone else do your assignments in those classes, you'd fail the exams. Instead, it's significantly more practical to hire someone to do work like essays and book reports.  A student might spend just a few hours earning enough money to pay someone to write the assignment for them. It may take even less time if they have an internship in their field of study. That same student would have to take off a day or more of work to complete the assignment themselves. It simply makes the most financial sense to apply for essay writing services. Taking time off or performing poorly in their job will harm some students' career. Even students who aren't working and going to school at the same time suffer from a severe lack of time. Students in math, science and engineering fields still have to take classes which require essays and papers. These degrees are known to be hard and time-consuming. The classes requiring excessive writing aren't part of the core curriculum, and it's unlikely the student will ever see a 300-level or higher writing class. Instead of spending hour after hour on writing a paper, the student applies for an essay writing service instead. They can then focus more heavily on their core classes. Even students in high school overloaded with multiple honors and college-level classes may fall into this situation. Depending upon where the student has gone to school in the past their writing skills may not be up to the level required to complete the assignment. There are a lot of ways this can happen. Moving from state to state, or even county to county, can land a student in a school which expects significantly more from them than the one they previously attended. Graduating from an ineffective high school can leave college students so far behind where they should be even the remedial college classes aren't basic enough to catch them up. Some children fall behind moving into the U.S. from a country whose primary language isn't English. People move to the United States from all over the world. While some countries teach English alongside their primary language, many do not. To begin with, learning to write isn't necessarily easy. Adding the need to learn English words and the nuances and exceptions of English language creates a sometimes insurmountable barrier to students. Classes for students who use English as a second language are available for school-aged children, but older children and college students are likely to have a difficult time regardless. Instead of catching up, it's much easier and relatively inexpensive to pay someone to write the required assignments for you. Correcting grammar and spelling can usually be done through software, but sometimes someone's writing is so difficult to understand the computer software can't figure out how to correct the document. For some, it's not even possible to catch up and write at an age-appropriate level. There are just too many obstacles stacked against them and not enough resources available to help. Surprising statistics If you were to walk into a college or high school classroom and ask the students how many of them have ever hired someone to write an essay for them, how many would you expect to raise their hands? Let's assume they're being honest in this scenario. In a classroom of 30 students, do you think you'd see 5 hands? Do you think you'd see 7? You'd actually see about 21 hands. Statistically, 70% of high school and college students will use an essay writing service at least one time in their academic careers. And these essays don't come cheap. While some students will only order a piece of an essay or a small paper for about $20, others may purchase dissertations costing $7,000 or more! Does that surprise you? It can certainly be alarming to learn the sheer number of students who reach out to essay writing services, especially when you consider the cost. Today, these services are more prevalent than ever, but it's worth noting that their activities are completely legal. Students can easily sign up online through websites that essentially guarantee them good grades. That's the number of students who would say they are not enthusiastic writing essays, to be honest. Due to such huge volumes, more and more students began to face fraud tactics and to lose their money. This is one of the reasons why this review blog was created.  Industry background Here's some background information on the essay writing industry. The most popular subjects for essays are English, History, Nursing, and Management. High School, Undergraduate, and Master's students purchase the most essays each year. PhD students also purchase papers occasionally, but they don't compare to the lower academic levels. Students in Virginia, Massachusetts, California, and Illinois purchase more work than students in any other state. Both native English speakers and ESL students take advantage of custom writing services. Some students hire essay services for editing or proofreading, and some hire them to write their whole paper. Why students buy essays? The recent rise of essay writing websites raises a lot of questions. First of all, why do students buy essays? Do they think the work doesn't matter, and so they hire others to take on the tedious work they don't want to do? Are they overwhelmed by the workload, and purchasing essays is just a natural response to being unable to juggle so many things at once? Are they just lazy? The truth lies somewhere in the middle. In extremely prestigious schools, students often feel an overwhelming amount of pressure to succeed. In these cases, paying several hundred dollars a few times a year is a small price to pay for sanity. Some students feel that they understand the material, and they don't need to write out an essay to prove it. There is an underlying assumption that they will not need the writing skills that they'd gain by writing the essays on their own. They might feel that hiring someone to write their papers will free them up to study harder, or get involved in equally important extra-curricular activities that can bolster their resume and lead to more opportunities after graduation. No time? Another compelling reason students hire professionals to write their papers is that they simply do not have the time. We live in a tremendously competitive world. Students know that they need to get a college education to be successful adults. Increasingly, an undergraduate degree isn't enough to differentiate oneself, so more and more students are attending graduate programs. College tuition has been on the rise for the last few decades, with no foreseeable end in sight. Because students know that they need to get the degree, they are willing to do whatever it takes to get good grades and graduate with distinction. But since they are taking on monstrous amounts of debt to pay for just a small portion of their college loans, students are often working 20-40 hours each week in addition to taking on a full-time class schedule and can not cope with deadlines. If a student is in class from 8-3, and then that student has to work from 4-10, when will he find the time to write a 10-page essay? When will he find time to go to the library to find sources? What else? In these cases, it's easy to understand the logic behind hiring another person to write your paper. In the example above, this student might fully understand the topic. He might be at the top of his class. He might even see the value in writing the essay and desire to do it on his own. But when it comes right down to it, he has no choice. He can quit his job, which would force him to drop out of college. Or he can hire someone to write the paper for him, get a solid grade, and be able to continue his education. Alternatively, If a student always writes her own papers, she might feel that hiring someone to write one paper is not indicative of her college experience or skills, and so she might not give it too much thought. Each student's situation is unique, and each student stands to gain or lose something different. Who write papers? On the other side of the equation are the professional writers who create high-quality essays for other people without ever getting the credit. Why would people with Master's degrees and PhD's choose to write essays for others? Surely, this isn't what they had in mind when they were in school themselves. The reasons vary from writer to writer. But one reason is that they may have found themselves in low-paying, dead-end job. They can continue to feel undervalued, or they can write essays for $20-$80 per page! If they are writing a paper with a “references,” or “works cited,” section, they can make an additional $1/source. Some writers might choose this career out of an underlying vengeance for an educational system that they feel has deceived them and left them with a pile of debt and no means to pay it off. Some writers are simply intrigued by the concept of writing essays for hire. If you are an especially gifted writer with a skill set in a hotly desired area of study, becoming a professional essay writer can be tremendously fulfilling. You can use your skills to help students better themselves and succeed in school. Because there are so many understandable reasons why students might choose to hire someone to write their essay, some writers view their work as noble and necessary. The reasons why people choose to become essay writers are as diverse as the reasons students choose to hire them. Ethical side Is the practice of hiring an essay writing service ethical? It's hard to say one way or the other. We have a great blog post that analyze this issue in 4 viewpoints. While it's not considered plagiarism (plagiarism implies stealing another's idea and claiming it as your own- essay writing services are paid for original work), some people argue that it's a form of cheating. Unless a pre-written essay isn't well-referenced and full ownership rights are not turned over to the student, the chances of plagiarism is high and that's the only time a student will commit \"academic cheating\". Therefore, it's important for them to understand what plagiarism really is, and its possible repercussions in their academic performance. But until the educational systems in place offer an alternative for students who feel that they are trapped in a corner, it's unlikely that these websites will disappear anytime soon. We need to have deeper conversations about what students expect from their school and their education. We need to talk about the cost of college, and ways to allow students to attend without breaking the bank. Are Essay Writing Services Ethical? Ethics is an extremely important and vast subject that depends on gender, personality types, past experiences, culture, nature, mental ability and external pressures. Talking about the ethical side of anything is never an easy task, but it becomes a little more difficult when it is about academic essays and term papers for sale and the whole essay writing business. There are both opponents and proponents of this issue – some feel it is fine to use custom essay writing services, while others think differently. Here is a bit more about different point of views on this particular issue. And so, a question arises from all this: Is It ethical to buy essays at custom writing services? There’s a whole plethora of ethical considerations arising from the use of essay writing services, both for the students and the writers. And while plagiarism isn’t necessarily a criminal offense, many schools consider it ‘unethical cheating’. Read the various viewpoints and how these potential ethical threats can be averted. Statistical Viewpoint Many people believe that ordering college papers will have a direct impact on the statistical side of our education system. It means that if a large majority of students are relying on these services, then it may become important to change the system altogether. When people take advantage of these custom essay writing services, they are in fact exposing an important weakness in the education system, which is the reason why it feels ethically correct to order essays. On the other hand, you need to consider what will happen if all of the essay writing companies stop working for a few years. Will there be an increase in the national averages? Will you see more and more students writing their papers on their own? If there is a change in the national average, then it is possible to say that purchasing academic papers is an unethical practice. Another important consideration is about the average score most of these students get after submitting a custom written essay. Statistically speaking, the students who use essay writing services are more likely to get higher scores. However, that's not always the case – some students make a mistake by picking a cheaper service and end up receiving poorly crafted essays. All this will also have an impact on how legitimate it is to order essays from essay writing companies. Long Life Viewpoint Some people believe that purchasing an essay would be an unethical practice if it causes a long-term problem. For this, you need to consider the effect on the finish grade of a student who uses essay writing services. In case there is no real positive or negative long-term effect, then it should not be called an unethical practice to order an essay. And if you dig deeper into the details, you will realize that a professionally written essay will only help student gain prestige for a short time without creating any long-term effects.  Another way of looking at this issue is that if ordering an essay affects the student's ability to learn, then it is possible to call it an unethical practice. What it means is that if a student thinks they already know the topic but don't have the time to write an essay, they are not hurting their learning ability, and ordering an essay may well be an ethical approach in this case. Some people are of the view that purchasing an essay is a form of cheating and doing this will set a bad example for future life. In reality, this is a very personal approach. Not everyone ordering an essay is going to maintain the same attitude about life. However, if purchasing an essay makes you think that you can buy your way out of problems even in the real life, it should be considered an unethical practice. As such, students must ensure that they're dealing with a legitimate essay writing company that can guarantee complete anonymity and grant them full copyright ownership of the paper they bought. Otherwise, the company can easily reuse or resell the paper to others. If this happens, it's more likely someone in the future will find out you use essay writing services and that your work is plagiarized. Regimented Viewpoint Some people are of the view that everyone should abide by the rules, or else there would be no point in making those rules in the first place. The regimented point of view is of those people's way of thinking who always follow the rules. They also believe that students should write their essays completely on their own because their teachers want to test their understandings of a particular topic through essays or term papers. That's why they think that purchasing an essay is an unethical approach. They also believe that a student is breaking the rules by purchasing an essay, and they should not be rewarded for this – they should not get good grades for such an essay. It means that not only are these students cheating, but they are also breaking the rules; therefore, the whole practice should be discouraged. They propose that students who are caught taking advantage of these essay writing services should be dismissed from school, and, at the same time, should be banned from taking admission in another institution at least for a few years. Winner's Viewpoint Students who are goal oriented and self-centered as well share this viewpoint. Most of these people do well in life because they want to win irrespective of what they have to pay for it. They don't mind twisting or even breaking the rules to their advantage. For them, it is completely fine to use online essay writing companies for ordering essays and term papers. They think that if you can use the money to make things easier, then you should use it any way you can. The fact of the matter is that the school system comes with a great weakness – you're a loser if you don't learn to exploit. Therefore, it is not right to judge the topic on moral grounds. For instance, a prisoner should be punished if he/she breaks the jail, but they should not be blamed if they escaped only because a door was not locked properly. The same is the case with today's education system. So are essay writing services ethical? Answering the question, ‘Are essay writing services ethical?’, I can only say that there’s a nuance to this. It’s mainly the misuse of essay writing services by students that raise potential ethical issues. Academic institutions are concerned with the potential for plagiarism and its consequences, and that such services could promote academic success that’s driven by money instead of merit. But in the professional world, getting the help of professional writers is becoming increasingly common and acceptable. For example, many executives hire ghostwriters to work on their business proposals or leadership papers. For me, it’s not any different from a student hiring an essay writing service.  I Hate Writing Essays Wall? What It's All About? I hate writing essays so much that I've come up with an idea – there's a bunch of posts and blogs where people \"share\" their feelings and perspective regarding their papers, but do we really have a \"safe space\" out there? No, we don't. Actually – we didn't up until now. The Hate Wall is your space of relief. Tell us everything about how your teachers are strict, how your professors leech your free time by handing out papers too often, how the topics are obscure and dull – that's the purpose of the Hate Wall. However, there are some rules. Hate Wall Rules Advertising is STRICTLY prohibitedWe've all seen those types of guys – they come out of nowhere, empathize with you and just before you know it, they're handing out easy ways out. We don't want to see your site, kid, cat, or anything similar here, we're here to fuel the flames of hate towards writing papers and essays.Hatred is not only allowed, it's encouragedThe one thing that grinds my gears is waking up knowing that I have to write papers. I know it's an obligation and all, but something deep down starts boiling, my innards turn and twist, and I daresay that's how hatred spells like.Obscene language is welcomeThere's no shame in saying how you feel, even if it came out wrong judging from the aspect of what's right or wrong to say. However, that doesn't apply here, so say whatever you like.Be polite to your fellow essay hatersEven though we're here to hate on our essay writing obligations, we should still be polite to each other while doing so.Most students today hire essay writers when they have an essay writing assignment. This makes the work easy. Through this, they do not have to take any headache and thus can allot the time in doing other things and managing the daily schedule. Today students can just buy essay online and submit the papers. They can get a complete essay paper sitting in the comfort of their home. But is the whole thing about getting someone to do the essay papers is just a way to get rid of the writing troubles? It is not so. Students require essay writing help because they do not know how to do the papers. And the best thing is that they learn the characteristics or qualities of good writing through those papers. This is because the essay writers have in-depth knowledge on the subject and they also know the artistry of good essay writing. So when the students get the papers, they read and understand how to compose an essay paper. Let us see the qualities of good writing which the students learn from essay writers. Simplicity: Good writing usually aligns with the saying ‘the simple, the better’. A good composition always expresses things most directly and simply. Students learn to express an idea in multiple different ways.Unity: Students learn to state your ideas in a meaningful and logical manner so that the paragraphs are connected to each other. This characteristic is referred to as the unity or flow of the text. The flow of a good piece of writing is like a smooth sail.Focus: Another important quality which the students learn is a focus. A good piece of writing is entirely focused on the central idea/plot of the writing. It makes sure that the readers follow with ease; and does not have to reread a portion or get lost in the details.Grammar: Students learn good grammar skills that help to craft a good piece of writing. As a writer, students are supposed to follow the grammatical rules of Standard English precisely.Word Choice: Students learn to know the way to play with words. English is one such language where multiple words can be used to express the same idea. A wonderful piece of writing will always have the most suitable and accurate words.Style: The writing style is what makes a writing unique and sets it apart from all the other writers. Students learn the needed writing style which is necessary to present the text to the reader.Writing Form: All writing is not the same, and there are different forms of writing to which the students need to adapt. Different forms of writing have varying scope and requirements, and students must always understand them.Reader-Oriented: An important characteristic of good writing is that it is reader oriented. It is important to know the audience, their needs and expectations from a writing. Students learn to understand their audience and present reader-oriented writing.These are few things that students learn when they hire any professional to write their essay papers. They learn and thus gain confidence which helps them to write an essay paper properly later on. How to write a First-class essay and ace your degree In this article, we’ll take a look at how you can write a First-class essay, giving you the best chance of graduating from university with a First overall. A recent report indicates that more people in UK universities are being awarded First-class degrees than ever before. Inevitably, some are suggesting that this means university standards are falling. Many students now pay vast sums of money for the privilege of a university education. As such, universities want them to leave as \"satisfied customers\". Perhaps this is why more Firsts are being awarded. On the other hand, it could simply be that students have become better at researching what makes for First-class work. They're better at examining marking briefs. And at sharing tips – with other students in online forums and elsewhere – about what a First looks like. So what does this mean for you if you're currently an undergraduate student? If you think this recent news means it's more likely you'll get a First, you can keep the champagne on ice for now. A First-class degree takes hard work and dedication, no matter where or what you study. Whatever the reasons for the recent spike in Firsts, you can be sure that as a result, the following will now happen: Universities will examine their standards more closely. They may look at making the criteria for First Class degrees more stringent in response to criticisms that they've 'gone soft'.As up to a quarter of the new graduates hitting the job market do so with a shiny new First-class degree, top employers will routinely come to expect this in applicants for their very best jobs.How can I get a First? So, you want to be among those brandishing a First-class degree certificate when you don cap and gown next summer? Of course you do. Now is the time to think about what kind of student you need to be in order to succeed. Here are a few pointers: You need to try and consistently write First-class http://essays.It doesn't take a genius to work out that the more First-class essays you write at university, the more likely you are to score highly overall. And getting a First in your essay isn't as hard as you think. More on this later.You need to know your stuff.A marker doesn't need to get very far into your work to see if it's been written by somebody who has engaged with the subject matter in depth, and taken the time to understand its nuances. Or if the person who wrote it had only a basic grasp of the main concepts.You need to express yourself well.All the knowledge in the world won't score you a First if you don't also have the rhetorical skills to express that knowledge fluently and succinctly. You need dexterity to marshal your knowledge effectively to solve the problem at hand (whether that's a long-form essay topic or an exam question).Knowing your topic inside-out, but finding yourself unable to convey all that detailed knowledge, is immensely frustrating. If feedback on your previous work suggests your writing may not be up to scratch, be sure to take advantage of the help that's on offer at your university. This can be online tutorials, student mentors, or writing workshops. Nearly all universities offer academic writing support services to students, and these are often run by the library.Alternatively, delve into the Oxbridge Essays blog for posts containing great general advice on good essay writing and essay writing tips.Finally, the Essay Writing Service from Oxbridge Essays is a reliable place to turn to for essay help. Our academics can help tweak your writing, or write a completely original, unplagiarised essay for you to use as inspiration in your own writing.You need to be willing to work hard, and to go above and beyond.Just reading the assigned work and writing solid assignments will, at best, get you a 2:1. In fact, that's what Second-class degree classifications were designed for! If you want to stand out from the crowd, you need to be prepared to go the extra mile. Find ways of understanding your subject matter more thoroughly. Craft an \"angle\" from which you can approach the topic in a memorable, original, and unique way.Most of all – and we really can't stress this enough – you need to be a gambler!You need to be willing to take risks, and be willing to put that safe, 2:1-level assignment you were going to write on the line in pursuit of greater reward. More on what this means below, but essentially you should be willing to take up positions that are controversial, sceptical and critical – and back them up!You should even be willing, once in a while, to fail to reach the lofty aspirations you've set yourself. If you've ever watched a professional poker player you'll know that even the best of them don't win every hand. What's important is that they're ahead when they leave the table!What does a First-class essay look like? A lot of this stuff – risk-taking, depth of knowledge, and developing a unique \"angle\" – can sound pretty abstract. People marking essays may land on opposite sides of the fence where borderline cases are concerned. However, most agree with what a First-class essay looks like and can pinpoint features that set it apart. Markers look for things like: An essay that matches the assignment brief.This may sound obvious, but did you really read the assignment brief? And when did you last read it? A First-class essay needs to show originality and creativity. But it also needs to prove that you can follow instructions.If you've been given guidance on what your essay needs to cover, make sure you follow this to the letter. Also, take note of the number and type of sources it needs to use, or any other instructions. You can only do this if you revisit the brief repeatedly while writing. This will ensure you're still on the path you were originally pointed down and haven't gone off at a tangent.Writing a brilliant, original essay that doesn't meet the assignment brief is likely to be a frustrating waste of effort. True, you may well still get sufficient credit for your originality. But you'll achieve far more marks if you shoot for originality and accuracy.A clear, well-defined, sophisticated argument.A First-class essay sets out its intentions (its own criteria for success) explicitly. By the end of your first couple of paragraphs, your reader should know (a) what you are hoping to accomplish, and (b) how you plan on accomplishing it.Your central argument – or thesis – shapes everything else about your essay. So you need to make sure it's well-thought-out. For a First-class essay, this argument shouldn't just rehash the module material. It shouldn't regurgitate one the positions you've learned about in class. It should build on one or more of these positions by interrogating them, bringing them into conflict or otherwise disrupting them.Solid support for every single argument.You don't just need to make a sophisticated argument; you need to support it as well. Use primary and/or secondary sources to back up everything you say. Be particularly careful to back up anything contentious with rigorous, logically consistent argumentation.Undergraduates also often forget the need to effectively address counter-arguments to their own position. If there are alternative positions to the one you're taking (and there almost always are), don't omit these from your essay. Address them head-on by quoting their authors (if they're established positions). Or, simply hypothesise alternative interpretations to your own. Explain why your position is more persuasive, logical, or better-supported than the alternatives.When done well, drawing attention to counter-arguments doesn't detract from your own argument. It enhances it by providing evidence of your capacity to reason in a careful, meticulous, sceptical and balanced way.A logical structure that's appropriate to the task.Have you ever been asked to write a comparative essay, say on a couple of literary texts? And did you have lots to say about one of the texts but not much at all about the other? How did you approach that challenge? We've all written the \"brain-dump\" essay. You shape your work not around the question you're supposed to be answering, but around topic areas that you can comfortably write a lot about. Your approach to a comparative essay may be to write 2500 words about the text you love, and tack 500 words onto the end about the one you don't care for. If so, your mindset needs a bit of adjusting if you're going to get that First-class degree.A First-class essay always presents its arguments and its supporting evidence in the order and manner that's best suited to its overall goals. Not according to what topic areas its author finds the most interesting or most comfortable to talk about. It can chafe if you feel you have more to offer on a particular topic than the assignment allows you to include. But balance and structural discipline are essential components of any good essay.Evidence of in-depth engagement and intellectual risk.This is where going \"above and beyond\" comes in. Everything from your thesis statement to your bibliography can and will be weighed as evidence of the depth of your engagement with the topic. If you've set yourself the challenge of defending a fringe position on a topic, or have delved deep into the theories underlying the positions of your set texts, you've clearly set yourself up for a potential First in the essay. None of this is enough by itself, though. Don't forget that you need to execute it in a disciplined and organised fashion!Evidence of an emerging understanding of your role in knowledge creation.This one is easy to overlook, but even as a university student you're part of a system that collaboratively creates knowledge. You can contribute meaningfully to this system by provoking your tutors to see problems or areas in their field differently. This may influence the way they teach (or research, or write about) this material in future. Top students demonstrate that they're aware of this role in collaborative knowledge creation. It is clear they take it seriously, in the work they submit.The best way to communicate this is to pay attention to two things. First, the content of the quality sources you read in the course of your studies. Second, the rhetorical style these sources employ. Learn the language, and frame your arguments in the same way scholars do. For example, \"What I want to suggest by juxtaposing these two theories is…\" or, \"The purpose of this intervention is…\" and so on.In short, you need to present an essay that shows the following: Clarity of purpose, integrity of structure, originality of argument, and confidence of delivery.   It will take time to perfect an essay-writing strategy that delivers all this while persuading your reader that your paper is evidence of real intellectual risk. And that it goes above and beyond what's expected of the typical undergraduate at your level. But here are a few tips to help give you the best possible chance: Start early Your module may have a long reading list that will be tricky to keep on top of during the term. If so, make sure you get the list (and, if possible, the syllabus showing what kind of essays the module will require) ahead of time. If your module starts in September, spend some time over summer doing preparatory reading. Also, think about which areas of the module pique your interest. Once the module starts, remember: it's never too early in the term to start thinking about the essays that are due at the end of it. Don't wait until the essay topics circulate a few weeks before term-end. Think now about the topics that especially interest you. Then read around to get a better understanding of their histories and the current debates. Read beyond the syllabus Students who are heading for a good 2:1 degree tend to see the module reading list as the start and end of their workload. They don't necessary see beyond it. A 2:1 student considers it a job well done if they've done \"all the reading\". However, a student capable of a First knows there's no such thing as \"all the reading\". Every scholarly text on your syllabus, whether it's required or suggested reading, is a jumping-off point. It's a place to begin to look for the origins and intellectual histories of the topics you're engaged with. It will often lead you to more challenging material than what's on the syllabus. Search through the bibliographies of the texts on the syllabus to discover the texts they draw from, and then go look them up. At undergraduate level, set texts are often simplified versions of complex scholarly works and notions. They're designed to distil intricate ideas down into more manageable overview material. But wrestling with complex articles is the best way to demonstrate that you're engaging with the topic in depth, with a sophisticated level of understanding. Build your bibliography as you research Keeping notes of all your sources used in research will make writing your bibliography later far less of a chore. Given that every single text on your syllabus likely references thirty more, bibliography mining can quickly become overwhelming. Luckily, we have to hand the integration of web searches and referencing tools. These integrations make the challenge of compiling and sifting through references far easier than it once was. Get into the habit of exporting every reference you search for into the bibliographic software program of your choice. Your institution might have a subscription to a a commercial tool such as RefWorks or Endnote. But the freeware tool Zotero is more than capable of compiling references and allowing you to add notes to revisit later. It's usually a matter of adding a Digital Object Identifier (DOI) for your source into the program. Then it will store all the details you need to generate a bibliography for your essay later (no matter what reference style your university demands). It will also store the URL of the source so you can retrieve it later. Make sure you organise your research into categories. This will ensure you have a focused set of scholarly sources waiting for you when you've decided on your final essay topic. Develop your own essay topic, and talk to your tutor (often!) Are you the kind of student who likes to go it alone, and rarely, if ever, visits your tutor during his or her office hours? If you're serious about getting a First, you need to get over any reservations you have about seeing your tutor often. Make regular appointments to talk through your essay ideas. If the syllabus allows it, come up with your own essay topic rather than going with any in the topic list you're given. Even if you haven't explicitly been told that you can design your own essay topic, ask if it's possible. Nothing is a clearer mark of your originality and active engagement with the module content than defining exactly what it is you want to write about, and how you intend to approach the argument. You have nothing to lose and everything to gain by expressing enthusiasm for the material, and a desire to think independently about it. And one of your tutor's roles is to help you develop your arguments. S/he might suggest texts you haven't come across yet that will help support your points, or make your arguments stronger by challenging them. Don't just synthesise; critique and contest It's common for students to get frustrated when they do all of the above and still come away with a good 2:1, rather than the First they were expecting. For some, this can happen because reading very widely can 'muddy' the waters of their understanding. Reading more about a subject will help you understand its depth and complexity. But it can cause you to begin to lose rather than gain confidence in your own understanding. It can be tempting to let your essays become summaries of what other scholars have said, and let their voices speak over your own. This is especially true when you've read widely and have a sound understanding of the positions of scholars in your field. But it doesn't matter how much reading you've done or how sound your knowledge of existing work in a field. To consistently score First-class marks, you have to develop a position on that field. You must examine where you stand in relation to these scholars and ask yourself some fundamental questions: 1. Do I agree with them?2. If not, why not?3. How can I articulate and defend my position? If you've thought long and hard about these questions in every module you take, your journey to a First-class degree is well underway. There is, admittedly, a degree of risk here. What if you've fundamentally misunderstood some key aspect of a debate? What if your position simply doesn't add up? There will be times when you'll get things wrong, and you'll feel frustrated or even embarrassed. But that's why we said at the outset that you need to be a gambler – this approach will pay off far more often than it will fail. And if you're feeling particularly insecure about a line of reasoning, ask your tutor to read over a draft and give you some pointers on where to go next. Is it worth the risk? In a word, yes. Not every attempt at academic risk-taking will be entirely successful. But following the steps above will ensure that tutors and markers see genuine, in-depth engagement with the topic. Not to mention evidence of serious intellectual growth. Markers will take all this into account, as well as pointing out the places where your argument didn't quite hit the mark. So even if the risk doesn't quite work out, you're unlikely to get a lower mark than playing it safe and submitting a “solid 2:1” piece. And over the span of your degree, this approach will yield a higher mark than consistently writing competent essays on the set texts without significant innovation or risk. Plus, of course, this process has its own rewards beyond your essay mark. Even if you didn't quite hit your target score for this module, your engagement with the topic will have been far richer. You'll emerge far more knowledgeable at the end of it than if you'd played it safe. 30 ways to prepare for university studies However you sugar-coat it, life at university is always going to be challenging. And whilst getting a degree might be the eventual outcome, it might not always be your first priority. There is no harm in enjoying yourself as a student, but we have prepared a list of 30 study tips and hacks to ensure that you get the serious stuff done too! Learning to manage your time Perhaps the biggest challenge of all as a student is getting used to being ‘in charge’ of your own time. Especially if you are in university accommodation, you cannot rely on anyone else to get you out of bed in the morning in time for your 9am lecture, or remind you to do your ‘homework’ the night before. The following tips are aimed at making this transition to self-sufficiency easier: 1. Preparation, preparation, preparation You will most likely be presented with a student planner (or some variation of this) at the beginning of each year. Although the temptation may be to stick it in a drawer and forget about it – use it! Make sure that each of your lectures is written in the ‘timetable’ section, along with room number/ID, time, and date/day of the week. This will help you to plan the week ahead. Not getting lost or turning up late to lectures is an unspoken guideline to success at university. 2. Did we already mention preparation? Spending ten minutes every evening preparing your notes, arranging your work, or reading up on the topic(s) of the next lecture is a virtually painless way of ensuring that you are never the student that gets caught out by a professor suddenly deciding to encourage class participation. Are you taking your laptop? Is it charged? Do you have your notebook and a pen that works? Will you need a calculator or other equipment? Sticking to preparing the night before will prevent the last-minute rush the next morning, and will leave you with far less stress, which in turn will improve your concentration. 3. Check your university email account at least once every day Make a point of checking your emails, preferably in the morning, as any lecture cancellations/room changes are usually sent out to the class prior to the lecture timeslot. You can even link your email account to your phone, using an app such as iCloud Mail or Gmail, that will notify you when you receive a new message. This way, important messages from your department, supervisors, or professors can be dealt with expeditiously. Email is the communication method of choice as a university student, and you will likely hear about news and events through this medium also. 4. Keep track of your deadlines Although it might seem simple, having multiple different modules and courses will leave you with a variety of deadlines to consider. Make sure that you write new deadlines down in your planner, and keep these in mind when planning your week. Can you spend a couple of hours doing some research in preparation for starting to write your next assignment? By always knowing when your deadlines are, you avoid the possibility of being caught out the night before and having to hastily put something together that might not reflect your actual ability and may affect your overall grade. 5. Be early! We know the second word here sends shivers down your spine. We don’t necessarily mean waking up before 7am to work (although studies have shown that getting up early leads to increased productivity). But if you can get started with an assignment as soon as you receive it, you will save yourself a lot of suffering further down the line. Beginning a couple of weeks before the deadline might mean that you only need to write a couple of hundred words each day/night, and this will seem a lot less painful than having to spend every single waking minute working on it the day before. Using your time wisely Not only is managing your time important, but the importance of using the time that you have wisely is vastly underrated. 6. Use lecture time to your advantage Make sure that you take notes, and that these are informative enough for you to look back on and understand at a later date. If the lecturer refers to any specific books/authors, make notes of these – they might be hinting at a potential exam question, or the topic of your next assignment, and will always be worth a quick read! Make a few notes, and that way if you do ever need to come back to it, you have already made a start! 7. Use travel time to your advantage If you regularly take buses and/or trains, think about how you spend your time. Do you usually listen to music or scroll through social media? Long journeys are an ideal time to do some extra reading, or to make a start on an assignment. This is especially true if you regularly travel far to get to and from university each day. Half an hour per day soon adds up to 2.5 hours each week, or 10 hours per month! That’s ten hours extra that you now have for sleeping, socialising, or more studying (we’re not judging). 8. Set yourself realistic targets Any time you have dedicated to study – revision, reading, essay writing etc. – should be planned to include an aim or objective. Make sure that you spend as little time as possible procrastinating by setting yourself attainable targets for your planned study time. Do you want to write 1,000 words? Or read and make notes from 30 pages of a book? Keeping track of what you have achieved and what you need to achieve is a simpler way of measuring your ‘efficiency’, and you will actually feel as though you have accomplished something at the end of your allotted time. For more on working in manageable chunks and goal-setting, read our article on The Pomodoro Technique. 9. Don’t waste time trying to figure something out on your own when you can just ask It might be that you are completely ‘bamboozled’ by the essay question. Or that there is a certain area of a topic that you just cannot get your head around. Rather than spending hours staring at the paper, simply send an email to your lecturer/supervisor. It might be that they are able to answer you in an email reply, or instead they might be able to offer you a meeting with them to explain the parts of the topic that you are struggling with. This is worth its weight in gold, and you should make sure to take these opportunities for 1-1 tuition if/when they are offered! 10. Minimise distractions when setting aside time to study There really is no point trying to revise or write an essay whilst simultaneously holding a conversation, listening to the radio, and watching TV. There are very few people that can work effectively in these conditions! Chances are that you will not absorb any information from the pages that you are reading, or that you will not remember what you have already written about, and this will undermine your efforts. The more you focus when you are studying, the less time it will take to learn.  Take advantage of every opportunity to learn Every university provides extra sessions in the form of study groups, extra classes, revision sessions, or study skills seminars. Whilst these are optional, they can be really useful – especially in the run-up to exams! These are an excellent chance to ask any questions that you might have, or to get further clarification on a tricky topic. You’d be surprised how many different forms of extra help are available to you! 11. Broaden your knowledge with group seminars There are often a number of seminars for each module over the course of the year, and these are intended to give you the opportunity to discuss with your peers some of the main concepts touched upon in your lectures. Sometimes they will be led by a professor, or other member of teaching staff, in which case they are the perfect way to gain a little more insight into the upcoming topics for the semester, or to ask about anything you are unsure of. Make sure that you go and that you actively participate – it will allow you to better engage with the subject.  12. Personal tutor meetings are crucial to maintaining your goals as a student Your personal tutor is there to help you. They will be able to address any of your concerns relating directly to your subject, or other concerns that you may have outside of lectures. Apart from anything else, maintaining a good relationship with them will help you in the future if you should need a recommendation letter for postgraduate study or for a job opportunity. Be on time, be prepared, and take your student planner with you, so that you can easily refer to any deadlines or assignments that are bothering you. 13. Don't forget reading lists It may not be stressed by your lecturer at the time, but your reading lists are an easy way to make sure that you are reading all of the right things! Why spend time looking around for references for an assignment when you have already been given specific sources to work from as a starting point? Most or all of the sources contained here will be available either online or from the library, and even just selecting a couple each month will help you to gain some background knowledge for future reference. 14. Pay attention to your marker's comments and feedback For every piece of work you hand in, you'll get it back marked with a grade and comments from the marker. What better way to identify any areas that you are struggling with? Reading these comments will allow you to see how you could have improved your essay, where you have not engaged with literature critically enough, and where you may have misunderstood or misrepresented a concept. Making these changes in the next essay that you write could be the difference between grade boundaries, and you can bear all of these things in mind during examinations. If there is something you are still unclear on – go back and talk to your lecturer, asking for constructive criticism. 15. Use your university’s online portal and any resources that may be available on it More often than not, lecturers will upload extra files to their ‘site’ on these online portals, and you will be able to view these files as a member of the lecture group. These could be written-up notes of lectures (past or upcoming), extra reading, guidelines, or information on an assignment. They have been uploaded for a reason, and will be helpful to you, even if you simply make a note of them to use as a reference in your next essay.   Take something away from every lecture And we don’t mean stationery. Your lectures should form the ‘bones’ of your degree course, and will cover everything that you need to know in order to succeed. 16. Perhaps an obvious one – attend lectures Nobody can take responsibility for your learning. You will need to motivate yourself to attend each lecture, and to make sure that you are ready to listen, and to learn, when you arrive. Missing one or two lectures might go undetected by professors, but you run the risk of missing out on the topics raised altogether. If you absolutely must miss a lecture, send an email to your professor beforehand, outlining (briefly) your reasons for non-attendance and ask for any lecture ‘slides’ or notes to be forwarded to you. Or alternatively, ask a friend from your course to photocopy their notes. 17. Printing out available lecture slides prior to the lecture will give you some ‘structure’ for your notes Most professors’ put their lecture slides onto the online portal just before the lecture, and it is a really good idea to print these out and take them with you. This way, your notes will be easily traceable back to a ‘topic’ or ‘concept’, and you will be able to assemble them in a way that will better enable you to return to them for revision at a later date. 18. Take notes in a style that suits you There are many ways to write down and record lecture notes. Good note-taking is a skill that can take years to master. Think about what type of person you are. Do you write quickly? Or can you type faster? If taking your laptop with you would make it easier for you to make comprehensive notes then do not be afraid to do so. If you struggle to keep up, write down some key words, phrases, or readings that your lecturer refers to, and ask at the end of the lecture if you need to fill in any blanks. Try to write legibly, and space out your writing, otherwise it will look overly daunting when you come to revision and are faced with page after page of badly-written, cramped-together notes. 19. Write up your notes after each lecture Writing up your notes is a good idea for two reasons. Firstly, when going over everything that you have written again, you will automatically start to recognise concepts that you remember from the lecture. Reading and writing this information again will improve the chances of the information being retained in your long-term memory. Secondly, if your notes are nicely written and presented, they will be more attractive to revise! 20. Swap lecture notes with a friend Your friend may have picked up on some information that you might have missed, and this way you can both ensure that you have a ‘full’ set of notes to revise from. It is also possible that someone else may have interpreted something in a different way, or looked at something from a different angle, and this differing perspective can be useful in writing a critical essay. This is a good way of making sure that you actually write usable notes – someone is relying on you!  Writing an essay 21. The most important part of any essay is the plan Effective planning can be the difference between a well-structured and coherent essay, and a confusing and repetitive piece of writing. It makes the whole process of writing easier! If you have a word count to stick to, include how many of these words you are going to use for each section – introduction, methodology, literature review, conclusion, etc. The essay plan is also a good place to begin to assemble your ‘studies’ or the existing literature that you have come across into categories/arguments, and this will help you to form the main body of the essay. 22. Stick to the deadline, and allow yourself room for movement! Handing an essay in late is never good, it reflects badly on you as a student, and you can be docked marks, or even just awarded a flat 40% for any work that you do hand in. You cannot afford this type of penalty, especially when avoiding it is perfectly plausible. Give yourself 'milestones' that you must hit on a daily/weekly basis and try to stick to these as far as possible. If you do need more time, let your lecturer know as soon as possible, so that you can arrange for an extension. 23. Do as much reading in advance as possible It is useful if you already know what your argument will be prior to starting your plan. By reading around the subject beforehand, you should have a good idea of the key concepts that you should include, the main sources that you will use to support your theory, and those that you will use to show a consideration for both perspectives. For every book/journal/source that you come across, list the main details so that you can easily find it again if necessary, and can include it in your bibliography. 24. Try to engage critically with your sources If you are using studies or experiments in your essay be sure to evaluate the methodology that has been used, the considerations for ethics that are in place, and the value of the findings. For example, a study carried out with twelve randomly selected participants may not be comprehensive enough to relate its findings to entire populations. If you are using someone else’s writing as a reference, take note of the date. Was there anything relevant happening at the time/has anything happened since to influence the validity of these findings? Perhaps there have been developments in the field since the date of publication, in which case, not all of their conclusions may be relevant. This is critically engaging with your source material, and will score you higher marks. 25. Make sure that you answer the question that is in front of you It is easy to get carried away and drift from your main line of argument. Again, this is where a plan is useful in ensuring that you keep to the point. Try deconstructing the question, underlining key words, and highlighting what the question is asking you to do – analyse, evaluate, present, critique. For each new point that you make, you should link this back to the question, and emphasise how including it has helped you to reach your eventual conclusion. 26. Check the other requirements for your work What referencing system do you need to use? How many sources should you include? What is the eventual word count? Most universities also have guidelines for presentation, including the font, font size, line spacing, and heading/subheading style. Referencing guides can be found online or in your university handbook and are fairly easy to follow. If you are still unsure, ask a classmate whether they can help you.  Revision and exams There are people (we all know at least one) who don't seem to get stressed by stuff like exams, and seem to do well regardless of how little work they put into revision and preparation. You might be one such person. But like a lot of other things in life, you do get out what you put in. Not only will you feel more confident if you are prepared for sitting an exam, but your confidence will show in your writing. 27. Find something that works for you, and stick to it Some people retain information better through reading, whilst others might need to do something a little more ‘hands-on’ to make sure the stuff they are revising sticks. Whoever you are, you need to find a way of revising and making revision notes that really works for you. Whether it is making sticky notes of key information, studies, or questions and putting them around your room, or making yourself a number of spider diagrams to provide a more ‘graphic’ representation of the topic at hand, there will be ways that help you study most optimally. 28. Make a revision plan – set out when you will study each section of each module There is no telling what questions will come up during the exam, and you don’t want to open a paper to find that everything you have revised all year is missing. Instead, try to focus equally on each area and if there are one or two that you are struggling with, talk to your lecturer or personal tutor. They might be able to explain to you where you are going wrong, and point you in the direction of a book or journal article that will improve your understanding. 29. Breathe. Be prepared. Get a good night’s sleep Cramming an entire year's worth of revision into the night before an exam is not an effective means of preparation. Studies have shown that the brain requires a good night’s sleep in order to function to its full potential, and it is better that you are able to think on your feet. Get everything ready – pens, pencils, water, calculator, etc. – the night before, so that you can wake up well-rested and arrive at the exam in one piece. 30. In the exam, try not to pay attention to others around you and plan your time The person at the desk next to you has already asked for more paper, whilst the person sitting behind you is sniffling as though their life depends on it. Not idea. But you need to be able to tune all of this out. Make sure that you have read and understand the question, and make a quick plan of your answer. If there are multiple questions, give yourself a deadline for each, to avoid rushing the last one. Although there is usually the chance for students completing their exam early to leave, it is a better idea to thoroughly check through your work. That extra ten minutes could earn you an extra couple of marks and take you up to the next grade boundary! ",
            "date": "Answered November 27, 2019",
            "views": "188",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Latasha Taylor",
                    "user_href": "/profile/Latasha-Taylor-46"
                },
                {
                    "user_id": "Peter Boskers",
                    "user_href": "/profile/Peter-Boskers"
                },
                {
                    "user_id": "Edward Piller",
                    "user_href": "/profile/Edward-Piller"
                }
            ]
        },
        {
            "author_info": {
                "name": "Loretta B DeLoggio",
                "href": "/profile/Loretta-B-DeLoggio"
            },
            "answer_text": "I agree with Mr. Muth that we lack too much information, including whether you're allowed to have help. When the instructions say you will be judged on grammar and format, I generally won't fix those for you. I am hesitant to answer, because when I gave someone else what I thought was an honest answer, I was reported for not being \"nice.\" I don't know how to point out errors nicely, apparently. But I can say this (I hope): the instructions you give us say \"your essay will be reviewed based upon originality, sincerity...\" \"Education is the key to my future\" is not original. You use many commonly repeated phrases, like \"a college education is the ultimate form of investing in yourself ,\" and \"be all and end all\". The last instruction says \"Give specific support for your ideas; avoid general statements.\" Yet almost every sentence (except the one sentence about Crohn's disease) is very general, without supporting details. ",
            "date": "Updated April 17, 2020",
            "views": "754",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Parke Muth",
                    "user_href": "/profile/Parke-Muth"
                },
                {
                    "user_id": "Jimmie Kim",
                    "user_href": "/profile/Jimmie-Kim-2"
                }
            ]
        },
        {
            "author_info": {
                "name": "Carol Baldridge",
                "href": "/profile/Carol-Baldridge"
            },
            "answer_text": "If I were you, I'd dive right into the Crohn's and tell how about the positive attitudes and behaviors gained because of it, including those toward others with visible and invisible disabilities. Don't fall back on boring words and phrases that have been used countless times. Be conversational, even chatty. There are several excellent books that give helps for writing awesome essays. And remember, paragraphs are your friends. ",
            "date": "Answered July 5, 2015",
            "views": "693",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Parke Muth",
                    "user_href": "/profile/Parke-Muth"
                },
                {
                    "user_id": "Elizabeth Penrose",
                    "user_href": "/profile/Elizabeth-Penrose-1"
                },
                {
                    "user_id": "Loretta B DeLoggio",
                    "user_href": "/profile/Loretta-B-DeLoggio"
                }
            ]
        },
        {
            "author_info": {
                "name": "Nataly Havrysh",
                "href": "/profile/Nataly-Havrysh"
            },
            "answer_text": "I would love to help. You can view my writing style reading writing tips and reviews of the credible sources I write for my website, Make a Stand - Education Blog. I have started marketing my services just recently, so my prices are really affordable) please, check the editing offer. ",
            "date": "Answered September 24, 2017",
            "views": "337",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Chloee Schwarzkopf",
                "href": "/profile/Chloee-Schwarzkopf"
            },
            "answer_text": "Hhhmmm. I agree with Mrs. DeLoggio, put extra care in avoiding sentences and expressions that could be seen elsewhere. It's my understanding that these people will want to know what motivates you to take on this next phase of your life. We all have to work for making a living, but why did you decided upon this course? What's your deepest personal motivation? What did you realized was truly important at a young age and how do you plan to flesh out this realization into action into your life? And I would make sure to explain how you think college could help you do that. Hope this helps. ",
            "date": "Answered July 5, 2015",
            "views": "401",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Edgar Phog",
                "href": "/profile/Edgar-Phog"
            },
            "answer_text": "The biggest challenge that the students used to face at the period of their academic years in assignment writing that includes research papers writing,essays writing, thesis paper writing, dissertation writing, case study, book review and so on. As far as the students are concerned, they are not familiar with writing all these assignments with ease. They have difficulties to write essay papers and other sorts of assignments due to the lack of knowledge and skill in writing. Hence, what the students are required is getting professional assignment writing help. Currently, there are many professionals available online who can assist you to write your assignments. ",
            "date": "Answered May 26, 2016",
            "views": "215",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Milo Grika",
                "href": "/profile/Milo-Grika"
            },
            "answer_text": "You have a compelling story and you seem to have blocked it in just the way you describe. The only thing you *should* do is break it into paragraphs of two or three sentences. I wouldn't think it needs to be professional, just heartfelt. ",
            "date": "Answered July 5, 2015",
            "views": "375",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Sheila Carson",
                "href": "/profile/Sheila-Carson-2"
            },
            "answer_text": "While your heart is in the right the right place and you have big goals, they sound rather generic. You might benefit by thinking of one example of how you want to use your education to change the world or one unique lesson you learned. Make your essay very specific to you. Yes, you have Crohn’s and you are learning from it but what else is different about you? ",
            "date": "Answered May 18, 2016",
            "views": "397",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Shakira",
                "href": "/profile/Shakira-13"
            },
            "answer_text": "Colleges want to hear your voice. In writing your essay, don't focus on what makes you different from everyone else but rather what makes you. You can see Trustessays.com. A successful college essay shows the reader what makes you tick, what excites you, what motivates you. It shows the college what you will actually be like when you get onto their campus. ",
            "date": "Answered July 9, 2016",
            "views": "439",
            "upvotes": "0"
        }
    ]
}