{
    "title": "Can a person who has no experience writing content marketing blogs start a successful freelance writing business? - Quora",
    "tags": [
        "Blog Writing",
        "Content Writing",
        "Freelancing",
        "Blogging"
    ],
    "response": [
        {
            "author_info": {
                "name": "William Frazier",
                "href": "/profile/William-Frazier-26"
            },
            "answer_text": "Three years ago, I decided to start writing every day and it was the best decision I’ve ever made. My background was in freelance design and I wanted to write a book that discusses the intersection of design, entrepreneurship, and education. After receiving advice from a friend who had been writing for a while, I decided to instead start a blog. What started as one post turned into a posting schedule of 2–3 times each week. Over the years, this turned into a solid body of writing that I could leverage for other opportunities (guest contributing, speaking opportunities, even paid gigs). At this point, I am focused on turning this blog into a platform for my first book about making your own ideas happen. My advice is to remember the following quote from Ernest Hemingway: “The first draft of anything is shit.” Once you’re ready to get started, publish your first post using this framework for getting started. After writing and publishing on Medium for three years now, I really do believe it is the easiest, most accessible site for drafting, editing, publishing, and sharing your writing online. In terms of your blogging topics, I feel like the best subjects for satisfy all three of the following categories: Something you are passionate aboutSomething that you have unique perspective onSomething that is useful for othersPersonally, I created The Imperfectionist (my blog) around sharing how to make your own ideas happen because: I am extremely passionate about helping others create their own paths and pursue their own ideasI’ve been freelancing/pursuing my own ideas for my entire professional career (almost a decade)Throughout this time, I’ve met countless individuals who are struggling with common issues (how to position their idea, how to remove yourself as a roadblock, etc.) and they fall into three categories: 1) students, 2) independent creatives, and 3) people who work in corporate settingsAdmittedly, this may take more introspection on your part to find out what satisfies these three areas. Once you do, it will motivate you to blog consistently, which is, by far, the most important thing for growing an audience. Here is the process I’ve used in order to grow an audience through my blog: Write every day for at least 30 minutes and publish 2–3 times a week on The Imperfectionist.Set up a newsletter using MailChimp and Upscribe, a service that allows you to crate embeddable email capture forms. Include a form at the end of each article.I use my weekly newsletter to provide value through tidbits of advice for making ideas happen while also sharing early content from my book (outlines, sections, etc.)Continue building this community for the release of future products and services (an engaged audience is always better when it comes to offering products).Don’t forget: creating and sustaining a high-quality blog is a long-term commitment. Hopefully this helps! Let me know if you have any other questions about blogging in general. Cheers and good luck! ",
            "date": "Answered March 28, 2018",
            "views": "861",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Manish",
                    "user_href": "/profile/Manish-877"
                },
                {
                    "user_id": "Kali Sanders",
                    "user_href": "/profile/Kali-Sanders"
                }
            ]
        },
        {
            "author_info": {
                "name": "Azra Syed",
                "href": "/profile/Azra-Syed-7"
            },
            "answer_text": "Yes anyone can do it if one has passion, eye for details, and creativity. For writing its important to read, read more and more. See how other writers have compiled their pieces. If you want to write on a particular topic, research well, discuss with others, read everything related to your topic and ask questions to experts, nowadays it is much easier to ask, just one email resolves most of the work. Check what unique aspect you can discuss in your writing that others are missing? Write a copy and ask a sincere friend or colleague for feedback, see what they think about your piece. Read it at different times. Edit, edit and edit. Writing needs practice, make it a habit. Always carry a notebook, jot down ideas. work on it in sections, opening, progress and conclusion. Start a blog to create a portfolio so people can actually see your writing style. Organise your thoughts and your work. Give yourself a deadline for each and every piece. ",
            "date": "Answered May 28, 2019",
            "views": "132",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "David Alexander",
                    "user_href": "/profile/David-Alexander-14"
                }
            ]
        },
        {
            "author_info": {
                "name": "Jeremy Hall",
                "href": "/profile/Jeremy-Hall-20"
            },
            "answer_text": "Straight up… absolutely. I had sold a couple of short stories in high school but hadn’t written much more than a few pretentious avant-garde flash fiction pieces in seven years when I started. Content writing isn’t hard. What is hard is managing the business and then being able to pick up the skills to make you invaluable to clients. You’ll run into a bunch of generic advice, but in the end, as long as you can string some sentences together and listen to the client an entry-level gig is easy to score. Getting clients is harder when you’re unknown but it’s not impossible. I’d suggest familiarizing yourself with the basics of web formatting and on-page SEO practices. From there you’ll be able to figure it out and that’s really all that’s needed for those who are just beginning. ",
            "date": "Answered May 1, 2019",
            "views": "148",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Kevin Cook",
                "href": "/profile/Kevin-Cook-66"
            },
            "answer_text": " Absolutely. And doing so would be proof they’re actually good at the job, too. (comic is from xkcd, Marketing Interview) ",
            "date": "Updated August 29, 2018",
            "views": "108",
            "upvotes": "0"
        }
    ]
}