{
    "title": "Can you create fictional characters, stories, titles, settings and locations on your own if anybody refuses to help you? - Quora",
    "tags": [
        "Character Names",
        "Character Design",
        "Fiction Writing",
        "Storytelling",
        "Fiction",
        "Creative Writing"
    ],
    "response": [
        {
            "author_info": {
                "name": "Mary Gentle",
                "href": "/profile/Mary-Gentle"
            },
            "answer_text": "Why are you asking someone else to help you, when you’re a god? You say how it all goes. You are all-powerful! Seriously, this is one of the great things about writing. If you’re using a real world setting, you need to study the place and time, but all the characters and titles and words and plot are your very own. You poke and prod and make up and dismiss, until you have something you love. All power is yours; you are a god. At least as far as your poor characters are concerned. :-) And if you happen to be writing SF and Fantasy, whole universes are yours. When it comes to the world, you can start with geology and create it from the tectonic plates up. That is godlike. And while it’s fun to do with an enthusiastic collaborator, you don’t have to have one. Who “refuses” to help you? Do you need them? I’m kind of wondering why you want to write, you know? The moment when a phrase occurs and you think, “chapter title!”, or “damn, that’s what this book is called!” Those are great moments. Becoming involved as you weave your setting together to make a convincing world… Planning your characters (if you’re a structured writer who functions by planning). Or listening to your characters (if you’re an intuitive writer, who likes to seize the end of a piece of string and find out where it goes). These are wonderful fun, as well as being immensely satisfying when you have a good story that says something. Is it a lack of confidence — you think every writer secretly has a staff of minions who bring them stories and settings and characters, for the Master to weave together? I wish. :-) I describe writing a novel as the process of walking out over an abyss on a bridge, while building the bridge in front of you. It can be nerve wracking to think it’s all your responsibility. And yes, sometimes it’s good to have a co-writer. Being a novelist doesn’t come with an office-full of people for a social life; you have to make your own — and sometimes, sharing a piece of work with someone who doesn’t look at you like you’re crazy for what you do for a living is good. Can you do it all on your own? Undoubtedly. Do you want to do it on your own? That’s for you to decide. But, one person or many can refuse their help, and the writer can just say the local equivalent of “fuck you and the horse you rode in on”. There are books and the internet for things you don’t know about your settings and maybe characters; likewise, books and the internet for almost every aspect of how to write fiction. All you have to ask yourself is, do you have the desire to become a god? Because if you want it badly enough, you will find what you need, no matter who won’t or can’t help you.  Q: Can you create fictional characters, stories, titles, settings and locations on your own if anybody refuses to help you? ",
            "date": "Answered June 21, 2020",
            "views": "125",
            "upvotes": " View 3 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Don Eamon",
                    "user_href": "/profile/Don-Eamon"
                },
                {
                    "user_id": "Jean Lamb",
                    "user_href": "/profile/Jean-Lamb"
                },
                {
                    "user_id": "Jane Williams",
                    "user_href": "/profile/Jane-Williams-3"
                }
            ]
        },
        {
            "author_info": {
                "name": "Michelle Waring-May",
                "href": "/profile/Michelle-Waring-May"
            },
            "answer_text": "Absolutely. That’s all part of the fun. Delving into your own imagination and pulling out original, complex characters and settings etc. My only piece of advice is take your time. Don’t be in a rush to have everything perfectly in place before beginning. (I have been working on a story/novel that’s being playing around in my head for the last couple of years) That’s one of the best things about creative writing, nothing is set in concrete. As an author you are free to chop and change any or all aspects of your story at any given time. Try and enjoy the process even if it drives you crazy at times and you’re feeling a little insecure about what you’re producing. You can do it if you persist and are in it for the long haul. ",
            "date": "Answered June 20, 2020",
            "views": "145",
            "upvotes": " View 2 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Al Bourguet",
                    "user_href": "/profile/Al-Bourguet-1"
                },
                {
                    "user_id": "Andrew Lien",
                    "user_href": "/profile/Andrew-Lien-4"
                }
            ]
        },
        {
            "author_info": {
                "name": "Dani Alexis",
                "href": "/profile/Dani-Alexis-2"
            },
            "answer_text": "Of course. I do it all the time. I even make up new languages for fun. If you make up a name for a character or place and decide to use it in a story, however, I highly recommend Googling it just to make sure it’s not already a name or a word somewhere in the world. There’s nothing quite so embarrassing as naming a character only to find that their name means “poop” in one country and “I did a very rude thing to your goat” in another. ",
            "date": "Answered June 20, 2020",
            "views": "75",
            "upvotes": " View 5 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Shana Chen",
                    "user_href": "/profile/Shana-Chen-3"
                },
                {
                    "user_id": "Zudriaya Loxou",
                    "user_href": "/profile/Zudriaya-Loxou"
                },
                {
                    "user_id": "Michelle Waring-May",
                    "user_href": "/profile/Michelle-Waring-May"
                },
                {
                    "user_id": "Darrell Blank",
                    "user_href": "/profile/Darrell-Blank"
                },
                {
                    "user_id": "Andrew Lien",
                    "user_href": "/profile/Andrew-Lien-4"
                }
            ]
        },
        {
            "author_info": {
                "name": "C.S. Friedman",
                "href": "/profile/C-S-Friedman"
            },
            "answer_text": "Every professional author does. ",
            "date": "Answered June 20, 2020",
            "views": "160",
            "upvotes": " View 12 Upvoters ",
            "upvoters": [
                {
                    "user_id": "James C. Maxwell",
                    "user_href": "/profile/James-C-Maxwell"
                },
                {
                    "user_id": "Thomas Colligan",
                    "user_href": "/profile/Thomas-Colligan-2"
                },
                {
                    "user_id": "Charlie Rand",
                    "user_href": "/profile/Charlie-Rand-2"
                },
                {
                    "user_id": "Christopher Williams",
                    "user_href": "/profile/Christopher-Williams-1363"
                },
                {
                    "user_id": "Milly Stuchinski",
                    "user_href": "/profile/Milly-Stuchinski"
                },
                {
                    "user_id": "Dana Beehr",
                    "user_href": "/profile/Dana-Beehr"
                },
                {
                    "user_id": "Matthew Gordon",
                    "user_href": "/profile/Matthew-Gordon-7"
                },
                {
                    "user_id": "Teleri Ferch Nyfain",
                    "user_href": "/profile/Teleri-Ferch-Nyfain"
                },
                {
                    "user_id": "Darrell Blank",
                    "user_href": "/profile/Darrell-Blank"
                },
                {
                    "user_id": "Logan R. Kearsley",
                    "user_href": "/profile/Logan-R-Kearsley"
                },
                {
                    "user_id": "Gerry Surette",
                    "user_href": "/profile/Gerry-Surette-1"
                },
                {
                    "user_id": "Andrew Lien",
                    "user_href": "/profile/Andrew-Lien-4"
                }
            ]
        },
        {
            "author_info": {
                "name": "Terri Heard",
                "href": "/profile/Terri-Heard-2"
            },
            "answer_text": "Yes of course. What are you afraid of? THIS is what makes fiction writing such a rush. You can create an entire world that runs the way YOU want it to. No one can tell you no. You are your own authority (hence the word “author”). So get cracking! ",
            "date": "Answered June 21, 2020",
            "views": "113",
            "upvotes": " View 5 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Ayush Sharma",
                    "user_href": "/profile/Ayush-Sharma-1108"
                },
                {
                    "user_id": "Valeria Mesalina",
                    "user_href": "/profile/Valeria-Mesalina"
                },
                {
                    "user_id": "Jean Lamb",
                    "user_href": "/profile/Jean-Lamb"
                },
                {
                    "user_id": "Celia May Malm",
                    "user_href": "/profile/Celia-May-Malm"
                },
                {
                    "user_id": "Andrew Lien",
                    "user_href": "/profile/Andrew-Lien-4"
                }
            ]
        },
        {
            "author_info": {
                "name": "Lisa Barker",
                "href": "/profile/Lisa-Barker-83"
            },
            "answer_text": "What do you mean? A writer does all that on their own unless they are co-writing with another writer or researching in order to create. If you like, answer with more details or message me directly and I’ll answer with what I know. ",
            "date": "Answered June 20, 2020",
            "views": "10",
            "upvotes": " Answer requested by Andrew Lien",
            "upvoters": [
                {
                    "user_id": "Sarah Knitter",
                    "user_href": "/profile/Sarah-Knitter"
                },
                {
                    "user_id": "Andrew Lien",
                    "user_href": "/profile/Andrew-Lien-4"
                }
            ]
        },
        {
            "author_info": {
                "name": "Paul Larkin",
                "href": "/profile/Paul-Larkin-9"
            },
            "answer_text": "Can you create the elements of a story without help? = Yes, but there are simpler ways. There are lots of examples of ‘character’, ‘settings’ etc in the internet. You can also buy books on each subject. All the elements are already out there. You do not need to invent them yourself. Every success. ",
            "date": "Answered June 20, 2020",
            "views": "18",
            "upvotes": " Answer requested by Andrew Lien",
            "upvoters": [
                {
                    "user_id": "Darrell Blank",
                    "user_href": "/profile/Darrell-Blank"
                }
            ]
        },
        {
            "author_info": {
                "name": "David Thomas",
                "href": "/profile/David-Thomas-805"
            },
            "answer_text": "Yes, I am able to do that. As for someone refusing to help me, i belong to a playwrights group. We meet once a month except during COVID pandemics. We take turns presenting a writing exercise and critique one another’s plays. ",
            "date": "Answered June 20, 2020",
            "views": "30",
            "upvotes": " View 2 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Andrew Lien",
                    "user_href": "/profile/Andrew-Lien-4"
                }
            ]
        },
        {
            "author_info": {
                "name": "Elizabeth Emond",
                "href": "/profile/Elizabeth-Emond-5"
            },
            "answer_text": "I'd probably refuse to help you, because Of course you can create your own fictional universe!!! Let your imagination roam without bounds. 🙂 ",
            "date": "Answered June 20, 2020",
            "views": "20",
            "upvotes": " View 1 Upvoter "
        },
        {
            "author_info": {
                "name": "Sallie Loftin",
                "href": "/profile/Sallie-Loftin-1"
            },
            "answer_text": "That’s pretty much how most authors do it, unless they have a writing partner, in which case the collaboration credits both of them. ",
            "date": "Answered June 20, 2020",
            "views": "18",
            "upvotes": " View 1 Upvoter "
        }
    ]
}