{
    "title": "Did you ever write a letter to someone who doesn't love you back and how did that person react to your letter? - Quora",
    "tags": [
        "Romance (love)",
        "Writing Advice",
        "Love",
        "Dating and Relationships"
    ],
    "response": [
        {
            "author_info": {
                "name": "Sue Croke",
                "href": "/profile/Sue-Croke"
            },
            "answer_text": "10 days after our first date, I started writing a letter on my PC to the only guy I ever loved. I knew the thing we had was to end at some point cause even though I loved him, he didn’t love me back. And that wasn’t my guess, he told me that he was in love with his desk mate of 3 years, for 3 years. But we were still dating. It took me two days to complete this 4 page letter on Word. And just as I expected, he ended things 3 months after I wrote and forgot about the thing. We didn’t let some things out, brushed them away, acted like they didn’t exist… But if things were to end for good, I wanted a last chance and to have a proper closure. I asked if we could meet up for one last time. He accepted the offer, but was about to take his university entrance exams. It was an important period of his life. So, it took him literally a whole month to meet up with me. And in that time period, I constantly thought “how can I use this opportunity in the best way possible?”. And one night, as I came across these random files on my PC, I saw that letter I wrote to him 3 months ago, only 10 days after our first date, and on the days he was trying so hard to love me back instead of the platonic love he had for that other girl. It was perfect in every way possible. I wouldn’t be able to say or write anything else that would put my thoughts into words better than that thing that was written when times were much better but the fear was always there, waking every single day, asking myself “is this the day he is going to leave me behind?”. I didn’t want it to be a print out, so I wrote the whole thing in hand and it took 10 pages with my writing. Thinking it wouldn’t look composed without something that would hold them in place, I put the pages together in order, pierced the top left corner, and tied them into place with a little black ribbon and made that into a bow. I’m actually not a crafty person but this was a whole other thing for a day I will never forget. We met up and sat on a bench on the sea side. I handed him the letter and he read it all when he sat by my side. We talked on things and both let everything out. And in the end, as he was staying in a dorm with his friends from high school, he gave the letter back to me cause he didn’t want anyone else to read it other than him. I still keep the letter to this date of 21st of October, 2017.   Folded into four. The pages are not as white as they used to be, them being more than 7 years old, the date being the 17th of May, 2010. He was 19, and I was 18 at the time. Although we were both born in 1991, less than 10 months apart. I never loved anyone as much as I loved him, since then. I don’t think I ever will. ",
            "date": "Answered October 21, 2017",
            "views": "32",
            "upvotes": " View 6 Upvoters",
            "upvoters": [
                {
                    "user_id": "Kamakshi Dey",
                    "user_href": "/profile/Kamakshi-Dey"
                },
                {
                    "user_id": "Sayan Ganchaudhuri",
                    "user_href": "/profile/Sayan-Ganchaudhuri"
                },
                {
                    "user_id": "Aftab Daji",
                    "user_href": "/profile/Aftab-Daji"
                },
                {
                    "user_id": "Ersin Gelgi",
                    "user_href": "/profile/Ersin-Gelgi"
                },
                {
                    "user_id": "Varun Blake",
                    "user_href": "/profile/Varun-Blake-2"
                },
                {
                    "user_id": "Megha Pratap Reddy Basa",
                    "user_href": "/profile/Megha-Pratap-Reddy-Basa"
                }
            ]
        },
        {
            "author_info": {
                "name": "Megha Pratap Reddy Basa",
                "href": "/profile/Megha-Pratap-Reddy-Basa"
            },
            "answer_text": "\" SOME INFINITIES ARE BIGGER THAN OTHER INFINITIES \" ….!!!! Yes Ofcourse…. I have written one such letter to a girl whom I loved though I know that she doesn't feel the same with me. And this wasn't the only letter I have written to her. And how did she react ….. Well…. She felt and said that I make a lot of Immature talk in my letters that I have written for her . And now I shall share that immature talk. ( My letter for her ) with you people.  “ Hi.....!! How are you....??? And what more I would say....?? Usually I would have added compliments....But you know what flattery corrupts the mind of both the receiver and giver.......!! And I was just remembering the time, when and how I came too hear the words....... ​​\" WE DON'T SEE THINGS AS THEY ARE.....WE SEE THINGS AS WE ARE \". Perhaps it is true.....so messed up is our choice of thoughts that we see only what we want to see....we only hear what we want to hear.....it's all in what we believe. We see,We believe,We expect,We set standards,We make choices and We experience. So,we indeed believe that belief is something powerful and belief is something what we see,we hear and so. But there is this thing much more incredibly powerful in this world.....this is something that sometimes the heart sees what's invisible to the eye.....and you know what I am talking about.....Don't you??? It is here and it is there....it is everywhere, it is so spread across the world, it's in me...it's in you....and oh...fantastic....it's in your name too. Every time i mention this word I tremble with anxiety and excitement ......there is no guilt and fear. Doesn't it seem like I am the one having too much of opinions....??? Well, what can I do....??? I never get to hear from you as much in return. Though this day I dared to write to you again....this is something I always wanted to do.......It might be right or wrong.....but u know what .....Things out of my league never scare me away......!!! I always wished to mention how little things in life.....like a little love....a little kindness..... an act of appreciation and reciprocation with something like a simple THANK YOU would bring a big difference in one's day and their life. I want to mention your birthday.......you know well how easy it would be to accept a gift....and on the other hand it throws a challenge to decide what to gift one and it is not just that a simple task. Sometimes, people think very deep to come to a decision. Something....Some words as little as \" It's Great\", that I have heard from you when I asked you how the movie \" THE FAULT IN OUR STARS\" was… were also included in my thoughts. I have heard somewhere that says that a movie is something comparable to the tip of an iceberg.....and a book itself envelops the entire iceberg. \" SOME INFINITIES ARE BIGGER THAN OTHER INFINITIES\"....Right..!! Mr.John Green got the quote very right....and i got this book for you as one of your birthday presents. I felt awkward mentioning this, but i just want to say how someone would gather ideas to present something. Okay....!! just forget it....it's all in the past and ' Dead past bury its Dead '. I have heard something like.... \" Being deeply loved by someone gives you strength...while loving someone deeply gives you courage....\" . i never understood why it is said so...for i always believed that being the right person first would in turn get you the right person. I don't assert whether , I'm being too courageous or being a coward....but i have come too far.....I roll the dice and take my chances. My love….I think your world must be very beautiful ..... the world in which the aura of your presence is felt everywhere.....the world that serve as a catalyst for a more positive change in me..... the world I could see without a filter. ‌I wish to live in the same world as you.....!!! My compliments never stop for you ...... coz you are such a sweet and beautiful girl I have ever seen....... a beautiful 50 kg Taj Mahal you are......!!! You always accept compliments......then you say thanks....and strangely you go silent for a long time....May be its like … you are thinking that silence is the best reply to a fool...!!! Well.... and this is it...!!! Bring Happiness In Everyway And Everyday......!! With love, Yours Truly. Ira Singh's answer to Can you love someone who doesn't love you back? If you love someone, but they don't love you back, is that still love or just an obsession?  ",
            "date": "Answered October 21, 2017",
            "views": "3",
            "upvotes": " View 17 Upvoters",
            "upvoters": [
                {
                    "user_id": "Sharon Rose",
                    "user_href": "/profile/Sharon-Rose-124"
                },
                {
                    "user_id": "Ranjani",
                    "user_href": "/profile/Ranjani-40"
                },
                {
                    "user_id": "Anshika Singh",
                    "user_href": "/profile/Anshika-Singh-206"
                },
                {
                    "user_id": "Dakshina Sarma",
                    "user_href": "/profile/Dakshina-Sarma-1"
                },
                {
                    "user_id": "Shreya Khushi",
                    "user_href": "/profile/Shreya-Khushi-श्रेया-खुशी"
                },
                {
                    "user_id": "Sreelakshmy Kunnambath",
                    "user_href": "/profile/Sreelakshmy-Kunnambath"
                },
                {
                    "user_id": "Priya",
                    "user_href": "/profile/Priya-1366"
                },
                {
                    "user_id": "Ahmed Roshan",
                    "user_href": "/profile/Ahmed-Roshan"
                },
                {
                    "user_id": "Pavan Raina",
                    "user_href": "/profile/Pavan-Raina-2"
                },
                {
                    "user_id": "Shambhavi Yadav",
                    "user_href": "/profile/Shambhavi-Yadav-6"
                },
                {
                    "user_id": "Bora Jagannadha Swamy",
                    "user_href": "/profile/Bora-Jagannadha-Swamy"
                },
                {
                    "user_id": "Sahadat Ali",
                    "user_href": "/profile/Sahadat-Ali-5"
                },
                {
                    "user_id": "Navdha Gupta",
                    "user_href": "/profile/Navdha-Gupta-2"
                },
                {
                    "user_id": "Naveen Rawat",
                    "user_href": "/profile/Naveen-Rawat-44"
                },
                {
                    "user_id": "Raunak Singh",
                    "user_href": "/profile/Raunak-Singh-129"
                },
                {
                    "user_id": "Sunil Sharma",
                    "user_href": "/profile/Sunil-Sharma-207"
                },
                {
                    "user_id": "Sudheer Kumar",
                    "user_href": "/profile/Sudheer-Kumar-142"
                }
            ]
        },
        {
            "author_info": {
                "name": "Ayina Bilqis",
                "href": "/profile/Ayina-Bilqis"
            },
            "answer_text": "To be honest, I'm in love with my best friend. Me being a Cap/Libra him Aqua/Capricorn. We worked together for 7 months and became friends, he asked me if I liked him, at first I said no, but then later on I told him I did like him. I wrote him a letter telling him that he makes me happy etc, etc, etc, and at the end of the letter I expressed that I’m in love with him. Sad thing is that he quit our job and I'm currently still working there, I was supposed to give him the letter on his last day of work, but the managers took him off the schedule so we never spent his last day togrther. I never gave him my love letter. ",
            "date": "Answered October 21, 2017",
            "views": "617",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Megha Pratap Reddy Basa",
                    "user_href": "/profile/Megha-Pratap-Reddy-Basa"
                }
            ]
        }
    ]
}