{
    "title": "Do all Vietnamese speak French? - Quora",
    "tags": [
        "Vietnamese Ethnicity and People"
    ],
    "response": [
        {
            "author_info": {
                "name": "Ho Wang",
                "href": "/profile/Ho-Wang-7"
            },
            "answer_text": "A bit of story about my family line, and how they went through the foreign language thing. FATHER’S LINE All were northern VNmese until my father. French was taught in their time. They spoke fluent Cantonese, but one of my great grandpa was an official under the French Colonist, so he took French as well. Until my grandpa the VN war broke out, he joined as a sapper for the North. He and my grandma did not learn French, because there was no time for that. Their sisters and brothers still know Cantonese. After the reunification, French was the mandatory foreign language at school, just because there were no textbook and documents for any other foreign language. My dad and his brother learned French. MOTHER’S LINE They were Malaysian origin, as Vietnamese was already their foreign language, they had no need for the 3rd one. By the time of my grandparents, they took English as their brothers, sisters and other Saigonese did, especialy my grandpa, since he was in the navy. After the unification, my mom learned French through school, for the same reason as my dad. Note that both my parents WERE good at French… MY TIME The government sit together and think “Okay, the whole English thing went international. And as we just dropped the whole Commies economy thing, we need to go international as well, or get left behind”. So they did the rational thing - ditched French and put English as mandatory. And therefore, students from the 90s on study English, including me. French become optional, along with Russian, Chinese, Japanese and Korean. Older people with French skill would see their French skill become rotten to the point they could no longer hold conversation, because the use of French would be rare. I learned English as many others do. When we get good at it, some might choose another one. I picked Japanese. Most of my friends choose Japanese or Cantonese, some odd ones choose Russian, German. I knew only one of them who see French useful, and she is studying abroad in Israel (why???). In simple term: When Vietnam went through major language reform in the start of 1900s, Vietnamese who can speak French were rare. French language would become popular to it’s peak at 1980s, then got replaced by English. Today, only people with personal preferrence would pick French. And there are not many. ",
            "date": "Answered February 23, 2019",
            "views": "917",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Thanh Tuong",
                    "user_href": "/profile/Thanh-Tuong-3"
                },
                {
                    "user_id": "Estevan Cuadrada",
                    "user_href": "/profile/Estevan-Cuadrada"
                },
                {
                    "user_id": "Ahmad Kamal",
                    "user_href": "/profile/Ahmad-Kamal-48"
                },
                {
                    "user_id": "Zanara McKee",
                    "user_href": "/profile/Zanara-McKee"
                }
            ]
        },
        {
            "author_info": {
                "name": "Minh Tran Do",
                "href": "/profile/Minh-Tran-Do"
            },
            "answer_text": "As a person who was born and is living in Vietnam, my answer is, of course not. They mostly speak their monher tongue, Vienamese. In comparison with English, French is not in the same level of popularity and preference. However, there are many secondary and high schools that have special classes for billingual children speaking both Vietnamese and French. Also, there is, at least, one university that collaborates with French universities. Its name is USTH, it has many students enrolling every year, and it requires every student to learn French in two or three (I don’t remember exactly) terms, whether they’ll study in France or not. In languages universities, there are also French departments, but the number of contestants applying for French language major is quite fewer than that for Korean, Chinese, Japanese, or English. So I’d say Vietnamese people don’t speak French, but a lot of people in Viet Nam do know French! ",
            "date": "Answered February 23, 2019",
            "views": "330",
            "upvotes": "0"
        }
    ]
}