{
    "title": "Do all (or at least most) Russians write in cursive? If I learn Russian should I learn cursive writing too? - Quora",
    "tags": [
        "Cursive",
        "Handwriting",
        "Russian (language)"
    ],
    "response": [
        {
            "author_info": {
                "name": "Andrii Melnykov",
                "href": "/profile/Andrii-Melnykov"
            },
            "answer_text": "Do all (or at least most) Russians write in cursive? It’s 21st century. Many Russians don’t write at all, they use keyboards to type. My own writing skills are rusty, as I hardly use them. I chose an modern bank, which fills forms for me, so I only need to sign the papers. And it’s only when the issue can’t be solved using Internet banking. The above is actually about the biggest cities of Ukraine. But I guess in Russia it’s about the same. You don’t really need writing at all. Just typing is enough. That to say, USSR had mandatory school education, so 100% of Russians born in the USSR went to school. Over time after the dissolution it became possible for poorest people to avoid school, but I guess the overall number of people who went to primary school is still very close to 100%. And they only teach cursive there. Block letters as a writing style is non-existent. This is contrary to English. Block letters do exist, but are used in very limited circumstances. So in modern days, it’s mostly typing, with some cursive when you actually use pen and paper (I don’t actually own a pen), and with block letters when you write profanities on walls and fill forms. I guess even when forms have explicit boxes for each letter, most Russians write isolated cursive letters there, because block letters are so rare. If I learn Russian should I learn cursive writing too? I don’t think you should. However your teacher of Russian might think it’s mandatory. So do whatever is acceptable for your teacher. Also many Russians are conservative. In 1960s they taught in schools not only writing cursive, but writing cursive with fountain pens. While ball pens were available, they were forbidden, as kids absolutely needed to learn the right way to write, with proper stroke width changes. Google “Нажим - волосная” So now they insist that cursive is still needed although it really isn’t. With ages-old arguments such as “what if you don’t have a keyboard”. Well, we don’t teach our kids to catch and cook prey anymore. ",
            "date": "Answered August 8, 2020",
            "views": "776",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Daruma Twin",
                    "user_href": "/profile/Daruma-Twin-1"
                },
                {
                    "user_id": "Arjun Sahdev",
                    "user_href": "/profile/Arjun-Sahdev-3"
                }
            ]
        },
        {
            "author_info": {
                "name": "Polly Young",
                "href": "/profile/Polly-Young-1"
            },
            "answer_text": "Just to add to the multiple (correct) answers of “yes Russians write cursive”: In my freshman year in college in the States, it was crazy for me to realize that most of my American classmates and professors used type writing instead of cursive. It seemed extremely inefficient. Also, writing in pencil till 8th grade?! Russians learn type writing in kindergarden, and cursive in 1–2 grade. By grade 3, typically everyone writes exclusively in cursive. So, I used to write in English in cursive. The downside was that none of my friends could read it and copy the notes if they happened to miss class. However, just because Russians write in cursive, does not mean you should learn it. I’d take to cursive after you get your spelling figured out and after you accumulate a decent size vocab. ",
            "date": "Answered August 26, 2017",
            "views": "25",
            "upvotes": " View 7 Upvoters",
            "upvoters": [
                {
                    "user_id": "Miljan Stijović",
                    "user_href": "/profile/Miljan-Stijović"
                },
                {
                    "user_id": "Irina Lyschitskaya",
                    "user_href": "/profile/Irina-Lyschitskaya"
                },
                {
                    "user_id": "Timur Khabibullin",
                    "user_href": "/profile/Timur-Khabibullin"
                },
                {
                    "user_id": "M Dillman",
                    "user_href": "/profile/M-Dillman-1"
                },
                {
                    "user_id": "Mark Kulka",
                    "user_href": "/profile/Mark-Kulka"
                },
                {
                    "user_id": "Svetlana Van Ness",
                    "user_href": "/profile/Svetlana-Van-Ness"
                },
                {
                    "user_id": "Timofey Asyrkin",
                    "user_href": "/profile/Timofey-Asyrkin"
                }
            ]
        }
    ]
}