{
    "title": "Do actors feel dissociated when in character? - Quora",
    "tags": [
        "Method Acting",
        "Dissociation (psychology)",
        "Movie and TV Characters",
        "Acting",
        "Mental Illness",
        "Actors and Actresses",
        "Emotions"
    ],
    "response": [
        {
            "author_info": {
                "name": "Amie Fipps",
                "href": "/profile/Amie-Fipps-2"
            },
            "answer_text": "It depends on the actor/actress, acting method used and the character. If you want to use an acting method where you are disassociated as an actor then you should research Practical Aesthetics Acting Technique. This technique is used to highlight the experience of acting and is not based on the character but the on the actor. What does the actor want to accomplish in this scene? What would the actor do in this situation? If you are the type of person who can turn emotions on and off easily, have had real world experiences then you can use those skills to get your role perfect! If not, then read about the other types below. I’ve also included more on the first technique at the end. Here are the different types of acting techniques most actors in Hollywood use… Classical ActingThe Chekhov Acting TechniqueMethod ActingMeisner Acting TechniquePractical Aesthetics Acting TechniqueClassical acting uses an actor’s feelings and experiences to connect with the character they are portraying. The actor puts himself or herself in the mindset of the characters finding things in common to give a more accurate portrayal of the character. Clint Eastwood and Marilyn Monroe are examples. In Chekhov Technique the actor physicalizes a character’s need or internal dynamic in the form of an external gesture. Subsequently, the outward gesture is suppressed and incorporated internally, allowing the physical memory to inform the performance on an unconscious level. The Checkov Technique is a psycho-social approach to acting. The Chekhov Technique focuses on transformation, working with impulse, imagination, and inner and outer movements. Method acting is the opposite of what you are talking about where you are not disassociated and you become the character in the role. Reasons why this happens are escapism or you pretend to be someone else because that’s the only way to get on the stage in front of hundreds of people. Sometimes people are so much into the character’s life and role that they cannot separate the two I.e. two characters are dating in the show and then begin dating in real life and once the show is over they find they are not compatible as it was the characters that were compatible. We call this a showmance. This type of Method acting was used by Marlon Brando and Health Ledger. They are great examples of this type of emotion and expression. Meisner Acting Technique is similar to meat his acting but the actor focuses in the moment on the character which creates an experience in that moment and makes it seem very real and authentic to the audience at the moment. Alec Baldwin is a good example. Practical Aesthetics Acting Technique is based on the practice of breaking down a scene using a four-step analysis that entails the following: Literal – The most basic description of what is happening.Want – What does one character ultimately want the other actor to say or do.Essential Action – What the actor wants within the scene. It is necessary to understand that what the character is doing and what the actor is doing are separate.As If – As if relates to the “essential action” to the actor’s own life. For example. “Essential Action” – To retrieve what is mine. “As If” – It’s as if my mom has taken away my favorite piece of candy. I need to retrieve it because it is mine. This step is a memory device, a spark to involve the actor in the scene. It helps the actor escape the fiction, find the truth, and apply it elsewhere.Examples include William H. Macy, Jessica Alba, and Felicity Huffman. ",
            "date": "Answered January 12, 2020",
            "views": "340",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Anthony Edward Stark",
                "href": "/profile/Anthony-Edward-Stark-13"
            },
            "answer_text": "It can be difficult to feel like any part of characters can be your own. When you know there is another actor in the scene, you can often feel more at home there, especially when you don't have to take time to work through your character's emotions. But there are times you are forced to give up your characters and feel part of them with them. You give up a part of yourself that you don't need to give up anymore. Actors sometimes are surprised how different the experience of being in a show is. And actors can learn to be very open and honest with themselves about what they think the show is going to be. Actors also find it more interesting to share how they feel in their mind. When actors feel more at home on the scene, they often feel more comfortable. ",
            "date": "Answered September 4, 2019",
            "views": "244",
            "upvotes": "0"
        }
    ]
}