{
    "title": "Do Blog Comments Help SEO? - Quora",
    "tags": [
        "Blogging and Commenting",
        "Blog Search Engine Optimization",
        "Off-Page SEO",
        "Link Building",
        "Bloggers",
        "SEO Tools",
        "Blogs",
        "Blogging"
    ],
    "response": [
        {
            "author_info": {
                "name": "Georgia Elwiss",
                "href": "/profile/Georgia-Elwiss"
            },
            "answer_text": "Blog commenting has been an SEO strategy since the first time anyone opened up comments on their site in the first place. Mechanically, it’s very simple in concept. Blog comments are content on a page. Content on a page is indexed by Google. If a link is on a page, that link becomes part of Google’s analysis of SEO. Therefore, you can leave a blog comment with your link and have that linked indexed by Google, thus counting as a benefit to your SEO. Many such services sprung up around the same time the tools came out, years ago, in an attempt to leverage mass blog commenting as a money-making strategy. In fact, many of these services use these same tools to accomplish their tasks. A blog commenting company will generally give you promises about the minimum PageRank, Domain Authority, and other metrics of the sites they target. They’ll also often talk about how their target sites are all dofollow blogs, and how you won’t be marked as spam, and all the rest. Essentially, these companies maintain lists of sites they can post comments on and have those comments benefit their target sites. It needs to be an active blog with some level of authority in a relevant niche. It should have good PageRank, Domain Authority, and other meaningful metrics. It should be followed, to give the link real SEO value. Essentially, a blog commenting service outsources the goal of blog commenting for SEO, using their own resources instead of requiring you to build up your own lists of relevant sites and whatnot. Rather than using blog commenting to spread your link around and get some mechanical SEO company San Diego benefit, I think you have a much better opportunity. With blog commenting, either manually or with services you pay for, you’re generally spamming your link around for some minor returns. It might cost you money or it might cost you time, but either way, there’s a real cost associated with it. Identify the best blogs in your niche, and completely disregard any thoughts of links whatsoever. ",
            "date": "Updated August 27, 2020",
            "views": "156",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Bobby Lewis",
                "href": "/profile/Bobby-Lewis-30"
            },
            "answer_text": "Everyone has a different reason to do Blog Commenting. Bloggers who wants to do for Seo perspective, do it to create backlinks, some for increasing Alexa rank and some for spreading knowledge. Blog commenting plays an important role to attract traffic i.e. to get visitors on to the blog or website and create a relationship with the users or readers. As I have already mentioned above, Blog commenting is also done for creating backlinks, and to attract traffic. Let us talk about it more: 1. Backlinks : One of the most important reasons to do blog commenting. If you feel that your website is not getting enough traffic, one of the reasons might be that your site is not getting authority from search engines. When you comment on other’s blog, you are creating a backlink for yourself which is indirectly helping you to gain traffic. 2. Traffic : Anyone who is commenting on the blog will leave a backlink, which means, backlinking is a mode to drive traffic. Make sure, you are not commenting a random one, as it will serve you no good. The comments should be relevant and in that context only. 3. Build Relationships : One of the great way to build relations with your website users is through Blog Commenting. Initially building relations might take time but once you start doing regularly, you will be noticed. Moreover, you will gradually start building relations with the bloggers or site administrators etc. 4. Brand Recognition : When you are blogging or you are commenting, you do that in your niche, so that you can drive traffic from the potential users. Even if the users or visitors don’t comment on your blog, the brand itself is enough to create an impression on the user’s. Maybe , later while buying a product, they might consider you. ",
            "date": "Answered April 16, 2017",
            "views": "12",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Helen A. Emerson",
                    "user_href": "/profile/Helen-A-Emerson"
                }
            ]
        }
    ]
}