{
    "title": "Do college professors want students to pass their class? - Quora",
    "tags": [
        "College and University Students",
        "Academia",
        "College and University Faculty",
        "Teachers",
        "Students",
        "The College and University Experience",
        "Higher Education",
        "Colleges and Universities",
        "Education"
    ],
    "response": [
        {
            "author_info": {
                "name": "Dorin Stanciu",
                "href": "/profile/Dorin-Stanciu"
            },
            "answer_text": "No… we want them to fail miserably. We want them to know the bitter taste of defeat. We want them to understand that school is not a gift to be taken for granted. We want them to learn the hardships of life. Should I go on? Of course we want them to pass the course. If they don’t, it’s our failure, not theirs. It is us who designed and delivered that course. Isn’t it obvious that at some point, we, the teachers, failed? It is my responsibility to design an updated course, based on the newest and most relevant materials, scientifically validated and supported, with as many and as diverse examples and applications as possible. It is my job to deliver that course in such a way that it motivates your, engages you in thinking and in wanting to discover more. On the other hand, there’s the small aspect of you wanting to be in that class, too. But, hey, I assumed that’s implicit, since you’re in my class. I mean, other than taking shelter from the bad weather outside, hiding from your dealer, not having a proper place to go, why would you be in my class if you didn’t want to? To make the story short, for those authentic teachers I know, there’s not greater satisfaction then seeing their students enjoying the success of their work, growing into better, wiser persons. And, passing your course, provided is a decent one, is part of that, too. Thanks for the A2A ",
            "date": "Answered October 22, 2019",
            "views": "317",
            "upvotes": " Answer requested by Harold Scott",
            "upvoters": [
                {
                    "user_id": "Joanne Serin",
                    "user_href": "/profile/Joanne-Serin"
                },
                {
                    "user_id": "Mark Lafer",
                    "user_href": "/profile/Mark-Lafer"
                },
                {
                    "user_id": "Nan Scott",
                    "user_href": "/profile/Nan-Scott-2"
                },
                {
                    "user_id": "Lee Meeks",
                    "user_href": "/profile/Lee-Meeks-2"
                },
                {
                    "user_id": "Linda Scheer",
                    "user_href": "/profile/Linda-Scheer-1"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/Dee-Parting"
                },
                {
                    "user_id": "Elizabeth Knight",
                    "user_href": "/profile/Elizabeth-Knight-4"
                },
                {
                    "user_id": "Gene Su",
                    "user_href": "/profile/Gene-Su-1"
                },
                {
                    "user_id": "Todd Pettigrew",
                    "user_href": "/profile/Todd-Pettigrew"
                },
                {
                    "user_id": "Gene Rick",
                    "user_href": "/profile/Gene-Rick-1"
                },
                {
                    "user_id": "Calvin Welch",
                    "user_href": "/profile/Calvin-Welch-1"
                },
                {
                    "user_id": "Sharón Lynn Wyeth",
                    "user_href": "/profile/Sharón-Lynn-Wyeth"
                },
                {
                    "user_id": "Lee Finn",
                    "user_href": "/profile/Lee-Finn"
                },
                {
                    "user_id": "Ross Johnson",
                    "user_href": "/profile/Ross-Johnson-81"
                },
                {
                    "user_id": "Lawrence Fagan",
                    "user_href": "/profile/Lawrence-Fagan-3"
                },
                {
                    "user_id": "Terri Grassby",
                    "user_href": "/profile/Terri-Grassby"
                },
                {
                    "user_id": "Eric Bittner",
                    "user_href": "/profile/Eric-Bittner"
                },
                {
                    "user_id": "Etienne Vallée",
                    "user_href": "/profile/Etienne-Vallée-1"
                },
                {
                    "user_id": "Pieter Schutte",
                    "user_href": "/profile/Pieter-Schutte-1"
                },
                {
                    "user_id": "Valerie Wright",
                    "user_href": "/profile/Valerie-Wright-25"
                },
                {
                    "user_id": "Peter J. Large",
                    "user_href": "/profile/Peter-J-Large"
                },
                {
                    "user_id": "Joshua Gross",
                    "user_href": "/profile/Joshua-Gross-8"
                },
                {
                    "user_id": "Kate Moore",
                    "user_href": "/profile/Kate-Moore-149"
                },
                {
                    "user_id": "Maureen Hawkins",
                    "user_href": "/profile/Maureen-Hawkins-2"
                },
                {
                    "user_id": "Joanna Dosanjh",
                    "user_href": "/profile/Joanna-Dosanjh-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Keith Lindsey",
                "href": "/profile/Keith-Lindsey-3"
            },
            "answer_text": "Yes, but more important, professors want students to learn the material. You can probably pass the class without learning the material simply by doing the required assignments and cramming for the exam. But after the semester is over, you won't remember the material and your professor won't remember you. But if you strive to understand what is being taught, to understand why the material is important (and IT IS important to your professor), then you will differentiate yourself from your fellow students, you will load new material for decision making into your brain, and you will make your professor feel like he or she accomplished something. I taught Management Information Systems. I had plenty of students who memorized the difference between a Customer Relationship Management system and an Enterprise Resource Planning system well enough to pick the right answers on the test and get a C or even a B if they were good test takers. That didn't make me happy or sad, it was just a fact of life. But I thought that since I taught one of the first required classes for a Business degree, and most students didn't really have any idea what a business did or how they are organized, I gave the students the opportunity to get a glimpse of the operation of a business to see if they could picture how they would fit in a business organization and even get a clue about whether they would be happy doing some of the tasks that needed to be done. So there were a few students who took that opportunity to understand WHY we needed CRM and ERP systems, and how using those kinds of systems would help a business succeed. That made me happy. Those students almost always got A's - not because they gave me what I want (I had a lot of students who thought that kissing my ass was a great way to get an A - they ended up disappointed in me and I ended up disappointed in them) but because their effort to understand the importance of the material helped them answer the test questions correctly and focus their writing assignments on issues that were important. They also learned a lot of things that helped them succeed in their careers. ",
            "date": "Answered August 31, 2019",
            "views": "12",
            "upvotes": " View 26 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Nan Scott",
                    "user_href": "/profile/Nan-Scott-2"
                },
                {
                    "user_id": "Elizabeth Knight",
                    "user_href": "/profile/Elizabeth-Knight-4"
                },
                {
                    "user_id": "Gene Rick",
                    "user_href": "/profile/Gene-Rick-1"
                },
                {
                    "user_id": "Terri Grassby",
                    "user_href": "/profile/Terri-Grassby"
                }
            ]
        },
        {
            "author_info": {
                "name": "Yunlok Lee",
                "href": "/profile/Yunlok-Lee"
            },
            "answer_text": "I do not see why not, if they are true and responsible educators and want their students to succeed in their studies, graduate and find good jobs and contribute fruitfully to society. I have defined college professors as university professors in countries such as UK, Australia and NZ teaching Bachelor courses, including Medicine, Engineering, Education and many other courses. Yes, indeed, professors want their students to pass their class. I cannot see any good reasons for not wanting tbeir students to pass their class. However, I must qualify this by saying that the professors have standards to uphold for the courses they teach. This means that they will need to assess through assignments, test and examinations on how well the students have learned and if they have indeed reached the set standards. If so, on graduation, there is guarantee that these trained men and women, will be sufficiently competent to do jobs for which they are trained to serve the community. Imagine, for example, if professors in medicine or engineering or education courses willy-nilly passed students without ensuring these students had indeed reached the determined standards, they would be graduating incompetent doctors, engineers and educators. Who would want to consult these half-baked professionals? Clearly, you and I and every rational-thinking person would be most unhappy with those irresponsible professors. Society would compaign for their removal from teaching. Professors have nothing to gain for failing students when they have achieved the set standards. Having taught students, I would feel most delighted and satisfied on graduation day to see each graduand I was privileged and responsible to teach, walking past the stage in academic regalia receiving his/her testamar amidst the applause of the families and congregation. Yes, professors want their students to pass their courses but also want to ensure that they have been trained competently. ",
            "date": "Updated October 2, 2019",
            "views": "165",
            "upvotes": " View 4 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Harold Scott",
                    "user_href": "/profile/Harold-Scott-23"
                }
            ]
        },
        {
            "author_info": {
                "name": "Jeffrey Johnson",
                "href": "/profile/Jeffrey-Johnson-16"
            },
            "answer_text": "College professors want students to reach a place in their development where they wouldn’t (seriously) ask a blanket question about the intentions of a highly diverse population like college professors toward an array of highly diverse populations like students in their various classes. I’m sure the answer is a class of conditioned statistical distributions, dependent on the year of study, the subject area, student backgrounds and demographics, cultural distance between students and professors, how much of the content being presented the student is willing to confront and engage. Some researchers have already published a number of journal articles on this, I’d bet money on it. The professors job is to present the material, assign homework and projects with performance expectations and a grading rubric, administer quizzes and exams and then evaluate the work submitted according to the rubric. He/she should return fairly graded papers quickly be impartial as to the outcomes achieved by an particular student. The student is responsible to know when to withdraw from or drop a class. Some classes are offered every semester and the material is critically necessary in follow on classes. It’s in the students best interest to take the class until they master the content. If you’ve reached a point where you’re concerned about the professor’s intentions, and merely passing, you may want to revisit the notion of a college education as a productive way to spend your time. The original question is probably interesting research for people who study this stuff. It’s probably a waste of your time if you’re in undergraduate classes right now. Go talk to the professor about the material/homework/exams during office hours. Go to tutoring and recitation sessions taught by TA’s. pay for private tutoring. Put the effort your need into fulfilling your own intentions. ",
            "date": "Answered October 21, 2019",
            "views": "398",
            "upvotes": " Answer requested by Harold Scott",
            "upvoters": [
                {
                    "user_id": "Terri Grassby",
                    "user_href": "/profile/Terri-Grassby"
                }
            ]
        },
        {
            "author_info": {
                "name": "Chris Atkins",
                "href": "/profile/Chris-Atkins-61"
            },
            "answer_text": "As a part time and, at present, ex lecturer, I want students to have understood the subject, have completed all assignments and passed a ‘reasonably set’ examination that tests that understanding. I have high expectations of my students and am pleased when they demonstrate they have met them. I am quite content to fail a student who does not meet the course expectations. What I do not like is the stream of post-results ‘pleas’ for remarking or some form of special consideration. I will always check if a student queries a result but my overwhelming experience if that those claims are very rarely justified. I particularly do not like the, increasingly common, attitude that ‘I paid to come on this course and I deserve to pass it’ or, even, to be awarded top marks/a first/distinction/merit, etc. The customer is not always right and I strongly believe that academic standards should be maintained so that employers know what they are getting consistently and over time. ",
            "date": "Answered May 12, 2020",
            "views": "74",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Valerie Wright",
                    "user_href": "/profile/Valerie-Wright-25"
                },
                {
                    "user_id": "Joshua Gross",
                    "user_href": "/profile/Joshua-Gross-8"
                }
            ]
        },
        {
            "author_info": {
                "name": "Kathleen Crader",
                "href": "/profile/Kathleen-Crader"
            },
            "answer_text": "I believe the old theory that the class grades should form a perfect bell curve went out somewhere around the same time the cost of colleges exploded. When students are going to be paying for school for much of their adult life, they won’t stay in it if they have to repeat numerous classes. That said, the assistance readily available in high school has to be searched out by the student in college, and you probably don’t already know the smartest kid in your class and have him or her on speed dial like you did in high school so passing might be more difficult. They used to say everyone should expect to drop one letter grade between high school and college, I know that happened for me, but I don’t think it’s still the case as today’s students take dual credit and AP courses that weren’t available back then. ",
            "date": "Answered October 9, 2019",
            "views": "22",
            "upvotes": " Answer requested by Harold Scott",
            "upvoters": [
                {
                    "user_id": "Michael J. McFadden",
                    "user_href": "/profile/Michael-J-McFadden"
                }
            ]
        },
        {
            "author_info": {
                "name": "Elaine Stone Edmond",
                "href": "/profile/Elaine-Stone-Edmond"
            },
            "answer_text": "It is beneficial for students to pass a professors class for both the professor and student. While I was in college, students took a survey at the end of the class and the answers determined whether or not new professors kept their job. I had a professor while I was in college that gave me a D on my midterm. I took the test to my advisor and asked her to look at it and tell me what was wrong with my answers. There was nothing wrong with my answers. I made an appointment with him and he would not change my grade, but if I made an A on everything else he would drop my grade on this test. This went against any justice that I understood but I agreed and informed him I better be graded fairly from here on out. This professor found out he and my brother were drinking buddies and he made a comment to me about it .and I told him that neither of the two impressed me much. I ended up with my A, went on with my life and never looked at or spoke to the sorry excuse of a professor again. If I had not recieved my fair grade I would have fought for it and would have done everything in my power to cost him his job. ",
            "date": "Answered October 25, 2019",
            "views": "72",
            "upvotes": " Answer requested by Harold Scott",
            "upvoters": [
                {
                    "user_id": "Terri Grassby",
                    "user_href": "/profile/Terri-Grassby"
                },
                {
                    "user_id": "Kate Moore",
                    "user_href": "/profile/Kate-Moore-149"
                },
                {
                    "user_id": "Maureen Hawkins",
                    "user_href": "/profile/Maureen-Hawkins-2"
                },
                {
                    "user_id": "Erin Morrey",
                    "user_href": "/profile/Erin-Morrey"
                }
            ]
        },
        {
            "author_info": {
                "name": "Lenord Swope",
                "href": "/profile/Lenord-Swope"
            },
            "answer_text": "Yes they do and as some of the other answers state the professors want the students to understand the material. Especially at the graduate school level, Master’s and PhD graduates with inadequate command of material would be seriously detrimental to a university’s reputation. When I was giving my orientation to each of my classes at College of the Redwoods, I would state I have no problem giving everyone As, I also have no problem giving everyone Fs; however, if I am giving everyone Fs then there is something wrong with how I am conveying the material. I used a concept that I had experienced from Dr. Tom Hale at Cal Poly. He would have the weighting of the final so that a good performance on the final could wipe out poor performances on the midterms. At College of the Redwoods in all my classes, the final score counted in place of all midterms or counted just equal to one midterm whichever was the most beneficial to the student. Conceptually it recognized that if the subject matter all came together at the end of the class and was demonstrated by a good score on the final, then the student benefited from proving command of the subject matter. If the student had been doing well up to the final but just had a bad day for the final exam, then the student was slightly dinged but only by having the final equal to just one midterm exam. ",
            "date": "Answered September 23, 2019",
            "views": "144",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Terri Grassby",
                    "user_href": "/profile/Terri-Grassby"
                },
                {
                    "user_id": "Hanlie Wessels",
                    "user_href": "/profile/Hanlie-Wessels"
                },
                {
                    "user_id": "Valerie Wright",
                    "user_href": "/profile/Valerie-Wright-25"
                },
                {
                    "user_id": "Joshua Gross",
                    "user_href": "/profile/Joshua-Gross-8"
                },
                {
                    "user_id": "Maureen Hawkins",
                    "user_href": "/profile/Maureen-Hawkins-2"
                }
            ]
        },
        {
            "author_info": {
                "name": "Valerie Wright",
                "href": "/profile/Valerie-Wright-25"
            },
            "answer_text": "I want everyone to pass, but not all people do. Passing is contingent on doing the work required at a passing level--which generally takes effort. It is about the learning and walking away with information in a tangible way, and I try to make my assignments tangible to my student's lives. I try to give student's every chance to pass...and work with individuals who struggle, but that is not the stance of all professors. I have certainly had professors who pride themselves in being difficult or having a low pass rate. They are generally not very popular professors...albeit, popularity is not what is all about...but I think there can be a happy medium between high expectations and encouragement to be your best! ",
            "date": "Answered September 4, 2019",
            "views": "48",
            "upvotes": " Answer requested by Harold Scott",
            "upvoters": [
                {
                    "user_id": "Valerie Wright",
                    "user_href": "/profile/Valerie-Wright-25"
                }
            ]
        },
        {
            "author_info": {
                "name": "Mike Kaiser",
                "href": "/profile/Mike-Kaiser-15"
            },
            "answer_text": "Generally speaking, Professors do want students to pass their courses. Although, a concept that is difficult for students to grasp is the cost associated with education. Faculty and staff are hired by the students to provide an educational experience. Not just an experience but an atmosphere in which to learn the required material to advance onto the next educational level. The responsibility relies heavily on a contract between the student and the faculty member. A contract that (informally) states that the faculty member will deliver and provide an educational atmosphere in which the required material is covered. The student’s side of the contract states that he/she will study the material provided and exhibit competency (i.e., an understanding) to advance to the next educational level. Each side has its part in the process. Furthermore, the educational process is a two-way street. Knowledge flows both ways. ",
            "date": "Answered October 3, 2019",
            "views": "55",
            "upvotes": " Answer requested by Harold Scott",
            "upvoters": [
                {
                    "user_id": "Celeste Mann",
                    "user_href": "/profile/Celeste-Mann-1"
                },
                {
                    "user_id": "Victoria Smith",
                    "user_href": "/profile/Victoria-Smith-225"
                },
                {
                    "user_id": "Kate Moore",
                    "user_href": "/profile/Kate-Moore-149"
                },
                {
                    "user_id": "Erin Morrey",
                    "user_href": "/profile/Erin-Morrey"
                },
                {
                    "user_id": "Todd Pettigrew",
                    "user_href": "/profile/Todd-Pettigrew"
                },
                {
                    "user_id": "Joanna Dosanjh",
                    "user_href": "/profile/Joanna-Dosanjh-1"
                },
                {
                    "user_id": "Graham White",
                    "user_href": "/profile/Graham-White-93"
                },
                {
                    "user_id": "Maureen Hawkins",
                    "user_href": "/profile/Maureen-Hawkins-2"
                }
            ]
        },
        {
            "author_info": {
                "name": "Tom Longwell",
                "href": "/profile/Tom-Longwell"
            },
            "answer_text": "Yes. I always wanted my students to pass. Even when I taught at a university that relied almost solely on tuition dollars for funding, and had a culture where it was fine if students tended to repeat certain classes. My job was to teach the material and assess students’ understanding of it. Students passing my class was a demonstration that I was doing my job. On the other hand, I have always been completely unwilling to pass students who didn’t earn passing grades. There were always a few that didn’t put in the effort, and consequently didn’t pass. Far less common were students who tried, but couldn’t master the material. It’s far less common; thinking about it, only one specific student comes to mind. She really did try, and did reasonably well on the homework, but just couldn’t pull it together in the exams. She didn’t pass, and I felt bad about it, but giving her special treatment would have been unethical and unfair to the other students. I don’t think I’m in any way unusual, for what it’s worth. ",
            "date": "Answered June 27, 2020",
            "views": "85",
            "upvotes": " Answer requested by Harold Scott",
            "upvoters": [
                {
                    "user_id": "Breege Doherty",
                    "user_href": "/profile/Breege-Doherty-1"
                },
                {
                    "user_id": "Alex Vasile",
                    "user_href": "/profile/Alex-Vasile-24"
                },
                {
                    "user_id": "Mitchell Willemsen",
                    "user_href": "/profile/Mitchell-Willemsen-1"
                },
                {
                    "user_id": "Grigoriy Kimaev",
                    "user_href": "/profile/Grigoriy-Kimaev-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "David Cosgrave",
                "href": "/profile/David-Cosgrave-4"
            },
            "answer_text": "Absolutely. Despite what some students think, most professors want their students to do well, not just in their course but in life in general. It is one of the most rewarding parts of the job to see students who have come through your course doing well in the real world. Unfortunately, there are students who fail my courses every year. Given the assessment strategy for my course, it is genuinely hard to fail. You would have to do very poorly across multiple assessments. For the most part, there are clear reasons why my students fail e.g. regularly absent from class, poor work ethic/attitude. It is usually more work for professors when someone fails a course from an administrative perspective. However, if you are failing a course you need to look at your own performance first before blaming a professor. Have you given 100% in your course? Best of luck. ",
            "date": "Answered April 9, 2020",
            "views": "47",
            "upvotes": " Answer requested by Harold Scott",
            "upvoters": [
                {
                    "user_id": "Kate Moore",
                    "user_href": "/profile/Kate-Moore-149"
                },
                {
                    "user_id": "Maureen Hawkins",
                    "user_href": "/profile/Maureen-Hawkins-2"
                },
                {
                    "user_id": "Michael Duncan",
                    "user_href": "/profile/Michael-Duncan-30"
                },
                {
                    "user_id": "Mahesh Jethalia",
                    "user_href": "/profile/महेश-जेथलिया-Mahesh-Jethalia"
                },
                {
                    "user_id": "Joanna Dosanjh",
                    "user_href": "/profile/Joanna-Dosanjh-1"
                },
                {
                    "user_id": "Garry Taylor",
                    "user_href": "/profile/Garry-Taylor-5"
                }
            ]
        },
        {
            "author_info": {
                "name": "Arlene Holt",
                "href": "/profile/Arlene-Holt-1"
            },
            "answer_text": "Each college professor carries a unique style of an instructional philosophy. Do William Glasser was the proponent of Schools Without Failure, his book title and his program. I find Dr Glasser’s philosophy heartwarming and very successful. I thought he was correct in his belief that all students want to do well. On the other hand, I recall a professor who became gleeful when students did poorly on their exams. He or she prided himself or herself on constructing a very difficult exam. I am not at all sure what intrinsic reward the professor gained from such a strategy. Nonetheless, I would rule out such a class. Before you sign up for a particular class, find out all you can about the professor and the class. Are term papers required? Do exam questions come from the text, class notes, films, and so on. Take the class from the professor that suits your learning style. ",
            "date": "Answered September 4, 2019",
            "views": "69",
            "upvotes": " Answer requested by Harold Scott",
            "upvoters": [
                {
                    "user_id": "Prakash Kumar",
                    "user_href": "/profile/Prakash-Kumar-4286"
                }
            ]
        },
        {
            "author_info": {
                "name": "James Puntasecca",
                "href": "/profile/James-Puntasecca"
            },
            "answer_text": "Of course!! For many reasons. A college professor wants to feel a sense of achievement. Second, they do not look to fail kids. Third, they want you to succeed. Okay. If you don’t buy that, how about these reasons. The more students that pass, the more people like that college. Thus, the more people enroll. Thus, the more tuition comes in. This keeps the school solvent and, as a result, provides a sense of job security for the professor!! ",
            "date": "Answered October 19, 2019",
            "views": "24",
            "upvotes": " Answer requested by Harold Scott",
            "upvoters": [
                {
                    "user_id": "Celeste Mann",
                    "user_href": "/profile/Celeste-Mann-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Margot Suettmann",
                "href": "/profile/Margot-Suettmann"
            },
            "answer_text": "Yes, they generally do, but not at all costs.IF a student is lazy, performs below his / her potential, or lacks ability and competence, it may be annoying and sad for the professor as well. It is like a good piano player who has a mediocre student who never practices i n between lessons.A professor tries to further advance science - that is his first duty. With lazy or incompetent students that goal cannot be accomplished. They have chosen the wrong pathway in their lives or still are very immature and need to learn life’s many lessons first. Which means they might not belong to a college. Any Department that allows such people to dominate their performance and outcomes loses in the end. in terms of reputation and attractiveness to other more competent and diligent students. But generally, most professors take a humane interest in their students and do want them to grow and achieve. They offer support in some way as their time allows. But teaching is only one arm of their profession, the other one is advancing their field of science, publishing papers, continuing to learn themselves by taking notice of developments and scientific publications in their field and so forth. A scientists reputation is dependent on publications in peer-reviewed journals. ",
            "date": "Answered September 8, 2019",
            "views": "74",
            "upvotes": " Answer requested by Harold Scott",
            "upvoters": [
                {
                    "user_id": "Celeste Mann",
                    "user_href": "/profile/Celeste-Mann-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Tory Temple",
                "href": "/profile/Tory-Temple"
            },
            "answer_text": "The short answer is yes. Profs that are adjunct never get tenure and much of their continued employment depends on the student feedback. More seasoned professors still rely on student evals, but less concerned with their feedback as their professional skill sets going forward. These students become their legacy and tend to get most of the focus time. For everyone else, it’s up to them. Pass, fail it doesn't matter really to this type of professor. This type is really only concerned with the students that demonstrate true talent and can help further their own research agendas. ",
            "date": "Answered October 18, 2019",
            "views": "37",
            "upvotes": " Answer requested by Harold Scott",
            "upvoters": [
                {
                    "user_id": "Kate Moore",
                    "user_href": "/profile/Kate-Moore-149"
                },
                {
                    "user_id": "Peter Foulds",
                    "user_href": "/profile/Peter-Foulds-8"
                }
            ]
        },
        {
            "author_info": {
                "name": "Lee Meeks",
                "href": "/profile/Lee-Meeks-2"
            },
            "answer_text": "Is this a real question or a cynical question? I am sure somewhere in the universe there’s a professor who doesn’t care if students pass their classes. But I’ve never heard of it. And I sincerely hope it’s not true. I teach as an adjunct because I love exchanging ideas on course-related topics with inquiring minds. I both want to share what I know at the intersection of academia and industry and to have what I know challenged by those inquiring minds to both strengthen mine and theirs’ critical thinking skills. I have never heard of a professor who is indifferent to, or doesn’t care if students pass their classes. There are so many other things to worry about in life, please don’t worry about this. I hope this helps. ",
            "date": "Answered December 17, 2019",
            "views": "60",
            "upvotes": " Answer requested by Harold Scott",
            "upvoters": [
                {
                    "user_id": "Sakib Mohammed",
                    "user_href": "/profile/Sakib-Mohammed"
                }
            ]
        },
        {
            "author_info": {
                "name": "Carol Peterson",
                "href": "/profile/Carol-Peterson-36"
            },
            "answer_text": "Of course they do, but it’s a two way street. It is my job to be the content expert, come prepared to teach you, be fully present & respect you as learner. Your job is for you to have read the assignment & be an engaged active learner. If we work together, it should help you succeed. Although I feel sorry for students who fail, I’ve been available after class & during office hours to help you be successful, so I don’t really take that responsiblility if you fail. ",
            "date": "Answered October 27, 2019",
            "views": "25",
            "upvotes": " Answer requested by Harold Scott",
            "upvoters": [
                {
                    "user_id": "Nancy Brilliant",
                    "user_href": "/profile/Nancy-Brilliant"
                }
            ]
        },
        {
            "author_info": {
                "name": "Philip Angevine",
                "href": "/profile/Philip-Angevine"
            },
            "answer_text": "Simple answer is: YES! Professors are there to see you succeed, and they want to be part of your success.One big exception is when a major is overloaded -- e.g. too many nursing students, too many biomedical engineering majors, etc. Years ago, there was a glut of chemical engineering students at one particular Midwest school. The department chairman personally took over the intro course and cut the class size by 30%. ",
            "date": "Answered October 24, 2019",
            "views": "32",
            "upvotes": " Answer requested by Harold Scott",
            "upvoters": [
                {
                    "user_id": "Celeste Mann",
                    "user_href": "/profile/Celeste-Mann-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Andrew Gregg",
                "href": "/profile/Andrew-Gregg-14"
            },
            "answer_text": "Greetings, While some instructors seem to jealously guard their expertise, limit the number of high grades they award, or challenge students to extract knowledge from them, they are keenly interested in having enrollees earn a passing grade in their classes. There is a great deal of mutual satisfaction to be derived both from the party who set high academic expectations for a class, and from the parties who exerted themselves to meet or exceed the challenges. Sincerely, AJG. ",
            "date": "Answered September 2, 2019",
            "views": "69",
            "upvotes": " View 2 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Kate Moore",
                    "user_href": "/profile/Kate-Moore-149"
                },
                {
                    "user_id": "Erin Morrey",
                    "user_href": "/profile/Erin-Morrey"
                }
            ]
        },
        {
            "author_info": {
                "name": "Andrea L. B. Eggenberger",
                "href": "/profile/Andrea-L-B-Eggenberger"
            },
            "answer_text": "It really depends on the college professor, the subject that they are teaching, and whether or not the course is an elective or required. Personally, I want all my students to succeed and pass my class. However, it is not about what I want for my students. They are adults and responsible for their performance in class. I have students who really want to pass my class and fail to do so. Sometimes it is due to circumstances. Other times it is due to them not realizing how my class works and is set up. ",
            "date": "Answered December 13, 2019",
            "views": "48",
            "upvotes": " Answer requested by Harold Scott",
            "upvoters": [
                {
                    "user_id": "Kate Moore",
                    "user_href": "/profile/Kate-Moore-149"
                },
                {
                    "user_id": "Maureen Hawkins",
                    "user_href": "/profile/Maureen-Hawkins-2"
                },
                {
                    "user_id": "Joanna Dosanjh",
                    "user_href": "/profile/Joanna-Dosanjh-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Linda A Robinson",
                "href": "/profile/Linda-A-Robinson-1"
            },
            "answer_text": "Do college professors want students to pass their class? Yes, of course. But we’re usually more interested in helping students to grow and learn. To become “life long learners” and to learn the content of the course they’re teaching. Making yourself available outside of class, i.e., office hours, is one way of encouraging students to success in a course, especially if the student is obviously struggling with assignments or on tests. That is, to invite students to office hours! ",
            "date": "Answered December 11, 2019",
            "views": "48",
            "upvotes": " Answer requested by Harold Scott",
            "upvoters": [
                {
                    "user_id": "Duraideivamani Sankararajan",
                    "user_href": "/profile/Duraideivamani-Sankararajan"
                }
            ]
        },
        {
            "author_info": {
                "name": "Gayathri Guru Murthy",
                "href": "/profile/Gayathri-Guru-Murthy"
            },
            "answer_text": "Of course they do! Something my friend told me has always stuck with me. “You can always pass a class by doing the required work (assignments, tests, etc) and hard work but when the semester ends if you feel like that was a task and do not remember one bit of knowledge you learned from that class then that is not learning and it surely is not what anyone wants for you. We can be sure your professor wont remember you as well.” I try my best to follow this and learn my science and not just pass the class. ",
            "date": "Answered December 20, 2019",
            "views": "243",
            "upvotes": " Answer requested by Harold Scott",
            "upvoters": [
                {
                    "user_id": "Mohamed Al-Ajmi",
                    "user_href": "/profile/Mohamed-Al-Ajmi-5"
                }
            ]
        },
        {
            "author_info": {
                "name": "Tim Nygaard",
                "href": "/profile/Tim-Nygaard"
            },
            "answer_text": "Except for the occasional psychopaths, yes, absolutely. A purely practical reason is because it reflects both on the professor's knowledge of the subject and their teaching abilities. I viewed my students like my children. I want the best for my children, and want them to learn the topic. If they don't, it is my failure, not theirs. I wanted them to do well. I have known a couple of the psycho professors. They believe that flunking students is job security for them. So, just like in life, you will meet random psychos “educating” you. Most, however, really want you to do well. ",
            "date": "Answered October 25, 2019",
            "views": "38",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Dana Lasko",
                    "user_href": "/profile/Dana-Lasko"
                }
            ]
        },
        {
            "author_info": {
                "name": "Ted Falconer",
                "href": "/profile/Ted-Falconer"
            },
            "answer_text": "They wish you to learn the materials they are attempting to teach you. They may use methods unfamiliar to you however that is their goal. You are to learn and be able to use the information being presented to you. Question what you are unclear of or materials that seem confusing to you. Ask for additional information or explanation. They wish you to certainly pass and to continue with your education. ",
            "date": "Answered September 12, 2019",
            "views": "30",
            "upvotes": " Answer requested by Harold Scott"
        },
        {
            "author_info": {
                "name": "Kip Wheeler",
                "href": "/profile/Kip-Wheeler-1"
            },
            "answer_text": "Definitely. I’d actually be delighted with a 100% pass rate. The trick is, I only want them to pass if they actually know the material up to the established standards for the course. One doesn’t want medical students who don’t know anatomy roaming around in the wild post-graduation. One doesn’t want law students who don’t know law trying to practice in an actual courtroom. One doesn’t want engineers who don’t know math building bridges. So, I definitely don’t want students who aren’t up to snuff passing the class. However, my preferences would be that every single one of them master the material, and thus every single one of them pass the course and go on to successful and productive careers. ",
            "date": "Answered August 31, 2019",
            "views": "172",
            "upvotes": " View 4 Upvoters "
        },
        {
            "author_info": {
                "name": "Elizabeth Behrman",
                "href": "/profile/Elizabeth-Behrman"
            },
            "answer_text": "oh yes, much more than that in fact. In most freshman physics classes there is someone who wants to know if I grade “on a curve”. I do not, and I tell them that for an experienced teacher to do so is unfair to the students: your grade should not depend on the performance of others. I say, further, that nothing would make me happier than if every student in the class should earn a grade of A. It has never yet happened, I say, but THIS class could be the one! I LOVE when students do well, when problem sets and exams are easy to grade, when students listen attentively and intelligently and interestedly, when students want to go farther and learn more! Wonderful! I am sure we all do. Thanks for the A2A. ",
            "date": "Answered August 31, 2019",
            "views": "223",
            "upvotes": " View 5 Upvoters "
        },
        {
            "author_info": {
                "name": "Etienne Vallée",
                "href": "/profile/Etienne-Vallée-1"
            },
            "answer_text": "Yes and no… I actually want them to acquire knowledge, skills and integrate the material. I have the responsibilty to deliver this curriculum, and the student has the responsibility to learn it, thus pass; them not living up to that part of the bargain? Then the answer becomes no, but not out of spite, indeed I’ll work quite a bit to assist in getting them there, but ultimately it’s on them. ",
            "date": "Answered September 10, 2019",
            "views": "31",
            "upvotes": " View 1 Upvoter "
        },
        {
            "author_info": {
                "name": "Lisa Kazmier",
                "href": "/profile/Lisa-Kazmier-1"
            },
            "answer_text": "Of course, they do. That doesn’t mean they will abandon their standards and ignore non-work, substandard work or plagiarized work. A professor was once a college student and likely passed all his/her classes. Why would you think otherwise? ",
            "date": "Answered August 30, 2019",
            "views": "107",
            "upvotes": " View 8 Upvoters "
        },
        {
            "author_info": {
                "name": "Danielle D",
                "href": "/profile/Danielle-D-212"
            },
            "answer_text": "Thanks for A2A. I'm not a college professor, however I did lecture college students. Every teacher, lecturer and I would think professor, wants the knowledge they give out to be recieved and well recieved at that. So yes, passing is a must. It is also a reflection on the person delivering a course / teaching a course, in terms of the pass rate. Even the worst of the worst students has the capability to pass with enough attention given to them, and enough support. ",
            "date": "Answered April 3, 2020",
            "views": "91",
            "upvotes": " Answer requested by Harold Scott"
        },
        {
            "author_info": {
                "name": "Donald Martin",
                "href": "/profile/Donald-Martin-49"
            },
            "answer_text": "please ……. think about it…… why would any teacher want their students to NOT be successful? all teachers want their students to be successful…… they want them to earn it, learn it and then use it….whatever “IT” is………. learning ain’t easy……. we’ve made it appear to be easy because we have done away with retaining students if a student fails to do the work they should be retained….. and yes… we make it very difficult to fail…….. not difficult to pass,…… difficult to fail…. but some kids still earn a failing grade…. despite all our efforts…….. I would rather they “fail” in the classroom than “fail” out in the real world, in real life…….think about it…….. failure is a part of life, we all fail at something……… learn to deal with it and how to avoid it……. ",
            "date": "Answered December 17, 2019",
            "views": "28",
            "upvotes": " Answer requested by Harold Scott"
        },
        {
            "author_info": {
                "name": "James Lowman",
                "href": "/profile/James-Lowman-1"
            },
            "answer_text": "Yes. Because professors are people, and people have egos, and professors usually have large egos because they have succeeded their way to the top of academia. Your failure is their failure as a teacher. This can’t be understated. Professors that fail students have failed those students. Now that might be too general to apply to all students. Some people are just happy to be away from their parents for the first time and have abandoned academic pursuits for personal ones. These and other types of students are never going to pass if they themselves are unwilling to do the work. Professors do not set out to fail a class of students. ",
            "date": "Answered December 11, 2019",
            "views": "200",
            "upvotes": " View 4 Upvoters "
        },
        {
            "author_info": {
                "name": "Joseph Geisler",
                "href": "/profile/Joseph-Geisler"
            },
            "answer_text": "Sure. We do NOT like to FAIL any student!!!! Most students fail themselves by not coming to class on time and with all materials ready to take part in interesting discussions of the material for today. I love it when the hour flies by! Everything falls into place. Doesn’t happen all of the time though in real life. But it does sometimes. We want the class to be interesting! That depends upon YOUR involvement. We KNOW the subject!!! What we want is for you to enlighten us with your study and critical thinking. Cheers! ",
            "date": "Answered October 15, 2019",
            "views": "28",
            "upvotes": " Answer requested by Harold Scott"
        },
        {
            "author_info": {
                "name": "Kim Ooi",
                "href": "/profile/Kim-Ooi-1"
            },
            "answer_text": "Of course we do. But at the same time, we need to maintain the quality of the degree. No teacher takes the decision to fail a student lightly. A failing grade is usually awarded only as a last resort, when there is absolutely no way that the student in question could possibly be deemed to have met the criteria necessary for a passing grade. ",
            "date": "Answered October 9, 2019",
            "views": "23",
            "upvotes": " Answer requested by Harold Scott"
        },
        {
            "author_info": {
                "name": "Felicity Nefdt",
                "href": "/profile/Felicity-Nefdt"
            },
            "answer_text": "Yes. The pass rate is a reflection of them and their teaching. As a teacher, you are supposed to reflect on your teaching methodology all the time. If in one test your students perform poorly, you have to look at all possible reasons. You cannot just put the blame at the door of the students. You have to ask yourself what do you need to change or do better. So by the time you get to the end of the course, it should be only the laziest students who don't make the grade. ",
            "date": "Answered September 8, 2019",
            "views": "23",
            "upvotes": " Answer requested by Harold Scott"
        },
        {
            "author_info": {
                "name": "Charles Neilsen",
                "href": "/profile/Charles-Neilsen-2"
            },
            "answer_text": "We’d like everyone to get “A”s, but some people resist. I knew early in a semester which kids were in trouble. The one’s that just couldn’t be bothered to study or turn in reasonable homework, they were on their own. The ones that were working hard but just weren’t getting it? That’s what grad students were for. If I had to get them six tutors, they would have as much help as they needed. ",
            "date": "Answered August 31, 2019",
            "views": "229",
            "upvotes": " View 6 Upvoters"
        },
        {
            "author_info": {
                "name": "Greg Brown",
                "href": "/profile/Greg-Brown-153"
            },
            "answer_text": "I see most everything I would say in answers already given. I will just add this. Professors need students. If they become known as egomaniacs who enjoy proving they know a lot but cannot or will not teach it successfully, students will take the course from other professors as often as possible. Students who experience a professor who does not want them to succeed in their discipline will also be unlikely to sign up for higher level courses and electives from that person. If you do not fill classes, the university does not need you. That is stating things in an unattractive and self-serving way. But along with the basic purpose of college being to help people learn and succeed in their fields, it is practical reality. ",
            "date": "Answered September 20, 2019",
            "views": "69",
            "upvotes": " View 1 Upvoter "
        },
        {
            "author_info": {
                "name": "Christopher Lange",
                "href": "/profile/Christopher-Lange-8"
            },
            "answer_text": "Yes. That's the point of teaching, to impart knowledge. But it is a two way street, the student must also want to learn. Those who do not can be hard to pass in good conscience, particularly since a pass certifies that the student has obtained a minimal acceptable level of knowledge in the subject. ",
            "date": "Answered September 13, 2019",
            "views": "17",
            "upvotes": " View 1 Upvoter "
        },
        {
            "author_info": {
                "name": "Leah Olsson",
                "href": "/profile/Leah-Olsson"
            },
            "answer_text": "Most college professors want their students to pass their classes as it is an indication of the professor’s teaching ability. That being said most college professors want their classes to be rigorous as this is leading students into a chosen profession. Do not expect professors to dumb down their classes so everyone passes. ",
            "date": "Answered September 13, 2019",
            "views": "14",
            "upvotes": " View 1 Upvoter "
        },
        {
            "author_info": {
                "name": "Robert Vincelette",
                "href": "/profile/Robert-Vincelette"
            },
            "answer_text": "Any who don’t almost certainly have an axis B personality disorder such as narcissism or, if their department chairs require only a predetermined fraction of the class to be allowed to pass, in which case they should never be teaching. If the professor is human, the worst part of the job is having to give a failing grade. ",
            "date": "Answered August 31, 2019",
            "views": "53",
            "upvotes": " View 2 Upvoters "
        },
        {
            "author_info": {
                "name": "Roman Weil",
                "href": "/profile/Roman-Weil-1"
            },
            "answer_text": "Migod, yes. Much administrative hassle descends on us if we fail students. Much easier if we pass them. In 50 years, no dean ever called me on the carpet when I awarded a passing grade to a marginal student. Many times the dean called me for discussion when I awarded a failing grade. These days, grades below B- often generate hassle in graduate courses. ",
            "date": "Answered October 7, 2019",
            "views": "214",
            "upvotes": " View 1 Upvoter "
        },
        {
            "author_info": {
                "name": "Steve Schwartz",
                "href": "/profile/Steve-Schwartz-93"
            },
            "answer_text": "Sure. If people don't pass, how can you think of yourself a good teacher? However, good teaching requires good students willing to put in the work, which may even include taking advantage of a teacher's office hours to attack individual difficulties. Also, the subject may be genuinely hard. ",
            "date": "Updated September 4, 2019",
            "views": "20",
            "upvotes": " View 1 Upvoter "
        },
        {
            "author_info": {
                "name": "Raphael Crystal",
                "href": "/profile/Raphael-Crystal"
            },
            "answer_text": "Of course they do. They often measure their success by how well students do. They may not want to give you a passing grade if you haven’t mastered the material. That’s probably in everyone’s interest. But they certainly hope that you will master the material. ",
            "date": "Answered September 13, 2019",
            "views": "9",
            "upvotes": " Answer requested by Harold Scott"
        },
        {
            "author_info": {
                "name": "Ryan McCuskey",
                "href": "/profile/Ryan-McCuskey-1"
            },
            "answer_text": "Of course they do! If they don’t, I think they really need to reevaluate some things… Professors have certain quotas they need to meet on a collegiate level. If students are failing their classes, it’s not the student’s fault - it’s the professor who is failing the students. Ryan McCuskey, Ohio State University Graduate ",
            "date": "Answered November 21, 2019",
            "views": "24",
            "upvotes": " Answer requested by Harold Scott"
        },
        {
            "author_info": {
                "name": "Sarah Pena",
                "href": "/profile/Sarah-Pena-28"
            },
            "answer_text": "Any just who don\\u2019t almost certainly have an axis B character disorder like narcissism or, if their division chairs require only a predetermined fraction associated with the course is allowed to pass, in which particular case they ought to not be training. If the teacher is person, the worst an element of the job is having to offer a failing level. ",
            "date": "Answered January 4, 2020",
            "views": "20",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Genevieve Winters",
                "href": "/profile/Genevieve-Winters"
            },
            "answer_text": "Only the good ones. Seriously though, college professors generally want to share their knowledge with students. They want students to learn and succeed both in class and in their chosen life paths. Of course, there may be a few curmudgeonly professors who delight in creating near impossible exams because they like to watch people struggle. That is far from the norm though. A good instructor wants students to truly comprehend the material, to succeed in the class, and then go on and apply the knowledge to new situations. ",
            "date": "Answered September 27, 2019",
            "views": "30",
            "upvotes": " Answer requested by Harold Scott"
        },
        {
            "author_info": {
                "name": "Kathleen Listman",
                "href": "/profile/K-N-Listman-1"
            },
            "answer_text": "College professors want students to learn and learn thoroughly. Most assume that the students are adults and whether or not that they learn is up to them. If a student does adequately learn and spend the time to produce quality work, that student should pass. ",
            "date": "Answered October 18, 2019",
            "views": "23",
            "upvotes": " Answer requested by Harold Scott"
        },
        {
            "author_info": {
                "name": "John L. Hare",
                "href": "/profile/John-L-Hare"
            },
            "answer_text": "In 32 years of teaching, I’ve known two who really didn’t care. All of the others did. I want you to pass my course, and if you let me know later how it has helped you, that thrills me. ",
            "date": "Answered September 3, 2019",
            "views": "6",
            "upvotes": " Answer requested by Harold Scott"
        },
        {
            "author_info": {
                "name": "Linda Scheer",
                "href": "/profile/Linda-Scheer-1"
            },
            "answer_text": "Of course they do! Professors, just like other educators, have decided to teach because they want their students to learn. Passing their class demonstrates that a student has learned what the professor has taught. I truly can’t understand why you would ask this question. ",
            "date": "Answered December 8, 2019",
            "views": "23",
            "upvotes": " Answer requested by Harold Scott"
        },
        {
            "author_info": {
                "name": "Alan J. Weisbard",
                "href": "/profile/Alan-J-Weisbard"
            },
            "answer_text": "Yes, of course, with very few exceptions. Certain classes in certain departments in certain universities are deliberately designed to weed out weaker students from pursuing certain majors or programs, perhaps particularly in pre-med and some of the STEM fields. ",
            "date": "Answered September 2, 2019",
            "views": "22",
            "upvotes": " View 1 Upvoter "
        },
        {
            "author_info": {
                "name": "Karl Du Val",
                "href": "/profile/Karl-Du-Val"
            },
            "answer_text": "I’m sure they do. I personally go to university in UK and so far all the professors have been extremely helpful except from those odd ones here and there. I’m actually an academic representative and we have regular meetings with senior leaders and they really do have the student’s best interest at heart. Also the more students that pass, it just means the professor is good and boost their credibility as well as the university’s. So I’m sure they want their students to pass. ",
            "date": "Answered March 1, 2020",
            "views": "60",
            "upvotes": " Answer requested by Harold Scott"
        },
        {
            "author_info": {
                "name": "Ellen Garbarino",
                "href": "/profile/Ellen-Garbarino"
            },
            "answer_text": "Why wouldn't they? Of course we want them to pass but not to the extent we would pass them when they don't deserve it. We want them to learn enough to pass (ideally much more than that). ",
            "date": "Answered September 19, 2019",
            "views": "28",
            "upvotes": " Answer requested by Harold Scott"
        },
        {
            "author_info": {
                "name": "John Nathanael Caesar",
                "href": "/profile/John-Nathanael-Caesar"
            },
            "answer_text": "Yes. If not that many students pass their class then over time it reflects poorly on them. There are some that want you to really work for it, and there's others who try to walk you through it. Overall, they want you to pass. ",
            "date": "Answered October 19, 2019",
            "views": "6",
            "upvotes": " Answer requested by Harold Scott"
        },
        {
            "author_info": {
                "name": "Tim Dibble",
                "href": "/profile/Tim-Dibble"
            },
            "answer_text": "Of course they do. Their performance reviews evaluate their effectiveness in teaching. They have nothing to gain by failing anyone. the old days of prof’s weeding out students by having classes so tough that only 50% can pass are legend and part of Hollywood only. ",
            "date": "Answered October 31, 2019",
            "views": "7",
            "upvotes": " Answer requested by Harold Scott"
        },
        {
            "author_info": {
                "name": "Maureen Hawkins",
                "href": "/profile/Maureen-Hawkins-2"
            },
            "answer_text": "Of course. More than that, I would like to see them all get As & Bs. That would be a sign of a successful collaboration between them and me—that the material and I were able to engage them and that they were able to rise to the challenge. That’s a real win-win situation. ",
            "date": "Answered August 30, 2019",
            "views": "52",
            "upvotes": " View 2 Upvoters"
        },
        {
            "author_info": {
                "name": "Jan Deurwaarder",
                "href": "/profile/Jan-Deurwaarder"
            },
            "answer_text": "All educators / trainers from pre primary to post doctoral courses want their learners to develop to the best of their abilities and will assist learners by all means to reach their potential and produce the evidence required for the learning outcomes of the course. ",
            "date": "Answered October 30, 2019",
            "views": "16",
            "upvotes": " Answer requested by Harold Scott"
        },
        {
            "author_info": {
                "name": "Beheruz N Sethna",
                "href": "/profile/Beheruz-N-Sethna"
            },
            "answer_text": "Speaking from my perspective as a college professor, I want students to do more than just pass my class. I want them to thrive, to be engaged, and do very well. ",
            "date": "Answered August 31, 2019",
            "views": "15",
            "upvotes": " View 3 Upvoters "
        },
        {
            "author_info": {
                "name": "Cary Mcdonald",
                "href": "/profile/Cary-Mcdonald"
            },
            "answer_text": "Oh my YES! They want all the students to do well, to be ‘connected’ to the thread such that they can contribute to it, or add insight or parallel directions as they see worth discussing. “No profit grows where is no pleasure ta'en (it). In brief, sir, study what you most affect.”(William Shakespeare) ",
            "date": "Answered December 23, 2019",
            "views": "37",
            "upvotes": " Answer requested by Harold Scott"
        },
        {
            "author_info": {
                "name": "Maria Salgado",
                "href": "/profile/Maria-Salgado-26"
            },
            "answer_text": "Of course. I did not only want them to pass my courses, but to do it with a good grade. I liked what I taught and I wanted my students to become as interested as I was. Being interest would lead to a good grade. ",
            "date": "Answered August 31, 2019",
            "views": "11",
            "upvotes": " Answer requested by Harold Scott"
        },
        {
            "author_info": {
                "name": "Joseph Mennuti",
                "href": "/profile/Joseph-Mennuti"
            },
            "answer_text": "In my experience, they really don’t care. On the first day of classes as a freshman, my computer science professor said, “I don’t care if all of you fail. I’ll still get paid.” It was essentially all I needed to know about him and most of the others I had. ",
            "date": "Answered October 30, 2019",
            "views": "80",
            "upvotes": " Answer requested by Harold Scott"
        },
        {
            "author_info": {
                "name": "Jonathan Howard",
                "href": "/profile/Jonathan-Howard-71"
            },
            "answer_text": "College professors are people just like everyone else. Which means that the vast majority want their students to learn the material and be successful but there are undoubtedly some sadists out there who want to fail people. My experience is that the latter are rare. ",
            "date": "Answered March 2, 2020",
            "views": "27",
            "upvotes": " Answer requested by Harold Scott"
        },
        {
            "author_info": {
                "name": "Annalisse Mayer",
                "href": "/profile/Annalisse-Mayer"
            },
            "answer_text": "Yes, particularly in private school, professors will get in trouble for failing too many students, because the private schools are dependent on the tuition paid by the students’ parents. My ex husband was in that situation, teaching remedial high school algebra, at a small private women’s college. A large number of those students were unable to complete the course successfully, but that was definitely not the desired outcome from the point of view of the administration. There was even a petition by the English department to the math department at that college to allow someone to graduate who couldn’t add two digit numbers, on the grounds that they had a math learning disability. The math department said no, but the consequences for that were bad. Eventually, because it was a small college, it was not able to attract enough students who were able to do college work. As a result, it was forced to close. This was not the desired outcome by the administration. This would probably be less likely to be the case at a state run school, or a well-funded private school. still, in general, teachers are measured by how much their students learn. If the students fail, it does reflect poorly on the teacher. ",
            "date": "Answered December 18, 2019",
            "views": "138",
            "upvotes": " Answer requested by Harold Scott"
        },
        {
            "author_info": {
                "name": "Steven Knudsen",
                "href": "/profile/Steven-Knudsen-2"
            },
            "answer_text": "Yes, but that’s not the central point. If you have a professor that acts like s/he does not want you to pass, document it and take it to the head of the department or appropriate dean. ",
            "date": "Answered September 4, 2019",
            "views": "10",
            "upvotes": " Answer requested by Harold Scott"
        },
        {
            "author_info": {
                "name": "Tim Cahill",
                "href": "/profile/Tim-Cahill-8"
            },
            "answer_text": "All teacher's want their students to pass their class. They do expect the students to earn their grade. If a teacher has a high amount of students failing their class, that teacher may be looking for a new job! ",
            "date": "Answered October 12, 2019",
            "views": "9",
            "upvotes": " Answer requested by Harold Scott"
        },
        {
            "author_info": {
                "name": "Conni Jurmo",
                "href": "/profile/Conni-Jurmo"
            },
            "answer_text": "Most professors would like you to pass their classes. Some don’t are if you do or don’t but most do. They like to impart what they have learned and see where you take it. ",
            "date": "Answered September 20, 2019",
            "views": "3",
            "upvotes": " Answer requested by Harold Scott"
        },
        {
            "author_info": {
                "name": "Gene Su",
                "href": "/profile/Gene-Su-1"
            },
            "answer_text": "There are professors who take pleasure in failing their students. They are not that many but they do exist. When I attended college, There was one computer science teacher certified by Microsoft who always failed half the class. He didn't understand the curriculum of his class (basic programming in C) and had a lot of strange, meaningless rules and nuances. He was fired after a year. Another professor, who taught physics, liked to behave like he was on a power trip and gave a “pyramid curve\": 10% A, 20% B, 30 % C, 40 % D. I should add that they also fired professors who were overly lenient like another physics professor who didn't know his stuff and couldn't speak English and gave everyone A's. Educators, at least the decent ones, want their pupils to learn, not mindlessly torment them. ",
            "date": "Answered October 24, 2019",
            "views": "139",
            "upvotes": " Answer requested by Harold Scott"
        },
        {
            "author_info": {
                "name": "Arthur Dirks",
                "href": "/profile/Arthur-Dirks-1"
            },
            "answer_text": "Of course they do. They may have to look at your ugly mug another semester. They don’t want the “fails everybody” reputation. But they also want to keep their reputation for integrity. And reputation for “getting it across”. ",
            "date": "Answered December 13, 2019",
            "views": "15",
            "upvotes": " Answer requested by Harold Scott"
        },
        {
            "author_info": {
                "name": "Lauri Barber",
                "href": "/profile/Lauri-Barber"
            },
            "answer_text": "Depends on their ego! Some deliver tests that test exactly what they taught while others always throw in extra complicated problems. For some, this separates the women from the girls, or As from the B's. But for other professors, it's more of a way to proving their superiority. I always figure that if my students are not doing well, then I am failing them and I need to figure out a different way of explaining. Your failure is my failure. ",
            "date": "Answered April 14, 2020",
            "views": "82",
            "upvotes": " Answer requested by Harold Scott"
        },
        {
            "author_info": {
                "name": "Melissah Sharp",
                "href": "/profile/Melissah-Sharp"
            },
            "answer_text": "It depends on the professor. I had professors who were willing to help when I had questions about the assignment given to asking how to prepare for upcoming exams. If I missed an exam, they wanted to make sure I took the exam. Also when you meet the professor and he/she has office hours, take advantage of them ",
            "date": "Answered September 14, 2019",
            "views": "9",
            "upvotes": " Answer requested by Harold Scott"
        },
        {
            "author_info": {
                "name": "Alan Zoller",
                "href": "/profile/Alan-Zoller-1"
            },
            "answer_text": "Of course. College professors are very bright and well educated professionals who could be making a lot more money doing something else, probably with a lot less effort. The only reason they teach is to make a difference in the world that will live on long after they are gone. ",
            "date": "Answered September 15, 2019",
            "views": "19",
            "upvotes": " View 1 Upvoter "
        },
        {
            "author_info": {
                "name": "Louis Talman, Ph.D.",
                "href": "/profile/Louis-Talman-Ph-D"
            },
            "answer_text": "What professors want is for each of their students to demonstrate that he or she possesses the knowledge and competence necessary to justify getting a passing grade—-the higher the better. ",
            "date": "Answered October 20, 2019",
            "views": "8",
            "upvotes": " Answer requested by Harold Scott"
        },
        {
            "author_info": {
                "name": "Dave Brodbeck",
                "href": "/profile/Dave-Brodbeck"
            },
            "answer_text": "I want my students to succeed. I (try to) provide all of the preconditions for that to happen. The rest is up to them. We’re just people. We of course don’t want other people to struggle. ",
            "date": "Answered September 22, 2019",
            "views": "75",
            "upvotes": " Answer requested by Harold Scott"
        },
        {
            "author_info": {
                "name": "Fulgence Ningaba",
                "href": "/profile/Fulgence-Ningaba"
            },
            "answer_text": "yes they do .because they teach them ;give them Exercises; Quiz;Test,Exam to make sure if they did understand the courses and if they get a good note they deserve to pass that class to the next one. ",
            "date": "Answered October 18, 2019",
            "views": "6",
            "upvotes": " Answer requested by Harold Scott"
        },
        {
            "author_info": {
                "name": "Matt Ramsey",
                "href": "/profile/Matt-Ramsey"
            },
            "answer_text": "If professors are worth their salt, they need to want to be able to have every student passed their class. Crappy professors cannot teach. ",
            "date": "Answered October 8, 2019",
            "views": "4",
            "upvotes": " Answer requested by Harold Scott"
        },
        {
            "author_info": {
                "name": "Gene Spafford",
                "href": "/profile/Gene-Spafford"
            },
            "answer_text": "In general, the good ones do — but only if the students learn the material. Only a sadist would enjoy flunking students on a regular basis. However, some of those make it into academic positions, so we can’t say that “none do.” ",
            "date": "Answered September 20, 2019",
            "views": "494",
            "upvotes": " View 1 Upvoter "
        },
        {
            "author_info": {
                "name": "Kevin Ladd",
                "href": "/profile/Kevin-Ladd"
            },
            "answer_text": "I have never taught professionally and can only assume that college professors want to engage their students and teach the material. The best outcome would most likely be for students to earn an A+. Key word being “earn”. ",
            "date": "Answered October 3, 2019",
            "views": "11",
            "upvotes": " Answer requested by Harold Scott"
        },
        {
            "author_info": {
                "name": "James Hartle",
                "href": "/profile/James-Hartle-4"
            },
            "answer_text": "Depends, some classes are there just to cut out students, that is what the prof is being paid to do. A prof is more likely to be kept if he has a high rate of student fail. Let us not to forget that studies show that only 10% of the learning experience is lead by the prof. ",
            "date": "Answered September 19, 2019",
            "views": "6",
            "upvotes": " Answer requested by Harold Scott"
        },
        {
            "author_info": {
                "name": "Liviu Nicolaescu",
                "href": "/profile/Liviu-Nicolaescu"
            },
            "answer_text": "Yes, of course we want. What kind of sociopaths do you think professors are? On the other hand, this is not entirely our decision, is it? ",
            "date": "Answered September 10, 2019",
            "views": "141",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Armando Bernal",
                "href": "/profile/Armando-Bernal-7"
            },
            "answer_text": "of course, but they realize that some students do not study or do the work necessary to pass, and college is not high school. ",
            "date": "Answered September 2, 2019",
            "views": "3",
            "upvotes": " Answer requested by Harold Scott"
        },
        {
            "author_info": {
                "name": "Christopher Schneider",
                "href": "/profile/Christopher-Schneider-29"
            },
            "answer_text": "Almost all of them do. There are a few who pride themselves on how difficult their classes are for students.They do not realize that any fool can design a door that will not open. Chris Schneider ",
            "date": "Answered September 21, 2019",
            "views": "13",
            "upvotes": " Answer requested by Harold Scott"
        },
        {
            "author_info": {
                "name": "Sara Von Trapp",
                "href": "/profile/Sara-Von-Trapp-1"
            },
            "answer_text": "Yes most of them. Although I had one professor who just loved to make us miserable and suffer. Even if people went up to him for help, he would always be very condescending which would make you not wanna ask him anything again. Few professors would start off the semester saying “most people will fail, I only give few As out”, but at the end of the day, they weren’t true to their words. ",
            "date": "Answered September 10, 2019",
            "views": "18",
            "upvotes": " Answer requested by Harold Scott"
        },
        {
            "author_info": {
                "name": "Susan Gainen",
                "href": "/profile/Susan-Gainen-1"
            },
            "answer_text": "Yes. If you are teaching (which is really hard to do, btw, organizing mountains of information into 50-minute chunks for starters), you want students to learn. ",
            "date": "Answered October 8, 2019",
            "views": "6",
            "upvotes": " Answer requested by Harold Scott"
        },
        {
            "author_info": {
                "name": "Ishika Agarwal",
                "href": "/profile/Ishika-Agarwal-1"
            },
            "answer_text": "It depends. Some professors care about their students - they'll make the class fun, understanding and engaging, or they'll give points for attendance, hold multiple office hours, etc. Some don't do much besides lecture. Maybe extra office hours, but no points for attendance usually. Some professors are there just for the research opportunities while some are there for both. Good luck! ",
            "date": "Answered October 12, 2019",
            "views": "14",
            "upvotes": " Answer requested by Harold Scott"
        },
        {
            "author_info": {
                "name": "Nicholas Major",
                "href": "/profile/Nicholas-Major-7"
            },
            "answer_text": "They want to impart information. They would like you to pass the class, but a tenet of a good professor is impartiality. ",
            "date": "Answered October 7, 2019",
            "views": "21",
            "upvotes": " Answer requested by Harold Scott"
        },
        {
            "author_info": {
                "name": "Alexis Rousseau",
                "href": "/profile/Alexis-Rousseau-5"
            },
            "answer_text": "The vast majority of professors want students to learn enough to pass their classes. ",
            "date": "Answered October 17, 2019",
            "views": "9",
            "upvotes": " View 1 Upvoter "
        },
        {
            "author_info": {
                "name": "John Powell",
                "href": "/profile/John-Powell-170"
            },
            "answer_text": "Not only that, we would like every student get a first, a distinction. Whatever.. But we also have standards of performance which are not negotiable. ",
            "date": "Answered January 6, 2020",
            "views": "7",
            "upvotes": " Answer requested by Harold Scott"
        },
        {
            "author_info": {
                "name": "Gil Hillman",
                "href": "/profile/Gil-Hillman"
            },
            "answer_text": "A professor wants the students to learn. If every student in the class got a perfect score on the exam, everyone would get an A and it would be the best day in the professor’s career. ",
            "date": "Answered September 8, 2019",
            "views": "13",
            "upvotes": " Answer requested by Harold Scott"
        },
        {
            "author_info": {
                "name": "Kate Moore",
                "href": "/profile/Kate-Moore-149"
            },
            "answer_text": "Of course they do. What possible gain for any teacher at any level comes from the failure of students? It is entirely juvenile to assume a teacher does the work demanded by the teaching profession for a warped glee at watching students fail. ",
            "date": "Answered September 1, 2019",
            "views": "18",
            "upvotes": " Answer requested by Harold Scott"
        },
        {
            "author_info": {
                "name": "Kenneth Rosenauer",
                "href": "/profile/Kenneth-Rosenauer"
            },
            "answer_text": "I always wanted students to pass my classes, but but never enough to let them slide. Theyalways earned the grades they received. ",
            "date": "Answered September 14, 2019",
            "views": "4",
            "upvotes": " Answer requested by Harold Scott"
        },
        {
            "author_info": {
                "name": "Lorraine Brennan",
                "href": "/profile/Lorraine-Brennan-5"
            },
            "answer_text": "Of course. They want all of their students to succeed. Many schools grade on a curve so the Professors can’t inflate grades. ",
            "date": "Answered September 15, 2019",
            "views": "8",
            "upvotes": " Answer requested by Harold Scott"
        },
        {
            "author_info": {
                "name": "Michael Richards",
                "href": "/profile/Michael-Richards-137"
            },
            "answer_text": "I would certainly hope so—even if you ace a class the important question is: Did you learn anything?” Some people are great test takers, but may not know as much as the person getting a lower grade— ",
            "date": "Answered October 14, 2019",
            "views": "7",
            "upvotes": " Answer requested by Harold Scott"
        },
        {
            "author_info": {
                "name": "Peter J. Large",
                "href": "/profile/Peter-J-Large"
            },
            "answer_text": "Of course they do. If they had large numbers of failing students, their own competence might be questioned. ",
            "date": "Answered September 4, 2019",
            "views": "10",
            "upvotes": " Answer requested by Harold Scott"
        },
        {
            "author_info": {
                "name": "Ann Wead Kimbrough",
                "href": "/profile/Ann-Wead-Kimbrough"
            },
            "answer_text": "I want my students to pass my courses. They have to earn their grades. Grades are not given. ",
            "date": "Answered September 9, 2019",
            "views": "3",
            "upvotes": " Answer requested by Harold Scott"
        },
        {
            "author_info": {
                "name": "Corben Crew",
                "href": "/profile/Corben-Crew"
            },
            "answer_text": "Generally Yes, but not all of them. Honestly, some don’t even care to teach but bring in so many funds as part of being a research professor the school won’t drop them as a teacher. ",
            "date": "Answered December 9, 2019",
            "views": "35",
            "upvotes": " Answer requested by Harold Scott"
        },
        {
            "author_info": {
                "name": "Andrea Utzman",
                "href": "/profile/Andrea-Utzman-1"
            },
            "answer_text": "Why would they not? Professors are routinely evaluated by administration and students. Those with a high failure rate would not be well evaluated. ",
            "date": "Answered November 14, 2019",
            "views": "4",
            "upvotes": " Answer requested by Harold Scott"
        },
        {
            "author_info": {
                "name": "Syed Waqar Ali",
                "href": "/profile/Syed-Waqar-Ali-4"
            },
            "answer_text": "Yes to is also a test of professors. If all the students pass the exam it means he is good professor. ",
            "date": "Answered September 2, 2019",
            "views": "11",
            "upvotes": " Answer requested by Harold Scott"
        },
        {
            "author_info": {
                "name": "Elwynn Taylor",
                "href": "/profile/Elwynn-Taylor"
            },
            "answer_text": "I would like you to love my class, and 10 years later send me a letter about how it helped you in your profession. ",
            "date": "Answered April 8, 2020",
            "views": "10",
            "upvotes": " Answer requested by Harold Scott"
        },
        {
            "author_info": {
                "name": "Steve Mcguigan",
                "href": "/profile/Steve-Mcguigan-2"
            },
            "answer_text": "Of course. Their salaries are, to some extent, performance based. The more students they get through exams in their subject, the better their performance. ",
            "date": "Answered October 16, 2019",
            "views": "17",
            "upvotes": " Answer requested by Harold Scott"
        },
        {
            "author_info": {
                "name": "Terry Bahn",
                "href": "/profile/Terry-Bahn"
            },
            "answer_text": "The good ones do. Any who want to see their students fail should be fired. ",
            "date": "Answered September 8, 2019",
            "views": "6",
            "upvotes": " Answer requested by Harold Scott"
        },
        {
            "author_info": {
                "name": "Calvin Welch",
                "href": "/profile/Calvin-Welch-1"
            },
            "answer_text": "Yes they really want students to learn ",
            "date": "Answered October 14, 2019",
            "views": "3",
            "upvotes": " Answer requested by Harold Scott"
        },
        {
            "author_info": {
                "name": "Jan Williams",
                "href": "/profile/Jan-Williams-68"
            },
            "answer_text": "All the ones I have ever met do. ",
            "date": "Answered March 1, 2020",
            "views": "103",
            "upvotes": " Answer requested by Harold Scott"
        },
        {
            "author_info": {
                "name": "Jerry Gerlach",
                "href": "/profile/Jerry-Gerlach-1"
            },
            "answer_text": "yes ",
            "date": "Answered April 2, 2020",
            "views": "4",
            "upvotes": " Answer requested by Harold Scott"
        }
    ]
}