{
    "title": "Do girls fall in love in their teenage years? - Quora",
    "tags": [
        "Advice About Falling in Love",
        "Dating During the Teenage Years",
        "Dating Advice for Teenagers",
        "Falling in Love",
        "Love Life Advice",
        "Teenagers and Teenage Years",
        "Love",
        "Dating Advice"
    ],
    "response": [
        {
            "author_info": {
                "name": "Susmitha Reddy",
                "href": "/profile/Susmitha-Reddy-6"
            },
            "answer_text": "Sara was sitting at the corner table with a dim light above it blinking on and off. In front of her lies two shots of tequila escorted by two empty ones. Anyone at a distance could see her silhouette and curvy edges, but not recognize her. All embellished in her favourite red body fit of knee length, complemented with brown high heels and hair open, bangs hanging lose dropped through her forehead and curled at the edge of lips, barging into her when gulping shots. Celebrating her seventeenth birthday in solitude, she embraced the third shot and gulped in. Her seducing eyes were battling to stay awake, where she took the fourth shot with her slender fingers wiggling and struggling to stay firm. In an inebriated state, unable to stay balanced, her hands groped for phone lying inside her purple purse with a butterfly key chain hanging through the edges. Unlocking her phone in fourth attempt, her fingers fumbled through the keypad scribbling a number and in no time her forefinger landed on call button and it was ringing. With the ring, she opened her eyes wide, adjusted her composure, tucking her hair behind her neck, she leaned on the table placing her left hand on it and uttered in a sweet seducing voice, “hello.” ‘Yes’ came the voice from the other end. “Stuttering while speaking, she began, uh....mmm….hey, I am not sure if you have ever noticed me, but I know you so much. My heart flutters every time you pass by me, my eyes gleam at the sight of you, my voice drops and become numb when you talk to me, I secretly observe your movements, my knees go weak when I see you in black shirt, your cologne drives me crazy, I go mad with your thoughts, I am so in love with you, I would lose my breath to have a cup of coffee with you, even a shot of tequila is all welcome. Will you?” she blurted after 275 days of waiting to confess her feelings. At last, she mustered courage to tell him. Sara could be you, me or someone in their teens reading this. Many girls feel such emotional rush of hormones swaying, fighting, sprinting, blushing, gushing all over their body, mind and soul and it’s absolutely normal. We are humans too, we have feelings, emotions, desires, fantasies and we love too, irrespective of age. Call us crazy, but we believe in it, in eternal first loves and crushes — silly fragile souls we are. Who doesn’t want to believe in something magical? I would always. Eternal is magical too! ",
            "date": "Updated June 23, 2018",
            "views": "3",
            "upvotes": " View 18 Upvoters",
            "upvoters": [
                {
                    "user_id": "Vivek Kumar",
                    "user_href": "/profile/Vivek-Kumar-2891"
                },
                {
                    "user_id": "Sebastian",
                    "user_href": "/profile/Sebastian-355"
                },
                {
                    "user_id": "Nirmal Manoj",
                    "user_href": "/profile/Nirmal-Manoj"
                },
                {
                    "user_id": "Saurabh Kumar",
                    "user_href": "/profile/Saurabh-Kumar-784"
                },
                {
                    "user_id": "Prasanna Hosangadi",
                    "user_href": "/profile/Prasanna-Hosangadi"
                },
                {
                    "user_id": "Raghav Manglik ( राघव मांगलिक)",
                    "user_href": "/profile/Raghav-Manglik-राघव-मांगलिक"
                },
                {
                    "user_id": "Venkat Gowda",
                    "user_href": "/profile/Venkat-Gowda-9"
                },
                {
                    "user_id": "Priyadarshi Sadangi",
                    "user_href": "/profile/Priyadarshi-Sadangi"
                },
                {
                    "user_id": "Aditya Lingam",
                    "user_href": "/profile/Aditya-Lingam"
                },
                {
                    "user_id": "Shyam Shivakumar",
                    "user_href": "/profile/Shyam-Shivakumar-2"
                },
                {
                    "user_id": "Avinash Garg",
                    "user_href": "/profile/Avinash-Garg-32"
                },
                {
                    "user_id": "Ayushi Tyagi",
                    "user_href": "/profile/Ayushi-Tyagi-64"
                },
                {
                    "user_id": "Dinesh Kondra",
                    "user_href": "/profile/Dinesh-Kondra"
                },
                {
                    "user_id": "Suriya Prabha",
                    "user_href": "/profile/Suriya-Prabha-4"
                },
                {
                    "user_id": "Srinivas Gunnala",
                    "user_href": "/profile/Srinivas-Gunnala"
                },
                {
                    "user_id": "Tejashwini Muler",
                    "user_href": "/profile/Tejashwini-Muler"
                },
                {
                    "user_id": "Sejal Nagar",
                    "user_href": "/profile/Sejal-Nagar-1"
                },
                {
                    "user_id": "Shailvi Singh",
                    "user_href": "/profile/Shailvi-Singh-6"
                }
            ]
        },
        {
            "author_info": {
                "name": "S.Sreeram Naik",
                "href": "/profile/S-Sreeram-Naik"
            },
            "answer_text": "Hey, They can fall at any stage until and unless they do not have any accountable from the life. Age is a just a number and I don’t think so they are thinking about what they are doing before madly doing with something esle. Majority of the Girls falls in the love when they do not have any accountable from the life and once they became enough mature they started searching like “I want the person like Rama instead of thinking themselves I should behave like a sita”. It’s utterly my perspectives perhaps it can vary in your perspective. But, Majority of the views can be match with similar facts and reality where they used to do or think or expects from the life. I hope it helps you. Good luck and they will fall in love at any stage. ",
            "date": "Answered June 12, 2018",
            "views": "670",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Sebastian",
                    "user_href": "/profile/Sebastian-355"
                },
                {
                    "user_id": "Pulkitha",
                    "user_href": "/profile/Pulkitha"
                }
            ]
        },
        {
            "author_info": {
                "name": "Arjhun Srinivasan",
                "href": "/profile/Arjhun-Srinivasan"
            },
            "answer_text": "Absolutely YES. Girls do fall in love. Love according to me is due to the change in hormone balance which in turn creates complex chemical reactions. Due to the pressure exerted by the society they are not expressive and will keep it with them(In India). In western countries girls have the freedom to choose the right and wrong and that is the reason they are liberated and empowered. ",
            "date": "Answered August 24, 2016",
            "views": "248",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Shivam Sharma",
                    "user_href": "/profile/Shivam-Sharma-2190"
                }
            ]
        },
        {
            "author_info": {
                "name": "Akash Singh",
                "href": "/profile/Akash-Singh-1691"
            },
            "answer_text": "Simply because they don’t use their heads in their teenage its just a new experience for them. They like the idea of being in love. When they become older they start thinking about things so they chose the option that is best for them(biggest factor financial status) or they just don’t fall in love at all, its the truth about them. Another reason is by the time they grow older they start thinking about marrying so if they feel that they can’t marry the guy, they don’t date them then. ",
            "date": "Answered May 8, 2017",
            "views": "704",
            "upvotes": "0"
        }
    ]
}