{
    "title": "Do Googlers negotiate their yearly raises? - Quora",
    "tags": [
        "Salary Negotiation",
        "Googlers (Google employees)",
        "Negotiation"
    ],
    "response": [
        {
            "author_info": {
                "name": "Paul K. Young",
                "href": "/profile/Paul-K-Young-3"
            },
            "answer_text": "I don't negotiate my raises nor do I know of any coworkers that do.  A few reasons why I think this is probably uncommon: Annual raises are typically on the order of a cost-of-living adjustment.  Perf scores might have a nominal impact on this.Pay scales within levels at Google are fairly consistent.  Getting more pay at the same level will end up with you \"maxing out\" your comp for that level.  You'll still be making less than most of the people at the next level, though.Promotions are where you get the big bumps.  30%-40% is not uncommon.Managers can give discretionary bonuses for exceptional performance on specific projects.  These bonuses can be significant but are one-time events that don't affect base salary.Promo, compensation and bonuses are all based on performance.  If you don't have the performance scores its going to be very hard to justify an increase.There are some possible exceptions, although I don't know how often these happen in practice. If you have a competing offer from another company you might be able to leverage that for an increase.  This probably wouldn't happen as a part of the yearly raise, and it is unlikely that you could do it every year.If your increase is below average but you have above average scores you might be able to talk with your manager about the discrepancy and get it resolved.  Errors and inconsistencies could happen, and I'd be surprised if a manager were reluctant to amend them if they did occur.",
            "date": "Answered May 5, 2016",
            "views": "2249",
            "upvotes": " View 425 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Pereira Braga",
                    "user_href": "/profile/Pereira-Braga"
                },
                {
                    "user_id": "Jacques Innocent",
                    "user_href": "/profile/Jacques-Innocent"
                },
                {
                    "user_id": "Rafi Kamal",
                    "user_href": "/profile/Rafi-Kamal"
                },
                {
                    "user_id": "Sethuraman Ravi",
                    "user_href": "/profile/Sethuraman-Ravi-1"
                },
                {
                    "user_id": "Matt Linder",
                    "user_href": "/profile/Matt-Linder-1"
                },
                {
                    "user_id": "Abdulmalik G Aminu",
                    "user_href": "/profile/Abdulmalik-G-Aminu"
                },
                {
                    "user_id": "Repel Amersnino",
                    "user_href": "/profile/Repel-Amersnino"
                },
                {
                    "user_id": "Dalis Chan",
                    "user_href": "/profile/Dalis-Chan-1"
                },
                {
                    "user_id": "Poorva Parkhi",
                    "user_href": "/profile/Poorva-Parkhi"
                },
                {
                    "user_id": "Himanshu Mishra",
                    "user_href": "/profile/Himanshu-Mishra-886"
                }
            ]
        },
        {
            "author_info": {
                "name": "Jason Warren",
                "href": "/profile/Gone-Hiatus"
            },
            "answer_text": "Googlers do not negotiate their raises. The raises are determined by a method that I describe below, and communicated by their managers during Q4. Google attempts to award compensation in a scientific way: Google studies compensation at other companies in each region to determine the distribution of what other employees at equivalent levels of similar jobs are being paid in that region.Google sets a target compensation for each level of each job type in each region. It is generally Google’s intent to set this target at the top of the market.Google has a model that determines your new compensation as a percentage of your target compensation based on two inputs: a) your calibration scores (i.e. your performance) and b) the ratio between your current compensation, and your target compensation.Managers have some discretionary money that they can move around. Each manager can be overruled by the next level. Salaries can move up or down.Promotions target a particular percentage of the target level in your new position. They try to keep the raise between 5% and 20%.",
            "date": "Answered May 15, 2016",
            "views": "55",
            "upvotes": " View 27 Upvoters",
            "upvoters": [
                {
                    "user_id": "Bob See",
                    "user_href": "/profile/Bob-See"
                },
                {
                    "user_id": "Bin Lu",
                    "user_href": "/profile/Bin-Lu-1"
                },
                {
                    "user_id": "Son Mai",
                    "user_href": "/profile/Son-Mai-20"
                },
                {
                    "user_id": "Eric Yap",
                    "user_href": "/profile/Eric-Yap-5"
                },
                {
                    "user_id": "Andre Holzner",
                    "user_href": "/profile/Andre-Holzner"
                },
                {
                    "user_id": "Eniola Orunto",
                    "user_href": "/profile/Eniola-Orunto"
                },
                {
                    "user_id": "Aaron Spaulding",
                    "user_href": "/profile/Aaron-Spaulding-5"
                },
                {
                    "user_id": "Evan Becker",
                    "user_href": "/profile/Evan-Becker-9"
                },
                {
                    "user_id": "Tim Schneider",
                    "user_href": "/profile/Tim-Schneider-93"
                },
                {
                    "user_id": "Lakshay Sood",
                    "user_href": "/profile/Lakshay-Sood"
                }
            ]
        }
    ]
}