{
    "title": "Do I have to copyright a published story? - Quora",
    "tags": [
        "Intellectual Property Law",
        "Copyright Infringement",
        "Copyright Law",
        "Publishing"
    ],
    "response": [
        {
            "author_info": {
                "name": "Travis Casey",
                "href": "/profile/Travis-Casey-4"
            },
            "answer_text": "No. Copyright is automatic under the Berne convention, so unless you’re in one of the few countries that aren’t signatories to it, you don’t have to take any action to copyright it. Further, since it has been published, you should have proof of when it was published. Now, in many countries — including the US — registering your copyright gives you additional legal protections. However, it is not required to do so, and you still have copyright even if you do not register it. ",
            "date": "Answered May 12, 2017",
            "views": "38",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Rin Faraday",
                    "user_href": "/profile/Rin-Faraday"
                }
            ]
        },
        {
            "author_info": {
                "name": "David Mullich",
                "href": "/profile/David-Mullich"
            },
            "answer_text": "In any country that’s a signatory of the Berne Convention, your literary work is automatically given copyright protection as soon as it is fixed in a tangible medium, such as paper or a computer file. You may also choose to register your copyrighted work with your country’s copyright office, which an give you additional benefits as well as a record of your copyright ownership of the work. In the United States, those benefits include the eligibility to collect statutory damages, should you successfully sue someone for copyright infringement. ",
            "date": "Answered May 9, 2017",
            "views": "304",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Rin Faraday",
                    "user_href": "/profile/Rin-Faraday"
                },
                {
                    "user_id": "Ahmar",
                    "user_href": "/profile/Ahmar-2"
                },
                {
                    "user_id": "Arjun Sharma",
                    "user_href": "/profile/Arjun-Sharma-232"
                }
            ]
        }
    ]
}