{
    "title": "Do modern day peasants exist? - Quora",
    "tags": [
        "Modern Day Peasants",
        "Medieval Peasant",
        "Peasants",
        "Modern Times",
        "Modern Society",
        "Middle Ages (era)",
        "Existence",
        "Religion",
        "History",
        "Philosophy of Everyday Life"
    ],
    "response": [
        {
            "author_info": {
                "name": "Alberto Lugo",
                "href": "/profile/Alberto-Lugo-14"
            },
            "answer_text": "The peasants still exist, but not as we could imagine them. It can be the newspaper seller, the one who polish shoes, and so many others. But there is a difference, even in the worst place they live, they all know that they have the chance to progress, to change, to evolve. In the middle ages this chance didn´t exist. You will born a peasant and you will die a peasant. Even the Church used to teach that peasants have to be happy with their origin and stay as that. Although there were some that took the chance to change their destiny, those occurrences were rare. In these days a peasant can study, and with hard work, he can be a doctor, a scientist or whatever he wants. Because what matters is his mind, not his birth origin. Maybe I was a peasant, but I studied, got my degree, got a job and retired. I fulfilled some of my dreams. ",
            "date": "Answered August 24, 2019",
            "views": "224",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Adela Jazvin",
                    "user_href": "/profile/Adela-Jazvin"
                },
                {
                    "user_id": "Tashfiq Bashar",
                    "user_href": "/profile/Tashfiq-Bashar"
                }
            ]
        },
        {
            "author_info": {
                "name": "Will Linden",
                "href": "/profile/Will-Linden"
            },
            "answer_text": "Understand that “peasant” and it’s cognate words have varying connotations. In some countries it just means anyone who works the land. My great-great-grandfather Rudolf, a German aristo of the worst type, shocked everyone in the family by marrying a peasant. For her money. ",
            "date": "Updated March 7, 2020",
            "views": "136",
            "upvotes": "0"
        }
    ]
}