{
    "title": "Do native English speakers need to recite articles to improve their writing skills? - Quora",
    "tags": [
        "English as a Second Language (ESL)",
        "Learning English"
    ],
    "response": [
        {
            "author_info": {
                "name": "Nina Rimon Davis",
                "href": "/profile/Nina-Rimon-Davis"
            },
            "answer_text": "On the whole, I agree with the previous answers: reciting articles sounds like a strange way to get a person to improve his/her writing skills.However, since you posted the question, I assume you (or others you know) have been asked to do just that. I'll further assume, then, that the teacher (or whoever) has been assigning this task has a reason for doing so. I will take a stab at guessing what this reason is: When you study and recite good texts, some good phrases and expressions might stick in your memory. Such phrases may be useful not only for public speaking, as suggested above, but also in writing. It depends on the nature and the quality of the articles.  On the whole, I believe it is easier to memorize bits of poetry or passages from plays (monologues, most likely). But poetic and dramatic phrases, while they may be beautiful and appealing, aren't very useful in everyday life. When in high-school (in Israel), we studied Julius Caesar in English class. My friends were quite smitten with some of the phrases, and especially liked to call out to each other: \"Beware the ides of March!\". Which was fun, but not much good if you're traveling to an English speaking country and want to talk to the bus/train conductor or a waiter at a restaurant :-) Which brings us back to articles.If they are interesting, well-written and contain lots of idioms, maybe memorizing them will help you internalize certain patterns (sentence structure) and remember some idioms. And then, hopefully, when you are a situation where you need to speak English, these idioms might pop up easily and you'll be able to incorporate them in your conversation.To make this memorizing task -- which sounds rather tedious -- more efficient, it would be nice if a native speaker could highlight for you such idioms and phrases. You could then concentrate on them when memorizing the text. If you must memorize such texts anyway, then you might as well make the most of it. Good luck! ",
            "date": "Answered January 4, 2015",
            "views": "12",
            "upvotes": " View 5 Upvoters",
            "upvoters": [
                {
                    "user_id": "Yidui Dai",
                    "user_href": "/profile/Yidui-Dai"
                },
                {
                    "user_id": "Jack Wong",
                    "user_href": "/profile/Jack-Wong-64"
                },
                {
                    "user_id": "Yair Glick",
                    "user_href": "/profile/Yair-Glick"
                },
                {
                    "user_id": "Franz Wagener",
                    "user_href": "/profile/Franz-Wagener"
                },
                {
                    "user_id": "Wu Zhe",
                    "user_href": "/profile/Wu-Zhe-11"
                }
            ]
        },
        {
            "author_info": {
                "name": "Derek Harkness",
                "href": "/profile/Derek-Harkness"
            },
            "answer_text": "Did you learn Chinese by reciting Chinese articles? When working in your native language, you learn to listen and then speak first. Later you learn to read and write. At kindergarten you might recite some nursery rhythms, later maybe some poems and in high school you'll recite Shakespeare. However, the reciting is not for improving writing, it is for improving your reading and your depth of language. If you want to improve your writing skills, you need to write. In English schools we write essays, short stories, reviews and other kinds of articles. The teachers assesses them, marks corrections and then assigns another writing task. If you write regularly in English and have someone check your writing, then your writing skill will improve. A good way to do this might be to write answers on Quora and leave a note at the end asking people to edit corrections for you or leave comments. Reading the corrections, learning form them, then writing another and another answer will surely improve your English writing skills quickly. ",
            "date": "Answered December 27, 2014",
            "views": "16",
            "upvotes": " View 12 Upvoters",
            "upvoters": [
                {
                    "user_id": "Jeff Yang",
                    "user_href": "/profile/Jeff-Yang-107"
                },
                {
                    "user_id": "Xingchen Ma",
                    "user_href": "/profile/Xingchen-Ma"
                },
                {
                    "user_id": "Alvin Wong",
                    "user_href": "/profile/Alvin-Wong-86"
                },
                {
                    "user_id": "Sangel Wu",
                    "user_href": "/profile/Sangel-Wu"
                },
                {
                    "user_id": "Pan Li",
                    "user_href": "/profile/Pan-Li-21"
                },
                {
                    "user_id": "StoneFang",
                    "user_href": "/profile/StoneFang"
                },
                {
                    "user_id": "Anne W Zahra",
                    "user_href": "/profile/Anne-W-Zahra"
                },
                {
                    "user_id": "Shatabdee Subhadarshinee",
                    "user_href": "/profile/Shatabdee-Subhadarshinee-1"
                },
                {
                    "user_id": "Nina Rimon Davis",
                    "user_href": "/profile/Nina-Rimon-Davis"
                },
                {
                    "user_id": "Daniel Dsu",
                    "user_href": "/profile/Daniel-Dsu"
                },
                {
                    "user_id": "Anke Zhang",
                    "user_href": "/profile/Anke-Zhang-1"
                },
                {
                    "user_id": "Wu Zhe",
                    "user_href": "/profile/Wu-Zhe-11"
                }
            ]
        },
        {
            "author_info": {
                "name": "Frank Dauenhauer",
                "href": "/profile/Frank-Dauenhauer"
            },
            "answer_text": "The original question is: Do native English speakers need to recite articles to improve their writing skills? Cause we Chinese need to recite many articles to improve our writing skills Answer: I answered an almost identical question at: Frank Dauenhauer's answer to Do native English speakers recite (memorize) articles? Is there some great articles for learners to memorize? That answer should provide you with the information you are looking for.  ",
            "date": "Answered March 22, 2016",
            "views": "662",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "StoneFang",
                    "user_href": "/profile/StoneFang"
                }
            ]
        }
    ]
}