{
    "title": "Do personality types influence literary writing style? - Quora",
    "tags": [
        "Behavioral Psychology",
        "Creative Writing",
        "Literature",
        "Character and Personality"
    ],
    "response": [
        {
            "author_info": {
                "name": "Lucie Zhang",
                "href": "/profile/Lucie-Zhang"
            },
            "answer_text": "OF COURSE OF COURSE! The way our brains work based on our personality type shows itself when we extract it into a hobby..whether the function is introversion or extroversion, perceiving or judging. There are patterns everywhere. I know an ENFJ that colors her work with the emotions of others and the emotions she has for them. I know an ISFJ that writes with a descriptive storyline, focused on events. I know an ISFP that writes with many adjectives (ie: fuzzy pink purse). I know an INFP that likes to describe her emotions through adverbs and by doing so, she creates a world of personas she wishes to be through that very writing. Anyway, the list goes on.  Everything is a reflection of our personality, our inner thoughts and feelings, whether we are conscious of it or not. What better way to put that into reality than writing? Just as the weather influences how we feel, and how the people around us either deter us from, or inspire us to be our true selves, our personality completely and utterly and wholeheartedly affects the way we write. And that's wonderful, because that means we can never hide from ourselves when we write. We are always seeing a much clearer truth of ourselves. ",
            "date": "Answered November 8, 2013",
            "views": "1",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Alana Dowling",
                    "user_href": "/profile/Alana-Dowling-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Stan Hayward",
                "href": "/profile/Stan-Hayward-1"
            },
            "answer_text": "There is a common assumption in the Quora questions on writing that 'Writers' work in one area.  It is common for journalists to write novels. Also for novelists to write screenplays. Professional writers write for markets, whereas amateur writers do it for self-expression. At different times I have written a TV/book series for pre-school children. I have written several books on Animation and Computer graphics. I was once an advertising copywriter. I have written comic strips for children, and newspaper strips for adults. I currently write educational blogs for teachers, and on the Police Services for young people. Each form requires a different approach to the target audience. Each form will have its own style. The style is not how the writer thinks necessarily, but how the market for the work is percieved. Writing might well be compared to Architecture where the architect asks what purpose the building must serve before designing it.  The Writer's style developes over time as certain phrases and grammatical habits fall into place easily, and become recognisable, but more importantly it is how a writer organises their work. It is the pattern and flow of ideas that are commonly consistent rather than an imposed style. MakeMovies Database ",
            "date": "Updated November 6, 2014",
            "views": "16",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Sumit Kaushik",
                    "user_href": "/profile/सुमित-कौशिक-Sumit-Kaushik"
                },
                {
                    "user_id": "Horatio McGee",
                    "user_href": "/profile/Horatio-McGee"
                },
                {
                    "user_id": "Robert Charles Lee",
                    "user_href": "/profile/Robert-Charles-Lee"
                }
            ]
        },
        {
            "author_info": {
                "name": "C.S. Friedman",
                "href": "/profile/C-S-Friedman"
            },
            "answer_text": "Not if you’re good. A *good* writer has a full toolkit as his disposal, including the techniques that all types of people naturally do well, and he writes each story as that story requires. Different audiences require different storytelling techniques, and he adjusts his style accordingly, He’s not pouring words onto paper expressing his inner soul; he’s consciously crafting a story in which the ability to understand different human personalities and express them on paper is as crucial a skill as a painter mixing colors. Is a painter whose favorite color is blue incapable of painting in red? My high fantasy does not read like my science fiction, which is in a different style than my YA. I’ve written male POV and female POV characters, young and old, extrovert and introvert, and even characters with severe mental illness. Hell, I’ve written alien POVs. Nowhere in there can you make any generalization about me as a person, save that I really, really like sentence fragments. My JOB is to write about my characters and not about me, and to present their stories in whatever styles give their stories the most power, PS I find it interesting that thus far, the professional writers have all answered no, while the non-professional-writers have answered yes ",
            "date": "Answered July 17, 2016",
            "views": "498",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Horatio McGee",
                    "user_href": "/profile/Horatio-McGee"
                }
            ]
        },
        {
            "author_info": {
                "name": "Robert Charles Lee",
                "href": "/profile/Robert-Charles-Lee"
            },
            "answer_text": "Not if you're writing for a living. Your target writing market influences your literary style more than anything else. I've worked as a technology journalist, and the style is considerably different from the style when I was a financial journalist. For myself, I wrote two non-fiction books, both related to photography, so my literary style again was different from the writing I do for my blog, which is relatively more a case of self-expression for me. That's basically the general truth of the matter -- the end use of the writing seems more important as a factor. ",
            "date": "Answered March 22, 2015",
            "views": "693",
            "upvotes": "0"
        }
    ]
}