{
    "title": "Do we get paid if someone installs our app in the Google Play Store? If so how much money are we paid for each download? - Quora",
    "tags": [
        "Google Play",
        "Android Applications",
        "Android (operating system)"
    ],
    "response": [
        {
            "author_info": {
                "name": "Sidhartha Bajpai",
                "href": "/profile/Sidhartha-Bajpai"
            },
            "answer_text": "Yes thay do, You get more if you allow them to put ads. The first step in publishing is to register for Google Play at the Google Play publisher site. The process is relatively straightforward and should only take you a few minutes. Note: There is a $25 USD charge to register. If you want to sell your apps, instead of offering them for free with ads, you also need to set up a Google Wallet Merchant account as described in the Getting Started with Publishing article in Google Play's help. Please see the link below. Redirecting... ",
            "date": "Answered September 14, 2016",
            "views": "31",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Roy",
                    "user_href": "/profile/Roy-282"
                }
            ]
        },
        {
            "author_info": {
                "name": "Meghraj Singh Beniwal",
                "href": "/profile/Meghraj-Singh-Beniwal"
            },
            "answer_text": "When your app is listed as free then there is no earning but if you have published your app with some price then definitely you gonna earn on each download. As per the google agreement you will receive 70% of the total cost that you have decided for your app while 30% goes to google for their service. To help you control your earning google provides you a wallet account through which you can see all transactions related to your applications and if your earning goes beyond the threshold which is $100, you can transfer the sum to your own bank account. ",
            "date": "Answered May 2, 2015",
            "views": "48",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Ajeet Sandela",
                    "user_href": "/profile/Ajeet-Sandela"
                },
                {
                    "user_id": "Abhishek Kaginkar",
                    "user_href": "/profile/Abhishek-Kaginkar"
                }
            ]
        },
        {
            "author_info": {
                "name": "Sushil Upadhyay",
                "href": "/profile/Sushil-Upadhyay-3"
            },
            "answer_text": "for free app there is no thing like u get paid per downloadbut if its free then u get paid per download after google cut... Side income i created app for cracking java OCJP /SCJP Java OCJP + - Android Apps on Google Play  App which contain more than 850+ question with explanations . More than 300+ interview questions . More than 300+ java programs. I earn 1$-.05 $ /day with around 1k impression My retention rate is 70 % ",
            "date": "Updated September 4, 2016",
            "views": "28",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Beatrice Mukui.",
                    "user_href": "/profile/Beatrice-Mukui"
                }
            ]
        },
        {
            "author_info": {
                "name": "Mia Khalifa",
                "href": "/profile/Mia-Khalifa-2"
            },
            "answer_text": "You can earn with your app in two ways either by making app paid version or by advertising in your app. www.baatkar.com Thanks ",
            "date": "Answered May 2, 2015",
            "views": "771",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Pranav Mahajan",
                "href": "/profile/Pranav-Mahajan-68"
            },
            "answer_text": "Actually the developers of the app earn by posting ads when you use the app. They are paid by the concerned people to show the ads . ",
            "date": "Answered April 26, 2017",
            "views": "390",
            "upvotes": "0"
        }
    ]
}