{
    "title": "Do writers encourage fanfiction? - Quora",
    "tags": [
        "Fanfiction",
        "Writers and Authors"
    ],
    "response": [
        {
            "author_info": {
                "name": "Mercedes R. Lackey",
                "href": "/profile/Mercedes-R-Lackey"
            },
            "answer_text": "Some do, some don’t. Some “allow” it as long as no one uses existing characters. Some say “anything goes.” Some hate it, and send their agents or even a lawyer to shut it down whenever it appers. You should be aware that technically you have no right to create fanfiction, and legally a creator has every right to shut you down. That said, I personally am in favor of it, but I will never, ever read it, because of the debacle Marion Zimmer Bradley got into with a writer of fanfiction who did something she liked with one of her existing characters. As was usual for Marion and Darkover fanfiction, she told the author she liked the idea, and was going to use it in her next novel and give her credit for the idea in the acknowledgements, as she had done several times before with other writers. The crazed fanfiction author, who by that point had gotten an agent who should have known better (you cannot copyright, trademark, or plagiarize an “idea”), then demanded full co-writer credit and half the money. Marion abandoned the book rather than deal with a lunatic, which caused all sorts of problems with the publisher, who was expecting that book and had put things into production already. Frankly, Marion was nicer than I would have been. My solution has been to allow fanfiction under Creative Commons, but refuse to read it. That’s the solution for many others who allow it. ",
            "date": "Answered January 1, 2020",
            "views": "154",
            "upvotes": " View 1.2K Upvoters ",
            "upvoters": [
                {
                    "user_id": "Random - Misity",
                    "user_href": "/profile/Random-Misity"
                },
                {
                    "user_id": "Cooper Williams",
                    "user_href": "/profile/Cooper-Williams-67"
                },
                {
                    "user_id": "Azeem P. Thrithala",
                    "user_href": "/profile/Azeem-P-Thrithala"
                },
                {
                    "user_id": "Indigo Ferret",
                    "user_href": "/profile/Indigo-Ferret"
                },
                {
                    "user_id": "Riya Joshi",
                    "user_href": "/profile/Riya-Joshi-147"
                },
                {
                    "user_id": "Wydianne Van Megen",
                    "user_href": "/profile/Wydianne-Van-Megen-2"
                },
                {
                    "user_id": "Maria Echica",
                    "user_href": "/profile/Maria-Echica"
                },
                {
                    "user_id": "Pius Cornetus",
                    "user_href": "/profile/Pius-Cornetus"
                },
                {
                    "user_id": "Emily Bowman",
                    "user_href": "/profile/Emily-Bowman-62"
                },
                {
                    "user_id": "Bosca Fabian",
                    "user_href": "/profile/Bosca-Fabian"
                },
                {
                    "user_id": "Lily Tabb",
                    "user_href": "/profile/Lily-Tabb"
                },
                {
                    "user_id": "RC McKee",
                    "user_href": "/profile/RC-McKee"
                },
                {
                    "user_id": "K Wilmore",
                    "user_href": "/profile/K-Wilmore"
                },
                {
                    "user_id": "John Fishback",
                    "user_href": "/profile/John-Fishback-1"
                },
                {
                    "user_id": "Alex Bradley",
                    "user_href": "/profile/Alex-Bradley-62"
                },
                {
                    "user_id": "Chuck Matthews",
                    "user_href": "/profile/Chuck-Matthews"
                },
                {
                    "user_id": "Yashasvini Soni",
                    "user_href": "/profile/Yashasvini-Soni"
                },
                {
                    "user_id": "Debolina Chatterjee",
                    "user_href": "/profile/Debolina-Chatterjee-13"
                },
                {
                    "user_id": "Robin Wyatt",
                    "user_href": "/profile/Robin-Wyatt-6"
                },
                {
                    "user_id": "Shlomo Meislin",
                    "user_href": "/profile/Shlomo-Meislin"
                }
            ]
        },
        {
            "author_info": {
                "name": "David Lascelles",
                "href": "/profile/David-Lascelles"
            },
            "answer_text": "Some do and others don’t. I learned this at a Kaffeklatch with Frances Hardinge at Eastercon in 2019, where she was asked where she stood in terms of fan fic. She, by the way, is strongly in favour of it. She also mentioned that many others are not. Those who do support it, see it as both a way of getting more publicity for their work (because readers of fan fiction might go out to buy the original source material having read it) and/or seeing it as validation - in a sort of ‘you aren’t really famous unless someone is shipping your characters on a fan fiction forum’ way. Those who don’t see it as copyright violation and some of those will pursue it legally (though so long as the copyrighted IP is not being used to make profit I believe there is little point in that and the risk of negative publicity is high*). Note, even those who support and encourage fan fic will very likely take legal action if someone tried to sell said fan fiction, or at least their publisher will. Imitation is the sincerest form of flattery but not if you are trying to make money from it. Note that EL James’s Twilight fan fic had to be changed dramatically before it could be published. I’m not a follower of fan fiction sites (barely have time to write my own original works never mind trying to write using other IPs) but I have heard there are resources on those that list which authors support fan fic and which don’t. it is worth checking out these lists before making a start on any fan fic if you want to avoid annoying the original author and getting a lawyer letter. *A friend of mine once ran a LRP based on the Conan novels - basically a fantasy LRP game set in a world of barbarians and thieves called Hyborean Tales. He got a lawyer letter from the Robert E Howard estate in the US - essentially a cease and desist or pay portion of profits demand. He replied with evidence of the non profit making aspect of his endeavour and they never followed it up. They obviously realised it would cost them more to pursue this than they would gain. ",
            "date": "Answered January 1, 2020",
            "views": "216",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Jesse Bijl",
                    "user_href": "/profile/Jesse-Bijl-3"
                },
                {
                    "user_id": "Rose Walker",
                    "user_href": "/profile/Rose-Walker-137"
                },
                {
                    "user_id": "James H. Jenkins",
                    "user_href": "/profile/James-H-Jenkins"
                },
                {
                    "user_id": "Thomas P. Buehner",
                    "user_href": "/profile/Thomas-P-Buehner"
                }
            ]
        },
        {
            "author_info": {
                "name": "Dave Payton",
                "href": "/profile/Dave-Payton-1"
            },
            "answer_text": "Thanks for the A2A. As some have stated: Some writers do, others do not. While I do not encourage fanfiction (and I do not read it) on the whole, I do not deny that it has had value for many writers, who later became accredited in various IP’s we know and love today, such as Star Trek (franchise). As a writer/author, I would not allow fan creations of my works, unless such works were made specifically for fans to do something with. For example, if I wrote a book in a specific universe, released all of the lore I made for it, in another book, and specifically said that people were free to use the material, as long as they maintain credit to me in their disclaimer, and made clear it was a fan work. Another example in my case would be, if I decided to release one of my IP’s into the creative commons. I don’t think many authors have done that, but I could definitely see the benefits of doing so, given the right situation. As you might guess: I would never read such fan works myself. ",
            "date": "Answered January 2, 2020",
            "views": "66",
            "upvotes": " Answer requested by Ray Housan",
            "upvoters": [
                {
                    "user_id": "Alex Bradley",
                    "user_href": "/profile/Alex-Bradley-62"
                },
                {
                    "user_id": "Shana Chen",
                    "user_href": "/profile/Shana-Chen-3"
                },
                {
                    "user_id": "Alex Cherry",
                    "user_href": "/profile/Alex-Cherry-2"
                },
                {
                    "user_id": "James H. Jenkins",
                    "user_href": "/profile/James-H-Jenkins"
                }
            ]
        },
        {
            "author_info": {
                "name": "Rose Walker",
                "href": "/profile/Rose-Walker-137"
            },
            "answer_text": "I believe as long as you’re not selling fanfiction without permission from the author of the original work then do what you want. If someone wants to write fanfiction of my work, then cool! I want to read it. :D Fanfiction writers have a habit of shipping characters and putting in wacky sex scenes. My stories already have sex scenes so I want to know how far they’ll push it. ",
            "date": "Answered January 4, 2020",
            "views": "23",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Stephanie Van Dyke",
                "href": "/profile/Stephanie-Van-Dyke-3"
            },
            "answer_text": "Some do and some don’t. It depends on which writer who allows their fans to write Fan Fictions of their works. There are a couple who allow it such as J.K. Rowling and Stephen King but some writers are against it such as Anne Rice and George R.R. Martin. ",
            "date": "Answered January 1, 2020",
            "views": "68",
            "upvotes": " View 4 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Alex Bradley",
                    "user_href": "/profile/Alex-Bradley-62"
                },
                {
                    "user_id": "Alex Cherry",
                    "user_href": "/profile/Alex-Cherry-2"
                }
            ]
        },
        {
            "author_info": {
                "name": "Joshua Stone",
                "href": "/profile/Joshua-Stone-104"
            },
            "answer_text": "Depends on the author, depends on the fanfiction. J.K. Rowling encourages fanfiction in the Hogwarts universe, as long as the content stays kid-friendly and she is not credited with the innovations. However, some authors ask fanfic platforms to remove content based on their creations. Orson Scott Card, author of the Enderverse and several fantasy books, actively discourages fanfiction on principle. He believes writers should develop their own universes, without relying on the works of other authors. ",
            "date": "Answered January 2, 2020",
            "views": "69",
            "upvotes": " View 2 Upvoters "
        },
        {
            "author_info": {
                "name": "Terry Darwin",
                "href": "/profile/Terry-Darwin-1"
            },
            "answer_text": "Do writers encourage fanfiction? It’s not something I would write. Regardless of potential legal issues, I would prefer the feeling that it’s my own work and not a rip-off of someone else’s. Many works give inspiration to other writers, but I feel that fan fiction crosses the line. ",
            "date": "Answered May 24, 2020",
            "views": "16",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Elena Piatti",
                "href": "/profile/Elena-Piatti"
            },
            "answer_text": "It depends. George RR Martin would happily murder all fanfictioners in real world, if that didn’t have legal consequences. Neil Gaiman will tell you to play and have fun. I assume between the two extremes there is the whole spectrum of behaviours. Your best option is to check the single author and see if they’re sue-happy, and avoid writing about their work. Yes, probably they’ll never find yours. But why risk a trial? ",
            "date": "Answered January 4, 2020",
            "views": "95",
            "upvotes": " Answer requested by Ray Housan"
        }
    ]
}