{
    "title": "Do writers admire their own work? - Quora",
    "tags": [
        "Admiration"
    ],
    "response": [
        {
            "author_info": {
                "name": "Abhishek Shukla",
                "href": "/profile/Abhishek-Shukla-89"
            },
            "answer_text": "YES, they definitely do. Many a times you just have a little thought in your mind, which you want to convey. You don’t know how you will, when you will, what words you’ll be using, how much or how less you’ll write about it, and how it then would be perceived by readers. You just carry that thought with yourself. Then after a lot of reading, changing perspective, varying mood, you finally discover the way you’ll convey it. And then you do. You write a poetry, or a story, or a novel, whichever suits the thought or whichever you’re comfortable writing with. And this whole process can take even weeks or months or maybe years. That one little thought you had, lived with you, survived through time and then finally came out the way you wanted it to be. It sometimes gives such an awesome feeling that you start to admire your own work. Although its not necessary that you always will like or admire your work. It can even go totally wrong at times and leaves you with certain dissatisfaction and self- depreciateive thoughts. Personally, there are a few poetry of mine which I admire a lot and I feel proud to write them the way they are. So yes, writers do admire and love their own work. I hope this answers your question. ",
            "date": "Answered October 28, 2016",
            "views": "320",
            "upvotes": " Answer requested by Ish Kool",
            "upvoters": [
                {
                    "user_id": "Rajat Srivastava",
                    "user_href": "/profile/Rajat-Srivastava-95"
                },
                {
                    "user_id": "Ramya",
                    "user_href": "/profile/Ramya-444"
                },
                {
                    "user_id": "Ish Kool",
                    "user_href": "/profile/Ish-Kool"
                }
            ]
        },
        {
            "author_info": {
                "name": "Aayush Das",
                "href": "/profile/Aayush-Das"
            },
            "answer_text": "When it's still an idea, yes. Every single time. Then somebody gives us a reality check and we start believing that it is absolute crap. The second stage is writing, and it always feels like we are underperforming. The story is far far better in the head than it ever is on paper. Stage three is the editing stage. And every work worth its salt goes through countless edits and revisions. By the time that happens, we've read the damn thing so many times that we can't bear to read even one chapter again. But generally, we do have moments when we sit back and admire our work. This is Aayush Das. I write because it matters! ",
            "date": "Answered October 28, 2016",
            "views": "231",
            "upvotes": " View 3 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Ish Kool",
                    "user_href": "/profile/Ish-Kool"
                }
            ]
        },
        {
            "author_info": {
                "name": "Anubhooti Jain",
                "href": "/profile/Anubhooti-Jain"
            },
            "answer_text": "Generally, yes! Writers are critiques, real hard one at that. So, they keep on improvising until and unless they are satisfied. They want a piece to be perfect. I will take my dad for example. He writes poems and stuff. So, when he writes, he won’t publish it (on Facebook) until and unless he is completely satisfied with it. And by satisfied I mean that he would read through the whole thing and deliberate upon each and every word. So, we can conclude, that a writer, in general cases, won’t declare a piece of work complete until he is fully satisfied with it. And satisfaction brings admiration. So, yeah! Writers do admire the stuff they write. After all, you can expect your readers to like your work only when you admire it. PS: Thanks for the A2A,Ish Kool ",
            "date": "Answered October 28, 2016",
            "views": "209",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Ish Kool",
                    "user_href": "/profile/Ish-Kool"
                }
            ]
        },
        {
            "author_info": {
                "name": "Beth Goldowitz",
                "href": "/profile/Beth-Goldowitz"
            },
            "answer_text": "Like any artist, a writer has to perform a balancing act. I think of it as one between ego and critic. It is important to like your work, to think it is good enough to share with the world, or you will never be able to get it out there for people to read. You need to have a strong ego to deal with the rejection that every artists copes with, even after their work is popular. But you also need to be your own worst critic, to maintain standards in your writing and know when things need editing or re-writing, the same way a painter or actor needs to critique their own work, or solicit honest opinions from others.. ",
            "date": "Answered October 28, 2016",
            "views": "67",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Priya Baid",
                "href": "/profile/Priya-Baid-4"
            },
            "answer_text": "It’s a very thought provoking question, sometimes writers do admire their own work especially if it surprises them pleasantly. Like for someone who’s always written about the serious aspects of life, a humorous verse penned by them will surprise them and maybe they’ll even admire it for its uniqueness. Such instances are rare in my case though! ",
            "date": "Answered October 28, 2016",
            "views": "107",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Sathish Kumar S",
                    "user_href": "/profile/Sathish-Kumar-S-55"
                }
            ]
        },
        {
            "author_info": {
                "name": "Avinash Rao",
                "href": "/profile/Avinash-Rao-25"
            },
            "answer_text": "They will, obviously. One cannot run away from admiring their own creation. But it also essential for the writer, I believe, to be the harshest critic of his or her own work. I, as a write, believe that although it is my mind that churned out those words I made into a book, it is not perfect. There is always a room for getting better and such criticism after the book is released will only help the writer achieve greatness. Every writer can be great, it all depends on what he or she is willing to do. That's why I think it is necessary for every author to read his or her own book after it is released. ",
            "date": "Answered October 28, 2016",
            "views": "76",
            "upvotes": " Answer requested by Ish Kool"
        },
        {
            "author_info": {
                "name": "Nidhi Patel",
                "href": "/profile/Nidhi-Patel-169"
            },
            "answer_text": "Yes they absolutely do. When I write a poem or a Muse, I go through each word to make sure that it conveys what it is written for. There are times when I look back to what I wrote and those words stir up emotions inside me. This brings in the awe element and I just love it when it happens. So yes I do admire my work and it happens with every writer. ",
            "date": "Answered October 28, 2016",
            "views": "95",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Vidhosha V",
                "href": "/profile/Vidhosha-V"
            },
            "answer_text": "I am not much of a big writer but I admire the small works that I do!! For that matter any artist themselves admire the work that they do, sometimes we would boast about a wonderful verse we wrote, wonderful art work that we do its all an outcome of the admiration. Definitely no one can admire an art work more than it’s creator because the artist would know every small minute thing he has did to his piece of work. ",
            "date": "Answered October 28, 2016",
            "views": "130",
            "upvotes": " View 1 Upvoter "
        },
        {
            "author_info": {
                "name": "Sankalp Kohli",
                "href": "/profile/Sankalp-Kohli"
            },
            "answer_text": "As a writer I can say that yes they do :) ",
            "date": "Answered October 28, 2016",
            "views": "23",
            "upvotes": " Answer requested by Ish Kool"
        },
        {
            "author_info": {
                "name": "Ravish Raj",
                "href": "/profile/Ravish-Raj-17"
            },
            "answer_text": "Yea ",
            "date": "Answered October 28, 2016",
            "views": "27",
            "upvotes": " Answer requested by Ish Kool"
        }
    ]
}