{
    "title": "Do you agree that blackwashing fictional characters after decades of being white is not profounding to anyone? Isn't it easier to simply write new characters who happens to be black? - Quora",
    "tags": [
        "Blackwashing",
        "Fictional Characters",
        "Race and Ethnicity"
    ],
    "response": [
        {
            "author_info": {
                "name": "John Hudson",
                "href": "/profile/John-Hudson-158"
            },
            "answer_text": "Question: Do you agree that blackwashing fictional characters after decades of being white is not profounding to anyone? Isn't it easier to simply write new characters who happens to be black? Answer: Comics, Marvel universes, and indeed Star Trek universes etc. really aren’t my thing. Reality is stranger than fiction and quite sufficiently entertaining for me. However, your question includes important sociological implications which do interest me. In principle I agree with you - completely and without reservation. I’m not quite sure whether Blackwashing is insulting, or at least shows someone is trying. In practice, real life is rather more complex than fictional universes. It isn’t so easy to establish new characters, new brand names, new images and to obtain new followings for them. Marvel / DC Comics etc, pays millions to acquire the rights to a whole host of characters. Why do they pay that sort of money if they could just create new characters from scratch? Because it really isn’t easy to just create new characters from scratch. It’s often better to buy an established character with a proven following and readership base, and then tweak them. Tweak them a lot in some cases. There’s also a thing called brand coverage. You want to make sure that all possible reader interest groups are covered. Some readers want one thing, and some want another. You want to make sure you have a range of suitable comics and characters to suit everyone. That means you have to shift some characters whose appeal overlaps and tweak them. Maybe you can introduce a new character to do the job. But you need to be careful; you don’t want them competing with a readership group who are already satisfied with another superhero, else you are competing with yourself and cutting your own profits. There’s no proven foolproof recipe, but that’s why it’s an art not a science. So -in principle I don’t like blackwashing. In practice it’s possible that DC Comics / Marvel know their industry and made a tough decision that was the lesser of two evils. After all, every time you write off a character and try and replace him / her with another one, you are also writing off everything you spent acquiring that character and building up his name recognition and following. That’s not something you want to do too often if you can avoid it. Why do you think James Bond has been going for 50 years, and has only recently been rebooted with Casino Royal? Why does Dr Who keep regenerating? Because the brand name is valuable. Sure you can come up with Triple X instead, but … Easier to come up with a blond James Bond than start from scratch. And easier to blackwash an existing character than start from scratch. Reality is a lot more complex that Marvel Universes. Hope these thoughts help. ",
            "date": "Answered November 27, 2018",
            "views": "886",
            "upvotes": " View 2 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Matt Daley",
                    "user_href": "/profile/Matt-Daley-6"
                },
                {
                    "user_id": "Milan Vukotic",
                    "user_href": "/profile/Milan-Vukotic"
                }
            ]
        },
        {
            "author_info": {
                "name": "Elitabeth Prime",
                "href": "/profile/Elitabeth-Prime"
            },
            "answer_text": "Ok here’s the gist of it. While having a black character in a series or movie is fine, I don’t believe that you should take a perfectly fine white character and then, because you ‘need’ a black character, sub in a black when they were always white. Why? Simply this. You might imagine it is simpler to make up a completely original black character than piggyback off an existing white character, but here’s the real truth - the white character is there and all you have to do is throw in a black equal, which in some minds is easier. Yes, it would be logical and more fun to invent your own character, but I honestly think some directors, writers, or even producers are kinda lazy or they want to ‘revolutionize’ the way blacks are, even though there are an equal amount of black characters already in existence. A good example is ‘A Wrinkle in Time’. Meg Murry has always been white and it is wrong to blackwash her like that and have her be a black ‘revolutionist’. She was always white in the novels and always should be. In some ways, this could be insulting to both black and white people. White people are offended because the white character is now black. Black people might be put off because their black ‘hero’ is just a white hero in disguise and they don’t have that feeling of a true invented black character. I don’t mean to sound racist. I am not racist, but I don’t like it when a perfectly fine character is blackwashed ‘just because’. There are some amazing black characters out there, so it seems logical to use the ones you already have and be inventive, not turn white characters into black ones. ",
            "date": "Answered December 6, 2018",
            "views": "949",
            "upvotes": " View 7 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Grant Nobleman",
                    "user_href": "/profile/Grant-Nobleman-1"
                },
                {
                    "user_id": "Eddie Palacios",
                    "user_href": "/profile/Eddie-Palacios-3"
                },
                {
                    "user_id": "Akaneko Chann",
                    "user_href": "/profile/Akaneko-Chann"
                },
                {
                    "user_id": "Joel Yosafat",
                    "user_href": "/profile/Joel-Yosafat"
                },
                {
                    "user_id": "Rhiannan Hughes",
                    "user_href": "/profile/Rhiannan-Hughes"
                },
                {
                    "user_id": "Carrick Underdown",
                    "user_href": "/profile/Carrick-Underdown"
                },
                {
                    "user_id": "Alvin Lim",
                    "user_href": "/profile/Alvin-Lim-7"
                }
            ]
        },
        {
            "author_info": {
                "name": "Adrian Phillips",
                "href": "/profile/Adrian-Phillips-71"
            },
            "answer_text": "It really doesn’t help. They only do it to minor characters usually so it’s kind of like they’re saying “who’s the least important character we could make black so that it wouldn’t anger people? Uh, how about Jimmy Olsen? Perfect!” (BTW They might as well have just given that Jimmy Olsen an entirely new name because he looks and acts nothing like JImmy. Never realized how important it was to me that a character looks a certain way until it’s changed. It’s not easy to create new characters who happen to be black, but you know what is? Painting over an old franchise/property with a new coat of paint, and then trying to sell it off as something new and revolutionary. That’s always easier than creating something from the ground up. Stan Lee said something regarding this. “I wouldn’t mind, if Peter Parker had originally been black, a Latino, an Indian or anything else, that he stay that way,” he said. “But we originally made him white. I don’t see any reason to change that. It has nothing to do with being anti-gay, or anti-black, or anti-Latino, or anything like that,” he said. “Latino characters should stay Latino. The Black Panther should certainly not be Swiss. I just see no reason to change that which has already been established when it’s so easy to add new characters. I say create new characters the way you want to. Hell, I’ll do it myself.” People need to look to this statement the next time they think of changing how a character looks just cause. ",
            "date": "Answered August 29, 2020",
            "views": "70",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Joy Farkas",
                    "user_href": "/profile/Joy-Farkas"
                },
                {
                    "user_id": "Jesse De Vos",
                    "user_href": "/profile/Jesse-De-Vos-2"
                }
            ]
        },
        {
            "author_info": {
                "name": "James Feigenbaum",
                "href": "/profile/James-Feigenbaum-2"
            },
            "answer_text": "Making a character black who has an established history of being white is going to be a radical departure for that character. If Daniel Craig was replaced by Idris Elba or any actor who cannot pass as the son of Scottish nobility, they would have to provide Bond with a totally new back story. At some point, perhaps Eon will want to do that with a future reboot. But prior to Casino Royale, each new actor took his predecessors’ past with him. It was George Lazenby who lost his wife to Blofeld, but Moore, Dalton, and Brosnan all mourned her too. I imagine they are planning to do the same with Craig’s replacement. Bond will regenerate like the Doctor, but they will not start over from scratch while the movies continue to do well at the box office. Why kill the golden goose with a premature reboot? Other characters, on the other hand, do not have a definite ethnicity. Making James Olsen black on Supergirl was no big deal. I do not know that his ethnicity was ever even specified in the comic books. Similarly for Mordo in the MCU. But when Fox made Johnny Storm black while keeping his sister white, that caused major problems. ",
            "date": "Answered November 18, 2018",
            "views": "421",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Piermario Sanna",
                    "user_href": "/profile/Piermario-Sanna"
                },
                {
                    "user_id": "Islam Alvee",
                    "user_href": "/profile/Islam-Alvee-1"
                },
                {
                    "user_id": "Carrick Underdown",
                    "user_href": "/profile/Carrick-Underdown"
                },
                {
                    "user_id": "Kelly Russo",
                    "user_href": "/profile/Kelly-Russo-7"
                }
            ]
        },
        {
            "author_info": {
                "name": "Jennine Wardle",
                "href": "/profile/Jennine-Wardle"
            },
            "answer_text": "If the backstory of the character is decidedly ethnic—like Bond—then changing midstream for the sake of political correctness is silly and possibly culturally demeaning. However, if nothing in the story dictates or precludes a member of any race or nationality, then deviating from the historical depictions is not an issue. Just because XYZ has always been a particular race, doesn’t mean they have to be. If there are little sticking points—like black brother and white sister—small non-contradicting edits or inserts could be made—like adoption or blended family. I put this on par with forcing actors from a different country to mimic, often horribly, the accents of the characters they’re portraying. If the story is engaging and the performance excellent, “sounding” right is pointless… just like “looking” right is. How many times have producers cast someone who didn’t fit the description in the book, but their portrayal was good anyway? Hmmm… Gary Sinise as Stu Redman in The Stand comes to mind. No way is he a towering, burly rancher from Texas. ",
            "date": "Answered November 22, 2018",
            "views": "451",
            "upvotes": " View 2 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Carrick Underdown",
                    "user_href": "/profile/Carrick-Underdown"
                },
                {
                    "user_id": "Apex Kai Mertz",
                    "user_href": "/profile/Apex-Kai-Mertz"
                }
            ]
        },
        {
            "author_info": {
                "name": "Marianne Hiller",
                "href": "/profile/Marianne-Hiller"
            },
            "answer_text": "I’m pretty sure there isn’t any such word as, profounding, but I’ll go with the flow. I certainly think it is possible to have a black James Bond or a Hispanic Jack Reacher. There will always be someone that will dig their heels in and call it blasphemy. Just look at the reaction when Obama became president. There were protests all over, because presidents are traditionally white and blacks don’t have the intellectual maturity to handle the job. That said, Some roles would be drastically changed of a person of color were to play them. Tom Sawyer or Huckleberry Finn would be a whole new story if the characters were black. And what if Superman became a Muslim terrorist from a distant galaxy. Probably, some things are best left alone. And others innocuous. ",
            "date": "Answered November 18, 2018",
            "views": "272",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Carrick Underdown",
                    "user_href": "/profile/Carrick-Underdown"
                }
            ]
        },
        {
            "author_info": {
                "name": "Jim Brown",
                "href": "/profile/Jim-Brown-386"
            },
            "answer_text": "Not sure what “profounding” is, but it sounds bad. My favorite example is when someone concludes that since Cleopatra reigned over a country in Africa, she must have been Black. Even a rudimentary study of Egyptian history will reveal that Cleopatra was a descendant of Ptolemy, a Greek, whose presence in Egypt was a consequence of some guy called Alexander the Great. Cleopatra’s ethnicity was in no way Black African. She probably didn’t even speak any African language. As depicted in tomb paintings, the Egyptians knew the difference between themselves and Nubians, and none of the Ptolemaic Dynasty are depicted as Nubians. Same applies to depiction of Jesus as Black. Jews were ethnically homogeneous at that time, and there is no reference to Jesus being Black. To change this requires abandonment of the belief that Jesus was a historical person. Anybody who wants to convince believers of this could warm up by trying to tell Muslims that Mohammed was a gay female cross-dresser. ",
            "date": "Answered November 21, 2018",
            "views": "593",
            "upvotes": " View 6 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Mikael Petrov",
                    "user_href": "/profile/Mikael-Petrov"
                },
                {
                    "user_id": "Rhiannan Hughes",
                    "user_href": "/profile/Rhiannan-Hughes"
                },
                {
                    "user_id": "Carrick Underdown",
                    "user_href": "/profile/Carrick-Underdown"
                },
                {
                    "user_id": "Kelly Russo",
                    "user_href": "/profile/Kelly-Russo-7"
                },
                {
                    "user_id": "Milan Vukotic",
                    "user_href": "/profile/Milan-Vukotic"
                },
                {
                    "user_id": "James Elliott",
                    "user_href": "/profile/James-Elliott-36"
                }
            ]
        },
        {
            "author_info": {
                "name": "Jermane Cooper",
                "href": "/profile/Jermane-Cooper"
            },
            "answer_text": "No, I don’t. I think it creates an opportunity for people who are not familiar with/invested in a franchise to become so. Yes, it helps to create new and inspiring heroes of color, but such characters take momentum to build (and, like blackwashed characters, receive pushback from all white audiences who don’t see a need for characters of color). Blackwashing characters isn’t inherently wrong or right, and ultimately contributes to the goal of normalizing black characters as heroes/in prominent roles. ",
            "date": "Answered November 23, 2018",
            "views": "209",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Matt Daley",
                    "user_href": "/profile/Matt-Daley-6"
                }
            ]
        },
        {
            "author_info": {
                "name": "Melita Eva Milsmann",
                "href": "/profile/Melita-Eva-Milsmann"
            },
            "answer_text": "Yes, it annoys non-SJW white people who feel their film culture is being usurped, and I can’t see them being culturally relatable to black people either, it’s always going to look like they were given a bone off the white man’s table. The BBC made the same mistake with Doctor Who, it’s a male part in a series with endless good roles for women. They only made the Doctor female in order to be politically provocative. Black Panther was a great film with great black roles, but Halle Berry sucked as Catwoman. Batman and Catwoman was a white relationship I’ll predict that Zendaya Coleman as Mary Jane Watson will suck too, Spiderman and Mary Jane is a white relationship ",
            "date": "Answered November 23, 2018",
            "views": "200",
            "upvotes": " View 3 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Ferran Cabeza De Vaca",
                    "user_href": "/profile/Ferran-Cabeza-De-Vaca"
                },
                {
                    "user_id": "Carrick Underdown",
                    "user_href": "/profile/Carrick-Underdown"
                },
                {
                    "user_id": "Alvin Lim",
                    "user_href": "/profile/Alvin-Lim-7"
                }
            ]
        },
        {
            "author_info": {
                "name": "Jake Marek",
                "href": "/profile/Jake-Marek-2"
            },
            "answer_text": "I’d rather see actors play characters in the race they were written for, in general. It would be really weird to see a white person play Jim from “Huckleberry Finn,” for example, seeing that the character is a black slave I the American South in the late 1800s. If the character’s race isn’t specified, I couldn’t care less what race the actor is. If the gender isn’t important to the role, I don’t care what gender. I love Egyptian mythology, but didn’t watch “Gods of Egypt,” because the actors were pretty much all European or American. I can suspend my disbelief only so far. Scarlett Johansson playing an Asian is ridiculous. I’m still weirded out that every actor who ever played Charlie Chan was non-Asian. ",
            "date": "Answered November 23, 2018",
            "views": "210",
            "upvotes": " View 2 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Carrick Underdown",
                    "user_href": "/profile/Carrick-Underdown"
                },
                {
                    "user_id": "Alvin Lim",
                    "user_href": "/profile/Alvin-Lim-7"
                }
            ]
        },
        {
            "author_info": {
                "name": "Arthur Pearson",
                "href": "/profile/Arthur-Pearson-1"
            },
            "answer_text": "There is nothing new under the sun. The Seven Basic Plots - Wikipedia and https://tvtropes.org/ The key to “how good a story is” is not what race it’s “traditionally” been. It’s in how good the writing is. If the ethnicity of a character is critical to the particular plot, then the new “black” version shouldn’t be the exact same story, and should inherently suffer from the awkward fit. To answer your question, nothing is profound. ",
            "date": "Answered December 4, 2018",
            "views": "183",
            "upvotes": " Answer requested by Niv Lugassi"
        },
        {
            "author_info": {
                "name": "Michael D. Jensen",
                "href": "/profile/Michael-D-Jensen-2"
            },
            "answer_text": "It is stupid. I think they are too lazy to develop new Black characters because it might be easier to make established White characters become Black. Not a fan of blackwashing, whitewashing, or the like. If I was a director of a project and the script-writer or casting head did this, I would fire them. ",
            "date": "Answered November 25, 2018",
            "views": "70",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "James Arkwright",
                "href": "/profile/James-Arkwright-3"
            },
            "answer_text": "Yes. And it comes across as assuming black people can't create their own characters. Same as when they make a male hero a female. Suggests they don't have ideas of their own. Which is ridiculous. More so, people get tired of seeing the same thing. Inexcusable considering all the books and ideas out there. ",
            "date": "Answered November 27, 2018",
            "views": "112",
            "upvotes": " Answer requested by Niv Lugassi"
        },
        {
            "author_info": {
                "name": "Gregg Mikulla",
                "href": "/profile/Gregg-Em"
            },
            "answer_text": "Yes. I concur. ",
            "date": "Answered November 20, 2018",
            "views": "63",
            "upvotes": " Answer requested by Niv Lugassi"
        }
    ]
}