{
    "title": "Do you underline essay titles? - Quora",
    "tags": [
        "Essay Writing Help",
        "English Grammar Writing Advice",
        "Essays",
        "Writing Advice",
        "Grammar",
        "English Grammar"
    ],
    "response": [
        {
            "author_info": {
                "name": "Avis Miller",
                "href": "/profile/Avis-Miller-4"
            },
            "answer_text": "Are you referring to the essay’s title or the title of another essay mentioned in the text? Notwithstanding, I will try to answer to the best of my ability. In the past, before the use of word processors became a thing, people wrote essays on typewriters. These typewriters had no italics or bold features to emphasize text. So, the underline feature served as the universal indication of emphasis. Nowadays, modern writing guides don’t recommend the use of underlining to emphasize texts. A major part of the problem presents itself as the hyperlink feature, which is similar to underlining. Therefore, all modern writing styles discourage students from underlining an essay’s title. You can use Title Case capitalization instead. You can also use italics or quotation marks when mentioning another essay in the title. Deconstructing the Literary Devices in “The Old Man and the Sea”If the essay title appears in your text, then you shouldn’t underline it either. You can only use italics or quotation marks. “In his interpretation of The Old Man and the Sea….”Also, you cannot underline titles in the Works Cited page. If the essay is an excerpt from another publication, it should be enclosed in quotation marks. If it is a stand-alone publication, italicize it. Doe, John. \"Perseverance and Hope\" in A Book About Nothing. State: City, Date. Print.",
            "date": "Updated September 10, 2020",
            "views": "936",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Drew Nichol",
                "href": "/profile/Drew-Nichol-1"
            },
            "answer_text": "\"Do you underline essay titles\" If you mean when writing about or referencing other people's essays, I would italicize the title. If you mean the title of your own essay, I would use 12Pt bold if you're using a word processor and no underlining. If you are writing your essay on paper, then underlining would be a good idea. With digital documents, underling is generally avoided no because underlines imply a hyperlink. ",
            "date": "Answered August 14, 2015",
            "views": "127",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Romi Stepovich",
                    "user_href": "/profile/Romi-Stepovich"
                },
                {
                    "user_id": "Kelley Spartiatis",
                    "user_href": "/profile/Kelley-Spartiatis"
                }
            ]
        },
        {
            "author_info": {
                "name": "Charles Clack",
                "href": "/profile/Charles-Clack"
            },
            "answer_text": "Put essays in quotes. Lewis Thomas wrote \"The Medusa and the Snail.\" Put books and movies in italics. Dr. Seuss wrote The Cat in the Hat. If you can't make italics on your ancient word processor, then underline books and movies to indicate that you wish you could put them in italics. Dr. Seuss wrote The Cat in the Hat . (Note: I don’t know how to underline on this web page, so I left the italics.) No matter how old your word processor is, essays still go in quotes. Lewis Thomas wrote \"The Medusa and the Snail.\" But that doesn't mean that you put the title in quotes when you are writing the essay. At the top of the essay itself, you just write the words of the title; you don't put them in quotes. ",
            "date": "Updated May 16, 2020",
            "views": "10",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Jonathan Hiatt",
                    "user_href": "/profile/Jonathan-Hiatt-1"
                },
                {
                    "user_id": "Justin Dobey",
                    "user_href": "/profile/Justin-Dobey-1"
                },
                {
                    "user_id": "Mario Gravina",
                    "user_href": "/profile/Mario-Gravina"
                },
                {
                    "user_id": "Lily Yang",
                    "user_href": "/profile/Lily-Yang-77"
                }
            ]
        },
        {
            "author_info": {
                "name": "Jim Davis",
                "href": "/profile/Jim-Davis-57"
            },
            "answer_text": "Essay titles are not underlined, which would indicate italics to a printer, but rather they are enclosed in quotation marks. ",
            "date": "Answered August 29, 2017",
            "views": "13",
            "upvotes": " Answer requested by Aiden Rawson"
        }
    ]
}