{
    "title": "Do you have any tips to write rich dialogue and story lines? - Quora",
    "tags": [
        "Novelists",
        "Fiction Writing"
    ],
    "response": [
        {
            "author_info": {
                "name": "Kamila Miller",
                "href": "/profile/Kamila-Miller-2"
            },
            "answer_text": "This is a huge question. I could potentially write a couple books to answer this question in-depth. But let’s stick with tips! Dialogue: Don’t always have a character answer the questions put to them. Let them be indirect if that’s who they are, or confrontational or defensive or embarrassed if they feel they’re being interrogated or put on the spot. Let characters ‘cut to the chase’ or speak their minds with dialogue that seems at first blush unrelated to the conversation. After all, even in regular conversations (not just dramatized ones) people: are reminded of something more important than the subject at hand and jump into the middle of a conversation with their concernsmisunderstand each other or become distracted and stop listening, especially if the other person is well known to them and on a familiar script or rantnotice something in their periphery that’s important and cut off the other personget impatient and talk over the other person or ask that they please give them a chance to say something or tell the other person that they’re under a time-constraintAnd so on. Avoid melodramatic statements that don’t make sense in real life. Remember, if someone wants to hurt you, they aren’t always going to bluster and tell you that they’re going to hurt you. If someone is breaking up with you, they won’t always turn it into a screaming match, or come out and say it directly. If someone is annoyed with you, they won’t always be sarcastic or mean; they may be overly polite and smile too much instead. What the characters do while they’re talking will inform the readers about who the characters are at their heart. Even if they’re just standing there in a grocery aisle, they’ll move around. They may continue to peruse the shelves. They may make way for other customers. They may fidget, check their phone, rock the cart back and forth (mothers and former mothers sometimes do that, as do people with mild OCD-like personalities). How they say the things they say should also reveal or confirm personality traits. Do they always put things in the nicest possible way? Do they laugh a lot and assume everyone is having a good time? Are they unsure of themselves when they speak? If they’re a person of few words, is that because they’re shy or because they find the excess of small talk that everyone seems to love so much annoying and pointless? Do they talk a lot to cover up their insecurities or their dread of awkward silences? How can you convey that? Expressions and actions through action tags help with that, but so does conscious control of the length of sentences and the words they choose. Now, for storylines: If you’ve seen it in a movie, tv show or in a video game, it’s probably a tired trope or a cliche. Acquaint yourself with this list: What are some of the most annoying movie clichés? Sometimes it’s a good idea to connect the beginning with the ending in some way. It doesn’t have to be a physical or an overt connection. When done correctly, readers find it very satisfying. Make sure the setting you use is integral to the story. If your story can be set literally anywhere, the setting doesn’t have enough of a role. Drop subtle clues when appropriate that won’t matter if a reader misses them, but will make all the difference to a reader that notices them. For example, if you have a character who perceives himself differently from how other people perceive him, you can show this through how they treat him as opposed to how he sees himself in the mirror. A step-up from the above example is to actually foreshadow a surprise ending or a plot twist or a hidden character trait reveal. You have to be super careful about this. It’s better if some readers miss the foreshadowing rather than beat the readers who pay the most attention over the head with your foreshadowing. After you’ve written a rough draft, look for themes. A theme can be a big, splashy, in-your-face thing like ‘love conquers all’ or more subtle, like ‘love always carries a price, but it’s worth it even when it goes bad.’ During your revision, see if you can deepen the themes by both proving and disproving them. For example, if your theme is love conquers all, you can show a counter-example and show that love sometimes costs people everything they hold dear. A Fault in Our Stars did that. BTW, you don’t have to employ the primary characters to play with different aspects of your theme. Sub plots and supporting characters are great for deepening the themes in stories. Make sure that you give the characters a really tough time. Don’t cut them very many breaks, if any at all, and make sure every victory costs something. Regardless of whether you have a happy or tragic ending, make sure that your storyline changes the characters in profound ways. My last tip is about endings. If you have a happy ending, make sure there’s a note of sadness or loss in it, and if you have a tragic ending, make sure there’s a bit of a lift that comes with it. The straight happy endings and straight sad endings tend to read flat. You need some nuance to enrich your conclusion. I hope this helps! ",
            "date": "Answered March 21, 2017",
            "views": "631",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Toby David Low",
                    "user_href": "/profile/Toby-David-Low"
                },
                {
                    "user_id": "Crystal Gillis",
                    "user_href": "/profile/Crystal-Gillis"
                },
                {
                    "user_id": "Richard P. Morrall",
                    "user_href": "/profile/Richard-P-Morrall"
                }
            ]
        },
        {
            "author_info": {
                "name": "Tia Eastlake",
                "href": "/profile/Tia-Eastlake"
            },
            "answer_text": "There are a ton of different ways to approach answering this, but I’ll try to keep this sane. Rich Dialog can mean different things depending on the situation, author, tone, and perspective. It can refer to powerful, dramatic speeches, but this really should be kept to a minimum. Think about how often you hear a truly inspirational speech, compared to how often you hear mundane jabber.It can refer to brilliant wordplay. Some authors excel at dialog that bounces smoothly from character to character and forms a stream, carrying the reader into the next page with a tear or a laugh.It can refer to a LOT of dialog, or a little dialog.Personally, I like to take all the “rules” and feed them to our sabertooth poodle. When I write a character, I stop and think about how the character would talk if they were real. I don’t just mean accent (although I do touch on that a little bit for more excessive accents); I mean the words they would use. An awkward teen, or really introverted character is… likely to pause a lot. When they speak, it’ll be with improper grammar, and sometimes, maybe, kinda’ the wrong words altogether. Or they will speak far to precisely, for fear that they will say the wrong thing, and be misunderstood.A suave, sophisticated, socialite demon is likely to speak fluidly. His serpentine words will flow, and create an audible cadence; in much the same manner as the weaving of a cobra’s head. Before it strikes.Extremist politician, rousing the easily swayed with emotional speeches? Use many, many short, very short words. No matchy words, or long words. No long sentence things. The sentences should be short. Very short. Everybody will love them. The paragraphs will be looong. Very long. People will forget more of it that way. It’s got to be great. It’s got to be amazing. You have to really sell it. Throw in a few partially made-up words that sound good during the high emotion parts, where nobody will notice.But mostly? Don’t worry. Write how you feel most comfortable. My only ‘rule’ (at least that I’m willing to hold out and suggest to others) is to ALWAYS read back through your work. Word for word. Out loud if possible. If it FEELS right to you, then you have what your creativity wanted you to have. ",
            "date": "Answered March 22, 2017",
            "views": "115",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Ken Miyamoto",
                "href": "/profile/Ken-Miyamoto"
            },
            "answer_text": "Dialogue Writing great dialogue is simple when it’s created as organically as possible, and is difficult when over-analyzed. I cringe when I hear writers talk about how much thought they put into each and every line. Each and every line matters and should be in there for a reason yes, but putting too much thought into it destroys the notion of it becoming anything near rich, natural, and something that pops off of the page or eventual screen. When writers over-analyze, they’re thinking more about how the dialogue displays story or character exposition and less about how the emotions the characters are feeling. Great dialogue is about emotion, whether it’s lack of emotion, overabundance of emotion, or range of emotions. And it’s about action and reaction and the choices the characters make in a conversation or exchange. What I like to do is simply put the characters into the situation at hand (whatever the scene calls for as far as location, conflict, etc.) and then let them speak as I type. See it through the mind’s eye and feel the emotions of each character… and then… ACT IT OUT. Either you pace the room and act out what you’ve written, or you do it in your head while speaking out loud with the emotions the character may be feeling. And then you trim it down to its core to find an almost poetic beat to it all. Have them interrupt each other. Have them talk in fragments. Have them NOT talk and react physically. The key is to build. Have the dialogue build to a moment within the storyline. Have a character hesitate to reveal whatever as you bombard them with another’s character’s dialogue pushing them to do so. It’s about emotion, emotion, emotion and how those emotions (or lack of) affect the emotions of the other character’s in the mix. And then whittle it down to the point where the exchanges are like poetic syntax… a musical beat… a dance between the characters. Story Writing great stories is simple when they are created as organically as possible, and is difficult when over-analyzed. I cringe when I read stories that are so overly plot-driven. It really is a terrible byproduct of writing seminars, writing gurus, writing how-to books, etc. The best stories are often the most simple. You start with a compelling concept and then grow it by pouring constant conflict onto it and the characters within. The best analogy is sending someone up a tree, throwing rocks at them from below, and then setting the tree on fire to see how they’ll get down (or not). Many stories or themes have been used endlessly, over and over in books, television, plays, and film. It’s HOW you tell those stories that matter. Add your own twist and turns. Take us down a path we haven’t seen. Present conflict from directions we haven’t seen. Take us down a road that we think we know where it is leading and then push us off onto an unbeaten path that we didn’t expect. ",
            "date": "Answered March 27, 2017",
            "views": "19",
            "upvotes": " View 22 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Bill Stone",
                    "user_href": "/profile/Bill-Stone-86"
                },
                {
                    "user_id": "Max Karmazin",
                    "user_href": "/profile/Max-Karmazin"
                },
                {
                    "user_id": "Rama Thapa Chhetri",
                    "user_href": "/profile/Rama-Thapa-Chhetri"
                },
                {
                    "user_id": "Dirk Hooper",
                    "user_href": "/profile/Dirk-Hooper"
                },
                {
                    "user_id": "Eileen Donovan",
                    "user_href": "/profile/Eileen-Donovan-3"
                },
                {
                    "user_id": "Praveen Kumar Santhanam",
                    "user_href": "/profile/Praveen-Kumar-Santhanam"
                },
                {
                    "user_id": "Daniel Dasmy",
                    "user_href": "/profile/Daniel-Dasmy"
                },
                {
                    "user_id": "Jakey Duracyzkcski",
                    "user_href": "/profile/Jakey-Duracyzkcski"
                },
                {
                    "user_id": "Michael Cobb",
                    "user_href": "/profile/Michael-Cobb-28"
                },
                {
                    "user_id": "Raman Namboodiripad",
                    "user_href": "/profile/Raman-Namboodiripad"
                },
                {
                    "user_id": "Grandma Barnett",
                    "user_href": "/profile/Grandma-Barnett"
                },
                {
                    "user_id": "Ratha Chea",
                    "user_href": "/profile/Ratha-Chea-2"
                },
                {
                    "user_id": "Mike Speight",
                    "user_href": "/profile/Mike-Speight-2"
                },
                {
                    "user_id": "Alice Flagg",
                    "user_href": "/profile/Alice-Flagg"
                },
                {
                    "user_id": "Akshit Gupta",
                    "user_href": "/profile/Akshit-Gupta-71"
                },
                {
                    "user_id": "Rasikh Morani",
                    "user_href": "/profile/Rasikh-Morani-2"
                },
                {
                    "user_id": "Holly Root-Gutteridge",
                    "user_href": "/profile/Holly-Root-Gutteridge"
                },
                {
                    "user_id": "Jocke Enegren",
                    "user_href": "/profile/Jocke-Enegren"
                },
                {
                    "user_id": "Janet Buntz",
                    "user_href": "/profile/Janet-Buntz"
                },
                {
                    "user_id": "Arash Jamwal",
                    "user_href": "/profile/Arash-Jamwal"
                },
                {
                    "user_id": "Maryam Shamsi",
                    "user_href": "/profile/Maryam-Shamsi"
                },
                {
                    "user_id": "Marc Bodnick",
                    "user_href": "/profile/Marc-Bodnick"
                }
            ]
        },
        {
            "author_info": {
                "name": "Barry Hampe",
                "href": "/profile/Barry-Hampe"
            },
            "answer_text": "Question as asked by the OP: Do you have any tips to write rich dialogue and story lines? Yes. Write every day. Writing is like playing the violin; nobody does it well at first. You have to practice.See if you can write a short story, at least one full page, using only dialogue.Read every day. Read the sort of thing you want to write. See how the pros do it.Take a writing class. It won’t teach you how to write, but it may teach you how to analyze and edit what you have written.Visit Writers Digest Books, click on Imorove Writing, an then on Dialogue and on Plot and Structure.",
            "date": "Answered March 22, 2017",
            "views": "320",
            "upvotes": " View 9 Upvoters",
            "upvoters": [
                {
                    "user_id": "Mike Speight",
                    "user_href": "/profile/Mike-Speight-2"
                },
                {
                    "user_id": "Crystal Gillis",
                    "user_href": "/profile/Crystal-Gillis"
                },
                {
                    "user_id": "Matt Elsen",
                    "user_href": "/profile/Matt-Elsen-1"
                },
                {
                    "user_id": "Lucienne LeBeau",
                    "user_href": "/profile/Lucienne-LeBeau"
                },
                {
                    "user_id": "Chrys Jordan",
                    "user_href": "/profile/Chrys-Jordan"
                },
                {
                    "user_id": "Aviance Myles",
                    "user_href": "/profile/Aviance-Myles"
                },
                {
                    "user_id": "Tia Eastlake",
                    "user_href": "/profile/Tia-Eastlake"
                },
                {
                    "user_id": "Luis Humberto Molinar Márquez",
                    "user_href": "/profile/Luis-Humberto-Molinar-Márquez"
                },
                {
                    "user_id": "Frank Dauenhauer",
                    "user_href": "/profile/Frank-Dauenhauer"
                }
            ]
        },
        {
            "author_info": {
                "name": "Brian Newman",
                "href": "/profile/Brian-Newman-8"
            },
            "answer_text": "Honestly, the way I write dialogue is that I just imagine two or more people talking and write it down. But, to get there, there is no better exercise than eavesdropping. Listen to people talk. Listen for what they are really saying (subtext) as opposed to the words coming out of their mouths. Take an improv course or two. Read screenplays. When you’ve written your scene’s dialogue, _then_ go back over it and look for fillers (ie. the ‘um,’ ‘eh,’ and ‘hunh’) and remove them. Next, look at all your ‘said’s and synonyms and see if you can remove them. If you can’t remove them, see if you can replace them with *stuff* that the person is doing while talking (e.g. “John picked at a food wrapper with a heavily chewed yellow pencil, ‘this is disgusting.’”) ",
            "date": "Answered March 21, 2017",
            "views": "80",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Toby David Low",
                    "user_href": "/profile/Toby-David-Low"
                }
            ]
        },
        {
            "author_info": {
                "name": "Brad Chisholm",
                "href": "/profile/Brad-Chisholm"
            },
            "answer_text": "My stock answer is to screen Kurosawa’s Rashomon. Study it. Next, become an eavesdropper. Listen to bits of conversations in a coffee shop or wherever. Go home and continue the dialogue. You carry a notebook, right? Or use “Notes” on your iPhone. Dialogue is the most importent element because it ‘sells’ your story to your readers. Wooden, unnatural dialogue kills the flow. Finally, read Chandler. The best.  As for story lines, I will make two points. First, real people are WAY crazier than anything you can make up. i swear this is true. Secondly, a good starting point is to take something that most people know or assume and ‘flip it’. eg we assume aliens are smarter than us. what if they came and were idiots? Great characters, dialogue and moving the plot are more important than the story per se, which is why the same hack stories get made over and over. Try and hit everything. Good luck. ",
            "date": "Answered March 22, 2017",
            "views": "64",
            "upvotes": "0"
        }
    ]
}