{
    "title": "Do you think Shakespeare's plays were written by more than one author? - Quora",
    "tags": [
        "Playwrights",
        "Shakespeare Plays",
        "William Shakespeare",
        "Writers and Authors",
        "Literature",
        "Books"
    ],
    "response": [
        {
            "author_info": {
                "name": "Paula DeMichele",
                "href": "/profile/Paula-DeMichele-1"
            },
            "answer_text": "I’ve been hearing these kinds of comments since studying graduate English in the 1970’s. Yes, there is internal textual evidence that Shakespeare had collaborators for some plays. The theory that DeVere wrote these plays has been around forever - also that Francis Bacon wrote them, which frankly makes more sense to me in terms of style and subject. I take all of them with a grain of salt for two reasons: first, these theories are based on the prejudice that Shakespeare must have been illiterate, despite the existence of English Common Schools (not to mention private tutors). To understand his social background and education, I suggest you read Shakespeare of London by American scholar Marchette Chute. She meticulously examined 16th century documented sources for her book. Her conclusions are drawn from these sources. It’s always puzzled me how Shakespeare could have been the heir of a successful business man, expected to take over his father’s business, and be illiterate. If he couldn’t read enough to keep account records straight, the business would have died in months. John Shakespeare wanted his son to be a gentleman with the necessary education to rise in the world - if I recall correctly, he even purchased a coat of arms. Chute discusses in detail the curriculum for the local school Shakespeare attended. Read her book and make up your own mind. But I have another specific reason: the genius of Shakespeare meant that he didn’t care about consistency of style. Some of his writing is just plain bad - just as some of Beethoven’s brass orchestration leaves much to be desired. Genius often doesn’t worry about consistency. If you can, consult The Energies of Art by Jacque Barzun, his essay “From The Shakespeare File”. Barzun runs through comments on Shakespeare over the centuries and quotes how often Shakespeare’s writing was regarded as just plain bad: “rant, doggerel, tedious writing, crude horseplay, comic bores, hackneyed situations” and so on. Samuel Johnson couldn’t stand much of his writing. G.K. Chesterton loved his “gusto” but from the same period, George Bernard Shaw said he would like to dig him up just so he could thrown stones at him. And Tolstoy called his reputation as a playwright a “collective hallucination.” I personally cannot imagine the rather ascetic Earl DeVere being associated with the frequent bad writing in Shakespeare’s plays. I also can’t imagine him actually part of the process of a working theater, especially with Richard Burbage and crew. They were as rowdy as it gets. But read Chute’s book and the essay - it’s fun and a great eye opener. ",
            "date": "Answered January 20, 2020",
            "views": "195",
            "upvotes": " View 3 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Anand Venigalla",
                    "user_href": "/profile/Anand-Venigalla"
                },
                {
                    "user_id": "Darren Blackburn",
                    "user_href": "/profile/Darren-Blackburn-5"
                },
                {
                    "user_id": "Harvey Miller",
                    "user_href": "/profile/Harvey-Miller-10"
                }
            ]
        },
        {
            "author_info": {
                "name": "William Smith",
                "href": "/profile/William-Smith-56"
            },
            "answer_text": "Beyond the well established facts that certain plays were written in collaboration, like The Two Noble Kinsmen and, according to some recent scholarship, the Henry VI plays with Christopher Marlowe, no. All of the alternate theories—Bacon, Oxford, and the rest—founder on three important points. First, there is the evidence of the dedicatory material in the First Folio and Ben Jonson’s personal comments on Shakespeare. Second, there is the corrosive snobbery that suggests that Shakespeare had to have been a university man, when his education at the Stratford grammar school was quite sufficient, since it included classical languages—and genius does not know social distinctions. Also, Shakespeare is not a particularly learned writer, compared to someone like Spenser or Jonson. The third is a logical one—first, who would have benefited from so elaborate a charade, and how could it have been kept secret? There are many literary hoaxes, and all of them were uncovered quite quickly. The only comparable secret I can think of is the details of the Eleusinian mysteries, and even there were know more than a little. The laternate theories do not stand up to logic and common sense—or scholarship. ",
            "date": "Answered January 20, 2020",
            "views": "249",
            "upvotes": " View 4 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Anand Venigalla",
                    "user_href": "/profile/Anand-Venigalla"
                },
                {
                    "user_id": "Darren Blackburn",
                    "user_href": "/profile/Darren-Blackburn-5"
                },
                {
                    "user_id": "Ishaan H. Jajodia",
                    "user_href": "/profile/Ishaan-H-Jajodia"
                },
                {
                    "user_id": "James Holan",
                    "user_href": "/profile/James-Holan-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Steve Riskin",
                "href": "/profile/Steve-Riskin"
            },
            "answer_text": "Absolutely. Every time a play by Shakespeare is read or seen it is co-written by the reader or seer. The second reading of anything is a reading of a new work. Try it. You’ll be astonished at what’s “in there” on a second reading. By the twenty fourth reading your own contribution to the original begins to taper off as you find you’ve finally learned how to read. That’s particularly true of Shakespeare; no one, repeat, no one, has fully learned to read Shakespeare; the challenge is enormous. But the way that challenge is fulfilled is to learn to become the reader Shakespeare requires you to be. You can’t be the first person on the moon any more, but you can be the first person to have, in the richest sense of the term, read and understood Shakespeare. ",
            "date": "Answered January 17, 2020",
            "views": "235",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Nate Briggs",
                "href": "/profile/Nate-Briggs-1"
            },
            "answer_text": "In some cases, the plays offer an example of what might be called “literary geology” - since there were layers of edits added later. We don’t know who made the later adjustments, or how often, but we can speculate that they were made to render the plays more accessible to the illiterate audiences at the popular theatres. It’s important to remember that the plays were originally written by DeVere as entertainments for the court of Elizabeth I - highly sophisticated plays for a highly-sophisticated audience. Their author could not be known to the public, since it would be a painful humiliation for him. Therefore they leaked out anonymously - “plays enjoyed by the queen” - but without an author. So, for anyone who wanted to use the material it was “finders, keepers” and writers associated with the theatre, or even actors themselves, would have the option to add lines, change lines, or leave lines out. The saddest part of this: we do not know what the original “royal” plays sounded like, and - until the successful development of time travel - will never know. ",
            "date": "Answered January 20, 2020",
            "views": "327",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Darren Blackburn",
                    "user_href": "/profile/Darren-Blackburn-5"
                }
            ]
        },
        {
            "author_info": {
                "name": "Ted Alper",
                "href": "/profile/Ted-Alper"
            },
            "answer_text": "I find the textual analysis very convincing that in his early career he collaborated with others, (or possibly revised/adapted their work), in particular Christopher Marlowe, Thomas Nashe and George Peele — the Heny VI plays, TItus Andronicus and later in his career, he he collaborated with John Fletcher (two noble kinsmen, Henry VIII) and Thomas Middleton (Timon of Athens, Measure for Measure, and some sections of Macbeth that may have been from a later production than the original, but were in the version included in the folio ). Also Pericles is quite clearly a collaboration with George Wilkins. None of this is surprising — a huge numbers of plays in the elizabethan/jacobean era were written collaboratively. ",
            "date": "Updated January 20, 2020",
            "views": "405",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Darren Blackburn",
                    "user_href": "/profile/Darren-Blackburn-5"
                },
                {
                    "user_id": "Charles Waring",
                    "user_href": "/profile/Charles-Waring"
                }
            ]
        },
        {
            "author_info": {
                "name": "Cyrus Mehta",
                "href": "/profile/Cyrus-Mehta-11"
            },
            "answer_text": "In a sense, most likely, yes. Bernard Shaw hypothesized - and, I think, with a considerable degree of justification - that Shakespeare went around the streets of London with a notebook in hand, and in it he would jot down any really brilliant and pithy phrases he might overhear from people talking to one another in the streets, shops and public houses: snippets such as “a rose by any other name would smell as sweet” or “To die, to sleep - to sleep, perchance to dream”; and when he found an appropriate place in any play he was at that time engaged in writing to insert some of those pearls, he did! So basically most of what he did was akin to what we in modern times would call “copy and paste” gems of the English language from other people’s conversations: and, Shaw surmised, that is also why Shakespeare thought of himself as “a snapper-up of unconsidered trifles”. ",
            "date": "Answered January 21, 2020",
            "views": "333",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Tigran Minasyan",
                    "user_href": "/profile/Tigran-Minasyan"
                }
            ]
        },
        {
            "author_info": {
                "name": "Philip Tomposki",
                "href": "/profile/Philip-Tomposki"
            },
            "answer_text": "Stylometrics, computer aided textural analysis, suggests that several of his plays were co-written. These include the three Henry VI plays (with Marlowe and/ or Nashe), Titus Andronicus (Peale), Timon of Athens (Middleton), Pericles (George Wilkins) and Henry VIII, Two Noble Kinsmen and possibly the lost Cardenio (Fletcher). Middleton may also have done revisions of Measure for Measure, All’s Well That Ends Well and Macbeth. Stylometrics is controversial, but co-authorship was quite common in Shakespeare’s time and it is unlikely that he would not have worked with other playwrights from time-to-time ",
            "date": "Answered January 17, 2020",
            "views": "86",
            "upvotes": " View 3 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Michael Moriarty",
                    "user_href": "/profile/Michael-Moriarty-13"
                },
                {
                    "user_id": "Darren Blackburn",
                    "user_href": "/profile/Darren-Blackburn-5"
                },
                {
                    "user_id": "Mari Bonomi",
                    "user_href": "/profile/Mari-Bonomi"
                }
            ]
        },
        {
            "author_info": {
                "name": "Norman Owen",
                "href": "/profile/Norman-Owen"
            },
            "answer_text": "There’s been enough textual analysis over the centuries - including recent computerized comparisons of word usage, etc. - so that we can say with some degree of assurance that most of Shakespeare’s plays were the product of a single person. There are a few (of the history plays, as I recall) where we are pretty sure “Shakespeare” was just one of two or more playwrights who contributed, but this does not apply to any of his major works, AFAIK. ",
            "date": "Answered January 17, 2020",
            "views": "242",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "John Stanley",
                    "user_href": "/profile/John-Stanley-17"
                }
            ]
        },
        {
            "author_info": {
                "name": "Anand Venigalla",
                "href": "/profile/Anand-Venigalla"
            },
            "answer_text": "At least a few were: Henry VI Part 1, Timon of Athens, Henry VIII, The Two Noble Kinsmen. Other than these, I am sure that the plays were written by Shakespeare and Shakespeare alone. Macbeth is written mostly by Shakespeare alone, so it is not collaborative like the above-listed plays, but it has some interpolations by Thomas Middleton. ",
            "date": "Answered January 24, 2020",
            "views": "30",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Darren Blackburn",
                    "user_href": "/profile/Darren-Blackburn-5"
                }
            ]
        },
        {
            "author_info": {
                "name": "Thomas Musselman",
                "href": "/profile/Thomas-Musselman"
            },
            "answer_text": "Shakespeare's Collaborations: Which Plays Were Collaborations? has the current consensus; it is too technical for me to have an independent opinion. ",
            "date": "Answered January 17, 2020",
            "views": "45",
            "upvotes": " Answer requested by Darren Blackburn"
        }
    ]
}