{
    "title": "Do you use home row technique when typing? - Quora",
    "tags": [
        "Row",
        "Typing Speed",
        "Ergonomics",
        "Keys",
        "Techniques",
        "Typing",
        "Computer Keyboards",
        "Computer Programmers",
        "Machine Learning",
        "Computer Programming"
    ],
    "response": [
        {
            "author_info": {
                "name": "Matthew T. Waterhouse",
                "href": "/profile/Matthew-T-Waterhouse"
            },
            "answer_text": "Yes…I guess? I use Dvorak. This is my home row from left to right — AOEUI — DHTNS. Or maybe in another way to visualize Dvorak. Left hand — Right hand ‘,.py — fgcrl aoeui — dhtns ;qjkx — bmwvz + [Shift] “<>PY — FGCRL AOEUI—DHTNS ;QJUK—BMWVZ  But yes, my vowels are on the home row under my left hand — just where I like them. They feel at home there. It’s a fairly speedy system — Dvorak and touch typing. I’m around 100 words per minute without using text expanders. (Give me a good night’s rest and a pot of coffee and I’m up in the 120–150 range — but it doesn’t last too long.) ",
            "date": "Answered December 19, 2018",
            "views": "389",
            "upvotes": " View 3 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Nawsherwan Mujtaba",
                    "user_href": "/profile/Nawsherwan-Mujtaba"
                },
                {
                    "user_id": "NKM Dony",
                    "user_href": "/profile/NKM-Dony"
                },
                {
                    "user_id": "Donna DeLisle",
                    "user_href": "/profile/Donna-DeLisle"
                }
            ]
        },
        {
            "author_info": {
                "name": "Michael Daniel",
                "href": "/profile/Michael-Daniel-21"
            },
            "answer_text": "Thanks for A2A. Do you use home row technique when typing? Oddly enough, no. I’ve observed similar behavior in other typists as well. Left long and pointer tend to hover over E and R respectively, while the entire right hand tends to hover over the upper row. I’m still using the correct technique, but my fingers are anticipating the more common keys ahead of time. When first approaching the keyboard, because F and J are the only keys with tactile guides, my fingers will sit on the standard home keys, and they will return to those keys while I’m paused, or thinking. But once I’m in action, they will keep anticipating. ",
            "date": "Answered December 21, 2018",
            "views": "242",
            "upvotes": " Answer requested by James Germain"
        }
    ]
}