{
    "title": "Do you like to do some photography? How do you do it? What are the steps? - Quora",
    "tags": [
        "Photographers",
        "Digital Photography"
    ],
    "response": [
        {
            "author_info": {
                "name": "Ronald Tambunan",
                "href": "/profile/Ronald-Tambunan"
            },
            "answer_text": "Do you like to do some photography? Yes, I do.. How do you do it? By following some examples and directions provided by professionals in the Internet.. What are the steps? Read and comprehend the camera’s manual book, read and comprehend basic of photography (ISO, Aperture, and Shutter Speed, composition, histogram, simple editing, etc.), watch tutorial by the pros (articles, YouTube, magazine, etc.), and practice everything that I’ve learnt, read, and comprehend.. ",
            "date": "Answered January 21, 2017",
            "views": "57",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Tammy Greenfield",
                "href": "/profile/Tammy-Greenfield"
            },
            "answer_text": "yes!i do .i take some pictures in my free time ,and edit it by photosAmazon.com : Best Studio Photography Kit - Includes Chromakey Studio Background Screen (Green Black White), Muslin BackDrops, Umbrella, Softbox, Lighting Diffuser Reflector : Camera & Photo hop cs6,but before this ,we should taken a good pic with full light,lighting is very important ,what you should do is go to install a vedio studio tent with bulbs ,Studio Light Stand ,Backdrop Support Stand , Heavy Duty Light Stand ,Backdrop Clamps if you want to be a professional photographer.hope this will help you .i usually go to amazon online shop to buy it and i recommend one store to you ",
            "date": "Answered January 21, 2017",
            "views": "22",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Adam Shattock",
                "href": "/profile/Adam-Shattock"
            },
            "answer_text": "First go study photography at either Learn Photography with NYIP or Online photography courses - Institute of Photography. Just the basic course at the second one is very involved for beginners. If you don't understand those then photography may not be your thing. ",
            "date": "Answered January 21, 2017",
            "views": "28",
            "upvotes": "0"
        }
    ]
}