{
    "title": "Do you think our struggles in life define our character? - Quora",
    "tags": [
        "Struggles",
        "Struggle",
        "Character and Personality",
        "Philosophy of Everyday Life",
        "Life and Living",
        "Life Advice"
    ],
    "response": [
        {
            "author_info": {
                "name": "Nikhil Prasad",
                "href": "/profile/Nikhil-Prasad-59"
            },
            "answer_text": "I will simply give you my humble two cents from the point of view of an ATHEIST. Of course,our struggles in life define our character and make us more resilient.Someone who went through struggles will always be more poised and adept at dealing with complicated situations than someone who has been highly pampered. HOWEVER, I don't feel there is a Personal God or divine being who has planned out our entire sequence of life(Mind you,this is my personal opinion and am not imposing my beliefs upon anyone). Both good and bad things happen to people due to CAUSE and EFFECT of the Universe or BUTTERFLY EFFECT ",
            "date": "Answered September 10, 2018",
            "views": "74",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Sonya Merle Hitchner",
                "href": "/profile/Sonya-Merle-Hitchner"
            },
            "answer_text": "We are like marble blocks and our struggles are the sculptor’s tools that chip away the unwanted bits. God is the sculptor. When He's done with us, we be mighty pretty and pleasing to His eye. That's the romantic version. The truth is our choices define us. If we align ourselves with the Creator we grow spiritually and things go well with us in the face of adversity. Not without drama, but at least a way out and over and through it all. Struggles are a given. Our character emerges as we fight the good fight. Be attentive to Soul and Character will stand up and show up and be counted. Best wishes ",
            "date": "Answered September 11, 2018",
            "views": "40",
            "upvotes": " Answer requested by Lydia Mimiaga",
            "upvoters": [
                {
                    "user_id": "Brieanne K. Tanner",
                    "user_href": "/profile/Brieanne-K-Tanner"
                },
                {
                    "user_id": "John R. Blake",
                    "user_href": "/profile/John-R-Blake"
                }
            ]
        },
        {
            "author_info": {
                "name": "Christina Williams",
                "href": "/profile/Christina-Williams-38"
            },
            "answer_text": "Yes, our struggles in life define our character. Romans 5:3–5 (NIV Bible) “3 …We also glory in our sufferings, because we know that suffering produces perseverance; 4 perseverance, character; and character, hope. 5 And hope does not put us to shame, because God’s love has been poured out into our hearts through the Holy Spirit, who has been given to us.” ",
            "date": "Answered September 6, 2020",
            "views": "32",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Joey Bryson",
                "href": "/profile/Joey-Bryson-2"
            },
            "answer_text": "Such struggles shouldn't define one's character for each situation. Defining one's character should be solely based on how such a person is able to reassemble such situations are relevant to their beliefs (without judging others on their beliefs). ",
            "date": "Answered September 10, 2018",
            "views": "80",
            "upvotes": " View 2 Upvoters ",
            "upvoters": [
                {
                    "user_id": "John R. Blake",
                    "user_href": "/profile/John-R-Blake"
                }
            ]
        },
        {
            "author_info": {
                "name": "Steven Ussery",
                "href": "/profile/Steven-Ussery"
            },
            "answer_text": "Yes, very much so. Good observation. You’ve nailed a piece of wisdom that most people don’t fully realize until they’re in their mid-sixties like me. ",
            "date": "Answered September 10, 2018",
            "views": "51",
            "upvotes": " View 1 Upvoter"
        }
    ]
}