{
    "title": "Does “Who knows” need a question mark? - Quora",
    "tags": [
        "Question Marks",
        "Punctuation"
    ],
    "response": [
        {
            "author_info": {
                "name": "Franc Neary",
                "href": "/profile/Franc-Neary"
            },
            "answer_text": "A good question (which even native English speakers have issues with occasionally!). Does a rhetorical question (a question where an answer is not expected or, from context, the answer is implied or suggested, or will follow soon afterwards) need a question mark? The answer is yes, and there’s a simple reason why this is so. Let’s say we are writing this question; well, we want the reader to realise that it is a question, otherwise the reader would be confused and the phrase wouldn’t make sense (“Who knows.” Who knows what/when/why/etc?). The fact that it is a rhetorical question will be demonstrated or indicated in various ways, but the reader still needs to realise that it is a question! If we are speaking, well, we demonstrate, audibly, with our voice, by using an inflection at the end, that we have just asked a question. Otherwise, again, the listener would understand what we mean. Some simple guidelines for this situation (and others involving grammatical or punctuation marks) are: if we are writing or speaking (for example, in a conversation), we are not simply writing/speaking words, we are communicating ideas, meanings and sounds, which, presumably, we want others to understand; use whatever tools (punctuation marks etc) you need to use to help facilitate that communication. Another method to consider is this: if you are writing something (like this, which is usually a part of dialogue), actually speak the words (even in your mind) and if it needs the question mark to make sense, write it; if you are speaking, then imagine whether it would seem to make sense and be understandable if it was written down. These are the tips or guidance I would give to an English language student in this situation (regardless of proficiency. Thanks for the question and I’m sure others appreciated it to (plus I hope my answer helped you and then!). ",
            "date": "Answered January 11, 2020",
            "views": "231",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Robert J. Smith",
                    "user_href": "/profile/Robert-J-Smith-11"
                },
                {
                    "user_id": "Judith Engelstad",
                    "user_href": "/profile/Judith-Engelstad"
                },
                {
                    "user_id": "Jean Girard",
                    "user_href": "/profile/Jean-Girard-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Graham Howe",
                "href": "/profile/Graham-Howe-3"
            },
            "answer_text": "Does “Who knows” need a question mark? If you are asking a question - even if it is just used as a hypothetical interjection - yes, it does need a question mark. “I wonder if it will rain today” “Who knows?”. “Who knows how long it will be before we see him again?” “Who knows where the time goes?”If you are using it as (part of) a relative clause, it should not have a question mark (unless the whole sentence is a question): “I have no idea how to fix my car and I am looking for someone who knows”. “I have a friend who knows how to speak Quechua”. (But: Where can I find someone who knows what to do?”)",
            "date": "Answered January 11, 2020",
            "views": "148",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Oliver Buckley",
                    "user_href": "/profile/Oliver-Buckley-4"
                },
                {
                    "user_id": "Gill Grant",
                    "user_href": "/profile/Gill-Grant-5"
                }
            ]
        },
        {
            "author_info": {
                "name": "Simonetta Raymon-Barker",
                "href": "/profile/Simonetta-Raymon-Barker"
            },
            "answer_text": "Depends. If your asking a question .“ who knows where Jack is “? Or whether an exclamation “who knows\" just on it's own, in which case you do not need a question mark. ",
            "date": "Answered January 11, 2020",
            "views": "58",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Innocent Okorie Nwobodo",
                "href": "/profile/Innocent-Okorie-Nwobodo"
            },
            "answer_text": "Yes, “Who knows” does need “?”. Does it need an answer? Read this Rhetorical Question Examples ",
            "date": "Answered January 11, 2020",
            "views": "46",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Tyler Knapke",
                "href": "/profile/Tyler-Knapke-1"
            },
            "answer_text": "Yes. Almost all questions need question marks, no matter how short, or long the sentence is. ",
            "date": "Answered January 11, 2020",
            "views": "77",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Linda Joseph",
                "href": "/profile/Linda-Joseph-22"
            },
            "answer_text": "Yes. ",
            "date": "Answered January 16, 2020",
            "views": "14",
            "upvotes": "0"
        }
    ]
}