{
    "title": "Does space occupy space? - Quora",
    "tags": [
        "Outer Space",
        "Astrophysics"
    ],
    "response": [
        {
            "author_info": {
                "name": "Ali Abdulla",
                "href": "/profile/Ali-Abdulla-15"
            },
            "answer_text": "Space is a mathematical concept with certain dimensions , can be finite or infinite, it depends on what is thought about, for example in quantum physics the infinite Hilbert space is usually used , the best way of space existence is its mathematical formulation with time by GR, it can be imagined as a fabric of square nets of scaler factor a(t), this fabric is the only space, where energy and matter are warping it,leading to curve it, where gravity here is spacetime fabric curvature.The expansion of the universe is its spacetime fabric expansion given as a(t)= a(t=0) e^Ht where H is Planck constant. This means the distances between celestial objects are increasing. So, no sence of saying space occupies space.!!it is a part of space with specific dimensions( t ,x,y,z). ",
            "date": "Answered January 24, 2020",
            "views": "88",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Anees Ur Rehman",
                    "user_href": "/profile/Anees-Ur-Rehman-58"
                },
                {
                    "user_id": "Jessica Pennell",
                    "user_href": "/profile/Jessica-Pennell"
                }
            ]
        },
        {
            "author_info": {
                "name": "William Mook",
                "href": "/profile/William-Mook"
            },
            "answer_text": "Space and Time are ideas and cannot be reified. Only now exists for humans. The past is over and the future hasn’t happened yet. So you are at the center of the cosmos you see what you see depends on what you think how you filter the infinity of possibilities. Young’s double slit experiment proves this, along with a number of delayed quantum eraser experiments. With no time space cannot exist as a real thing. So, space and time cannot be reified - and does not exist in any place but our minds. ",
            "date": "Answered January 23, 2020",
            "views": "116",
            "upvotes": " View 2 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Shaun David",
                    "user_href": "/profile/Shaun-David"
                },
                {
                    "user_id": "Anees Ur Rehman",
                    "user_href": "/profile/Anees-Ur-Rehman-58"
                }
            ]
        },
        {
            "author_info": {
                "name": "Denis Loubet",
                "href": "/profile/Denis-Loubet"
            },
            "answer_text": "That’s an unexpectedly deep question. From one perspective, a cubic meter of space obviously occupies space within the universe. But there’s another perspective were space is defined as outer space stretching out to infinity. The question then becomes, “Does the Universe occupy space?” and that question I cannot answer. It’s brain-boggling to even consider. ",
            "date": "Answered January 23, 2020",
            "views": "37",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Michael Helm",
                "href": "/profile/Michael-Helm-6"
            },
            "answer_text": "No more than a lamp occupies lamp. It is difficult to wrap your mind around the concept of space or time not existing, but everything that is is a thing that exists, and where it doesn’t exist is where it isn’t. ",
            "date": "Answered January 23, 2020",
            "views": "30",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Hewitt Rose",
                "href": "/profile/Hewitt-Rose"
            },
            "answer_text": "No. The space-time of the expanding universe does not expand into anything. It is all the space-time there is. ",
            "date": "Answered January 23, 2020",
            "views": "28",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Alex Berezin",
                    "user_href": "/profile/Alex-Berezin-1"
                },
                {
                    "user_id": "Anees Ur Rehman",
                    "user_href": "/profile/Anees-Ur-Rehman-58"
                }
            ]
        }
    ]
}