{
    "title": "Does space exist? - Quora",
    "tags": [
        "Relativity (physics)",
        "Quantum Mechanics",
        "The Universe",
        "Outer Space"
    ],
    "response": [
        {
            "author_info": {
                "name": "James Boettcher",
                "href": "/profile/James-Boettcher"
            },
            "answer_text": "I don't disagree with any of the answers, but symantically, I would have to say, “NO”. Not in the Classical sense. By itself Space has no intrinsic meaning, because it is only half of Time/Space. Expansion of Time/Space after the Singularity creates the illusion of Space. However, it is a useful concept for us to use within our personal space. If we accept Time and Space as entities, them we can measure things within our Reletivity Bubble and their relationships with other, which seems to have some survival value. Aether is actually not that crazy an idea. The idea that something called “nothing” can actually exist is not proven. How can nothing be something? How can anything come from nothing? Therefore Space must be filled with something. And, in fact it is. All Space in our Space/Time reality is filled up. With Fields and Photons, particles and anti-particles being created and destroyed. That was Space… What does “exist” mean anyway? ",
            "date": "Answered March 4, 2017",
            "views": "11",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Goran Savic",
                "href": "/profile/Goran-Savic-2"
            },
            "answer_text": "No — just on average we usually experience it as three-dimensional. The main point here is that we can measure how some particles interact and then mark these events as coordinates in spacetime (t,x,y,z). For normal flat-space (no mass etc.) conditions, we can correlate these coordinates using some parameters (the speed of light, for example), in general relativity we \"warp\" them, in quantum mechanics they lose their \"precision\" and introduce the quantum spin to compensate our inability to constrain it to three-dimensional geometry only etc. Everything aforementioned points to that our notion of space(time) is not complete, so giving properties to vacuum or thinking of it as a predefined background is rather questionable. In my opinion, though. ",
            "date": "Answered August 17, 2016",
            "views": "793",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Gabriel Horn",
                "href": "/profile/Gabriel-Horn-1"
            },
            "answer_text": "Yes. Not least because it’s not empty, but busy with quark/gluon (quantum) field fluctuations. This is described through quantum chromodynamics; how quarks interact with eachother through gluons. Quantum chromodynamics /   ",
            "date": "Answered June 29, 2015",
            "views": "930",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/David-Bruntwick-MSc-Soft-Eng"
                },
                {
                    "user_id": "Sushant Rawat",
                    "user_href": "/profile/Sushant-Rawat-3"
                }
            ]
        },
        {
            "author_info": {
                "name": "Daniel Merthe",
                "href": "/profile/Daniel-Merthe-1"
            },
            "answer_text": "I am at one location and you are at another, and the one invariable thing between us is space. This space is characterized by the distance between physical objects, and is found to also have curvature. I would say that this gives space the qualification of existence. ",
            "date": "Answered June 26, 2015",
            "views": "579",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Georgi Stanimirov",
                    "user_href": "/profile/Georgi-Stanimirov"
                },
                {
                    "user_id": "Paul Stockley",
                    "user_href": "/profile/Paul-Stockley"
                },
                {
                    "user_id": "Jackson Bostick",
                    "user_href": "/profile/Jackson-Bostick"
                },
                {
                    "user_id": "James Hollomon",
                    "user_href": "/profile/James-Hollomon"
                }
            ]
        },
        {
            "author_info": {
                "name": "Hee Min Lee",
                "href": "/profile/Hee-Min-Lee"
            },
            "answer_text": "Before big bang, did time and space exist? how about matter? They came out of nothing or none within ten sec. Now you can tell matters existing but no on space and time? Matters can exist without time and space? If all of them were not existing before big bang, what were they? ",
            "date": "Answered August 21, 2017",
            "views": "190",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Shanthi Bysani",
                "href": "/profile/Shanthi-Bysani"
            },
            "answer_text": "when there is nothing there,there is something and if  we found that something it would lead to another nothing that is somethingit keeps on going ",
            "date": "Answered July 3, 2015",
            "views": "90",
            "upvotes": "0"
        }
    ]
}