{
    "title": "Does every novel need paragraphs? - Quora",
    "tags": [
        "Paragraphs",
        "Novels",
        "Writing Advice"
    ],
    "response": [
        {
            "author_info": {
                "name": "Marcus Geduld",
                "href": "/profile/Marcus-Geduld"
            },
            "answer_text": "Paragraphs are more important than chapters. I’ve read novels without chapter breaks. It’s no big deal. But I could not read a novel without paragraph breaks, and I doubt you could, either. Here’s the opening of Jane Austen’s “Sense and Sensibility” with the breaks removed*. Enjoy: The family of Dashwood had long been settled in Sussex. Their estate was large, and their residence was at Norland Park, in the centre of their property, where, for many generations, they had lived in so respectable a manner as to engage the general good opinion of their surrounding acquaintance. The late owner of this estate was a single man, who lived to a very advanced age, and who for many years of his life, had a constant companion and housekeeper in his sister. But her death, which happened ten years before his own, produced a great alteration in his home; for to supply her loss, he invited and received into his house the family of his nephew Mr. Henry Dashwood, the legal inheritor of the Norland estate, and the person to whom he intended to bequeath it. In the society of his nephew and niece, and their children, the old Gentleman's days were comfortably spent. His attachment to them all increased. The constant attention of Mr. and Mrs. Henry Dashwood to his wishes, which proceeded not merely from interest, but from goodness of heart, gave him every degree of solid comfort which his age could receive; and the cheerfulness of the children added a relish to his existence. By a former marriage, Mr. Henry Dashwood had one son: by his present lady, three daughters. The son, a steady respectable young man, was amply provided for by the fortune of his mother, which had been large, and half of which devolved on him on his coming of age. By his own marriage, likewise, which happened soon afterwards, he added to his wealth. To him therefore the succession to the Norland estate was not so really important as to his sisters; for their fortune, independent of what might arise to them from their father's inheriting that property, could be but small. Their mother had nothing, and their father only seven thousand pounds in his own disposal; for the remaining moiety of his first wife's fortune was also secured to her child, and he had only a life-interest in it. The old gentleman died: his will was read, and like almost every other will, gave as much disappointment as pleasure. He was neither so unjust, nor so ungrateful, as to leave his estate from his nephew;—but he left it to him on such terms as destroyed half the value of the bequest. Mr. Dashwood had wished for it more for the sake of his wife and daughters than for himself or his son;—but to his son, and his son's son, a child of four years old, it was secured, in such a way, as to leave to himself no power of providing for those who were most dear to him, and who most needed a provision by any charge on the estate, or by any sale of its valuable woods. The whole was tied up for the benefit of this child, who, in occasional visits with his father and mother at Norland, had so far gained on the affections of his uncle, by such attractions as are by no means unusual in children of two or three years old; an imperfect articulation, an earnest desire of having his own way, many cunning tricks, and a great deal of noise, as to outweigh all the value of all the attention which, for years, he had received from his niece and her daughters. He meant not to be unkind, however, and, as a mark of his affection for the three girls, he left them a thousand pounds a-piece. Mr. Dashwood's disappointment was, at first, severe; but his temper was cheerful and sanguine; and he might reasonably hope to live many years, and by living economically, lay by a considerable sum from the produce of an estate already large, and capable of almost immediate improvement. But the fortune, which had been so tardy in coming, was his only one twelvemonth. He survived his uncle no longer; and ten thousand pounds, including the late legacies, was all that remained for his widow and daughters. His son was sent for as soon as his danger was known, and to him Mr. Dashwood recommended, with all the strength and urgency which illness could command, the interest of his mother-in-law and sisters. Mr. John Dashwood had not the strong feelings of the rest of the family; but he was affected by a recommendation of such a nature at such a time, and he promised to do every thing in his power to make them comfortable. His father was rendered easy by such an assurance, and Mr. John Dashwood had then leisure to consider how much there might prudently be in his power to do for them. He was not an ill-disposed young man, unless to be rather cold hearted and rather selfish is to be ill-disposed: but he was, in general, well respected; for he conducted himself with propriety in the discharge of his ordinary duties. Had he married a more amiable woman, he might have been made still more respectable than he was:—he might even have been made amiable himself; for he was very young when he married, and very fond of his wife. But Mrs. John Dashwood was a strong caricature of himself;—more narrow-minded and selfish. When he gave his promise to his father, he meditated within himself to increase the fortunes of his sisters by the present of a thousand pounds a-piece. He then really thought himself equal to it. The prospect of four thousand a-year, in addition to his present income, besides the remaining half of his own mother's fortune, warmed his heart, and made him feel capable of generosity.— \"Yes, he would give them three thousand pounds: it would be liberal and handsome! It would be enough to make them completely easy. Three thousand pounds! he could spare so considerable a sum with little inconvenience.\"— He thought of it all day long, and for many days successively, and he did not repent. No sooner was his father's funeral over, than Mrs. John Dashwood, without sending any notice of her intention to her mother-in-law, arrived with her child and their attendants. No one could dispute her right to come; the house was her husband's from the moment of his father's decease; but the indelicacy of her conduct was so much the greater, and to a woman in Mrs. Dashwood's situation, with only common feelings, must have been highly unpleasing;—but in HER mind there was a sense of honor so keen, a generosity so romantic, that any offence of the kind, by whomsoever given or received, was to her a source of immovable disgust. Mrs. John Dashwood had never been a favourite with any of her husband's family; but she had had no opportunity, till the present, of shewing them with how little attention to the comfort of other people she could act when occasion required it. So acutely did Mrs. Dashwood feel this ungracious behaviour, and so earnestly did she despise her daughter-in-law for it, that, on the arrival of the latter, she would have quitted the house for ever, had not the entreaty of her eldest girl induced her first to reflect on the propriety of going, and her own tender love for all her three children determined her afterwards to stay, and for their sakes avoid a breach with their brother. Paragraphs are idea organizers, but they also act as visual landmarks, which help the reader keep track of his place. If he’s reading a scanning a huge wall of text, like the one above, and he looks away from the page for even a fraction of a second, he’ll almost certainly get lost. He’ll know that possibility exists while he’s reading, and it will make him want to stop. Think of a novel (or any piece of writing) as nested levels of organization. The top level is the book. Or it might be the series, if it’s a trilogy or something longer. Within the book, the next organizational level is chapters. Sometimes chapters are divided into sections. Sections—or chapters, if there are no sections—are divided into paragraphs; paragraphs are divided into phrases; and phrases are divided into words. There are no absolute rules as to where you should place break. Which is why writing is an art, not a science. This is true on every level. You mentioned chapters. What rule states that a particular scene should be at the end of Chapter One instead of the beginning of Chapter Two? No rule. It’s up to the sensibilities of the writer. These sorts of choices even exist on the sentence level. Which of these two options is correct? Option One: He finished his breakfast and fed the cat. Option Two: He finished his breakfast. Then he fed the cat. Both. Neither. It’s up to the writer. Perhaps the second version evokes the feeling of lingering over breakfast more than the first. Is that good or bad? It depends on the specific effect the writer is trying to create. Is he writing about the morning rush work or a lazy Sunday? Let’s explore paragraph breaks using this example text: Amy shuddered. What was happening inside her bedroom? She heard a bang, then a pause, then a sort of ping, like the sonar on a battleship. Then whispers. She reached out and almost touched the doorknob, but her fingers stopped short. It was as if they didn’t belong to her or were smarter than she was. They refused to obey her commands. With a tremendous strain of will, she regained control and forced her fingers to clutch the knob. Her knuckles were white. Her stomach clenched. She could hear heartbeat. Thumb. Thumb. Thump. She opened the door. We could keep that all as one paragraph, organized around the idea of Amy opening the door. Heres another possibility: Amy shuddered. What was happening inside her bedroom? She heard a bang, then a pause, then a sort of ping, like the sonar on a battleship. Then whispers. She reached out and almost touched the doorknob, but her fingers stopped short. It was as if they didn’t belong to her or were smarter than she was. They refused to obey her commands. With a tremendous strain of will, she regained control and forced her fingers to clutch the knob. Her knuckles were white. Her stomach clenched. She could hear heartbeat. Thumb. Thumb. Thump. She opened the door. We’ve decided to separate Amy’s questions about what’s happening from her attempts to open the door. Is that better or worse than the first version? Neither. It’s just different. It’s a different choice. If you insist on right choices, don’t be an artist. Here’s yet another possibility: Amy shuddered. What was happening inside her bedroom? She heard a bang, then a pause, then a sort of ping, like the sonar on a battleship. Then whispers. She reached out and almost touched the doorknob, but her fingers stopped short. It was as if they didn’t belong to her or were smarter than she was. They refused to obey her commands. With a tremendous strain of will, she regained control and forced her fingers to clutch the knob. Her knuckles were white. Her stomach clenched. She could hear heartbeat. Thumb. Thumb. Thump. She opened the door. This one does is slow down time. Again, that’s not a good or bad thing. It’s an artistic choice. Here’s another artistic choice: Amy shuddered. What was happening inside her bedroom? She heard a bang, then a pause, then a sort of ping, like the sonar on a battleship. Then whispers. She reached out and almost touched the doorknob, but her fingers stopped short. It was as if they didn’t belong to her or were smarter than she was. They refused to obey her commands. With a tremendous strain of will, she regained control and forced her fingers to clutch the knob. Her knuckles were white. Her stomach clenched. She could hear heartbeat. Thumb. Thumb. Thump. She opened the door. It makes the final sentence a sort of climax. It already was one, but this heightens the effect. Here, we’ll break each of her actions into a discrete step: Amy shuddered. What was happening inside her bedroom? She heard a bang, then a pause, then a sort of ping, like the sonar on a battleship. Then whispers. She reached out and almost touched the doorknob, but her fingers stopped short. It was as if they didn’t belong to her or were smarter than she was. They refused to obey her commands. With a tremendous strain of will, she regained control and forced her fingers to clutch the knob. Her knuckles were white. Her stomach clenched. She could hear heartbeat. Thumb. Thumb. Thump. She opened the door. Here’s a more expressionist version, in which the prose almost acts out what it’s portraying: Amy shuddered. What was happening inside her bedroom? She heard a noise: Bang! Then a pause, then a sort of ping, like the sonar on a battleship. (Then whispers.) She reached out and almost touched the doorknob, but her fingers stopped short. It was as if they didn’t belong to her or were smarter than she was. They refused to obey her commands. With a tremendous strain of will, she regained control and forced her fingers to clutch the knob. Her knuckles were white. Her stomach clenched. She could hear heartbeat. Thumb. Thumb. Thump. She opened the door. Depending on how experimental you are, you can even try crazy things like this: Amy shuddered. What was happening inside her bedroom? She heard a bang, then a pause, then a sort of ping, like the sonar on a battleship. Then whispers. She reached out and almost touched the doorknob, but her fingers stopped short. It was as if they didn’t belong to her or were smarter than she was. They refused to obey her commands. With a tremendous strain of will, she regained control and forced her fingers to clutch the knob. Her knuckles were white. Her stomach clenched. She could hear heartbeat. Thumb. Thumb. Thump. She opened the door. The key to writing is free play. The other key is extreme rigid discipline. You need both. You need to alternate between them and play them off against each other. If you’re a beginner and all these choices are overwhelming, that’s okay. It will get easier and more fun over time. While you’re waiting for that to happen, keep this in mind: walls of text are horrible to read. So err on the side too many paragraph breaks, rather than too few.  * To see what choices Austen made, check here: http://www.gutenberg.org/files/161/161-h/161-h.htm  I post on here and elsewhere about a large variety of subjects: art, writing, theatre, relationships, education, science, philosophy, psychology, computer programming, meditation, and nutrition. You can support me and my theatre company on Patreon. ",
            "date": "Updated July 19, 2017",
            "views": "17",
            "upvotes": " View 25 Upvoters",
            "upvoters": [
                {
                    "user_id": "Ishita Tiwari",
                    "user_href": "/profile/Ishita-Tiwari-21"
                },
                {
                    "user_id": "Mallika Mathur",
                    "user_href": "/profile/Mallika-Mathur"
                },
                {
                    "user_id": "Wendi Tibbets",
                    "user_href": "/profile/Wendi-Tibbets"
                },
                {
                    "user_id": "Aishwarya Kadri",
                    "user_href": "/profile/Aishwarya-Kadri"
                },
                {
                    "user_id": "Victoria Rosaria",
                    "user_href": "/profile/Victoria-Rosaria"
                },
                {
                    "user_id": "Jayam Thaker",
                    "user_href": "/profile/Jayam-Thaker"
                },
                {
                    "user_id": "Rrezarta Isma",
                    "user_href": "/profile/Rrezarta-Isma-1"
                },
                {
                    "user_id": "Erik Gidlund",
                    "user_href": "/profile/Erik-Gidlund"
                },
                {
                    "user_id": "Britt Smith",
                    "user_href": "/profile/Britt-Smith"
                },
                {
                    "user_id": "Alexandra Pell",
                    "user_href": "/profile/Alexandra-Pell"
                },
                {
                    "user_id": "Mo Nastri",
                    "user_href": "/profile/Mo-Nastri"
                },
                {
                    "user_id": "Rahul Vyas",
                    "user_href": "/profile/Rahul-Vyas-38"
                },
                {
                    "user_id": "Simon Hayes",
                    "user_href": "/profile/Simon-Hayes-3"
                },
                {
                    "user_id": "Sabarinath Warrier",
                    "user_href": "/profile/Sabarinath-Warrier-1"
                },
                {
                    "user_id": "Ilana Halupovich",
                    "user_href": "/profile/Ilana-Halupovich"
                },
                {
                    "user_id": "Terry Drinkwater",
                    "user_href": "/profile/Terry-Drinkwater"
                },
                {
                    "user_id": "Deepak Vasudevan",
                    "user_href": "/profile/Deepak-Vasudevan-4"
                },
                {
                    "user_id": "Daniel Mosionier",
                    "user_href": "/profile/Daniel-Mosionier"
                },
                {
                    "user_id": "Karrar Rahim",
                    "user_href": "/profile/Karrar-Rahim-1"
                },
                {
                    "user_id": "Kenneth West",
                    "user_href": "/profile/Kenneth-West-3"
                },
                {
                    "user_id": "Jill Pickle",
                    "user_href": "/profile/Jill-Pickle"
                },
                {
                    "user_id": "David Caune",
                    "user_href": "/profile/David-Caune"
                },
                {
                    "user_id": "Ken Kaneki",
                    "user_href": "/profile/Ken-Kaneki-241"
                },
                {
                    "user_id": "Srikar Susarla",
                    "user_href": "/profile/Srikar-Susarla-1"
                },
                {
                    "user_id": "Mayur Aggarwal",
                    "user_href": "/profile/Mayur-Aggarwal-7"
                }
            ]
        },
        {
            "author_info": {
                "name": "Geo Lagoon",
                "href": "/profile/Geo-Lagoon"
            },
            "answer_text": "Not using paragraphs would be more of an experimental way of writing a novel. Others have done it before so it's not a new concept. Many people don't like it but there are others who do (or don't mind it). I have a feeling that with this new age of technology rising up in popularity and more and more people are turning to reading eBooks and such, I feel that more people, especially the younger generations, will be more accepting of novels that have no paragraph breaks. I say this because I've noticed many youth seem to text each other in long, unbreaking paragraphs. So for them to pick up an eBook with no paragraph breaks within it, I believe they would not have any sort of problem with it. To better answer your question, focus on the kind of audience you are trying to reach with your novel. Older generations are more traditional so they would be more inclined towards reading a book that they can flip pages and see paragraph breaks. Younger generations are more accepting of new and interesting concepts and ideas such as reading the whole book on one continuous page. There are some young adults who are in between where they can enjoy the common writing style with paragraph breaks as an eBook version and get the best of both worlds in which the style is traditional but the method of reading it is modern/new age. So take some time to define your style and what best works for you and the audience that you are trying to reach. ",
            "date": "Answered July 15, 2017",
            "views": "57",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Kenneth West",
                "href": "/profile/Kenneth-West-3"
            },
            "answer_text": "I would recommend it, at least until you're an established writer. Writing a novel without paragraphs will deter most publishers, and even if it doesn't deter all of them, it would definitely deter most of your prospective readers. As for learning when to break a paragraph, read often, and try to absorb the methodology whereby authors you enjoy reading break their paragraphs. I will say it's not a good thing to have too many disparate ideas in a paragraph. Extrapolate thoroughly on an idea in one paragraph, and then take new ideas and move on to the next one. Best of luck to you in your writing ventures. ",
            "date": "Answered July 14, 2017",
            "views": "81",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Scott Levin",
                "href": "/profile/Scott-Levin-5"
            },
            "answer_text": "yes Paragraph Structure of a Novel - How to Write a Chapter | Now Novel ",
            "date": "Answered July 14, 2017",
            "views": "37",
            "upvotes": "0"
        }
    ]
}