{
    "title": "Does taking notes in blue pen help you remember the notes better? - Quora",
    "tags": [
        "Note Taking",
        "Pens"
    ],
    "response": [
        {
            "author_info": {
                "name": "Donna Halper",
                "href": "/profile/Donna-Halper"
            },
            "answer_text": "That hasn’t been my experience at all— I tend to take my notes with a black pen. Red tends to be difficult to read, but black is generally a safe (and legible) color, and yes so is blue. However, as another commenter to this page noted, it’s not the ink color that matters— it’s the quality of the notes you take. I often find that when I re-read my notes days later, I have written half-sentences or statements that are difficult to follow (but may have made sense at the time). To avoid confusion, you may want to have a highlighting pen handy, and as you are taking notes, you can mark the key points; that will make them stand out when you read them later on, no matter what color pen you have used. Also, beware of rules that have no evidence to support them— it may indeed be true that blue pens are wonderful, but I haven’t seen credible studies that show the benefits of only taking notes in blue. I suggest finding what works for your style of note-taking. Use blue for a while, use black for a while (or some other color), and as you perfect your ability to take good notes, you can decide which type of ink supports you in reading/ understanding what you wrote down. ",
            "date": "Answered September 12, 2016",
            "views": "102",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Palash R",
                    "user_href": "/profile/Palash-R-1"
                },
                {
                    "user_id": "Lesley Rodriguez",
                    "user_href": "/profile/Lesley-Rodriguez-34"
                },
                {
                    "user_id": "Alan Wu",
                    "user_href": "/profile/Alan-Wu-13"
                }
            ]
        },
        {
            "author_info": {
                "name": "Vijay Anand",
                "href": "/profile/Vijay-Anand-61"
            },
            "answer_text": "I don’t think so as color of ink would not matter towards your remembering ability. Infact I thought black ink to be more helpful as it would be more bold as you go on writing. There is a logic that writing with green ink will have a lesser impact on your eyes and brain but not specifically. Your concentration matters more :) ",
            "date": "Answered September 6, 2016",
            "views": "49",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Mehul Prakash",
                    "user_href": "/profile/Mehul-Prakash-3"
                }
            ]
        },
        {
            "author_info": {
                "name": "Issac Raja Ratna Kumar Udayagiri",
                "href": "/profile/Issac-Raja-Ratna-Kumar-Udayagiri"
            },
            "answer_text": "No not like that.. The color you like more either blue, black, or green or sometimes magenta.. mainly the color wich comforts your eyes and brain. But prefer a fine ball pen, don’t prefer blunt ended one it really stresses you. Thank you. ",
            "date": "Answered September 1, 2016",
            "views": "6",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Ryan Thomas",
                    "user_href": "/profile/Ryan-Thomas-890"
                }
            ]
        }
    ]
}