{
    "title": "Does my blog have to have a topic? - Quora",
    "tags": [
        "Bloggers",
        "Blogs"
    ],
    "response": [
        {
            "author_info": {
                "name": "GJ Coop",
                "href": "/profile/GJ-Coop"
            },
            "answer_text": "Does a blog have to have a topic? This depends on whether you want to have a successful blog. Nobody polices what you write in a blog but there are some clear suggestions if you want to get readers to return. After all, as someone said, you are competing for people’s attention against Game of Thrones and HD pornography. To be successful, ie, to get a lot of people reading you on a regular basis, you need to be writing well, with original material. If you just regurgitate what others write the question is why would people read your interpretation rather than those who are already established and have insider knowledge. If you are writing on technology, or startups, or photography reviews, or whatever the competition for attention is fearsome. You need to write with authority to cut through. Or humorously. Preferably both. Focus on one topic allows people to immediately understand what the blog is about. If you chop and change readers who are interested in one topic may be put off when you are diverted to a completely different topic. There are 50,000 blogs started each day, or something, so there is a lot of competition. To cut through it’s probably best to focus on a specific niche, at least until you build an audience. The narrower the focus, the less competition there is. There aren’t many blogs focused on spiders, or selling whiteware, or training for an open water swim, etc. There might be fewer people in the potential audience when you develop a niche, but believe me there are people passionately interested in obscure topics all around the world. If you want genuine interaction with others writing about your passion is more likely to be successful. You might actually have something original, if not useful, to offer. If you want to build a huge audience and make a significant amount of passive income, well, what are the odds competing with the other 49,999 who started the same day, and the 50k who started the day before? And all those others who have built a huge audience. ",
            "date": "Updated September 19, 2016",
            "views": "213",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Gigi J Wolf",
                    "user_href": "/profile/Gigi-J-Wolf"
                },
                {
                    "user_id": "Cody Cook",
                    "user_href": "/profile/Cody-Cook-20"
                }
            ]
        },
        {
            "author_info": {
                "name": "Tabitha Kerbabian",
                "href": "/profile/Tabitha-Kerbabian"
            },
            "answer_text": "I think there should be a difference between a blog and a journal, which is why I put my own blog on hiatus until I figure out what I want to write about. My blog was all over the place! And that’s not a good way to provide value to your audience. Ask yourself: Why do I want to start a blog? What are my goals for my blog? What kind of audience do I want to attract? Why should someone read my blog? What value can I provide to my readers? Those questions should help point you in a direction. If you just want to start a blog as an outlet for your thoughts, I’d recommend starting to write privately first if you aren’t already. You can use an app like Evernote or journal by hand. That way, you can practice and develop a consistent tone before you share your writing publicly. If you’re starting a blog for business, then you should absolutely have a topic. I recommend checking out the seanwes podcast archive for tons of super valuable information on writing (episodes 039, 139, 117, and 246 should help), and not to mention, Sean McCabe’s Supercharge Your Writing course. If you’re set on several topics (regardless of whether your blog is for fun or for business), it’d be a good idea to employ themed days. For example if you write about three different topics, pick one day of the week to assign each topic to so that your audience knows which day to tune in for what they’re interested in reading about. No matter what direction you choose, commit to consistency. And remember that though you should have a plan and a general topic, don’t become a chronic planner and never launch your blog either. Best of luck! ",
            "date": "Answered September 11, 2016",
            "views": "70",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Pirduan Sunny",
                "href": "/profile/Pirduan-Sunny-6"
            },
            "answer_text": "Yes you need to. Even it's a personal blog, you need to let your readers/followers know what you are talking about and what's your blog is all about. You may wish to write everything under the sun that you feel like sharing, avoid that. Unless you are a superstar with papparazi hovering around you, normally readers like me may not be interested to know everything. Having a topic will make your blog more focused. It helps in attracting like-minded individuals to follow your blog. Which one do you prefer, a loyal followers or a bunch of visitors who come and go as they like? Both groups may give you high engagement rate at one point of time but one of these do not promise you a long-term consistent engagement. Don't worry if you can't find the best topic for your blog now. Continue blogging. Soon you'll discover certain posts received better responses than others. Stick to those topics. All the best. ",
            "date": "Answered September 19, 2016",
            "views": "108",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Cody Cook",
                    "user_href": "/profile/Cody-Cook-20"
                }
            ]
        },
        {
            "author_info": {
                "name": "Tibaijuka Arnold",
                "href": "/profile/Tibaijuka-Arnold"
            },
            "answer_text": "probably.its not necessary to have a topic.u have unlimted number of topics though the best way is to have a blog woth a such/particular topic.that has great impression to impress more people to read accordingly. ",
            "date": "Answered September 11, 2016",
            "views": "25",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Dilip Lillaney",
                "href": "/profile/Dilip-Lillaney"
            },
            "answer_text": "No.Its your blog, express yourself, don't worry about topics. Write what comes to your mind. ",
            "date": "Answered September 11, 2016",
            "views": "24",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Maria Daniel Deepak",
                    "user_href": "/profile/Maria-Daniel-Deepak"
                }
            ]
        },
        {
            "author_info": {
                "name": "Arinze Ewuzie",
                "href": "/profile/Arinze-Ewuzie"
            },
            "answer_text": "Yes ",
            "date": "Answered October 1, 2016",
            "views": "11",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Anderson Dourado",
                    "user_href": "/profile/Anderson-Dourado-1"
                }
            ]
        }
    ]
}