{
    "title": "Does Siri work with Google Calendar? - Quora",
    "tags": [
        "Google Calendar"
    ],
    "response": [
        {
            "author_info": {
                "name": "Luke Bornheimer",
                "href": "/profile/Luke-Bornheimer"
            },
            "answer_text": "Yes, assuming you setup your Google Calendar using Google Sync (instructions at google.com/support/mobile/bin/answer.py?answer=138740).  Once Google Sync is set up, set your default calendar to your Google Calendar and then initiate Siri. When you tell Siri to setup a meeting or event, it will create that meeting/event on your Google Calendar, which will then sync to Google's servers and populate into your web interface of Google Calendar. One point of clarification: When you ask Siri to add/invite someone to a meeting or \"make a meeting with <insert name>\", it doesn't actually invite that person. This is expected behavior whether you are using Google Calendar or iCloud Calendar. From using Siri on my iPhone 4S and witnessing the functionality and Google Calendar integration first-hand, I can say it's flawlessly-seamless and works without any issue on the Siri or Google Calendar side. ",
            "date": "Answered October 17, 2011",
            "views": "177",
            "upvotes": " View 7 Upvoters",
            "upvoters": [
                {
                    "user_id": "Joanne Cheah",
                    "user_href": "/profile/Joanne-Cheah-3"
                },
                {
                    "user_id": "Adam Ahmad",
                    "user_href": "/profile/Adam-Ahmad-32"
                },
                {
                    "user_id": "Hung Le",
                    "user_href": "/profile/Hung-Le-49"
                },
                {
                    "user_id": "Amanda Tendler",
                    "user_href": "/profile/Amanda-Tendler"
                },
                {
                    "user_id": "Jenni Iwanski",
                    "user_href": "/profile/Jenni-Iwanski"
                },
                {
                    "user_id": "Harish Venkatesan",
                    "user_href": "/profile/Harish-Venkatesan"
                },
                {
                    "user_id": "Jacob Buckley-Fortin",
                    "user_href": "/profile/Jacob-Buckley-Fortin"
                }
            ]
        },
        {
            "author_info": {
                "name": "Debankur Mukhopadhyay",
                "href": "/profile/Debankur-Mukhopadhyay-2"
            },
            "answer_text": "Yes, Siri works fine with Google Calendar. Rather than doing the physical efforts you can just say to Siri to add and events or to schedule any particular time for any particular events.It helps a lot by making the task more easier. ",
            "date": "Answered February 8, 2019",
            "views": "565",
            "upvotes": "0"
        }
    ]
}