{
    "title": "Does the word 'sad' make you sad? - Quora",
    "tags": [
        "Vocabulary of the English Language",
        "Language",
        "Understanding Emotions",
        "Emotions",
        "English (language)"
    ],
    "response": [
        {
            "author_info": {
                "name": "Rajkumar Subedi",
                "href": "/profile/Rajkumar-Subedi-2"
            },
            "answer_text": "The obsession of word sad makes you sad even when you are not sad at all. It seems to be perplexing but after some research , I came to know that the limitations, including emotions, and physical actions do get hurdled by your fixation in mind. If you commence a particular task and when someone comes and asks, “ Are you tired “? If you say, “yes, I am tired”. Same words, if, get repeated several times then you start feeling tired even when you are not tired, but it say convince yourself by saying you are not sad and not even tired, then you are not tirec.   ",
            "date": "Answered July 7, 2020",
            "views": "89",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Shariful Hamid",
                    "user_href": "/profile/Shariful-Hamid"
                }
            ]
        },
        {
            "author_info": {
                "name": "Colin Isard",
                "href": "/profile/Colin-Isard-1"
            },
            "answer_text": "Does happy make you happy? Does a smile make you happy? Over time as we build a mental lexicon of words they become networked to each and also hierarchically. Certain words will be associated with knowledge, emotions facts. The word sad will be used in sad explanations so it will be ascribed over time as igniting sadness. The depth of which will be unique to each person's life story. ",
            "date": "Answered July 7, 2020",
            "views": "34",
            "upvotes": " Answer requested by Shariful Hamid",
            "upvoters": [
                {
                    "user_id": "Shariful Hamid",
                    "user_href": "/profile/Shariful-Hamid"
                },
                {
                    "user_id": "Arazmuhammet Atayev",
                    "user_href": "/profile/Arazmuhammet-Atayev"
                }
            ]
        },
        {
            "author_info": {
                "name": "Mark Farrar",
                "href": "/profile/Mark-Farrar-15"
            },
            "answer_text": "Not on the face of it, now you ask the question, but I suppose that if you focused on the word for any emotion for long enough, you might end up feeling that emotion. Actually, my first reaction to the word “sad” was in the context of Seasonal Affective Disorder, but it still doesn’t make me feel sad. ",
            "date": "Answered July 7, 2020",
            "views": "35",
            "upvotes": " View 2 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Shariful Hamid",
                    "user_href": "/profile/Shariful-Hamid"
                },
                {
                    "user_id": "Alex W Morris",
                    "user_href": "/profile/Alex-W-Morris"
                }
            ]
        },
        {
            "author_info": {
                "name": "Aakash Saini",
                "href": "/profile/Aakash-Saini-225"
            },
            "answer_text": "Yes sometimes when the other person knows about your situation and still pretending like the never no they hurt your feelings for that thing and asking your for showing how cold hearted and loveing they are and sait it like the now it don't be sad but they actually don't care sorry its my personal experience on some point and ",
            "date": "Answered July 7, 2020",
            "views": "24",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Daniel Baisden",
                "href": "/profile/Daniel-Baisden-1"
            },
            "answer_text": "Lol! The meaning of the word comes to mind with the word, so, I think yes! I wouldn’t want to work in a room where there was one sign on the wall that said “SAD.” That is why you don’t want your mind dwelling on such things! ROFL 😂 ",
            "date": "Answered July 7, 2020",
            "views": "15",
            "upvotes": " Answer requested by Shariful Hamid"
        },
        {
            "author_info": {
                "name": "Susan Elizabeth Bambusch",
                "href": "/profile/Susan-Elizabeth-Bambusch"
            },
            "answer_text": "As a writer and an artist words come to me in color and the emotions I attribute to colors. Blue means sad. Red means anger. Pink - peace and joy depending on the intensity. Green implies envy of course, yet it also can provoke calm depending on intensity or destruction and chaos when it shifts to green/black. Jealous rage. Black is always drama. Yellow - excitement Brown is depression and white is the presence of all color, so it can be introduced as mindful adjective. ",
            "date": "Answered July 7, 2020",
            "views": "51",
            "upvotes": " View 2 Upvoters "
        },
        {
            "author_info": {
                "name": "Duraiswamy Vaidyanathan Chandrasekar",
                "href": "/profile/Duraiswamy-Vaidyanathan-Chandrasekar"
            },
            "answer_text": "Your profile quotes ‘All knowledge hurts’!… Words can burn, heal, humour, provoke or subdue and more only if those words are understandable to the hearer ( for example, a language that is foreign or a word that is unknown cannot ) and strikes a chord or a raw nerve in them to provoke an emotion. Otherwise, no. ",
            "date": "Answered July 7, 2020",
            "views": "28",
            "upvotes": " Answer requested by Shariful Hamid"
        },
        {
            "author_info": {
                "name": "Catherine Henggeler",
                "href": "/profile/Catherine-Henggeler"
            },
            "answer_text": "That word does resonate with me strongly. It doesn’t always make me sad. I do know that on my worst days, I can’t even bear to think or say that word. ",
            "date": "Answered July 7, 2020",
            "views": "25",
            "upvotes": " Answer requested by Shariful Hamid"
        },
        {
            "author_info": {
                "name": "Arazmuhammet Atayev",
                "href": "/profile/Arazmuhammet-Atayev"
            },
            "answer_text": "Actually, the words “unfurtunately” and “unluckily” make me little sad rather than the word itself:) ",
            "date": "Answered July 7, 2020",
            "views": "19",
            "upvotes": "0"
        }
    ]
}