{
    "title": "Does writing music take practice? - Quora",
    "tags": [
        "Songwriting",
        "Music Theory",
        "Music Composition",
        "Music Industry",
        "Writing Advice",
        "Musicians",
        "Songs",
        "Writing"
    ],
    "response": [
        {
            "author_info": {
                "name": "Michael Martin",
                "href": "/profile/Michael-Martin-48"
            },
            "answer_text": "I have written a lot of songs. It took me about three years of experimentation (coming up with interesting chord progressions/melodic ideas and developing lyrical themes) before I completed my first song. After that, I got on a roll and have never stopped. The one thing that changed a bit over time was that my songs got shorter and less lyrically extravagant, because I came to understand that brevity and clarity are virtues for a song that you play for others to listen to—and also, it’s easier to memorize a song if it doesn’t have too many verses or really lengthy verses. It’s also worth noting that I record snippets of musical ideas quite often, and only maybe one in 10 or 20 ever becomes a song. And then not every completed song becomes one that the band works into our repertoire. I work at it on practically a daily basis, but I come up with a “good” song about once a month. ",
            "date": "Answered December 20, 2019",
            "views": "27",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/Peachuu-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Norman Graham",
                "href": "/profile/Norman-Graham-6"
            },
            "answer_text": "To learn to do it well, YES! I had music theory in college and the instructor would rattle things off and go on and on about things that made no sense to me at the time. I attempted to write some music shortly after those classes and my attempts were futile. However, one day I was starting to write something and I got really frustrated. SUDDENLY it all seemed to click into place and I’ve been writing music now for almost 35 years. Then I needed to work on writing better lyrics so I tutored someone online in music composition and they tutored me on improving my lyrics. I now have several compositions in the U.S. Copyright Office, copyrighted with my name on them. So I guess the answer to your question is yes. ",
            "date": "Answered December 20, 2019",
            "views": "17",
            "upvotes": " Answer requested by Jenna-Lynn Roadside",
            "upvoters": [
                {
                    "user_id": "Jenna-Lynn Roadside",
                    "user_href": "/profile/Jenna-Lynn-Roadside"
                }
            ]
        },
        {
            "author_info": {
                "name": "Luke D Mcdonald",
                "href": "/profile/Luke-D-Mcdonald"
            },
            "answer_text": "Sure does and creating music (muzik) can be deceiving. Although I kinda understand the question, there are people out there(same ones that think pop tunes is electronic noise) who will not respect your music and think you will always be novice and the heel of the joke. Especially if we are talking about 1 iv v chord progressions. The more we do something. the more easily things become. Without a effort to progress forward, could be the same as the difference between dreams and goals. Js bach said music relatively speaking, is in two catagories. To glorify the Lord, and to refresh the soul. Like chess all the lines have been drawn already, There are only so many ways to make someone smile, someone dance, or the emptiness of a minor chord progresion making you sad. We know the music we make is on the right path if the people around you enjoy it. After all if your not enjoying the music you create, who will? If you can be happy with your creation, that certainly will be a way to keep your soul refreshed and possibly, someone elses ",
            "date": "Answered December 19, 2019",
            "views": "71",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Jenna-Lynn Roadside",
                    "user_href": "/profile/Jenna-Lynn-Roadside"
                }
            ]
        },
        {
            "author_info": {
                "name": "Charles Dee",
                "href": "/profile/Charles-Dee-11"
            },
            "answer_text": "It does not take practice, in the way that learning a dance routine takes practice. But the more you write, the more you will develop as a writer. ",
            "date": "Answered December 19, 2019",
            "views": "8",
            "upvotes": " Answer requested by Jenna-Lynn Roadside",
            "upvoters": [
                {
                    "user_id": "Jenna-Lynn Roadside",
                    "user_href": "/profile/Jenna-Lynn-Roadside"
                }
            ]
        },
        {
            "author_info": {
                "name": "Maurice Laperriere II",
                "href": "/profile/Maurice-Laperriere-II"
            },
            "answer_text": "It sure does. Practice, knowledge and experience. But with all of that, this will not guarantee you that you are a good composer. Inspiration is a must. ",
            "date": "Answered December 20, 2019",
            "views": "17",
            "upvotes": " Answer requested by Jenna-Lynn Roadside"
        },
        {
            "author_info": {
                "name": "Sean Cronin",
                "href": "/profile/Sean-Cronin-22"
            },
            "answer_text": "Yes. ",
            "date": "Answered December 19, 2019",
            "views": "19",
            "upvotes": " View 1 Upvoter"
        },
        {
            "author_info": {
                "name": "John Tomczyk",
                "href": "/profile/John-Tomczyk-5"
            },
            "answer_text": "Yes and study of music theory. ",
            "date": "Answered December 19, 2019",
            "views": "17",
            "upvotes": " View 1 Upvoter "
        },
        {
            "author_info": {
                "name": "Tenor Brown",
                "href": "/profile/Tenor-Brown"
            },
            "answer_text": "Does writing music take practice? Of course it does. Along with decades of study and hard work. ",
            "date": "Answered December 21, 2019",
            "views": "27",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Michael Rosenzweig",
                "href": "/profile/Michael-Rosenzweig-2"
            },
            "answer_text": "Yes ",
            "date": "Answered December 20, 2019",
            "views": "11",
            "upvotes": " Answer requested by Jenna-Lynn Roadside"
        }
    ]
}