{
    "title": "Does a man need a pickup line to impress a woman in a bar? - Quora",
    "tags": [
        "Pickup (seduction)",
        "Pickup Lines",
        "Flirting Advice",
        "Impressions (psychology)",
        "Flirting",
        "Interpersonal Interaction"
    ],
    "response": [
        {
            "author_info": {
                "name": "Leonardo Bustos",
                "href": "/profile/Leonardo-Bustos-2"
            },
            "answer_text": "I cover this extensively in my book and audiobook on Amazon titled “How to Attract Women With Humor.” You can also find more information on my website that you can find on my profile. Here is my advice on pickup lines taken from an excerpt from my book: THE TRUTH ABOUT OPENING PICKUP LINES Social scientists in several settings and experiments have determined that there are basically 3 types of pickup or opening lines, and which type are most effective with women: 1. Cute/Flippant opening line – These involve humor and generally should be used when and only you have established welcoming eye contact, because they can also be the worst failures if not. Example: “I don’t usually let cute girls hit on me, but for you I’ll make an exception” 2. Direct opening line – These consist of directly approaching a woman without any pretense whatsoever. The direct and innocuous opening lines have tested to be much more successful, especially for the inexperienced. For example: “Hi, my name is ……………. what’s yours?” or “Hi – do you mind if I sit next to you?” 3. Innocuous opening line – This is when you use something in the environment or you refer to something happening to start a conversation – for example “Hi, would you happen to know what time it is?” or “What’s good to eat here?” It’s been demonstrated many times that generally women who are most interested in long term relationships respond best to innocuous and direct opening lines, while women who are interested in short term relationships or one night stands respond better to the cute/flippant opening line. Most men believe that the cute/flippant opening line is the best, but studies show that in most cases as noted above; they are not – except in those cases where the women are not looking for a long-term relationship. Perhaps that is precisely why many men like the cute/flippant opening line best – because it saves them time if they are looking just for one nighters. The Cute/Flippant opening line also runs the biggest risk of failure when the content is cheesy or corny, when it’s delivered poorly, you haven’t established preselection and it’s being delivered to the woman who is more interested in a long-term relationship. If you’re going to use this type of opening, you should first establish welcoming eye contact and/or have supreme confidence when delivering it, otherwise it can be a recipe for disaster because it will sound to her deceptive and the person delivering it untrustworthy. ",
            "date": "Answered November 2, 2018",
            "views": "244",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Aditya Jain",
                    "user_href": "/profile/Aditya-Jain-427"
                },
                {
                    "user_id": "Davidson Julot",
                    "user_href": "/profile/Davidson-Julot-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Scott Randolph",
                "href": "/profile/Scott-Randolph-14"
            },
            "answer_text": "Of course! The one that always works for me is: “Did it hurt much?”. Then when they answer, “Did what hurt much?”. I reply, “When you fell from Heaven?”. HAHAHAHA! Thanks! ",
            "date": "Answered November 2, 2018",
            "views": "44",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Frances Wong",
                    "user_href": "/profile/Frances-Wong-19"
                },
                {
                    "user_id": "Davidson Julot",
                    "user_href": "/profile/Davidson-Julot-1"
                },
                {
                    "user_id": "Bill Smith",
                    "user_href": "/profile/Bill-Smith-1198"
                }
            ]
        },
        {
            "author_info": {
                "name": "Ashford Thomas",
                "href": "/profile/Ashford-Thomas"
            },
            "answer_text": "Nope. Pick up lines honestly don’t work. Show up with your the best James Bond face you can muster and say suavely “hey, my name’s ___.” And shake her hand. Simple and effective. Don’t overthink it. ",
            "date": "Answered November 7, 2018",
            "views": "42",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Jonathan Nordlund",
                "href": "/profile/Jonathan-Nordlund"
            },
            "answer_text": "In my experience pickup lines decreases your chances with a girl ",
            "date": "Answered November 2, 2018",
            "views": "10",
            "upvotes": "0"
        }
    ]
}