{
    "title": "Does the main idea and summary writing mean the same thing? - Quora",
    "tags": [
        "Critical Reading",
        "Reading Comprehension",
        "Summaries",
        "Ideas",
        "Essay Writing Help"
    ],
    "response": [
        {
            "author_info": {
                "name": "Maida Irshad",
                "href": "/profile/Maida-Irshad-3"
            },
            "answer_text": "No, the summary and the main idea are not same.As in the summary we write the whole story, poem in our words that what the author is trying to say in this poem.And in main idea, we write that what the main key point is the poet talking about.We wrote that key point in our words to easily understand it. ",
            "date": "Answered August 18, 2020",
            "views": "324",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Loretta B DeLoggio",
                "href": "/profile/Loretta-B-DeLoggio"
            },
            "answer_text": "No, it doesn't.  I already answered this:  let me rummage around... I can't find it.   This is the main idea:  Loretta B DeLoggio's post in LSAT, GRE, SAT, ACT  A summary includes the important facts that got us to the main idea. ",
            "date": "Answered February 14, 2016",
            "views": "36",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Monisha Barman",
                    "user_href": "/profile/Monisha-Barman-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Michael Sellars",
                "href": "/profile/Michael-Sellars-3"
            },
            "answer_text": "NO indeed. A summary may be of an article or a book. It tells readers the gist of what a author has said in your own words. You should not include ANY of your own remarks in a summary (the author wrote a good, clever expose. )summarize by condensing the text. A summary begins with an introductory sentence that states the text's title, author and main point of the text as you see it! ",
            "date": "Answered April 16, 2020",
            "views": "263",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Say Keng Lee",
                "href": "/profile/Say-Keng-Lee"
            },
            "answer_text": "The main idea is the essence of a given passage, which is often expressed in a key word or phrase. Summary writing refers to the process of condensing a given passage to only its key idea and salient points. ",
            "date": "Answered February 9, 2016",
            "views": "33",
            "upvotes": " Answer requested by Ulyses Rios"
        },
        {
            "author_info": {
                "name": "Khuldoon Hameed",
                "href": "/profile/Khuldoon-Hameed-1"
            },
            "answer_text": "No, main idea is actually something which you have to incorporate in various forms of writing. However, summary is something that explains the main ideas of the text. ",
            "date": "Answered December 31, 2018",
            "views": "71",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Sara Grimm",
                "href": "/profile/Sara-Grimm-8"
            },
            "answer_text": " What Is a Summary? A summary is a text in which you report information from someone else’s piece of writing. Characteristics of a Summary Contains brief ideas about the original text.Should be concise and include the main points only.Doesn’t include specific details like dates, statistics.Should be objective; comprise author’s views only.",
            "date": "Answered January 21, 2020",
            "views": "291",
            "upvotes": "0"
        }
    ]
}