{
    "title": "Does a story title have to be related to the plot? - Quora",
    "tags": [
        "Plot (narrative) "
    ],
    "response": [
        {
            "author_info": {
                "name": "Martin Turner",
                "href": "/profile/Martin-Turner-57"
            },
            "answer_text": "There are many ways that the story title connects with the book. At the one end of the continuum, you have Robinson Crusoe, widely regarded as the first English novel. It’s about a man named Robinson Crusoe. At the other end, you have The Name of the Rose, which doesn’t connect with anything in the book explicitly. In the film version, they add an addendum to clarify it. Some of the great book titles: Pride and Prejudice — explores the theme of the bookGreat Expectations — a candidate for ‘best book title ever’, because it was a popular phrase, and appears to be used literally until the turning point of the book, where it turns out it was being used ironicallyTo Kill a Mockingbird — references a pivotal thematic moment. No mockingbirds are killed in the bookBrighton Rock — again, a popular phrase, used here in two meanings. It establishes the location of the actionWuthering Heights — the scene of the action, but the name is chosen to convey the mood of the bookDo androids dream of electric sheep? — filmed as ‘Blade Runner’, the title is tangential to the bookThe Lion, the Witch and the Wardrobe — another candidate for ‘best book title ever’, because of the intrinsic rhythm and uniqueness of the titleThe three musketeers — a famous title. The book is actually about four musketeersThe Hound of the Baskervilles — taken with the name of the author and the principal character, this book was destined to be a best-seller from the moment it was printedThe War of the Worlds — right at the beginning of science-fiction, this book title was probably the scariest ever up to that point, and has defined about ⅓ of TV science-fictionAround the World in Eighty Days — this would seem incredibly slow now, but the title was completely intriguing at the timeThe Other Boleyn Girl — everyone who knows about history instantly knows what it’s about, and realises that they don’t really know what it’s about.The Da Vinci Code — fantastic title for a dreadful book, this had everything to draw in pseudo-historical, conspiracy-theorist readers and turn it into a massive best sellerAnd Then There Were None — Agatha Christie’s best selling book, it had to be retitled twice because the original titles were offensiveMurder Must Advertise — the title spells out the genre and the premise, and demands to be readTinker, Tailor, Soldier, Spy — a third candidate for the greatest title ever, this referenced a popular children’s rhyme but also announced its cunning and its intentions.",
            "date": "Answered December 24, 2019",
            "views": "176",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Barbara Rich",
                "href": "/profile/Barbara-Rich-22"
            },
            "answer_text": "No, not at all. A title can be anything, even a phrase or a quotation from another writer or a song. It could be symbolic of a theme in the story, or a phrase evocative of a certain atmosphere. Believe it or not, the plot is not always the most important thing about a story. That said, it’s true that most fiction does refer in some way to the plot it the title: Harry Potter and the Chamber of Secrets (We know Harry will find a chamber that has secrets), Murder on the Orient Express (Someone gets murdered on a train), and so on. Other fiction naming conventions may have only the name of the protagonist, or the name of the place where the story takes place. ! ",
            "date": "Answered December 24, 2019",
            "views": "56",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Nathan Beard",
                    "user_href": "/profile/Nathan-Beard-6"
                }
            ]
        },
        {
            "author_info": {
                "name": "Gary Adkins",
                "href": "/profile/Gary-Adkins-18"
            },
            "answer_text": "No. It has to pique the reader's interest in the kind of tale you are about to tell. It could even be ironically antithetical to the tale, but it should refer to something essential, such as the theme or the main character, action, conflict. Brevity is generally preferred, of course. ",
            "date": "Updated March 4, 2020",
            "views": "33",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Bobby Lynn",
                "href": "/profile/Bobby-Lynn-8"
            },
            "answer_text": "The title is your first opportunity to intrigue and interest a reader in your story. Using a title that has nothing to do with your book is likely to annoy any potential customer. It should at least have some connection with the plot and story, even if it is a subtle joke or play on words. ",
            "date": "Answered December 24, 2019",
            "views": "49",
            "upvotes": "0"
        }
    ]
}