{
    "title": "Does your mailing address have to be where you live? - Quora",
    "tags": [
        "Mailing Addresses",
        "Addresses (geography)",
        "U.S. Postal Service",
        "Mail"
    ],
    "response": [
        {
            "author_info": {
                "name": "R. Eric Sawyer",
                "href": "/profile/R-Eric-Sawyer"
            },
            "answer_text": "“Mailing address\" is by definition where you receive mail. If I wish to send you a letter, this is what i write on the envelope. It may be the same as your physical address, which is where you are living, but it needn't be. I could receive mail at a post office box (fairly common), or at my ex-wife's house (fairly foolish), or at a commercial facility established for this purpose. Often, the commercial courier services such as FedEx and UPS cannot deliver to a post office box, which is one of the advantages of the commercial facilities. Either one works well if you dont want to give out your physical address, or if you receive enough mail that it would be awkward, or if security of your mailbox is an issue, or if you want an assistant to pick up the mail, given the key. There could be other reasons. But “mailing address\" just lets that address be different if you want it to be. ",
            "date": "Answered September 21, 2020",
            "views": "47",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "John Long",
                "href": "/profile/John-Long-199"
            },
            "answer_text": "Unless you rent a mail box somewhere, such as the post office, yes. If you rent one at the post office, your mailing address for subscriptions, and mail is a po box number, the city/town, the state and the zip code. If you rent one at a business, such as the UPS Store, it’s their street address, unit# (that’st he number on the mail box that you rent), the city/town , the state and the zip code. ",
            "date": "Answered September 27, 2020",
            "views": "6",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Joseph Merrick",
                "href": "/profile/Joseph-Merrick-5"
            },
            "answer_text": "Original Question: “Does your mailing address have to be where you live?” No. Your mailing address has to be the address that you receive your mail. In many cases, for many people, they receive their mails at home where they live, so they use their home address, or known as physical address, as their mailing address, which is very common, perfectly valid and legal. ",
            "date": "Answered September 22, 2020",
            "views": "17",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Efrayim Bulka",
                    "user_href": "/profile/Efrayim-Bulka-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Nina Shah",
                "href": "/profile/Nina-Shah-77"
            },
            "answer_text": "The mailing address need not be where you live. Meaning your mailing address can differ from the address where you reside. However, you can choose to have the address where you live, as your mailing address. ",
            "date": "Answered September 27, 2020",
            "views": "9",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Efrayim Bulka",
                    "user_href": "/profile/Efrayim-Bulka-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Dana Hamilton",
                "href": "/profile/Dana-Hamilton-60"
            },
            "answer_text": "Well, it's meant to be but others have gotten po boxes out of the area for other reasons.but the poboxes do require a local address in tht areA ",
            "date": "Answered September 21, 2020",
            "views": "24",
            "upvotes": "0"
        }
    ]
}