{
    "title": "Does bad handwriting indicate anything about a person? - Quora",
    "tags": [
        "Graphology",
        "Penmanship",
        "Handwriting",
        "Writing Advice",
        "Character and Personality",
        "Psychology",
        "Writing",
        "Understanding Human Behavior",
        "Psychology of Everyday Life"
    ],
    "response": [
        {
            "author_info": {
                "name": "Patricia Collins",
                "href": "/profile/Patricia-Collins-7"
            },
            "answer_text": "Fine Motor Skills. There are people who have a condition known as “immature hand.” The muscles in their hands don’t have the fine control needed for writing or other activities that require fine finger coordination. (There is physical therapy for this with children, but it’s rarely diagnosed and remedied.) The condition can lead to giving up on having legible handwriting at a very early age. These days, that’s less of a disadvantage than it used to be. Typing skills employ hand muscles in a different way, so many people with immature hand don’t need to be able to write legibly once they’re out of school. Their signatures are usually scribbles, though. Careful Writing. At the other extreme are people who’s handwriting is so legible, so consistently printed or written, that you’d almost think they’d used a type font. It’s not possible to achieve this just by having dexterity. It requires slowing down a bit. In this case, the highly legible handwriting does indicate something about the person: They place a high value on being able to read what they’ve written and about whether others will be able to read what’s been written. They may even feel that their handwriting “represents” them and they want to make a positive impression. (Back in the 1800s, when gold miners went to California, many of them were illiterate. But you can find their signatures carved in rock— beautiful signatures. Yes, some of them signed documents with an X, but others had a sense that their signatures represented them, so they practiced until they perfected their signatures.) The Joy of Writing. I have unusually legible handwriting (and I’m left-handed). I love writing with a fountain pen on good quality stationery. It’s a wonderful sensory experience that’s difficult to describe. But I also take notes during working sessions (or meetings). Writing internalizes the information for me (kinesthetic learning) while giving me the ability to ask questions about information that’s been covered during the session, knowing that I can rely on what notes I’ve taken (which I can definitely read). Consequences of Handwriting. Recently, a clerk thanked me profusely for filling out a form legibly. She said that, in her job, not being able to read the information correctly can lead to serious problems. A few days ago, I received a contractor’s proposal for work his company could do for me. He printed his name and phone number on the proposal. A day later, I had a couple of questions, but I could not read three digits of his phone number. I made a few guesses, which were not correct. So, his company didn’t get the job: I couldn’t reach him. ",
            "date": "Answered September 10, 2019",
            "views": "390",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Catherine Ratliff",
                    "user_href": "/profile/Catherine-Ratliff"
                },
                {
                    "user_id": "Harmeet Singh Sokhi",
                    "user_href": "/profile/Harmeet-Singh-Sokhi"
                }
            ]
        },
        {
            "author_info": {
                "name": "James Titus Baum",
                "href": "/profile/James-Titus-Baum"
            },
            "answer_text": "My handwriting especially running writing is terrible and sloppy. I have noticed this since I have matured. I still use a pen or pencil for handwriting tasks when it is appropriate and especially for research. I also spend a lot of time doodling and making lists too. I was very good at art and manual work during high school. Yet I am a very neat and tidy person. I always prefer to be organised and methodical. I will make plans or goals before I head off somewhere and I am never spontaneous and frivolous. My younger sister has excellent handwriting skills yet she is not that smart or intellectual. She knows how to cook a great meal and look after her children. She doesn’t understand complex issues or abstract ideas preferring to socialise and chit chat all day long. My GP has terrible handwriting and I can never understand what she wrote on the prescriptions yet she is a highly professional person. ",
            "date": "Answered September 11, 2019",
            "views": "65",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Sanjana Kumar",
                "href": "/profile/Sanjana-Kumar-52"
            },
            "answer_text": "In graphology bad and good handwriting doesn’t mean anything bad or good about a person. It’s not people with bad handwriting have bad characteristics at times a person who has good handwriting can show bad signs. If by bad handwriting you mean very illegible and hastily written alphabets. Such people tend to be quick thinkers, impatient, secretive, intelligent and don’t care about their message being communicated clearly. Apart from that if I need to know more personality traits of a person I would require to have a sample wherein I can judge other things like the size, margin, slant etc. ",
            "date": "Answered September 11, 2019",
            "views": "26",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Susan Green",
                "href": "/profile/Susan-Green-244"
            },
            "answer_text": "No. And what do you mean by indicate anything about a person? Is this a judgement? It can mean the person has small motor control problems, is rushed, has developed a system of writing (I still use some of the stenongraphic way of writing when I am researching or rushed…. (but you might not even know what stenography is) ….has to do so much writing that the hand gets tired…. ",
            "date": "Answered September 10, 2019",
            "views": "24",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Harmeet Singh Sokhi",
                    "user_href": "/profile/Harmeet-Singh-Sokhi"
                }
            ]
        },
        {
            "author_info": {
                "name": "Sandra Bartlett",
                "href": "/profile/Sandra-Bartlett-17"
            },
            "answer_text": "It could indicate lack if practice (perhaps the person usually types, perhaps he rarely writes, perhaps he just learned how to write); it could indicate a lack of care, a lack of concern for how his writing looks, impatience, being in a hurry when writing, being stressed or upset or angry when writing; it could indicate poor fine motor skills due to heredity or a disability; it could indicate poor eyesight, poor writing conditions (perhaps it was dark), poor writing tools. ",
            "date": "Answered September 11, 2019",
            "views": "33",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Harmeet Singh Sokhi",
                    "user_href": "/profile/Harmeet-Singh-Sokhi"
                }
            ]
        },
        {
            "author_info": {
                "name": "Robert Anderson",
                "href": "/profile/Robert-Anderson-952"
            },
            "answer_text": "I believe that bad handwriting, and especially a bad signature, does NOT reveal anything about a person’s personality. However, such bad handwriting DOES have a cost to the writer. When I see bad signature, sometimes just a scrawl, I see that person as being too lazy to take the time to do it right. Yep, I’m biased. I admit. I don’t think that the person is not intelligent, or not smart. Just vision them as lazy even when I do not believe they are lazy. I explain this to myself by thinking that the person believes he/she has too many other more important things to do than to take a few more seconds to make a neat (readable) signature. ",
            "date": "Answered September 10, 2019",
            "views": "56",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Harmeet Singh Sokhi",
                    "user_href": "/profile/Harmeet-Singh-Sokhi"
                }
            ]
        },
        {
            "author_info": {
                "name": "Cynthia Coleman",
                "href": "/profile/Cynthia-Coleman-40"
            },
            "answer_text": "Sometimes. With some people, their handwriting is “poor,” or barely legible, because they are thinking faster than they can write. That’s me. When I was in 8th grade, my testing showed that both my spelling and handwriting abilities were on the 6th grade level. On the other hand, my reading ability was collegiate. So what does my poor handwriting skills say about me? What do you think? ;-) ",
            "date": "Answered September 10, 2019",
            "views": "146",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Karen Marie Shelton",
                    "user_href": "/profile/Karen-Marie-Shelton"
                },
                {
                    "user_id": "Elsa Kristian",
                    "user_href": "/profile/Elsa-Kristian"
                },
                {
                    "user_id": "Harmeet Singh Sokhi",
                    "user_href": "/profile/Harmeet-Singh-Sokhi"
                },
                {
                    "user_id": "Tom Hitchins",
                    "user_href": "/profile/Tom-Hitchins"
                }
            ]
        },
        {
            "author_info": {
                "name": "Ryan Staley",
                "href": "/profile/Ryan-Staley-9"
            },
            "answer_text": "I can answer with an anecdote from college. I had an English professor who said that “When I see a page of perfect Palmer Script, I know I am going to be bored because a person with something to say is in a hurry to write it down.” From reading hundreds of student papers, he knows that perfect handwriting equals bad composition, so don’t be ashamed if your penmanship isn’t so good. ",
            "date": "Answered September 10, 2019",
            "views": "41",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Harmeet Singh Sokhi",
                    "user_href": "/profile/Harmeet-Singh-Sokhi"
                },
                {
                    "user_id": "David Johnson",
                    "user_href": "/profile/David-Johnson-1083"
                }
            ]
        },
        {
            "author_info": {
                "name": "Munipalle Lakshmi Narasimha Rao",
                "href": "/profile/Munipalle-Lakshmi-Narasimha-Rao"
            },
            "answer_text": "My hand writing is bad. So I trained to write nicely by learning calligraphy. In the interview, they doubted very much and asked me to take a dictation. The first line was nice and the rest is worst. I was selected. That proves the ability to be patient in times of need and be fast at other times. Good handwriting needs good patience. ",
            "date": "Answered September 12, 2019",
            "views": "22",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Karen Herstig",
                "href": "/profile/Karen-Herstig"
            },
            "answer_text": "Usually a learning disability that can be tutored if someone cares enough about them with kindness and direction. ",
            "date": "Answered September 10, 2019",
            "views": "16",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Harmeet Singh Sokhi",
                    "user_href": "/profile/Harmeet-Singh-Sokhi"
                }
            ]
        },
        {
            "author_info": {
                "name": "Kathleen Buckley",
                "href": "/profile/Kathleen-Buckley-14"
            },
            "answer_text": "Sometimes it’s just a sign the person is writing fast. One of the smartest people I ever knew (a doctor) had horrible handwriting. ",
            "date": "Answered September 11, 2019",
            "views": "8",
            "upvotes": "0"
        }
    ]
}