{
    "title": "Does an author's original intent matter? Once a work is published, haven't they essentially released their work? - Quora",
    "tags": [
        "Intentions",
        "Book Publishing",
        "Publishing",
        "Writers and Authors",
        "Literature",
        "Writing"
    ],
    "response": [
        {
            "author_info": {
                "name": "David Lascelles",
                "href": "/profile/David-Lascelles"
            },
            "answer_text": "This is an age old discussion and is often called the ‘death of the author’ and refers to whether a piece of work belongs to the author or the readers in terms of how it is interpreted and understood. It currently seems to come up a lot with a certain J.K Rowling who is now notorious for stating facts about her works that are not necessarily evident in the texts but which she says was intended all along. I have had an experience similar to this a few times where a reader has read something into something I wrote that I had not intended to put there. Two of them are noteworthy to me. One was a short called ‘Tryptich of the Gates’ which I put in to a self published collection (Lurking Miscellany, its on Amazon if you want to check it out… *blatant plug over* :) ). The crit group I ran it through all interpreted this entirely differently. One said that they believed it was the same location in different time periods, for example. This wasn’t true (in my intention the three loosely related stories were occuring in the same period on different planets and were in fact recordings being experienced by one person from a device that had stored all these memories) but I liked that interpretation as it did fit the evidence as much as the actual intention. The style it was written in was deliberately chosen to make it vague and uncertain though I do wonder in hindsight and as a more mature writer if it needed to be clearer. The other was a short I sort of stuck at the end of a book as a freebie. It had been an entry for a short anthology ages ago but didn’t make the cut so I reviewed and revised it and rewrote bits to fit into a fantasy world I had already had publications in (previously it had been ‘ye olde generic medieval fantasy world’, I made it fit a later time period to be in line with my Gods series which involves swashbuckly black powder style stuff). This story appears at the end of ‘Gods of the Deep (also on Amazon, this is the last plug honest…). I assumed that it was obvious that this short was clearly a standalone - in the same world but a completely separate series of events. However, I got a message from a reader saying she was so looking forward to when the character in that story met up with the ones from Gods of the Deep… I said that it wasn’t the intention but then I sort of thought about it and now I am writing a sequel to Gods of the Deep in which the character from the Final Sacrifice is a featured player… and I am myself looking forward to the initial duel between her and Rachel Drake because they are both known as experts in the sword… My thoughts on this are sort of in the middle. I see it not that the author has no rights any more, nor that the readers are denied the right to comment. The author is, as the name implies, an authority on their own book and therefore should have a say. However, the readers also have the right to speculate and theorise and interpret as they wish and sometimes the author may listen to them… It’s a conversation not a lecture. Edited to add: I remember another unexpected interpretation. In the aforementioned still not even half written sequel, Gods of the City, I have a character who is a god (a fertility/god of the land style farmer’s god) and he magically produces an apple. To me this was just an obvious thing - he is a god of farming, he can produce apples at will. However, I was not (at the time) aware that one of my crit group has a PhD in Theology and she had a field day with that, especially as I had mentioned a walled garden in passing during a descriptive sequence. Is the garden Eden? Is this symbolic of the serpent? What theological points are you trying to make with these Biblical references? Is the man in the straw hat an angel? I had no idea what to say about any of the questions other than agree to consider them and incorporate some ideas in there and/or maybe change to less Judeo Christian imagry (maybe a pear?) :) ",
            "date": "Answered October 22, 2019",
            "views": "55",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Gary Buettner",
                    "user_href": "/profile/Gary-Buettner-1"
                },
                {
                    "user_id": "Katie Hunter",
                    "user_href": "/profile/Katie-Hunter-118"
                }
            ]
        },
        {
            "author_info": {
                "name": "Corwyn Berthier",
                "href": "/profile/Corwyn-Berthier"
            },
            "answer_text": "The question of what was the author’s original intent is a complex one. He may have many intentions at the same time that he must juggle whilst writing a work. He is also operating out of his intuition and imagination during the writing, and that intuition and imagination may in a sense dictate to the author various things about which he is not really considering the possible implications. Once written, edited, and published, the work exists outside the author’s mind and is a completely independent entity. At this point, everyone may read it and interpret it — including the author himself. Close readers may discern elements, meanings, and symbols in the work that the author did not consciously pursue. The author may protest that they were not his intentions, but ça ne vaut pas un pet de lapin (that isn’t worth a rabbit’s fart). If you can produce evidence from the text for a particular reading, then it must be considered one possible reading. I recall when Thomas Mann wrote Der Zauberberg. About 10 years after the work was published, a young poet and critic published a paper that among other features discussed the 7 years in fairyland story myth that the work seemed to adhere to. Thomas Mann thanked the young critic for this interpretation and agreed that it was correct — and that he had not consciously done this, but that he was perfectly aware of such mythic patterns, and he acknowledged that his unconscious mind had influenced him towards this pattern. Thomas Mann was at least an honest writer as well as a subtle one, because he understood that the connection between conscious intent and unconscious influence was not a simple thing. Writers who get bent out of shape over this question, or who deny certain undeniably valid readings as “not their original intent” are being either disingenuous or obtuse. Note that I make this point for the case of careful and supported readings, not wild speculation without evidence in the text. For an amusing take on this question, the querent should read Jorge Luis Borges’ excellent comic story, “Pierre Menard, Author of Don Quixote.” ",
            "date": "Answered October 21, 2019",
            "views": "225",
            "upvotes": " View 5 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Michael Sebree",
                    "user_href": "/profile/Michael-Sebree-1"
                },
                {
                    "user_id": "Franco Castillo",
                    "user_href": "/profile/Franco-Castillo-17"
                },
                {
                    "user_id": "Therese Down",
                    "user_href": "/profile/Therese-Down"
                },
                {
                    "user_id": "Callum Sutherland",
                    "user_href": "/profile/Callum-Sutherland-3"
                },
                {
                    "user_id": "Katie Hunter",
                    "user_href": "/profile/Katie-Hunter-118"
                }
            ]
        },
        {
            "author_info": {
                "name": "Sameer Ketkar",
                "href": "/profile/Sameer-Ketkar"
            },
            "answer_text": "I don’t believe the author’s intent matters, and I say this as an author of a dozen novels and two dozen screenplays. Once the audience gets their hands on art, they interpret it however they want. The author’s intent no longer matters because audience members have their own eyes, ears, hearts, and brains. The audience uses those things to make their own judgment, regardless of whatever the author originally had in mind. If the audience sees a completely different story from what the author intended, that generally means the author failed in his intentions. Good writers usually manage to make a majority of audience members feel what they intend, but never 100%. It’s impossible to get 100% of people to agree on anything. There are also some occasions when the audience misinterprets an artist’s intention and that ends up being a good thing. I’d say those occasions are more rare than the opposite, but they do happen. For example, one novel that I wrote under a pen name is extremely dark and disturbing. But the audience wound up interpreting it as a black comedy, and enjoyed it. I never intended it to be a black comedy while writing it, but that’s apparently how it ended up. I expected the story to have zero audience because it was so dark, but it ended up being my most popular book and spawned two sequels. I made sure to raise the black comedy level in books 2 & 3 to give the audience what they wanted. ",
            "date": "Answered October 21, 2019",
            "views": "48",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Lacey White",
                "href": "/profile/Lacey-White-36"
            },
            "answer_text": "Issac Asimov once sat in on a lecture about his famous story, Nightfall. After the lecture he went up to the professor and said that he did not understand the story at all. The professor replied, Who are you, to which Asimov replied, I am the author. The professor countered with, what makes you think you understand what the story is about? I have always found that story interesting as it highlights that we, as creators of our work, may not totally understand our own creations. The story we wrote and the story our readers discover may be two totally different things. I have often been to lectures where the audience feels the real hero of the story is different from what the writer intended. ",
            "date": "Answered October 22, 2019",
            "views": "40",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Nigel Foster",
                "href": "/profile/Nigel-Foster"
            },
            "answer_text": "An author's work belongs to them for as long as copyright law applies. Unless they’ve legally surrendered that copyright. The work does not belong to the world or society. ",
            "date": "Answered October 22, 2019",
            "views": "16",
            "upvotes": "0"
        }
    ]
}