{
    "title": "Funny argument essay ideas? - Quora",
    "tags": [],
    "response": [
        {
            "author_info": {
                "name": "Tu Vandergrift",
                "href": "/profile/Tu-Vandergrift"
            },
            "answer_text": "College is one of the most hectic periods of our lives. We usually face various challenges and tasks. So, for your coursework, you’ll need to have the best ideas. To help you out, below are some funny argumentative essay topics for college students: How To Add A Fun Twist To A Boring Summer Weekend.What Do You Do When Your Parents Don’t Remember Your Birthday?Simple Ways To Get Cash From Your Parents.Does Your Family Start All Dishes With A Dessert?Things That Your Mum Never Stops Saying!Why Do You Wish To Join Your Friend’s Family?Why Is It Important For Every Teenager To Have An iPhone Or Smartphone?Have You Ever Wished To Be An Only Child?Best Methods Of Irritating Both Your Parents And Siblings.How To Use Your Family’s Credit Card While Still A Teenager.Should We Have More ‘Stay At Home’ Dads In The World?Why Should You Get Your Grandmother A Smartphone This Christmas?What Goes On In The Mind Of A Cat?How Would The World Look Like If Aliens ruled it?What Has Feminism Ever Done For You?Why Are Dogs Irreplaceable Friends?How Did Your Mother Prepare You For School?Parental Mistakes That Are Now Too Late To Correct.Why Do Most Students Lose Attention While In Class?Scary Things Which Keep You Up During The Night.Who Do You Think Are The Funniest Historical Characters?Funny Things Preventing You From Completing Your Assignment In Time.How To Know If Your Classmates Are Telling You The Truth.What’s The Real Cause Of Global Warming?Is Being Homeless While In College That Bad?",
            "date": "Answered July 16, 2018",
            "views": "510",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Peter Anderson",
                "href": "/profile/Peter-Anderson-135"
            },
            "answer_text": "Need to get your educator's consideration? Reviewing papers is exhausting. A funny paper will make your educator snicker, recollect who you are, and possibly surrender you a knock on your evaluation. Even better, you will have a fabulous time composing and it'll be less demanding to keep yourself wakeful while you drudge away at 2:00 in the morning. Your paper can be humorous, mocking, or simply interesting.  Why you ought to trust each expression of an infomercial (pick your top choice). Why individuals like watching entertaining felines recordings. Why you are not a specialist at anything besides rather gaming. Why viewing vicious video doesn't broil your brains. Why smoking is beneficial for you. What you're driving educator never let you know. What your canine is truly considering. Why Walmart is your most loved store. Why you cherish it when your PC solidifies up. Why the client is never right. Why young people should have the most noticeably awful employments for the most noticeably bad pay.",
            "date": "Answered May 6, 2016",
            "views": "892",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Nicholas Klacsanzky",
                "href": "/profile/Nicholas-Klacsanzky-1"
            },
            "answer_text": "1. How Winnie the Pooh contributed to the hippie movement.  2. How alligators in the New York City sewer system has balanced the population of rats.  3. Global warming in largely caused by the gas cows emit. 4. We can live forever if we drink enough alcohol, as it preserves us.  5. The Twilight Saga is actually about World War III. ",
            "date": "Answered August 28, 2013",
            "views": "18",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Thompson Jerry",
                "href": "/profile/Thompson-Jerry"
            },
            "answer_text": "Argumentative essays are type of like superpowers: they allow you to get what you want using the superpower of influence. Watch this video and learn how to channel persuasion to write down a good essay. An argumentative essay is a writing part meant to persuade someone to imagine the way you do. Though it's usually prearranged as an essay, there are some specific elements that are needed in an argumentative essay. The first and the main important element in a persuasive essay is the position, or what side the author is on. For an argument essay to be effective, it must hold positive elements that will influence the audience to see things from your viewpoint. ",
            "date": "Answered February 1, 2016",
            "views": "701",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Scott Mollette",
                "href": "/profile/Scott-Mollette"
            },
            "answer_text": "Argue that Santa Claus exists. ",
            "date": "Answered December 2, 2014",
            "views": "116",
            "upvotes": "0"
        }
    ]
}