{
    "title": "Has your writing ever been compared to someone else's writing? Whose writing, and were you flattered? - Quora",
    "tags": [
        "Creative Writing",
        "Writers and Authors"
    ],
    "response": [
        {
            "author_info": {
                "name": "Dave Payton",
                "href": "/profile/Dave-Payton-1"
            },
            "answer_text": "Thanks for the A2A. There was something I was working on at one point, an epic that I thought about writing. I showed it to a small number of people, privately, who compared it to Shakespeare’s works. I was only mildly flattered by it, to be honest. However; My published writing hasn’t, and I’m actually more flattered by that fact because that tells me that I have my own style, rather than the tinge of someone else’s. As a writer, I don’t want to be compared with another writer. To me, that tells me I lack originality. Some might think it’s a good think to be compared to the Bard, but again, I don’t seek to copy his style, I want to write in my own, with my own voice, and I want my work to be recognized as having my voice, rather than someone else’s. ",
            "date": "Answered June 2, 2020",
            "views": "317",
            "upvotes": " Answer requested by Minoo Jha",
            "upvoters": [
                {
                    "user_id": "Minoo Jha",
                    "user_href": "/profile/Minoo-Jha"
                }
            ]
        },
        {
            "author_info": {
                "name": "Jacquelyn Mitchard",
                "href": "/profile/Jacquelyn-Mitchard-2"
            },
            "answer_text": "It was compared (by one of my very perceptive children) to that of Enid Bagnold, who wrote NATIONAL VELVET and THE CHALK GARDEN … and I was pretty thrilled, but also realized that I had imprinted on her writing like a duckling since seventh grad on, and read those books so many times that the way she used language had become part of my molecules. I tell my students sometimes that we “copy” the ways in which our favorite artists write because those particular voices help us find our own voices, just as PIcasso was inspired by Cezanne and Rousseau, and folded their perceptions into his own. ",
            "date": "Answered May 28, 2020",
            "views": "258",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Benedicta Laryea",
                    "user_href": "/profile/Benedicta-Laryea-3"
                },
                {
                    "user_id": "Minoo Jha",
                    "user_href": "/profile/Minoo-Jha"
                }
            ]
        },
        {
            "author_info": {
                "name": "Tim Rees",
                "href": "/profile/Tim-Rees-3"
            },
            "answer_text": "One reviewer of Raw Nerve compared the novel to James Patterson’s work. I’ve never read a James Patterson novel so I don’t know whether to be flattered or not. But the reviewer was apparently a huge fan of his, so I suppose that must be good. The review can be read on Amazon. And a reader sent me a personal message after reading The Drama Merchant. She said she loved the book and hadn’t read anything so controversial since she’d read Machiavelle’s The Prince, and I have to admit that did make me sit up straight. Definitely flattered by that :) ",
            "date": "Answered May 28, 2020",
            "views": "332",
            "upvotes": " View 2 Upvoters "
        }
    ]
}