{
    "title": "Have you ever seen critical appreciation of a poem? - Quora",
    "tags": [
        "Critical Appreciation",
        "Poems",
        "Poetry"
    ],
    "response": [
        {
            "author_info": {
                "name": "Preeti Gautam",
                "href": "/profile/Preeti-Gautam-2"
            },
            "answer_text": "Well I came across the following poem by Robert Frost today. It seemed simple after the first read, but having studied several poems at length in high school, I wanted to understand the poet's thoughts. Tried to find some good analysis about the same, and came across a pretty good one. Here is the link : Love and a Question by Robert Frost - Analysis - Write to Score Do give it a read. Love and a Question BY ROBERT FROST A Stranger came to the door at eve, And he spoke the bridegroom fair. He bore a green-white stick in his hand, And, for all burden, care. He asked with the eyes more than the lips For a shelter for the night, And he turned and looked at the road afar Without a window light. The bridegroom came forth into the porch With, ‘Let us look at the sky, And question what of the night to be, Stranger, you and I.’ The woodbine leaves littered the yard, The woodbine berries were blue, Autumn, yes, winter was in the wind; ‘Stranger, I wish I knew.’ Within, the bride in the dusk alone Bent over the open fire, Her face rose-red with the glowing coal And the thought of the heart’s desire. The bridegroom looked at the weary road, Yet saw but her within, And wished her heart in a case of gold And pinned with a silver pin. The bridegroom thought it little to give A dole of bread, a purse, A heartfelt prayer for the poor of God, Or for the rich a curse; But whether or not a man was asked To mar the love of two By harboring woe in the bridal house, The bridegroom wished he knew. ",
            "date": "Answered January 21, 2018",
            "views": "43",
            "upvotes": " View 7 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Siyu Wan",
                    "user_href": "/profile/Siyu-Wan-3"
                },
                {
                    "user_id": "Siddarth Tiwari",
                    "user_href": "/profile/Siddarth-Tiwari"
                },
                {
                    "user_id": "Prashant Toshniwal",
                    "user_href": "/profile/Prashant-Toshniwal"
                },
                {
                    "user_id": "KAMLESH I",
                    "user_href": "/profile/KAMLESH-I"
                },
                {
                    "user_id": "Piyush Sharma",
                    "user_href": "/profile/Piyush-Sharma-104"
                },
                {
                    "user_id": "Naren Kumar Sahoo",
                    "user_href": "/profile/Naren-Kumar-Sahoo"
                },
                {
                    "user_id": "Vivek Raj",
                    "user_href": "/profile/Vivek-Raj-22"
                }
            ]
        },
        {
            "author_info": {
                "name": "Perry Sams",
                "href": "/profile/Perry-Sams"
            },
            "answer_text": "Yes. I have both done and received critical reviews of my friends and my own poems; I (struggle to) critique WC Williams, Eliot, Cummings, Stevens, Dickinson, Levertov, Creeley, Bukowski, Wakoski and others. Please note that around Dewey Decimal 811- in a large library's stacks you will find books ( of poetry) and books of appreciation and criticism of poetry. When I say struggled to understand and criticize, I am being strict with myself. A lot of modern poetry is made to be pleasurable and beautiful in the language that it uses. It can be described as songs without music; or charged and energized lines which ‘touch ‘ or excite sublime feelings in the reader. And, so yes I struggled, but so do all new readers. To jot down feelings, to enjoy the nuances of nature and poetic passions; to glimpse how rhythm or careful language can be employed is a good start. ",
            "date": "Updated July 16, 2019",
            "views": "908",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Riti Rani",
                "href": "/profile/Riti-Rani-4"
            },
            "answer_text": "Yes. These are some links where I have critically appreciate the poems. Childe Harold's Pilgrimage Canto 3 | Wrytin Hymn To Intellectual Beauty | Wrytin Childe Harold’S Pilgrimage | Wrytin Immortality Ode | Wrytin My Last Duchess By Robert Browning | Wrytin Ode To A Nightingale By John Keats | Wrytin To Autumn By John Keats | Wrytin The Chimney Sweeper Of The Songs Of Experience | Wrytin ",
            "date": "Answered August 13, 2019",
            "views": "440",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Harsha Sharma",
                "href": "/profile/Harsha-Sharma-106"
            },
            "answer_text": "Yes ofcourse. A critical appreciation of a poem requires of one to analyse the poem as a whole and critically provide insight into the elements which make up the poem, such as diction, imagery, structure, rhyme, rhythm, the overall message or theme of the poem or the purpose of the poet. ",
            "date": "Answered July 18, 2018",
            "views": "22",
            "upvotes": " View 2 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Parshuram Meyalagan",
                    "user_href": "/profile/Parshuram-Meyalagan"
                },
                {
                    "user_id": "Kanhaiya Varshney (कन्हैया वार्ष्णेय)",
                    "user_href": "/profile/Kanhaiya-Varshney-कन्हैया-वार्ष्णेय"
                }
            ]
        },
        {
            "author_info": {
                "name": "Amrit Mishra",
                "href": "/profile/Amrit-Mishra-15"
            },
            "answer_text": "Yes I have written many. On which by the way? ",
            "date": "Answered January 21, 2018",
            "views": "130",
            "upvotes": " Answer requested by Shivani Dave"
        }
    ]
}