{
    "title": "Have you been practicing gratitude on a daily basis? If so, how has it changed your life? - Quora",
    "tags": [
        "Daily Basis",
        "Gratitude",
        "Advice for Daily Life",
        "Daily Life",
        "Important Life Lessons",
        "Self-Improvement",
        "Experiences in Life",
        "Psychology of Everyday Life",
        "Life and Living",
        "Life Advice"
    ],
    "response": [
        {
            "author_info": {
                "name": "Samar Sisodia",
                "href": "/profile/Samar-Sisodia"
            },
            "answer_text": " The practice of being grateful for what you have is mentioned in all sacred texts and is so powerful. I have been practising gratitude for last 3 years everyday using a mobile app and write 3 things I am grateful for everyday. I see that people crib and cry over not having something in life when they do not realise that there are several people less privileged than they are. Gratitude is the gap between a negative mindset and a positive one. Regular practice of gratitude can shift your mindset from negative to a positive one. And a positive mindset person can touch anything and turn it into gold. Here is what I have doing with my gratitude practise daily. Here are some examples :- I am grateful to universe for waking me up today.I am grateful to universe for making me powerful enough to help some people everyday.I am grateful to family for supporting me in my endeavours.I am grateful to universe for a healthy body & mind.I am grateful to universe for giving me strength to face my problems everyday.I am grateful to universe for giving me immense experiences of life.…………………….etc…. There are so many ways one can be grateful for everyday and appreciate the positive in life rather than the negatives. Just keep your thoughts aside and practise gratitude everyday. I am damn sure it will change your life for good like it did mine. Image source - google ",
            "date": "Answered October 23, 2020",
            "views": "87",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Lasya Vemulapally",
                    "user_href": "/profile/Lasya-Vemulapally-2"
                }
            ]
        },
        {
            "author_info": {
                "name": "Mayuri Kamble",
                "href": "/profile/Mayuri-Kamble-64"
            },
            "answer_text": "Practicing gratitude means thank to God for giving this beautiful life and health, wealth which all don't get. I thank to God every day because of his presence in our life, our life is going good. It changed my life for a little. It means because of my Introvert personality I get depressed all the time and I used to cry but after when I get som time for my self improvement I practice gratitude every day because if which now I get more time to deal with my personal problems and also for my improvement. We should accept that God is there when we were in the problem to helps us, but if we don't believe then how can he helps us. I'm not saying if you don't believe then he will let you go with your problems, I'm saying that after some time you will realize that whatever is happening in your life is because if God's grace, and even if we don't believe then this is your fault and you can't blame God in that situation because you don't practice gratitude for whatever happens in your life. If you practice gratitude only that time when you want something then how can he helps you, just like in human beings when you truly respects other person then he will respects you also, of you respect only for your work then he will not give you time next time. Than you.. I hope you get it.. ",
            "date": "Answered October 22, 2020",
            "views": "34",
            "upvotes": " Answer requested by Diksha Verma",
            "upvoters": [
                {
                    "user_id": "Raja Sekhar Telagathoty",
                    "user_href": "/profile/Raja-Sekhar-Telagathoty-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Pavan Raina",
                "href": "/profile/Pavan-Raina-2"
            },
            "answer_text": "It is difficult to know what we have been practicing and why for infinite reasons. For example gratitude which means thankfulness is a simple virtue but before practicing one has to have minimum mental attraction of knowing about thankfulness and/ or its value. Human mind does work more with selfish motive even if the degree of selfishness could vary a lot. The origin of this motive is a source which is existing seed which allows to attract with this virtue or reject its important. Next more important is the mind (or person) who are attracted with feeling of gratitude and desire in practicing such mind is already flowing with many other virtues as the root cause unaware thought. Those who value love and compassion or know its importance and think in growing try to dream many different things because all are springing out of their mind but are quite different from each other. When the word love comes we starts seeing in different form like mother’s love in one side to that definition a young could dream (infatuation). Another loves having pet (animals) where someone could act as lunatic in search of God. These are different formats which could have some relation with a state of mind is evolved along with age and maturity that tries to see or is searching. If it is a search unaware till the love is seen in others he has to rise and create a condition and /or be ready to connect as soon by default is seen or experienced a higher satisfying end. The senses (say) the eyes sees the external beauty and frames the meaning of love which has relation of desire in back of the mind can also one day find the comfort of feeling in mind because of someone taking away the thorn out which was plucked as a concern. The concern has been troubling him whereas the same was so easily undone out of his precious time without any second thought. Caring for others keeping selfishness away is the key and even if we can’t be ideally in selfless state the truth is our mind would be reaching in such condition even if for fraction of moment ( and unaware) which can transform the mind which is already ready by his way of life experience and his condition with quality unaware. Thus mind who has worked or experiment on search of love would find gratitude so wonderful piece of instrument which he would always like to keep with him as a jewel or ornament. If that happens probably practicing word used in the query could be right to some extent working in tandem enriching soul or level of satisfaction. Gratitude thus helping to join others, get other love and give our love which even if initiates as mental love changes with spiritual nature which is of higher quality that helps in contentment assuming our life purpose and of a higher cause as part of our responsibility. A matter of thinking and satisfied soul who has seen material can equally bend in such direction as the other who has been satisfied with as much material he had but was never a bottleneck in his search of God indirectly one day he would realize. Thus I could be said to be learning and practicing love along with caring and such feeling and am still learning I see gratitude as an off spring which provides a joyful feeling and exchange of vibrations included as a new learning. ",
            "date": "Answered October 19, 2020",
            "views": "44",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Pavitra Shanbhag",
                    "user_href": "/profile/Pavitra-Shanbhag-2"
                }
            ]
        },
        {
            "author_info": {
                "name": "Diya Limerence",
                "href": "/profile/Diya-Limerence"
            },
            "answer_text": "Sure, I’m really thankful when someone leaves the room as soon as his/her business with me is over and even remembers to close the door behind them! I’m also thankful when doesn’t blabber in my presence. I’m thankful when someone does my chores for me or when someone help’s me out. I’m thankful when someone listens to what I have to say. I’m thankful when my work gets done without any disaster. This helped me realize that I complain about too many things. I need to take a chill pill because many people still care about my existence and that I have to be ready to pay them back. ",
            "date": "Answered October 19, 2020",
            "views": "15",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Shivam Kumar",
                "href": "/profile/Shivam-Kumar-9886"
            },
            "answer_text": "Gratitude shifts your focus from what you don't have to what you have. What you focus on is what you experience more and more . Try this just one day tell your mind to focus on red color you will surprise to see you will notice more than normal amount of red color in your day to day life than a normal day. When you ask your mind to focus on something it starts searching for it. If you focus on negative aspects you mind will often highlight negative aspects, same goes for postive aspects so via gratitude you are reminding your mind to focus on positive aspects. ",
            "date": "Answered October 19, 2020",
            "views": "25",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Rosy Wason",
                    "user_href": "/profile/Rosy-Wason"
                },
                {
                    "user_id": "Abrata Misra",
                    "user_href": "/profile/Abrata-Misra-1"
                },
                {
                    "user_id": "Chaahat Kashib",
                    "user_href": "/profile/Chaahat-Kashib"
                },
                {
                    "user_id": "Ashutosh Arora",
                    "user_href": "/profile/Ashutosh-Arora-18"
                }
            ]
        },
        {
            "author_info": {
                "name": "Anitha L",
                "href": "/profile/Anitha-L-17"
            },
            "answer_text": "Not daily basis. It became habit…when there is happiest moment silently says ‘thanks to god’. When i am walking daily silently saying gratitude to god for given me good family, friends, trachers,neighbours, students, nature… Simple way of telling thanks to god for given me good health , peace and happiness in life..like wise thanks to god for given me good friends..keep them happy healthy and peaceful…. I have observed myself i dnt get any negative feelings with anybody who are coming in gratitude..mostly mind creates positive thoughts about those people…Very simple way of telling gratitude…  ",
            "date": "Answered October 19, 2020",
            "views": "374",
            "upvotes": " View 4 Upvoters "
        },
        {
            "author_info": {
                "name": "Sandra Bose",
                "href": "/profile/Sandra-Bose-1"
            },
            "answer_text": "I am always thankful for my own efforts. If i do not get up of the bed every morning, things do not get done. I am really thankful to myself to be who I am! ",
            "date": "Answered October 19, 2020",
            "views": "19",
            "upvotes": " Answer requested by Diksha Verma"
        }
    ]
}