{
    "title": "Have you ever felt like you can't forgive someone? - Quora",
    "tags": [
        "Understanding Emotions",
        "Emotions",
        "Experiences in Life",
        "Psychology of Everyday Life",
        "Interpersonal Interaction"
    ],
    "response": [
        {
            "author_info": {
                "name": "Aditi Choudhary",
                "href": "/profile/Aditi-Choudhary-140"
            },
            "answer_text": " Feeling same ..! At present..! Not going to forgive someone. My ex messaged me after two months today ..in morning ..! All the days I just prayed for the day when I am going to face him … when my timings will be in my favour. Everyday i imagine ..I visualize the days when I will be there in front of him ..not saying anything no allegation..no question of what or why ..nothing only facing .. ! Everyday I pray …for this moment ..! I am planning my day …! In my way ..in a big way ..all these days which was passing was I was praying for it ..! Today after incident..he called me ..I still don't know why …why sudden.. bt I was listening to him on another side of phone ..! The …first he messaged today the first reply I gave “ tum thiik ho ..” and the next and the next me and my anger of all the days I cried ..I felt down were striked to my mind . Said to me myself Aditi dont break this time again , dont forget your pain dont forget his way ..! Dont forget keep in yourself…! He is just something which is never in your life never will be …let your anger rule you let your pain rule not your soft emotions, not your so called love to him ..plan your day as you were planning for him .. plan his bad luck..as you were doing before but dont melt ..! Your anger your pain all is gifted by him ..plan return gift for him but dont melt …! Dont forgive him never …never untill you dont return him what damaged he has done to you …! Dont forgive. Now may be many readers are going to say .. that I should forgive him or should not keep negativity ..in myself ..I should clean my heart swipe out all the damages ..! But only a one question I want to ask? Can you hate a stranger?? No you cant hate a stranger..? We hate those whom we loved too much at one particular time or phase of life …! Hate never comes before a love …! Love is a good agent to remove hatness. ! But one things is also there that you hate only those by under a situations whom you loved . So hate and love both are equally gifted to person .. ! And both are powerful you can underestimate hate or love because you cant have an idea what a person can do in hate and as well in love…! Not only a love is blind hateness is also blind .. both are blind ! Choice of forgiving is easy but hard to do …! A very hard to do ..bcs sometimes damages are very large ..which cannot be compensated by love or forgiveness..! We all are broken , we all have broken someone's heart , we all are hurt and we all have hurted someone's feelings .. and the cycle continues no one is innocent here neither I neither he ..and neither you and that s the truth in present scenario. I am standing in the ashes who I used to be ..! Love love ..! Aditi ",
            "date": "Answered September 10, 2019",
            "views": "543",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Adrish Sinha",
                    "user_href": "/profile/Adrish-Sinha"
                },
                {
                    "user_id": "Tom Scott",
                    "user_href": "/profile/Tom-Scott-168"
                },
                {
                    "user_id": "Krish",
                    "user_href": "/profile/Krish-704"
                }
            ]
        },
        {
            "author_info": {
                "name": "Christina Wilson",
                "href": "/profile/Christina-Wilson-137"
            },
            "answer_text": "Absolutely. I can think of several times in my life where someone hurt me and I really didn’t think I would ever be able to forgive them. The hardest was when I lost a friend in a school shooting. The boy who took her life killed himself as well. I had no idea how to forgive him, both because I was in so much pain and because I would never be able to speak with him directly. It took me three years to finally forgive him. I wish there had been some foolproof formula for forgiveness I could have followed, but I’ve found forgiveness and healing look different every time. I had to come to an understanding that he was a broken and hurting human just like the rest of us. That of course does not condone his actions, but being able to see him as human helped me find the strength to forgive him. I’m so glad I did! Although he’ll never know I’ve forgiven him it has made such a big difference in my own life. I’m no longer carrying around that burden of anger and bitterness. Forgiveness isn’t easy but I’ve found it really is so important. What about you friend? Has there ever been someone you didn’t think you could forgive? ",
            "date": "Answered May 16, 2018",
            "views": "72",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Jayne Patton",
                "href": "/profile/Jayne-Patton-1"
            },
            "answer_text": "About 16 years ago there was a woman who hurt me beyond years and I forgave her, then I un-forgave, her. I was back and forth like that over and over again. I knew I needed to forgive her, but I just wasn’t able to make it stick. I prayed many times for God to help me forgive her. At that time one of my sons was a drug addict and it’s hell to go through that as a parent. Her son was also an addict. So one day I was leaving somewhere and she was arriving and there was no way to avoid her without being extremely obvious. So I greeted her and hugged her. When I hugged her, instead of anger, my heart was filled with love and compassion, because I knew what she was living through with her son. I felt the weight of the unforgiveness lift off my shoulders. It was so wonderful to finally be able to forgive her. That was about 6 years ago and the forgiveness stuck. ",
            "date": "Updated November 7, 2018",
            "views": "105",
            "upvotes": " Answer requested by Solange Ingabire",
            "upvoters": [
                {
                    "user_id": "Jordan Hernandez",
                    "user_href": "/profile/Jordan-Hernandez-50"
                }
            ]
        },
        {
            "author_info": {
                "name": "John Bruss",
                "href": "/profile/John-Bruss-2"
            },
            "answer_text": "For sure. My father and the three women who decided to divorce me come to mind. At 18 when I was considering suicide, I “saw the light” to let go of all my condemning others (and myself) and stop putting deep trust in others. So I made an agreement with Jesus to trust in God (the metaphor for virtue and ideal love) and not in any people or even myself. Over the next few years I learned how to forgive my father and see he was doing nothing more than “what he was capable of” in the best way “he knew” how to. It made no difference if it hurt me and caused me to hate him….those were my responses, not likely his intentions at the time. So inside of me, I forgave him and also myself for having hated him. Later with my wives, I was already practiced in forgiving but I admit that my first wife (and her intense anger) was even harder for me to forgive. But I saw that condemning and hate hurt me, not her. I saw I was buying what she was selling (anger and hate) and I decided I would not buy that. So I decided I’d care about her wellbeing (and still do now, 30 years later). Later she called and apologized for her anger and hate in the marriage and divorce. She said she was in a 12 step program to shed her hate since she was sexually abused by her father and uncle as a child and grew to distrust all men. I told her I had forgiven her. So it became a sad pattern that I repeated twice more by marrying women who hated their fathers (one said she didn’t but during the divorce she admitted she did). Hope my reply helps someone. ",
            "date": "Answered May 20, 2019",
            "views": "339",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Darlene Polishak",
                    "user_href": "/profile/Darlene-Polishak"
                },
                {
                    "user_id": "Jordan Hernandez",
                    "user_href": "/profile/Jordan-Hernandez-50"
                }
            ]
        },
        {
            "author_info": {
                "name": "Vijay Samuel",
                "href": "/profile/Vijay-Samuel-32"
            },
            "answer_text": "Yes. I had helped a younger engineer working in my division in developing his career by guiding him every step of the way. I tried my best to be his mentor, enhancing his capabilities and discouraging his negative aspects. Later, when I started my own company, I took him in, and gave him independent responsibility to handle sales work. From that point, he started disappearing for days, claiming to be busy with sales work. When he didn't bring any order for 3 months, I was surprised but only gave him a warning. When he could not get orders for the next quarter too, I told him that I might have to consider terminating him, if he didn't show good performance within the next couple of months. A few weeks later, I was shocked to get information through a third party that my guy was trying to get orders for my competitor, while still working for me. I collected necessary evidence and confronted him. Initially he didn't admit his wrongdoing, but he had to admit it when I brought up the evidence. I could not forgive him for betraying my trust, after I had mentored him for over 3 years. I sacked him right away and told him not to meet me again. ",
            "date": "Answered May 20, 2019",
            "views": "78",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Alessandro Magnoni",
                "href": "/profile/Alessandro-Magnoni-1"
            },
            "answer_text": "just. do. it. hating on someone and completely devoid them of your forgiveness takes time, and work if you really don’t care you should forgive anyone you are referring to people feel guilty, and if they want your forgiveness, just give them and move on, you are not forced to do it in your mind, just tell them, at least they are going to feel better as a human being I did all kind of f*cked up things to others, on mistake or not, I always feel bad inside of me and I can help it, if they forgive me I can move on forgiving doesn’t mean that after that it’s like it didn’t happen anything, you aren’t forced to keep contact or pass time with someone if you don’t wan’t forgiving is the best way to make you and the guilty one(s) to move on ",
            "date": "Answered May 16, 2018",
            "views": "87",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "MJ Rotella",
                    "user_href": "/profile/MJ-Rotella"
                }
            ]
        },
        {
            "author_info": {
                "name": "Tammy Gregg",
                "href": "/profile/Tammy-Gregg-1"
            },
            "answer_text": "Frequently. I still feel negative for several circumstances. My first ex who said he'd marry me, but then broke up with me after 4 years of this vain promise, my second ex who made it seem he cared a lot for me but got bored, my ex-friends who ghosted on me… Forgiveness is the hardest thing to do, because we don't know for certain how to heal psychological hurt. We have better knowledge of healing physical pain, if it's possible. But where do we put the bandage for our mind? ",
            "date": "Answered November 7, 2018",
            "views": "70",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Jack Daw",
                "href": "/profile/Jack-Daw-21"
            },
            "answer_text": "There is one person whom I still hold a grudge against. I often consider ways it might be satisfying to equalize her fortune. But it's been over a year now since she delt me such a shit hand and every time I check in on her existence on the net I notice she's ruining her own life more than I ever could anyways. Cheating on her boyfriend and selling her body, failing school, not being able to hold a job, probably on drugs again I'm assuming from her income in and out ratio. So I'm actually slowly getting over thoughts of malice since she's so ept at destroying her own life. ",
            "date": "Answered December 11, 2018",
            "views": "116",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Angie",
                "href": "/profile/Angie-540"
            },
            "answer_text": "Yep! My father left when I was 8 then came back when I was 18. I am now 26 and still hold resentment towards him. He doesn’t even have a good reason to why he left and stayed gone. He’s a fucking idiot, so I don’t expect much from him. *shrugs* Some people are just fucking dumb and keep repeating history. Ugh. ",
            "date": "Answered December 11, 2018",
            "views": "32",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Stephen Whitehead",
                "href": "/profile/Stephen-Whitehead-16"
            },
            "answer_text": "Yes, several times in my life with different people. But one can find a place in one’s heart where forgiveness resides, even if the memory remains. It is good to forgive, just do not forget the lesson learned. ",
            "date": "Answered May 16, 2018",
            "views": "90",
            "upvotes": " Answer requested by Solange Ingabire"
        },
        {
            "author_info": {
                "name": "Ron Leighman",
                "href": "/profile/Ron-Leighman"
            },
            "answer_text": "Too much luggage to carry to the forgiveness train. So my answer is no. I not a saint, and I’m not God. ",
            "date": "Answered May 17, 2018",
            "views": "30",
            "upvotes": " Answer requested by Solange Ingabire"
        }
    ]
}