{
    "title": "Have you ever read a scene in a scary stories that scared you completely? Please recommend me some! - Quora",
    "tags": [
        "Scary Stories",
        "Horror Stories",
        "Horror (genre)",
        "Book Recommendations"
    ],
    "response": [
        {
            "author_info": {
                "name": "Joe Thompson",
                "href": "/profile/Joe-Thompson-145"
            },
            "answer_text": "Clive Barker - Weaveworld Intense fantasy horror. Features Immacolata aka the Incantatrix aka The Witch, one of the Seerkind that live in Weaveworld (a magical land woven into a carpet).  While an embryo in her mother's uterus, Immacolata manifested her inherent evil for the first time, using the umbilical cords of her triplet sisters in order to strangle them. As a result, she was the only one of the triplets to be born alive. However, even though she murdered her sisters, the young Immacolata also bound them with a spell that forced both of them to constantly accompany her in the form of ghosts throughout her life and protect her. Indeed, the two sisters (the Hag and Magdalene) were forced to serve their sister as ectoplasms, although they were granted the promise that as soon as their assistance was no longer required in her ploys, she would instantly dismiss them to find death and eternal rest. Immacolata spent most of her childhood wandering around graveyards and having a morbid interest in death and pain. - wiki The scenes where the hero Cal is set upon by the Hag and Magdalene, and then later when set upon by their “fruit” are terrifying beyond comparison.  Once you’ve devoured this go for Imajica and get haunted by the Nullianac. ",
            "date": "Answered August 14, 2020",
            "views": "268",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Ruth Garcia",
                    "user_href": "/profile/Ruth-Garcia-201"
                }
            ]
        },
        {
            "author_info": {
                "name": "Daniel Pembrink",
                "href": "/profile/Daniel-Pembrink"
            },
            "answer_text": "there was a story about a guy dying and meeting god, the first thing of his worries was about his family that would be without him. God just laucged and said that this waht he liked about humans. Anyways gods told him that he would be reincarnated to a poorfamily in china to 1930s or something. the guy got surpised and asked so the hindus had right all along? God said not exactly or maybe, then mentioned that everysinge human on earth was him, Then the guy said am I hitler? Yes Am i mao? YEs am I genigs khan? Yes Am i theo ne killing my self on earth? Yes Anyways I do not remmeber the story well but you get the point everysingle human were just a single being being reincanated allthe time. and the pourpose was to gian experience or something to grow up and become a god among the many. Not scary exactly but it really makes your head spinn ",
            "date": "Answered August 18, 2020",
            "views": "95",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Ruth Garcia",
                    "user_href": "/profile/Ruth-Garcia-201"
                }
            ]
        },
        {
            "author_info": {
                "name": "Thea Hutcheson",
                "href": "/profile/Thea-Hutcheson"
            },
            "answer_text": "In The Haunting of Hill House, by Shirley Jackson, Eleanor and Theodora are sharing a room and Eleanor wakes to a banging. Coming out of sleep, she thinks it is her mother banging her cane on the wall to ask for help, but then completely wakes up and remembers that her mother is dead and she is in the house, taking part in a study. Afraid, she takes Theo’s hand across the way in the next single bed. A series, of frightening events take place and Eleanor takes solace in being able to hold Theo’s hand. But she starts complaining that Theo is squeezing too hard. Then the supernatural activities stop and Theo sleepily asks what has been going on. Clearly, Theo has been asleep during the entire scene while Eleanor was awake, experiencing the entire event on her own. Eleanor asks (I think), “Whose hand was I holding?” As a teenager, I was terrified. The entire book was terrifying. Jackson was a master writer and leads you through the story, taking you exactly where she wants you to go. ",
            "date": "Answered August 15, 2020",
            "views": "101",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Ruth Garcia",
                    "user_href": "/profile/Ruth-Garcia-201"
                }
            ]
        },
        {
            "author_info": {
                "name": "Gerard Smith",
                "href": "/profile/Gerard-Smith-103"
            },
            "answer_text": "Not really scary, but the supernatural stuff that’s going on inside this book is making my head spins sometimes. The book title is “Midnight Bookstore”. So this book is a story of a doctor that died and reincarnate in the body of a bookstore owner. As he reincarnate, he was able to enter the world/realm of ghost. He became the Envoy of the two worlds, making life and death becoming a stuff that he is used to. So you can try and search for this book online. I think it is also available on some of the reading platform so you can check it out too. ",
            "date": "Answered October 1, 2020",
            "views": "55",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Silvia Smith",
                "href": "/profile/Silvia-Smith-37"
            },
            "answer_text": "I always get scared completely whenever I read Stephen King stories. But the most that scare me out completely would be Pet Sematary. ",
            "date": "Answered September 10, 2020",
            "views": "47",
            "upvotes": "0"
        }
    ]
}