{
    "title": "Have you ever vandalized your school? - Quora",
    "tags": [
        "Vandalism"
    ],
    "response": [
        {
            "author_info": {
                "name": "Robyn Weiss",
                "href": "/profile/Robyn-Weiss-1"
            },
            "answer_text": "Just yesterday in fact!* I was wandering around with a couple of friends in the hallways yesterday, taking pictures for photography, but mostly just wandering around. Whlist wandering around the hallways, I found a small spray bottle of “I can't believe it's not butter”. So I picked it up and carried it around for a bit, tossing it in the air and just fidgeting with it in general. While we were passing the junior and senior lockers, I got a brilliant idea - “ I'm gonna spray ‘I can't believe it's not butter!’ on the little divide between lockers!”. Even in our little four-person group, reactions were mixed. Two of them left, because they wanted nothing to do with my idea (the smart ones as you can see), while my (second) best friend stayed behind and laughed. It was fun, I have to say, but unfortunately that's not were it ends. See, we met another friend of ours in the hallway, and she told me to spray someone she didn't like’s locker with the fake butter stuff. At this point, my best friend left. Even I felt a little uneasy about this, as it is an asshole thing to do, but my friend kept pressing me and I was kind of on an impulsive roll at this point, so I wasn't thinking too much and I figured ‘Why not? I don't know this person anyway?’. Afterwards I threw the fake butter out, as I was done with my little prank and I didn't want to have a bunch of people seeing me walking around with spray-on butter(then there’d be no question who it was!) Oh yeah, it may also be helpful to add that some freshman took a Snapchat of the first incident. Fast forward to today, and first, my locker-neighbor asked why I sprayed her friends locker. I apologized, of course. During second hour, I was called to the office.** They asked me why I did it and all that (they were polite and so was I, so there were no problems)and sentenced the girl who told me to spray the locker and I to cleaning the sophmore row of lockers, a pretty good punishment if you ask me, way better than calling my mother or making me stay after school. The spray came off very easily. Anyways, that's the story of how I ‘vandalized’ my school, maybe you at least got a laugh in at my expense. *I don't know if this actually counts as vandalism but I think so? Also, it was obviously not permanent, as it was fake butter. **This means someone snitched of course, because the office doesn't just randomly go through the video footage of every single day. ",
            "date": "Answered January 4, 2018",
            "views": "16",
            "upvotes": " View 11 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Vixenca .",
                    "user_href": "/profile/Vixenca"
                },
                {
                    "user_id": "Voltron Guy",
                    "user_href": "/profile/Voltron-Guy"
                },
                {
                    "user_id": "Toby James",
                    "user_href": "/profile/Toby-James-35"
                },
                {
                    "user_id": "Carson Crays",
                    "user_href": "/profile/Carson-Crays"
                },
                {
                    "user_id": "Suprateek Nag",
                    "user_href": "/profile/Suprateek-Nag"
                },
                {
                    "user_id": "Jack Nickelson",
                    "user_href": "/profile/Jack-Nickelson-10"
                },
                {
                    "user_id": "Alex Bryan",
                    "user_href": "/profile/Alex-Bryan-20"
                },
                {
                    "user_id": "Nathaniel Webster",
                    "user_href": "/profile/Nathaniel-Webster-4"
                },
                {
                    "user_id": "Muhammad Pasha Hakim",
                    "user_href": "/profile/Muhammad-Pasha-Hakim"
                },
                {
                    "user_id": "Juliana Navia",
                    "user_href": "/profile/Juliana-Navia"
                },
                {
                    "user_id": "Theodora Tang",
                    "user_href": "/profile/Theodora-Tang-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Chandra Hanes",
                "href": "/profile/Chandra-Hanes"
            },
            "answer_text": "Not permanently - that would be stupid. However, when I was in high school some friends and I got bored after a couple of snow days. Somehow we got our hands on dozens of rolls of crepe paper and proceeded to cover the landscaping all around our school. It warmed up a bit after that and it all got soaked through. The next school day, instead of a half-acre of crepe paper everywhere, the snow was completely tie dyed. I have to admit we were a little disappointed, but overall it looked amazing and lasted for a good week. That was before cameras everywhere, so we never got caught. (Unlike my brother, who got into the school through an unlocked skylight and proceeded to trash the place. No damage, just a mess. Didn’t realize he had tripped the silent alarm and was arrested-the dummy.) ",
            "date": "Answered January 4, 2018",
            "views": "368",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Hannah Lee",
                "href": "/profile/Hannah-Lee-383"
            },
            "answer_text": "Yeah, just now actually. My first class is biology, and there’s a really boring lecture, so I was doodling on my desk with a pen. the desks in this class look like this  So it’s hard to vandalize the top of the desk with a pen, so I just drew on the wood part under it. Then, in my 2nd period class, we have normal desks.  like this but with a yellow chair. so I grabbed a sharpie from my pencil pouch and leaned across and wrote hannah wuz here on the back of the chair. the girl in front of me was also drawing on the desk so she never noticed lol I vandalize all the time so it is pretty normal ",
            "date": "Answered January 5, 2018",
            "views": "338",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Tamilselvi M",
                    "user_href": "/profile/Tamilselvi-M"
                }
            ]
        }
    ]
}