{
    "title": "Have countries ever changed their names? Which country has changed their name the most? - Quora",
    "tags": [
        "Country Names",
        "Name Changes",
        "Given Names",
        "Etymology",
        "Geography",
        "World History",
        "Countries of the World",
        "International Relations",
        "Politics"
    ],
    "response": [
        {
            "author_info": {
                "name": "Richard Turay",
                "href": "/profile/Richard-Turay-1"
            },
            "answer_text": "Yes, of course, renaming a country gave a sense of national unity/sovereignty. At independence: Bangladesh (formerly East Pakistan), Botswana (Bechuanaland), Ghana (Gold Coast), Indonesia (Dutch East Indies), Malawi (Nyasaland) and Zimbabwe (Rhodesia) was created. The Czech Republic has changed its name to a shorter variant called Czechia, however, both names are used interchangeably. The Congolese Dictator Mobutu Sese Soko, changed the country name from the democratic republic of congo to Zaire. In 1997 it changed back to DRC. Thomas Sankara, a charismatic African leader who was dubbed Africa’s “Che Guevara” changed his country name from upper volta to Burkina Faso meaning the “land of the upright people”. In 1989, the military government in Burma renamed to country Myanmar, however, western nations such as the US and UK still called the country Burma, as a result, the country is either called Myanmar or Burma. The king of Swaziland in 2018, fifty years after independence from the British, renamed their country eSwatini meaning “Land of Swazi in English it still means “Swatini” In 1975, Dahomey becomes Benin. Further reading Countries that changed their names Countries that changed their names, when and why ",
            "date": "Updated May 2, 2020",
            "views": "474",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Brian Hatley",
                    "user_href": "/profile/Brian-Hatley-2"
                },
                {
                    "user_id": "Oscar Mayorga",
                    "user_href": "/profile/Oscar-Mayorga-9"
                }
            ]
        },
        {
            "author_info": {
                "name": "James Perkins",
                "href": "/profile/James-Perkins-31"
            },
            "answer_text": "Lots of examples! The two Congos. The western one was once the French Congo, and is now the Republic of Congo or Congo-Brazzaville, distinguishing by its capital. The other Congo was once the indigenous Kongo kingdom, was briefly the German Congo, then the Congo Free State (private property of the Belgian king), then the Belgian Congo, then the Democratic Republic of Congo, then Zaire, and now it’s DRoC again. There was also a Portuguese Congo, but that is now part of Angola.Ivory Coast / Cote D’Ivoire. There’s a French speaking party and an English speaking party, so the name of the counrty flips back and forth depending on which one is in power.For some time after the divorce from Slovakia, the Czech Republic was noun-less. They’ve since settled on Czesko, or Chechia in English.",
            "date": "Answered April 30, 2020",
            "views": "169",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Oscar Mayorga",
                    "user_href": "/profile/Oscar-Mayorga-9"
                }
            ]
        }
    ]
}