{
    "title": "How long on average does it take to write a five page research paper? - Quora",
    "tags": [
        "Academic Writing",
        "Academic Publishing",
        "Academic Research Papers",
        "Academic Papers",
        "Academic Research",
        "Scientific Research",
        "Research",
        "Writing Advice"
    ],
    "response": [
        {
            "author_info": {
                "name": "Scott E. Fahlman",
                "href": "/profile/Scott-E-Fahlman"
            },
            "answer_text": "For a good writer with lots of experience, the writing itself may not take very long — a day or so, maybe less — once you have something useful to say and understand it well enough to say it clearly. If you have problems crafting a coherent sentence or problems getting started or problems with the mechanics of writing — and especially if you are not a fluent speaker of English (or whatever language the paper is in) — it could take much longer. Maybe forever. It’s worth pointing out that if five pages is a hard upper limit, stuffing a ten-page idea into a five page paper could take much longer than just writing the ten pages. And it could take the reader much longer to understand the ultra-dense five-page paper as well. That’s why I’m not a fan of hard upper or lower limits. The paper should be as long as is required to get the material across in the clearest possible form (for the intended audience), and no longer. But also no shorter. Guidelines as to the desired length are OK, as long as they are not too rigid. ",
            "date": "Answered March 10, 2019",
            "views": "165",
            "upvotes": " View 71 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Nathan Grodzinsky",
                    "user_href": "/profile/Nathan-Grodzinsky"
                },
                {
                    "user_id": "Kaushik Prabhu",
                    "user_href": "/profile/Kaushik-Prabhu-1"
                },
                {
                    "user_id": "Bhume Poom Chantaramolee",
                    "user_href": "/profile/Bhume-Poom-Chantaramolee"
                },
                {
                    "user_id": "Joe Smerdon",
                    "user_href": "/profile/Joe-Smerdon"
                },
                {
                    "user_id": "Michael Sellars",
                    "user_href": "/profile/Michael-Sellars-3"
                },
                {
                    "user_id": "Daniel Drennan",
                    "user_href": "/profile/Daniel-Drennan-3"
                },
                {
                    "user_id": "NN Misra",
                    "user_href": "/profile/NN-Misra"
                },
                {
                    "user_id": "Sandeep Maddu",
                    "user_href": "/profile/Sandeep-Maddu"
                },
                {
                    "user_id": "Artur Ryazanov",
                    "user_href": "/profile/Artur-Ryazanov"
                },
                {
                    "user_id": "Kazi Adnan Rahman",
                    "user_href": "/profile/Kazi-Adnan-Rahman"
                }
            ]
        },
        {
            "author_info": {
                "name": "Martina Michalikova",
                "href": "/profile/Martina-Michalikova"
            },
            "answer_text": "There is no “average” here: writing a five page paper can take anything between a week and a year (or even more). If you are well prepared, you can easily write a five page paper within a week. Even students that write their very first paper manage to complete the first draft within 5 days in my course Writing laboratory. Well prepared means: all of the data is there, analyses are finished, main message & storyline are settled, figures & tables are created, the relevant literature is identified & read, and the journal is selected. For first-time authors, it is also recommended to think about some points for Introduction & Discussion. It feels great to reserve a whole week and fully focus on writing. If you avoid distractions, the progress you have every day is immense! Though in order to achieve such productivity, you should strictly separate drafting and revising, avoiding to fiddle around every sentence that you put down. If you want to know more: here are my Six principles for writing a better first draft faster. ",
            "date": "Answered July 9, 2019",
            "views": "17",
            "upvotes": " View 3 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Arthur Alfaix Assis",
                    "user_href": "/profile/Arthur-Alfaix-Assis"
                },
                {
                    "user_id": "Francis Peralta",
                    "user_href": "/profile/Francis-Peralta-8"
                },
                {
                    "user_id": "David Patrick Kateete",
                    "user_href": "/profile/David-Patrick-Kateete"
                }
            ]
        }
    ]
}