{
    "title": "How to create a blog? Which website should I prefer - Quora",
    "tags": [
        "WordPress",
        "Blogs",
        "Blogging",
        "How-to Question"
    ],
    "response": [
        {
            "author_info": {
                "name": "Gopi",
                "href": "/profile/Gopi-26"
            },
            "answer_text": "First of all I want to convey my wishes to you. Now a days blogging is consider as a self business which can be start by any one. But, to be successful in blogging you must have some qualities.  Good writing skill. To be more precise you need to have good interactive writing skill.enthusiasticeager to learn new thingsstrong in your nicheSEO, Page rank,  Google crawler and many more.for the beginners its is recommended to go for Blogger blog. Learn how to write post, publishing it, page rank, about Google robots. Once you've got some knowledge on blogging it's better and recommended to go for Wordpress.  Wordpress is user friendly and customization is easy in Wordpress. But in case of Blogger you have not any control over your blog you can post and manage your post alone. Google can delete your blog without any prior intimation(they wont actually) if you cross their policies.  But in case of Wordpress you can have full control, N number of themes, easy customization, many plugins to manage your work.  * you can able to migrate your site from Blogger blog to Wordpress with out losing your rank and views.  Any doubts still comment here I'll explain. ",
            "date": "Answered April 1, 2016",
            "views": "55",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Balaji Elumalai",
                "href": "/profile/Balaji-Elumalai-3"
            },
            "answer_text": "If you are looking for tons of visitors, please go ahead WordPress.com If you are looking for more customization, commercial move, etc.. Go for blogger.com Blogger allows you to post article, pages, and more customization, even you can add your custom domain name , that helps your blog look like .com websites. Anyway WordPress allows too.  Just compare blogger and WordPress before you go, both are free. Both allows to upload free images. Etc. ",
            "date": "Answered June 25, 2015",
            "views": "17",
            "upvotes": "0"
        }
    ]
}