{
    "title": "How is it possible for a book to be scary? - Quora",
    "tags": [
        "Scary Books",
        "Horror Books",
        "Scary"
    ],
    "response": [
        {
            "author_info": {
                "name": "David Kircher",
                "href": "/profile/David-Kircher-1"
            },
            "answer_text": "In order for a book to be scary you must have a couple of things. A powerful story: it’s not enough for a story to just try to be scary. the story must be capable of making you feel what the character was feeling, it must be wrote in such a way that the act of reading it is capable of blocking out the reality around you. pulling you so deep into the book that when something scary happens to the character you forget that you are reading it and feel like you are the character. An appropriate setting: The location where you are reading the book is almost as important as the book itself if it is going to be scary. if you are in a comfortable secluded location where you can relax and experience the book without outside distractions or worries then it is going to be far easier to become absorbed in the book. An active imagination: every author has to try to find the balance between enough details to allow you to see the setting and the events taking place in the book, but not giving you so many details that you lose sight of the story through the details. the more active your imagination is the easier it is for you to fill in the details that the author has to leave out. so while the book that has the perfect balance will allow anyone to experience the book deeply those with a more active imagination will have an easier time becoming engrossed in the book. The Preceding was simply the thoughts of a humble reader and should not be taken as a professional opinion. Comments, critiques, and opinions welcome. ",
            "date": "Answered December 10, 2017",
            "views": "150",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Andrew Brown",
                    "user_href": "/profile/Andrew-Brown-2"
                },
                {
                    "user_id": "Gurinder Singh",
                    "user_href": "/profile/Gurinder-Singh-443"
                }
            ]
        },
        {
            "author_info": {
                "name": "Serhiy Huk",
                "href": "/profile/Serhiy-Huk"
            },
            "answer_text": "When words creep into your mind and poison it with their darkest meanings - you can't keep the door with the sign that says “FEAR” locked for too long... When your imagination breaks loose and nothing stops its wild dance - you can't help noticing how the knob of the door with the sign that says “FEAR” starts slowly turning… When all your painful memories and broken dreams gather at the bottom of your consciousness teased by the words you just consumed and fed by the imagination you just released - you are forced to look in the face of a monster that comes out of the door with the sign that says “FEAR “… And so it happens. Page by page. Door after door… On three conditions: The writer is goodThe reader is imaginativeThe doors are old and creaky…",
            "date": "Answered December 10, 2017",
            "views": "98",
            "upvotes": "0"
        }
    ]
}