{
    "title": "How long did it take to write your master's thesis? - Quora",
    "tags": [
        "Computer Science (college major)",
        "Theses and Dissertations",
        "Graduate School Education",
        "Master's Programs"
    ],
    "response": [
        {
            "author_info": {
                "name": "Anant Chetan",
                "href": "/profile/Anant-Chetan"
            },
            "answer_text": "My master’s thesis was about designing a debug IP core for a Xilinx FPGA. Writing was the easy part, but reaching to the writing part was not so easy. It took me seven months to be able to come up with a usable IP Core. I took around two weeks to write my master’s thesis. I started the thesis work with a company in Germany in Jan, 2017. The first two months were quite smooth, my task was to research about the existing IPs that perform a similar function. The goal was to add the new features that were missing in already existing IPs. This part became the motivation in my thesis report, 1 page plus the appendix. The next phase was to get familiar with the tools that I was supposed to use during the development process. Along with the tools, I also got acquainted with the design cycle. This phase also added a couple of pages in the report. I took approximately one week for this task. In the next phase I created the design architecture and started with the programming. For every sub component, I wrote the source code as well as the test bench to simulate. I took around two months to complete all the modules. Once my top level test bench was running without any issues, I was pretty sure that I was done with the thesis so I registered the thesis at my university. Ideally, students should register the thesis once they start working on it. But it is better to register once, you are sure that you are almost done (it was possible at least at my university). This way, there are less chances that you will miss the deadline, once the thesis is registered there is a strict deadline of 4 months plus two weeks. The next step was to synthesize the code. Synthesis is a process where the tools would infer the hardware components like (gates, registers etc) from the code that I had been writing using the hardware description language (VHDL). And it did not synthesize. Reason: Coming from a software background, I wrote everything as if I was writing a software. The code I wrote was a disaster and my mentor told “you will have to rethink your architecture”. Lessons learnt: Although a lot of constructs like if..else..for..while looks the same in software and hardware, but they behave differently. For instance for loop in software runs in sequential order but it “unrolls” or runs in parallel in hardware. And hence begins my panic time. Now I had less than four months to finish the thesis or I end up in a trouble. And I was scared of this software hardware difference. I also had to get my contract with the company extended by three months. My initial contract was for 6 months. Nonetheless, I started working on the new architecture. This time I ran it through my mentor to know if it would work. I took me two weeks to come up with a new architecture. This added up a lot of pages (block diagrams) in my thesis. The next phase was writing the code once again. I wrote the first module, simulated it and synthesized it. Everything went fine. Next thing in the development process was to run the implementation. And, it failed the timing. And I was like “I am never going to finish it and am going to fail.” My mentor, told me where to look to get it fixed. After some more days, I was able to get all the errors fixed. I used two more weeks to do all this. I was left with three more modules to finish. But some how, I was able to finish them in a week’s time. And I was happy and like “I am going to get one pointer”. The grades were from 1.0 to 4.0 where 1 being the best and 4 being just managed to pass, 5.0 was failed. The next task was design review, which took one week for me. There were specific coding rules or guidelines to be used if the IP is to be used in automotive sector. Once this was done, I took another two weeks to document everything, put all the screenshots, pictures, resource utilization, future work etc and was ready with a 119 pages report. I also had to prepare a twenty minutes presentation which had 8 slides. I did not get a 1 pointer. I got 2.0 as my final thesis grades (1.7 for the presentation and and 2.1 for the report). But more than grades, I was happy that I was able to complete it and the same company hired me as a full time employee where I currently work. Thanks for reading!!! ",
            "date": "Answered September 9, 2019",
            "views": "131",
            "upvotes": " View 13 Upvoters",
            "upvoters": [
                {
                    "user_id": "Amay Patel",
                    "user_href": "/profile/Amay-Patel-1"
                },
                {
                    "user_id": "Oly Deb",
                    "user_href": "/profile/Oly-Deb-1"
                },
                {
                    "user_id": "Gio Wiederhold",
                    "user_href": "/profile/Gio-Wiederhold"
                },
                {
                    "user_id": "Hưng Lê Nguyễn Gia",
                    "user_href": "/profile/Hưng-Lê-Nguyễn-Gia"
                },
                {
                    "user_id": "Sarah Katunge Musyoka",
                    "user_href": "/profile/Sarah-Katunge-Musyoka"
                },
                {
                    "user_id": "Timothy Hutapea",
                    "user_href": "/profile/Timothy-Hutapea"
                },
                {
                    "user_id": "Subham Mishra",
                    "user_href": "/profile/Subham-Mishra-8"
                },
                {
                    "user_id": "Lelei Sharon",
                    "user_href": "/profile/Lelei-Sharon"
                },
                {
                    "user_id": "Adity Anand",
                    "user_href": "/profile/Adity-Anand-1"
                },
                {
                    "user_id": "MJ Cortez",
                    "user_href": "/profile/MJ-Cortez-5"
                }
            ]
        },
        {
            "author_info": {
                "name": "Rob Menes",
                "href": "/profile/Rob-Menes"
            },
            "answer_text": "I have written 2 Masters theses. The first thesis was in environmental systems (agricultural engineering) and applied statistical tests to determine the efficacy of pollution modelling. My first draft took about 5 months, including data collection, development of mathematical algorithms and new formulae, and the computer programming and execution of the algorithms. I was also attending classes and working as a teaching assistant.My adviser did not like it.My second, and final draft, took an additional 2 years. However, during that time I also had a full-time job as a water resources engineer. The second thesis was in music (liturgical music, Jewish cantorial) and was a technology-based approach to storing, accessing, and learning specific melodies associated with Hebrew texts. It included development of a liturgical data model, identifying melodies for 400 pages of text, performing and recording music, scanning manuscripts, and linking the data in a document-based model. It took me 1 year, while I was attending school full-time and working part-time. ",
            "date": "Answered April 4, 2015",
            "views": "177",
            "upvotes": " View 12 Upvoters",
            "upvoters": [
                {
                    "user_id": "Mohammed Ali Mani",
                    "user_href": "/profile/Mohammed-Ali-Mani"
                },
                {
                    "user_id": "Adity Anand",
                    "user_href": "/profile/Adity-Anand-1"
                },
                {
                    "user_id": "MJ Cortez",
                    "user_href": "/profile/MJ-Cortez-5"
                },
                {
                    "user_id": "Cliff Stamp",
                    "user_href": "/profile/Cliff-Stamp"
                },
                {
                    "user_id": "Iffahsuraya Jasni",
                    "user_href": "/profile/Iffahsuraya-Jasni"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/Skye-Ida"
                },
                {
                    "user_id": "Irene Anastacio",
                    "user_href": "/profile/Irene-Anastacio"
                },
                {
                    "user_id": "Daniele De Rossi",
                    "user_href": "/profile/Daniele-De-Rossi"
                },
                {
                    "user_id": "Emiliana Yang",
                    "user_href": "/profile/Emiliana-Yang"
                },
                {
                    "user_id": "Wynn Wang",
                    "user_href": "/profile/Wynn-Wang"
                }
            ]
        }
    ]
}