{
    "title": "How often do you buy new ink pens? - Quora",
    "tags": [
        "Ballpoint Pen",
        "Stationery (office supplies)",
        "Fountain Pens",
        "Ink Cartridges",
        "Ink",
        "Pens"
    ],
    "response": [
        {
            "author_info": {
                "name": "Krishna Das",
                "href": "/profile/Krishna-Das-985"
            },
            "answer_text": "I only buy quality fountain pens, so I only buy once a year or once in 2 years as a special present or something. I recently bought a Ranga handmade fountain pen, which has a Bock nib and writes beautifully (one of the best wet nibs I’ve tried), and the barrel is a ripple Indian ebonite barrel. I recommend Ranga pens if you live in Chennai (I went there to visit my family and bought a Ranga pen fromt the place itself). I also bought a Waterman Expert with gold plating and lacquered black recently. I only buy fountain pens once in two years or once in 16 months. ",
            "date": "Answered May 6, 2019",
            "views": "106",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Manav Singh",
                    "user_href": "/profile/Manav-Singh-206"
                }
            ]
        },
        {
            "author_info": {
                "name": "Michael Ballai",
                "href": "/profile/Michael-Ballai"
            },
            "answer_text": "I pretty much don’t buy pens like I used to do. I’ve got too many. What I do a lot of is nib work. I might pull a pen out and grind, polish or swap out the nib. I just reworked a nib on a Lamy Safari. It’s absolutely incredible how much I have been able to improve a nib that I did about a year and a half ago. My skill set is getting pretty amazing even for me. Making a pen better than new is fun. ",
            "date": "Answered May 8, 2019",
            "views": "48",
            "upvotes": "0"
        }
    ]
}