{
    "title": "How to go about expressing gratitude in your daily life - Quora",
    "tags": [
        "Gratitude",
        "Advice for Daily Life",
        "Daily Life",
        "Self-Improvement",
        "Life and Living"
    ],
    "response": [
        {
            "author_info": {
                "name": "Denny Redpath",
                "href": "/profile/Denny-Redpath"
            },
            "answer_text": "Very easy. Before I even get up, I start thanking for that new day, which is a new adventure for me! I will meet new and old people and it's going to make my day go fast. I thank for the home I have. I thank for my lovely parents, who I call every single day, no exception! I thank for my mom's lovely voice, it's so gentle and feminine. Although I tell her off for that, I am grateful that even though I am not anymore 15–20 yrs old, she is reminding me to keep warm, t sleep well, to do things she knows are good for a healthy life! I thank God/Universe for the job I have, as I love it, so it doesn't seem I am working! I have fun! I speak to new people every day at work. They are all willing to have the best time possible, so they are polite, curious and respectful. Well, there are always some exceptions, hahaha. I thank God for having a good brain, a strong mind with good values, I mention each part of my body and thank for it. The list goes on - my education, the family, the family friends, the peace in the house, faithful good parents+++++ Even the negative situations have served a good purpose. That is how it should be, that's there is no negative feelings remaining to burden you! I have to stop here. You got the drift. [1] Footnotes[1] My Attraction Law /Theory and Practice/ Meditations/ Famous Achievers/ Programs implementing LOA",
            "date": "Answered March 13, 2019",
            "views": "49",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Mary Vaughn",
                    "user_href": "/profile/Mary-Vaughn-35"
                }
            ]
        },
        {
            "author_info": {
                "name": "Nazneen Syeda",
                "href": "/profile/Nazneen-Syeda"
            },
            "answer_text": "By doing little gestures which makes the other person feel that you are thankful for their actions. We live in a world where we spread hatred more than we spread joy and happiness. So I think every little thing that you do with a good intention never goes unnoticed. So start expressing gratitude by the smallest and sweetest gestures. :) ",
            "date": "Answered January 29, 2019",
            "views": "12",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Mary Vaughn",
                    "user_href": "/profile/Mary-Vaughn-35"
                }
            ]
        }
    ]
}