{
    "title": "How to write a good piece of content for social media posts - Quora",
    "tags": [
        "Copy Writing",
        "Social Media Posts",
        "Content Writing",
        "Content Strategy",
        "Content Marketing",
        "Social Media Management",
        "Social Media Strategy",
        "Social Media Marketing",
        "Writing Advice",
        "Writing"
    ],
    "response": [
        {
            "author_info": {
                "name": "Vanessa Mojica",
                "href": "/profile/Vanessa-Mojica-14"
            },
            "answer_text": "Tips on preparing your Social Media Content Create a plan - a. determine your purpose, b. who are your target market, c. what does your target market needs, d. what type of content you want to share to your target marketCreate a schedule - a. plan how frequent you should post, b. determine and plan out the best time to postDesign your content (if needed)In creating your social media content, you should be consistent with your branding details such as color, fonts, etc., always use your brand logo, make sure to use the right format suitable to every social media platforms, and add relevant keywords in your text, description, and picture tags. Administrative Professional | RMV Virtual Services ",
            "date": "Answered September 24, 2020",
            "views": "33",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "David Alexander",
                    "user_href": "/profile/David-Alexander-14"
                }
            ]
        },
        {
            "author_info": {
                "name": "Akshay Ahire",
                "href": "/profile/Akshay-Ahire-36"
            },
            "answer_text": "Do your researchUsing headings, bullets, and lists where possible to make your content or posts easier to scanUse images and videosAdd a call to actionMake sure you’ve joined the right community in which members will find your content interesting and useful for them.",
            "date": "Answered September 23, 2020",
            "views": "26",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Hboush Bak",
                    "user_href": "/profile/Hboush-Bak"
                }
            ]
        }
    ]
}