{
    "title": "How do freelancers get the projects? - Quora",
    "tags": [
        "Freelancers",
        "Project Management"
    ],
    "response": [
        {
            "author_info": {
                "name": "Adam Rasheed",
                "href": "/profile/Adam-Rasheed"
            },
            "answer_text": "Contrary to what you may have read, finding projects is not like prospecting for oil, but rather tending a garden. Your success depends on the work you put in. In order to have a lively garden full of bright plants, you need to put in work every day and make you’re tending it. There are both long-term methods and short-term methods to getting freelance projects, and they’re both very different and almost opposite. At any given time, you should be using both of these methods.  Short-term Methods to Get Projects Chamber of Commerce. Go to your local Chamber of Commerce site, and look at their business directory. Narrow down the business you think could benefit from your services, and get in touch with them.Cold Calling. Find businesses in your area (i.e. the businesses your found on the chamber of commerce site), and pick up the phone and call them. Embrace the fact that you’re one person and not some faceless company. Most of these businesses started from the ground up as well, so they’ll know what it was like. I’ve done this during my leaner months, and even the businesses that said no wished me luck.Job Boards. A lot of job boards have a “freelance” or “contract” filter where you can find listing that are looking for people like you. I’ve often found pretty decent projects (>$1k) on places like these.Freelancing Sites. You can start profiles on sites like Upwork and PeoplePerHour and get smaller projects (<$500) to keep you going. Long Term Methods to Get Projects Positioning yourself as an authority. If you’re an authority, your clients will come to you. maintaining a blog where you post regularly. Great methods to position yourself as an authority figure are: giving talks to your target audience (e.g. if you want to SEO for dentists, give a talk at a dental conference), regularly writing useful blog articles, hosting webinars, etc.)Networking - There’s two equally important aspects to networking: making new relationships, and maintaining your relationships. People think its only important to meet as many people as possible, but it’s not. Client-Vendor relationships shouldn’t be speed dating, but more like a marriage. You don’t ask someone to marry you when you meet them. You ask them out on a few dates, get to know them, really nurture your relationship with themIntelligently asking for referrals. Those projects you did on freelancing sites? Ask for a referral. Just finished up a site for a local business, ask for a referral. It’s important to let your clients know that you make a living by making sure clients are happy, and you’d love it if they could refer you to someone who would benefit from your work. Also, get testimonials for your website.Going for big fish every once in a while. I’m talking about the projects that take 1–2 years to pan out. These usually come in the form of RFPs. The kind that will have you be competing with the big guys. Even if you don’t get projects, get in touch with them, ask them “For my own betterment and growth, could you please tell me why you decided to go another direction?”Hope this was helpful. I’ve used these exact tactics for my own consulting business. ",
            "date": "Answered September 16, 2016",
            "views": "37",
            "upvotes": " View 7 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Abdelrahman Ramadan Ahmed",
                    "user_href": "/profile/Abdelrahman-Ramadan-Ahmed"
                },
                {
                    "user_id": "Moniruzzaman Moni",
                    "user_href": "/profile/Moniruzzaman-Moni-27"
                },
                {
                    "user_id": "Rajkumar Sundaramoorthy",
                    "user_href": "/profile/Rajkumar-Sundaramoorthy"
                },
                {
                    "user_id": "Sibongile Thanjekwayo",
                    "user_href": "/profile/Sibongile-Thanjekwayo"
                },
                {
                    "user_id": "Sheeroh Murega Kiarie",
                    "user_href": "/profile/Sheeroh-Murega-Kiarie"
                },
                {
                    "user_id": "Fabíola Sékula",
                    "user_href": "/profile/Fabíola-Sékula"
                },
                {
                    "user_id": "Rahul Ashok",
                    "user_href": "/profile/Rahul-Ashok-14"
                }
            ]
        },
        {
            "author_info": {
                "name": "Maulik Jani",
                "href": "/profile/Maulik-Jani"
            },
            "answer_text": "As being a full time freelancer for three years, I think I am eligible to share my views about freelancing and how to get in! So according to me, freelancing is a perfect blend of couple of things which you need to know to get the ball rolliing Skills: of course this is on the top of the list. The very important one as this will define what you can do for the clients and how you can do better than others. Having a good portfolio of your work would be perfect to pitch the client about your skills as most of the clients are looking for your actual work samples to know your skill level. In fact in my case, most of my long term clients came after seeing my online portfolio. after all, it will be your work which will speak for you!(I am saying this from an artist's point of view, where you have samples of your work. It may not be possible if you working in some other field like networking or something else... In that case, you can ask for a small test to show your skill if client is not convinced after talk.) Communication: well, this is another very important thing. Almost equally weighing as skills because client is probably never going to see or meet you head to head if you are freelancing for foreign countries. So for him/her, your words will be the final verdict. So be very careful about it. Frequent communication about all the relevant topics is very useful as well. You will get entire picture crystal clear with all topics covered and your client will be happy to see your enthusiasm. Persistence: Now this is something which will take you long way. When you will starting freelancing, you will have to be persistence. You can not expect to get some big ass project in 2 days of starting it until you are insanely lucky! So have faith in yourself and keep pitching yourself to clients who are looking for freelancers. It may take a week or a month...so just don't loose your balls on \"dang it, I am not getting any reply from clients...\" but trust me, it will be worthy. Networking: stay connected! Seriously...Its always helpful to keep a good circle of friends/colleagues/people from same field. Post your work on the forums and websites, take part in different competition (no matter whether you win or loose, you'll get know some amazing artists/persons and get some exposure as well) troubleshoot issues, answer questions and share what you know. Even if you may or may not get any project but you will surely get a recognition which will be really helpful. So I think I covered most topics that came in my brain based on my journey so far. And here is how I would put in straight line to start freelancing... Make a portfolio or your own website where you can show your work and links with little bit of your introduction. (for 2d/3d artists, sites like behance, art station, deviantart, draw crowd are available where you can put your work and information about you)Go the sites which are providing a common platform for employer and freelancers. There are plenty of such sites available like www.upwork.com, www.freelancer.com, www.fiverr.com, www.guru.com and some more as well if you will check the Internet for freelance work.Go to any of it, make an account and fill in all required details and start browsing projects of your relevant field. There are lots and lots of projects available on it.Choose a project that looks interesting and which you can do. Send a cover later/proposal to client with your portfolio link and saying why you are suitable for this project.Repeat it until you get your first project!! It may seems a hard nut but eventually it will be cracked for sure. (remember persistence? ;))Once you get the project, consider it your first shot and give the best possible output. Not only you will get a good review but also a good reputation on that specific site.Keep repeating it. With good reputation and experience, you can increase rates as well. And eventually you will have some really good clients as well.And I think we are done with the basics!! Now you have a nice start of freelancing career! Now, A few additional advises!! Never take any of your task/project/works for granted! Pay full attention to work and try to provide better than asked if possible.Never take the project if you fear that you can't complete...specially in the beginning when you have less resources. it will only lead to waste of time and money of you and your employer and negative rating too! Which can be kill switch if it's your first project. So start small, start slow. You can always pick up the pace after a rock solid start.Always manage your time wisely. You will have insane freedom in freelancing as you might be working from home or similar place where you don't have any strict time constrains. So it's really easy to get distracted and later regret! So always be careful about it.Double tap - if you get an initial positive reply from a client and later if he forgot, then it's nothing wrong to drop a reminder to ask him about status of the project. It shows your enthusiasm and there's very high chance that you will bag that project.Be humble. Dont be a jerk like \"project is done, money is in account, now to hell with the client!\" a nice little \"hi, how are you?\" never hurts anyone! Keeping the contact alive at a moderate pace even after project is done will help you earn client's trust and that can bring you a fortune sometime.It's not always sunshine in freelancing. Ups and downs are always part of it. So be ready for that, both mentally and financially. Don't freak out and panic when you are out of work. Instead, keep your cool and utilize that time to hone your skills, because skills pay the bills!Spare time to explore new techs coming in your field. You must know all the upcoming game changer things and will to learn it if needed by putting your possible ego of \"I know all\". This is not office where you are competing with another 7 guys like you. This is wide open market where with one call, you will find another 247 person doing the same task as you! So always try to stay ahead the curve and stay updated.Don't hesitate to go for a bit low rate to begin. Specially when you think you can learn new things. You can't jump directly on the 23rd step of the stair! So to start, don't hesitate to go for a bit lower rate. You will learn new things and will have a better picture of everything. After that, you can surely increase the rate.Always always always provide the work within time. This is really important one... Because client may not know you personally so your words matter the most. If you gave him/her your words, make sure that you keep it. Delay of Couple of days are fine with approval. But always try to follow the time line.According to me (based on personal experience) if you will follow your passion for something in freelancing, it will be far better than anything. Because you will never get tired or feel bored with it. That flame within will keep you going. And that's really a driving force in freelancing or anything else.And I think this is it from my side... I shared everything that I knew depending on my experience. Definitely I might missed several things but I hope it will be helpful. And if anyone wants to know more, feel free to shoot the questions. Happy freelancing, folks... ",
            "date": "Updated August 9, 2019",
            "views": "88",
            "upvotes": " View 637 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Sandeep Baghel",
                    "user_href": "/profile/Sandeep-Baghel-14"
                },
                {
                    "user_id": "Arindam Das",
                    "user_href": "/profile/Arindam-Das-700"
                },
                {
                    "user_id": "Falgun Patel",
                    "user_href": "/profile/Falgun-Patel-42"
                },
                {
                    "user_id": "Sayali Ambekar",
                    "user_href": "/profile/Sayali-Ambekar-4"
                },
                {
                    "user_id": "Tanay Tapanshu",
                    "user_href": "/profile/Tanay-Tapanshu"
                },
                {
                    "user_id": "Devesh Anand Srivastava",
                    "user_href": "/profile/Devesh-Anand-Srivastava"
                },
                {
                    "user_id": "Gunvant Ahire",
                    "user_href": "/profile/Gunvant-Ahire"
                },
                {
                    "user_id": "Mohil Mscit",
                    "user_href": "/profile/Mohil-Mscit"
                },
                {
                    "user_id": "Rajadarshini Saravanan",
                    "user_href": "/profile/Rajadarshini-Saravanan-1"
                },
                {
                    "user_id": "Anshul Guleria",
                    "user_href": "/profile/Anshul-Guleria"
                }
            ]
        }
    ]
}