{
    "title": "How can the writer continue if the narrator (first person) in the story dies? - Quora",
    "tags": [
        "Narration",
        "Narratives",
        "Writing",
        "Book Recommendations"
    ],
    "response": [
        {
            "author_info": {
                "name": "Gabriel Bell",
                "href": "/profile/Gabriel-Bell-18"
            },
            "answer_text": "I’ve seen it done in two different ways. The first is a ghost. It is still the first person, just not body of the first person. The second is a temporary switch to “The Second Person” (still a first person perspective, but a different first person). Oh - I’ve also seen it done when the entire story was told on line, so although the person died, it was just their avatar, and not really them. There are a lot of ways if you think about it :) ",
            "date": "Answered September 3, 2018",
            "views": "109",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Larence Shaddox",
                "href": "/profile/Larence-Shaddox"
            },
            "answer_text": "I read a book a long time ago written in first person. The person ‘writing’ the story died of appendicitis. It was picked up by his closest person in the story That second person also made corrective notes the the first parts written in a few places. Though a touch confusing at first it was explained fully by the second person in a full narrative of after the funeral. ",
            "date": "Answered September 3, 2018",
            "views": "49",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Hum Shaq",
                    "user_href": "/profile/Hum-Shaq"
                }
            ]
        },
        {
            "author_info": {
                "name": "Jon Mathis",
                "href": "/profile/Jon-Mathis-2"
            },
            "answer_text": "Technically the narrator/writer can introduce perspectives from any character in a story from second person supporting all the way to antagonist. As long as the storyline and conflict and/or problem exists and needs to be resolved at the end of the story. ",
            "date": "Answered September 3, 2018",
            "views": "40",
            "upvotes": "0"
        }
    ]
}