{
    "title": "How many words are in 1000 (or 300 or 500 or 10000 etc.) characters? - Quora",
    "tags": [
        "Words",
        "Permutations and Combinations",
        "Mathematics Homework Question ",
        "Linguistics",
        "Language"
    ],
    "response": [
        {
            "author_info": {
                "name": "David Minger",
                "href": "/profile/David-Minger"
            },
            "answer_text": "Two: “1000” and “characters.” Joking aside, we need to define “character.” If you mean hieroglyphs then you have 1,000 words and then you have the potential for many more if you can make compound words out of those characters.If you mean an alphabet with 1,000 letters, I suggest seriously pruning back the alphabet! Thirty or less should be plenty.But you could hypothesize some alien species whose perceptual system enabled it to distinguish that many sounds (or gestures perhaps) that were meaningfully different.Then you would have to know if the language had a minimum number of letters that could make up a word (one?), whether all the letters could serve as words, what would be limitations on letter combinations, what would be the limits on the length of words (how many letters in sequence), and so on.Depending on the answers to those and other questions, you could ask how many words could 1,000 letters generate. A lot! English with ~26 letters has generated over a million words. Since 1,000 is around 38 times 26, I’m going to guesstimate that 1,000 letters could generate 38 squared times 1 million words for around 1,444,000,000, or just say 1.5 billion words. But maybe the average five-year-old-equivalent alien could get by a couple million words <g>. Kindergarten stuff.Of course, you could reason it out any number of ways and get very different answers. If no word could be longer than one letter, and no compound words were allowed, you would simply get 1,000 words. Change the parameters in the other direction and throw in alien super-cognitive abilities and perceptions and you could get much higher than 1.5 billion words.",
            "date": "Answered June 22, 2018",
            "views": "222",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Raheela Ahmad",
                    "user_href": "/profile/Raheela-Ahmad"
                },
                {
                    "user_id": "Babu Baklol",
                    "user_href": "/profile/Babu-Baklol"
                },
                {
                    "user_id": "Musa Omair",
                    "user_href": "/profile/Musa-Omair"
                },
                {
                    "user_id": "Sue Montoya",
                    "user_href": "/profile/Sue-Montoya"
                }
            ]
        },
        {
            "author_info": {
                "name": "Robert Sumner",
                "href": "/profile/Robert-Sumner-1"
            },
            "answer_text": "Conventionally, a word were 5 characters on average. But this becomes seven characters, factoring in spaces and punctuation. Commas and semicolons take one space, periods & colons two, and dashes three, for example. A thousand characters should be ≈140 - 150 words, or 143 words precisely. David Minger elsewhere in this thread has the right idea. I would recommend finding writing samples of a specific type online, letting an app count the characters for you (be sure it counts spaces & punctuation), and divide by seven. Then for proof of concept, count the isolated words of the passage yourself and determine if they hit the denomination of seven roughly, on average. I am presuming that the ultimate purpose for the question has a restrictive limit involved, such as the one-thousand characters. ",
            "date": "Answered September 8, 2019",
            "views": "163",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Ed Nelson",
                    "user_href": "/profile/Ed-Nelson-8"
                },
                {
                    "user_id": "Lynton McGirr",
                    "user_href": "/profile/Lynton-McGirr"
                }
            ]
        }
    ]
}