{
    "title": "How is Neil Gaiman's writing style described? - Quora",
    "tags": [
        "Neil Gaiman (author)",
        "Creative Writing",
        "Writers and Authors"
    ],
    "response": [
        {
            "author_info": {
                "name": "David Helton",
                "href": "/profile/David-Helton-2"
            },
            "answer_text": "Since you could be talking about one of two things, I'll try to address both.  Gaiman's Prose:Gaiman's prose strikes a balance between flowery, overwrought description (e.g. Ray Bradbury) and sparse \"work-man's\" prose (e.g. Brandon Sanderson) that tries to get the job done and not draw attention to itself. His prose moves fast, but slows down to indulge itself with poetic diatribes when he deems appropriate, and he typically knocks those out of the park. To sum it up, he's a writer who knows he can write incredibly well, but doesn't let that get to his head to the point of overindulgence. His dialogue is snappy and believable, and I'd argue he writes some of the best dialogue in the industry right now. Gaiman's Content:Gaiman writes fantasy. It would slightly disingenuous to pin him into a corner more specific than that. Most of his fantasy is contemporary, and set in modern day. This includes American Gods, The Graveyard Book, and Ocean at the End of the Lane, for instance. He's also written more traditional fantasy set in the past, such as Stardust, some of his comics, and some of his short stories. Some of his stories, such as Neverwhere and certain short stories, have been labeled as part of the \"new weird\" movement, which are modern stories that carry on in the tradition of H.P. Lovecraft.  In general, though, he writes contemporary fantasy.  A consistent and indelible part of his writing are his allusions to other works of fiction. Almost everything he writes contains references and nods to things like Shakespeare, folklore, mythology, and Gaiman's own favored authors such as G.K. Chesterton. American Gods is built upon the pagan deities which it references, such as Odin and Anansi. The Sandman series of graphic novels is rife with mythological and literary figures. Stardust depends on the tradition of Victorian folklore for its success.  I'm going to disagree with Jay C. Armitage here and say that his work is definitely not  magical realism, and that he's mixing up contemporary fantasy and magical realism.  Magical realism is a genre that is in the tradition of literary fiction, rather than the tradition of fantasy and  pulp scifi from which Gaiman comes. Magical realism is simply literary fiction with the lightest of magical elements added into the background for flavor and theme enhancement, rather than for plot, hence the term 'realism.' Magical realism bears more similarity to something like All The Light We Cannot See than it does to the contemporary fantasy Gaiman writes. In Gaiman's novels, the magic is anything but in the background, instead being a main element of the plot. There also tends to be a very clear conflict and decent amounts of action in his novels, which also goes against the tradition of literary fiction, which seeks to closley mimic real life with little plot, no real antagonist, and lots of emphasis on internal emotional struggles rather than external conflicts that must be overcome. Calling Gaiman's work magical realism is akin to calling Dan Brown's The Da Vinci Code the same genre as My Sister's Keeper just because they both take place in modern day and feature no magical elements. One is clearly thriller/mystery and one is clearly contemporary literary fiction. ",
            "date": "Answered December 1, 2015",
            "views": "105",
            "upvotes": " View 21 Upvoters",
            "upvoters": [
                {
                    "user_id": "Elizabeth Pham",
                    "user_href": "/profile/Elizabeth-Pham-30"
                },
                {
                    "user_id": "Daniel Schwarz Carigiet",
                    "user_href": "/profile/Daniel-Schwarz-Carigiet"
                },
                {
                    "user_id": "Tracy Downey",
                    "user_href": "/profile/Tracy-Downey-6"
                },
                {
                    "user_id": "Immanuel Rukevwe",
                    "user_href": "/profile/Immanuel-Rukevwe"
                },
                {
                    "user_id": "Emma Wesner",
                    "user_href": "/profile/Emma-Wesner"
                },
                {
                    "user_id": "Maia Talbert",
                    "user_href": "/profile/Maia-Talbert"
                },
                {
                    "user_id": "Noor Al-Hajri",
                    "user_href": "/profile/Noor-Al-Hajri"
                },
                {
                    "user_id": "Naomi",
                    "user_href": "/profile/Naomi-824"
                },
                {
                    "user_id": "MarioARF Hans",
                    "user_href": "/profile/MarioARF-Hans"
                },
                {
                    "user_id": "Anwesha",
                    "user_href": "/profile/Anwesha-16"
                }
            ]
        },
        {
            "author_info": {
                "name": "Harriet Green",
                "href": "/profile/Harriet-Green-4"
            },
            "answer_text": "In adjectives: witty, wise, thoughtful, inspired, unpretentious, insightful and refreshing. In some actual sentences: his writing displays a unique incorporation of all genres we have, so far, established in literature. Every genre is explored at some point in his works. Every read is demanding your full attention and interest- every character is memorable, every description is vivid, every place is profoundly meaningful and the purpose of it all is what ties his words together with such a perfect knot of existential thought. His incredible raw imagination tells the story while the constant injection of deeply-considered thought communicates a moral, a message, a teaching, a criticism, or just makes you laugh. Whatever his writing may make you feel- and you may well be made to feel everything- you are constantly surrounded by a sense of purpose. A purpose his characters hold and a purpose his narrative contains… and it just speaks to you. By ‘purpose’, I mean that his writing resonates within you and makes you feel something. Even someone rather dull and dead would have at least one or maybe half an emotion or sensation conjured up inside them. And back to this something that his writing makes you feel… how to describe it? Something: the feeling experienced is similar to what it feels like to know and not know, simultaneously. His writing is an ideal cross between some form of relatable concept/scenario/experience and the furthest, most distant thought, feeling, memory, philosophy. Or, to just sum it all up, have it this way: Q- “How is Neil Gaiman’s writing described?” A- Gaiman’s work: A wondrous clash of all you feel you know so well and all that is so far from your grasp. ",
            "date": "Answered May 21, 2018",
            "views": "2",
            "upvotes": " View 12 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Jeremy Cole",
                    "user_href": "/profile/Jeremy-Cole-97"
                },
                {
                    "user_id": "Marisol Catherine",
                    "user_href": "/profile/Marisol-Catherine"
                },
                {
                    "user_id": "Sarah McLean",
                    "user_href": "/profile/Sarah-McLean-11"
                },
                {
                    "user_id": "Azanyah Yisrael",
                    "user_href": "/profile/Azanyah-Yisrael"
                },
                {
                    "user_id": "Daniel Schwarz Carigiet",
                    "user_href": "/profile/Daniel-Schwarz-Carigiet"
                },
                {
                    "user_id": "Hunter Nixon-Smith",
                    "user_href": "/profile/Hunter-Nixon-Smith"
                },
                {
                    "user_id": "Emma Wesner",
                    "user_href": "/profile/Emma-Wesner"
                },
                {
                    "user_id": "Niamh Montgomery",
                    "user_href": "/profile/Niamh-Montgomery-1"
                },
                {
                    "user_id": "Susan Smith",
                    "user_href": "/profile/Susan-Smith-53"
                },
                {
                    "user_id": "Charles Allen",
                    "user_href": "/profile/Charles-Allen-134"
                }
            ]
        }
    ]
}