{
    "title": "How can we write an essay on the topic gender discrimination? - Quora",
    "tags": [
        "Essay Writing Help",
        "Discrimination",
        "Essays",
        "Gender",
        "Writing Advice"
    ],
    "response": [
        {
            "author_info": {
                "name": "Marianne Joyce",
                "href": "/profile/Marianne-Joyce-2"
            },
            "answer_text": "Narrow your focus to a single aspect of gender inequality such as gender inequality in the workplace, in child rearing, in pay for equal work, or some other aspect before you start your research. Look for something that will allow you to find some good solid statistics. Activate your curiosity. See what the statistics actually prove. Look for variables that could confound your findings. Be objective about your sources and correct for bias. Use that interrogation to find your thesis statement. Write your paragraphs based on your findings and make 3 to 5 points. In conclusion, briefly summarize what you have found. If it were me I would keep my opinions out of it. It's an essay, not an editorial. It should be an interesting project. ",
            "date": "Answered December 29, 2019",
            "views": "111",
            "upvotes": " Answer requested by Maii Mamdouh",
            "upvoters": [
                {
                    "user_id": "Rebecca Kug",
                    "user_href": "/profile/Rebecca-Kug"
                }
            ]
        },
        {
            "author_info": {
                "name": "Tzivia Adler",
                "href": "/profile/Tzivia-Adler"
            },
            "answer_text": "Find a few articles on-line about the subject. Google can help you with that.Try to find articles that say that “yes it happens” and “no it doesn’t happen” and maybe “it happens but not as much as people claim.”Think.Think again. img sc: Measure Twice Cut Once Quote Wood Coaster Organize your thoughts, and start to write.Get a friend to read your paper and see if it makes sense. Or if you school has a writing tutor, get pro help.",
            "date": "Answered June 29, 2018",
            "views": "159",
            "upvotes": " View 1 Upvoter"
        }
    ]
}