{
    "title": "How should I write my name in a research paper? - Quora",
    "tags": [
        "Academic Research Papers",
        "Academic Papers",
        "Academic Research"
    ],
    "response": [
        {
            "author_info": {
                "name": "Andrew Karam",
                "href": "/profile/Andrew-Karam-3"
            },
            "answer_text": "This is actually a rather important question since papers are usually indexed by author’s name. I’ve known a number of female scientists who have kept their maiden name after marrying, simply to avoid having one set of papers under her pre-marriage name and a second set under her married name. So, whatever name you use, try to stick with that throughout your academic career. As Deepak notes, you will typically use your first name, middle initial(s) if you have additional names, and surname. But then there are people who don’t use their first names - if I publish a paper using my first name (which nobody uses) then people who have met me or who have heard me speak at conferences might not associate that paper with me. So for me, I’ll use my first initial and middle name - thus, all of my publications are as “P. Andrew Karam” or as “Karam, PA.” And since my publishing history is a “P. Andrew Karam” I make sure that everything - conference papers, slides, etc - say “P. Andrew Karam” for the sake of consistency. That way any search will turn up everything I’ve done, which might not happen if I sometimes shorten it to a simple “Andrew Karam.” Finally, use a formal version of your name and not a diminutive form. So even though my friends and family call me “Andy” my papers are all published as “Andrew.” Oh - and don’t list your degree(s) or certification(s) unless the journal requires it or unless that’s standard in your field. I know that you’re proud of what you’ve accomplished - I certainly am - but it can come across as pretentious or even insecure. When I’m reading a paper, what I care about is the content of the paper and not the author’s credentials - I’ve read papers written by authors without much in the way of credentials that were far better than papers written by authors with a long string of initials after their names. Let your paper speak for itself! ",
            "date": "Answered September 5, 2019",
            "views": "55",
            "upvotes": " View 4 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Sidra Qaisar",
                    "user_href": "/profile/Sidra-Qaisar-2"
                },
                {
                    "user_id": "Bruce Thomson",
                    "user_href": "/profile/Bruce-Thomson-2"
                },
                {
                    "user_id": "Kimberly Moravec",
                    "user_href": "/profile/Kimberly-Moravec"
                },
                {
                    "user_id": "Aryan Kumar Prasad",
                    "user_href": "/profile/आर्यन-कुमार-प्रसाद-Aryan-Kumar-Prasad"
                }
            ]
        },
        {
            "author_info": {
                "name": "Shivasankari Gomathinayagam",
                "href": "/profile/Shivasankari-Gomathinayagam"
            },
            "answer_text": "When you submit your research paper, you usually write your “first name” “middle name” and “last name”. I would usually use my official name here, so it will be easy for indexing or referencing in the CV. However I am unaware if you could use anything other than your official name. If you would like to know where to write your name, its usually next to the title and if you contributed the most, you become the “first author” which can also be shared with others with similar contribution. You could also be the “corresponding author” if you have designed and conceived the work, however if you are in a lab the lab-head/Principal Investigator usually likes to be the “corresponding author”. ",
            "date": "Answered July 23, 2019",
            "views": "32",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Aryan Kumar Prasad",
                    "user_href": "/profile/आर्यन-कुमार-प्रसाद-Aryan-Kumar-Prasad"
                },
                {
                    "user_id": "Sitthichai Pookaiyaudom",
                    "user_href": "/profile/Sitthichai-Pookaiyaudom"
                }
            ]
        },
        {
            "author_info": {
                "name": "Konstantinos Konstantinides",
                "href": "/profile/Konstantinos-Konstantinides"
            },
            "answer_text": "Typically, you write it the same way as it is spelled in an ID, say your passport. Your country probably has specific rules on how to transliterate Arabic into English. See also how others in your country spell it. Regardless on how you write it, you need to stick with it, for ever. ",
            "date": "Answered September 27, 2016",
            "views": "24",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Ruchika Gupta",
                    "user_href": "/profile/Ruchika-Gupta-127"
                },
                {
                    "user_id": "Marko Kuveždić",
                    "user_href": "/profile/Marko-Kuveždić"
                },
                {
                    "user_id": "Mike Adams",
                    "user_href": "/profile/Mike-Adams-50"
                }
            ]
        },
        {
            "author_info": {
                "name": "Jay Kosner",
                "href": "/profile/Jay-Kosner"
            },
            "answer_text": "At the top: John Doe In a citing: According to Doe (2010) blah blah blah ",
            "date": "Answered September 27, 2016",
            "views": "616",
            "upvotes": "0"
        }
    ]
}