{
    "title": "How to visualize the life you want - Quora",
    "tags": [
        "Visualization",
        "Philosophy of Everyday Life",
        "Life and Living"
    ],
    "response": [
        {
            "author_info": {
                "name": "Carolyn King",
                "href": "/profile/Carolyn-King-28"
            },
            "answer_text": "There are so many different lives I want it would be hard for me to say a just one, and way too long for me to write and boring for any reader to read all the lives I want, between a happy teen during the Beetles Invasion, a child or a happy homemaker mother in a happy “Little Boxes” development during the 1950's, a wild and fearless bullet proof bad ass guy living on the South Side of Chicago, and the drifters life I long for any time I hear that old Lobo song “Dog Named Boo” and just a person in the 1920's in my father's neighborhood in North Tonawanda NY, when he was a little boy and none of the family members I ever knew would be going to die for decades yet. Get to see the life he talked about being then with the ice men doing deliveries using their horse and wagons, and my father a decade later with a car he and his buddies got that sounds like out of the Flinstones cartoons the way they had to drag their feet to stop it or run and push to get it going. (I forget which). A wonderful life when things weren't so high speed and controlled that a 14 year old boy could drive a thing like that down their neighborhood streets without some cop burning them and their parents, and without it being the dangerous thing it would be now. There's just too many lives I want to visualize one specific one. So I just get teary eyed over thinking too much about the life I want that will never be. Then I end up laughing at myself as I realize the not so wonderful parts of these lives I want, like having to wear a freaking dress all the time in the 1920's and the 1950's and the hassle of having to mess with those ice boxes they had in the 1920's! And the Dog Named Boo Life was something that I may have had more energy for when I was younger, and when life sucked, being in school. But now that nights aren't stressful times of frustrating homework and dreadful reports to work on I don't want to do, I look forward to going home and not having to deal with anything but the usual nightly cat chores and getting supper made and watching TV. I wouldn't want to deal with figuring out where to park the car or van I'm drifting in to rest for the night the Dog Named Boo Life would involve. (They surely weren't rich enough to live in motels nightly! Lobo says they were living off the land). I end up sort of satisfied just being in the life I'm in. ",
            "date": "Answered January 13, 2020",
            "views": "27",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Mohammed Saiful Alam Siddiquee",
                    "user_href": "/profile/Mohammed-Saiful-Alam-Siddiquee"
                }
            ]
        },
        {
            "author_info": {
                "name": "James Gilbert",
                "href": "/profile/James-Gilbert-23"
            },
            "answer_text": "I honestly don't know. I don't even know what I want out of life, let alone know how to visualize a life that I don't know what to do with yet. At 44 I gave up on such a foolish quest. I just wake up and steel myself against the onslaught life throws at me every day. If I survive the day, I do it again the next day. Rinse and repeat till I leave this plane of existence. ",
            "date": "Answered January 12, 2020",
            "views": "19",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Carolyn King",
                    "user_href": "/profile/Carolyn-King-28"
                },
                {
                    "user_id": "Mohammed Saiful Alam Siddiquee",
                    "user_href": "/profile/Mohammed-Saiful-Alam-Siddiquee"
                }
            ]
        }
    ]
}