{
    "title": "How should you write a novel with multiple storylines? - Quora",
    "tags": [
        "Novel Writing",
        "Creative Writing",
        "Novels",
        "Writing Advice"
    ],
    "response": [
        {
            "author_info": {
                "name": "Matt Nagin",
                "href": "/profile/Matt-Nagin-1"
            },
            "answer_text": "The key element is to bring the separate storylines together in terms of plot or theme or in some other interesting way. I’m reading ‘The Stand ‘right now. King weaves dozen of storylines together; because they all concern a deadly virus—there is that overarching theme—it works—at least on a certain level. Make sure the secondary storylines—subplots—are nearly as interesting as the primary storyline. Try to have different voices or style or character types with esch storyline/subplot. This diversity can be helpful. The other option—which I use a lot—is to stick to one storyline. This unified consciousness can allow for more character depth and development. ",
            "date": "Answered August 27, 2020",
            "views": "76",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Zoe Symons",
                "href": "/profile/Zoe-Symons-3"
            },
            "answer_text": "Use first person narration and switch narrators. For instance: Chapter one: Leah I ran. I didn’t think. I just ran. Away from everything, away from home. I can’t believe how stupid I was. Chapter two: Matthew Riley was waiting outside my door when I left. We walked to school. I thought I was the luckiest guy ever to have her as my girlfriend. This is not what your book should be exactly, these are just examples. Best of luck! ",
            "date": "Answered August 26, 2020",
            "views": "82",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Charlene Harvey-Gallant",
                    "user_href": "/profile/Charlene-Harvey-Gallant"
                }
            ]
        }
    ]
}