{
    "title": "How to use 'will' and 'would' in a sentence - Quora",
    "tags": [
        "Grammar",
        "English Grammar"
    ],
    "response": [
        {
            "author_info": {
                "name": "Lilian Gardner",
                "href": "/profile/Lilian-Gardner-1"
            },
            "answer_text": "The word, or verb will means that you will definitely do something. Example: I will go to the cinema this evening. ( I will definitely go, I am sure of going, I am certain of going). Whereas the word would is called a modal verb, or modified verb. That is, you are not definite, sure, or certain of your actions. For example: I would go to the cinema this evening if I had the time. With would there is usually a reason why you cannot follow your action. For example: Will you come for a walk with me? Definite answer: Yes, I will, thanks. Uncertain answer. I would come with you but I don’t have time. Or, I would gladly come with you but I must take my mother shopping. Sometimes would sounds almost as an excuse not to do something. I would like to study but I don’t have my books. ",
            "date": "Answered September 16, 2018",
            "views": "270",
            "upvotes": " View 3 Upvoters ",
            "upvoters": [
                {
                    "user_id": "JF Ruba",
                    "user_href": "/profile/JF-Ruba"
                },
                {
                    "user_id": "Robin Kumar",
                    "user_href": "/profile/Robin-Kumar-380"
                },
                {
                    "user_id": "Kofi Asare-Yeboah",
                    "user_href": "/profile/Kofi-Asare-Yeboah"
                }
            ]
        },
        {
            "author_info": {
                "name": "Akshay Shukla",
                "href": "/profile/Akshay-Shukla-30"
            },
            "answer_text": "Will- Means for Certaine.g. I WILL finish this game.It says that you are certain of something with no exceptions. Would- A little dicey casee.g. I WOULD have came, but I got stuck -up with some urgent and important work.Here, it swings around a YES or a No type case, swinging with the thread of CASES/Situation at hand. For instance,I would love to explain this to you (situation based; take this line as- I would love to explain depending upon whether or not you want me to).I will explain this to you (I am taking the authority here, telling you that there is no other option here and you MUST listen to what I say…. regardless of the fact if anyone else want to do the same). WILL- It gives a note/tone to the sentence that is IMMOVABLE or STRONG and DECISIVE. WOULD- It gives a note/tone of Condition based/situation based/being dicey(yes or no.. any of the two). WILL (present tense)WOULD (past tense) Its a little rough explanation, and ought to be sufficient. ",
            "date": "Answered July 24, 2016",
            "views": "660",
            "upvotes": " View 5 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Kofi Asare-Yeboah",
                    "user_href": "/profile/Kofi-Asare-Yeboah"
                },
                {
                    "user_id": "Donna Williams",
                    "user_href": "/profile/Donna-Williams-238"
                },
                {
                    "user_id": "Aabishkar Wagle",
                    "user_href": "/profile/Aabishkar-Wagle"
                },
                {
                    "user_id": "Varun Khullar",
                    "user_href": "/profile/Varun-Khullar"
                },
                {
                    "user_id": "Shiyad J",
                    "user_href": "/profile/Shiyad-J"
                }
            ]
        }
    ]
}