{
    "title": "How does a soldier get assigned as a helicopter door gunner? - Quora",
    "tags": [
        "Machine Gunners",
        "Helicopters",
        "Military Personnel"
    ],
    "response": [
        {
            "author_info": {
                "name": "Ben Gooch",
                "href": "/profile/Ben-Gooch-1"
            },
            "answer_text": "So let's be a little more specific. Don't just enlist in a 15 series MOS. You have 2 options if you want to be a rotor-wing gunner (I don't know anything about the fixed-wing side of the house).  As a crew chief/door gunner myself, I'll set this a little more straight. Enlist as either a 15T or as a 15U. A 15T is a UH-60 (Blackhawk) Repairer  and a 15U is a CH-47 (Chinook) Repairer.  In either case, you'll likely start as just a maintainer, fixing the helicopter. Most units, to my knowledge, start all new soldiers in a D Company (maintenance company) or an ASB (Aviation Support Battalion). If you are physically qualified and a decent worker, you could be sent to a flight company, where you'll be trained as a crew chief. It's similar to your school you went through to become a mechanic, but WAY more in depth on the systems of the helicopter, the medical effects of flying on the body, gunnary, NVG operations, limitations of the aircraft, how to handle passengers, securing cargo, aerospace surveillance, how to work as a member of a crew with your pilots, terminology, calls, so on, and so on. It's an intense amount of information and it's a bit grueling. You can also be a gunner another way. Essentially any MOS can hold the position while deployed. I'm pretty sure you still have to be cleared by a flight doc same as a 15T or 15U, and still have to go through the gunnary academics. DO NOT let a recruiter tell you to go 15R because Apaches have guns. You won't fly. None of their enlisted guys do. You have to be a Warrant Officer pilot or Commissioned Officer pilot to fly those. Their “crew chiefs” prep the aircraft for flight and fix it when it's broken. That's about it. As a T or U, you'll fly a ton. I fly, on average, twice a week. The rest of my time is spent fixing aircraft. If you have any other questions about the 15T MOS, let me know!  ",
            "date": "Updated August 19, 2018",
            "views": "322",
            "upvotes": " View 618 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Brian Wang",
                    "user_href": "/profile/Brian-Wang-229"
                },
                {
                    "user_id": "Kai Aschwanden",
                    "user_href": "/profile/Kai-Aschwanden"
                },
                {
                    "user_id": "Andrew Hernandez",
                    "user_href": "/profile/Andrew-Hernandez-84"
                },
                {
                    "user_id": "Kyle Gasparini",
                    "user_href": "/profile/Kyle-Gasparini"
                },
                {
                    "user_id": "Roger Mitchell",
                    "user_href": "/profile/Roger-Mitchell-67"
                },
                {
                    "user_id": "Daniel Vazquez",
                    "user_href": "/profile/Daniel-Vazquez-102"
                },
                {
                    "user_id": "Babita Gala",
                    "user_href": "/profile/Babita-Gala"
                },
                {
                    "user_id": "Lucas Eyre",
                    "user_href": "/profile/Lucas-Eyre-3"
                },
                {
                    "user_id": "Jyotishman Hazarika",
                    "user_href": "/profile/Jyotishman-Hazarika-5"
                },
                {
                    "user_id": "Chris Delao",
                    "user_href": "/profile/Chris-Delao-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Jeremy Brookins",
                "href": "/profile/Jeremy-Brookins"
            },
            "answer_text": "Enlist as a 15 series helicopter repairer and be squared the hell away. If command thinks you can run a helicopter crew, you'll go to crew chief school. Being a door gunner is only one of their duties, but hey, you get to pew pew for a bit before going back to being a wrench. So to recap - Join as a helicopter repairer of some sort, ideally one of the birds that has guns on doors.Bust your ass from day one and don’t suckLearn where everything should be and what needs to be done. Make it happen.Be the most high speed, low drag PFC then Specialist in your unit. Make sure everyone knows you want to puke on a regular basis.Impress leadership and current crew chiefsGo to school and ",
            "date": "Answered June 27, 2018",
            "views": "78",
            "upvotes": " View 132 Upvoters",
            "upvoters": [
                {
                    "user_id": "Lukas Lyra",
                    "user_href": "/profile/Lukas-Lyra"
                },
                {
                    "user_id": "Thomas H Pritchett",
                    "user_href": "/profile/Thomas-H-Pritchett"
                },
                {
                    "user_id": "Brian Novak",
                    "user_href": "/profile/Brian-Novak-14"
                },
                {
                    "user_id": "Jordan Jetter",
                    "user_href": "/profile/Jordan-Jetter-2"
                },
                {
                    "user_id": "Billy Key",
                    "user_href": "/profile/Billy-Key"
                },
                {
                    "user_id": "Eric Heidt",
                    "user_href": "/profile/Eric-Heidt-2"
                },
                {
                    "user_id": "Reinhard Haußer",
                    "user_href": "/profile/Reinhard-Haußer"
                },
                {
                    "user_id": "Sonny Abraham",
                    "user_href": "/profile/Sonny-Abraham-1"
                },
                {
                    "user_id": "Will S",
                    "user_href": "/profile/Will-S-60"
                },
                {
                    "user_id": "Stephen MacRae",
                    "user_href": "/profile/Stephen-MacRae"
                }
            ]
        }
    ]
}