{
    "title": "How was your first SSB experience and whether you are recommended or not? Can you provide any suggestions to freshers for getting recommended. - Quora",
    "tags": [
        "SSB Training India",
        "SSBCrack",
        "Freshers (new graduates)",
        "SSB Training Institute",
        "Services Selection Board (SSB)",
        "Indian Army",
        "Indian Armed Forces"
    ],
    "response": [
        {
            "author_info": {
                "name": "Abhishek Singh Tomar",
                "href": "/profile/Abhishek-Singh-Tomar-56"
            },
            "answer_text": "My first attempt AFSB was in nov 2019 at 2 afsb mysore. I was conference out. That what just a silly mistake that too I realized just after comming out of the interview room. Cannot share here as a long story. But the experience was awesome. Just a small advice. Dont listen to any repeater. Including me. They are repeater not accessor if they know what is wrong or right they might got recommended and even recommended students dont know why they got selected. Be yourself give your best, be genuine and true. Be a good person you will sure be selected. No one is same everyone have a different story. Just know the procedure and prepare. Jai Hind. ",
            "date": "Answered July 4, 2020",
            "views": "153",
            "upvotes": " Answer requested by Pankaj Joshi",
            "upvoters": [
                {
                    "user_id": "HG Gokul Gowda",
                    "user_href": "/profile/HG-Gokul-Gowda"
                },
                {
                    "user_id": "H Chaudhary",
                    "user_href": "/profile/H-Chaudhary-7"
                },
                {
                    "user_id": "Nadim Sheikh",
                    "user_href": "/profile/Nadim-Sheikh-11"
                }
            ]
        },
        {
            "author_info": {
                "name": "Ayushi Lamba",
                "href": "/profile/Ayushi-Lamba-3"
            },
            "answer_text": "My first SSB experience was really good. I went to 1 AFSB dehradun. I got to learn a lot of things about myself and it really changed me. I was conference out. And I am not a recommended candidate till now. But now I am very clear about the do's and dont's . For a fresher my suggestion is prepare your psychology test well. And your personal interview. First chance is the golden chance. Introspect yourself and think twice before you speak in your interview and conference. All the best! ",
            "date": "Answered June 27, 2020",
            "views": "234",
            "upvotes": " View 3 Upvoters "
        }
    ]
}