{
    "title": "How to write an informative speech about myself - Quora",
    "tags": [
        "Informative Speech",
        "Speech Writing",
        "Public Speaking",
        "Speech"
    ],
    "response": [
        {
            "author_info": {
                "name": "Bill Cobb",
                "href": "/profile/Bill-Cobb-12"
            },
            "answer_text": "Hi, The basic outline is your past, present, and then future, but make it more interesting than reading a resume. To prepare: list some unusual or interesting or unknown facts about yourself for each of the above three spheres (nickname, hometown, family, experiences, things you love/hate, etc.). See if you can arrange the material of your life in something that resembles a journey or quest. Then look for some common threads to tie it together. For example a friend is doing a self intro for Toastmasters. She realizes that her present accomplishments aren’t as satisfying as she expected, and are subjected to the law of diminishing returns. In discussing that, the analogy was used that the first bite of chocolate cake isn’t as satisfying as the tenth. It came out that she loves chocolate cake, and her first birthday cake was a chocolate one. So in each segment (past, present, future) the love of chocolate cake tied the speech together. Leave out details (especially dates) that distract from the flow. People don’t need your life story, just a few points that reveal the hidden you. My friend grew up in a rural village in Taiwan, reading Japanese comics, and watching American movies (not typical for her audience, thus interesting). When she came to do grad work in the US, she discovered that America wasn’t like the movies (explained in a short sentence; everyone is interested in an unusual perspective about their world). She ended with her aspirations for the future, which hopefully wouldn’t be subject to the law of diminishing returns, and included that she would still be eating chocolate cake. She included both facts, and a commentary on them that did more than merely inform her audience, but gave them food for thought. Best wishes, -bc ",
            "date": "Answered June 20, 2018",
            "views": "3",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Sree Lekha",
                    "user_href": "/profile/Sree-Lekha-198"
                },
                {
                    "user_id": "Cherry Blossom",
                    "user_href": "/profile/Cherry-Blossom-197"
                },
                {
                    "user_id": "Matthew Schultz",
                    "user_href": "/profile/Matthew-Schultz-33"
                }
            ]
        },
        {
            "author_info": {
                "name": "Peter Haki",
                "href": "/profile/Peter-Haki"
            },
            "answer_text": "Try first to find a headline, s.thing like a title of your bio.  Then write down your bio in 3 sentences. After this exercise in 12 sentences.After this fill out one A4 about yourself. Finally write as long as you like.Now you gained an overlook describing yourselfYou may also do this steps in reverse or by choice to come to your result. ",
            "date": "Answered October 4, 2018",
            "views": "650",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Mugobi Isaac Emmanuel",
                    "user_href": "/profile/Mugobi-Isaac-Emmanuel"
                }
            ]
        },
        {
            "author_info": {
                "name": "Edward Kruger",
                "href": "/profile/Edward-Kruger-4"
            },
            "answer_text": "First of all, make a plan about what you’re going to tell about yourself. I believe that the main points that must be presented are: Your personal information like name, surname and birthplace;A place where you studied/are currently studying;A place where you worked/are currently working;Your achievements at college/work;Your life goals.I believe that if you’ll follow this plan, you’ll have a good informative speech. ",
            "date": "Answered July 6, 2017",
            "views": "17",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Vaishnavi Balachandran",
                    "user_href": "/profile/Vaishnavi-Balachandran"
                }
            ]
        }
    ]
}