{
    "title": "How to learn to write comedy - Quora",
    "tags": [
        "Stand-Up Comedy",
        "Creative Writing",
        "Comedy"
    ],
    "response": [
        {
            "author_info": {
                "name": "Denis Martindale",
                "href": "/profile/Denis-Martindale"
            },
            "answer_text": "Comedy depends on us getting the joke and not missing the joke in the way presented to us. So if we memorise the telling of a joke that is told by an expert in such techniques, then we’ll be able to imitate the style, but sometimes it’s the person telling the joke that portrays it better than we ever could. So if we met a stranger and told a joke perfectly as intended, it doesn’t mean that everybody gets it. We know that comedians have different styles, some are dead pan and others are larger than life. So what are we? Are we able to become someone else in that portrayal, or dress up in a clown’s costume, or wear silly glasses, or use some extra body language to convey what we mean? Some comedians have a fake laugh at the end of telling a joke, as if that creates a cue for the audience to laugh as well. The TA-DA on the drums was another cue for the audience. When writing comedy, the one-liner style is so precise that you couldn’t make things better. It’s a small world, but I wouldn’t want to paint it… The 5,000 one-liners I studied in a book helped me to see the way that phrasing was everything. It helped me to write in a similar way for a 30-day motto-writing project I began. I liked writing words on a page with a new calligraphy pen. I felt the words were so beautiful that I wanted to write in a profound way, so that’s how the motto idea began and led to about 3,000 quotations… In Radio sketches, here in the UK, everything depended on the characters and the way each reacted. So we’d be able to understand as regular listeners to such shows and catchphrases were repeated because of this familiarity. The early silent movies were slapstick adventures and tried to use any resource available at that time. So budgets were the prime force in creating drama as well as comedy. We also know of acrobatics being used in comedy scenes as well as dancing and stunt work. So these will be especially created for maximum use for short sequences. We also see songs being used to charm the audiences so they will warm to a character, even when he’s being really silly, or as thick as a brick. As for writing, it isn’t just one guy every single time. There are TV shows like the Simpsons that rely on a team of writers that bombard us with one idea after another. So there must be a cohesive element at work between the writers themselves. It was the same way for the Comedy Store ad-libs and the improv-writing. Just let anything happen, write it down… Repeat the sequence, get more ideas and create a sequence that will work for whatever time length is required. Sketches may last 10 minutes, yet be crippled with severe editing, only to be replaced by other writers and their sketches, yet not at the same quality. So it’s not always what we get to see and hear that’s the best available. The writing for the most amazing TV comedy series is transferred to typed-out TV episode scripts. So if we ever get access to these we will get some idea of any extra editing ideas that way. Another example, explained in a Benny Hill biography, was that Benny sent some sketch details and the person receiving these squiggles on scraps of paper finally figured out their true meanings. So writing isn’t always text, sometimes it’s squiggles and text. For the Two Ronnies, Ronnie Barker contributed convoluted word play for the intended sketches and then performed these with Ronnie Corbett. So they got used to these dialogues and monologues and had to be on their toes at all times… especially Ronnie Corbett. The TV characters in the US are decidedly different because insults are thrown about like confetti at a wedding. Characters go back and forth with these insults and create a tension in the audience, will this escalate and go too far? Such involvement leads to truces when characters say sorry to each other, but next week they’re back just like before. The underdog character of Norman Wisdom and Frank Spenser fame is common and so is the class system or the better-off toffs. So there will be a time for characterisation to lay the ground for us to assess that person and that person’s preferences, only to shatter their hopes and dreams like Inspector Clouseau, as soon as he enters their house and breaks up the furniture and prize possessions. The expert who appears to be a know-it-all is humbled by the guest star in the film or the TV show, the put-downs say everything and then the audience wants to see if the next step is a revenge prank or not… So it’s the setting up of a motive that leads to an action, perhaps a surprise ending… Authority figures are challenged at every turn, but the characters still need something good about them in order to prolong the TV series. The opposite of this is the eternal rotter or rogue like the evil Alan Bstard who would cheat anybody he could… It’s the TV show that creates the best comedy because we revisit the character and know he can’t be trusted. The variation of this was seen in the film with Peter Cook as the Devil. In the film Bedazzled, Peter plays this so well. At times, the character seems petty and at other times aloof and at other times using meticulous planning. It’s the variety that changes the audience’s perception. It reminds me of Columbo, the TV detective with every trick in the book to catch the criminal. The bumbling buffoon, the celebrity fan, the calling back at their houses or places of work, or stopping and saying, Just one more question… So while we see a character catch us out the first time, we can’t see the character again and still feel the same way. It was the same for me, as a TV wrestling fan, seeing comedy wrestlers like Les Kellett and Catweazle. At first, they come across as polite and willing to shake hands with everybody, later on, not so much… The comedy was in the put-downs of their opponents and even the referees didn’t escape their jokes. So while writing is typing text on paper, the human mind visualises ideas and plays these out and embellishes them with wit and wiles, just to make us laugh. It’s a business for some and a pastime for others. Sometimes the comedians go home and can’t switch off being funny even there. They wisecrack all the time. It’s like they know the gift or talent is so strong that they must always be open to it. Pretty soon, another idea is developed and becomes a masterpiece shared with millions. It’s the editing stage that is paramount. That’s where the real magic is going on! ",
            "date": "Answered April 22, 2018",
            "views": "14",
            "upvotes": " View 6 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Ramon Rivera",
                    "user_href": "/profile/Ramon-Rivera-180"
                },
                {
                    "user_id": "Amy King",
                    "user_href": "/profile/Amy-King-124"
                },
                {
                    "user_id": "Matthew T. Waterhouse",
                    "user_href": "/profile/Matthew-T-Waterhouse"
                },
                {
                    "user_id": "Abbey Linsky",
                    "user_href": "/profile/Abbey-Linsky"
                },
                {
                    "user_id": "John Smith",
                    "user_href": "/profile/John-Smith-30682"
                },
                {
                    "user_id": "Sabira Woolley",
                    "user_href": "/profile/Sabira-Woolley"
                }
            ]
        },
        {
            "author_info": {
                "name": "Muhsin Tokel",
                "href": "/profile/Muhsin-Tokel"
            },
            "answer_text": "Need a system for writing jokes?Have great ideas, but don’t know how to make them funny?Have writer’s block and can’t seem to get through it?Now you can start learning to write comedy like a pro almost immediately!Hi Everyone! I’ve been working my butt off to put together this e-book. Finally, after months of trying to make sure I put everything in the book that I cover in a weekend seminar, plus a couple of cool bonuses, it’s ready!! This comedy writing system is powerful. I give you multiple ways to write comedy from scratch on virtually any subject! Whether you are new to comedy writing or have been performing for a while, I guarantee–that’s right, GUARANTEE–that you will benefit from the tools I give you in this comedy writing system. If you’re tired of not hitting the bulls-eye with your jokes and bits, if the material you’ve been coming up with doesn’t quite “pop,” or feels like it needs something else, this is the writing system for you! If you’ve been reading my blog or keeping up with the advice I’ve been giving for free, that’s just been scratching the surface. FOR THE COMEDIAN, WRITER OR PRESENTER: Inside this book I give you multiple ways to approach writing jokes on any subject.How to take your failures, weaknesses, frustrations, pet-peeves and turn them into triggered laughs.How to NEVER get foiled by ‘writer’s block’ ever again!I will show you the best ways to get the highly-coveted applause break.How to utilize a multi-pronged process for creating your comedy and knowing why it will be funny!I am so confident that you will find this comedy writing system powerful, that I am offering you a 30-day money-back guarantee! ",
            "date": "Answered June 3, 2018",
            "views": "577",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "CK Films World",
                    "user_href": "/profile/CK-Films-World"
                },
                {
                    "user_id": "Chris Malkoski",
                    "user_href": "/profile/Chris-Malkoski"
                },
                {
                    "user_id": "Gargee Suresh",
                    "user_href": "/profile/Gargee-Suresh"
                }
            ]
        }
    ]
}