{
    "title": "How to send bulk emails from Gmail without making it go as spam - Quora",
    "tags": [
        "Spam Filtering",
        "Email Spam",
        "Email Marketing",
        "Gmail"
    ],
    "response": [
        {
            "author_info": {
                "name": "Aleksey Danchenko",
                "href": "/profile/Aleksey-Danchenko"
            },
            "answer_text": " Although Gmail is positioned as the inbox for private messaging and not for commercial purposes, you can use it to send bulk emails to multiple recipients. However, before opting for this, mind the following: You can only send up to 500 emails per 24 hours to 500 different email addresses. To send mass emails in Gmail, you’ll have to split the sending schedule into several days.You need to comply with Gmail bulk email guidelines so that your messages don’t end up in Spam.In Gmail, you can create only text emails. It’s possible to merge with some email builders or ESPs and upload an HTML version but this means you need to register with the third-party service anyway.You can’t preview emails in Gmail and so won’t be able to check whether the design is responsive and is displayed correctly on different gadgets.You can’t personalize emails sent via Gmail.You can track only opens.Gmail doesn’t provide reports on the sent campaigns.Email Size Matters Gmail clips emails (that is hides their full content) with a copy size larger than 102KB. Such limit is set to secure the proper management of the service server and avoid failures that may be caused by numerous large-sized emails. Emails with the hidden content include the phrase [Message clipped] and a View entire message link at the bottom of the message.  That’s why the first thing to avoid clipping is to check the exact size of the email template before sending a campaign. Save the code as an HTML file, right-click it and check its Properties > Size.  Note. If you send via an ESP, make sure their system uses the right coding. For example, there are some services that still use ISO-8859-1 for HTML emails, although this coding can cause email clipping, even for emails that weigh less than 102KB. Download Time The larger the email size, the longer it will take to download all the content. On average, a 30KB message is downloaded in 2 seconds, 60KB – in 3-4 seconds, etc. The longer the download time, the more likely it will be deleted by the recipient, especially when displayed on a mobile device where the download speed can be much slower. Image Size and Email Code The images themselves don’t add weight to the file size. Some resources warn that images above 20KB can be labeled as spam, while others suggest that images up to 50KB pass through spam filters. In our experience, the size of the image has no impact on the weight of the email, yet may affect the download speed. In the eSputnik system, the image size limit is set to 2MB, but it’s better to stick to even smaller size. The lighter the image, the faster it would be uploaded, meaning people won’t have to waste their time waiting. One more thing to note is that using too many images with minimum text is a signal for spam filters. It happens because spammers typically display information on large images instead of text as they can't be \"read\" by anti-spam programs. To avoid spam issues, keep the 60/40 ratio, where 60% is text, and 40% – images. How To Avoid Spam Filters and Gmail Clipping 1.Improve Content Quality Build templates that don't exceed 102KB.Add only important information. Give a link to the data that can be found on the website: product description, detailed reviews, testimonials, etc.Don't try to include all your offers in one campaign. Instead, create a series of emails and send to corresponding segments.Don't send emails with the same subject line. Gmail usually combines such emails into one series, increasing the email weight.2.Get Smart with Code Delete comments, double spaces, and line breaks from the template. Don't use shortened URLs.Use minimum structures and containers. Add the basic structures – header, body, and footer – and then include the necessary modules. This shortens the code and allows to create rather long emails. Avoid style attributes. Create a layout for the entire email and try not to edit separate elements.Compress HTML with special services: htmlcompressor, minifycode, etc.Run tests. Before launching a campaign, send a test email to your Gmail account and check the layout.",
            "date": "Answered September 16, 2020",
            "views": "64",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Thomas Connors",
                "href": "/profile/Thomas-Connors-28"
            },
            "answer_text": "Good question! It’s important to understand that it’s not necessarily Gmail marking your email as spam. When you send your bulk emails, they’re passing through two spam filters – one when it leaves your sender and one when it arrives at your contacts’ client. You can read more about how spam filters work right here. One of the biggest factors you have control over when it comes to improving deliverability is the content of your email. Familiarize yourself with the words, phrases, and design choices that could cause your email to land in the junk folder. For instance, don’t overuse the word ‘free’ and include mostly (or exclusively) images in your campaign. Especially with cold email outreach, there’s nothing wrong with a text-only email as your first point of contact. It’s also extremely helpful to send with a platform that was designed to help you avoid spam filters, like Clickback. Clickback sends using its own IPs and domains and features an IP warmup process that keeps your sender reputation in pristine condition. It also features a live spam checker that will double check your email content to ensure that you’re not sending anything that might get caught up in spam fitlers. Clickback is the ideal tool for reaching a large list of purchased contacts, so you can convert them into warm, opted-in leads to nurture alongside the rest of your opted-in list. Hopefully that helps! Disclaimer: I work at Clickback. ",
            "date": "Answered September 24, 2020",
            "views": "29",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Efrayim Bulka",
                    "user_href": "/profile/Efrayim-Bulka-1"
                }
            ]
        }
    ]
}