{
    "title": "How can I write a director’s script - Quora",
    "tags": [
        "Screenwriting",
        "Movie Directors",
        "Writing Advice",
        "Writing"
    ],
    "response": [
        {
            "author_info": {
                "name": "Tilak Dakal",
                "href": "/profile/Tilak-Dakal"
            },
            "answer_text": "what do you mean by director’s script… that doesn't make any sense… I think what you really trying to say is writing your own script and the same time directing it also… then you are about to play a duel role… as scriptwriter your job remain only to write a screenplay not including camera’s angle kind of stuff… and when you turn into a director role.. all you have to do is visualize how you want to portrait it by adding all those camera’s stuff as ‘PAN’ ‘CLOSE SHOOT’…. my last is advice don’t merge this two role… you just can’t play it at the same time…. that would be a lot of confusion. ",
            "date": "Answered March 18, 2017",
            "views": "367",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Kate Singh",
                "href": "/profile/Kate-Singh-1"
            },
            "answer_text": "If you are a screenwriter you don’t “write” a director’s script. You write a reading script. If you are lucky a director will get to take that script and turn it into a shooting script, which is a road map of shots, sound cues, dialogue, etc that will be used to guide the production phase and translate your reading script into the medium of film (or video). The writer doesn’t write the shooting script. Period. ",
            "date": "Answered March 24, 2017",
            "views": "504",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Elhamy Fyroz",
                    "user_href": "/profile/Elhamy-Fyroz"
                }
            ]
        },
        {
            "author_info": {
                "name": "Lisa Clemens",
                "href": "/profile/Lisa-Clemens-1"
            },
            "answer_text": "Not sure what that means. Do you want to write a script and get a director to buy it? Do you want a director to hire you to write one? Do you want to write and direct? ",
            "date": "Answered March 18, 2017",
            "views": "98",
            "upvotes": " Answer requested by Elhamy Fyroz"
        },
        {
            "author_info": {
                "name": "Jim Gleeson",
                "href": "/profile/Jim-Gleeson-3"
            },
            "answer_text": "To do that, I suggest looking at this link. http://videoandfilmmaker.com/wp/index.php/tutorials/director-prepares-visual-script-breakdown/ ",
            "date": "Answered March 17, 2017",
            "views": "150",
            "upvotes": " Answer requested by Elhamy Fyroz"
        }
    ]
}