{
    "title": "How to write an imagery poem - Quora",
    "tags": [
        "Poems",
        "Poetry",
        "Creative Writing"
    ],
    "response": [
        {
            "author_info": {
                "name": "Rohitanshu Kar",
                "href": "/profile/Rohitanshu-Kar"
            },
            "answer_text": "Imagery is the name given to the elements in a poem that spark off the senses. Despite image being a synonym for picture, images need not be only visual; any of the five senses (sight, hearing, touch, taste, smell) can respond to what a poet writes. Imagery intensifies the impact of the poet’s words as he shows us with his words rather than just telling us what he feels. Song lyrics are full of imagery. The three ways to write imagery poems are: 1. Brainstorm a subject for the poem 2. List words for all five senses 3. Tie description to action This is an excerpt from Preludes, an imagery poem by T. S. Eliot. You can almost see and hear the horse steaming and stamping and smell the steaks: The winter evening settles down With smell of steaks in passageways. Six o'clock. The burnt-out ends of smoky days. And now a gusty shower wraps The grimy scraps Of withered leaves about your feet And newspapers from vacant lots; The showers beat On broken blinds and chimney-pots, And at the corner of the street A lonely cab-horse steams and stamps. And then the lighting of the lamps. ",
            "date": "Answered May 11, 2018",
            "views": "22",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Henry Hawes",
                    "user_href": "/profile/Henry-Hawes-1"
                },
                {
                    "user_id": "Pratibha Kotak",
                    "user_href": "/profile/Pratibha-Kotak"
                }
            ]
        },
        {
            "author_info": {
                "name": "Olivia Yang",
                "href": "/profile/Olivia-Yang-12"
            },
            "answer_text": "In an imagery poem, try and think of what you’re describing. MAKE the reader think that he/she is in that place. Also, one tip is to use language suggesting something of the place. For example, if you’re talking about a pastoral setting, try and use language synonymous to nature, flowers, etc. Make sure to describe it in a way that isn’t to “constructed” and “description-y”. (Best words I can think of at the moment. Writing an imagery poem can allow readers to really feel they are there, so it’s very effective when written well. :) For example, if you’re writing about being in a meadow, make he/she feel that they are touching the flowers, or that the gras is brushing against their legs, or they can smell the air, etc. There’s a pretty good imagery poem down below. T.S. Eliot The winter evening settles down With smell of steaks in passageways. Six o'clock. The burnt-out ends of smoky days. And now a gusty shower wraps The grimy scraps Of withered leaves about your feet And newspapers from vacant lots; The showers beat On broken blinds and chimney-pots, And at the corner of the street A lonely cab-horse steams and stamps. And then the lighting of the lamps. ",
            "date": "Answered January 10, 2017",
            "views": "16",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Tyler Brown",
                "href": "/profile/Tyler-Brown-55"
            },
            "answer_text": "Tell a story with the imagery. Use metaphor and simile as things happen within the scene you are painting to walk your reader through it. You aren’t showing your reader a pretty snapshot, you’re paining them a video. A static imagery poem tends to feel a little flat Make it sound musical In poetry, proper application of alliteration adds animation and also leads the literature’s audience far afield in imagination. Rhythm and Rhyme are quite an effective foundation, too. Formulaic devotion to the Bard’s structures are not required all the way through. Breaks are good. Use the right words Why use blue when azure, icy, sapphire, these far more fluid and evocative adjectives exist? The sun ain’t bright, it’s brilliant, fiery, searing, scorching. Hit more than one sense. Vision is one of numerous senses. What does it sound like, what are the smells, how does the air taste and feel on your skin, should the reader feel off balance, does time pass. The Weft and Weave of writing poems is a combination of all these factors. ",
            "date": "Answered January 14, 2017",
            "views": "32",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Maria Wellman",
                "href": "/profile/Maria-Wellman-1"
            },
            "answer_text": "Finally a question regarding what I specialize in. Imagery is super easy it’s literally taking what you see or would see in a scenario and describe it. Not just the tree is brown. The trees monstourous vody towered over me like something of ancient lore. It’s rough hide pricked my fingers and is lithe arms danced in the spring wind. Use your words to tell the reader what you see by evoking beautiful images and feelings. ",
            "date": "Answered April 7, 2018",
            "views": "406",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Mohit Verma",
                "href": "/profile/Mohit-Verma-715"
            },
            "answer_text": "Bro just write from core of your heart…nothing else u need to do…true poetry is one which can communicate from one heart to another heart..if u write it from your heart it will surely communciate and surely became an imaginary poetry… ",
            "date": "Answered April 9, 2018",
            "views": "357",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Rahul Chib",
                    "user_href": "/profile/Rahul-Chib-4"
                },
                {
                    "user_id": "Jourik Vink",
                    "user_href": "/profile/Jourik-Vink"
                }
            ]
        },
        {
            "author_info": {
                "name": "Randel Martino",
                "href": "/profile/Randel-Martino"
            },
            "answer_text": "just use your imagination ",
            "date": "Answered April 10, 2018",
            "views": "61",
            "upvotes": "0"
        }
    ]
}