{
    "title": "How hard are the steps from writing a book to the end goal of publishing it? - Quora",
    "tags": [
        "Book Writing",
        "Book Publishing",
        "Goals",
        "Publishing",
        "Writers and Authors",
        "Writing Advice",
        "Writing"
    ],
    "response": [
        {
            "author_info": {
                "name": "Colleen Farrelly",
                "href": "/profile/Colleen-Farrelly-1"
            },
            "answer_text": "It's a lot more involved than I'd originally thought. If you're writing nonfiction, you'll be writing a book proposal to be contracted by a publisher. You'll be given a format to follow for your original draft. Your publisher will then have an editor read through the draft, providing content and structural suggestions. They'll also clean up some of the formatting if needed. Then, you'll go through technical review, where someone in your field will critique the book. At the point where you have a chapter or two ready for press, it will go to marketing, who will solicit opinions and comments from leaders in the field and begin to define target audiences, pitches to sell the book, and whatever else might be needed. This is important. Without marketing, even a good book can be a flop. The pictures in a book usually go through a content check to assure that they will print out okay in press at this point, as well. Once all these steps are done for all the chapters, the book goes to press. They usually print a few hundred copies and send them out for reviews first, add in the reviews, and then mass produce if the reviews are good. ",
            "date": "Answered September 5, 2019",
            "views": "553",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Antonello Chessa",
                    "user_href": "/profile/Antonello-Chessa"
                },
                {
                    "user_id": "Judy Hulen",
                    "user_href": "/profile/Judy-Hulen"
                }
            ]
        },
        {
            "author_info": {
                "name": "Rachel Hauck",
                "href": "/profile/Rachel-Hauck-1"
            },
            "answer_text": "Pretty hard but you can do it if you stay with it! Most new writers are impatient and try to publish too soon. Learn the craft. Meet people. Go to conferences. Network. Build your social media platform. Friend authors on social media and support them. If you want to publish traditionally, you’ll have to find an agent. Once that’s achieved, the process speeds up some but not a lot. There’s not guarantee the agent can sell your work but it does me he/she believes in you. If you publish independently, hire a good editor. Rewrite and rewrite the book. Hire a copy editor and several proofers. Hire a GOOD graphic artist for the cover. Don’t do it yourself. There are a lot of resources on learning how to publisher yourself. Read them. Go to conferences that focus on the business side of indie publishing. Be prepared to support your indie book with marketing dollars. Above all, write a great book. ;) Publishing is a long haul game. Once you get published you have the ardent task of turning the curious into readers, and readers into devoted fans. But it’s worth it in the end. ",
            "date": "Answered September 5, 2019",
            "views": "83",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Judy Hulen",
                    "user_href": "/profile/Judy-Hulen"
                }
            ]
        }
    ]
}