{
    "title": "How would you complete the sentence 'I love it when ____________'? - Quora",
    "tags": [
        "English Sentences",
        "Creative Writing",
        "Sentences (language)",
        "Grammar",
        "English Grammar"
    ],
    "response": [
        {
            "author_info": {
                "name": "Anshu Bharti",
                "href": "/profile/Anshu-Bharti-15"
            },
            "answer_text": "I love it when I see an old couple being cared by their family members. I see grandparents in most of the families sitting in a corner, in a room or may be spending time in balcony staring at nowhere. We all are so engrossed in life, in making career or enjoying our youth that we never look into the fact that we will also encounter this phase of life, sooner or later. Imagine yourself sitting in a room with your weak body. You need support to go out, you need support to walk but the heart in you is still a child (The heart never grows old, it just acts to be matured depending on time and situation), wants to express emotions and laugh loudly. But you have no one to share your sentiments and talks. Even if you get a chance to do so, you are considered to have lost your brain. You hesitate to ask your children for water as you have fear to face their irritation. You try to get up yourself, walk towards kitchen and drop the glass from your shivering hands. You increase the work for your young children who are already busy or disturbed with their own work. You then listen, “Papa/Mama! What is the use of doing things on your own, when you know, you can not?” It hurts, it hurts a lot, because you got up with the intention of not disturbing them at their work. Your good intention turned up as a disturbance. Alas! Guests come to your house, you feel good and want to talk to them, but they find you too modest and scanty to spend time with you. You crave for them and they go farther. You are so outdated and old-fashioned to them. Another case, your children are settled in different cities. You crave for their calls. They call you, but often they want to keep the call short. Why? Because they have a feeling that you can not understand them, their struggles and problems they are going through. You must know or must have the guessing ability about their mood. Your repeated questions may annoy them, your complains about your loneliness or deteriorating health may exasperate them and you end up losing their frequent calls. I have a small child. I am enjoying every beat of life with him. I am young, energetic and lively. I jump, I dance, I frolic – all with an intention to entertain him. But deep down, I am scared if he can do the same with me, when I grow old and become a child again? Do you also get alarmed with such thoughts? Thank you for reading. Stay Calm! Anshu ",
            "date": "Answered May 25, 2018",
            "views": "14",
            "upvotes": " View 17 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Eli Voss",
                    "user_href": "/profile/Eli-Voss-1"
                },
                {
                    "user_id": "Ragib Shaikh",
                    "user_href": "/profile/Ragib-Shaikh"
                },
                {
                    "user_id": "Bhuvanesh Sharma",
                    "user_href": "/profile/Bhuvanesh-Sharma-7"
                },
                {
                    "user_id": "Siddarth Tiwari",
                    "user_href": "/profile/Siddarth-Tiwari"
                },
                {
                    "user_id": "Vinod Raja",
                    "user_href": "/profile/Vinod-Raja-9"
                },
                {
                    "user_id": "Karthi Chockkalingam",
                    "user_href": "/profile/Karthi-Chockkalingam"
                },
                {
                    "user_id": "Rahul Sargam",
                    "user_href": "/profile/राहुल-सरगम-Rahul-Sargam"
                },
                {
                    "user_id": "Muskan Gupta",
                    "user_href": "/profile/Muskan-Gupta-613"
                },
                {
                    "user_id": "Ushan",
                    "user_href": "/profile/Ushan"
                },
                {
                    "user_id": "Kushagra Dubey",
                    "user_href": "/profile/Kushagra-Dubey"
                }
            ]
        },
        {
            "author_info": {
                "name": "Gunjan Gupta",
                "href": "/profile/Gunjan-Gupta-45"
            },
            "answer_text": "Dad smiles at me, because of something randomly stupid I did and he noticed.Mom hugs me, and talks to me openly about everything.Dad doesn’t keep calling me even if it’s late at night and I haven’t reached home yet, because he trusts me, and wants me to feel free.Someone compliments me, apart from my physical appearance.I reach home, and change into my T-shirts and Pj’s. That relief!I wake up to a truly sweet long message.He calls.I complete my tasks for the day, successfully.I plug in music and go for a walk late night.Someone remembers something really minute about me.I wake up to rains outside, and I still have time to crawl beneath my blankets.I get appreciation through Quora messages.I get ready to go somewhere, look at myself in the mirror, and the word that pops out in my head is, ‘perfect!’I wake up early, by chance. (Because trust me, that happens once in a blue moon)I read a quote or a meme which perfectly describes me or my situation.Someone sends me a quote saying that it reminded them of me.I get to plug in my headphones, sit in the car, look outside, and travel somewhere.I find a song I know I’m gonna listen to, in loop.It’s a good hair day.Someone says, ‘Text me when you reach home safe.’Someone makes me laugh so hard that my stomach aches.I watch F.R.I.E.N.D.S. and everything else just takes a back seat.Best friends call just to ask, how am I doing?A stranger smiles at me. (Not the creepy ones)I find out extra money in an old jeans.I enter a bookstore, and see so many good smelling books all around.Amazon shopping cart arrives home. (Do you know how long I waited for you?)Rajma-Chawal is in lunch, and Gajar-Halwa is in dessert!And on and on and on. I realize I have a lot in life to be grateful for.",
            "date": "Answered March 10, 2017",
            "views": "23",
            "upvotes": " View 46 Upvoters",
            "upvoters": [
                {
                    "user_id": "Pushpender Kumawat",
                    "user_href": "/profile/Pushpender-Kumawat"
                },
                {
                    "user_id": "Akshaya Balan",
                    "user_href": "/profile/Akshaya-Balan"
                },
                {
                    "user_id": "Avishi Agarwal",
                    "user_href": "/profile/Avishi-Agarwal"
                },
                {
                    "user_id": "Shalini Sharma",
                    "user_href": "/profile/Shalini-Sharma-164"
                },
                {
                    "user_id": "Shreya Shankar",
                    "user_href": "/profile/Shreya-Shankar-30"
                },
                {
                    "user_id": "Siddhi Shah",
                    "user_href": "/profile/Siddhi-Shah-52"
                },
                {
                    "user_id": "MedhA Arun",
                    "user_href": "/profile/MedhA-Arun"
                },
                {
                    "user_id": "Narendra",
                    "user_href": "/profile/Narendra-104"
                },
                {
                    "user_id": "Abhishek Kishore",
                    "user_href": "/profile/Abhishek-Kishore-5"
                },
                {
                    "user_id": "Jayshree Sharma",
                    "user_href": "/profile/Jayshree-Sharma-2"
                }
            ]
        }
    ]
}