{
    "title": "How to change someone with bad characters - Quora",
    "tags": [
        "Understanding Character and Personality",
        "Character and Personality",
        "Interpersonal Interaction"
    ],
    "response": [
        {
            "author_info": {
                "name": "Eva Morgan",
                "href": "/profile/Eva-Morgan-17"
            },
            "answer_text": "You don't. Regardless of your good intentions, or how much you care about the person, one unequivocal fact that I have learned over time (and through much trial and error) is that any real change in character MUST come from within. That's not to say that people can't change, just that they have to really want to and there's nothing anyone can say or do to induce that epiphany. Not another human, anyway. The only times where an outside influence can really effect change is if the person is young and only reacting badly to something, some unfortunate life circumstance that, once resolved, may be overcome if their shown, through deed and action, another way of behavior. When it comes to an attempt to change the character of another adult who has shown no inclination to change (words dont count; many apologies are, while spoken with complete sincerity, really only expressions of regret at being caught, and any promises to change must be backed up in deed before you can put any faith in them) would be to take a step back, lead by example and give it time. If the person genuinely cares for you, the fact that you're behaving with maturity and self-respect instead of being a doormat or spending your time nagging at them to be someone their not, well if they're going to come around they will. And if they don't, then it's up to you to look more closely at the relationship and decide why you want this person in your life. If the character “flaws\" are genuine flaws, if they have a temper or a substance abuse problem, if they cheat or don't show you the respect that you deserve, than I think the answer is obvious. But if they just aren't what you'd imagined when you first met, maybe not as ambitious or have different interests, you have a serious decision to make. You can either step back, do your thing and see if you guys have anything real to salvage, or just cut your losses before you waste any more of either of your time. Life's too short to spend it with someone you want to change. It's not fair to either of you. ",
            "date": "Answered February 26, 2020",
            "views": "46",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Azaiah Johnson",
                    "user_href": "/profile/Azaiah-Johnson"
                },
                {
                    "user_id": "Phương Thảo Trần",
                    "user_href": "/profile/Phương-Thảo-Trần-10"
                },
                {
                    "user_id": "Stan Jetton",
                    "user_href": "/profile/Stan-Jetton"
                }
            ]
        },
        {
            "author_info": {
                "name": "Keith Turnipseed",
                "href": "/profile/Keith-Turnipseed-1"
            },
            "answer_text": "What worked for me was witnessing miracles of God’s work in the lives of some people around me. It made me want those miracles in my life so I started doing the same thing they were doing. i knew had to stop being a bad person and doing bad things so I did. Then the miracles began to happen for me. This is the only way I know that an adult can help change another adult. Lead by example, live a blessed life and others will want what you have. Then hopefully they will follow in your footsteps. ",
            "date": "Answered February 25, 2020",
            "views": "20",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Alice Bama",
                    "user_href": "/profile/Alice-Bama-1"
                }
            ]
        }
    ]
}