{
    "title": "How to earn more as a freelance writer - Quora",
    "tags": [
        "Freelance Writers",
        "Freelancers",
        "Freelancing Tips and Hacks",
        "Freelancing",
        "Writers and Authors",
        "Writing",
        "Salaries and Wages",
        "Wanting and Making Money"
    ],
    "response": [
        {
            "author_info": {
                "name": "Anmol Ratan Sachdeva",
                "href": "/profile/Anmol-Ratan-Sachdeva"
            },
            "answer_text": "Hey! Thanks for the A2A Nice question and kudos to you that you are thinking to earn more as a freelance writer. The best advice I can give you is that you should invest in skill development. I mean that you should learn supplementing skills like content marketing, SEO, copywriting, etc. to grow your stature as a content writer. Frankly, these days only writing doesn’t work in an individual’s favor in the long term. If you don’t focus on improving your skills, you will become obsolete or clients will only pay you lower price. You should focus on transforming yourself into a marketing consultant who can guide a client on how to leverage writing for increasing sales. If you manage to grow your profile, you will get the attention of high-paying clients automatically. Also, you can charge them more for bundled marketing packages. PS: You can also learn about digital marketing, affiliate marketing, and allied niches and use the skills you learn to promote yourself as a content writer or sell products. You are a writer so you can take care of content marketing part. This way you can grow your earnings in the long term. I am trying to create a comprehensive resource on the same topic which will be ready in a couple of months. I will make sure that you get a copy of the same for getting the exact strategy to top up your skills as a content writer and boost your earnings. ",
            "date": "Answered January 8, 2020",
            "views": "110",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Kshitiz Gaur",
                    "user_href": "/profile/Kshitiz-Gaur-2"
                }
            ]
        },
        {
            "author_info": {
                "name": "Fatima Shroff",
                "href": "/profile/Fatima-Shroff-1"
            },
            "answer_text": "Good clients pay good money, so the best way to earn more money is to find high paying clients. This requires a bit of research and a really tempting proposal and some good marketing skills. I pay atleast $100 every 3-6 months to market my services to such clients. There are some good websites out there which can pay you for some well written guest posts as well. I recommend you try Make A Living Writing - Practical Help for Hungry Writers . Not only can you guest post here and sometimes receive up to $100 per 1000 words or more but they provide some good tips as well. You can even find jobs here so hope it helps you out. ",
            "date": "Answered January 8, 2020",
            "views": "18",
            "upvotes": " Answer requested by Kshitiz Gaur"
        }
    ]
}