{
    "title": "How should businesses do content marketing? - Quora",
    "tags": [
        "Content Strategy",
        "Content Marketing",
        "Business Strategy",
        "Digital Marketing",
        "Web Marketing",
        "Marketing",
        "Startup Strategy"
    ],
    "response": [
        {
            "author_info": {
                "name": "Japneet Singh Sethi",
                "href": "/profile/Japneet-Singh-Sethi-3"
            },
            "answer_text": "Here is a simplified way to build your content marketing strategy. Each and every content piece comes under 4 quadrants and I will explain each of them with an example of gaming. 1- Perception - Focuses on the way your TG perceives the business and how you want it to be perceived as. Example: Gaming today is perceived as a way of connecting with friends, all thanks to the content strategy. 2- Education and awareness - It is very important for a business to educate its TG about the “why” and “how” of the product/services. Example: From a 13 year old to 35 year old today knows what is/how to play a Battle Royale. This is the result of a strong content marketing campaign. 3- Contests and Campaigns - Contests and campaigns keeps your TG engaged with the business. Example: Consistent sweepstakes and in-game rewards as a result of participation in a certain contests hosted by the gaming business keeps the TG happy and loyal to that business 4- PR and Events - PR is what drives the the business’s interaction on a macro level whereas events give you a chance to interact with your TG at a personal level making them feel wonderful and related to the business. Example: A webinar with top gamers talking about the game just like an online influencer meetup. People love to see and hear from people they consider their idols. No content in this world is out of the above 4 points. Basis the above points content can be further divided into sub-buckets and can be disseminated on different platforms. ",
            "date": "Answered May 14, 2020",
            "views": "5085",
            "upvotes": " View 73 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Abhijeet Kamble",
                    "user_href": "/profile/Abhijeet-Kamble-108"
                },
                {
                    "user_id": "Harani P M",
                    "user_href": "/profile/Harani-P-M"
                },
                {
                    "user_id": "Badshaa Bhai",
                    "user_href": "/profile/Badshaa-Bhai"
                },
                {
                    "user_id": "Madhav D Nair",
                    "user_href": "/profile/Madhav-D-Nair-1"
                },
                {
                    "user_id": "Muthu Kumar",
                    "user_href": "/profile/Muthu-Kumar-165"
                },
                {
                    "user_id": "Padmanabhan Bharadwaj",
                    "user_href": "/profile/Padmanabhan-Bharadwaj"
                },
                {
                    "user_id": "Vignesh Vicky",
                    "user_href": "/profile/Vignesh-Vicky-1049"
                },
                {
                    "user_id": "Amit Malani",
                    "user_href": "/profile/Amit-Malani-1"
                },
                {
                    "user_id": "Abhay Waghmare",
                    "user_href": "/profile/Abhay-Waghmare-1"
                },
                {
                    "user_id": "Aman Garg",
                    "user_href": "/profile/Aman-Garg-44"
                }
            ]
        },
        {
            "author_info": {
                "name": "Amit Pawar",
                "href": "/profile/Amit-Pawar-571"
            },
            "answer_text": "Prepare and plan for each content projectAcquire inputs for content projectsCreate content, especially different formatsManage, not just your finished content assets, but your source digital and component assets that comprise finished productsDeploy these assets to internal and external content creatorsTailor finished work products for persona and situational relevanceDeliver content through available channels, and which you think you need to supportTrack, measure, report and analyze content consumption and sharingManage your operations programFor some more marketing strategies, you can CHECK MY PROFILE ",
            "date": "Answered May 16, 2020",
            "views": "21",
            "upvotes": "0"
        }
    ]
}