{
    "title": "How to write about my mental illness in a college essay if it explains some of my bad grades - Quora",
    "tags": [
        "College Application Essays",
        "Essays",
        "Mental Illness",
        "Writing"
    ],
    "response": [
        {
            "author_info": {
                "name": "Patricia Young",
                "href": "/profile/Patricia-Young-52"
            },
            "answer_text": "To an appropriate prompt, you describe the struggles you have had in learning to work, concentrate and succeed despite the mental illness. You do not whine, complain or justify any actions and need to maintain your focus on your efforts to succeed throughout the essay. You cite specific incidences of how your coping mechanisms which have worked for you. You conclude with the details of your opinion of how this difficulty has made you a more positive, productive worker because you are willing to overcome this difficulty. You do not mention this is an excuse for having some poor grades. Admission officers are NOT stupid and they DO understand how hard some people have to work to succeed. Their essays are not arbitrary; they are instead designed to show that the prospective student has the abilities that particular college has determined are necessary to succeed in their school. (It’s the same reason your resume after school should highlight your abilities, not your successes.) You should not, therefore, develop one set of essays to send to all schools, any more than you should develop one resume for all employers. Think about what you have learned from the catalog, website and tour. Shape your essay to respond to what you think you have learned about that school. Don’t pick your school based on reputation, social standing or anything other than that you believe you can succeed at that form of education on offer. There are many ways to learn, so find the ones that work for you and apply to them. If you are not accepted, accept that your idea of what works for you does not coincide with what the college thinks and re-evaluate. There IS a school for everyone who WANTS TO WORK AT LEARNING. But, like all of life, you only get back what you put in. ",
            "date": "Answered May 15, 2018",
            "views": "270",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Nathan Chiu",
                "href": "/profile/Nathan-Chiu-2"
            },
            "answer_text": "You can write an essay about how mental illness affected your school performance and how you view the world. However, it’s crucial that maintain a positive note and use your experience with mental illness to highlight one of your strengths. Perhaps your strength lies in resilience, energy, or creativity. I’ve read compelling college essays on how dyslexia helped the college applicant simplify problems, but cutting down excess information. While mental illness is a serious and grave problem and provides a valid reason for poor grades, college admission officers care more about what you did to cope or overcome these struggles. For instance, if you have depression and started a mental wellness club at your school to help others and yourself, it would make for a stronger college essay than one in which you complain about how depression caused you to struggle in school. ",
            "date": "Answered May 15, 2018",
            "views": "884",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Tony Vilaysack",
                    "user_href": "/profile/Tony-Vilaysack-1"
                },
                {
                    "user_id": "Nirupama Vecham",
                    "user_href": "/profile/Nirupama-Vecham"
                },
                {
                    "user_id": "Sarah Yi",
                    "user_href": "/profile/Sarah-Yi-5"
                },
                {
                    "user_id": "Susan Bertolino",
                    "user_href": "/profile/Susan-Bertolino"
                }
            ]
        },
        {
            "author_info": {
                "name": "Carol Volker",
                "href": "/profile/Carol-Volker"
            },
            "answer_text": "Don’t. The purpose of the college essay is to convince the college that they want you. Even if you had some bad grades, they may still accept you if you come across as an interesting person who will do well at their school. If you come across as needy and ill, they won’t want the problem of dealing with you. If you need help once you get in, it will be available, but trying to justify bad grades and mentioning mental illness is a sure way to get rejected. Colleges have too many superior applicants to worry about those who focus on their problems in order to get in. Get some help if you need it now, but don’t use the essay to justify grades or discuss private health issues. ",
            "date": "Answered May 15, 2018",
            "views": "608",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Tony Vilaysack",
                    "user_href": "/profile/Tony-Vilaysack-1"
                }
            ]
        }
    ]
}