{
    "title": "How to write spies & espionage fiction into a fantasy novel - Quora",
    "tags": [
        "Fantasy (genre)",
        "Espionage and Spying",
        "Novels",
        "Writing"
    ],
    "response": [
        {
            "author_info": {
                "name": "Kamila Miller",
                "href": "/profile/Kamila-Miller-2"
            },
            "answer_text": "The question is: how do you write spies and espionage fiction into a fantasy novel? In the comment are more details: There’s a lot potential for spies in fantasy: using magic to deceive, infiltrate and gather information, much like James Bond; but also exploring the emotional cost, like in a James Le Carre novel. How would you write spies in fantasy? There’s a general answer and then there’s the way I personally do it, which appears to be part of the question. I’ll start with the general answer: If you’re going to write a fantasy with espionage, an important question to ask is why write it as a fantasy at all instead of the more usual World War, Cold War or modern settings? What is it about fantasy that attracts you? For some people it’s magic. For others, it’s the technological and/or social/cultural aesthetic. For yet others, it’s the lure of inventing deep, rich societies on a secondary world. Whatever it is about fantasy that makes you want to write it, you must think about how that aspect of world building will affect spy-craft. If, for example, you’re all about the magic, then how does magic affect spying? Can they scry? Are there defenses against scrying? What about disguises, language, B&E, assassination, travel, seduction, misinformation, identity confirmation, physical borders, event security, body-guarding, reading body language … how are all of these affected by your magic system? If you’re about the cultural/social aesthetic, be it pseudo-European semi-feudal sword-wielding heroes or snarky heroines that have beefs with vampires, you have to decide how espionage fits into that world and the types of espionage you want to depict. Will it still be international, or will it be more localized? Will there be support systems and networks, or is the hero on his or her own? What strategies will they employ that fits the aesthetic of your fantasy world? And of course if you’re in love with secondary worlds you’ll have to focus on politics politics politics, not just who borders on who and who hates who but resources, philosophies, what’s taboo, agreed-upon rules both domestically and internationally, near history (especially upheavals, plagues and wars), and so forth. For a world-builder this shouldn’t be a daunting idea, but part of the fun. You’ll have to remember things like the fact that spies that come from different countries probably won’t operate by the same rules and with the same codes of conduct. Of course your characters might not follow those rules or codes of conduct, but if they’re being paid by someone there will be expectations as to the quality of work and how that work is done, and that will affect the story. As for me personally: I tend to build the character and story a bit before I dive in and world-build. The world-building will be grounded in what kind of book I want to write and the kind of pov character(s) I want to represent whatever themes and conflicts I want to explore. And of course insights as I world-build then affect who the character is and what his or her capabilities are, which in turn shift the story… If you work like me, you might consider who your main character will be, what you want your primary internal and external conflicts to be about, and what you want your climactic moment for the book to look like. From there you can develop your fantasy world to support that. You have to be flexible, though. It may be that once you develop the world, it makes no sense, for example, for there to be a covert ‘spy academy’ and so your character’s origins may change, which may change the type of conflicts you initially envisioned. It pays to be flexible. Too many times I see writers get stuck on one image or a particular type of character that doesn’t integrate well with the story. In the end, the story has to be rock solid and the character has to have integrity. If that means jettisoning a favorite aspect of your vision, like having a tiny dragon sidekick, then let it go (and save that sidekick for another story.) I hope this helps! ",
            "date": "Answered October 19, 2017",
            "views": "913",
            "upvotes": " View 6 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Tiyana Marie White",
                    "user_href": "/profile/Tiyana-Marie-White"
                },
                {
                    "user_id": "Andris Ecsédi",
                    "user_href": "/profile/Andris-Ecsédi"
                },
                {
                    "user_id": "Susan Brown",
                    "user_href": "/profile/Susan-Brown-25"
                },
                {
                    "user_id": "Zhan Xin Fong",
                    "user_href": "/profile/Zhan-Xin-Fong"
                },
                {
                    "user_id": "Matthew Hsu",
                    "user_href": "/profile/Matthew-Hsu-8"
                },
                {
                    "user_id": "Devesh Ray",
                    "user_href": "/profile/Devesh-Ray-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Arpan Panicker",
                "href": "/profile/Arpan-Panicker"
            },
            "answer_text": "It has been done. A lot. And very well. All you need to do is pick up any long-running fantasy series. Because then the fantasy world becomes real. And in every new book, the author is introducing more characters and events. And eventually, in the adventure-rich world of fantasy, espionage becomes almost inevitable. The sequel I'm working on also features espionage. Let me try to define the factors that can help you incorporate espionage into your fantasy world: First, you need conflict. Either two political entities or groups at odds with each other.What is the purpose of espionage? Is it information gathering? Is it sabotage? Is it some kind of manipulation?You need a hierarchy within these entities. Like an army or leadership hierarchy. Or a political hierarchy. Or a process by which a chosen one is selected.You need to determine what level your spy is going to infiltrate at. Figure out the process it would take for your spy to get here. When does the deception start? How much background faking is required?Now, with all this information, design your spy profile. The perfect secret agent who meets all these parameters.If there are racial differences in appearance, it makes your job more complex. Disguises, glamours, potions and other fantasy elements can help you over this bump.What abilities does the spy need to continue the subterfuge? What situations will the spy encounter and have to get out of? What allies will the spy need? Is the spy going to be successful or will the spy be caught?You get the first. It's about replicating espionage as a genre within the rules of your fantasy world. But you need to think it through all the assumptions you would make in our world. If you do that, you'll have a kickass fantasy spy thriller! ",
            "date": "Answered January 6, 2017",
            "views": "451",
            "upvotes": "0"
        }
    ]
}