{
    "title": "How to write a professional position paper for the MUN (Model United Nations) - Quora",
    "tags": [
        "Model UN Position Papers",
        "Academic Writing",
        "Model United Nations",
        "Academic Research Papers",
        "Academic Papers",
        "Academic Research"
    ],
    "response": [
        {
            "author_info": {
                "name": "David Nguyễn",
                "href": "/profile/David-Nguyễn-11"
            },
            "answer_text": "I like to break down my position paper into three categories: Background to the issueHere, you should sum up the entire issue in no less than a paragraphInclude key dates, countries involved, political blocs involved, were there any ramifications? UN and international treaties?What your country’s stance to the issue ishere, elaborate on what your country has done to mitigate or exacerbate the issue. What have they done as countries involved?if your country is neutral or has had no direct involvement, you should side with your allies/political bloc.Your proposed solutionsUse your judgement; bring out the inner diplomat in you and think of solutionsCan you be a mediator? can you compromise? will you place sanctions? will you boycott diplomacy? will you go on the aggressive?→ IMPORTANT: Ensure that each category exceeds no more than a paragraph; 150–250 words   Here are some further pointers: Keep it simple. To communicate strongly and effectively, avoid flowery wording and stick to uncomplicated language and sentence structure.Make it official. Try to use the seal of your country and motto for your position paper. The more realistic it looks, the more others will want to read it.Get organised. Give each separate idea or proposal its own paragraph. Make sure each paragraph starts with a topic sentence.Cite your sources. Use footnotes or endnotes to show where you found your facts and statistics. If you are unfamiliar with the bibliographic form, look up the Modern Language Association (MLA) guidelines at your school's library.Read and reread. Leave time to edit your position paper. Ask yourself if the organization of the paper makes sense and double-check your spelling and grammar.Speech! Speech! Do you plan to make an opening statement at your conference? A good position paper makes a great introductory speech. During the debate, a good position paper will also help you to stick to your country's policies.Bullet pointing. Try not to let your proposals become lost in a sea of information. For speechmaking, create a bulleted list of your proposals along with your most important facts and statistics so that you will not lose time looking for them during the debate  Stay committed! Actively contribute and voice your opinions! Work hard! Eventually, the results will follow:  ",
            "date": "Answered February 12, 2020",
            "views": "336",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Parinitha Hemanth",
                    "user_href": "/profile/Parinitha-Hemanth-1"
                },
                {
                    "user_id": "Yogesh Parmar",
                    "user_href": "/profile/Yogesh-Parmar-221"
                },
                {
                    "user_id": "Farhani J",
                    "user_href": "/profile/Farhani-J"
                }
            ]
        },
        {
            "author_info": {
                "name": "Handayani Ayu",
                "href": "/profile/Handayani-Ayu"
            },
            "answer_text": "when writing a position paper, i usually divide it to 4 parts: (1) introduction to the issue. in this part you have to describe the issue generally and explain why this issue matters to your country. i recommend providing data to strengthen your argument. (2) country’s view of the issue and problems that emerged regarding the issue. here, you should state your country’s stance regarding the issue. explain how the issue affect your country, and the world. if there’s problem that emerged, explain that too. you can also provide a case study to further explain how the issue affect your country. (3) how country deals with the issue. after you explain the previous part, you need to tell what have your country done to tackle the issue. is it by government project? international cooperation? making a regulation? or participating in international agreement? is these actions has been successful to tackle the problem? if not, why? provide review on past actions and what can be learned from them. (4) country’s suggestion on possible resolutions for the issue. of course, the issue is not only affecting your country, so you need to list possible solutions that can be implemented to tackle the problem. you can read past UN resolutions or reports for inspirations. do not forget that these suggestions has to be in line with your country’s stance. if you want to learn more you can download the MUNPlanet eBook: \"Becoming a Model UN Delegate - An Essential Guide Through the MUN World\" here ",
            "date": "Answered July 29, 2018",
            "views": "461",
            "upvotes": "0"
        }
    ]
}