{
    "title": "How to write a good and comprehensive research paper - Quora",
    "tags": [
        "Research Paper Writing"
    ],
    "response": [
        {
            "author_info": {
                "name": "Paul Pantalones",
                "href": "/profile/Paul-Pantalones"
            },
            "answer_text": "Here's a shortish answer to a big question: Articulate an appropriate research question. For example, a predictive quantitative paper should ask something like \"To what extent does x covary with y?\" An exploratory quantitative can ask something like this too. Qualitative research papers should ask questions that are relatively descriptive.Ensure your research question drives your data and methods and not the other way around.Your introduction should introduce your research question, discuss why and how it matters and for whom, and highlight the key finding(s) as it(they) pertain to your hypotheses (for quantitative) or propositions (for qualitative).Your lit review should address past research and theory that addresses (a) your predictor/explanatory variable only, (b) your dependent variable only and, of course, (c) both a and b.Part c (see 4 above) of your lit review should identify what your study addresses empirically and thusly theoretically that prior study does not.Your hypotheses should be driven by your lit review, especially part c (see 5).Be sure in the methods section to discuss what results would confirm your hypotheses/propositions and what results would not. Also be sure to indicate any results that would support extant explanations that are contrary to your hypotheses.Don't just report the results, discuss them too, but do so in separate Results and Discussion sections.The conclusion must warn more than advocate. What doesn't your research address that it should have? What shortcomings are there in terms of internal validity, external validity, measurement validity, etc.? What should come next to alleviate these shortcomings? How if at all should your results inform decision making for practice, future research?Hope that helps. ",
            "date": "Answered June 9, 2018",
            "views": "31",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Ngilneii Ralte",
                    "user_href": "/profile/Ngilneii-Ralte"
                }
            ]
        },
        {
            "author_info": {
                "name": "Nebiye Petek Kurtböke",
                "href": "/profile/Nebiye-Petek-Kurtböke"
            },
            "answer_text": "Your question suggests your research has been finalized but you don’t know how to put it on paper. If that’s the case, and you didn’t take notes in the process of your research then your job will be very difficult unless your memory is good and you can remember what you did, why you did it and how you reached the conclusions you did. Reconstruction of the research process is no easy task and if you conducted your research on your own rather than with a research partner, you won’t be able to rely on what others remember. If you recorded the steps of your research then you’ll be able to work from your notes easily and any academic writing guide in your library is your best friend. ",
            "date": "Answered March 27, 2020",
            "views": "461",
            "upvotes": "0"
        }
    ]
}