{
    "title": "How to prevent academic dishonesty - Quora",
    "tags": [
        "Academic Dishonesty",
        "Dishonesty"
    ],
    "response": [
        {
            "author_info": {
                "name": "Kim Perry",
                "href": "/profile/Kim-Perry-18"
            },
            "answer_text": "I have found that having project due in stages helps. As you grade the submissions you can get a sense for the writing style and knowledge of the individual. Also, having in class assignments, and spontaneous writing requirements provides insight. I never have a project due in one swoop. I also help student select a highly individual topic. I do find that some students want to use a topic they have already worked on in other classes, sometimes this is laziness, sometimes is dishonesty, and sometimes it is the student’s passion. You have to be diligent in your contact with students to truly be able do detect dishonest. And… when all else fails you use Google and other plagiarism programs. A confrontation with the student when you discover plagiarism usually results in a much more honest submission. ",
            "date": "Answered January 3, 2017",
            "views": "154",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Hoyle Kieger",
                "href": "/profile/Hoyle-Kieger"
            },
            "answer_text": "Academic dishonesty is no different than any other form of deceit. You cannot control other people who decide to buck the rules. The only thing you can do is to be honest yourself, if that’s what you want. Even if no one else finds out, you live with your decisions, no one else. ",
            "date": "Answered December 30, 2016",
            "views": "70",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Florence Loh",
                    "user_href": "/profile/Florence-Loh-4"
                }
            ]
        }
    ]
}