{
    "title": "How to make a Wikipedia page for an entrepreneur - Quora",
    "tags": [
        "Wikipedia Pages",
        "Wikipedia Policies and Guidelines",
        "Wikipedia Editing",
        "Wikipedia Community",
        "Wikipedia",
        "Startup Founders and Entrepreneurs"
    ],
    "response": [
        {
            "author_info": {
                "name": "Martin Urbanec",
                "href": "/profile/Martin-Urbanec"
            },
            "answer_text": "First, let’s answer one important question: Are they notable? In another words, should they have own article? Notability is determined using number of independent reliable sources significantly covering the subject. In another words, if there are enough independent reliable sources you could use for citing all the information a good article should have, they’re probably notable. Secondly, you shouldn’t make a Wikipedia page about someone you know, or yourself. Following Wikipedia policies is quite hard normally (and we’re happy to help), but following Wikipedia policies when you know the person is exceptionally hard, and 99 % of articles created that way is immediatelly deleted. Once those two things are sorted, it’s possible to create a Wikipedia page. You should follow few key rules: neutral point of view and verifiability. Neutral point of view means the article should present facts, facts and nothing but the facts. It should refrain from any subjective claims. For instance, instead of saying “The singer is pretty”, you should say “The singer was Miss Europe in 1990”. Verifiability means all non-trivial statements needs to be supported by reliable sources. Reliable means mostly “having editorial review”, it can be newspapers, books etc. If you’re unsure about anything, you can ask at the Teahouse. ",
            "date": "Answered May 8, 2020",
            "views": "23",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Savita Kohli",
                    "user_href": "/profile/Savita-Kohli-11"
                },
                {
                    "user_id": "Staffan Vilcans",
                    "user_href": "/profile/Staffan-Vilcans"
                }
            ]
        }
    ]
}