{
    "title": "How are unusual thesis topics looked at? - Quora",
    "tags": [
        "Thesis Writing Help",
        "Thesis Topics",
        "PhD Thesis",
        "Theses and Dissertations",
        "Academia",
        "Graduate School Education",
        "Academic Research"
    ],
    "response": [
        {
            "author_info": {
                "name": "Andrew Rae",
                "href": "/profile/Andrew-Rae"
            },
            "answer_text": "An MPhil or a PhD is, by definition, an original contribution to knowledge in its field. So either you are asking a question no one has asked before, or you’re trying to produce a new answer to a question that people have already answered. There are three ways this can go. You can have a small increment on existing knowledge. This is “safe” in the sense that you won’t be saying anything controversial, or disagreeing with things that have already been said. It is “risky” in the sense that readers and examiners may question whether you’ve genuinely produced new knowledge.You can go way out there, and answer a question that is far removed from anything that has been studied before. This is “safe” in the sense that no one can say that your work isn’t original. It is “risky” in the sense that there may be good reasons why no one thought this was worth doing. Maybe your topic contains assumptions that contradict existing knowledge (e.g. you’re doing whatever is the equivalent in your field of proposing a perpetual motion machine).You can propose a topic that challenges accepted wisdom in your own field. This is “safe” in the sense that this is often how the best researchers carve a name and a career for themselves. This is “risky” in the sense that if you can’t convince your examiners that the challenge is at least plausible, you appear to be wrong, rather than controversial.All of these are acceptable paths, with risks and benefits. If your topic is just “quirky” - well, that’s how most PhDs appear to outsiders. ",
            "date": "Answered September 6, 2020",
            "views": "67",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Chloe Reid",
                "href": "/profile/Chloe-Reid-44"
            },
            "answer_text": "Thank you for this interesting question. I think unual thesis topics are rare nowadays. The vast majority of students choose topics that are easy to find information about. It is understandable. Personaly I am sure unusual topics are more enlightening, a person who cecks the work is engaged in reading. It is a way to express yourself, all your ideas. ",
            "date": "Answered September 12, 2020",
            "views": "38",
            "upvotes": "0"
        }
    ]
}