{
    "title": "How to do guest posting - Quora",
    "tags": [
        "Guest Blogging",
        "Blogs"
    ],
    "response": [
        {
            "author_info": {
                "name": "Neil Patel",
                "href": "/profile/Neil-Patel"
            },
            "answer_text": "To start guest posting, the steps are simple: Identify high-quality sites for guest-posting Many low-quality sites look for free content by offering to accept guest posts. Obviously, these are not the sites you want to guest-blog on. The number one aspect of a good target for a guest post is traffic. Without traffic, there’s really no benefit to posting. The second aspect is that a significant amount of that traffic must be made of your target audience. Otherwise, no one will care about your post, no matter how good it is. In general, there are two types of quality sites to target: Broad authority sites: These sites are often household names (think Forbes, The Huffington Post, or Business Insider). They have tons of traffic, and even if only a small percentage of that traffic is your target audience, it’s worth it. My regular posts on Forbes have generated a lot of business for me.Leading industry blogs: These blogs are much more niche-specific but are mostly made of your target audience. For me, that includes sites such as Search Engine Journal and Moz. But don’t post too frequently as most of these readers will already know you.Method 1: Broad search To find those general massive authority sites, you need to think in broad terms. For example, while I blog mostly on generating traffic and revenue through blogging, all these topics fall under the main niche of business. Simply searching Google for “business” will bring up the biggest business authority sites on the Internet:  Not all of these sites will be suitable targets for guest posts as not all of them will accept guest-posting. Others may require you to first be a leader in your field before writing for them. To demonstrate your authority, you’ll send them links to your other guest posts on industry leading blogs. So, while you should start by making this list of the big sites that you eventually want to contribute to on a regular basis, it’s typically best to pursue the more realistic niche blogs first to build up a bit of a reputation. Method 2: Search strings This is likely what you’re already doing. It’s a good method to start with. You simply search for “[your niche]” + “[a guest-posting search string]” to bring up topics. Here are some search strings you could use: “guest post”“contributing writer”“this is a guest post by”“contribute to our site”“guest posting guidelines”“suggest a post”“contributor guidelines”“guest posts wanted”“writers wanted”“write for us”Tactic # 1: Follow guidelines to the letter Major blogs get dozens, or even hundreds, of requests to guest-post every day. To encourage good submissions, they often post guest-posting guidelines. If you don’t follow these exactly, your email will be automatically trashed in most cases.  To find out what the submission guidelines of a particular blog are, search for “[your target blog] + [guest post guidelines]” to see if they have any:  Those guidelines will usually tell you: what the site expects in a posthow to pitch a postwhat you’re allowed/not allowed to put in your post (e.g., links)what you get out of the postStudy them, take notes, and then make sure to follow them for all the rest of the steps in this guide. Tactic #2: If no guidelines are published, email the site Not all sites publish guest-posting guidelines, especially if it’s a personal blog. They rarely accept guest posts and don’t want to encourage others to submit pitches. This is where it gets a bit tricky. These bloggers typically have the mindset that no one else cares about their readers as much as they do (and they are usually right). This is why they only accept guest posts from very big names or friends. If you contact them with a typical guest-post pitch, it’ll likely get shot down unless you already have a reputable blog. Instead, if you’re relatively unknown, you’ll need to build a bit of a relationship. First, you’ll need their email address (contact forms are the last resort). I recommend signing up for their email list. Look for a signup box in the sidebar or at the top of a page (usually on the home page).  You will then get emails from that blogger, which you can reply to. Here are the emails you will need to send: Email #1: Get personal The first time you email an influential blogger, try to stand out as much as possible. The simplest way to achieve that is to tell them how much you liked one of their recent posts (and mean it). Tell them that you took advice from that post and actually applied it. Almost every blogger loves when someone actually uses their advice. You’ll likely get a response thanking you for the kind words and asking for more specifics about the results of implementing the advice. Email #2: When you get the results, share them Yes, this means that you actually have to do some work first! But if you want to land spots on exclusive blogs, this is how you go about it. At that point, the blogger might offer to write up a case study on you if you had good results. Or you can pitch a case study yourself. Email #3: Wait a while, and ask if you can guest-post Sometimes a case study won’t be appropriate. But the good news is that the blogger knows that you not only read their blog but that you also take action. So a week or two later, you can send an email that looks something like this: Hey [Blogger], The [outcome from taking advice] is still producing great results. I seriously appreciate all the hard work you do to create useful, actionable advice about [topic]. I know it’s difficult to produce top-notch quality consistently, so I was wondering if you’d like a hand with it. I’ve already brainstormed a few ideas that I think would really resonate with your readers: [Idea 1][Idea 2]I’ve written a lot in this niche. Here are some examples of my articles that capture the quality of my writing: [link to a guest post or your own blog article #1][link to a guest post or your own blog article #2]I know you don’t accept guest posts often, but I’d be honored if I could contribute to [site name]. If not, no worries—I won’t stop reading your posts :p. Best Regards, [your name] No, you won’t be successful at getting your guest-blogging opportunity 100% of the time, but you’ll get a fair number of responses. Of course, this takes a lot of work and planning upfront, but that’s why it works. Produce epic content for your guest post You sent out a few pitches, and one of the sites you approached told you to go ahead and write your post—success! Now you need to deliver. Remember I told you that the definition of “epic” is important? The reason why it’s important is because it changes based on the site you’re pitching to. An epic post for a particular site is one that is clearly better than 95% of other posts on that site. In other words, epic is relative. And that’s how you start guest posting. Keep at it, and the results will come. ",
            "date": "Answered February 18, 2017",
            "views": "53",
            "upvotes": " View 41 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Vishnu Prasad",
                    "user_href": "/profile/Vishnu-Prasad-57"
                },
                {
                    "user_id": "Francis Ashis Sarkar",
                    "user_href": "/profile/Francis-Ashis-Sarkar"
                },
                {
                    "user_id": "A. Zambrano",
                    "user_href": "/profile/A-Zambrano-1"
                },
                {
                    "user_id": "Caroline Forbes",
                    "user_href": "/profile/Caroline-Forbes-61"
                },
                {
                    "user_id": "Shubham Dixit",
                    "user_href": "/profile/Shubham-Dixit-319"
                },
                {
                    "user_id": "Muhammad Nur Hidayat",
                    "user_href": "/profile/Muhammad-Nur-Hidayat-7"
                },
                {
                    "user_id": "Debasis Nayak",
                    "user_href": "/profile/Debasis-Nayak-46"
                },
                {
                    "user_id": "Jawhar Ben Fredj",
                    "user_href": "/profile/Jawhar-Ben-Fredj-1"
                },
                {
                    "user_id": "Ritesh",
                    "user_href": "/profile/Ritesh-293"
                },
                {
                    "user_id": "Shaili Sadhwani",
                    "user_href": "/profile/Shaili-Sadhwani"
                }
            ]
        },
        {
            "author_info": {
                "name": "Anastasia Zdorikova",
                "href": "/profile/Anastasia-Zdorikova-1"
            },
            "answer_text": "Guest posting is an extremely effective and interesting marketing technique to learn and practice. Though guest blogging may seem pretty straightforward, it still has some peculiarities you should know to succeed. Here’s a checklist you should use to run a successful guest posting campaign: Define the goals you want to achieve.Find proper websites to post on.Outreach to blog owners.Create superior content.Promote your post and engage with readers.Track your results.Build long-term relationship with bloggers.First of all, define your goals and decide whether guest blogging can help you to achieve them or not. If you want to increase brand awareness of your business, position yourself as an expert, drive traffic, increase sales, build high-quality backlinks, guest posting is what you need. Then you need to find websites you will post on. Search for Lists of Blogs in Your Niche This is probably the easiest way to find the most popular blogs in your niche. Just search 'top <your niche> blogs' and check the result.  Find Active Bloggers in Your Niche and Check Their Previous Contributions Using this method you can find guest posting opportunities by checking where authors in your niche have already contributed. Pick certain influencer and start investigating. Let's take Larry Kim as an example of an expert and blogger in the digital marketing niche. Skimming through his twitter account you can find some of his previous guest posts.  Examine Your Competitor's Backlinks If you are serious about your business, you should have already analyzed your competitors including their backlinks. They are probably also doing guest blogging, that's why you can find lots of great sources analyzing their backlink profile. It may take some time to find what you need as not all backlinks are coming from guest posts, but using this technique you may find some real gold which was not publicly announced. Advanced Google Search Who else if not Google can provide you with the most accurate info. But it's not enough to use basic search in order to find niche websites that accept guest posts. For this purpose, you have to use specific search queries so-called guest posting footprints. Here's a list of the most common ones: 'write for us' OR 'write for me' 'Become a contributor' 'submit a guest post' 'guest post by' 'guest article' Add your keywords to each of them and you'll be able to find blogs relevant to your niche. Example: 'write for us' OR 'write for me' digital marketing In order to make some of them more precise, use search operators 'inurl:' and 'intitle:' that will show the results containing your keywords in their URL and the Title tag respectively. Example: intitle:'write for us' your keyword inurl:'guest post guidelines' your keyword You can find lots of other footprints yourself just skimming through various blogs. However, doing a manual search using each of these footprints and checking each site will take plenty of your time. This is when tools like Netpeak Checker will come in handy. You can easily scrape all search results upon these queries, evaluate and sort them by various metrics.  Be precise while choosing a blog to post on Here is a quick checklist you can use: Make a quick traffic analysis. Use SimilarWeb free browser extension to get estimated visits, main traffic sources, and geo.Analyze the overall theme of a blog. First and foremost, you should check what topics are covered on the blog, in order to understand whether they correlate with your site.Make sure it's not dead. Sometimes blogs may be abandoned but still drive traffic. Check the date of the latest publication to see if the blog is alive.Have a look at the comment section and social shares, check if readers engage with this blog. Don't neglect social media pages, check the number of followers, likes, and comments.Check the main SEO aspects. Make sure there are no shady links from the homepage/footer/header to other sites and articles do not contain obvious spam. Avoid blogs that are stuffed with ads and pop-ups. Check the blog for sneaky redirects. Then examine the backlink profile, it should not consist of spammy backlinks and anchors.Examine the guest post requirements.Sort out blogs that don't match your criteria and add all relevant ones to the list for further outreach. How to Do Guest Blogging Outreach Blogs that allow guest posting get hundreds of emails from people like you. Their inbox is stuffed with letters screaming 'I want to post my shitty content to get a link from you'. If you want your pitch to be read and not sent to the spam folder, you have to stand out from the crowd. Here are some tips to write a quality pitch. Appear on Blogger's Radar Join blog's groups in social media, like a couple of posts/photos, leave relevant comments. A few don'ts: don't like everything you can (it's just weird), don't spam comments, don't be a toady (all your compliments should be real, avoid 'I love your blog so much' stuff). Personalization Is a Must This is not only about adding blogger's name to your greeting (which is obviously mandatory). Personalize your letters as much as you can. Prove Your Authority Include your credentials, a couple of high-authority websites you contributed to or just have your company mentioned. Don't overpraise yourself, 1-2 short sentences will be enough. Focus on Blogger's Benefit Make sure you've included all the advantages which come along with your post: you will promote it in your socials, newsletter, or provide with a free trial to your tool or service. General Tips for Quality Email Here is a checklist for making a killer letter: Use a corporate email address (e.g. yourname@yourcompany.com).Address bloggers by their first name.Structure your letter (it shouldn't be a single paragraph).Don't use long and complex sentences.Tell about yourself.Personalize your letter (add relevant references)Don't be formal, be open and friendly.Check your grammar.Don't use more than one hyperlink per letter (in order to avoid landing into the spam folder).Focus on blogger's benefit.Create a good looking signature (add other ways to contact with you).Add a call-to-action at the end asking for a response.Send a follow-up.Example:  All you have to do next is to create top-notch content which will catch the interest of blogger’s audience and make them check your site or even convert into your customers. Learn about guest blogging in all details in the article on our blog — Comprehensive Guide on Guest Blogging (with Actionable Outreach Tips) Hope it helps! ",
            "date": "Answered March 11, 2019",
            "views": "440",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Nurul Hazmi",
                    "user_href": "/profile/Nurul-Hazmi"
                },
                {
                    "user_id": "Deepankan Joshi",
                    "user_href": "/profile/Deepankan-Joshi"
                },
                {
                    "user_id": "Lipsa Pattanayak",
                    "user_href": "/profile/Lipsa-Pattanayak-7"
                },
                {
                    "user_id": "Kamila Węcka",
                    "user_href": "/profile/Kamila-Węcka"
                }
            ]
        }
    ]
}