{
    "title": "How does one write a cohesive argumentative essay? - Quora",
    "tags": [
        "Argumentative Essays",
        "Essay Writing Help",
        "Essays",
        "Arguments and Argumentation",
        "Writing Advice",
        "Writing"
    ],
    "response": [
        {
            "author_info": {
                "name": "Jordan Forth",
                "href": "/profile/Jordan-Forth-4"
            },
            "answer_text": "The best tips I can give you are: Make an outline. An argumentative essay is when you really need one, because you have to stay organized. Everything needs to have a logical flow to it. Don’t use jargon or overly big words. Make sure your argument is easy to understand. You can’t convince your reader if you lose them in a bunch of big words or technical terminology. Acknowledge the other side. Make sure you mention the opposing viewpoint. Acknowledge it exists, and even be wiling to concede a few points to the other side. then point out why your side is better. This helps establish your credibility and shows that you’ve weighed other options before arguing your own position. This is one of the most important parts of your paper, and this typically works well in your conclusion. Acknowledge any holes in your own argument. Ideally you will have a cohesive essay without holes, but sometimes things arise that you can’t get around. Be willing to talk about the holes in your argument and defend them. Suggestion solutions that make your side more appealing. ",
            "date": "Answered April 29, 2017",
            "views": "289",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Frank Elliott",
                "href": "/profile/Frank-Elliott-5"
            },
            "answer_text": "Cohesion results from maintaining orderly treatment of the subject matter. Actually the single most effective thing is to formulate a strong, clear thesis statement and then to systematically prove it in your essay. To ensure that your essay “stays on track,” my advice is to do careful outlinIng and to be sure that your sssay conforms with it. Also be sure that your logic (reasoning) is compelling and well-supported. It's okay to depart from the outline briefly to make a point, but the cohesion will be facilitated by conformance with the structure of your outline. ",
            "date": "Answered April 29, 2017",
            "views": "169",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Noureddine Elkhoubza",
                    "user_href": "/profile/Noureddine-Elkhoubza"
                }
            ]
        }
    ]
}