{
    "title": "How to wrote an a 5 page paper in a day - Quora",
    "tags": [
        "Academic Papers",
        "Writers and Authors"
    ],
    "response": [
        {
            "author_info": {
                "name": "Nick Kasparie",
                "href": "/profile/Nick-Kasparie"
            },
            "answer_text": "If it's it an opinion paper...just BS the heck out of it. 5 pages double-spaced isn't bad at all. If it's a research paper where you need to cite information, that's a completely different beast...but all the same, easy to tame.  Start with an outline: introduction  Sub headings for body Conclusion  Next, find sources on google scholar or jstor that have applicable information.  Create a \"notes\" word document and a \"draft\" word document. Copy and paste any relevant information under the correct heading in your notes document with a proper citation beneath the information from either Citation Machine: Format & Generate Citations or BibMe: Free Bibliography & Citation Maker in the appropriate APA or MLA format. Or, you can get the citation straight from google scholar on the search page. On the \"Notes\" document you made, write the information in your own words with your own interpretation for the paper underneath the information you copied there. It's quicker than going back and forth between browser and document plus you don't have to wade through unnecessary information. When finished writing, add the appropriate citation in your writing where necessary and copy it into your \"draft\" document. Rinse and repeat.  ",
            "date": "Answered April 24, 2016",
            "views": "28",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Erin Milligan",
                    "user_href": "/profile/Erin-Milligan-7"
                },
                {
                    "user_id": "Tatiana Navarrete",
                    "user_href": "/profile/Tatiana-Navarrete"
                }
            ]
        },
        {
            "author_info": {
                "name": "Jake Stahl",
                "href": "/profile/Jake-Stahl-1"
            },
            "answer_text": "Go into a peaceful, quite place and take 10 minutes to meditate on the topic. Then, just start writing. Eventually, if you become passionate enough about the paper, you're going to get lost in the writing and just spill out all of your thoughts and feelings into the words you're saying. Build off of each different topic leading the paragraph, and maybe even start a second paragraph talking about a subtopic involved with the paragraph before.  Sorry if you're confused by my wording. I got kind of into the answer.  ",
            "date": "Answered April 24, 2016",
            "views": "23",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Nicole Entenza",
                    "user_href": "/profile/Nicole-Entenza"
                },
                {
                    "user_id": "Nikolai Gogol",
                    "user_href": "/profile/Nikolai-Gogol-3"
                },
                {
                    "user_id": "Damon Porter",
                    "user_href": "/profile/Damon-Porter-1"
                }
            ]
        }
    ]
}