{
    "title": "How to write a character analysis essay - Quora",
    "tags": [
        "Essay Writing Help",
        "Essays",
        "Writing Advice",
        "How-to Question"
    ],
    "response": [
        {
            "author_info": {
                "name": "Jessica Larson",
                "href": "/profile/Jessica-Larson-18"
            },
            "answer_text": "Pay attention to the character’s ethics. Does the character make just or unjust choices? Decide whether the character’s actions are wise or unwise. What is the character’s motivation? As you are mulling over the pros and cons of each character’s internal thoughts and external actions, you will want to also consider why the character is acting or thinking in a particular way. Has the author given you any clues about the character’s past? Consider the effects of the character’s behavior on other characters. Look for repeatedly used words that describe the character. Those words often give insight into a character’s psychology and motivations. Be aware of items associated with the character. They may say something about his or her state of mind. Read between the lines. Often what a character does not say is as important as what he or she does say. Is the character “flat” or “round”? A character is considered flat (or static) when he or she does not experience a change of any kind, does not grow from beginning to end. Consider the historical time period of the character. Refrain from making modern judgments about the past; put the character’s actions and thoughts in context. And Finally, what does the author think? Look for any of the author’s own judgments about the characters he or she has created. The author may be directing you toward an intended interpretation. Don’t forget to proofread your assignment. I would recommend you to ask Supreme essay guys to help you. They do a good job. ",
            "date": "Answered October 19, 2016",
            "views": "449",
            "upvotes": " Answer requested by Hanis Ibr and Nurul Hanis",
            "upvoters": [
                {
                    "user_id": "Sifat Sadia",
                    "user_href": "/profile/Sifat-Sadia"
                },
                {
                    "user_id": "Hamish Writer",
                    "user_href": "/profile/Hamish-Writer"
                }
            ]
        },
        {
            "author_info": {
                "name": "Selimira Jhons",
                "href": "/profile/Selimira-Jhons"
            },
            "answer_text": "Writing a character analysis is not an easy task for the student or some of the students. in my career, I come across many students who have shared their problems in writing a character analysis essay and I conclude that most of the students don't know the real meaning of character analysis. How To Write A Character Analysis Before moving further I would like to explain what is character analysis is so that students can get the real motive and meaning that will help them to make there point and vision clear while writing character analysis. Most writers did not mention the trades of characters in their book directly. That is leaves upon the reader to catching triads as the storyline progresses. Character analysis is an art of noticing the tiny details and lines that seems insignificant and not only this but also find the hint that the author used to develop their character. Now come that most important question “How To Do Character Analysis” How To Do Character Analysis Analyzing a character is interesting and fun. It need some skills that student some time have and sometimes they need to develop. Students have to investigate the theory and must have a desire to understand the personality of a person who isn’t really a person in the story to write the perfect character analysis. Here are some points a student must keep in mind while writing there character analysis Motivation Action plan What do they say in the story Description Name of characters Students must focus on these points that will help them in writing their character analysis. There are different types of characters that discussed below Protagonist Antagonist Major Character Minor Character Dynamic Character Static Character Stereotypes Character These are different types of characters that have there own significance and characteristics. When you start analyzing them you may find that one character is fit into another or even more character categories. while writing the answer I come across a very informative video on writing a character analysis essay that helps you a lot  ",
            "date": "Answered April 25, 2020",
            "views": "212",
            "upvotes": " View 2 Upvoters"
        }
    ]
}