{
    "title": "How to become more committed to my goals? How do you know if you aren't - Quora",
    "tags": [
        "Setting Goals",
        "Self-Awareness",
        "Personal Goals",
        "Self-Improvement"
    ],
    "response": [
        {
            "author_info": {
                "name": "Lukas Schwekendiek",
                "href": "/profile/Lukas-Schwekendiek"
            },
            "answer_text": " You know you are not committed as soon as you find yourself finding an excuse rather than a way. Every time you excuse yourself from working towards your goals you give in a little bit more to failure, but every time you find a way and a reason you’re on your way to success. That being said, there are a couple of fantastic ways to finding a way rather than an excuse: Focus on what you can do - There are thousands upon thousands of things you cannot do. Focus on the things that you could and can do and train your mind to keep a watchful eye on those things.Become aware of your greatest power - The greatest power you possess is the power of choice. You can run to your excuses and still chose to do the right thing anyway; whether you like it or not, feel up to it or not, you always have the power to chose a better path.Find out why you want this - Why do you want to become committed? Once you answer, ask the same question again: Why that? And then ask it again and again and again until you go so deep that you find an emotion. That emotion is going to be the thing driving you.Leave yourself no second option - Getting your goals and making them become a reality is the only choice. Period. Failure is not on the menu. No other choice, no other way, just succeeding. This will be harder than it looks… believe me.REMIND YOURSELF - Often we forget why we want to do it or why we committed to this and we stop it all. We forget, give up and only look back years later with mountains of regret. Remind yourself of your cause and that desire to succeed as often as possible (twice daily at least).Do what you said you would - Build trust with yourself and do what you said you would do. This trains you in becoming better at actually following through with your commitments and you will seem and feel more committed with each passing day.Just do it - Stop with the excuses… They are not going to get you anywhere. We all know you would rather game, watch TV or relax, but you are only deluding yourself if you think you can make it with that. Please… stop… and just do it. Not for me. Not for anyone else. Do it for you! Stop being less than you can be and reach your goals. Send me a message saying \"Coaching\" to work 1 to 1 with me. Lukas Schwekendiek ",
            "date": "Answered April 28, 2017",
            "views": "16",
            "upvotes": " View 18 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Mani Kiran",
                    "user_href": "/profile/Mani-Kiran-9"
                },
                {
                    "user_id": "P. Vibhav Kamath",
                    "user_href": "/profile/P-Vibhav-Kamath"
                },
                {
                    "user_id": "Bibux Gb",
                    "user_href": "/profile/Bibux-Gb"
                },
                {
                    "user_id": "Hafeeza Shaik",
                    "user_href": "/profile/Hafeeza-Shaik-1"
                },
                {
                    "user_id": "Leta Rosetree",
                    "user_href": "/profile/Leta-Rosetree-1"
                },
                {
                    "user_id": "John Walton",
                    "user_href": "/profile/John-Walton-1"
                },
                {
                    "user_id": "Mukesh Ravi",
                    "user_href": "/profile/Mukesh-Ravi-3"
                },
                {
                    "user_id": "Pranav KS",
                    "user_href": "/profile/Pranav-KS-2"
                },
                {
                    "user_id": "someone",
                    "user_href": "/profile/someone-942"
                },
                {
                    "user_id": "Kuvendra",
                    "user_href": "/profile/Kuvendra-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Dan Robb",
                "href": "/profile/Dan-Robb-2"
            },
            "answer_text": "Since I was a2a, you have probably asked the wrong person, since my opinion of acting is pretty low. There just seems to be an element of narcissism and attention-seeking that I can’t identify with (being a confirmed introvert). I suppose there is some social value in entertaining, and I probably consume as much as anyone. I enjoy attending live plays and musicals, and the TV is always on in the background. However, it seems that the number of people who excel and make a good living at it are few and far between (although I have no statistics to back that up). It seems the best advice is to pursue one’s passion; whatever the underlying mental disposition (assuming it does not amount to a mental disorder), while maintaining a pragmatic approach (e.g., being able to afford to live). I see that one of your other questions has to do with obtaining a college degree in acting. I’ve never heard such an academic pursuit that was not under the umbrella of Fine Arts (but again, I’m not well informed in this area). In the US, such a program that is not Regionally Accredited would be highly suspect (U.S. Regional Accreditation: An Overview). There are subconscious perceptions within the human psyche that warn us of danger with no conscious knowledge of rhyme or reason [see: “Incognito: The Secret Lives of the Brain,” (2011) by Dr. David Eagleman, who directed the Laboratory for Perception and Action and the Initiative on Neuroscience and Law, Baylor College of Medicine, is a Guggenheim fellow, and heads the Eagleman Laboratory for Perception and Action at Stanford Univ.]. Perhaps your subconscious perceptions interacting with cognitive processes are warning you of the potential for failure if acting becomes the goal. Beyond that, only the individual can decide what is worthy of commitment. https://www.quora.com/How-do-you-know-if-youve-discovered-your-passion/answer/Dan-Robb-2 http://www.quora.com/How-can-I-make-sure-Im-financially-secure-in-my-future/answer/Dan-Robb-2 ",
            "date": "Answered May 13, 2017",
            "views": "210",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Madeen Ahmed",
                    "user_href": "/profile/Madeen-Ahmed-1"
                }
            ]
        }
    ]
}