{
    "title": "How to cite a PDF in APA with no author - Quora",
    "tags": [
        "Citing Sources",
        "Academic Citation",
        "APA Style",
        "Citations",
        "Academic Journals",
        "PDF (file format)",
        "eBooks",
        "Academic Papers",
        "Academic Research"
    ],
    "response": [
        {
            "author_info": {
                "name": "Chuck Matthews",
                "href": "/profile/Chuck-Matthews"
            },
            "answer_text": "This question should be addressed in your APA Manual. However, I do have sympathy; some formats are difficult to find. Remember that your goal is to help your readers find the source when they need to. The easiest way to do that is through a search for the author. Obviously, that’s not always possible. So, we can’t cite the author. However, it’s important to also know the source of the article, even if it’s a PDF file. Look for the title of a periodical or journal. That will be important, too. If you can, use EBSCO or ProQuest to search for the article as well. Given the information, the format would be as follows. “Title of Article” (Date). Periodical or Journal, Edition. Publisher. Retrieved from [web address]. Example: “A testament to avocados” (2017). Avocado Afficionado, Spring 2017. Monterrey Press, Monterrey, CA. Retrieved from .http://avocado.com/2017/Spring/11311 (Do not follow this link. I obviously made it up.) The citation format would be something like: (“Title of Article,” date) And please note: Go back and check your APA Manual. You will thank yourself. ",
            "date": "Answered September 15, 2020",
            "views": "1",
            "upvotes": " View 4 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Nabeel Siddique",
                    "user_href": "/profile/Nabeel-Siddique-16"
                },
                {
                    "user_id": "Henry Brice",
                    "user_href": "/profile/Henry-Brice"
                },
                {
                    "user_id": "Ramona Fernandez",
                    "user_href": "/profile/Ramona-Fernandez-1"
                },
                {
                    "user_id": "Evelyn Elwell Uyemura",
                    "user_href": "/profile/Evelyn-Elwell-Uyemura"
                }
            ]
        },
        {
            "author_info": {
                "name": "Laurence Cuffe",
                "href": "/profile/Laurence-Cuffe"
            },
            "answer_text": "Where did you get it? That’s the fundamental question a reference is trying to answer. You may have to cite a corporate author, you may have to give a website. How do I cite a source with no author in APA? Give a date if you can find it in the document, otherwise you use the abreviation nd. In-Text Citations: Author/Authors // Purdue Writing Lab You may even have to fall back on “Source unknown”. Always make clear if there is an external source for something, that that is the case. Some-one I knew was writing a masters thesis on a subject of some commercial importance. They were given an internal document from a rival company. They used some of this material without attribution, and ran into trouble when their external examiner turned out to be the author of the document in question. ",
            "date": "Answered July 21, 2020",
            "views": "900",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Evelyn Elwell Uyemura",
                    "user_href": "/profile/Evelyn-Elwell-Uyemura"
                }
            ]
        }
    ]
}