{
    "title": "How to change my passive voice to an active voice - Quora",
    "tags": [
        "Active Voice",
        "Passive Voice",
        "Words",
        "How-to Question"
    ],
    "response": [
        {
            "author_info": {
                "name": "Alex Jones",
                "href": "/profile/Alex-Jones-180"
            },
            "answer_text": "You change passive voice to active voice by making the object of the sentence the subject. In order to do this, it is helpful to understand what subjects, verbs, and objects are. Let's use an example sentence. I was bitten by the dog. In this sentence, the dog actually is the one doing the main action (biting). So bring dog to the front of the sentence and make that the subject. So now you have The dog. . . Now we need to change the verb. Passive sentences will contain the participal version of the verb (bitten) so we need to change that. We look at the original verb was bitten and we can tell it happened in the past (mostly because of the word was). So now in our new active sentence we change had bitten to the simple past version, bit. Now the sentence is The dog bit. . . Who did the dog bite? In the original sentence it is I. I is a subjective pronoun, meaning we use it as a subject. In the new sentence is is actually going to be the object, so we need to change it to the objective pronoun me. Now we have The dog bit me. Voila. Sentence has been changed from passive to active voice. How did we do it? Move the “doer” of the action to the front of the sentence to become the subject (dog).Change the verb to the simple version, simple past or present, ect. Had bitten —-> bit.Move the subject of the original sentence to the end of the sentence to become the object. If it's a prnoun be sure to change it to objective case. I-->me.Sometimes in a longer passive sentence, people don't know which word to bring to the front to become the new subject for the active sentence. One helpful hint: it often follows the word “by” like in our example sentence “by the dog.” So look for the word “by” if you are stuck, then the first noun after that. It's not always quite that simple, but it usually is if you understand the pattern. Just remember the active sentence will be in the subject, verb, object pattern. ",
            "date": "Answered February 14, 2017",
            "views": "39",
            "upvotes": " View 8 Upvoters",
            "upvoters": [
                {
                    "user_id": "Evie Black",
                    "user_href": "/profile/Evie-Black-5"
                },
                {
                    "user_id": "Boateng Edmund",
                    "user_href": "/profile/Boateng-Edmund"
                },
                {
                    "user_id": "Jameela Abbas",
                    "user_href": "/profile/Jameela-Abbas"
                },
                {
                    "user_id": "Kunal Vichare",
                    "user_href": "/profile/Kunal-Vichare"
                },
                {
                    "user_id": "Clifford Young",
                    "user_href": "/profile/Clifford-Young-17"
                },
                {
                    "user_id": "G V Sudhakar",
                    "user_href": "/profile/G-V-Sudhakar-1"
                },
                {
                    "user_id": "Joan Song",
                    "user_href": "/profile/Joan-Song-2"
                },
                {
                    "user_id": "Shycart India",
                    "user_href": "/profile/Shycart-India"
                }
            ]
        },
        {
            "author_info": {
                "name": "Justin Philip Turner",
                "href": "/profile/Justin-Philip-Turner"
            },
            "answer_text": "Here's a sentence in the passive voice: The class was taken by the students.Notice how the subject of the sentence, the class, isn't actually \"doing\" the verb. That would be the students -- they're the ones taking the class. Here's a sentence in the active voice: The students had taken the class.In this case, the students are the subject of the sentence, and they're \"doing\" the verb. To change from passive voice to active voice, you have to make sure whatever noun (person, place, thing, or idea) is \"doing\" the verb is also the subject of the sentence.  Some more examples: Harry was given a black eye. (passive) Someone gave Harry a black eye. (active)  I had been driven to the zoo. (passive) My dad drove me to the zoo. (active)  I was called pretty by my friend. (passive) My friend called me pretty. (active) ",
            "date": "Answered March 1, 2016",
            "views": "659",
            "upvotes": "0"
        }
    ]
}