{
    "title": "How to write a real estate development business plan - Quora",
    "tags": [
        "Due Diligence",
        "Real Estate Development",
        "How-to Question",
        "Real Estate",
        "Business"
    ],
    "response": [
        {
            "author_info": {
                "name": "Bruno Russo",
                "href": "/profile/Bruno-Russo-2"
            },
            "answer_text": "The lenders are asking you to explain and tell them what you intend to develope, what is it about, what will it cost, what equity you will have in it, how much finance you will need, how you will market it and what will be the sucessful out come, basically what is the profit projection. The Development - work out what you can build on your site. You will need an architect/surveyor and design people to develop a concept plan this will help the builder give you a quote on contruction costs.Financial Analysis - this is your income and expenses for the development and how long it will take to build and sell off. You need to work out land and purchase costs/lending and interest costs/ development costs including all the professional as the architect and subdivision costs. Don’t forget your agents selling fees and marketing costs.Market Analysis - This is your market research on the finished product to justify the end sale of what you are developing.Builders Schedule and Budgeted- who is the builder and what will their building agreement be and what is their cost, is it a fixed sum or cost plus.Summary - Write a summary of the project detailing the above and how you are going to project manage this who your contractors are, how long you think the development is going to run for and what the marketing plan will be to sell the end product. Make sure you take about how ypu will manage cost with a budget to actual monthly report.They may ask for more but this should help. ",
            "date": "Updated June 18, 2016",
            "views": "32",
            "upvotes": " View 5 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Mark N Glyptis",
                    "user_href": "/profile/Mark-N-Glyptis"
                },
                {
                    "user_id": "Amaya Endrew",
                    "user_href": "/profile/Amaya-Endrew-1"
                },
                {
                    "user_id": "Tejaswi Sudhindra",
                    "user_href": "/profile/Tejaswi-Sudhindra"
                },
                {
                    "user_id": "Jack Cummings",
                    "user_href": "/profile/Jack-Cummings-10"
                },
                {
                    "user_id": "Liam McNovea",
                    "user_href": "/profile/Liam-McNovea"
                }
            ]
        },
        {
            "author_info": {
                "name": "Michael Hass",
                "href": "/profile/Michael-Hass"
            },
            "answer_text": "Development is turning raw materials (land, building materials, infrastructure) into what amounts to a new business (an apartment complex or an office building or a retail center are all businesses in the form of a building). So you need to explain to the bank how the inputs to the process can be “paid for” by the business you create. That's a pro forma. The rest of the package will be explaining why the assumptions in the pro forma are correct. How do you know what the building will cost? How do your rents compare to market competition? How many tenants/sales are committed now? What insurance is needed? How much entitlement work is required and how long will that take? Who will operate this business and what are the costs of their services? What professional consultants are on your team and what is their history? You need to prove to the lenders that you've considered this proposition thoroughly and believe in the very high likelihood that this new business will be able to repay the loan. Worry less about the template and form and more about telling an easy to follow story about this new business. Generally more information is better in this case. ",
            "date": "Answered June 16, 2016",
            "views": "19",
            "upvotes": " View 2 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Jack Cummings",
                    "user_href": "/profile/Jack-Cummings-10"
                },
                {
                    "user_id": "Matthew James",
                    "user_href": "/profile/Matthew-James-101"
                }
            ]
        }
    ]
}