{
    "title": "How to write a good email signature - Quora",
    "tags": [
        "Email Signature Design on Fiverr",
        "Signatures"
    ],
    "response": [
        {
            "author_info": {
                "name": "Aleksey Danchenko",
                "href": "/profile/Aleksey-Danchenko"
            },
            "answer_text": "Email signatures are used by both private individuals and companies, regardless of their industry. The signatures’ appearance and content also differ. In general, email signatures can be divided into the following categories: Professional email signatures. Professionals and experts in various business areas end their emails with a signature that contains their name, position, and contact data, and also add their profile picture of themselves. This is the most widespread type of email signatures. Corporate email signatures. Such signatures are usually used in emails sent by online stores, real estate agencies, law firms, educational centers, etc. — in other words, in cases when all communication is conducted on behalf of a team, not a single person. Creative email signatures. For instance, an email signature may have a funny face replacing a traditional profile image. Laconic email signatures. See the example below. The signature lists only the author’s signature, their name, and job position. Informal email signatures. Here’s an example of an informal email signature matching the overall funny tone of the email’s main content. Things to remember when creating an email signature Do not overload users with information. Do not include all of your social media accounts, list the main ones instead. Here’s an example of what not to do, from a real email signature.  Do not repeat your email address. The recipient already knows who’s sent them an email. If an email is sent from a different email address, this is a good reason to review and edit your email templates.  These recommendations have one thing in common: an email signature should be brief and not overload recipients with unnecessary information. What to include in an email signature? Here’s what you can add to an email signature: A company’s logoA profile photo of the senderA sender’s position (if an email is sent on behalf of a particular person)Social media iconsAdditional contact data, such as phone number or website URL.How to create a great-looking signature for plain text emails? If you group all the information about sender in a single block and create an email that matches your website’s style using special services, this will definitely attract recipients’ attention help them remember email better. Such signatures work well emails sent clients or for so-called Plain emails. The least you can do is add a signature to your email. If you use Gmail, do this in the ‘Settings’ menu.  How to create an email signature using wisestamp.com You can add a professional-looking signature in Gmail with logo and links, as well as create email signatures for Outlook and other email clients, using a dedicated HTML signature generator, for instance, wisestamp.com.  With the help of this service, you can create both individual signatures and a series of corporate signatures in a uniform style for a team of employees. The latter option is available only in the corporate version of this app. However, there’s a free two-week trial, during which you can test all the service’s features. As for individual signatures, you can create them for free. Let’s see how this works.  First, you need to specify the professional industry: this will influence the signature’s style.  Next, you need to fill in the email signature details and to upload your photo or a company’s logo. There’s no need to fill in all the fields: add only the information that would be useful to your recipients.  After you add contact data and social media links, the service generates a signature in your chosen format.  The paid version of the service offers customization options for font size and font color, as well as social media icons. Want to add this signature to your email client? All you need to do is to copy it and paste it in the email client’s settings.  Once you complete the saving and synchronization process, a signature will be automatically added to your emails. Keep in mind that you need to specify your email client before saving a signature. A service might require you to upgrade to PRO if you use certain email clients or need to generate an HTML version of a signature.  The signature is almost ready. Now all you need to do is to connect your account depending on the email client you’re using.  After you do so, a signature will be added to your emails.  You can change the style of your signature at any time. To do so, simply choose the signature template you like the most.  Save the changes and enjoy your brand new email signature.  There’s a number of other services you can use to create email signatures. Here are some of them: Newoldstamp, HTMLsig, and Hubspot Signature Template Generator. How to create an email signature with eSputnik? Creating a signature for an HTML email is easy when you use the eSputnik’s editor. Option № 1: A 2-column signature If you want to add a signature to an email’s footer, a 2-column signature might be a good fit. See the example below:  To make one, you’ll need an image (in this case, a photo of a company’s employee). Add a two-block structure to your email’s template. Insert a photo in one block and a text into another. Next, edit the signature’s fonts so they would match your email’s design. Option № 2: A 3-column signature In this case, a three-block structure is used. As a result, you’ll get an email signature that looks like the one below.  Some creative ideas for an email signature You can demonstrate some creativity and come up with different types of email signatures. In some cases, all you need to do is to add some themed elements to the company representative’s profile photo. Here’s how the eSputnik clients implemented this idea: they’ve created a standard email signature, a Christmas one, a one for St. Patrick’s Day and for the 8th of March.     Rules and best practices for designing an email signature Now you know almost everything about adding an email signature to your emails. While there is no single standard on how a signature should look like in an email, there are some generally accepted rules to keep in mind. Consider the distinctive features of your company’s and your audience when you create an email signature. Keep in mind that some companies use different signature styles for business emails, informational emails, trigger emails, and promo emails. When a company sends different types of emails, they might have different senders’ names and different email signatures. For instance, you can choose to end your promo emails with a signature that has a profile photo and contact details of your company’s customer service manager. At the same time, you can decide to send triggered emails asking a customer for a review on behalf of a company’s commercial manager, with an email signature listing their contact information. An email signature might not be the most noticeable part of the footer. However, it can still greatly contribute to your company’s image and marketing, as well as to your professional reputation. Therefore, it’s crucial to invest enough time and effort into creating a proper email signature. You can do so using the eSputnik’s responsive email template editor to design HTML email templates. You can also use special third-party services if you need to generate an original signature for emails that you send to your partners and customers via email clients. ",
            "date": "Answered June 3, 2019",
            "views": "232",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Sudin Biswas",
                    "user_href": "/profile/Sudin-Biswas-2"
                },
                {
                    "user_id": "Satyadeep Tiwari",
                    "user_href": "/profile/Satyadeep-Tiwari"
                }
            ]
        },
        {
            "author_info": {
                "name": "Henry Zephyr",
                "href": "/profile/Henry-Zephyr"
            },
            "answer_text": "The main thing is to have a good disclaimer after your name. For example: This message is composed of electrons that were sustainably and humanely harvested from U.S-sourced donor atoms. The electrons are over 18 years of age, free-range, fair-trade, grass-fed, organic, vegan, halal, kosher, pareve, non-GMO, gluten-, sugar-, sodium-, MSG-, fat-, and transfat-free, contain no artificial flavors or colors, were not derived from conflict minerals, and were lovingly rolled on the thighs of Cuban virgins. One size fits all. These statements have not been evaluated by the FDA, and no advice is given regarding the reading of this message, legal or otherwise. As free electrons are inherently unstable, and no preservatives were added to this message, reheating is not recommended -- refrigerate after opening and avoid magnetic fields, prolonged exposure to ultraviolet light, contact with skin, and extreme temperatures. Store in a cool, dry place. Keep away from sunlight, open flames, pets, and small children. Avoid inhaling fumes and read only with adequate ventilation. This message is ribbed for your pleasure and sanitized for your protection, as seen on TV, may be viewed on participating devices only, is for indoor or outdoor use only, is not meant to be used in bathrooms or as a dental drill, and is provided \"as-is\" without any warranties, express or implied. Harmful or fatal if swallowed. If a rash, redness, irritation, or swelling develops, discontinue reading. If you cannot read these disclaimers, please notify a flight attendant. Neither the sender nor his Internet Service Provider shall be liable for any brain damage arising from the reading of this message, or be responsible for direct, indirect, incidental or consequential damages resulting from any defect, error or failure to perform. There are no user-serviceable parts inside this message. Past performance does not guarantee future results. Limit one message per family, please. This message is not available in all states, or with any other offer, and is void where taxed or prohibited by law. Other restrictions may apply. Side-effects may include dizziness, drowning, and death. Objects in message are closer than they appear. This message was created using a keyboard that contains substances known to the State of California to cause cancer. Please recycle responsibly. If you have received this message in error, and cannot unsee it, please inject a 5% solution of ordinary household bleach directly into your corneas. Open other end. ",
            "date": "Updated August 14, 2020",
            "views": "327",
            "upvotes": " View 3 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Emily Payton",
                    "user_href": "/profile/Emily-Payton-20"
                },
                {
                    "user_id": "Yojji Peterson",
                    "user_href": "/profile/Yojji-Peterson"
                },
                {
                    "user_id": "Harrison Boyle",
                    "user_href": "/profile/Harrison-Boyle"
                }
            ]
        }
    ]
}