{
    "title": "How many times should I use the main keyword on my article? - Quora",
    "tags": [
        "Keyword Research",
        "SEO Tools"
    ],
    "response": [
        {
            "author_info": {
                "name": "Roberto Severino",
                "href": "/profile/Roberto-Severino-5"
            },
            "answer_text": "Just focus on writing good content naturally. You will often find that you will have the focus keyword mentioned enough times for Google to search and index your page. You can mention the keyword a few times in your headings if needed, and a couple of times in your article where it makes most sense to use it. A lot of SEO people make it sound like this is harder than it actually is. I always found those requirements on freelance sites like Textbroker where people ask you to unnaturally mention a keyword 5–6 times to be quite ridiculous and unnecessary to be able to develop good SEO content. If you want to know more about how to develop amazing content for your website, I encourage you to read this article below which will give you a lot of insights and tips you may find useful: https://www.viridiangeeks.com/how-to-create-winning-seo-content-copywriting/ Roberto Severino is a digital marketing expert at Viridian Geeks, an Atlanta digital marketing and web design company that understands the importance of integrating SEO, content, and web design in one cohesive solution for business owners. Follow us on Facebook, Twitter, Google+, and LinkedIn for more digital marketing and SEO insights. ",
            "date": "Answered July 17, 2018",
            "views": "1",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Ann Yaroshenko",
                    "user_href": "/profile/Ann-Yaroshenko"
                },
                {
                    "user_id": "Zonathon Rayan",
                    "user_href": "/profile/Zonathon-Rayan"
                }
            ]
        },
        {
            "author_info": {
                "name": "Sean Hegarty",
                "href": "/profile/Sean-Hegarty-18"
            },
            "answer_text": "In all honesty, the old rule of having the keyword repeated X amount of times in the content is the wrong way of optimising a page. Don’t get me wrong, definitely make sure to get repetitions of the keyword in place, along with synonyms, but don’t write the content thinking “right, I’ve got to get 5 repetitions of ‘x’ phrase in place” I guarantee you, if you write the content for the purpose it’s supposed to be on a website for, which is to give visitors information and provide an actual service, then you’ll naturally have the right amount of repetitions in place without any effort and it’ll read much better - which is what Google looks at. Focus on writing good quality content that actually serves a purpose. ",
            "date": "Answered July 16, 2018",
            "views": "404",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Daniel Harrison",
                    "user_href": "/profile/Daniel-Harrison-121"
                },
                {
                    "user_id": "Zonathon Rayan",
                    "user_href": "/profile/Zonathon-Rayan"
                }
            ]
        }
    ]
}