{
    "title": "How to write a heartfelt letter to a teacher - Quora",
    "tags": [
        "Graduate School Admissions Recommendation Letters",
        "Recommendation Letters",
        "Letters (mail)",
        "Teachers",
        "Writing Advice"
    ],
    "response": [
        {
            "author_info": {
                "name": "Natasha Gangal",
                "href": "/profile/Natasha-Gangal"
            },
            "answer_text": "As a fellow student who tends to get [appropriately] close to my teachers, I love writing letters of appreciation to them. Because I’m still in touch with many of my high school teachers, I know that they really loved getting these letters too. Focus on how they have helped you, in and out of the classroom. If you were going through a personal issue and they were very understanding, mention that specifically. Hold off to actually say the words “Thank you” to the end of the letter, because it will force you to be introspective on how they have influenced your life. Teachers are shapers of the world, and almost never get the recognition they deserve. Write the note in a card, specifically so it doesn’t get lost amongst the loads of papers they are around every day. ",
            "date": "Answered May 29, 2017",
            "views": "28",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Katie Decker",
                    "user_href": "/profile/Katie-Decker-2"
                },
                {
                    "user_id": "Rak Garg",
                    "user_href": "/profile/Rak-Garg"
                },
                {
                    "user_id": "Chelsea Adams",
                    "user_href": "/profile/Chelsea-Adams-31"
                }
            ]
        },
        {
            "author_info": {
                "name": "Katie Decker",
                "href": "/profile/Katie-Decker-2"
            },
            "answer_text": "As a teacher, a card with a message showing gratitude is a treasure. It is better than a note on lined paper because it shows you put more thought and effort into it. Also, be thoughtful while writing it and try to use good grammar and spelling. He or she will also appreciate that very much, because it implies success on the part of the teacher. ",
            "date": "Answered July 15, 2017",
            "views": "13",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Steve Russillo",
                    "user_href": "/profile/Steve-Russillo"
                },
                {
                    "user_id": "Divya Chinni",
                    "user_href": "/profile/Divya-Chinni-11"
                }
            ]
        }
    ]
}