{
    "title": "How to write a good explanation of poem stanzas - Quora",
    "tags": [
        "Poems",
        "Poetry",
        "Creative Writing",
        "Literature",
        "Writing Advice"
    ],
    "response": [
        {
            "author_info": {
                "name": "Denis Martindale",
                "href": "/profile/Denis-Martindale"
            },
            "answer_text": "Even though I’ve got 2,900+ poems on the poemhunter poetry website, I was interested in seeing my poem Portrait Of A Prince on YouTube being studied in Indian schools and that teachers were providing explanations for their classes. So while I wrote the poem, it didn’t mean I knew everything about poetry terms and poetry analysis that others could share. I learnt that if we recite the stanza’s text we can see how a poet phrases and describes the theme at different levels as well as if there’s a structure. I use the common metre hymn style of 8–6–8–6 syllables. So the teachers explained this feature and how it affected the way the poetry was read and spoken. Each stanza could be unfolded to reveal a little more than before. Beyond these points, the poem about the tiger didn’t hide the obvious dangers but portrayed the tiger in his own heroic way. So while I aimed at a bit of humour about running away from a tiger, the teachers didn’t seem to see the funny side of that part of the poem. Every reader is different and this poem was just one of my 700+ wildlife poems. So the teachers were much more sensitive to teaching their classes about the dangers involved. : As for other poets we encounter, we can assess the poems for structure or no structure at all. Special phrases that stand out, or sabotage the reciting part of sharing poetry. Difficulties with very long sentences, which Grammarly points out when giving percentage marks. Certain words not being liked at all and maybe adding exclamation marks to get better marks. Grammarly works in a more user-friendly way with poems if we join the lines into paragraphs instead. Grammarly sees this presentation and immediately reduces the errors because we switched to a text block it can assess better. So we can fix the issues better then use that text as the basis for the poem’s layout afterwards. : Stanzas sometimes include references that need explanations, such as the use of quotations, or common phrases of times gone by. Sometimes writers use writers’ devices to add to the wordplay rather than just saying the idea in a simple manner. Sometimes eloquence is being shown. Sometimes it’s just like a written conversation now and then. Sometimes I am can switch to I’m and can’t could then switch to can not or cannot. So these may be edited and corrected by us, but Grammarly may not always point out these variations. It’s useful when rhymes are regarded as suitable rather than just added as the first thought and then left as they were written. So we can assess how the poetry comes across as user-friendly rather than too eloquent for its own good… or ours. We can judge the style of a poem and yet we’re not always aware of the poet’s editing stages or what editors change to get something published later on. Editors don’t usually claim any credit for their suggestions or claim any copyright for their assistance. : Grammarly can point out a poem having clarity and good presentation and delivery or merely state the text is OK but rather bland. Add a few exclamation marks and Grammarly responds more favourably. Take out a few of the … pauses and percentages increase. We can’t do that with published poetry but we can with our own new poems. So to avoid several errors or negative feedback, it helps to really get editing like never before. : denismartindale—co—uk : ",
            "date": "Answered August 18, 2020",
            "views": "116",
            "upvotes": "0"
        }
    ]
}