{
    "title": "How much should I pay for a good article? - Quora",
    "tags": [
        "News Articles",
        "Writing"
    ],
    "response": [
        {
            "author_info": {
                "name": "Michael Wight",
                "href": "/profile/Michael-Wight-1"
            },
            "answer_text": "Hi Thanks for your question; well this largely depends on a lot of things. Unfortunately, in our industry people are paid based on word count and not merely quality. And this is understandable to an extent, because a 2000 word article will take more time to write than a 500 word article. Nonetheless, let me assume you need a 1000 word piece. Usually, you can get one written by a good writer for around $50, but some would charge you even $500 and some would be willing to do it for $10 as well.  What mattersL- Experience and skill: For example, if you need a finance related article an expert in the niche will understandably charge you more for their experience and better quality.- Quality and Others: Overall quality matters. Writing is judged on how perfectly the grammar is in addition to other things like SEO etc.  Lastly, you should see if the service provider is offering you the work on time and what other benefits are there. For example, my company, Michael Words, www.michaelwords.com , offers unlimited revisions, which is something no other company that I know of is doing right now. And to answer your question, we'll charge you $30 for a 1,000 word piece that will be a very high quality article. Also, we have experts on our team, which means an article on photography will be written by a photographer with extensive writing experience.  So, don't pay more than this! ",
            "date": "Answered February 26, 2016",
            "views": "395",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Shad Hus",
                    "user_href": "/profile/Shad-Hus"
                }
            ]
        },
        {
            "author_info": {
                "name": "Steve Howard",
                "href": "/profile/Steve-Howard-86"
            },
            "answer_text": "Do you mean to have someone write an article for you? Generally you will have to negotiate a price with the freelancer. It depends on how long the article is, how much research is involved, ect. Also, how experienced, qualified, and well known the journalist will have to be considered. ",
            "date": "Answered March 14, 2020",
            "views": "295",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Brendan McNally",
                    "user_href": "/profile/Brendan-McNally"
                }
            ]
        }
    ]
}