{
    "title": "How to write a good blog post in 2020 - Quora",
    "tags": [
        "Blog Posts",
        "Blog Writing",
        "Blogging Advice!",
        "Bloggers",
        "Creative Writing",
        "2020 (year)",
        "Blogs",
        "Blogging",
        "Writing Advice"
    ],
    "response": [
        {
            "author_info": {
                "name": "Komal Ahuja",
                "href": "/profile/Komal-Ahuja-29"
            },
            "answer_text": "Content formatting is really important for blogs It plays a major role in SEO and readability, Here are some best practices: - Use keywords naturally, use synonyms when you can and avoid stuffing - Don't write long paragraphs, maintain white spaces - Use sub-headings, bullets and numbering to keep it structured and easy-to-read - Bold important things, best do it once in a few paragraphs - Add visuals and multimedia, don't forget to cite sources. Use Canva, Photoshop or stock images if you want to use originals. - Make it actionable, attach reference links and screenshots to make it easy for the reader to follow through Blogging in 2020 is all about making it easy for the audience to read and relate to, so the best thing would be to write like you talk! All the best. ",
            "date": "Answered June 24, 2020",
            "views": "83",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Diksha Sinha",
                    "user_href": "/profile/Diksha-Sinha-40"
                },
                {
                    "user_id": "Chumki Sen",
                    "user_href": "/profile/Chumki-Sen-2"
                },
                {
                    "user_id": "Tech Ops",
                    "user_href": "/profile/Tech-Ops-4"
                }
            ]
        },
        {
            "author_info": {
                "name": "Scott Flack",
                "href": "/profile/Scott-Flack-6"
            },
            "answer_text": "Here is a good post which explains the key things you need to do to write a good blog post. There are 4 main factors: 1. Your content needs to be 'worth the while' of the visitor reading. 2. You need to write 'Search Engine Optimized' targeted content. 3. Your blog posts need to have a good length and structure. 4. Your posts must be unique and not copied from other blog posts! Read it at How to generate traffic with your blog posts in 2020! ",
            "date": "Answered July 19, 2020",
            "views": "21",
            "upvotes": "0"
        }
    ]
}