{
    "title": "How many words are 2,500 characters? - Quora",
    "tags": [
        "Essay Writing Help",
        "Essays",
        "Writing Advice",
        "Linguistics",
        "Writing"
    ],
    "response": [
        {
            "author_info": {
                "name": "Doug Harris",
                "href": "/profile/Doug-Harris-7"
            },
            "answer_text": "Are you looking for something? Some specific something revealing a secret of the universe? Consider this: The license plate on my car features four letters followed by as many numbers. Change any one of those, and you multiply the possible combinations by a huge number. (Remember, each change of a single letter offers up a 26 times x changes. There’s a mathematics way to say that, but that’s not my area of expertise.) So, how many words are in 2,500 characters? I’ll bet there a mathematics way to say how many… but what’s your point? ",
            "date": "Answered January 6, 2020",
            "views": "25",
            "upvotes": " Answer requested by Allen Greg",
            "upvoters": [
                {
                    "user_id": "Vipul Verma",
                    "user_href": "/profile/Vipul-Verma-9"
                },
                {
                    "user_id": "Carson Lemmen",
                    "user_href": "/profile/Carson-Lemmen"
                },
                {
                    "user_id": "Gary Addis",
                    "user_href": "/profile/Gary-Addis-1"
                },
                {
                    "user_id": "Aaron Jennings",
                    "user_href": "/profile/Aaron-Jennings-17"
                }
            ]
        },
        {
            "author_info": {
                "name": "John Bevan",
                "href": "/profile/John-Bevan-7"
            },
            "answer_text": "As others have pointed out, it varies by the average length of a word in the language being used. For English, the average word is said to be about five to six letters, thus leading to an expected word count of about 417 to 500. However, in the first two sentences in this paragraph, I used 136 characters for 33 words, so that would average a bit lower at about 4 characters per word (and, therefore, an expected word count of about 625). So, it just depends on the words you choose for your composition. If this is for a class or article submission, then this typically means about 500 words or one single-spaced (two double-spaced) typed pages at 12-point font, definitely not very long and easy to complete with just a bit of effort. (Up to the end of the last sentence, I have typed 135 words, so over a quarter of the way to your goal and that took just a few minutes.) ",
            "date": "Answered August 5, 2019",
            "views": "96",
            "upvotes": " View 4 Upvoters "
        }
    ]
}