{
    "title": "How do introverts express their feelings? - Quora",
    "tags": [
        "Introverts and Introversion",
        "Understanding Character and Personality"
    ],
    "response": [
        {
            "author_info": {
                "name": "Shikha Shah",
                "href": "/profile/Shikha-Shah-75"
            },
            "answer_text": "Introverts aren't shy people they just prefer to spend time alone. People have this misconception that introverts are shy,they have no life! Hang on there pal,Introverts are creative people they do have their own way to enjoy it. When it comes to express something introverts are very wise,they won't open up easily until and unless they find the person trustworthy and with whom they build up their comfort done. It's not mandatory that they will express thier feelings while having a conversation they've their own way to express feeling. Many of them prefer to hammer out their feelings in a diary or in their notepad/Memo,while some prefer to share with their favorite person it all depends on how they want to disclose what they feel. Introverts are sensitive people but on the other hand they're keen observers so if you think that you can fool them then you're wrong! They'll notice every damn thing but won't utter a word. Some introverts also disclose their feelings when they're alone by singing out loud or by dancing(Only when no one's around:p). One important thing whenever introverts express their feelings they speak their heart out. Introverts are the most loyal people whether it comes to love or for keeping any secrets. If an introvert express anything to you then congrats you're lucky enough to be trusted upon. Regards:) Shikha Shah, An Autophile. ",
            "date": "Answered October 24, 2017",
            "views": "73",
            "upvotes": " View 35 Upvoters",
            "upvoters": [
                {
                    "user_id": "Ayra Khan",
                    "user_href": "/profile/Ayra-Khan-48"
                },
                {
                    "user_id": "Farahfayyaz",
                    "user_href": "/profile/Farahfayyaz"
                },
                {
                    "user_id": "Binita Benoy",
                    "user_href": "/profile/Binita-Benoy"
                },
                {
                    "user_id": "Isabela Gomes",
                    "user_href": "/profile/Isabela-Gomes-5"
                },
                {
                    "user_id": "Saza",
                    "user_href": "/profile/Saza-1"
                },
                {
                    "user_id": "Anniek Xiaojiao Verstegen",
                    "user_href": "/profile/Anniek-Xiaojiao-Verstegen"
                },
                {
                    "user_id": "Juliet Gill",
                    "user_href": "/profile/Juliet-Gill-2"
                },
                {
                    "user_id": "Isaac Pius",
                    "user_href": "/profile/Isaac-Pius-3"
                },
                {
                    "user_id": "Raju Kumar",
                    "user_href": "/profile/Raju-Kumar-2771"
                },
                {
                    "user_id": "Vijayalakshmi G",
                    "user_href": "/profile/Vijayalakshmi-G-63"
                }
            ]
        },
        {
            "author_info": {
                "name": "Pavan Raina",
                "href": "/profile/Pavan-Raina-2"
            },
            "answer_text": "Introvert knows better what feeling is about except s/he is weaker in expressing unless they get the confidence of others. In this process s/he becomes a keen observer of others and their minor details which they may also not be knowing due to their careless nature. If this appears true such people develop a specific additional trait useful for life time. More important than expressing the feeling the observation should be to strengthen our inner nature which may be happening but unaware. Such people instead of viewing as a loss in company or unable to attract attention of others (as subconscious desire) it is better to add constructive hobby that could help joining with society or other in a more constructive way. Others enjoying your company and for your hard earned effort as his/her appreciation; is that not better. An introvert has such quality by default that needs to be harnessed. Instead if one is wandering in thought s/he is wasting and if that is the goal it is only to break the nature but it may be not simple as well. Why one is attracted with such nature? It is divine any other logical explanation may not give a clue but when one can try to track and find reason s/he can be the better by devoting time in constructive way. By adding positive traits it is easy to go deeper within and there the observation power can even lead in observing your own mind; an excellent opportunity to understand and utilize the divine gift of nature. One who is able to observe his/her own mind becomes intelligent as his/her analysis gives a better judgment and makes a better discrimination with time. Have a belief in divine force the way of your choice and could be simpler because it doesn’t need another but spending some time alone with personal or impersonal god. This creates trust in self that can make self-sufficient and so confidence. It is not about going away from the world or not to force the mind to be extrovert and entering unknown terrain but readying self in the available nature and preparing to face the extrovert world with confidence and positivity. Reading can be a good source of enjoyment by such nature but ensue reading good books. Good books be fiction or autobiographies can lead to spiritual types that have enough material to enhance the mental growth. Using time by different ways explained it is confidence sprouting the hidden gems from within that may glitter by the intelligence and spiritual force enhanced and who knows the large world may dance in your tune without you being influenced by them. You would no more remain introvert but a leading authority in the field you are walking and teach many more much more than being extrovert the original inquiring thought. ",
            "date": "Answered October 18, 2017",
            "views": "33",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Ayra Khan",
                    "user_href": "/profile/Ayra-Khan-48"
                },
                {
                    "user_id": "Saza",
                    "user_href": "/profile/Saza-1"
                },
                {
                    "user_id": "Anniek Xiaojiao Verstegen",
                    "user_href": "/profile/Anniek-Xiaojiao-Verstegen"
                },
                {
                    "user_id": "Ummekulsum Chauhan",
                    "user_href": "/profile/Ummekulsum-Chauhan"
                }
            ]
        }
    ]
}