{
    "title": "How to correct my English spelling - Quora",
    "tags": [
        "Learning English Grammar",
        "English Spelling",
        "Spelling",
        "Learning English",
        "Grammar",
        "English Grammar"
    ],
    "response": [
        {
            "author_info": {
                "name": "Murad Şahinoğlu",
                "href": "/profile/Murad-Şahinoğlu"
            },
            "answer_text": "You don’t correct your own mistakes. I am sure there are people around you who can correct you. I always correct the people around me, because they make too many mistakes. I understand when they make mistake in English, but I cannot stand when they make mistakes in Turkish. Q: Mississippi is a long word, How do you spell it? A: I.T. This was the first English joke, I learnt when I was in the school. I used to read dictionaries. One of them was English-English dictionary with 30.000 words. I used to read it from the beginning to the end. I never got bored. I get bored when I read books. Now I have a better dictionary in my smartphone. I always watched American movies in English and without subtitles. I always listened to Eminem songs, trying to figure out what he was saying. Now I know. F*** most of the time… I really recommend reading English-English dictionaries. If you have a dictionary English-Native, Native-English you better put it away and lock it, but don’t throw it in the garbage. If you are stuck, you will need it. Another way we used to learn spelling was, dictation. Our teacher was reading a paragraph and we were trying to write it down. I have to say, I was the only one who was getting every single word spelled correctly. I was 12 then… Read one word make sure it is a long one, close your eyes and try to visualize the letters, open your eyes, check it. Try it again. Practice, practice and practice. After a while your brain will automatically know that, that letter after that one cannot be there. Then you won’t make spelling mistakes. Once you stop making spelling mistakes, you won’t have to correct anything. Nobody has to correct you either. Just remembered, I used to have an electronic English thesaurus, It had nearly 500.000 words. (At least, it said so.) It had hangman, jumble, and anagram games as well. That was so useful. Thank You!… PS: As much as I think I am good at spelling, I might have made some grammar mistakes in my sentences. Sorry for that… I will do my best next time… My thesaurus looked like this but not this one…  ",
            "date": "Answered August 18, 2016",
            "views": "12",
            "upvotes": " View 5 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Sushama Singh",
                    "user_href": "/profile/Sushama-Singh-51"
                },
                {
                    "user_id": "Dilip Somaiya",
                    "user_href": "/profile/Dilip-Somaiya"
                },
                {
                    "user_id": "Sndp Buttar",
                    "user_href": "/profile/Sndp-Buttar"
                },
                {
                    "user_id": "Rolando Cueva",
                    "user_href": "/profile/Rolando-Cueva"
                },
                {
                    "user_id": "Bruce R. Bain",
                    "user_href": "/profile/Bruce-R-Bain"
                }
            ]
        },
        {
            "author_info": {
                "name": "John Katt",
                "href": "/profile/John-Katt"
            },
            "answer_text": "The issue relates primarily to how vowel phonemes are represented graphically or spelled in English. This shows how messed up is the system, if one can call it a system. LOL  Most consonants (except th, s, and c) are usually spelled in a regular way or predictable way. So, in a way, I assume people learn the “consonantal” skeleton of a word (or the shape of the word) and this explains the reason behind these common primary activities:  .The only way you could master it is to memorize the spelling of words as there are so many ways vowel phonemes are spelled and ANKI could help you in this manner, if efficiency is required. If you are a speaker of a Romance language, this should be an easier task, btw, as many words are spelled more phonemically in Romance languages. Otherwise, you will have to read, read, and read. However, this will mess up your ability to pronounce words, but there are many English-speaking Quorans who unwilling to make their language for you to learn. We could call them selfish, but that everybody must be nice and not tell the truth! Watching movies with subtitles could help you too or videos with lyrics. Don’t feel bad! There are a few English-speakers who have a soft spot for you (and many have, as they themselves have challenges). Some would like better systems too. There are[1], but it is going to take time and many upvotes for a plan to fix the issue to make it happen. Let’s make democracy work for the people. Footnotes[1] John Katt's answer to What are your most controversial or unpopular opinions?",
            "date": "Updated May 19, 2017",
            "views": "432",
            "upvotes": " View 3 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Solomon Raj",
                    "user_href": "/profile/Solomon-Raj-185"
                },
                {
                    "user_id": "Akash Beh",
                    "user_href": "/profile/Akash-Beh"
                },
                {
                    "user_id": "Floramae Gomez",
                    "user_href": "/profile/Floramae-Gomez"
                }
            ]
        }
    ]
}