{
    "title": "How to start using fountain pens - Quora",
    "tags": [
        "Fountain Pens",
        "Handwriting",
        "Ink",
        "Pens"
    ],
    "response": [
        {
            "author_info": {
                "name": "Scott Gold",
                "href": "/profile/Scott-Gold-7"
            },
            "answer_text": "I want to encourage you to take the leap and try out using fountain pens. But I do not recommend jumping in the deep end (spending lots of money). Wade in slowly, with a quality, inexpensive fountain pen. I suggest getting one that takes cartridges. You can buy small packs (usually 6 cartridges) of ink to start. Yes, I know cartridges aren’t as eco-friend and cost-effective as bottle ink, but if you decide fountain pens aren’t your thing you won’t be out as much money. Lamy Safari and Pilot Metropolitan are the most popular starter fountain pens, but there are others, including: Noodlers makes several models.Platinum PreppyTWSBI ECO (this one has a built-in filler mechanism, so you will need bottled ink for this one). These cost a little more than some other starter pens.Pentel Tradio (I really like the body style of this pen, which also comes in a gel ink version. This fountain pen can sometimes be found for sale in big office supply stores)Kaweco Perkeo (this is a terrific pen and a good way to get introduced to Kaweco, which is a pen company not as well known as some other companies, but a producer of really nice pens).There are Chinese pen makers, such as Jinhao, that make pens of good quality materials (metals rather than plastic), that look nice, and are very inexpensive. But I’ve heard quality of the nib can be hit or miss. I have one Jinhao fountain pen and I’ve been happy with it, though I don’t write with it regularly.Be aware not all of these use the same type of cartridge. Lamy and Pilot use their own style. Most others accept what are called international cartridges, which come in standard and long lengths. Whichever pen you choose, make sure you get the correct cartridges. My preferred starter ink is Waterman blue, which can be found in international long cartridges at some big office supply stores. It flows well and doesn’t bleed as easily on cheaper paper as some other inks I’ve used. Left-handed writers should use a faster drying ink. I suggest getting a pen with either a fine (F) or medium (M) nib. Extra fine nibs (especially in cheaper pens) tend to be scratchy, which can give a negative writing experience. A good quality nib should write smoothly regardless of the thickness of the line, but with inexpensive pens you are more likely to experience smooth writing with a broader nib. When you start writing, use only a little pressure. The ink should flow easily without much pressure. Most starter fountain pens have a stiff nib, so don’t expect a lot of “expression” (varying line thickness). Once you get used to writing with a fountain pen, try using a pen with a more flexible nib, and experiment carefully with the pressure. It is a wonderful experience! ",
            "date": "Answered August 20, 2019",
            "views": "101",
            "upvotes": " View 3 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Brad Parham",
                    "user_href": "/profile/Brad-Parham"
                },
                {
                    "user_id": "Celine Roth",
                    "user_href": "/profile/Celine-Roth-2"
                },
                {
                    "user_id": "Bernard Glassman",
                    "user_href": "/profile/Bernard-Glassman-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "JetPens Official",
                "href": "/profile/JetPens-Official"
            },
            "answer_text": "This is a great question! Here’s what to do:  Install the ink: Fountain pens almost always come with their ink cartridge sealed and uninstalled, so you’ll need to install the cartridge before you can write with the pen. To do so: 1) Unscrew the pen’s grip section from the barrel and locate the ink cartridge. The ink cartridge may come stored inside the barrel. 2) Insert the sealed end of the cartridge into the grip section until the seal is punctured and the cartridge slides firmly into place. Check out our guide here if you're still not sure how to install your pen's ink cartridge! 3) Reassemble the pen. It can take a while for the ink to fully saturate the pen, so don’t worry if it doesn’t start writing right away. 4) Hold It Right  Hold the pen so that the nib is above the feed and at about a 45 degree angle to the paper. It won’t write well if you hold it upside down or at too high or low of an angle. 5) Don’t Press Too Hard  Fountain pens need a lot less writing pressure than a ballpoint or gel pen. In fact, too much pressure will prevent fountain pens from writing well and can even damage them. Many fountain pens can write without any pressure at all, while others require just a tiny bit of pressure. 6) Keep It Capped Fountain pens should always be capped or retracted when you aren’t using them. Otherwise, the ink in the nib will dry out and the pen won’t work the next time you use it. 7) Clean It Periodically  Over time, fountain pens get clogged up with tiny paper fibers and microscopic bits of dust and dried ink. We recommend cleaning your pen every 1–2 months for best performance. You can read our guide to cleaning fountain pens here. 8) Use Fountain Pen Friendly Paper and Notebooks  Using fountain pen friendly paper and notebooks will make your experience far more enjoyable and less likely to end in frustration. To see our top paper recommendations, check out our guides to fountain pen friendly paper and notebooks. Take a look at our Beginner’s Guide to Fountain Pens for more details! ",
            "date": "Answered September 4, 2019",
            "views": "100",
            "upvotes": " View 2 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Brad Parham",
                    "user_href": "/profile/Brad-Parham"
                },
                {
                    "user_id": "Cesar A. K. Grossmann",
                    "user_href": "/profile/Cesar-A-K-Grossmann"
                }
            ]
        }
    ]
}