{
    "title": "How to write an image analysis essay - Quora",
    "tags": [
        "Essay Writing Help",
        "Essays"
    ],
    "response": [
        {
            "author_info": {
                "name": "Bruno H Burrell",
                "href": "/profile/Bruno-H-Burrell"
            },
            "answer_text": "Art communicates these primeval experiences not just through an artist's stimulation, but also through very clear, identifiable visual communication techniques. Writing a picture analysis essay requires a basic understanding of essay structure and these visual communication techniques. Excellent picture analysis essays combine both these elements while addressing the more fleeting ideas and experiences communicated by a picture. Analysis includes; Step 1: Note how the picture makes you feel. Does this before you make any intellectual analysis of the picture? Immediate, unsuspecting and unguarded observation will often tell you more about the content communicated by the painting than rigorous analysis. Step2: Address the age of the picture. Take note of the period from which it comes, what styles conquered that era, what techniques artists used and who commissioned the work. Consider the current events going on at the time of the picture's creation and what social or cultural elements or changes may have affected its content. Step3: Find out the dimensions of the picture. A large picture communicates very differently from a small one. Produce reasons why the picture communicates well or poorly due to its size. Step4: Look for the composition of the picture. Composition refers to the way the elements are oriented in relationship to one another. Observe if the objects seem crowded or sparse, symmetrical or asymmetrical. Consider why the objects in the picture have their specific orientation. Step5: Take note of how the picture is cropped. Cropping refers to images that only partially appear in the picture, as if someone \"cropped\" them out of the picture. Address how cropping focuses the viewer on certain aspects of the picture and what ideas the cropping may help communicate. Essay writing services give you a proper ways or steps for the completion and excellent essay writings. ",
            "date": "Answered October 17, 2017",
            "views": "539",
            "upvotes": "0"
        }
    ]
}