{
    "title": "How to start setting goals for myself again - Quora",
    "tags": [
        "Improving Self-Confidence",
        "Self-Esteem",
        "Self-Improvement Advice",
        "Depression",
        "Self-Improvement"
    ],
    "response": [
        {
            "author_info": {
                "name": "Vikram Gunasekar",
                "href": "/profile/Vikram-Gunasekar"
            },
            "answer_text": "Here are some of my thoughts on it. Say you take a resolution to run frequently. 1. Create measurable goals to your ambitions:Don't start with I want to loose weight or I want to run frequently. Set a measurable realistic goal. May be settle for 1000 kms or play guitar in some college event. This will give you a sense of goal or destiny without which you will certainly be lost. Your mind doesn't give a damn about your vague ambitions. 2. Fix a deadline and break down the goals into smaller goals: Now 1000 km goal might be appealing to start with, but as days go by you will still loose your focus. 1000 km is too far away and make you feel that a trip to mordor to drop the ring could have been easier. Our mind needs constant gratifications. We always prefer short term benefits over long terms'.Fix a deadline and break down the goals to smaller ones. Say you fix 1000 kms in one year and break it down to a monthly or weekly goals. Ensure that you meet those goals without fail and trust me this will be much much simpler. Have you ever wondered why we study well a day before the exam but not before that? Looming deadlines can make you do that and thats why you impose a deadline every week. 3. Build motivations - large and small:What is in it for you if the goal is achieved? If the answer is no you can never finish it. But the answer is never no. If its no you wouldn't start in first place. Ask yourself What are benefits of achieving your goals?Find them and keep reminding yourself of how great it would be if you can reach these. Imagine yourself playing guitar before your college mates. All the people who are going to talk about you (its ok to unleash your imaginations here) But remember you also need to look after short term goals. What is in there to run certain distance every week?Self appreciation is one way to make this work. Promise to buy yourself something only if you achieve certain smaller goals. You could be thinking of buying a new phone. So promise yourself to buy that only if you keep this schedule for 2 months. You might have bought that phone anyway even without attaching to this goal, but its ok to cheat yourself this way if that keeps you going. Trust me - your mind won't mind that you are cheating it this way. 4. Tell your friends :You might even add this to short term motivations, it works just well. Lets say you learnt to play guitar but you feel you sound horrible. Try playing that to your friends and tell them how long you were practicing it. More often you'll be surprised by their responses - We tend to underestimate ourselves when we try new stuffs. People will be awed even at your month old guitar skills. Many people do not even reach to that level. This can also act as an motivation for your short term goals. When people stare at you with eyes beaming with surprise it will push you even harder. 5. Know when to stop:Sometimes its better to stop rather than pushing yourself. It could be due to many reasons - you are no longer passionate, better options or myriads of reasons.But the problem is not with stopping but to understand if you have genuine reason to stop or is it just another lame excuses of yourself.You might once be crazy about playing guitar. But after some times if you feel you lost your enthusiasm towards it then stop. If you are running for a couple of months and then come to know about swimming class and want to learn swimming instead of running, what do you do? Some times people can be so adamant about achieving goals that they forget the larger picture and stick to running. But how to differentiate between genuine reasons and lame excuses? Ask your friend. Stop something only if majority of your friends agree with you. No matter what happens, you do not decide when to stop. Same goes for lowering your goals. May be after 6 months of running you feel 1000 kms is too much. You ask your friend who knows about running, whether you should lower your goals. Be realistic in re setting your goals. 6.Sleep well:This might look highly unrelated but this is as important as the above 5 points. I have noticed highly perceptible correlation between getting enough sleep and being focussed. Nice healthy sleep pattern is very important to stay focussed. 7.Stop being jack of all trades:Don't take too many stuffs at once. You might want to become a marathon runner who published a novel and cracked IIT all within a year. But don't try all 3 - you will become none. Find how many hours you have to spend for these activities on daily basis and decide based on that how many tasks you want to take up. 8. Nothing is too ambitious:Don't keep questioning if I can do that. Many tend to give up due to just this one reason. Between motivating yourself, also keep telling its ok to fail - you will still take away a lifetime of experience from it. And who knows, you might even end up achieving it if you did not give up. Read some rag to riches stories. Those might just keep you going. ",
            "date": "Answered March 27, 2014",
            "views": "396",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Xandra Cc",
                    "user_href": "/profile/Xandra-Cc"
                }
            ]
        },
        {
            "author_info": {
                "name": "Wan",
                "href": "/profile/Wan-35"
            },
            "answer_text": "Hi, Here's a system of setting goals I devised that's based on the idea of mini habits and streak-habits by Jerry Seinfeld. First, the challenge - you'll need 180 days to accomplish 3 streak-based goals. Let me give you an example of the 3 goals: 1. Read a book for 30 minutes a day for 90 days2. Eat 3000 calories a day for 90 days3. Write 1000 words a day for 90 days Second, the steps - 90 days are needed to generate momentum while the next 90 days are for challenge completion. You'll have 3 months so divide the streak into 3 mini habits of increasing difficulty. 1. Read a book 5 minutes a day/ 15 minutes a day/ 25 minutes2. 1000/ 1750/ 2500 calories a day3. Write 200 / 500/ 750 words a day The first month will be using the easiest mini habits, the second the medium, third the hardest. so, for the first month, every dayyou'll need to read a book for 5 minutes, eat 1000 calories, and write 200 words. Same goes for the other months. When you reached the fourth month, do the full version of the habits until you reach 180 days. Walaa! Using my example, the outcome would be more than 45 hours of reading, ate more than 270000 of calories, and written more than 90000 words. All of this only in 6 months. Hope that helped. ",
            "date": "Answered March 28, 2014",
            "views": "290",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Victor Step",
                "href": "/profile/Victor-Step"
            },
            "answer_text": "I say don’t set small goals. Rather set big goals for yourself that are exciting for you to work on and are meaningful. I think the idea is to set goals that you will care about. It’s about quality, not quantity. Make a couple of big goals instead of many small and easy goals. Do it together with someone. This is called accountability and is extremely powerful. It's used by life coaches and in mastermind groups to make progress much faster. Make sure you work on the mind. They say that your success is 20% skill and 80% mindset, which means that you need to motivate yourself every day in order to not lose your focus. To do this, you can start the day by reading a book, listening to some podcast or even just watching a short video on youtube. Have you goals written. A goal is not a goal until it is written on paper with a pen or pencil. Saying it out loud is not enough. There are of course more, but these are just a few. 10 Steps to Achieve Goals Faster and with Better Results | Growth Evolution Development  Sincerely,Victor Step ",
            "date": "Answered December 28, 2018",
            "views": "46",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Martijn Sjoorda",
                "href": "/profile/Martijn-Sjoorda"
            },
            "answer_text": "First up, I am sorry to hear you are where you are. While you may no longer feel you are depressed, based on your description you are perpetuating the behaviour you displayed when you were. Since you state that you have been like this since 2009, we can assume safely that you will find it very hard to break out of this alone. You need some help from a professional. DM me where you are and I'll happily see if I can introduce you to someone. In the mean time, see if you can start taking a big walk every day. That's a simple, achievable goal that will deliver immediate benefit to you. ",
            "date": "Answered March 27, 2014",
            "views": "167",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Lauren Alyce Watson",
                "href": "/profile/Lauren-Alyce-Watson"
            },
            "answer_text": " Start with smaller attainable goals that you believe you can achieve! If a goal is too lofty, break it down into smaller goals so you're not self sabotaging your goals by self doubt. Create a vision board! Set it somewhere you will see it OFTEN! Stay accountable to yourself. Write your goal down. Remain POSITIVE!! ALWAYS believe you can achieve any goal you set for yourself. ",
            "date": "Answered February 12, 2019",
            "views": "40",
            "upvotes": "0"
        }
    ]
}