{
    "title": "How to write comic books by script - Quora",
    "tags": [
        "Graphic Novels",
        "Screenwriting",
        "Comic Books",
        "Comics (narrative art)",
        "DC Comics",
        "Superheroes",
        "Writing Advice",
        "Writing"
    ],
    "response": [
        {
            "author_info": {
                "name": "Kurt Hathaway",
                "href": "/profile/Kurt-Hathaway"
            },
            "answer_text": "How do I write comic books by script?  If you’re a complete newbie, learn at least a LITTLE about what you’re doing BEFORE you do it. Learn about the craft of writing: story, plot, character, motivation, conflict, etc. This means reading books on story, plot, & characterization— screenplay books are handy to learn from, too. Watch youtube tutorial videos on story, plot, structure, & screenplay writing, Story is story--be it comics, movies, novels, etc. There may be different ways of TELLING that story--but a well-known story structure is pretty common to all those forms. Create a text-based story template as you learn, where does the first act break fall? The second act? Avoid deus ex machina plot devices. When you understand some of the basics, read some comics and try to identify what you learned. What is the hero’s goal? The villain’s? Where is the first act break, the mid-point pinch? What are the stakes if the hero loses? How does the conflict start? How does it escalate? Where is the hero at his lowest point in achieving their goal? Watch films and try to find the story-structure elements. How has the hero introduced? Dramatically--or casually? How do we see the villain in touch with his power? What makes him scary or dangerous? Once you can spot these and other story-structure elements--you’ll better understand how the parts fit together. Easy? No. Now practice writing. Maybe just a rough story outline at first. Use what you’ve learned. Use your story template as a guide. Then flesh out the scenes with prose--and maybe just a few lines of dialogue--but not a full-on script. It’s okay to jump around. Play with the ending first, maybe. Do this a dozen or more times with different story ideas. If you did the homework, you’ll see improvement in your work. When you have what you think is a good idea for a script exercise, move on to the final script phase. If you don’t know comics script format, see the sample below. Or grab my free comics script guide at my website. It’ll help your script look more professional to publishers and editors. But I can’t post my site’s URL here without getting bumped. With my name above and my company name: Cartoon Balloons—anyone can find my website for the free guide--or my Youtube channel, and contact me directly with any questions. Is your story worthy of 22 pages? This is an average comic book art & story page length. Maybe it’s a short story--worthy of only 7 pages? Totally your call, you’re just learning at this stage. Be aware to write the panels in still pictures, this isn’t a movie where the characters move. They won’t “walk into the room, open the window and sit on the bed.” If you need all 3 of these actions for your story, this will be 3 separate panels. If you don’t need all 3--which single action better suits the scene you have in mind? Now, get busy.   ",
            "date": "Answered October 26, 2019",
            "views": "477",
            "upvotes": " View 11 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Yash Kandukuri",
                    "user_href": "/profile/Yash-Kandukuri"
                },
                {
                    "user_id": "James H. Kelly",
                    "user_href": "/profile/James-H-Kelly"
                },
                {
                    "user_id": "James H. Jenkins",
                    "user_href": "/profile/James-H-Jenkins"
                },
                {
                    "user_id": "Miguel Valdespino",
                    "user_href": "/profile/Miguel-Valdespino"
                },
                {
                    "user_id": "Denis Rubin",
                    "user_href": "/profile/Denis-Rubin"
                },
                {
                    "user_id": "William Janiec",
                    "user_href": "/profile/William-Janiec"
                },
                {
                    "user_id": "Skip Press",
                    "user_href": "/profile/Skip-Press"
                },
                {
                    "user_id": "Belinda Allen",
                    "user_href": "/profile/Belinda-Allen-41"
                },
                {
                    "user_id": "Dirk Hooper",
                    "user_href": "/profile/Dirk-Hooper"
                },
                {
                    "user_id": "Francisco Cerda",
                    "user_href": "/profile/Francisco-Cerda-7"
                }
            ]
        },
        {
            "author_info": {
                "name": "William Goldstein",
                "href": "/profile/William-Goldstein-6"
            },
            "answer_text": "ON HIATUS TO WORK ON A PROJECT ",
            "date": "Answered October 11, 2019",
            "views": "10",
            "upvotes": " Answer requested by Ray Vega"
        }
    ]
}