{
    "title": "How is 'good photography' found in editing? - Quora",
    "tags": [
        "Digital Photographers",
        "Professional Photography",
        "Photo Editing",
        "Photographers",
        "Digital Photography",
        "Photographs"
    ],
    "response": [
        {
            "author_info": {
                "name": "Mark Heyer",
                "href": "/profile/Mark-Heyer"
            },
            "answer_text": "How is good photography found in editing? First, you have to think about what is a “good photograph.” There are many, many reasons for taking a photograph. On one end, documentary photographs depict realistic scenes or objects. Everything from a part off of a dishwasher to news and sports. For these images, editing is undertaken to enhance the realism of the depiction.A good documentary photo is one that clearly depicts the subject. Then there are photos that are created as art forms. They seek to communicate with the mind of the viewer on a deeper intellectual and/or emotional level. For this type of photography, editing is required as an important component of the creative effort. We can understand this by comparing photography to painting: A painter starts with a blank canvas and adds detail until they are satisfied. Unreal depictions and abstractions are often part of the artistic painting. The images are filtered through the mind of the painter before they are rendered on canvas. Photographs are created instantly by a machine which allows the photographer only three creative tools to work with: CompositionSeeing the lightTimingWhen the picture is taken, it is what it is. Seldom if ever are all three in perfect harmony except for staged photographs. Even worse, Most photographs recorded by a camera do not represent the way the human eye and mind see the same scene. Ansel Adams, famed for his highly detailed “documentary” photographs did extensive editing to make them more attractive to viewers and is rightly famed for the artistic value his work. Today we use HDR to do automatically what Adams did laboriously image by image. John Pratt’s fish shop photo below is an excellent example of matching the tonal range of the displayed image with how the human eye sees the scene. The advent of cameras that shoot HDR for every shot brings back to photography an editing control that has been lost for more than 50 years. It turns out that the human mind craves novelty much more than resolution and/or accurate depiction of the photon count on a sensor. As a photographic artist, we use the photo itself as a sketch. We interpret that sketch through our own eyes, just as a painter does, and edit our photographs in whatever way is necessary to achieve our desired emotional response from the viewer. So to sum up, for documentary photographs, editing is generally limited to “corrective” editing - cropping, color or brightness correction and such. For artistic photography, editing requires a whole different mental and physical skill set, more like that of a painter. It may consist of combining images, moving elements around, altering tonal relationships and much more. There is no such thing as a universally “good” or “bad” photograph. It all depends on the use that it serves. In every case though, it should be edited to enhance its value for its intended viewer. ",
            "date": "Answered January 11, 2020",
            "views": "290",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "John Pratt",
                "href": "/profile/John-Pratt-8"
            },
            "answer_text": "Here’s a picture - it’s an image rather than a photograph because it could ONLY have been achieved in editing. The dynamic range required to shoot both the store, and the cloud formation, far exceeds anything you can capture in a single exposure.  So this was created from two images, one exposed correctly for the cloud, the other on the store. It’s called a HDR (high dynamic range) merge and it’s a great way of dealing with extraordinary situations like this.  This is another image that’s actually a composite of seven different photographs, required to get crisp focus from the front of the saw to the back of the power drill. This was taken with a 105mm macro lens where critical focus has a depth of maybe 20mm even @f16, so getting crisp images is best achieved by ‘focus stacking’ images taken at progressively different focus points. Here’s another example - notice the text on this book is crisp from front all the way to the back (this one a stack of 8 images).  So these are a few examples of relatively simple images that require complex technique to achieve in editing. There’s no way of getting the range of exposure or depth of focus you see here in a single simple image. ",
            "date": "Answered January 10, 2020",
            "views": "480",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Mark Heyer",
                    "user_href": "/profile/Mark-Heyer"
                }
            ]
        }
    ]
}