{
    "title": "How to write my first nonfiction book - Quora",
    "tags": [
        "Book Writing Advice",
        "Book Writing",
        "Writing Advice",
        "Writing"
    ],
    "response": [
        {
            "author_info": {
                "name": "Ameesha Smith-Green",
                "href": "/profile/Ameesha-Smith-Green"
            },
            "answer_text": "As a nonfiction book editor, I’ve seen that there are four key steps to write nonfiction books. Firstly, while it’s tempting to just sit down and start writing, this approach doesn’t really work for nonfiction. So to write a great nonfiction book, I recommend these key steps: 1. Choose your topic This should be something you’re interested in, otherwise writing a book will quickly become boring. It should be something you’re already knowledgeable or skilled in, otherwise you’ll give yourself a huge learning curve or the book won’t be useful. It should be something relatively specific, otherwise the book will be drowned out by the mound of other books on the topic. 2. Find your customers Rather than writing what you feel like, develop a reader persona and write for them. Consider the type of person who would read your book and what they’re like. Importantly, focus on what problems they’re encountering, what they want to overcome, and what goals they want to achieve. And make it specific, otherwise you end up speaking to nobody. 3. Make a plan When you have your topic and know what your readers want, plan the book’s title, key messages, and structure. Brainstorm the subjects you’re going to cover, then form this into an outline by thinking about the order the reader needs to learn about each subject. Bear in mind that the book should be a journey for the reader with a beginning, middle, and end. 4. Start writing Now you’re ready to start writing. To make it easier, you could break it down by writing a chapter per week or aiming to write a certain number of words per day. You might find it better to review and edit each chapter after writing to stay on track—or to review and edit the whole thing when you’ve finished the first draft. Good luck on your writing journey! ",
            "date": "Answered May 10, 2020",
            "views": "104",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Tom Corson-Knowles",
                "href": "/profile/Tom-Corson-Knowles"
            },
            "answer_text": "Here are 12 simple steps to help you efficiently write your first nonfiction book: 1. Brainstorm Book Ideas - By maintaining a list of all your best book ideas in one place, you won’t feel like you’re missing out on a new opportunity every time a new idea comes to you. 2. Market Research - Whether you’ve picked your best book idea or you’re still unsure at this point, it’s time to start with market research on your top book ideas to verify that the book you plan to write will actually be in demand. 3. Identify you book's target audience - Once you’ve identified the topic you want to write about, you can start doing research on your target audience to further narrow down what you’re going to write about and how you’re going to approach your writing. 4. Identify the problem you want to solve - Regardless of the specific topic, people read nonfiction in order to learn and grow. They want to gain new skills, solve problems, and improve their lives. Your job as a nonfiction author is simply to help them do that! 5. Pick a Bestselling Book Title - Your book title is one of the first things your potential readers will see when browsing online for an answer to their problem. That means that you should treat choosing the title as though it’s part of the writing process—because it really is! 6. Write a Book Outline - Because you’re writing specifically to help your target audience solve a problem, you need to be systematic in how you approach your book. 7. Write the First Draft - Keep on writing, following your outline and adding details to illustrate your points and make sense of everything. The more you treat writing your book like having a conversation with a friend who’s looking for advice, the easier it will be to write—and the more enjoyable it will be for your reader! 8. Add Targeted Personal Examples - When you’re writing your nonfiction book, always be sure to add relevant, targeted personal examples at major steps along the way. 9. Re-Read and Self-Edit Your Book - When you self-edit, you re-read your book as though someone else wrote it, noting anything that doesn’t make sense, places that could use more details or support, places where you drone on needlessly, and errors like incorrect facts, typos, or other mistakes. 10. Ask for Feedback from Beta Readers - Getting feedback from other people is a key part of the writing process, especially for a nonfiction book. When you’re first getting started as a writer, your best place to look for beta readers is in your personal circle. If you’re part of a writer’s group, great! 11. Work with an Editor to Revise Your Book - You can find professional editors by checking LinkedIn, writers’ forums, or using book editing services or agencies. You can also post your editing job with groups like the Editorial Freelancers Association or the Northwest Independent Editors Guild. 12. Get Your Book Published - The next step to becoming a published nonfiction author is to get your book published. These tips are excerpted from our detailed blog post on How To Write A Nonfiction Book | TCK Publishing ",
            "date": "Answered November 19, 2017",
            "views": "349",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Aaron Jerry",
                    "user_href": "/profile/Aaron-Jerry-3"
                },
                {
                    "user_id": "Dipanshu Rawal",
                    "user_href": "/profile/Dipanshu-Rawal"
                }
            ]
        }
    ]
}