{
    "title": "How to write to a fictional character - Quora",
    "tags": [
        "Fictional Characters",
        "Writing Advice"
    ],
    "response": [
        {
            "author_info": {
                "name": "Michelle Wallace",
                "href": "/profile/Michelle-Wallace-6"
            },
            "answer_text": "This is actually a very simple request. It's about what you would want to say to Harry. You asked what would be in the intro and the conclusion so I suggest a format a bit like this.Intro: Some description about yourself, why you are writing to Harry, how you learned about him (preferably as if you existed in his universe, in my opinion. Like you learned about him in the Daily Prophet or heard of him through one of his friends.)Body: How you feel about him, his choices and what he has accomplished. Some questions about him, his choices, etc. If you admire him and why. If you wish you could meet him and why. Conclusion. Re-iterate why you like (or dislike) him. What you would do together if you did meet. Remind him how you heard about him. If you have questions, I suggest asking your teacher or including the rubric if you really want us to explain. If you want us to do your homework, that's not very fair. Although, this question was interesting to me, so whatever. :PHave a nice day. Tell Harry I say 'Hi'! :D ",
            "date": "Answered December 12, 2015",
            "views": "662",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Ahmad Awan",
                    "user_href": "/profile/Ahmad-Awan-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Stan Hayward",
                "href": "/profile/Stan-Hayward-1"
            },
            "answer_text": "Here are some links         how do I write letters?  First you have some exciting news to tell himThen you tell him how it is going to affect youThen you give him some news about friends and familyThen you ask him about himself and his friendsThen you round off with some incidental news about  school/work etc.Then you ask about meeting up for a particular celebration/party/eventThen you send him best wishes, and with love/regards to mutual acquaintancesLook up letter writing on my website at www.makemoviesdb.net ",
            "date": "Answered December 13, 2015",
            "views": "13",
            "upvotes": " View 3 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Lisa Wokcik",
                    "user_href": "/profile/Lisa-Wokcik"
                },
                {
                    "user_id": "Wayne Borean",
                    "user_href": "/profile/Wayne-Borean"
                },
                {
                    "user_id": "Naman Vij",
                    "user_href": "/profile/Naman-Vij"
                }
            ]
        }
    ]
}