{
    "title": "How to learn to read, write and speak Mandarin - Quora",
    "tags": [
        "Learning Specific Languages",
        "Learning Chinese",
        "Specific Languages",
        "Mandarin Chinese (language)",
        "Chinese (language)"
    ],
    "response": [
        {
            "author_info": {
                "name": "Bella Johnson",
                "href": "/profile/Bella-Johnson-33"
            },
            "answer_text": "First, you need to know why you want to learn Mandarin. Chinese is a very difficult language, rated as a four out of four possible levels by the Foreign Language Institute at the State Department in the US. This means Chinese is one of the most difficult languages for a native English speaker to master. If you are not highly motivated from the beginning, it is going to be easier to fall behind. Fortunately, there are lots of great reasons to learn this language, which you can see below.  You need to know where you plan to use your Mandarin. If you are going to Mainland China, then getting a head start on simplified characters will be to your benefit. However, if you want to use Chinese in Taiwan, Hong Kong, Macau, or within the context of historical documents, then becoming proficient in traditional characters will be the way that you want to go. The characters are often similar, but some are so different that even native speakers in one writing system do not recognize the characters from the other writing system. Some examples below:  You need to learn the Pinyin romanization system. Foreigners and Chinese alike use this system to learn the pronunciation of the many tens of thousands of Chinese characters that comprise the Chinese language. If you want to start speaking right away, which I highly recommend, then learning Pinyin is a must. It looks intimidating at first (what is an initial? What is a final?), but I promise learning it is going to save you way more time than you spend on memorizing it in the beginning. Learning pinyin and getting the pronunciation right from the beginning is extremely important! If you don’t learn the tones correctly, you can totally change the meaning of what you are saying. See the chart below:  You need to find a native speaker who is going to be able to give you consistent and clear feedback on your speaking, writing, and grammar! To do this, you have three options: You can sign up for a Chinese class at a local college or university. Most colleges and universities these days offer courses in Mandarin Chinese. See if your local school has a class, and make sure it is taught by a native speaker. If you are learning Mandarin for business purposes, the stakes are high - and you want to make sure you are learning things correctly the first time!You can get a tutor to meet with you one-on-one. The available of a qualified tutor is highly dependent on where in the world you live. If you are in New York, LA, or San Francisco, where there are a lot of Chinese people, you should be able to find one easily. If you do not happen to live in one of these areas, however, you might have a harder time.You can get an online teacher to meet you at your leisure. The great thing about online classes is that you can take them anywhere, at any time. If you can’t make it to your face-to-face class because of a flat tire or extra hours you have to put in at the office, it’s a waste of money and time for all parties involved. However, if you are taking classes online, you can do everything using your phone or laptop as long as it has a microphone and/or a camera attached to it.I personally had good results with online classes taken in addition to Chinese coursework at my home university. I hope that this was helpful! I wish you luck on your Chinese-learning journey! ",
            "date": "Updated November 16, 2019",
            "views": "545",
            "upvotes": " View 8 Upvoters",
            "upvoters": [
                {
                    "user_id": "Kelly Grolund",
                    "user_href": "/profile/Kelly-Grolund"
                },
                {
                    "user_id": "Lauren Campbell",
                    "user_href": "/profile/Lauren-Campbell-351"
                },
                {
                    "user_id": "Alisa Young",
                    "user_href": "/profile/Alisa-Young-17"
                },
                {
                    "user_id": "Tiffany Brown",
                    "user_href": "/profile/Tiffany-Brown-346"
                },
                {
                    "user_id": "Brenda Clinton",
                    "user_href": "/profile/Brenda-Clinton-2"
                },
                {
                    "user_id": "Daisy Zhang",
                    "user_href": "/profile/Daisy-Zhang-97"
                },
                {
                    "user_id": "Odile Chou",
                    "user_href": "/profile/Odile-Chou"
                },
                {
                    "user_id": "Becki Lee",
                    "user_href": "/profile/Becki-Lee-4"
                }
            ]
        },
        {
            "author_info": {
                "name": "Sam Karthik",
                "href": "/profile/Sam-Karthik-7"
            },
            "answer_text": "It depends on your learning goals and how much time you are willing to spend to learn Chinese. The more smart efforts, the better results.  Generally, you can start with learning characters and radicals. Do get familiar with the pinyin as well. If you can, try to move to China, at least for a few years. In the long run, try to read Mandarin Chinese reading practice books. The more books you read, the more characters you will be able to understand. After reading a few beginners books, you will be more and more comfortable with the grammar structures. Fortunately, Mandarin grammar is simpler than the English grammar. If you are a looking for reading practice books, here are some related suggestions: Mandarin Level 1 reading practice books- How to Practice Fast Reading Chinese Books?How to Learn Fast Reading Mandarin Chinese Characters?",
            "date": "Answered December 2, 2019",
            "views": "434",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Hunter Hoffman",
                    "user_href": "/profile/Hunter-Hoffman-26"
                }
            ]
        }
    ]
}