{
    "title": "How to write a 100,000 word book - Quora",
    "tags": [
        "Book Writing Advice",
        "Book Writing",
        "Creative Writing",
        "Writing Advice",
        "Writing"
    ],
    "response": [
        {
            "author_info": {
                "name": "Rachel Caine",
                "href": "/profile/Rachel-Caine-3"
            },
            "answer_text": "You don’t worry about the big number. Break it into small, achievable steps. I generally go by word count, so I set a target for maybe 2,000 words a day (which is very achievable for me, most days). You can also just tell yourself “I’m just going to write this chapter.” Or, “Just this scene.” Maybe just a paragraph! Anything you do is forward motion. Some people are plotters (meaning, they like to have the entire plot laid out in detail before they start) and some are “pantsers” writing by the seat of the pants and following inspiration. I’m a “planner,” which I feel like is midway between. I have a relatively light outline that gives me freedom to explore inspirations when I hit them. Think of it this way: if you do 1,000 words a day, you will finish in … 100 days. That’s just about 3 months. Isn’t that amazing? Now, that doesn’t mean you’re done. Just that you’ve completed your rough draft. For the next couple of months you can work on really editing and rethinking things to get the book where it needs to be. Then get feedback and external opinions. Then do it again. It’s totally achievable if you break it down and follow your process. And once you do it once … you know for a fact you can do it again. ",
            "date": "Answered April 2, 2020",
            "views": "127",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Raymond van Over",
                    "user_href": "/profile/Raymond-van-Over"
                },
                {
                    "user_id": "John Alan",
                    "user_href": "/profile/John-Alan-6"
                },
                {
                    "user_id": "Imoni Rose",
                    "user_href": "/profile/Imoni-Rose"
                }
            ]
        },
        {
            "author_info": {
                "name": "Beth Hitchman",
                "href": "/profile/Beth-Hitchman"
            },
            "answer_text": "I’m currently writing a fantasy novel, which will be around this word count. I have just hit the 20k words mark. I think my best advice is to just start writing. Once you’ve begun you can get a feel for how realistic that word count is or how long it is likely to take you. I started this project by allowing myself a one-year time limit to get the book finished. To be clear, 50 days of writing 2000 words lets you hit this goal. In a short amount of time. So I’ve given myself a time period where I can write less than 2000 words a week and still make my deadline. Another way to hit the word count is to find writers that you can clock your word count in with. Make use of what is already available. If you participate in NaNoWriMo to pump out your first draft you’re already halfway there! If you know how you work best make sure that you implement a system that compliments your working style. I work best to deadlines, so I put a deadline on my work. I work best with others, so I have writing groups that I’m a part of. If you’re not sure about your writing method yet just try out a whole bunch of different techniques. This is the time to learn and make mistakes, perfection isn’t necessary until the final draft. I can’t wait to see you on the bookshelf! ",
            "date": "Answered April 6, 2020",
            "views": "83",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Imoni Rose",
                    "user_href": "/profile/Imoni-Rose"
                }
            ]
        }
    ]
}