{
    "title": "How would you define yourself through a poem? - Quora",
    "tags": [
        "Personal Definitions",
        "Identities",
        "Poems",
        "Poetry",
        "Life and Living"
    ],
    "response": [
        {
            "author_info": {
                "name": "Amy Fiscelli",
                "href": "/profile/Amy-Fiscelli"
            },
            "answer_text": "How else but by the impossible poem? Gerard Nolst Trenité - The Chaos (1922) Dearest creature in creation Studying English pronunciation, I will teach you in my verse Sounds like corpse, corps, horse and worse. I will keep you, Susy, busy, Make your head with heat grow dizzy; Tear in eye, your dress you'll tear; Queer, fair seer, hear my prayer. Pray, console your loving poet, Make my coat look new, dear, sew it! Just compare heart, hear and heard, Dies and diet, lord and word. Sword and sward, retain and Britain (Mind the latter how it's written). Made has not the sound of bade, Say-said, pay-paid, laid but plaid. Now I surely will not plague you With such words as vague and ague, But be careful how you speak, Say: gush, bush, steak, streak, break, bleak , Previous, precious, fuchsia, via Recipe, pipe, studding-sail, choir; Woven, oven, how and low, Script, receipt, shoe, poem, toe. Say, expecting fraud and trickery: Daughter, laughter and Terpsichore, Branch, ranch, measles, topsails, aisles, Missiles, similes, reviles. Wholly, holly, signal, signing, Same, examining, but mining, Scholar, vicar, and cigar, Solar, mica, war and far. From \"desire\": desirable-admirable from \"admire\", Lumber, plumber, bier, but brier, Topsham, brougham, renown, but known, Knowledge, done, lone, gone, none, tone, One, anemone, Balmoral, Kitchen, lichen, laundry, laurel. Gertrude, German, wind and wind, Beau, kind, kindred, queue, mankind, Tortoise, turquoise, chamois-leather, Reading, Reading, heathen, heather. This phonetic labyrinth Gives moss, gross, brook, brooch, ninth, plinth. Have you ever yet endeavoured To pronounce revered and severed, Demon, lemon, ghoul, foul, soul, Peter, petrol and patrol? Billet does not end like ballet; Bouquet, wallet, mallet, chalet. Blood and flood are not like food, Nor is mould like should and would. Banquet is not nearly parquet, Which exactly rhymes with khaki. Discount, viscount, load and broad, Toward, to forward, to reward, Ricocheted and crocheting, croquet? Right! Your pronunciation's OK. Rounded, wounded, grieve and sieve, Friend and fiend, alive and live. Is your r correct in higher? Keats asserts it rhymes Thalia. Hugh, but hug, and hood, but hoot, Buoyant, minute, but minute. Say abscission with precision, Now: position and transition; Would it tally with my rhyme If I mentioned paradigm? Twopence, threepence, tease are easy, But cease, crease, grease and greasy? Cornice, nice, valise, revise, Rabies, but lullabies. Of such puzzling words as nauseous, Rhyming well with cautious, tortious, You'll envelop lists, I hope, In a linen envelope. Would you like some more? You'll have it! Affidavit, David, davit. To abjure, to perjure. Sheik Does not sound like Czech but ache. Liberty, library, heave and heaven, Rachel, loch, moustache, eleven. We say hallowed, but allowed, People, leopard, towed but vowed. Mark the difference, moreover, Between mover, plover, Dover. Leeches, breeches, wise, precise, Chalice, but police and lice, Camel, constable, unstable, Principle, disciple, label. Petal, penal, and canal, Wait, surmise, plait, promise, pal, Suit, suite, ruin. Circuit, conduit Rhyme with \"shirk it\" and \"beyond it\", But it is not hard to tell Why it's pall, mall, but Pall Mall. Muscle, muscular, gaol, iron, Timber, climber, bullion, lion, Worm and storm, chaise, chaos, chair, Senator, spectator, mayor, Ivy, privy, famous; clamour Has the a of drachm and hammer. Pussy, hussy and possess, Desert, but desert, address. Golf, wolf, countenance, lieutenants Hoist in lieu of flags left pennants. Courier, courtier, tomb, bomb, comb, Cow, but Cowper, some and home. \"Solder, soldier! Blood is thicker\", Quoth he, \"than liqueur or liquor\", Making, it is sad but true, In bravado, much ado. Stranger does not rhyme with anger, Neither does devour with clangour. Pilot, pivot, gaunt, but aunt, Font, front, wont, want, grand and grant. Arsenic, specific, scenic, Relic, rhetoric, hygienic. Gooseberry, goose, and close, but close, Paradise, rise, rose, and dose. Say inveigh, neigh, but inveigle, Make the latter rhyme with eagle. Mind! Meandering but mean, Valentine and magazine. And I bet you, dear, a penny, You say mani-(fold) like many, Which is wrong. Say rapier, pier, Tier (one who ties), but tier. Arch, archangel; pray, does erring Rhyme with herring or with stirring? Prison, bison, treasure trove, Treason, hover, cover, cove, Perseverance, severance. Ribald Rhymes (but piebald doesn't) with nibbled. Phaeton, paean, gnat, ghat, gnaw, Lien, psychic, shone, bone, pshaw. Don't be down, my own, but rough it, And distinguish buffet, buffet; Brood, stood, roof, rook, school, wool, boon, Worcester, Boleyn, to impugn. Say in sounds correct and sterling Hearse, hear, hearken, year and yearling. Evil, devil, mezzotint, Mind the z! (A gentle hint.) Now you need not pay attention To such sounds as I don't mention, Sounds like pores, pause, pours and paws, Rhyming with the pronoun yours; Nor are proper names included, Though I often heard, as you did, Funny rhymes to unicorn, Yes, you know them, Vaughan and Strachan. No, my maiden, coy and comely, I don't want to speak of Cholmondeley. No. Yet Froude compared with proud Is no better than McLeod. But mind trivial and vial, Tripod, menial, denial, Troll and trolley, realm and ream, Schedule, mischief, schism, and scheme. Argil, gill, Argyll, gill. Surely May be made to rhyme with Raleigh, But you're not supposed to say Piquet rhymes with sobriquet. Had this invalid invalid Worthless documents? How pallid, How uncouth he, couchant, looked, When for Portsmouth I had booked! Zeus, Thebes, Thales, Aphrodite, Paramour, enamoured, flighty, Episodes, antipodes, Acquiesce, and obsequies. Please don't monkey with the geyser, Don't peel 'taters with my razor, Rather say in accents pure: Nature, stature and mature. Pious, impious, limb, climb, glumly, Worsted, worsted, crumbly, dumbly, Conquer, conquest, vase, phase, fan, Wan, sedan and artisan. The th will surely trouble you More than r , ch or w . Say then these phonetic gems: Thomas, thyme, Theresa, Thames. Thompson, Chatham, Waltham, Streatham, There are more but I forget 'em- Wait! I've got it: Anthony, Lighten your anxiety. The archaic word albeit Does not rhyme with eight-you see it; With and forthwith, one has voice, One has not, you make your choice. Shoes, goes, does *. Now first say: finger; Then say: singer, ginger, linger. Real, zeal, mauve, gauze and gauge, Marriage, foliage, mirage, age, Hero, heron, query, very, Parry, tarry fury, bury, Dost, lost, post, and doth, cloth, loth, Job, Job, blossom, bosom, oath. Faugh, oppugnant, keen oppugners, Bowing, bowing, banjo-tuners Holm you know, but noes, canoes, Puisne, truism, use, to use? Though the difference seems little, We say actual, but victual, Seat, sweat, chaste, caste, Leigh, eight, height, Put, nut, granite, and unite. Reefer does not rhyme with deafer, Feoffer does, and zephyr, heifer. Dull, bull, Geoffrey, George, ate, late, Hint, pint, senate, but sedate. Gaelic, Arabic, pacific, Science, conscience, scientific; Tour, but our, dour, succour, four, Gas, alas, and Arkansas. Say manoeuvre, yacht and vomit, Next omit, which differs from it Bona fide, alibi Gyrate, dowry and awry. Sea, idea, guinea, area, Psalm, Maria, but malaria. Youth, south, southern, cleanse and clean, Doctrine, turpentine, marine. Compare alien with Italian, Dandelion with battalion, Rally with ally; yea, ye, Eye, I, ay, aye, whey, key, quay! Say aver, but ever, fever, Neither, leisure, skein, receiver. Never guess-it is not safe, We say calves, valves, half, but Ralf. Starry, granary, canary, Crevice, but device, and eyrie, Face, but preface, then grimace, Phlegm, phlegmatic, ass, glass, bass. Bass, large, target, gin, give, verging, Ought, oust, joust, and scour, but scourging; Ear, but earn; and ere and tear Do not rhyme with here but heir. Mind the o of off and often Which may be pronounced as orphan, With the sound of saw and sauce; Also soft, lost, cloth and cross. Pudding, puddle, putting. Putting? Yes: at golf it rhymes with shutting. Respite, spite, consent, resent. Liable, but Parliament. Seven is right, but so is even, Hyphen, roughen, nephew, Stephen, Monkey, donkey, clerk and jerk, Asp, grasp, wasp, demesne, cork, work. A of valour, vapid vapour, S of news (compare newspaper), G of gibbet, gibbon, gist, I of antichrist and grist, Differ like diverse and divers, Rivers, strivers, shivers, fivers. Once, but nonce, toll, doll, but roll, Polish, Polish, poll and poll. Pronunciation-think of Psyche!- Is a paling, stout and spiky. Won't it make you lose your wits Writing groats and saying \"grits\"? It's a dark abyss or tunnel Strewn with stones like rowlock, gunwale, Islington, and Isle of Wight, Housewife, verdict and indict. Don't you think so, reader, rather, Saying lather, bather, father? Finally, which rhymes with enough, Though, through, bough, cough, hough, sough, tough?? Hiccough has the sound of sup... My advice is: GIVE IT UP! ",
            "date": "Answered March 15, 2020",
            "views": "347",
            "upvotes": " View 2 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Tony Day",
                    "user_href": "/profile/Tony-Day-52"
                },
                {
                    "user_id": "Enosh Collins",
                    "user_href": "/profile/Enosh-Collins"
                }
            ]
        },
        {
            "author_info": {
                "name": "Hannatu Sa'eed",
                "href": "/profile/Hannatu-Saeed"
            },
            "answer_text": "I like this question. I wrote this poem about and for myself. This is the way I see me: A Kobo for Your Thoughts I’ve often wonderedLooking at youWhat goes on in your pretty little head I’ve often caught youSinging to yourselfWhy are your songs only for you? I’ve often thought to myself:“What makes her so happy?”I believe the answer is there in your eyes But I’ve looked deep into themOnly to find me simply drowningDeeper and deeper into pools of sparkle I’ve sometimes asked myself:“What can take the smiles away?”Yet hope never to find out I ever hopeTo enchant you tooDo tell the secret of your peace Poets are usually more inspired by others and write more about others than themselves. It is certainly easier and more fun. Introspection can sometimes prove a very difficult task. So it is always interesting to find a piece of poetry written by the poet about themself. ",
            "date": "Updated March 22, 2020",
            "views": "375",
            "upvotes": " View 9 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Evelyn Hernandez",
                    "user_href": "/profile/Evelyn-Hernandez-297"
                },
                {
                    "user_id": "Ashley Stephens",
                    "user_href": "/profile/Ashley-Stephens-173"
                },
                {
                    "user_id": "Amy Mendoza",
                    "user_href": "/profile/Amy-Mendoza-55"
                },
                {
                    "user_id": "Sanjana",
                    "user_href": "/profile/Sanjana-210"
                },
                {
                    "user_id": "Anita Onah",
                    "user_href": "/profile/Anita-Onah"
                },
                {
                    "user_id": "Amir Afiq",
                    "user_href": "/profile/Amir-Afiq-6"
                },
                {
                    "user_id": "Ekta",
                    "user_href": "/profile/Ekta-189"
                },
                {
                    "user_id": "Ashutosh Swaraj",
                    "user_href": "/profile/Ashutosh-Swaraj"
                },
                {
                    "user_id": "Khush Bakht Aaliya",
                    "user_href": "/profile/Khush-Bakht-Aaliya"
                }
            ]
        }
    ]
}