{
    "title": "How would Percy react if Annabeth died? I’m writing a fan fiction. - Quora",
    "tags": [
        "Annabeth Chase (Percy Jackson character)",
        "Percy Jackson (fictional character)"
    ],
    "response": [
        {
            "author_info": {
                "name": "Sage Peters",
                "href": "/profile/Sage-Peters-7"
            },
            "answer_text": "He would be inconsolable. We know that his fatal flaw is how much he cares about his loved ones, his loyalty, and if someone that close to him were to die he would be overcome with grief. But I don’t think he would sit around and grieve. If she was murdered by an enemy, automatic step one: seek vengeance. Remember how hard Percy fought in the first book to rescue his mother? That was when he was clueless and young, didn’t know much about the mythical world or his own powers. But the Percy we know now, the one from HoO, would be much faster and much more cruel with his mission. He would most likely seek vengeance on his own, and that fury would fuel his powers and make him capable of things he may not normally be capable of. He would become ruthless, In my opinion, and here’s why. Remember in House if Hades, when Percy was controlling poison to fight Akhlys, and Annabeth was frightened by Percy’s cruelty and dark look? Annabeth had to snap Percy out of that, but without Annabeth there to bring Percy back, he could go over the edge. If this were a monster or a human enemy, he would be quick and merciless. After that, he would probably feel quite empty, and probably become depressed. If she was accidentally killed by someone, like maybe someone on the Argo II being reckless, I’m not sure what he would do. He would for sure burst out at them in anger, but even if he wanted to kill whoever it was I’m sure others around him would stop him. He would most likely cut them out of his life, and possibly hold a grudge forever, though he might forgive. He did forgive Luke for being responsible for the deaths of many, including Beckendorf, however he has a very different relationship with Annabeth than with others who died thanks to Luke. So he may choose not to forgive Annabeth’s killer in this case. He would probably spend a lot of time after that feeling angry and empty. If she died in an accident that wasn’t necessarily someone’s fault, like from falling into Tartarus (yah that was Arachne’s fault but different circumstances from something like a cold blooded stabbing, because it’s more preventable) than he would feel guilty. He would feel like he should have done more, if only this and if only that. He would become depressed and blame himself for Annabeths death, and it would most likely take him quite a while to forgive himself. ",
            "date": "Answered June 27, 2020",
            "views": "323",
            "upvotes": " View 2 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Alejandro Gans",
                    "user_href": "/profile/Alejandro-Gans"
                },
                {
                    "user_id": "Dank Hank",
                    "user_href": "/profile/Dank-Hank-5"
                }
            ]
        },
        {
            "author_info": {
                "name": "Sarah Stone",
                "href": "/profile/Sarah-Stone-293"
            },
            "answer_text": "Do you recall that time when Percy was being all dark and scary and shit in House Of Hades. Imagine that. But angry. Sad. Broken. Lost. Mad. Angry. He’d be unstoppable as the most powerful Demigod alive. Jason wouldn’t be able to do shit. Nico wouldn’t. None of them would. He’d be released from his barriers of self-control and fear and love and friends. He’d see nothing. He’d be nothing. He’d be anger and darkness and despair and death and destruction. He would turn that rage against whatever killed Annabeth and he’d decimate it. Utterly destroy it until it was less than particles in the air. Less than existence itself. He’d bring the world to its knees before he’d stop. He’d destroy everything and everyone because Annabeth is everything. Because now he has nothing. Nothing. So he is not good. And not loyal. And not charming. And not Percy. So he is just destruction. Complete and utter annihilation. - I’m not sure the world can survive Percy if he turns on it. I’m not sure anything can. ",
            "date": "Answered October 19, 2018",
            "views": "3",
            "upvotes": " View 50 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Saanvi Thapar",
                    "user_href": "/profile/Saanvi-Thapar-1"
                },
                {
                    "user_id": "Alexander Hebrok",
                    "user_href": "/profile/Alexander-Hebrok"
                },
                {
                    "user_id": "Charline Thom",
                    "user_href": "/profile/Charline-Thom"
                },
                {
                    "user_id": "Anna Lindstrom",
                    "user_href": "/profile/Anna-Lindstrom-7"
                },
                {
                    "user_id": "Aoife Ryan",
                    "user_href": "/profile/Aoife-Ryan-55"
                },
                {
                    "user_id": "Alejandro Gans",
                    "user_href": "/profile/Alejandro-Gans"
                },
                {
                    "user_id": "Apoorva Kalidindi",
                    "user_href": "/profile/Apoorva-Kalidindi"
                },
                {
                    "user_id": "Anuradha Das",
                    "user_href": "/profile/Anuradha-Das-121"
                },
                {
                    "user_id": "Starr Amarah",
                    "user_href": "/profile/Starr-Amarah"
                },
                {
                    "user_id": "Willo Collins",
                    "user_href": "/profile/Willo-Collins-1"
                }
            ]
        }
    ]
}