{
    "title": "How to write a letter to a girlfriend to get rid of her - Quora",
    "tags": [],
    "response": [
        {
            "author_info": {
                "name": "Doug Simpson",
                "href": "/profile/Doug-Simpson-62"
            },
            "answer_text": "I’ve had a few long term relationships over the years and a few not-so-long term ones as well. Relationships usually start out the same way - everything is sparkly and shiny and new and most of all, easy. They often end the same way- badly, with one person walking away feeling finally free and relieved and one left behind in tears, angry, alone and shattered. You’ve decided you want to be free… for whatever reason… fine. There’s nothing inherently “wrong” about not wanting to keep seeing someone. It happens. Things change. I’ve been on both sides of this situation- I’ve been the “breaker” and the “brakee” and it’s never a pleasant experience. But I’m also old school. I feel very strongly that if you were there for the sparkly and shiny when it was all easy, you need to be there when it’s none of the above. You need to show up, man up and end it with your soon-to-be ex-significant other. Your also going to have to listen to what they have to say. It probably won’t be very pretty. It certainly won’t be any fun, but you owe that to them. You’re getting what you want. They should at least get to tell you how you’ve made them feel. You’re not there to argue. You’re not there to quibble over the details. You’re there to say good-bye and this is the price you pay to get what you want… Every time I’ve parted ways with a lover in my life, it’s been face to face. If you’ve been in an intimate relationship with someone and that relationship is going to end - especially when it’s going to end because you want it to - you owe it to that individual to do it in person. It’s about respect. ",
            "date": "Answered May 12, 2020",
            "views": "40",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Adrian Crowe",
                "href": "/profile/Adrian-Crowe-1"
            },
            "answer_text": "Dear Mary I am no longer interested in pursuing a relationship with you. Unfortunately, however, I lack the courage to face you and tell you face to face. You will be aware that this is actually a positive: that I am now demonstrating that I am too immature to be worthy of your attentions. You can undoubtedly look forward to a better life with someone else that you could have hoped for with me. Ideally I would wish you well for the future, but clearly I am the sort of person that will for the rest of life carp about your good fortune and how you ruined my life. John ",
            "date": "Answered May 12, 2020",
            "views": "18",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Teri Kamaunu",
                    "user_href": "/profile/Teri-Kamaunu-1"
                }
            ]
        }
    ]
}