{
    "title": "How would you summarize your life? - Quora",
    "tags": [
        "Summarization",
        "Summaries"
    ],
    "response": [
        {
            "author_info": {
                "name": "Abhishek S",
                "href": "/profile/Abhishek-S-380"
            },
            "answer_text": "Life can be summarized as a journey. A journey from ignorance to enlightenment. Some people believe that the journey of life begins from birth and ends at death. Some people believe that its an endless journey starting from birth and ends at the end of universe. Reason to this is the the very next moment after the death of a person , he starts his journey again as a different person. ( via soul or whatever ).It is also believed that some of the habits, strengths and weaknesses of a person is carried to his next life as well. That is why we find some extraordinary people who seem to learn , understand and excel in somethings like no one does even without anybody’s help. But till date we haven’t seen a case where someone is born holding a cheque in his hand, a key for Audi car or a golden spoon etc. But we can carry something else inside us as a gift that should be the true purpose of our life. Small example : The great king Alexander requested his hands to be left outside his coffin to let people know that the man who won the world went with empty hands. I think, we should visualize life as an opportunity to learn and not to learn for an opportunity. ",
            "date": "Answered November 3, 2017",
            "views": "11",
            "upvotes": " View 4 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Misuku QiZhou",
                    "user_href": "/profile/Misuku-QiZhou"
                },
                {
                    "user_id": "John Joshua Castro",
                    "user_href": "/profile/John-Joshua-Castro-2"
                },
                {
                    "user_id": "Himanshi Jangra (हिमांशी जांगड़ा)",
                    "user_href": "/profile/Himanshi-Jangra-हिमांशी-जांगड़ा"
                },
                {
                    "user_id": "Mahitha Varshini",
                    "user_href": "/profile/Mahitha-Varshini"
                }
            ]
        },
        {
            "author_info": {
                "name": "Swetha Dhanabalan",
                "href": "/profile/Swetha-Dhanabalan"
            },
            "answer_text": "At this point , I ll just use one word to summarize what I feel about my life its Contentment. It's just at this point I've realized worrying doesn't really change anything and fearing something is not going to make it better so I ve just learnt to sit back and enjoy my life as it is with all its flaws and imperfections. ",
            "date": "Answered May 4, 2019",
            "views": "189",
            "upvotes": " Answer requested by Abhinav Kumar"
        }
    ]
}