{
    "title": "How often should you use first names versus pronouns when writing fiction in the third person? - Quora",
    "tags": [
        "Third Person Pronouns",
        "Pronouns",
        "Fiction Writing",
        "Grammar"
    ],
    "response": [
        {
            "author_info": {
                "name": "Brynn Emond",
                "href": "/profile/Brynn-Emond"
            },
            "answer_text": "Somebody out there could probably figure out the optimal ratio but I think it’s more one of those things you just have to feel out for yourself. Which I know is unhelpful. Otherwise I guess you wouldn’t be asking this question. I recently started writing this fantasy thing and for the first several pages I never used the character’s name at all, not once. I referred to him only as “he”. That was intentional, I wanted to introduce his name only when someone else asked it, and give the reader the idea that maybe he was lying about his name, in the process. The story is told in 3rd person and the point of it is that it doesn’t matter who he is or who he says he is, because it matters more that we get the feeling of who he is through his actions and his thoughts and all that. I generally think that fantasy relies too heavily on place names and people’s names (especially Game of Thrones, where you end up not remembering who a single secondary character is because of all the names thrown at your brain constantly). I wanted to write a story where names don’t really matter. If you write in 1st person, obviously the balancing of pronoun/name becomes somewhat irrelevant because you’re just using “I”. You could consider switching to first person if you’re having a lot of difficulty. Another way to avoid the overuse of pronouns/first names (which does become awkward after a while) is to write less action sentences (as in, “Then he got up and grabbed a drink of water”) and write more descriptive sentences, as in “The fields rolled away brown and empty under the cold sky”, or whatever. Then you can go on to ruminate more on the surroundings or go off on tangents. When I’m writing a “passive” scene I like to drift away from the character’s thoughts or actions and do a little tangent about how the flowers that grow on the brown hills only come out in late spring or something pretentious like that. This will break up your story and make it more than just action and dialogue leading endlessly into one another. Hopefully that is of some use to you. Good luck! ",
            "date": "Answered April 18, 2017",
            "views": "3",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Dansby Parker",
                    "user_href": "/profile/Dansby-Parker"
                }
            ]
        },
        {
            "author_info": {
                "name": "Franziska Kilchmann",
                "href": "/profile/Franziska-Kilchmann"
            },
            "answer_text": "I usually try to mix names, pronouns and descriptions. I definitely use pronouns and names the most, but if I noticed that I’ve mentioned a name way to many times in the last paragraph, I put in descriptions. It really depends on what your story is about, but I usually put in a: a) description of their appearance Examples: The brunette, the tall boy, the blonde (If the ages of your character are clear to the Reader, I sometimes also use ‘the older/the younger’) b) description of their profession Examples: The stylist, the bartender, the student c) description of their race (because I mostly write fantasy stories) Examples: the angel, the demon, the human ",
            "date": "Answered May 14, 2017",
            "views": "13",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Kevin Cooke",
                "href": "/profile/Kevin-Cooke-7"
            },
            "answer_text": "I will usually throw in a name after every three pronouns or so. It always depends on the narrative. There is an unnatural feeling to the narrative when you just bounce back and forth between he, she, they, etc. At some point, a name anchors a character and erases ambiguity. ",
            "date": "Answered April 18, 2017",
            "views": "514",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Dansby Parker",
                    "user_href": "/profile/Dansby-Parker"
                }
            ]
        },
        {
            "author_info": {
                "name": "Harvey Ardman",
                "href": "/profile/Harvey-Ardman-1"
            },
            "answer_text": "Do whatever is necessary to not sound conspicuously repetitive. You want your reader not to notice what you’re doing with the names, or to take it as absolutely natural. If you call attention to your technique, you will instantly lose the reader. ",
            "date": "Answered April 18, 2017",
            "views": "234",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Mark Kappe",
                "href": "/profile/Mark-Kappe"
            },
            "answer_text": "There are creative ways to do this. Incorporate “he said” into the action… “…he said, holding the wine glass up to the light.”2. Modify the verb. “He replied”, “He answered.” 3. Describe the character another way. “The blonde disagreed” or “the fisherman noted.” 4. Simply present the dialogue without any attribution. She shook he head. “No, I can’t.” ",
            "date": "Answered April 18, 2017",
            "views": "14",
            "upvotes": "0"
        }
    ]
}