{
    "title": "How to increase your confidence without boosting your ego - Quora",
    "tags": [
        "Boosting Your Ego",
        "Ego",
        "Improving Self-Confidence",
        "Self-Esteem",
        "Self-Confidence",
        "Understanding Self-Improvement",
        "Self-Improvement",
        "Understanding Human Behavior"
    ],
    "response": [
        {
            "author_info": {
                "name": "Ravindra Negi",
                "href": "/profile/Ravindra-Negi-2"
            },
            "answer_text": "The thing about confidence is that you feel it in yourself because you are good at something. Take the example of driving. A driver with lots of experience has more confidence in his driving skill. When you get confidence due to skill level with the amount of practice and also eliminating the mistakes then you also perform well. Just feeling confident without knowing anything does not benefit anyone. So first always work on ability because that will never go. Sit in a comfortable position and gently close your eyes. Bring your focus on your breath. Notice your breathing as you inhale and exhale. Now imagine someone that you feel is confident someone you know your friend or some movie actor or sports person you like it can be anyone. When you see them you can feel that they are confident. See that person in your minds eye. See how they walk how they talk the tone of their voice how they move their hands and their body language. Thats right. And now imagine that person is unconditionally gifting you that confidence in the form of an energy ball. Imagine them in front of you gifting that confidence to you in the form of an energy ball. See the color of this confidence energy ball. And now imagine this energy ball entering your body from your right hand and feel that energy entering your body through your right hand thats right and now imagine that colorful energy spread all over your body feel that energy of confidence spreading in all parts of your body feel that confidence all over your body and now make that feeling more intense thats right and now imagine and now see yourself in the future situation and you are very confident and very positive and you are behaving with high level of self confidence and see the situation happening the way you want it to happen. Feel that wonderful feeling right now... thats right and now slowly open your eyes and look around you and notice the time. Now think about that future situation again and as you think about that future situation you will find that you are feeling very good and confident about it. Very positive. So friends just a simple visualization technique for confidence thank you. NLP For Super Confidence ",
            "date": "Answered May 11, 2020",
            "views": "249",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Andrei Palskoi",
                "href": "/profile/Andrei-Palskoi-1"
            },
            "answer_text": "I struggled with confidence issues for very long time in my life, and you know one interesting thing that I have discovered? This precise belief in ego, or self, as an independent real entify is the biggest threat to confidence among them all. How so? To understand it, first you need to be clear on what confidence is mostly about. It is not about confidence that things will go as you predict, because frankly there is no way of knowing it for sure, and your brain knows it. The confidence is about your ability to understand the situation clearly and know what to do. Do you have enough knowledge to handle it to the best of your ability, or will you wander in darkness, not knowing what to do? That's the main question behind the feeling of confidence. If you know the situation well, you will feel confident. If you don't, you will not feel confident. It's very simple. Now we can get back to the ego/self. Have you ever seen it directly? How much do you know about it, apart from indirect conclusions drawn from observations of thoughts, actions and whatever other people happen to say about you? Not much, admit it. All you know about “yourself” is not facts, it's educated guesses at best. You strongly believe that your “ego” exists, but when it comes to specific knowledge, you are in the darkness… This darkness is what kills your confidence. Your ego is supposedly one of the biggest parts of each situation you get into, yet you know so little about it. Not much of a confidence boost, to be sure. If you watch your life carefully, you may notice that whenever a thought about yourself pops up in some situation, your confidence takes a hit. Your brain hits a soft patch in thinking and hesitates. And it should, because it is time for it to stop and check - what exactly this “ego” is, apart from being an abstract concept? Is it real? Can it be found in the actual experience in any other form that thoughts about it? If you drop the belief in ego (not the ego itself as it never existed in the first place), a lot of confidence issues will disappear with it. I still feel lack of confidence in situations that I am not familiar with, and it's a good thing - that's exactly the indicator I need in order to avoid making stupid mistakes in them. But the constant worry about “me” not being who I thought I was is gone. And it feels awesome. TLDR: The less you think about yourself, the more confident you will feel. ",
            "date": "Answered April 27, 2018",
            "views": "25",
            "upvotes": " View 25 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Jan Mansu",
                    "user_href": "/profile/Jan-Mansu"
                },
                {
                    "user_id": "Pyry Nieminen",
                    "user_href": "/profile/Pyry-Nieminen-2"
                },
                {
                    "user_id": "Sanjeev Singh",
                    "user_href": "/profile/Sanjeev-Singh-2556"
                },
                {
                    "user_id": "David Sanford",
                    "user_href": "/profile/David-Sanford-27"
                },
                {
                    "user_id": "Marie Pedersen",
                    "user_href": "/profile/Marie-Pedersen-7"
                },
                {
                    "user_id": "Tom Slijkerman",
                    "user_href": "/profile/Tom-Slijkerman"
                },
                {
                    "user_id": "Justine Jiang",
                    "user_href": "/profile/Justine-Jiang"
                },
                {
                    "user_id": "Bhaskarjyoti Sarma",
                    "user_href": "/profile/Bhaskarjyoti-Sarma-2"
                },
                {
                    "user_id": "Adrian Renaud",
                    "user_href": "/profile/Adrian-Renaud"
                },
                {
                    "user_id": "Nimayi Dixit",
                    "user_href": "/profile/Nimayi-Dixit-1"
                }
            ]
        }
    ]
}