{
    "title": "How to stop my kids from falling on the stairs - Quora",
    "tags": [
        "Stair Climbing",
        "Falling",
        "Stairs",
        "Parenting Advice",
        "Accidents and Injuries",
        "Child Development",
        "Children",
        "Parenting",
        "Psychology of Everyday Life"
    ],
    "response": [
        {
            "author_info": {
                "name": "Susan Mullin",
                "href": "/profile/Susan-Mullin-4"
            },
            "answer_text": "Depends on the age of the kids, the material and steepness of the stairs. Do you have hand rails, are the stairs carpeted, wood or concrete? Outside and inside stairs have different kinds of no-slip tred that can be installed. Small children may need to have baby gates at top and bottom so they only practice with an adult to determine if/when it is safe for them unsupervised. My kids traversed inside curved bare wood steps from ages 6 months to about a year when they walked upright. We turned them around backwards on the landing at the top of the stairs on hands and knees. Then helped the baby reach with one foot till it touched a step, then shift to the other foot to reach another step, repeating till reaching another landing. After a couple or so practices, they could go down steps on their tummies faster than I could walk them. When they walked, they went sideways, one step at a time. Neither ever fell on the wood steps but were not allowed to do the steeper concrete basement steps alone before we moved.Door to those steps was kept locked. ",
            "date": "Answered January 22, 2020",
            "views": "58",
            "upvotes": " Answer requested by Swayam Tiwari",
            "upvoters": [
                {
                    "user_id": "Amrit Tandi",
                    "user_href": "/profile/Amrit-Tandi"
                }
            ]
        },
        {
            "author_info": {
                "name": "Destiny Neuhaus",
                "href": "/profile/Destiny-Neuhaus-1"
            },
            "answer_text": "I’m not certain how old your kids are but if they are younger put up a gate. If they are older and look into what the problem may be with the stairs. Are the stairs so narrow that their feet won’t fit on them? I know that my 16-year-old daughter actually started to fall down my parents stairs three times on one trip down and when I looked at the steps the steps were extremely narrow. If it was actually my decision I would put in wider steps. ",
            "date": "Answered January 22, 2020",
            "views": "66",
            "upvotes": " Answer requested by Swayam Tiwari"
        },
        {
            "author_info": {
                "name": "Jennifer Soria",
                "href": "/profile/Jennifer-Soria-12"
            },
            "answer_text": "Buy a baby gate for each end. Install one at the top and one at the bottom. ",
            "date": "Answered January 22, 2020",
            "views": "27",
            "upvotes": " View 1 Upvoter"
        },
        {
            "author_info": {
                "name": "Amrit Tandi",
                "href": "/profile/Amrit-Tandi"
            },
            "answer_text": "You have to get a gate, for the top, and the bottom of the stairs. I know it's more work.✔ That's what parenting is all a bout. Caring for your child.👍💯 😁 ",
            "date": "Answered January 22, 2020",
            "views": "19",
            "upvotes": " Answer requested by Swayam Tiwari"
        }
    ]
}