{
    "title": "How to plagiarise my research without Turnitin catching it - Quora",
    "tags": [
        "Turnitin",
        "Plagiarism Detectors",
        "Academic Plagiarism and Cheating",
        "Plagiarism",
        "Academia",
        "Academic Papers",
        "Academic Research",
        "Scientific Research",
        "Research"
    ],
    "response": [
        {
            "author_info": {
                "name": "Moe Snyder",
                "href": "/profile/Moe-Snyder"
            },
            "answer_text": "It's easy. At the end of any piece of information that you plagiarize, write in parentheses the last name of the author you stole from, the year of publication of the material you are stealing, and the page number you got it from. Then, at the end of your writing or in a footnote, write the author's full name title and date of the publication. You might get criticized for poor citation style (unless you follow the appropriate style, which you can find online), but you won't get caught plagiarizing! ",
            "date": "Answered April 15, 2020",
            "views": "120",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Michael Griffin",
                    "user_href": "/profile/Michael-Griffin-68"
                },
                {
                    "user_id": "Ali Tahmazov",
                    "user_href": "/profile/Ali-Tahmazov"
                },
                {
                    "user_id": "Munawar Jawad",
                    "user_href": "/profile/Munawar-Jawad"
                }
            ]
        },
        {
            "author_info": {
                "name": "Trix Griffin",
                "href": "/profile/Trix-Griffin"
            },
            "answer_text": "I will ADVICE you TO DO THE WORK AND AVOID SHORT-CUTS. I have seen people’s lives destroyed by this kind of academic dishonesty. This will save you a lot of stress that you have to go through due to plagiarism. Universities and colleges have no mercy when it comes to plagiarism. It's actually easy not to plagiarise than to plagiarise and work your way out. Do the following: Read broadly.Write in your own words what the author is communicating.Give credit.Provide a list of references.",
            "date": "Answered April 16, 2020",
            "views": "107",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Andrew Paquette",
                    "user_href": "/profile/Andrew-Paquette-7"
                }
            ]
        }
    ]
}