{
    "title": "How should beginner writers and bloggers go about building an audience for their work? - Quora",
    "tags": [
        "Bloggers",
        "Blogs",
        "Blogging",
        "Writers and Authors"
    ],
    "response": [
        {
            "author_info": {
                "name": "Wajahath Ali",
                "href": "/profile/Wajahath-Ali"
            },
            "answer_text": "What many people don’t realize is that Blogging is a tough gig. It is not as easy as some of the blogs say it is. To show you some perspective Jeremy Schoemaker wrote every day for 3 years before he could get recognition and success. Are you prepared for this kind of work, if yes then read on Building an audience is all about gaining trust of your readers. You have to know about what you are writing and never try to write crap with half information because you will then be known as dummy writer. Step 1) No one knows if you are a writer, you will have to tell people that you are writer and brand yourself as a writer if you really want a career in writing. Step 2) If you ask for work, everyone will ask for your portfolio, so start building a portfolio Step 3) You should have a blog where you can tell people about yourself and your strengths Step 4) Showcase your work on your blog, this can be the first place to start building your content and start sharing on social media. Step 5) Create an account on fiverr, upwork, freelancer and other freelance websites and start bidding for writing projects. Step 6) Make sure that you are bidding low amounts for projects because you are just starting out and your main goal is to build primary clients and portfolio. You can charge top dollars later but you have to pay the price first. Step 7) \"Gradatim Ferociter\", Latin for \"Step by Step, Ferociously\" Let me tell you about a writer who I saw multiple times on my Facebook feed and other places. His name is Onibalusi Bamidele. He has been published on top blogs on internet. He is now very successful writer and you can follow his blog as he writes a lot of posts which helps amateur writers. So you will definitely get lots of ideas from his website. Resources to check: Where the Writers Go to Write (Poetry, Stories, Contests and more!) Ulysses on the Mac App Store Minimalist Text Editor for Distraction-Free Writing Literature and Latte - Scrivener Writing Software ",
            "date": "Answered May 19, 2017",
            "views": "320",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Michael Yarbrough",
                "href": "/profile/Michael-Yarbrough-10"
            },
            "answer_text": "It’s very difficult to build an audience. You have to have a talent and range of skills. Building an audience takes not 2–3 days, but maybe months, years. You should be ready to work hard. If you want to create a successfull blog try to define your goals. The main question is: ‘Why do I want to be a blogger?’, ‘Can I get something useful for my readers?’ Also be ready to spent a lot of time. A lot of rival bloggers around you. Be ready to fight for your audience. It’s a market economy times. Care about your content and reputation, try to collaborate with sucessful and popular bloggers, opinion leaders. Care adout your visual content. Nowadays it have a crucial importance.  You blog should be an actual and modern. Choose the themes you love the most. It’s the main key. Pay attention to social networks such as Twitter, Instagram, Facebook, Snapchat and so on. I can reccomend tools for smart audience that may help to grab reader’s attention. Quabel It has a lot of features that can inspire you to write. Todoist You can create, edit and share tasks with other people who help you with your blog. Unicheck In order to look professional, make sure your blog posts are unique and original. This tool will help you scan your posts for plagiarism in real-time and indicate whether there are any similar phrases or sentences out there on the web. Scrivener You can easily add tables or pictures. You can create short drafts on a cork board, and then store them in an index card. ",
            "date": "Answered July 4, 2017",
            "views": "230",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Edmond Ellis",
                    "user_href": "/profile/Edmond-Ellis"
                },
                {
                    "user_id": "Derek Explorer",
                    "user_href": "/profile/Derek-Explorer"
                }
            ]
        },
        {
            "author_info": {
                "name": "Adrian Thomas",
                "href": "/profile/Adrian-Thomas-28"
            },
            "answer_text": "The way I did it was, publish a trilogy and compendium of my memoirs about my life and work dealing with an official secret that was over 900 years old, so it went viral on the internet overnight in my country and captured slots #1, #2, #4 and #5 of the amazon bestsellers list in the genre and niche, locally and globally, and inform the editor in chief of a prestigious, New York based enewspaper and blogsheet, so she invited me to blog on it, leading to many more offers to write books, blogs and broadcasts for other major media, and getting endorsed by a brand spanking new internet based university signed up to the United Nations Global Compact for Sustainable Development, with over 8000 other corporate bodies and over 4000 other people like myself, such that within the next 3 yrs I had over 2.9 billion readers, listeners and viewers on the internet and cable and satellite radio and television talking about my work.       ",
            "date": "Answered May 26, 2017",
            "views": "57",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Danae Fitzgerald",
                "href": "/profile/Danae-Fitzgerald-2"
            },
            "answer_text": "Write witty tweets, build your audience, link them to your blog, and seek a publisher by sending manuscripts…over and over and over…ad naseum. Or, if you have a finished manuscript and know it will sell, use CreateSpace.com, publish your book, order 20 copies or more, (they give the writer a cost price), and sell them to bookstores…convince a bookstore to buy a book…you paid $5.00,charge them $10.00, and sell them for $15.00 - $20.00. After recording sales, create spread sheets that prove sales, and include that with your manuscript when you send a publishing package. Also, tailor the publishing package you compile to the audience you seek…only send your package to publishers that are looking for that subject material. Also, if you know its a good product, consider sending it to an agent…they can open the closed doors of many large publishers…but only if they like and believe in your work. Ask yourself honest questions, like “who would buy this book, why would they read it, why would someone not read it, and can I change something to make it more amenable to general interest groups, or cross genres to make it appeal to all sorts of select sub-genres…like a romance in science fiction, a murder in an adventure story, a mystery in a alternative historical work. Make your book into something for everyone…smooth the writing so it will appeal to all, add humor to open closed minds, and add advice for those who would never seek it, but might find it helpful if discovered in an obscure book. Turn your work into something that appeals to as many readers as possible, but focus on a core group that will embrace your story because it fits into what they find exciting and enjoyable in life. Ultimately, your work and your words will sell themselves; readership will grow, and fans will help share your work with others. The more you give them to like, the more apt they are to tell their friends…that’s when you establish an audience that supports you, likes your output, and enjoys talking about the thought provoking tenets you dredge up with your cogent creativity. Just a few thoughts…it’s always better to know someone on the inside that can open doors, introduce the right people, and give your work the chance to shine. ",
            "date": "Answered May 15, 2017",
            "views": "451",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Shea Ki",
                    "user_href": "/profile/Shea-Ki"
                },
                {
                    "user_id": "Charis Dillon",
                    "user_href": "/profile/Charis-Dillon"
                },
                {
                    "user_id": "Al Evans",
                    "user_href": "/profile/Al-Evans-8"
                },
                {
                    "user_id": "Jordan Forth",
                    "user_href": "/profile/Jordan-Forth-4"
                }
            ]
        },
        {
            "author_info": {
                "name": "Anil Agarwal",
                "href": "/profile/Anil-Agarwal-4"
            },
            "answer_text": "As a beginner blogger, one of the best ways to build a blogging audience is to network with other bloggers, especially those ones that are already ahead of you in your niche. The are the people that will help you to get discovered. From my experience, one of the easiest way to achieve this is to always comment on their blogs. When I said comment on their blogs, I don't mind leaving mediocre, irrelevant comments all in the name of commenting, the type of comment I’m talking about is the type that will arouse further discussion, engaging and meaningful comments that will make the blogger to notice you. If you do this 2 to 5 times, he’ll certainly take notice of you, and that's how the friendship will kick-start. Another wonderful way is by writing and publishing guest posts on relevant blogs in your niche. The more you do this, the more you’ll be able to syphon a part of the bloggers audience and make them yours. Check Website Traffic: 14 FREE Tools to Estimate Traffic Of Any Website ",
            "date": "Answered September 21, 2017",
            "views": "234",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Savan Trivedi",
                    "user_href": "/profile/Savan-Trivedi-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Eric Barker",
                "href": "/profile/Eric-Barker-4"
            },
            "answer_text": "Focus on content. Nothing’s easier to market than a great product. Nothing’s harder to market than a terrible one. Lots of people talk about likes and shares and comments, but I think the most emphasis should be given to writing-stuff-people-actually-wanna-read. Be entertaining or informative, or preferably, both. If you do 10x work, people will notice. Then everything else gets a LOT easier. I write about a lot of stuff and I know a lot of people are gonna say, “This one isn’t for me.” That’s totally cool. But I want them to look at what I did and say, “Wow, he put some work into that.” They may not enjoy it, but they can respect that you were serious about it. That matters over the long haul. More than you think. ",
            "date": "Answered May 18, 2017",
            "views": "86",
            "upvotes": " View 116 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Raskidon Iykestar",
                    "user_href": "/profile/Raskidon-Iykestar"
                },
                {
                    "user_id": "Andrei Kuratov",
                    "user_href": "/profile/Andrei-Kuratov"
                },
                {
                    "user_id": "Luise Urth Krog",
                    "user_href": "/profile/Luise-Urth-Krog"
                },
                {
                    "user_id": "Sean Fahey",
                    "user_href": "/profile/Sean-Fahey-20"
                },
                {
                    "user_id": "Brill Jonathan",
                    "user_href": "/profile/Brill-Jonathan"
                },
                {
                    "user_id": "Martha Poller",
                    "user_href": "/profile/Martha-Poller"
                },
                {
                    "user_id": "Arlene Everingham",
                    "user_href": "/profile/Arlene-Everingham"
                },
                {
                    "user_id": "Goutham Amudhala",
                    "user_href": "/profile/Goutham-Amudhala"
                },
                {
                    "user_id": "Sunil Kumar Bagi",
                    "user_href": "/profile/Sunil-Kumar-Bagi-1"
                },
                {
                    "user_id": "Vikram Dutt",
                    "user_href": "/profile/Vikram-Dutt"
                }
            ]
        },
        {
            "author_info": {
                "name": "Dandan Zhu",
                "href": "/profile/Dandan-Zhu-2"
            },
            "answer_text": " 0:00-0:30 As a fellow blogger and heavy content producer to take my headhunting and career coaching business, Dandan Global, to the next level, here are some tips to aspiring bloggers who want to make a difference! In my video, I talk about: (1) Strategize on what you’re going to blog/write/focus on. Know what you’re doing it for so you don’t waste time. (2) Have a demonstrable and true competitive advantage in your chosen topic. (3) Produce great content around it on a consistent and long-term basis. (4) Create great content by reading a lot and improving your communication skills: written, oral, and video content. Best of luck! ",
            "date": "Answered May 18, 2017",
            "views": "52",
            "upvotes": " View 33 Upvoters",
            "upvoters": [
                {
                    "user_id": "Taras Stetsiuk",
                    "user_href": "/profile/Taras-Stetsiuk"
                },
                {
                    "user_id": "Anamika Teotia",
                    "user_href": "/profile/Anamika-Teotia-3"
                },
                {
                    "user_id": "Vineeth wayne",
                    "user_href": "/profile/Vineeth-wayne"
                },
                {
                    "user_id": "Dan Mu",
                    "user_href": "/profile/Dan-Mu-10"
                },
                {
                    "user_id": "Roxana Rodriguez",
                    "user_href": "/profile/Roxana-Rodriguez-25"
                },
                {
                    "user_id": "Emily Luhn",
                    "user_href": "/profile/Emily-Luhn"
                },
                {
                    "user_id": "Pheobe Chen",
                    "user_href": "/profile/Pheobe-Chen-1"
                },
                {
                    "user_id": "Takudzwa Razemba",
                    "user_href": "/profile/Takudzwa-Razemba"
                },
                {
                    "user_id": "Jay Dell",
                    "user_href": "/profile/Jay-Dell-2"
                },
                {
                    "user_id": "Tian Ooxx Yuan",
                    "user_href": "/profile/Tian-Ooxx-Yuan"
                }
            ]
        },
        {
            "author_info": {
                "name": "Saumya Mehrotra",
                "href": "/profile/Saumya-Mehrotra-6"
            },
            "answer_text": "It is very important for a beginner to gather audience ,this needs marketing skills too . but remember THE CONTENT IS THE KING !! if you focus on your content and you give your readers get exactly what are they looking for the nothing can stop you . What you can do is search your blog on all search engines and tell your friends also to do so .this will increase your chances of being read , A blog needs to be purpose specific . Slowly and steadily the audience will start knowing that this particular blog is to been for this particular purpose . Make good use of all the social sites ! especially Facebook and Instagram .many people make a good career through these sites only . Market your blog on these sites and eventually you will gain popularity . PATIENCE is the hey here .these things will happen slowly and steadily ! ",
            "date": "Answered May 27, 2017",
            "views": "60",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "MishaPatel",
                "href": "/profile/MishaPatel"
            },
            "answer_text": "Well, You are starting a blog and want to write a blog that is unique and stands out among others then this following links will be helpful for you to get ideas about how actually one writer or blogger should write a blog.. 13 Quick tips to make your blog unique 11 Tips to design a blog that stands out among others 20 Design Features That Will Make Your Blog Stand Out From The Crowd 7 ways to make your blog stand out ",
            "date": "Answered July 25, 2017",
            "views": "43",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Aayushi Dadhich",
                    "user_href": "/profile/Aayushi-Dadhich-3"
                }
            ]
        }
    ]
}