{
    "title": "How would you write a poem that would best describe yourself? - Quora",
    "tags": [
        "Writing Poetry",
        "Poems",
        "Poetry",
        "Creative Writing",
        "Writing"
    ],
    "response": [
        {
            "author_info": {
                "name": "Aleksandra Yurukoska",
                "href": "/profile/Aleksandra-Yurukoska"
            },
            "answer_text": "I started writing poetry when I was about 7 or 8 years old; basically, when I was old enough that I could string words together into simple sentences. There was this children’s magazine where they published poems written by kids. I read them and thought, “I could do this.” I took my little Minnie-&-Mickey-Mouse suitcase and set it onto my lap. My mom would bring pads of white rectangle paper from work which I loved using; one, because it was something from my mom; two, because it was something from a place where they did grown-up, professional things and it made me feel like a grown-up in turn; and, three, because I was about to do something I never did before - create. The poem was titled “Butterfly”. It had 2 stanzas with 3 lines each. I remember how my handwriting looked and the colour of the pen. And I will always remember how proud and in awe I felt at the fact that I had made something where there was nothing there before. After that I wrote a lot. I think I wrote some short stories too. But, as I’m recalling this, I’m surprised that I thought at that time that when I grow up I’ll start writing for real; I’ll write exclusively short stories, definitely not poems. I read a lot, and I mean a lot, but it was only novels and fairy tales. There was no poetry. Again, it’s weird, and I’m just realising this as I’m answering this question, that I thought that being a writer meant that you are really writing and that of course I’ll be writing fiction since I only read prose. Yet, all the while and to this day, I’ve only ever really written poetry. :) Then, again in another magazine, this time for teenagers, I read two poems by Pablo Neruda and Rabindranath Tagore. It was Tagore’s poem that got me. I convinced myself that if you can’t write as incredibly as him, you shouldn’t really be writing. You’re not, you’re not supposed to be, allowed to. A few days later, I expanded that theory to encompass the whole of art. To be an artist, had to mean that you made art that said something new about a universal theme, be it love, death, happiness, grief, childhood, old age… After that I didn’t write for years. As a second-year student I was attending an Academic Writing class that occasionally ventured into some more interesting things like creative writing. This particular lesson was about simile. We were given a task to write a poem: choose a thing or a person and compare it/them to a musical instrument, mode of transportation, an artwork, an animal, piece of clothing, and so on. This was the first time I would be writing a poem after years of self-imposed abstinence. Go and figure why I dedicated my poem to this particular person: To The Person I Could Never Be You are the sound of a guitar that needs tuning A crippled old car with no motor running But you sound as thousand angels singing Millions of flowers with odour over-brimming You're a high-maintenance antic chair A little puppy that needs a lot of care You're a painting I never saw but is out there somewhere All the colours of the rainbow and all the hues in between You're a horse always looking for a juicy pasture of green I bet you taste as the best cake I could never make You're the fanciest dress in which I could never date The rain that makes a road disaster out of me You're simply the person I could never be. I am a judgmental person with high standards, overbearing and stubborn. This is all primarily and to the largest degree aimed at my own self. It’s the reason why instead enjoying Tagore’s poetry and maybe even finding inspiration, I… there’s really no other word for it - I punished myself for not being good enough by not allowing myself to ever become good enough since you can’t get good at anything without doing it. :) I locked myself off from becoming that person and naturally that person I could never be. So, to finally answer your question. How to write a poem about yourself? Aim it at your biggest fear, your most self-annihilating, threatening shame, the thing you have to whisper even to yourself with the lights off holding hands over ears. If you’re shaking while writing, feel like you’ll be sick, cold sweat down your neck at the thought of putting it out into the world - swallow, finish the poem, hit publish, and bend your head to start writing another one. Every poem is about you. Every painting, screenplay, song, choreography is you. You’re not fooling anyone. Even when you’re reflecting on a situation you witnessed as an outsider, making a social commentary, trying to capture a moment experienced in the stillness of nature, delving into the inner lives of the people you love, hate, are friends with, are strangers to… you can’t escape yourself, you’re only ever filtering aspects of you through the funnels of the world. You’re only ever on a path to the real unadulterated you. Maybe this will read as a cheesy rambling of the new-age woo-woo kind to some. But anyone who ever created anything knows how denuding it is, almost exhibitionistic, because if we have any hope of being good at this, we have to, must, be completely willing to show every silly, childish, ugly, unsavoury, chaotic, evil, egotistic side of ourselves. We have to perform exorcism with every line of poetry as an instruction manual to humankind; that’s what we’re here for. Seems grandiose? Probably. It’s goddamn terrifying if you ask me. It’s not like you don’t have a choice though. Here’s a suggestion: try not writing for 5–6 years, then see what’ll be the first thing you write about. :) ",
            "date": "Answered July 28, 2018",
            "views": "49",
            "upvotes": " Answer requested by Jang Gonzales",
            "upvoters": [
                {
                    "user_id": "Joel Slack",
                    "user_href": "/profile/Joel-Slack-1"
                },
                {
                    "user_id": "Shell Majumdar",
                    "user_href": "/profile/Shell-Majumdar"
                },
                {
                    "user_id": "Mojolaoluwa Olusola-Niyi",
                    "user_href": "/profile/Mojolaoluwa-Olusola-Niyi"
                }
            ]
        },
        {
            "author_info": {
                "name": "Akash J",
                "href": "/profile/Akash-J-98"
            },
            "answer_text": "Disclaimer:- This is more of rant than poem which I wrote ages ago. All views are personal only. Thanks to social media I was the merciless scapegoat getting awarded the prestigious award of “Best Chump of the Year” to getting paired with Obama as my “future wife and crush”. So please bear with it. The Life Of Social Media Butterfly: Over the hills and over the lanes, Through States, Asia and Spain, Butterflies flutter all the way, Along with their smart phones and tablets all the day. These butterflies are very one of a kind, Young and old, mostly young maggots, With their heads always bent on the illuminating screen, And walks always as if they were zombies. There is no person to person interaction, Only from screen to screen, Or through calls to calls, These bumbling fools always have an alter ego, Because they have internet to shield their sorry identity. In real life most of them are quite and are not outspoken, But in their virtual worlds, they are one of the finest Keyboard Knights, Their bravery which can always outrival Arthur’s round table of Knights. Cause their sorry existence is not known in the virtual world These one of a kind fools are keen to make new friends in facebook, But they don’t care to make friends in real life, They don’t bat an eye when they lose a friend in real life, But when they see that someone had unfriended them on FB, They lose their minds and become crestfallen! Most of them click and upload selfies very quickly, Faster than the rate of mosquitoes breeding in a swamp, They always try to fish facebook likes and comments through poses like; Duck face, monkey face, donkey face or whatever, Cause they know that they are 1000 times uglier than ducks or any other animals. Just like satellites, they are interested in spreading gossip through social media, Always are keen to deliver the latest breaking news like, Talking how does the next door neighbour’s daughter lost her Iphone-6, Or how the group of friends punctured their professor’s car because he gave them too much homework, And how their mom’s ,uncle’s, sister’s,son’s,nieghbour’s aunt’s maid eloped with her new boyfriend, So on and on, to fish facebook likes and comments, As they feel their lives are boring (which indeed is) and other’s lives are interesting. These young bumbling buffoons do have any special traits, Yet they want their own band of followers, Great people have their own followers for the contribution which they did to society Like literature for Shakesphere, Philosophy for Plato, Bravery for Alexander the Great, Business intellect for Ford, These true stars have their own followers, But these fame hungry youths want their own followers, Without doing any meaningful contribution, So off they seek refuge of Instagram and Twitter, After many stupid poses and faces, And after many weird dresses and places, They gain more followers on Instagram, Who are equally stupid and moronic than them. After many ‘I luv abc boyband!!” to many hashtags, And after many stolen quotations and so called ‘latest updates’ They gain more twitter followers than the air bubbles in the bubble wrap. They spend day and night on their devices, Jumping and getting excited as soon as they see new notifications, These youths just like butterflies, they live a short lives, Because they do not really understand the true meaning of lives. ",
            "date": "Updated July 15, 2017",
            "views": "19",
            "upvotes": " View 3 Upvoters"
        }
    ]
}