{
    "title": "How humans are affected by water pollution? - Quora",
    "tags": [
        "Water Pollution"
    ],
    "response": [
        {
            "author_info": {
                "name": "Hunter Kepon",
                "href": "/profile/Hunter-Kepon"
            },
            "answer_text": "Water pollution affects humans directly when drinking water is contaminated. It affects humans indirectly when contaminated water has negative impacts on the surrounding environment. Aquatic and terrestrial plants and animals suffer from drinking contaminated water. Polluted water diminishes the capacity of the entire ecosystem that depends on the water source. The damaged ecosystem then ceases to provide the numerous direct and indirect benefits to humans including diminished water storage, erosion control, fish and game stocks, water filtration, air filtration, oxygen production, CO2 storage, thermal regulation, and rainfall. Damaged ecosystems are likely to turn to desert and consequently weather patterns and rainfall can be greatly affected. In short, it just leads to more global warming and the collapse of our global ecosystem. ",
            "date": "Answered May 10, 2017",
            "views": "903",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Obiora Orjiako",
                    "user_href": "/profile/Obiora-Orjiako"
                },
                {
                    "user_id": "Brad Dobson",
                    "user_href": "/profile/Brad-Dobson-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Hannah Mathew-Richards",
                "href": "/profile/Hannah-Mathew-Richards"
            },
            "answer_text": "The most direct affect would be that water quality will decline, which is a particular problem for domestic use since people are directly consuming it. This has direct health implications for those using it. When polluted water is used to feed crops, the pollutants can enter the food of which we eat. This is particularly the case regarding fish with heavy metals and nitrates from farmlands. In Mexico City the drainage system is inadequate, and so rainwater mixes with sewage and is used for irrigation.China is an example of a country impacted by low water quality. The water in the Yellow River [Northern plain] is heavily polluted which damages health and irrigation [since it feeds the farming region]. The impact of health is valued at $3.9 billion a year.The Ganges in India has extremely poor water quality, with toxins 3000 x over the limit of the World Health Organisation's recommendations. This has led to high infant mortality, skin problems and disabilities. 420 million people rely on this water for food, water, bathing and agriculture. The impact is so great that the World Bank has loaned India $1 billion to clean the river. In the Nile [North East Africa] pollution from 36 different industries discharges into the Nile leading to cadmium exposure, effluent, cyanide, ammonia, nickel, pathogens etc. These have huge health implications and can easily spread disease. The prevalence of disease in countries without adequate, sanitised water is a prime example of the implications of pollution [or generally water of poor quality]. ",
            "date": "Answered May 15, 2017",
            "views": "894",
            "upvotes": " Answer requested by Dinzey Rogers"
        }
    ]
}