{
    "title": "How did Malappuram in Kerala get its name? - Quora",
    "tags": [
        "Malappuram, Kerala, India",
        "Kerala, India"
    ],
    "response": [
        {
            "author_info": {
                "name": "Aromal Satjayababu",
                "href": "/profile/Aromal-Satjayababu"
            },
            "answer_text": "The origin of the name is clearly stated by Mr Mohd Jihas. I would like add some more points. Malappuram district was formed by combining portions of the former Palakkad and Kozhikode districts. Ernad taluk and Tirur taluk of Kozhikode district, Perinthalmannna and Ponnani taluks of Palakkad district. Malappuram was the military head quarters of the Zamorins of Kozhikode. The fort of Tippu Sultan and the Haig barracks established by the British are some of the monumental buildings of the past . During the colonial era, Malappuram was the headquarters of European and British troops and later it became the head quarters of the Malabar Special Police (M.S.P). Not related to the question , but I can't help adding. I studied in M.S.P school in Malappuram. At that time in the M.S.P Parade ground, a gallary was erected similar to a temporary stadium. There was programme for 3 days in the evening. First day it was Music concert by M.G Sreekumar. Second day it was Old is gold (old songs) by various old singers followed by Comedy Program by Cochin Kalabhavan . In the final day there was Music concert by Usha Uthup. It was nostalgic. This happened in 1994- 1995 period. If your family lived in Malappuram (kottakunnu or nearby ), you can ask your elders about the programme. ",
            "date": "Answered July 26, 2019",
            "views": "233",
            "upvotes": " View 3 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Rauf Azi",
                    "user_href": "/profile/Rauf-Azi"
                },
                {
                    "user_id": "Connect Cpd",
                    "user_href": "/profile/Connect-Cpd"
                },
                {
                    "user_id": "Mohammed Faris NM",
                    "user_href": "/profile/Mohammed-Faris-NM-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Mohammed Faris NM",
                "href": "/profile/Mohammed-Faris-NM-1"
            },
            "answer_text": "'Malappuram' literally means 'on top of the hills' (Mala-hill,puram-on top) , and it's from where it got its name. Even though Malappuram has all the three zones of Kerala geographical strata(Malanadu-hilly zone,Idanadu-Middle zone and Theerapradesham-costal zone) it's hills which dominate the district. Even the middle zone (idanadu) has a lot of hilly beautiful places in Malappuram. Malappuram is also the name of our capital town which also have couple of small hills. One of the park which people spend evening and mornning time is made on the flat top of a hill in the midst of the town. The park is called as Kottakkunnu(Fort-hill) since it had a fort by Mysore king Hyderali during older times. It is also the place where freedom fighters Ali Musliyar and Variyankunnath Kunjahammad haji shot dead during 1921 clash between Mappila peasants againsts Brittish army, local Brittish POLICE and local landlords. ",
            "date": "Answered October 14, 2019",
            "views": "156",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Connect Cpd",
                    "user_href": "/profile/Connect-Cpd"
                }
            ]
        }
    ]
}