{
    "title": "How to write a good article for a magazine - Quora",
    "tags": [
        "Magazines",
        "Journalism",
        "Writing Advice"
    ],
    "response": [
        {
            "author_info": {
                "name": "Dave Stafford",
                "href": "/profile/Dave-Stafford-5"
            },
            "answer_text": "Having written over 100 articles for a variety of national magazines, primarily within the construction trade publications, there are several things to consider: Write about what you know or have experience in rather than NO experience. Nothing beats the scars and calluses of work you’ve done. Pick a topic and come up with at least four or five main points to address in the article. Write a draft so as to flesh out each of the four or five main points - in this way, you’ll find out quickly if you have enough expertise to make each point worthwhile for the reader. Once you have done your draft, review your main points to determine that each is appropriate and adds value to the overall article - where will you need to add or subtract information, illustrations or personal asides? Do you have the draft of an article that will add some knowledge and insight to the reader? Does your thesis and conclusion make sense? Have you a strong opening statement and a viable conclusion that ties everything together? Go back and rewrite and edit to eliminate superfluous words and redundant phrases. Be clear and direct and avoid cliches and “literary” flights of fantasy. The magazine editor should have given you some idea of the total number of words for the article. Any word processing program will allow you to ascertain word count, either in sections or in total. Edit, edit, edit until you have a “lean” article that says what you intend and makes sense and stays within the word count set for the article. Do you need to add a couple of illustrations or delete one that’s a little off the mark? Does the article “flow” or is it “choppy” and disjointed? If so, smooth out transitions. Finally, after your last edit to arrive at your “semi-final draft”, put the writing aside for several hours, go for a walk, take a nap or review in 24 hours. Take a fresh look, re-read the draft and make final changes and then submit. Always ask the editor for suggestions and a critique. IF you have done your job and written a lean piece, the editor may make some minor changes but will not have to do a complete rewrite. That is your goal. ",
            "date": "Answered January 28, 2020",
            "views": "296",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Austin Blessing",
                    "user_href": "/profile/Austin-Blessing"
                }
            ]
        },
        {
            "author_info": {
                "name": "William Vietinghoff",
                "href": "/profile/William-Vietinghoff"
            },
            "answer_text": "Find a magazine that prints articles on a subject that you are interested in and that you know a lot about. Then query them by phone or by letter. Ask if they might be interested in the subject you want to write about. Ask them about the range of their word lengths. I happened by chance to pick up a copy of Air & Space Magazine. It occurred to me that some of my experiences while working on the Space Shuttle Main Engine might be suitable for an article. Using the telephone number in the magazine I called up the editorial department and described the article I wanted to submit. They told me to submit my article. I did by email. They emailed me back and told me they accepted the article. They edited it and sent it back to me. I edited some of their edits and sent it back. It was printed in the following month’s issue of the magazine. The article is on-line. Here is the link: https://www.airspacemag.com/space/space-shuttle-engines-just-the-stats-239729/ ",
            "date": "Answered January 3, 2020",
            "views": "123",
            "upvotes": " View 3 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Salfiya Anzar",
                    "user_href": "/profile/Salfiya-Anzar-1"
                },
                {
                    "user_id": "Deepika Srivastava",
                    "user_href": "/profile/Deepika-Srivastava-31"
                },
                {
                    "user_id": "Austin Blessing",
                    "user_href": "/profile/Austin-Blessing"
                }
            ]
        }
    ]
}