{
    "title": "How to write a wonderful essay for an international competition - Quora",
    "tags": [
        "Essays",
        "Writing Advice"
    ],
    "response": [
        {
            "author_info": {
                "name": "Joslyn Fresay",
                "href": "/profile/Joslyn-Fresay"
            },
            "answer_text": "First of all, it is useful to make a list of points to be considered in your essay as well as search for the most trusted sources in the library and on the Net. You must understand them completely and, if not, consult your mentor. It is also advisable to determine the problem areas you may face when writing your essay. Reading much will help you to get rid of controversial points that may hinder your argument. Facts need to be supported by your general knowledge, being also properly evidenced and referenced. Avoid mass use of complicated words. In case you use some technical vocabulary, make sure you understand its meaning. Most competition essays have the usual essay structure: introduction, two or three body paragraphs, and conclusion. The introductory paragraph should contain background information followed by a strong thesis statement. In the body paragraphs do not forget to exemplify facts. It will give you some additional points. Finally, make sure that there is a perfect sequence in your writing as well as impressive statements in the introductory paragraph, and in the conclusion. ",
            "date": "Answered June 11, 2020",
            "views": "100",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Karla Davisio",
                    "user_href": "/profile/Karla-Davisio"
                },
                {
                    "user_id": "Sheylea Phillips",
                    "user_href": "/profile/Sheylea-Phillips"
                },
                {
                    "user_id": "Shaivi Puranik",
                    "user_href": "/profile/Shaivi-Puranik"
                }
            ]
        }
    ]
}