{
    "title": "How to prepare for an interview at Phillips Exeter Academy - Quora",
    "tags": [
        "Exeter, NH",
        "Phillips Exeter Academy",
        "New Hampshire (state)"
    ],
    "response": [
        {
            "author_info": {
                "name": "Eric Chung",
                "href": "/profile/Eric-Chung-16"
            },
            "answer_text": "The interview is your opportunity to give a person to person impression of who you are. You can only say so much from your resume, and your resume is likely to be similar to other talented students. Like someone has answered, when the interviewer asks about what you can contribute don’t fall into the trap of saying you’re very smart because everyone else who’s applying is probably smart just like you. Answer these questions with something personal, something that only you can truly bring to campus. The goal of the interview is to show that you are personable, show potential for growth, and also offer a seed that can bloom and contribute to your class in your Exeter career. Another important thing to note is that the interview is not thing that gives a broader impression of you. I’m sure you had to write some kind of essay and submit recommendations as well. The interview is just one piece of the puzzle. I thought I did terribly in mine many years ago. Be weird. Be you. Good luck. ",
            "date": "Answered January 11, 2017",
            "views": "49",
            "upvotes": " View 10 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Amanda Beatriz",
                    "user_href": "/profile/Amanda-Beatriz-4"
                },
                {
                    "user_id": "Odong Manuela",
                    "user_href": "/profile/Odong-Manuela"
                },
                {
                    "user_id": "Wilma Nilsson",
                    "user_href": "/profile/Wilma-Nilsson-5"
                },
                {
                    "user_id": "Binh Minh Duong",
                    "user_href": "/profile/Binh-Minh-Duong"
                },
                {
                    "user_id": "Aaron Hamilton",
                    "user_href": "/profile/Aaron-Hamilton-113"
                },
                {
                    "user_id": "Sentap T",
                    "user_href": "/profile/Sentap-T"
                },
                {
                    "user_id": "Lorenzo de Simone",
                    "user_href": "/profile/Lorenzo-de-Simone-4"
                },
                {
                    "user_id": "Katy Samba",
                    "user_href": "/profile/Katy-Samba-1"
                },
                {
                    "user_id": "Jessie Chen",
                    "user_href": "/profile/Jessie-Chen-69"
                },
                {
                    "user_id": "Mohamed Ismail",
                    "user_href": "/profile/Mohamed-Ismail"
                }
            ]
        },
        {
            "author_info": {
                "name": "Martin Muñoz",
                "href": "/profile/Martin-Muñoz-2"
            },
            "answer_text": "The format of the interview is as follows: first you are invited in then your parents get interviewed. My interview was two years ago so I can't remember well what I was asked. The first questions are simple and I think they are intended as ice breakers: how many siblings do you have? what do you do for fun? Afterwards the interviewer will ask you to elaborate specific parts of your application. There are no trick questions designed to trip you up. Just stay calm, don't be intimidated and strive to let the interviewer know who you are. One recommendation: my performance at my Andover view didn't go as well because my interviewer asked me questions that didn't fit with my personality. She asked me a lot about what sports I played and that was not a strong part of my application so I couldn't really see myself. If you're interviewer asks you questions that are not very relevant to your application try to subtly steer it to a subject that is more relevant. Best of luck. ",
            "date": "Answered November 11, 2016",
            "views": "32",
            "upvotes": " View 8 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Amanda Beatriz",
                    "user_href": "/profile/Amanda-Beatriz-4"
                },
                {
                    "user_id": "Anna Korczak",
                    "user_href": "/profile/Anna-Korczak-1"
                },
                {
                    "user_id": "Alex Virgini",
                    "user_href": "/profile/Alex-Virgini"
                },
                {
                    "user_id": "Cathy Yu",
                    "user_href": "/profile/Cathy-Yu-34"
                },
                {
                    "user_id": "Lorenzo de Simone",
                    "user_href": "/profile/Lorenzo-de-Simone-4"
                },
                {
                    "user_id": "Katy Samba",
                    "user_href": "/profile/Katy-Samba-1"
                },
                {
                    "user_id": "Chrisina Lin",
                    "user_href": "/profile/Chrisina-Lin"
                },
                {
                    "user_id": "Cengiz Canberk",
                    "user_href": "/profile/Cengiz-Canberk-1"
                }
            ]
        }
    ]
}