{
    "title": "How to write a book in 10 days - Quora",
    "tags": [
        "Book Writing Advice",
        "Creating Writing Advice",
        "Book Writing",
        "Creative Writing",
        "Writers and Authors",
        "Writing Advice",
        "Writing",
        "Book Recommendations"
    ],
    "response": [
        {
            "author_info": {
                "name": "Roger Parker",
                "href": "/profile/Roger-Parker-17"
            },
            "answer_text": "I suspect that you might be able to write a book in 10 days—especially if it was less than 100 pages and you could harvest sections and paragraphs from previously-written projects—but it might not turn out as well as other projects you have written. The exception is if you separated the writing and editing aspects, and were able to edit your book after you had written it. No book should be published until its been self and professionally edited. Self-editing is good for basic grammar and flow, but editing by an impartial editor is necessary from an independent perspective. An editor will be likely to not missing topics, like omitted segues between one topic and another, or grammar problems like repeated words or missing words. As an author, you “knew” what you meant to write, and when you encounter a spot where text has been omitted, your brain will automatically fill it in because it “knows” what you “thought” to write. Many times, authors will inadvertently omit “not” before verbs. This can totally changing the meaning of “do not run on the stairs” to “run on the stairs.” The only exception to the above is when I was writing a “Twitter book” about choosing book titles. I was sharing advice about 140 book titles and limiting my replies to 140 characters or less. Because I had decades of experience writing about the topic, I was able to write the first draft on one Saturday afternoon, and review each rentry and check the word counter on the next Saturday afternoon. Nevertheless, an outside editor still found numerous errors requiring several hours of clarification and rewriting! ",
            "date": "Answered November 2, 2019",
            "views": "166",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Jonathan Chiu",
                    "user_href": "/profile/Jonathan-Chiu-27"
                }
            ]
        },
        {
            "author_info": {
                "name": "Maddie Thorpe",
                "href": "/profile/Maddie-Thorpe-5"
            },
            "answer_text": "How do I write a book in 10 days? Advice: Unless you have zero commitments for the next 10 days, I would highly advise that you give yourself more leeway.  Day 1 Tasks: Write down why you want to do this in 10 daysWrite down what the plot isWrite down who the characters areDecide whether you want to do this handwritten or on a computerDecide how long the book is going to bePick a titleStart the prologue if you are having oneSet up and tidy a work place Day 2 Tasks: Write approximately half of your book (you need to start strong in order to have motivation).Don't reread or rewrite it just write Day 3 Tasks: Write another third of your bookRewrite your book Day 4 Tasks: Finish writing your first draft of your bookGo through your whole book and do basic editingSpellingGrammarCapital lettersPunctuationNo missing/double wordsEnsure the sentence structure flows Day 5 Tasks: Take a break so that you get the book out of your mindIf you want to publish your book, look for a publisher who would publish itTell them you already have a first draft, it makes you seem more legit Day 6 Tasks: Completely rewrite your book, to smooth out everything that doesn't flowCurb out everything that doesn't directly help the plot Day 7 Tasks: Repeat day 6 tasks Day 8 Tasks: Repeat day 6 tasks Day 9 Tasks: Repeat day 6 tasks Day 10 Tasks: Finalise your bookCreate a blurbWrite a table of contentsWrite a dedicationAdd the fine-printFollow up with the publisher saying you've done 5 drafts (if applicable)L'amour la meilleure enfant banane, Maddie ",
            "date": "Updated August 7, 2020",
            "views": "211",
            "upvotes": " View 6 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Talha Rafaqat",
                    "user_href": "/profile/Talha-Rafaqat"
                },
                {
                    "user_id": "Shahriyar Hridoy",
                    "user_href": "/profile/Shahriyar-Hridoy"
                },
                {
                    "user_id": "Hemant B",
                    "user_href": "/profile/Hemant-B-23"
                },
                {
                    "user_id": "Shana Chen",
                    "user_href": "/profile/Shana-Chen-3"
                },
                {
                    "user_id": "Daniel Kim",
                    "user_href": "/profile/Daniel-Kim-1596"
                },
                {
                    "user_id": "Ciarán Simpson",
                    "user_href": "/profile/Ciarán-Simpson"
                }
            ]
        }
    ]
}