{
    "title": "How to learn to write in Hindi - Quora",
    "tags": [
        "Hindi-Urdu (language)",
        "Urdu (language)",
        "Learning Languages"
    ],
    "response": [
        {
            "author_info": {
                "name": "Arjun Vadrevu",
                "href": "/profile/Arjun-Vadrevu"
            },
            "answer_text": "The Devanagari (देवनागरी) script is a phonetic one, meaning that it’s pronounced as it’s spelt and vice versa. Each phoneme (basic sound unit) has a character and these are joined together to make graphemes (i.e. words). For the most part, characters map one-to-one between the Devanagari (used by Hindi) and the Perso-Arabic script (used by Urdu). I grew up knowing Hindi, so when I wanted to learn Urdu, I had to find the equivalent Perso-Arabic characters for each of the Devanagari ones. A basic table can be found here, but a full list with the IPA pronunciation can be found here. You’ll eventually realise that it’s pretty simple. ک is क, چ is च and so on. Just a few things to note: Vowels. In Urdu (as with other languages written using Perso-Arabic scripts), vowel markings are typically not written in daily use. However, they always are in Devanagari. So you would need to learn the matras (मात्रा), or vowel diacritics. For example kitāb (book) would be written as کتاب (k-t-ā-b) in Urdu, but as किताब (k-i-t-ā-b) in Hindi.Furthermore, when used initially, the short sounds [a], [i] and [u] would all be represented as ا in Urdu, but as अ, इ and उ respectively in Hindi.Aspirated consonants. In Urdu, consonants are aspirated by adding ھ. However, in Hindi, each of these aspirated sounds has its own character. So کھ is ख, چھ is छ, and so on.Missing letters. Not all letters used in Urdu are used in Hindi. For example, ف and ق typically don’t exist in the Devanagari script. However, they are commonly represented by modifying existing letters, in these cases क़ and फ़ respectively. Some letters, though, just do not exist. ط, for example, might just be written as त (ت) in Devanagari.Different orthographies. Certain words may be spelt using different characters, but these are generally exceptions, as the two writing systems align quite nicely.",
            "date": "Answered August 15, 2018",
            "views": "769",
            "upvotes": " View 6 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Shamila Zubairi",
                    "user_href": "/profile/Shamila-Zubairi-1"
                },
                {
                    "user_id": "Apoorva Mahajan",
                    "user_href": "/profile/Apoorva-Mahajan"
                },
                {
                    "user_id": "Habib Shah",
                    "user_href": "/profile/Habib-Shah-43"
                },
                {
                    "user_id": "Ahmad El-Sheikh",
                    "user_href": "/profile/Ahmad-El-Sheikh-3"
                },
                {
                    "user_id": "Roan Ng",
                    "user_href": "/profile/Roan-Ng"
                },
                {
                    "user_id": "Siddhant S (सिद्धांत, سدھآنت, Сиддхант)",
                    "user_href": "/profile/Siddhant-S-सिद्धांत-سدھآنت-Сиддхант"
                }
            ]
        },
        {
            "author_info": {
                "name": "Amitabh Varma",
                "href": "/profile/Amitabh-Varma-2"
            },
            "answer_text": "Hindi is written in the Devnagari script. It is written from left to right. Unlike in Urdu, a single letter may be used in Devnagari for subtle different pronunciations. Usually you right what you speak. For example, ‘Kal’ can be written by righting two consonants - ‘Ka’ and ‘La’ one after another. So, the first step is to learn common vowels, consonants and matraas. The second step would be to write simple words such as ‘Kal’, ‘Bus’, ‘Ghar’, etc. Attempt more and more complicated words as you start enjoying your Devnagari experience. Best of learning! ",
            "date": "Answered August 13, 2018",
            "views": "252",
            "upvotes": " View 2 Upvoters ",
            "upvoters": [
                {
                    "user_id": "M. Vincent Holguin",
                    "user_href": "/profile/M-Vincent-Holguin"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/Sharma-G-21"
                }
            ]
        }
    ]
}