{
    "title": "How to learn Perl - Quora",
    "tags": [
        "Learning Perl",
        "Perl (programming language)",
        "Beginning Computer Programming Advice",
        "Learning New Things",
        "Learning to Program",
        "How-to Question",
        "Programming Languages"
    ],
    "response": [
        {
            "author_info": {
                "name": "Naveen Gupta",
                "href": "/profile/Naveen-Gupta"
            },
            "answer_text": "From my personal experience, the best way to learn Perl, or for that matter, any programming language is hands-on coding for real (or possible) issues in a real-world environment. Of course all the books mentioned by most posters here are great reference tools and contain tons of great code-samples and tips n tricks, but most of it does not make much sense unless applied to a situation being faced by you. In the very beginning of my programming career, I was thrown into a situation with a few books on Perl and access to internet, and given a couple of CGI applications to be coded. I have to admit, the first clues I had about how to proceed was not going through any of those books (also mentioned above), but by observing Perl source code from other similar applications, AND actively interacting with the amazing Perl community online.  Make CPAN your best friend. It contains the best and the most useful Perl code you will ever come across. Thousands of modules exist for functionalities many would never think of, and give you access to almost any imaginable web-service, system function, or a simple or complex IT process.  Try to download and install Perl, preferably on a *nix system. Configure CPAN, read through Man pages of modules, perldoc (http://perldoc.perl.org/) , perlfaq (http://theoryx5.uwinnipeg.ca/CPAN/perl/pod/perlfaq.html).  Install and configure Apache (or another web server) to run CGI applications, mod_perl etc. Subscribe to Perl mailing lists, become members of Perl forums like Perlmonks, Experts-exchange. Even reading the posts/comments of experts there is so enlightening that you feel learned every time you so!  Learn about and code with the modules/pragmas - CGI, DBI, Strict, Data::Dumper, LWP etc. Try out object-oriented Perl, references, regular expressions, JAPHs. Work with frameworks such as Mason, Catalyst etc. If you're a designer, learn about ImageMagick and many other image manipulation modules, if you are into games, then code a simple anagram solver, or go for sudoku! You'll surely find modules for these as well! The world of possibilities in the Perl-ecosystem is endless - whether you are a sysadmin, a systems programmer, a web developer, a hobbyist hacker, or just about anyone. You need to be creative enough to leverage the advantages of this beautiful and powerful tool, and must learn to use the resources that  are around.  The amazing thing about it is that you will almost always find a better way to re-write your code, and that makes you a better Perl coder! ",
            "date": "Answered April 19, 2011",
            "views": "65",
            "upvotes": " View 20 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Gabriel N. Ramalho",
                    "user_href": "/profile/Gabriel-N-Ramalho"
                },
                {
                    "user_id": "Rühàngãbâhõ Ríd Díçksõn",
                    "user_href": "/profile/Rühàngãbâhõ-Ríd-Díçksõn"
                },
                {
                    "user_id": "Brandt Labastille",
                    "user_href": "/profile/Brandt-Labastille"
                },
                {
                    "user_id": "Prasad Shinde",
                    "user_href": "/profile/Prasad-Shinde-3"
                },
                {
                    "user_id": "Soheil Sepahyar",
                    "user_href": "/profile/Soheil-Sepahyar-1"
                },
                {
                    "user_id": "Sejal K",
                    "user_href": "/profile/Sejal-K-11"
                },
                {
                    "user_id": "Nive Ishu",
                    "user_href": "/profile/Nive-Ishu-1"
                },
                {
                    "user_id": "Hari Rama Kishan S",
                    "user_href": "/profile/Hari-Rama-Kishan-S"
                },
                {
                    "user_id": "Saran Kumar",
                    "user_href": "/profile/Saran-Kumar-427"
                },
                {
                    "user_id": "Swati Bhat",
                    "user_href": "/profile/Swati-Bhat-13"
                }
            ]
        },
        {
            "author_info": {
                "name": "Wendy Knox Everette",
                "href": "/profile/Wendy-Knox-Everette"
            },
            "answer_text": "Come up with a problem you really need solved. If you have some regular expression experience with another language, and know grep, sed and awk, then a data munging problem is a good one to pick. Buy the Perl Cookbook and try out the example code. Extend it.  Ask a nearby person who also knows Perl (programming language) to help you out (if you're lacking that, try asking your question on http://perlmonks.org/ ). Become very familiar with Data::Dumper. Keep writing little scripts to solve small problems until you get fluent at using perl idioms. ",
            "date": "Updated August 19, 2011",
            "views": "64",
            "upvotes": " View 10 Upvoters",
            "upvoters": [
                {
                    "user_id": "Etienne Danis",
                    "user_href": "/profile/Etienne-Danis"
                },
                {
                    "user_id": "Jesse Hamner",
                    "user_href": "/profile/Jesse-Hamner"
                },
                {
                    "user_id": "Jordan Hristov",
                    "user_href": "/profile/Jordan-Hristov-2"
                },
                {
                    "user_id": "Shiva Mohan",
                    "user_href": "/profile/Shiva-Mohan-6"
                },
                {
                    "user_id": "Soumi Mitra",
                    "user_href": "/profile/Soumi-Mitra"
                },
                {
                    "user_id": "Mohamed Osama",
                    "user_href": "/profile/Mohamed-Osama-15"
                },
                {
                    "user_id": "Ankit Tripathi",
                    "user_href": "/profile/Ankit-Tripathi-55"
                },
                {
                    "user_id": "Redwan Khaled",
                    "user_href": "/profile/Redwan-Khaled"
                },
                {
                    "user_id": "Peter Mortensen",
                    "user_href": "/profile/Peter-Mortensen"
                },
                {
                    "user_id": "Laura Beth Lincoln Denker",
                    "user_href": "/profile/Laura-Beth-Lincoln-Denker"
                }
            ]
        }
    ]
}