{
    "title": "How to write a letter for taking a list of documents from a bank - Quora",
    "tags": [
        "Writing Letters",
        "Letters (mail)",
        "Documents",
        "Writing Advice",
        "Banks",
        "Writing"
    ],
    "response": [
        {
            "author_info": {
                "name": "Raja Subramanian",
                "href": "/profile/Raja-Subramanian-19"
            },
            "answer_text": "Documents of title to immovable properties are deposited to the financing bank- at the financing branch or any other branch of the bank in a centre notified by the Government. The deposition of title deeds in the bank’s office in a notified place is done to create what is known as Equitable mortgage of the properties. When the loan is closed by the borrower the Bank releases or returns the documents deposited to the person who deposited the documents. The bank takes the signature of the depositor on the Equitable Morgage register which contains the list of documents deposited earlier. That serves as an acknowledgement to the bank for having received the documents. No request letter is necessary. Sometimes if the documents are deposited in a place other then the lending branch, the bank may request a letter which contains the following information. Name and address of the depositor/borrower, loan number, date of deposition of title deeds and a statement that the loan was closed on a particular date and a request to release the documents deposited. The applicant’s signature will be attested by the financing branch and they will also confirm the closure of the account. The letter is to be finally given to the branch in person where title deeds were deposited. ",
            "date": "Answered August 31, 2019",
            "views": "16",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Sadaqat Khan",
                    "user_href": "/profile/Sadaqat-Khan-2"
                }
            ]
        }
    ]
}