{
    "title": "How to start freelancing in marketing - Quora",
    "tags": [
        "Freelancers",
        "Freelancing Tips and Hacks",
        "Freelancing"
    ],
    "response": [
        {
            "author_info": {
                "name": "Robert McGuire",
                "href": "/profile/Robert-McGuire-1"
            },
            "answer_text": "The most practical way is the side hustle approach, working after hours on getting your first client and building from there. Changes in technology mean that it's easier than ever to find work as freelancer or independent contractor. There are dozens of freelance websites that match skilled professionals and creative people with businesses that need them, and the kinds of work that can be done this way is growing all the time. It's estimated that up to one third of all workers are freelancing in some way. Many of those make their living that way, and most of the rest are building up from a side hustle. All it takes to get started is one customer or client who values your skills. Once you are working for yourself -- even if it's only for a couple hours a week -- you will be motivated to develop your skills, and you start getting clarity about what you have to offer. That might help you re-engage with your day job with a fresh perspective, to show your boss you are ready for more, or it might motivate you see your day job as a place to learn all you can while you prepare for you new goal of building your own freelance business. I love this answer to this question from my colleague Jessie Kwak in How to Start a Freelance Business In One Step? Why Reckless Is Best: “Your first step is to get one client. Change that one thing, and you change everything.” Essentially, she’s talking about the side hustle approach. ",
            "date": "Answered June 14, 2017",
            "views": "763",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Kelly Nurge",
                    "user_href": "/profile/Kelly-Nurge"
                },
                {
                    "user_id": "Pinaki Pillai",
                    "user_href": "/profile/Pinaki-Pillai"
                }
            ]
        },
        {
            "author_info": {
                "name": "Jakub Zajíček",
                "href": "/profile/Jakub-Zajíček-1"
            },
            "answer_text": "Hey, great question. I highly reccomend you pick your niche. It could be copywriting, online marketing (such as PPC, SEO, etc.), social media marketing, Speaking of my experience (SEO for 3 years now as a side job) it’s not that difficult as it seems to be on a start. When comes to gathering information about your topic, I reccomend you to stick to 1 - 2 sources of information about topic you choose. If you won’t, it’s possible you will get lost in an incredible amount of new information. You may ask, how to get your first clients. If you are confident about system you’ve created by reading guides and websites, I reccomend you this. Find first client and say this: “If it won’t work, you don’t need to pay me anything.” Marketing is all about money. If you help your client make more money, he will be more than happy to pay you back. If not, change your system and next time you’ll do good! Good luck!! :) Btw, I found really great class on SkillShare and I am pretty sure it’ll help you. Give it a shot! Going Freelance: Building and Branding Your Own Success | Justin Gignac | Skillshare ",
            "date": "Answered April 20, 2017",
            "views": "215",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Dan Kutuapi",
                    "user_href": "/profile/Dan-Kutuapi"
                },
                {
                    "user_id": "Hitesh Soni",
                    "user_href": "/profile/Hitesh-Soni-38"
                }
            ]
        },
        {
            "author_info": {
                "name": "Helen Marie Forsyth",
                "href": "/profile/Helen-Marie-Forsyth"
            },
            "answer_text": "Sales and marketing are linked but the skills for one are different to the other. It's easier to pitch your proposition and be noticed for it, if it's clear, so decide which discipline suits you best. Then, make sure if it's sales, you can demonstrate a good process and prove your experience and target achievements. If it's marketing, be clear about your skills (digital, content, brand and/or product marketing etc). Use LinkedIn, get it sparkling and bright. Request recommendations and make sure any old jobs are written with your new work in mind (you wanna get hired, right?!). Then it's all about networking, networking and more networking. Be clear about the kind of work you want and ask people to recommend you. Happy hunting! ",
            "date": "Answered April 19, 2017",
            "views": "353",
            "upvotes": " View 3 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Seo Shuvo",
                    "user_href": "/profile/Seo-Shuvo"
                },
                {
                    "user_id": "Lissa Jhone",
                    "user_href": "/profile/Lissa-Jhone"
                },
                {
                    "user_id": "Hitesh Soni",
                    "user_href": "/profile/Hitesh-Soni-38"
                }
            ]
        },
        {
            "author_info": {
                "name": "Veronica Domeier",
                "href": "/profile/Veronica-Domeier"
            },
            "answer_text": "If you’re just getting started, start small. Ask friends and relatives if they need any marketing, ask if they know anyone who needs your marketing services. Also do a little research on where people are looking for freelance marketers, what sites and services are they looking for. Let everyone you know you are offering freelance marketing and explain exactly what services you are offering. ",
            "date": "Answered April 21, 2017",
            "views": "118",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Lissa Jhone",
                    "user_href": "/profile/Lissa-Jhone"
                }
            ]
        },
        {
            "author_info": {
                "name": "Sanjaya Sethi",
                "href": "/profile/Sanjaya-Sethi"
            },
            "answer_text": "A freelance marketing consultant job is not a typical marketing job but is one where the candidate is not tied up to any company or employer. Freelancers provide marketing consultancy on an independent basis and work for clients who they search on their own. This job can be easily done at home or by working at the client’s office for as long as the consultant is needed for the project. Freelance marketing consultants outsource their services to clients who need temporary services. A freelance marketing consultant’s job can be as demanding as that of a regular fully employed marketing consultant. These individuals can work for multiple clients at the same time and may need to promote themselves in order to bag jobs. To be a successful freelance marketing consultant, one needs to have a balance of educational qualifications, skills, the right knowledge of the field and fulfilling of many duties and responsibilities. ",
            "date": "Answered April 13, 2019",
            "views": "56",
            "upvotes": " Answer requested by Benudhar Bhue",
            "upvoters": [
                {
                    "user_id": "Chiraphan Quan",
                    "user_href": "/profile/Chiraphan-Quan"
                }
            ]
        },
        {
            "author_info": {
                "name": "Tricia Labrie",
                "href": "/profile/Tricia-LaBrie"
            },
            "answer_text": "What kind of freelancing? What do you want to do? Sales is your thing. Is sales where you want to stay? Are you a good sales person? Do you like sales? I know you can be good at some things and still hate doing it. I hate sales and I am very good at it. Give me something to work with so I can help you? ",
            "date": "Answered December 11, 2016",
            "views": "119",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Grace Patton",
                    "user_href": "/profile/Grace-Patton-16"
                }
            ]
        },
        {
            "author_info": {
                "name": "Yotam Gutman",
                "href": "/profile/Yotam-Gutman-2"
            },
            "answer_text": "Just pick an areas you are good at and start asking the people in your network if they don’t mind you performing it for them for free. After you get some people to say yes,do it for some time and then ask them to pay for it. They will decline but instead ask them to serve as reference clients and help you get some of their connections to hire you. ",
            "date": "Answered February 6, 2018",
            "views": "118",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Christopher M. Gillespie",
                "href": "/profile/Christopher-M-Gillespie"
            },
            "answer_text": "Start on LinkedIn. Search jobs where hiring for the type of role you’d like to do freelance and shoot a message to the hiring manager and ask if they’d consider someone part time. It saves them money, let’s them try out the relationship before they commit, and helps them get results this quarter, not next. More ideas: How to Start Freelance Writing How to Break Into Content Writing ",
            "date": "Answered February 1, 2020",
            "views": "33",
            "upvotes": " View 1 Upvoter "
        },
        {
            "author_info": {
                "name": "Emile DeCandt",
                "href": "/profile/Emile-DeCandt"
            },
            "answer_text": "What skills do you have? If you have a marketable skill, then you should join Upwork or list your service on Fiverr. That is where I would start, but there are many sites you can list your services to make money online. ",
            "date": "Answered January 31, 2020",
            "views": "50",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Kevin Stewart",
                "href": "/profile/Kevin-Stewart-245"
            },
            "answer_text": "A freelance marketing consultant job is not a typical marketing job but is one where the candidate is not tied up to any company or employer. Freelancers provide marketing consultancy on an independent basis and work for clients who they search on their own. ",
            "date": "Answered April 15, 2019",
            "views": "26",
            "upvotes": " Answer requested by Benudhar Bhue"
        }
    ]
}