{
    "title": "How to start an essay on a given picture or scene - Quora",
    "tags": [
        "Essay Writing Help",
        "Essays",
        "Writing Advice"
    ],
    "response": [
        {
            "author_info": {
                "name": "Sandeep Reddy Komatireddy",
                "href": "/profile/Sandeep-Reddy-Komatireddy"
            },
            "answer_text": "Essay writing round: In the Essay writing round, one picture will be shown on the screen. You need to write an essay in 200 words. This essay should be completed in 15 minutes. This is also an elimination round. Example Picture: An old man crossing a road on zebra lines. One can write on how public infrastructure has become friendly for every traveller on the road. Or, you can write about how the life expectancy has increased in the modern world and how that might stress the GDP through social security net. For writing an essay, some of the useful points below. Text is prose. Check spelling, content, punctuation. The fundamental question should be: What am I attempting to express? And the answer is the text. Being lucid and absolute are the hallmarks of a good text. Short sentences indicate tension. Longer sentences, on the other hand, indicate a frantic need to finish off the writing! Words are NECESSARY. Expand vocabulary to make writing more spot-on. This is to not to say that one “flaunts” vocabulary, but having more “tools” will allow one to select the most appropriate “tool” for the job. So pick one new word each day, and then use it many times in the conversations with others that day. You can use vocab prep in Conduira Online to improve vocabulary. Avoid nonsense. No nonsense. Don't force a reader to spend 20 minutes when the idea can be conveyed in 5 minutes. More editing. Write once and edit umpteen times. Each time look for compactness in the text. If one is in doubt, remove certain parts of the text to check if the moot of the issue suffers. If that is not, then just remove. Creation of Interest. Every sentence must serve a purpose: The first sentence must make the reader want to read the second. The second sentence must propel the reader to the third. If a sentence doesn’t move the narrative forward— then it is the end of the writing. Avoid too many adverbs. A sure sign of amateur writing is the overuse of adverbs, especially -ly adverbs. A woman in a story isn’t incredibly pretty—she’s beautiful; the sky isn’t very blue—it’s azure. Find the right words to avoid using adverbs.\" ",
            "date": "Answered February 10, 2017",
            "views": "920",
            "upvotes": "0"
        }
    ]
}