{
    "title": "How to write a report on any topic - Quora",
    "tags": [
        "Report Writing",
        "Reports and Reporting (jobs and work)",
        "Writing Advice"
    ],
    "response": [
        {
            "author_info": {
                "name": "Vincent Fregeac",
                "href": "/profile/Vincent-Fregeac"
            },
            "answer_text": "As I answered on a very similar question: The best technique I know is to first create a “generic” outline, i.e. a report structure that is not directly related to the subject of the report but defines the how the different part of the report will flow to form a logical, interesting and easy to read document. For example, for a project report, a generic “outline” could look like: ContextObjectiveState-of-the-artChallengesetc.Then, fill each section of this “generic” outline with 1-liners that will list the ideas, concepts, actions, descriptions - related to the subject of the report this time - in no particular order for now. Do not hesitate to jump from one section to another when you realize you forgot something or that something you added in one section is not really useful for the rest of the document. Once all sections are filled, read this bullet point draft and make sure each of these 1-liner is useful for the comprehension of the rest of the document, remove orphans, and add 1-liners in previous sections if you realize that a topic you discuss in a later section was not introduced in the previous sections. When you have removed everything that was not necessary for the comprehension of the document, decide in which order you want to introduce these topics and, as much as possible, keep the same order in all sections, so it will create a rythme that makes reading the document easier. Once you have an outline full of ordered topics, you are almost ready to write but first, choose who is speaking (I, we, they) and a tense (past or present) and make sure you maintain these choices during the entire report. Ideally, also chose a style that will fit the purpose of the report and the impact it must have. And finally, apply conjugaison and style. This approach results in clear, interesting and easy to read reports without struggling too much. ",
            "date": "Answered January 23, 2018",
            "views": "15",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Andrew Morlini",
                "href": "/profile/Andrew-Morlini"
            },
            "answer_text": "Make a mind map. You could google what other people do but this is what I do: Determine your audience and what sort of piece you’re writing. Is it persuasive, informational, a narrative or something else?Divide your topic into three-four main topics. Let’s say I’m doing turtles. Topics could be habitat, eating behaviors, mating behaviors, origin of species, turtles in mythology, etc. Just divide your main subject into big chunks.Divide the topics into 2–3 sub-topics. Let’s take Turtle Habitat. You could divide that into North America, Europe and Asia.Once you have all your sub-topics write a paragraph for each one. Then write an introduction and a conclusion.The most important thing about writing is to just write. Get out a bunch of content then organize it in a way that makes sense and is appealing to your audience.",
            "date": "Answered October 22, 2019",
            "views": "15",
            "upvotes": "0"
        }
    ]
}