{
    "title": "How much does it cost to manufacture 355 ml (12 fl-ounces) of Coca-Cola? Do we pay much more than that? What accounts for the difference? How do they get so many people to pay so much more? - Quora",
    "tags": [
        "Coca-Cola (soft drink)",
        "Manufacturing"
    ],
    "response": [
        {
            "author_info": {
                "name": "Maria Xinhe Shen",
                "href": "/profile/Maria-Xinhe-Shen"
            },
            "answer_text": "Based on my estimates, the material cost for one can is ~$0.02. (Real pricing estimate is  $0.01575 - I just rounded up.) The Can Can estimate: $0.01/can Aluminum soda cans are around $0.05 - $0.10 per can for orders of less than 100,000 units. Prices decrease substantially as quantity increases, so I suspect that Coca-Cola is paying less than $0.01 per can, given that they distribute 1.9 billion servings of coke per day. Granted, some of these \"servings\" are from soda fountains and glass bottles, etc, but it gives a good picture of the scale at which they are operating. The Sugar Sugar estimate: $0.005/can (Please note that lots of coke use corn syrup instead of cane sugar, but my price estimate is for cane sugar) Sugar runs $200/ton for orders for orders of less than 50 tons. There's roughly 33 grams of sugar in one can of soda. Given the same logic, let's make an educated guess that 1.9 billion servings * 33 grams = ~63 billion grams There are 907,185 grams in a ton, so that's about 72,250 tons of sugar. Let's give them a 30% discount on the cost of sugar, which brings us to $140/ton, or ($140/907,185)*33 = $0.005/can for sugar. Water, CO2, Food Coloring, Flavors Everything else estimate: $0.00075/can User mentions that Coke pays \"10$ for 100,000 liters of water\". There's roughly 34 fl oz in a liter, and 12 fl oz in a can. Given some losses, let's just say that there's 2.5 cans of coke in every liter.  That translates to $10 on water for every 40,000 cans of Coke. That's $0.00025 spent on water per can. Let's add $0.0005 for all other things, like food color and flavoring. ",
            "date": "Updated April 6, 2016",
            "views": "1183",
            "upvotes": " View 69 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Alexander Kourtev",
                    "user_href": "/profile/Alexander-Kourtev-1"
                },
                {
                    "user_id": "Malachi Martinez",
                    "user_href": "/profile/Malachi-Martinez"
                },
                {
                    "user_id": "Vykintas Proscevic",
                    "user_href": "/profile/Vykintas-Proscevic"
                },
                {
                    "user_id": "James C. Maxwell",
                    "user_href": "/profile/James-C-Maxwell"
                },
                {
                    "user_id": "Andrew Watkins",
                    "user_href": "/profile/Andrew-Watkins-69"
                },
                {
                    "user_id": "David C. MacLean",
                    "user_href": "/profile/David-C-MacLean"
                },
                {
                    "user_id": "Frederick Frederickson",
                    "user_href": "/profile/Frederick-Frederickson-3"
                },
                {
                    "user_id": "Matt Ivanick",
                    "user_href": "/profile/Matt-Ivanick"
                },
                {
                    "user_id": "Michael E Losik",
                    "user_href": "/profile/Michael-E-Losik"
                },
                {
                    "user_id": "Alve Rayan",
                    "user_href": "/profile/Alve-Rayan"
                }
            ]
        },
        {
            "author_info": {
                "name": "Stephen Reamer",
                "href": "/profile/Stephen-Reamer"
            },
            "answer_text": "I can only surmise that the cost of the content and container combined are less than $.10 per.  When I was in the bottle manufacturing industry it would cost us about $.015 per 12 oz bottle.  If you did a look-up of commodity prices for sugar and corn syrup you could probably surmise the same thing is going on there also. The real cost is not value added.  Take a look at their advertising budgets and figure the transportation costs, add in overhead and you can see how quickly the costs escalate.  Everyone who handles the product adds cost (not value) and everyone is also entitled to profit.   You can do this for almost anything and can quickly see that the loss of a manufacturing base here in the US has not been beneficial to be price competitive.  Almost all costs are non value added.  Labor is inaccurately assumed to be the driving force behind the loss of manufacturing jobs here in the US.  This is far from the truth.  And it isn't corporate taxes either.  In the 16 years of ownership of a manufacturing business, not once did I ever pay corporate taxes. Be careful what politicians and pundits tell you, the real reasons for rising costs are not what they appear. ",
            "date": "Answered April 29, 2016",
            "views": "618",
            "upvotes": " View 29 Upvoters ",
            "upvoters": [
                {
                    "user_id": "David C. MacLean",
                    "user_href": "/profile/David-C-MacLean"
                },
                {
                    "user_id": "Frederick Frederickson",
                    "user_href": "/profile/Frederick-Frederickson-3"
                },
                {
                    "user_id": "Matthew Bacheller",
                    "user_href": "/profile/Matthew-Bacheller"
                },
                {
                    "user_id": "Zeeshan N",
                    "user_href": "/profile/Zeeshan-N-2"
                },
                {
                    "user_id": "Paul Smith",
                    "user_href": "/profile/Paul-Smith-252"
                },
                {
                    "user_id": "Jeff Yachcik",
                    "user_href": "/profile/Jeff-Yachcik"
                },
                {
                    "user_id": "Rick Gambsky",
                    "user_href": "/profile/Rick-Gambsky"
                },
                {
                    "user_id": "Orf Icos",
                    "user_href": "/profile/Orf-Icos"
                },
                {
                    "user_id": "Steve Baselice",
                    "user_href": "/profile/Steve-Baselice"
                },
                {
                    "user_id": "LoveNewYork",
                    "user_href": "/profile/LoveNewYork"
                }
            ]
        }
    ]
}