{
    "title": "How to use a teleprompter - Quora",
    "tags": [
        "Teleprompters",
        "Telepathy",
        "Telecommunications",
        "Learning New Things"
    ],
    "response": [
        {
            "author_info": {
                "name": "Praveenkumar Yadav",
                "href": "/profile/Praveenkumar-Yadav-10"
            },
            "answer_text": "Teleprompters have many benefits. They allow you to look at a camera without memorizing a text, and they can be used in front of cameras or on stage. In the past, teleprompters tended to be expensive, but with tablet computers, you can create your own teleprompter at home fairly cheaply. However, reading from a teleprompter takes some practice, so be sure to try it out before getting in front of the camera. There are certainly a lot of things to consider prior to enlisting a teleprompter on your shoot. Here are some of the thoughts that shook around my head after thinking about it for a few minutes. Consistency between takes – Probably the most obvious. You have a script. In theory, your Talent will read it. And you know what they are going to say. This helps a ton in conducting the interview, a keeps everyone on the same page as to what is going to be said.Controlled message – On that note, having a pre-approved script means that all team members know ahead what will be said on set. This is a big help with larger teams or making sure that higher-ups know what content will be included in the video. Your biggest job on set though is to make sure your Talent doesn’t look like a robot delivering this message.Faster turnaround time – (In most instances) shooting with a Teleprompter improves turnaround times in the post-production realm. Your shooting ratios should also improve using a teleprompter compared to straight interviews.Can easily adapt message on the fly – Even though there’s a script, it’s easy to tweak the script on the fly. That said if there are major changes it can get a little tricky. You need to make sure that the message stays consistent and on target with your team’s goals. But BEWARE this can be a Pandora’s box! We’ve been in too many shoots where the script opens up for discussion, and everyone thinks they have an answer. Dedicate one person as the script supervisor. Someone who won’t get caught up in listening to everyone’s opinions and who can keep the shoot on track.Consider the camera angle – Most of the times, your Talent is looking directly looking to camera. This is important to keep in mind. This means a second camera is going to be at an angle (the Talent won’t be looking directly at the camera unless they turn to address it, and that camera too has a teleprompter). Just keep in mind that some viewers find switching to an angle where the Talent doesn’t address the camera awkward if the Talent was just looking directly at the camera.Sense of timing – With a teleprompter script, you’ll get a pretty accurate understanding as to how long your video will be. You can eliminate sections on the fly if you find your video is running too long.Have the Talent adjust the script to “make it their own” – It’s a good idea not to surprise your Talent on set with a script they haven’t seen before. I’m not talking about professional Talent, but non-actors speaking on behalf of a corporation, a cause, etc. You don’t want them getting annoyed saying things like “…but I never speak like this!” Let them tweak the script ahead of time… and run those tweaks by all parties involved in the approval process.Is it really a faster shoot? – Typically speaking, using a teleprompter speeds up your shoot. But beware. This is if you don’t go tweak happy just because you think you can. This is where your shoot will grind to a halt.Not as easy as you would think – Reading from a Teleprompter isn’t as easy as you think. The words scroll. Your eyes move. You concentrate too hard on not messing up. You forget to blink. All of these things translate to an “obvious” teleprompter shoot. It’s up to the director to help guide the Talent who may have difficulties reading the script to feel as comfortable as possible… no matter how difficult it might be for the Talent to get through the script.Get comfortable with the script ahead of time – The tip above is why it’s a big help to get the script in front of your Talent as soon as possible. Let them practice reading script ahead of time. Maybe they read it to a mirror. As a director, I always look at my Talent’s eyes on the monitor. It’s all in their eyes. You’ll know right away if your Talent is comfortable with the script or not. Confident in front of the camera or not. It’s up to you to coach them from there.Get legal to bless the script – Do NOT overlook this simple fact. If you have a Legal department, get them to bless the script prior to filming. The last thing you want to do is make a claim that you cannot validate, or Legal says you cannot make. You’re kinda up the creek if you didn’t shoot any alternative takes…So, there you have it. While there certainly are a few other things to consider when using a Teleprompter, we’ve found taking these thoughts into consideration (when appropriate) helps us decide with our clients whether or not to use a Teleprompter. Questions, comments, concerns? (below) ",
            "date": "Answered January 21, 2020",
            "views": "30",
            "upvotes": " Answer requested by Sanket"
        },
        {
            "author_info": {
                "name": "Elangovan Sundaram",
                "href": "/profile/Elangovan-Sundaram"
            },
            "answer_text": "Teleprompter is having high quality glass kept at 45 degree to horizondal plane and in the bottom LCD/LED display monitor display the news fed thro computer in pages.Behind the glass TV camera is placed.The reader can read the matter on the display while TV camera will capture the video of the news reader.Small microphone is clipped with the dress of the news reader. ",
            "date": "Answered January 21, 2020",
            "views": "23",
            "upvotes": "0"
        }
    ]
}