{
    "title": "How to get a job in films or in a television production house - Quora",
    "tags": [
        "Movie Production",
        "Movie Business and Industry",
        "Television",
        "Jobs and Careers"
    ],
    "response": [
        {
            "author_info": {
                "name": "Carson Coots",
                "href": "/profile/Carson-Coots"
            },
            "answer_text": "Find a company you want to work for. Aggressively try to land an interview using your experience, demo reel, samples, credits, case-studies, and any other info you can share on a resume/cover letter. Don’t just send a resume and wait. This is assuming you have some experience. If you have no experience with production, it will be difficult to get any attention. You will need to create your own projects or spec projects, volunteering projects, or a listing on your resume that proves you are not totally green. If you look for these production house jobs on job boards, be aware that the companies getting are slammed with resumes. It could be that you are getting lost in the inbox. Try contacting companies that aren’t posting current jobs. Try nontraditional methods of getting your name in front of the right person. Use the phone. Call the front desk (more than once), be friendly and gather information from the gatekeeper in a casual way. You are looking to find out who you actually need to get in front of to get an opportunity to interview. Try sending your resume/letter via snail mail. Sometimes showing up (physically) to drop off your info will leave an impression. If they company is large, call the sales department/producer/account exec. Salespeople are usually more than happy to give out info and will be friendly. If you are charming enough, they may even introduce you to the right person via email. Many production houses are not in a position to hire full time. The website may look like a big company, and they may even have big clients listed. That doesn’t mean they are big. Many of them are one or two people using a handful of freelancers and can barely keep up with existing projects, much less new applicants. Break your goal of getting hired into smaller goals. The sole purpose of your initial contact is not to \"get a job\". It's to get a conversation going. It's to land an in-person interview. In any contact you make, ask questions and listen more than you talk. Asking the right questions says a lot about you. Find out what their pain points are, what they lack, what they desire. Don’t try to “show off”. Be humble and teachable. Be specific about what areas you can help with after you find out what they actually need. Be aggressive, send resume's /cold call more than once. Keep asking for a yes or no to an interview. And to throw a monkey wrench in this plan, try not to look desperate. You are not \"unemployed\", you are simply looking a fresh opportunity to apply the skills you have honed in your years of experience. Carson Coots https://www.cognitivefilms.com ",
            "date": "Answered June 21, 2019",
            "views": "18",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Daniela Buriak",
                    "user_href": "/profile/Daniela-Buriak-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Earl Dingman",
                "href": "/profile/Earl-Dingman-1"
            },
            "answer_text": "Staff jobs are all union. It costs $1,500 to $15,000 to join a given union. You can only do the work of that union job. To get into the union requires you to work a given number of hours or days (some unions are 50 hours, most are 90 days in a given year) or through a training program that pays $200 a day and takes a year or more to complete. Then you must join the union and GET YOUR OWN JOB. The only staff jobs are at TV stations and even those are subject to layoffs if the show is axed. Everything else is freelance and you have to get your own job by networking. Entry level jobs are like “runner” you need your own car and you’re working for the production company and a given movie or show. If the company is union you might have join as a Production Assistant after 90 days or they may lay you off after 89 days to keep from having to up your salary to union levels. For Runner you need your own car. Another way in is nonunion Extra. Pay’s around $100+ a day but you might start a 5am and work til 7pm (you have to be on time and work all day) or you might start at 6 pm and work until 8 am. Movie and TV jobs outside of the TV studio are usually 14–16 hours and can run 6 days a week and YOU are expected to show every day or they’ll give your job to someone else. Trainee jobs are like Assistant Director, Assistant Film Editor, Assistant Animator. They usually only train from within the industry (which means you already have a union job) or through a school or through a program with a lot of people applying. You need good transportation. You need to show up everyday and work 12–16 hours. TV station jobs are generally 8 hours, so no overtime, but sometimes you get gold time if you work Wednesday to Sunday 1 am to 8 am. You can’t do anyone else’s job. You can’ move things unless you have a union card for that. You can’t do this or that without a union card for this or that. They expect you to work at the same job for life, or go up the ladder from Grip to Best Boy/Girl to Key Grip to Dolly Girl. They expect you to go from Lighting tech, to rigger to gaffer to generator operator. If you collect cards you can do all those jobs if the one you want isn’t available. BUT you have to pay $1,000 to $6,000 for each card, plus quarterly dues, plus get your own jobs. ",
            "date": "Answered October 19, 2020",
            "views": "43",
            "upvotes": "0"
        }
    ]
}