{
    "title": "How to get free Robux - Quora",
    "tags": [
        "Robux"
    ],
    "response": [
        {
            "author_info": {
                "name": "Kevin Perez",
                "href": "/profile/Kevin-Perez-233"
            },
            "answer_text": "All those other people don’t know what they’re talking about. Of course you can. And I will show you how. Make a game w/ game passes.Alright, so you do know that the most popular games with expensive game passes on ROBLOX are made by creators who gain tons of robux each week, right? When you buy a game pass from a game, it sends the robux you spent to the game developer. If you are the developer of a popular game, with game passes, you are very likely to go to your homepage to find out you have a certain amount of Roblox Dollars(Robux. however much you made the gamepass) 2. Make clothing that people can buy You can make T-shirts, Shirts, Pants, and hats(maybe not hats but yeah). once you do, people can buy it and you gain robux from that. 3. Join a giveaway There are groups out there that distribute free robux to accounts. they do this by putting robux into group funds, then they go to “Distribute” and give people robux. Those are the ways to get free robux.The people who said no need to play the game more. ",
            "date": "Answered May 18, 2019",
            "views": "22",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Farouq Omar Samman",
                    "user_href": "/profile/Farouq-Omar-Samman"
                },
                {
                    "user_id": "Laurie Castaneda",
                    "user_href": "/profile/Laurie-Castaneda-3"
                },
                {
                    "user_id": "Tyrese Briggs",
                    "user_href": "/profile/Tyrese-Briggs"
                },
                {
                    "user_id": "Juulia Saarinen",
                    "user_href": "/profile/Juulia-Saarinen"
                }
            ]
        },
        {
            "author_info": {
                "name": "Guy Coate",
                "href": "/profile/Guy-Coate"
            },
            "answer_text": "Well I am an OG roblox player and let me disclose this to you.People who play roblox consistently need to get robux (the money) to purchase the things they so want, that is when con artists come in.Scammers range to media (Instagram,Twitter,youtube, and even Facebook), roblox index in the remarks (tho this is near dieing out), generators that \"guarantee free robux\" however gives you an infection rather, and games.Games work this way, an administrator of roblox (or now and again the roblox account itself) will join the game and individuals (players who don't exist) will make statements like \"omg it's roblox, would i be able to get some free robux\" and roblox (or any administrator) will answer with a \"yes\" and \"invigorate your page\".If you type something in them it won't show on the grounds that the talk you saw was a fake.Another model is an \"obby for robux\" for the most part individuals join (uninformed individuals) free roblox accounts that work… ",
            "date": "Answered April 14, 2020",
            "views": "13",
            "upvotes": " View 6 Upvoters",
            "upvoters": [
                {
                    "user_id": "Katherine Duplichan",
                    "user_href": "/profile/Katherine-Duplichan"
                },
                {
                    "user_id": "Ariana Lloyd",
                    "user_href": "/profile/Ariana-Lloyd-2"
                },
                {
                    "user_id": "Anisha Vannatter",
                    "user_href": "/profile/Anisha-Vannatter"
                },
                {
                    "user_id": "Adolfo Griffy",
                    "user_href": "/profile/Adolfo-Griffy"
                },
                {
                    "user_id": "Abir Ahmed",
                    "user_href": "/profile/Abir-Ahmed-133"
                },
                {
                    "user_id": "Gwenda Flannery",
                    "user_href": "/profile/Gwenda-Flannery"
                }
            ]
        },
        {
            "author_info": {
                "name": "Katherine Duplichan",
                "href": "/profile/Katherine-Duplichan"
            },
            "answer_text": "There is not a way to get free robux without doing any work, like selling gamepasses and clothing, DO NOT give your password away to a game that claims it will give you a lot of Robux because I promise, they will hack you and change your password. I know from experience, once i had an account with like 10k robux but there was this sponsered game and it looked really interesting so i tried it. It asked for my username and password, so i gave them my roblox username and the same password i used for my roblox account just so i could remember it. I thought mabey it was a game where you made an account to play and save your stuff, but then it said “you have won 1000000000000000 free robux and a Domino Crown!” I got really confused and left the game then i went to bed. the next morning i saw that my account was HACKED. So that is why there is no way to get free robux besides selling game passes etc. ",
            "date": "Answered July 21, 2020",
            "views": "333",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Vanessa Wong",
                    "user_href": "/profile/Vanessa-Wong-244"
                }
            ]
        },
        {
            "author_info": {
                "name": "Adam Barrish",
                "href": "/profile/Adam-Barrish-1"
            },
            "answer_text": "There is no such thing as free Robux. Free Robux would make Roblox shut down. Players buying Robux are the only thing keeping the website and client up and running so that other players enjoy the games. Believe it or not, maintaining a website costs money, and Roblox charges a small price for Robux so that it’s reasonable, yet enough to keep the site up. So this brings me to ask this question: Would you want Roblox free to play with the option of paying for Robux, Make Roblox a large one time purchase so that everyone can access everything (this would be impractical because the price of the game would get up into the tens of thousands), or would you have everything free, but you wouldn’t get to play any games or access the site at all? ",
            "date": "Answered January 7, 2020",
            "views": "1",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Donovan Minckler",
                    "user_href": "/profile/Donovan-Minckler"
                }
            ]
        },
        {
            "author_info": {
                "name": "Miah Quimpo (ジレイマヤ)",
                "href": "/profile/Miah-Quimpo-ジレイマヤ"
            },
            "answer_text": "So… be very careful about where you go for free robux. There are several scams related to this. I have found a website that did work but I can’t remember what it was. Essentially I would do these surveys for robux. It didn’t always work but most of the time I was able to get some. Never give your password away. No one needs it but you. Most of the items I have on my account is from the Robux I earn by doing those surveys. What is happening here is that you are trading information for a currency. Just be very careful before doing anything and be sure to have the stuff to protect against malware. Edit: If you wanna have a look for proof, my ign is Rhetorical_Save. ",
            "date": "Answered June 10, 2019",
            "views": "16",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/Gapfhog"
                }
            ]
        },
        {
            "author_info": {
                "name": "Herbert Apraku",
                "href": "/profile/Herbert-Apraku"
            },
            "answer_text": "Most website that is made for free robux doesn’t work. It’s just fake. If you see a bot or a random group member that dresses with no robux and says “Free robux at blah blah blah,” it’s probably fake. And in YouTube videos, you can see their robux changing, which they only used a feature called “Inspect Element”. That feature can change the look of a website, but it can’t really change the website. For example, you can use it to look like you got 1 million robux, but you won’t be actually granted. It will only go if you refresh the page, and you have to start again. However, some websites do grant you some robux, just saying, so not all free robux websites are bad. Anyway, the easier way is to just buy it with money ",
            "date": "Answered May 1, 2020",
            "views": "232",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Tom Douglas",
                "href": "/profile/Tom-Douglas-54"
            },
            "answer_text": "The only free way that is legal is if someone owns a group they can give you some through the funding system. Be in mind that this group has to have funds which is earned by selling roblox clothing and then plus to make clothing and a group you need builders club so unless you can find someone that is willing to give you some from there group funds (which the chance of finding someone like that is like 1%) then I would just buy builders club where you get robux daily! ",
            "date": "Answered May 16, 2019",
            "views": "528",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Annika 12131",
                    "user_href": "/profile/Annika-12131"
                },
                {
                    "user_id": "Ryan XD",
                    "user_href": "/profile/Ryan-XD-10"
                }
            ]
        },
        {
            "author_info": {
                "name": "Turkish Ahmet",
                "href": "/profile/Turkish-Ahmet"
            },
            "answer_text": "Do you think there is no such thing as free robux ? don’t worry. THERE IS SOME METHODS THAT AREN’T ILLEGAL. Method 1 - Create and sell shirts and pants (requires roblox premium/builders club)Method 2 - Create a game and sell gamepassesMethod 3 - Join robux rafflesMethod 4 - Trade somethings for robux in games like rumble quest,pet simulator etc.If you aren’t able to use any of these methods,you can’t get free robux. ",
            "date": "Answered February 11, 2020",
            "views": "347",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Ava Farrugia",
                "href": "/profile/Ava-Farrugia-2"
            },
            "answer_text": "First of all, Robux is not a necessity to survive. In life, technically nothing cannot be earned for free. You must do an action to do this. In this case, it’s getting a job or finding ways to earn the money so you can eventually afford it. You can do survey sites, paper routes and maybe even allowance or chores to do from your neighbours. One thing in the winter you might be able to do if you have the physical strength is to start a service to your neighbours such as shovelling snow on the sidewalk in exchange for some quick cash. ",
            "date": "Answered May 15, 2019",
            "views": "237",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Skyler Tan",
                    "user_href": "/profile/Skyler-Tan-8"
                },
                {
                    "user_id": "Aakash Khatri",
                    "user_href": "/profile/Aakash-Khatri-19"
                }
            ]
        },
        {
            "author_info": {
                "name": "Juulia Saarinen",
                "href": "/profile/Juulia-Saarinen"
            },
            "answer_text": "1 Find and buy robux gift card from shops or gamestores and select robux from roblox website and redeem it there. 2 From groups, maybe needed builder club for that to get free robux from group/s or how it works. Anyways there are not so many ways. If i’m honest, so i dont really know can nonbuilder clubs get robux from groups, maybw, maybe not? Ive never seen someone getting robux from groups, but im not them, also i dont have experience of if. ",
            "date": "Answered August 19, 2019",
            "views": "230",
            "upvotes": " Answer requested by Youtube Kid XD",
            "upvoters": [
                {
                    "user_id": "Neyenon Corrales",
                    "user_href": "/profile/Neyenon-Corrales"
                },
                {
                    "user_id": "Lungile Mooketsi",
                    "user_href": "/profile/Lungile-Mooketsi"
                }
            ]
        },
        {
            "author_info": {
                "name": "Yan Chekan",
                "href": "/profile/Yan-Chekan"
            },
            "answer_text": "You cant Everyone on this space asks the same question, \"how do I get free robux\". Look, Free Robux is not a thing, it does not and cant exist. You cant get money without having a job, that's the principle of real life. Look and remember this phrase: \"If it's too good to be true, then it probably is\" -me, the wise Robloxian. ",
            "date": "Answered October 21, 2020",
            "views": "22",
            "upvotes": " Answer requested by Stephen Xing",
            "upvoters": [
                {
                    "user_id": "Xing Xing",
                    "user_href": "/profile/Xing-Xing-84"
                }
            ]
        },
        {
            "author_info": {
                "name": "Rip Lava Collecter",
                "href": "/profile/Rip-Lava-Collecter"
            },
            "answer_text": "You can't have free robux, The people who are trying to get poor people free robux are shutting roblox down. You must stay as a normal character. Note that do NOT try to get free robux. You can go to jail or banned from Roblox for doing so. As so, please ask people to make sure your Roblox account is older. If not, they can bully you. ",
            "date": "Answered March 11, 2020",
            "views": "298",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Tyrese Briggs",
                "href": "/profile/Tyrese-Briggs"
            },
            "answer_text": "Some others have a point. You can GET free Robux without being builders club (premium). Add some gear or game-pass. So if others are interested, they can purchase it and you should able to have Robux. There are other steps to gain Robux quickly too! Making clothing! Members in Roblox like seeing cool clothing that others wanted to purchase. Doing this step can gain your Robux quickly. ",
            "date": "Answered May 15, 2020",
            "views": "104",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Tiffany Vicario",
                "href": "/profile/Tiffany-Vicario"
            },
            "answer_text": "No, it’s not possible to get free robux. You have to either buy it with a gift card or credit/debit card. Or if there happens to be a giveaway on roblox that is legit, there you go. I just don’t think it is possible to get free robux. ",
            "date": "Answered May 21, 2018",
            "views": "771",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Ava Reyes",
                    "user_href": "/profile/Ava-Reyes-15"
                },
                {
                    "user_id": "Alynn Plato",
                    "user_href": "/profile/Alynn-Plato-2"
                },
                {
                    "user_id": "Nika Tsalkenashvili",
                    "user_href": "/profile/Nika-Tsalkenashvili"
                }
            ]
        },
        {
            "author_info": {
                "name": "My Us",
                "href": "/profile/My-Us-4"
            },
            "answer_text": "With there platform, you can earn ROBUX completely legitimately and receive them instantly. Thousands of users have already received their payouts. Earn ROBUX with us today, and buy yourself a new outfit, gamepass, or whatever you want in ROBLOX! so technically might sound like a scam so what you have to do to get robux is to join there group it will show you when you redeem no verification no matter what seriously and get a hundred rublins are worth one robux right so this is coming from me so i got one robux now i have 217 rublins dont try other websites they are scams please try this one dont use other websites because they just want information ok so listen i may be 10 years old but seriously it works.Roblominer! ",
            "date": "Answered October 20, 2020",
            "views": "17",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Doritophk Dor",
                "href": "/profile/Doritophk-Dor"
            },
            "answer_text": "Hey, look there. There isn't ROBUX FOR FREE. YOU NEED TO FRICKING BUY THEM. U can donate to players BUT U DON’T GET THEM FOR FREE. Even a bacon noob knows that AND ROBUX GENERATORS ARE SCAMS. ",
            "date": "Answered November 5, 2019",
            "views": "55",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Jay Ford",
                    "user_href": "/profile/Jay-Ford-63"
                },
                {
                    "user_id": "Rabih Chebaklo",
                    "user_href": "/profile/Rabih-Chebaklo"
                }
            ]
        },
        {
            "author_info": {
                "name": "Aidan Jendro",
                "href": "/profile/Aidan-Jendro"
            },
            "answer_text": "Your question isn’t very clear, but I think roblox could set up a thing for watching ads gets you maybe five robux per ad. Also, roblox used to have a system called tix, but they sadly removed it because they thought it wasn’t used enough. What it did was give 10 tix a day and 100 tix could be converted into a robuck. ",
            "date": "Answered May 29, 2018",
            "views": "233",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Asher Smith",
                "href": "/profile/Asher-Smith-64"
            },
            "answer_text": "go to roblox studiodownload on your browserget creatingPlease read: if you want to make robux by making a game then you'll need game passes or a donation zone but still make the game fun and not so boring but doing this you'll need to share it on YouTube, discord, Reddit etc so people can come so they can buy your products ",
            "date": "Answered May 27, 2020",
            "views": "826",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Tim Yang (aka Artfvlly)",
                "href": "/profile/Tim-Yang-aka-Artfvlly"
            },
            "answer_text": "Instead of writing another answer I will link my old answer: Tim Yang (aka Artfvlly)'s answer to How do I get free 1,000,000 Robux? Hope this helps! Feel free to send a message or follow me. Tim Yang ",
            "date": "Answered October 9, 2019",
            "views": "611",
            "upvotes": " View 3 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Michael Claypool",
                    "user_href": "/profile/Michael-Claypool-3"
                }
            ]
        },
        {
            "author_info": {
                "name": "Darius Barrientes",
                "href": "/profile/Darius-Barrientes"
            },
            "answer_text": "well maybe you can use honey (the browser) to use a coupon for it to be cheaper and less money to pay (i know it said free but that isn’t possible unless you know hacking or can hack really good because roblox is protected in that region ",
            "date": "Answered May 22, 2020",
            "views": "47",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Hannah Eklund",
                "href": "/profile/Hannah-Eklund-1"
            },
            "answer_text": "The answer is YOU CAN’T. Don’t trust any adds or ROBLOX players saying that a website can give you free robux it’s all a lie. If players are telling you that a website has given them free robux they might have been hacked, please stay safe. ",
            "date": "Answered June 8, 2019",
            "views": "150",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Vibhore Kataria",
                "href": "/profile/Vibhore-Kataria"
            },
            "answer_text": "These are the only way to get or earn Robux:- https://en.help.roblox.com/hc/en-us/articles/203313200-How-to-Get-Robux-RBX- And there is no way to get free Robux. ",
            "date": "Answered May 24, 2019",
            "views": "92",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Seb Olsen",
                "href": "/profile/Seb-Olsen-3"
            },
            "answer_text": "No, there is no way to legitimately get “free” robux. Websites which offer “free robux generators” will end up scamming you one way or another. If you want free robux, you should participate in Youtube giveaways. ",
            "date": "Answered June 4, 2020",
            "views": "67",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Johnny Laursen",
                "href": "/profile/Johnny-Laursen-4"
            },
            "answer_text": "You can’t. Don’t fall into the illusion that you can get anything that sounds too good to be true because it is! So go to your local gaming store and buy Robux with your hard-earned money (or parent’s). *Don’t put yourself in danger by signing up for free Robux sites. It is a scam.* ",
            "date": "Answered September 4, 2019",
            "views": "104",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Brian Cao",
                "href": "/profile/Brian-Cao-31"
            },
            "answer_text": "Well, I'm not sure if there are many ways to get free robux, but one way is if you download apps. After the downloads you can join a specific group in roblox where you can “cash out” for robux. This depends on how many things you do. Link: https://oprewards.com/r/4682701 ",
            "date": "Answered September 25, 2020",
            "views": "12",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "James Brown",
                "href": "/profile/James-Brown-1296"
            },
            "answer_text": "You can’t, almost all other ways to gain free robux are scams end of story. ",
            "date": "Answered June 29, 2020",
            "views": "38",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Musab Qaiyum",
                    "user_href": "/profile/Musab-Qaiyum"
                }
            ]
        },
        {
            "author_info": {
                "name": "Ryan Lin",
                "href": "/profile/Ryan-Lin-149"
            },
            "answer_text": "It is possible, just not in big quantities. Reward websites do not work. Your best hope of getting free robux is from group donations to you. Join a big group like a YouTubers and they might do donations of robux using group funds. ",
            "date": "Answered June 9, 2019",
            "views": "61",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Oskar Qwert",
                "href": "/profile/Oskar-Qwert"
            },
            "answer_text": "There is no Free without work method, but selling assets, games, or gamepasses can earn you robux, and even for outrageous Builders club members you can get real money ",
            "date": "Answered May 22, 2019",
            "views": "40",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Scotty Oney",
                "href": "/profile/Scotty-Oney-1"
            },
            "answer_text": "I have been around a couple year LOL and I ain't never seen nobody get anything for nothing so if you really want it you will have to earn the money open up a banking account download an enjoy ",
            "date": "Answered February 17, 2020",
            "views": "47",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Kane Schlichting",
                "href": "/profile/Kane-Schlichting"
            },
            "answer_text": "You don’t. Robux are worth real money and anyone offering you something worth real money for free on the Internet is looking for credit card details, trying to get you to download malware, intending to sell your personal information to scammers, or all of the above. ",
            "date": "Answered September 23, 2019",
            "views": "137",
            "upvotes": " Answer requested by Nemke Pfc",
            "upvoters": [
                {
                    "user_id": "Milica Rvović",
                    "user_href": "/profile/Milica-Rvović"
                }
            ]
        },
        {
            "author_info": {
                "name": "Choese Trivel",
                "href": "/profile/Choese-Trivel"
            },
            "answer_text": "Step 1: Give up. Step 2: Give up. Step 3: Give up. There is no way to legitimately get free Robux without being hacked or banned. 400R$ is 5 dollars. Just buy it. ",
            "date": "Answered June 22, 2020",
            "views": "178",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Jose Huerta",
                "href": "/profile/Jose-Huerta-57"
            },
            "answer_text": "Yes, although you will need to persuade a group owner of a group you are in to give you robux. (Try not to bother the hell out of him/her though.) ",
            "date": "Answered December 18, 2018",
            "views": "50",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Evita Balčiūnaitė",
                    "user_href": "/profile/Evita-Balčiūnaitė"
                }
            ]
        },
        {
            "author_info": {
                "name": "Neal McLain",
                "href": "/profile/Neal-McLain-3"
            },
            "answer_text": "What are “Roupucks”? A Google Search turns up Did you mean: “Roubucks“ ? ",
            "date": "Answered June 25, 2020",
            "views": "48",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Ferdi Memaj",
                    "user_href": "/profile/Ferdi-Memaj"
                }
            ]
        },
        {
            "author_info": {
                "name": "Keiko Hitashi",
                "href": "/profile/Keiko-Hitashi"
            },
            "answer_text": "There are no real ways to get robux. Sadly, most “free robux” websites are scams. I request you do not try using these websites, and stay safe. ",
            "date": "Answered July 22, 2020",
            "views": "16",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Admin Plays",
                "href": "/profile/Admin-Plays"
            },
            "answer_text": "You can actually earn Robux using sites like Rocash but their offers are time consuming ",
            "date": "Answered June 3, 2020",
            "views": "30",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Andy Then",
                    "user_href": "/profile/Andy-Then-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Jordan Williams",
                "href": "/profile/Jordan-Williams-412"
            },
            "answer_text": "maybe ",
            "date": "Answered May 21, 2018",
            "views": "365",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Marshall Holian",
                    "user_href": "/profile/Marshall-Holian"
                }
            ]
        },
        {
            "author_info": {
                "name": "Minh Teng",
                "href": "/profile/Minh-Teng"
            },
            "answer_text": "yes u can ",
            "date": "Answered December 20, 2018",
            "views": "122",
            "upvotes": " View 1 Upvoter"
        },
        {
            "author_info": {
                "name": "Caleb Demars",
                "href": "/profile/Caleb-Demars-3"
            },
            "answer_text": "u cant ",
            "date": "Answered December 12, 2019",
            "views": "673",
            "upvotes": " View 1 Upvoter"
        },
        {
            "author_info": {
                "name": "Victor Holian",
                "href": "/profile/Victor-Holian"
            },
            "answer_text": "yes ",
            "date": "Answered May 18, 2020",
            "views": "31",
            "upvotes": " View 1 Upvoter "
        },
        {
            "author_info": {
                "name": "Jim Steele",
                "href": "/profile/Jim-Steele-76"
            },
            "answer_text": "most methods aren’t really safe but if you want you can go into group recruiting plaza and scam groups into giving you 10 robux for uniforms LOL ",
            "date": "Answered February 14, 2020",
            "views": "65",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Barrett Starr",
                "href": "/profile/Barrett-Starr"
            },
            "answer_text": "Well, there are possible ways like OPrewards and other sites that you can use to get free Robux. ",
            "date": "Answered April 20, 2020",
            "views": "91",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Owen O'Connor",
                "href": "/profile/Owen-OConnor-6"
            },
            "answer_text": "Am I seriously fed up of questions like this, THERE IS NO WAY TO GET FREE ROBUX!!! ",
            "date": "Answered June 8, 2019",
            "views": "43",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Sophia Lye",
                "href": "/profile/Sophia-Lye"
            },
            "answer_text": "you can’t get any you have to pay because there’s stuff that you have to download and it doesn’t work ",
            "date": "Answered July 1, 2020",
            "views": "21",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Alex Gheorghe",
                "href": "/profile/Alex-Gheorghe-12"
            },
            "answer_text": "You can by making games. But DON’T Trust that bots which it will give you a link of a site for free robux ",
            "date": "Answered May 25, 2019",
            "views": "17",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Rachel Kok",
                "href": "/profile/Rachel-Kok-12"
            },
            "answer_text": "No. Absolutely not. It is impossible to get free robux. There is only one way, and thats to get group creators to donate some to you. ",
            "date": "Answered April 17, 2019",
            "views": "36",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Keita Hashimoto",
                "href": "/profile/Keita-Hashimoto-1"
            },
            "answer_text": "No Technically, if you count giveaways as free then yes but all free robux sites are scams and will get your account banned or hacked, whichever comes first. ",
            "date": "Answered April 28, 2020",
            "views": "89",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Vivek Saha",
                "href": "/profile/Vivek-Saha-12"
            },
            "answer_text": "no… do not take the risk by providing information to the sites … you will surely get hacked ",
            "date": "Answered May 29, 2019",
            "views": "25",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Callum McNeill",
                "href": "/profile/Callum-McNeill-4"
            },
            "answer_text": "Find a free robux generatorget scammedgive up.hope this helped ",
            "date": "Answered November 26, 2018",
            "views": "157",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Tom Lansing",
                "href": "/profile/Tom-Lansing-3"
            },
            "answer_text": "№ its a scam that people post in comments for products and ads ",
            "date": "Answered May 21, 2020",
            "views": "18",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Bantech Systems",
                "href": "/profile/Bantech-Systems"
            },
            "answer_text": "It is impossible. Only availible in OFFICAL Giveaways ",
            "date": "Answered June 4, 2020",
            "views": "23",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Gringo Guy",
                "href": "/profile/Gringo-Guy"
            },
            "answer_text": "If you’re cool, then you will. ",
            "date": "Answered June 8, 2018",
            "views": "208",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Bandeau’ Boutique",
                "href": "/profile/Bandeau-Boutique"
            },
            "answer_text": "How do u get free robux ",
            "date": "Answered April 30, 2019",
            "views": "28",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Shepherd Prunty-Turner",
                "href": "/profile/Shepherd-Prunty-Turner"
            },
            "answer_text": "You cannot get free robux. ",
            "date": "Answered July 10, 2019",
            "views": "93",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Dilara Dolan",
                "href": "/profile/Dilara-Dolan"
            },
            "answer_text": "You can't but, tell your parents you'll do chores for the month for some! ",
            "date": "Answered April 27, 2020",
            "views": "18",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Sole Escobedo",
                "href": "/profile/Sole-Escobedo"
            },
            "answer_text": "Premium: 5 = 450 10 = 1,000 15 = 2,200 Buying normally: 450 = 5 10 = 800 20 = 1,700 50: 4,500 100: 10K 22,500 (Not anymore)75,900 (Not anymore) ",
            "date": "Answered June 10, 2020",
            "views": "33",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Ed U Johnson",
                "href": "/profile/Ed-U-Johnson"
            },
            "answer_text": "cheat ",
            "date": "Answered April 28, 2020",
            "views": "17",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Jessa Wagner",
                "href": "/profile/Jessa-Wagner"
            },
            "answer_text": "No. ",
            "date": "Answered June 17, 2020",
            "views": "46",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Robloxian Giveaways",
                "href": "/profile/Robloxian-Giveaways"
            },
            "answer_text": "ask yo mom yo he he ",
            "date": "Answered May 26, 2020",
            "views": "43",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Ibrahim Asfour",
                "href": "/profile/Ibrahim-Asfour-4"
            },
            "answer_text": "no ",
            "date": "Answered March 14, 2020",
            "views": "69",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Noland Egenias",
                "href": "/profile/Noland-Egenias"
            },
            "answer_text": "No ",
            "date": "Answered September 30, 2019",
            "views": "21",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Andrew Joubert",
                "href": "/profile/Andrew-Joubert-4"
            },
            "answer_text": "No ",
            "date": "Answered March 24, 2019",
            "views": "35",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Jimin Park",
                "href": "/profile/Jimin-Park-307"
            },
            "answer_text": "No ",
            "date": "Answered April 16, 2019",
            "views": "30",
            "upvotes": "0"
        }
    ]
}