{
    "title": "How to stop writing awkward dialogue in my books - Quora",
    "tags": [
        "Dialogue",
        "Creating Writing Advice",
        "Creative Writing",
        "Writing Advice",
        "How-to Question"
    ],
    "response": [
        {
            "author_info": {
                "name": "Martyn V. Halm",
                "href": "/profile/Martyn-V-Halm"
            },
            "answer_text": "\"How can I stop writing awkward dialogue in my books?\" Every character is a protagonist in their own story. Start with that, and see that the dialogue shouldn't be one-sided. Make sure that each character responds from their own frame of reference and does so to further their personal goals (which could be compliant with the other person's goals, but doesn't have to be), so that an argument is two- or three-sided.  I'll give you an example: Bram Merleyn is a blind musician. The day before, he picked up a tsuba for a friend at a gallery owned by Klaas Dolfijn. When Bram collected the tsuba, a strange woman was alone in the gallery, claiming that Klaas had urgent business elsewhere. Now Bram is having lunch at his sister's luncheonette, and gets unnerving news: Bram Merleyn listened to the whirling ceiling fan and the hum of the diner’s refrigerated counter while his sister Bianca leafed through Het Parool, cleared her throat and said, “Here it is. ‘Gallery Owner Killed With Own Sword’.” Her voice echoed slightly in the deserted diner. The newspaper brushed the back of his hand and Bram pulled the plate with sandwiches onto his lap. “Don’t drag the paper through my food.” “After you heard this, you probably won’t even want your food anymore.” “Are you sure you want to read it to me?” Bianca riffled the newspaper. “Are you saying you don’t want to hear it?” “Not if it will spoil my appetite.” “If you don’t want—” “Just read it.” Bram took a bite from his sandwich. She folded the paper. “Late last evening the police found the mutilated corpse of Klaas Dolfijn in the office of his gallery in the Amsterdam Jordaan quarter. The victim was stabbed with a Japanese sword from his own collection. The gallery owner seems to have been killed in the course of a robbery. The police have no clue yet as to the identity of the perpetrators, but are following several leads.” Bram swallowed. “They follow leads without clues?” “Newspaper jargon.” The paper crackled. “When you went to get that… ‘thing’. Was he still alive?” “Of course. You think I pried it from his cold dead fingers?” “His gallery is two hundred meters from here.” “Two hundred and sixty-eight.” Bram shrugged. “And he was skewered for the contents of his safe. You don’t even have a safe.” “How can you be so callous? Someone we knew got murdered in broad daylight!” “I didn’t ‘know’ him. Neither did you. All you ‘knew’ was Klaas preferred ciabatta over rye.” He chewed his food. “And I don’t think there was much daylight in his gallery.” “I made the poor man breakfast yesterday.” “Well, at least he didn’t die on an empty stomach.” “Jesus, Bram.” She scrunched up the paper. “Why do I still talk to you?” “Because your boyfriends are too stupid for conversation. Did you kick Olaf out yet or do I have to help?” “I gave him notice to get out by the end of next week.” “‘Notice’?” Bram put down his sandwich. “Why not give him your wallet, so he won’t have to ransack your apartment?” “I can’t kick him out, he has no place to go.” “Tough. He should’ve kept his fingers from your money.” “It was only fifty euro, and he promised…” “Only fifty euro.” Bram took her hand. “We really have the same genes?” “Yours are warped.” She pulled her hand from his grasp. “You don’t know what ‘compassion’ means.” “Oh, but I do. Compassion: listening to a month’s worth of snivelling when you break up with yet another asshole.” She scooted from the booth and stalked away, shoes clacking on the tiles. Bram tossed the folded paper over his shoulder into the empty booth behind him, put his plate back on the table, and resumed his lunch. So Klaas had been killed with one of his own swords. Ten to one the woman who gave him the tsuba was responsible. Explained her volatile attitude. He finished his last sandwich, licked his fingers and wiped them on a napkin. “Can I have another cup of tea?” “I have to prepare for lunch hour.” A refrigerator slammed shut. “You better get going.” Bram pulled out his cane, the parts clicking in place. As he walked to the door he felt her gaze on him.  “Kick Olaf in the nuts for me.” “Violence never solves anything. You told me that.” “There’s an exception to every rule.” “Right. Have a nice weekend.” “I’ll tell you all about it.” He paused with his hand on the doorknob. “Unless a city bus runs me over.” Bianca sighed audibly. “Why would a bus run you over?” “Drowsy from your tasty sandwiches, I pay less attention to traffic, step from the curb and get turned into a grease spot.” “You really shouldn’t make jokes about that.” “It’s no joke. They paint them yellow, but I still can’t see them coming. And as those big wheels grind me into the pavement, my last thoughts will be of being kicked out of your luncheonette without so much as a good-bye kiss.” Bianca approached him, put her arms around his neck. “Instead of telling me morbid fantasies you could just ask me for a kiss.” “My way is more fun.” Bram kissed her cheek and left the luncheonette. - Reprobate, by Martyn V. Halm   If you want to practice writing this kind of dialogue, try to make the conversation more interesting by shifting your own perspective every time someone responds to the other, so you're arguing with yourself. As an author, you should be able to pick any topic and write down an argument between someone who is pro and someone who is anti. And make sure they both want to be considered right. ",
            "date": "Answered February 10, 2016",
            "views": "990",
            "upvotes": " View 7 Upvoters",
            "upvoters": [
                {
                    "user_id": "Zsolt Farkas",
                    "user_href": "/profile/Zsolt-Farkas-4"
                },
                {
                    "user_id": "Asha Abdi",
                    "user_href": "/profile/Asha-Abdi-9"
                },
                {
                    "user_id": "Bu Woke",
                    "user_href": "/profile/Bu-Woke"
                },
                {
                    "user_id": "Kislay Aditya Kashyap",
                    "user_href": "/profile/Kislay-Aditya-Kashyap"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/John-Widden"
                },
                {
                    "user_id": "Robert Dixon",
                    "user_href": "/profile/Robert-Dixon-1"
                },
                {
                    "user_id": "Drew Nichol",
                    "user_href": "/profile/Drew-Nichol-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Jo Roderick",
                "href": "/profile/Jo-Roderick"
            },
            "answer_text": "I find dialogue very easy to write. When I’m writing dialogue rich sections, it goes very quickly. I believe one of the secrets to good dialogue is to be chatty yourself. If the writer isn’t an extrovert by nature, and a conversationalist, I will advise spending time in public areas, just listening in on conversations. What this does is show you how a conversation flows. Observe what is not said, but implied, which you can mould into well-written dialogue and actions. Perhaps you find your dialogue is a little awkward because it is to perfectly written. I think the narrative should be written properly, but quoted speech should be more relaxed. While I disapprove of starting sentences, paragraphs, and even chapters with ‘and’, it is quite natural in real conversation. Watch your own replies when you next speak to someone. We often tend to continue sentences without ending. It’s like one big run-on sentence for large portions of the conversation. “... and then what happened?” Tom leant forward with a grin. “... then I bought a Ferrari!” “No!” “... and that’s not all!” He slammed his hand on the table in jest. “Don’t tell me ... you got a purple one.” Of course, too much of this becomes tiresome. While the characters are speaking, have them pause to do things, or continue speaking while actively participating physically. The best advice is to watch people having a conversation. Listen and watch. People all have habits and ticks when they are nervous, excited, or even just bored. If you learn dialogue from real people, you will also avoid the awful clichés that make dialogue sound forced. ",
            "date": "Answered December 31, 2015",
            "views": "18",
            "upvotes": " View 27 Upvoters",
            "upvoters": [
                {
                    "user_id": "Ellen Vrana",
                    "user_href": "/profile/Ellen-Vrana"
                },
                {
                    "user_id": "Amaan Shehzad",
                    "user_href": "/profile/Amaan-Shehzad"
                },
                {
                    "user_id": "Cody Haskett",
                    "user_href": "/profile/Cody-Haskett"
                },
                {
                    "user_id": "Kapil Rananaware",
                    "user_href": "/profile/Kapil-Rananaware"
                },
                {
                    "user_id": "Paramyogi",
                    "user_href": "/profile/Paramyogi"
                },
                {
                    "user_id": "Brian Good",
                    "user_href": "/profile/Brian-Good-6"
                },
                {
                    "user_id": "George Patton",
                    "user_href": "/profile/George-Patton-11"
                },
                {
                    "user_id": "Bu Woke",
                    "user_href": "/profile/Bu-Woke"
                },
                {
                    "user_id": "Abigail Anderson",
                    "user_href": "/profile/Abigail-Anderson-12"
                },
                {
                    "user_id": "Paul Entzel",
                    "user_href": "/profile/Paul-Entzel"
                },
                {
                    "user_id": "Olgo Hortez",
                    "user_href": "/profile/Olgo-Hortez"
                },
                {
                    "user_id": "Ramona Nunes",
                    "user_href": "/profile/Ramona-Nunes"
                },
                {
                    "user_id": "Manuel Mont",
                    "user_href": "/profile/Manuel-Mont"
                },
                {
                    "user_id": "Lousie Legalle",
                    "user_href": "/profile/Lousie-Legalle"
                },
                {
                    "user_id": "Ajay Pandith",
                    "user_href": "/profile/Ajay-Pandith"
                },
                {
                    "user_id": "Franz Reulum",
                    "user_href": "/profile/Franz-Reulum"
                },
                {
                    "user_id": "Evan Duarte",
                    "user_href": "/profile/Evan-Duarte"
                },
                {
                    "user_id": "Chris Cassey",
                    "user_href": "/profile/Chris-Cassey"
                },
                {
                    "user_id": "Barry Larson",
                    "user_href": "/profile/Barry-Larson-1"
                },
                {
                    "user_id": "Tyron Shorsten",
                    "user_href": "/profile/Tyron-Shorsten"
                },
                {
                    "user_id": "Sally Lasinga",
                    "user_href": "/profile/Sally-Lasinga"
                },
                {
                    "user_id": "Roger Roland",
                    "user_href": "/profile/Roger-Roland-4"
                },
                {
                    "user_id": "John Jenson",
                    "user_href": "/profile/John-Jenson-3"
                },
                {
                    "user_id": "Quincy Tuacker",
                    "user_href": "/profile/Quincy-Tuacker"
                },
                {
                    "user_id": "Karl Branzel",
                    "user_href": "/profile/Karl-Branzel"
                },
                {
                    "user_id": "Mac Eagan",
                    "user_href": "/profile/Mac-Eagan"
                },
                {
                    "user_id": "Glen Stansfield",
                    "user_href": "/profile/Glen-Stansfield"
                }
            ]
        },
        {
            "author_info": {
                "name": "Mike Cooper",
                "href": "/profile/Mike-Cooper-44"
            },
            "answer_text": "Not sure this will help, but I'll throw it out there, because I've had this problem, and this solution was very useful in its failure to help me: I too once thought the dialogs in my fiction sucked.  I am a shy person; not good at small talk myself; I blamed this fact for the corny conversations my characters always seemed to share.  I am however a very fast typist.  So one day, while laptoping in a food court, I thought to just type the conversation I was hearing between three people, the next table over.  Yea, kinda creepy but they were loud, and I would have stopped if their conversation had proven to be anything more substantial than small talk.  I remember thinking \"why can't I create a conversation that sounds as natural as this one?\"  When they left, I hit SAVE, stored it for later, and went back to whatever I writing before. Can you guess what I found when I looked at that conversation a week later?  I strongly urge you to try it yourself.  When you discover just how \"flimsy and awkward\" the words of real people sound when put on paper and read back, you may stop second-guessing yourself a little.  Or not.  Because I didn't.  But I did find some comfort there. ",
            "date": "Answered March 6, 2016",
            "views": "224",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Dan Naumovich",
                "href": "/profile/Dan-Naumovich"
            },
            "answer_text": "Here are two things that have helped me with writing dialogue. Assign characters the voice of someone similar to them. These voices can be those of people who you know personally, or characters from movies or TV shows. The important thing is that you are very familiar with how this people talk and you can hear their voices in your head. You know their accents, their vocabularies and their verbal tics. For example, you may be writing for a female character who is both friendly and polite, but also shrewd. So you can think of Margie Gunderson of Fargo while you're writing this character's dialogue. And maybe the character she's having a conversation with is nervous and defensive, kind of like your Uncle John. So you can channel Uncle John's voice when you're writing his dialogue. This works really well for me. The second I thing I do is give the characters the freedom to be verbose. Let them talk and talk and talk - get everything off of their chest. What I've found is the things they say initially tend to be obvious and uninteresting, but after they've been talking for a while, they come up with some gems. Then you just go back and delete the boring stuff. This also helps with plot development because the character may end up saying something that sends the story in a direction that you had never imagined. Regards ",
            "date": "Answered January 1, 2016",
            "views": "491",
            "upvotes": " View 6 Upvoters",
            "upvoters": [
                {
                    "user_id": "Florence Hervé",
                    "user_href": "/profile/Florence-Hervé-1"
                },
                {
                    "user_id": "Tadia",
                    "user_href": "/profile/Tadia"
                },
                {
                    "user_id": "Edwin K Varkeyachan",
                    "user_href": "/profile/Edwin-K-Varkeyachan"
                },
                {
                    "user_id": "Ben A. Wise",
                    "user_href": "/profile/Ben-A-Wise"
                },
                {
                    "user_id": "Holly Root-Gutteridge",
                    "user_href": "/profile/Holly-Root-Gutteridge"
                },
                {
                    "user_id": "Mac Eagan",
                    "user_href": "/profile/Mac-Eagan"
                }
            ]
        },
        {
            "author_info": {
                "name": "Glen Stansfield",
                "href": "/profile/Glen-Stansfield"
            },
            "answer_text": "I think the secret is to become the character. Don't treat the dialogue as something that has to be done and be emotionally detached from it. Get inside your character's heads and have conversations as they would do. It helps if your characters have some traits of people you know. Then you can imagine them being that person and speaking as they would. I tend to write the dialogue in my chapters first, then go back and put the characters into a world, rather than have 'talking heads.' I don't think that will work for everyone but it works for me. ",
            "date": "Answered December 31, 2015",
            "views": "170",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Jo Roderick",
                    "user_href": "/profile/Jo-Roderick"
                }
            ]
        },
        {
            "author_info": {
                "name": "Michael Emra",
                "href": "/profile/Michael-Emra"
            },
            "answer_text": "This works for me: I have a pretty good idea what the dialogue will be before I go anywhere near the keyboard. I just can't 'get in the zone' with it when faced with a white screen and smash out thousands of words in an evening. When it gets to sitting down at the computer i'm really just typing up and making small edits to something I've been working on for the whole day before. I work outside, and walk to and from work, so I have a lot of time to be alone with my thoughts whilst my body is doing something that I don't really need to concentrate on. I imagine the scene, the characters and what their current mood and knowledge of the plot are and just let it play out until I have something i'm happy with, only then do I write down prompts or sentences that are really catchy and don't want to forget on whatever I have to hand. I might do this two or three times a day, just for the same little exchange. And even when it's typed up I might go back and chop and change a few things a week later, but for the most part i'm happy with it after that. ",
            "date": "Answered December 31, 2015",
            "views": "190",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Jo Roderick",
                    "user_href": "/profile/Jo-Roderick"
                }
            ]
        },
        {
            "author_info": {
                "name": "Jacqueline George",
                "href": "/profile/Jacqueline-George-1"
            },
            "answer_text": "Firstly, have the computer read it back to you without looking at the screen. If it doesn’t sound right, either you don’t know your character well enough or you are over-thinking the way he/she speaks. So think more about your character and imagine they are like some-one you know or have met. How would they talk? Once you’ve done what you can by yourself, brain storm a chapter with a couple of friends reading characters. Between you all, you should be able to find the character’s voice and carry it through to other chapters. ",
            "date": "Answered November 11, 2016",
            "views": "107",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Larry Dixon",
                "href": "/profile/Larry-Dixon-1"
            },
            "answer_text": "Misty & I have done a bunch of experiments with them.  One in particular got a lot of unsolicited praise. In the two Tannim Drake books, Born To Run and Chrome Circle, we wrote them and left the dialogue for last, then roleplayed the characters as we read the manuscript.   We purposely made the dialogue in the books as improvised as real conversations are.  We included every stall, every \"uhm,\" every revision of \"Wait, this explains it better, sorry, okay, it actually happened like this.\" When you're a writer you get a LOT of time to come up with just the right line, just the right zinger.  Real world, we're a bunch of schmoes just trying to communicate at all.  That's why so much written dialogue comes across as stilted---the writer had all that spare time to edit it.  Real world, we stammer along. ",
            "date": "Answered February 12, 2016",
            "views": "812",
            "upvotes": " View 11 Upvoters",
            "upvoters": [
                {
                    "user_id": "David Liu",
                    "user_href": "/profile/David-Liu-370"
                },
                {
                    "user_id": "George Patton",
                    "user_href": "/profile/George-Patton-11"
                },
                {
                    "user_id": "ApolloZani .",
                    "user_href": "/profile/ApolloZani"
                },
                {
                    "user_id": "Debra Poole Jaquett",
                    "user_href": "/profile/Debra-Poole-Jaquett"
                },
                {
                    "user_id": "Mercedes R. Lackey",
                    "user_href": "/profile/Mercedes-R-Lackey"
                },
                {
                    "user_id": "Hannah Frome",
                    "user_href": "/profile/Hannah-Frome"
                },
                {
                    "user_id": "Morgen Peschke",
                    "user_href": "/profile/Morgen-Peschke"
                },
                {
                    "user_id": "Mac Eagan",
                    "user_href": "/profile/Mac-Eagan"
                },
                {
                    "user_id": "Eric Huang",
                    "user_href": "/profile/Eric-Huang-108"
                },
                {
                    "user_id": "Ara Sedaka",
                    "user_href": "/profile/Ara-Sedaka"
                },
                {
                    "user_id": "Tania Grey",
                    "user_href": "/profile/Cameron-Calloway"
                }
            ]
        },
        {
            "author_info": {
                "name": "Saad Hossain",
                "href": "/profile/Saad-Hossain-2"
            },
            "answer_text": "a lot of the time we get trapped into using dialogue simply to convey information. This often makes it stilted. Try to honor the internal logic of each character, let them go off on digressions, or make jokes, or refuse to cooperate. Sometimes this will also help take the story to unexpected places. Human conversation is rarely straight forward.   ",
            "date": "Answered February 15, 2016",
            "views": "146",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Tadia",
                    "user_href": "/profile/Tadia"
                }
            ]
        },
        {
            "author_info": {
                "name": "Doug Myers",
                "href": "/profile/Doug-Myers-7"
            },
            "answer_text": "A lot of tricks and tools to utilize, but nothing works better than listening. Writers are essentially spies, overhearing bits of conversation and filing it away in their mental notebook. It doesn't endear you to the public, by the way, so don't actively eavesdrop. Just let yourself go when you're out in public, and listen to how people talk. How do they talk to their children? How do they talk to their parents? Friends? Co-workers? Listen to it all, no matter how banal.   ",
            "date": "Answered March 2, 2016",
            "views": "112",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Mac Eagan",
                "href": "/profile/Mac-Eagan"
            },
            "answer_text": "I have answered very few, if any, questions on Quora over the past few months and have only made a handful of comments.  And I have thought about this for quite some time but have finally decided to exit Quora, and I am taking my answers with me. When people would ask me what Quora is I would tell them it is a mixture somewhere between Wikipedia and Yahoo Answers.  Unfortunately, in my experience, the \"Yahoo Answers\" portion seems to be growing. The worst thing of all, though, is the Quora Partners program. It seems backwards to me to be rewarding people for asking questions as opposed to providing answers.  Yes, questions are important as they often are where a pathway to knowledge begins. But questions are a jumping off point and if no one jumps then no journey is ever taken. It is like someone knowing that a treasure is buried in a field and announcing, \"Anyone who brings a shovel to this field will get a reward.\" Thousands, even millions of shovels are provided, with some people making hundreds of trips and getting rewarded for all the shovels they are carrying. A few enterprising individuals even find a way to bring the same shovel multiple times. What of those people who pick up a shovel and dig, eventually uncovering the treasures? \"Sorry, we are only giving rewards to those who are providing shovels. Thank you for revealing this treasure, though.\" To me, that's just backwards. So, I am leaving. In addition, though some will disagree with my choice, I am reburying my treasures. Thank you to all who upvoted my answers; what I am doing may seem that I am ungrateful to you but please be assured I very much appreciate the support and encouragement you provided. - Mac ",
            "date": "Updated April 5, 2020",
            "views": "215",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Asha Abdi",
                    "user_href": "/profile/Asha-Abdi-9"
                },
                {
                    "user_id": "Jo Roderick",
                    "user_href": "/profile/Jo-Roderick"
                }
            ]
        },
        {
            "author_info": {
                "name": "Brad Chisholm",
                "href": "/profile/Brad-Chisholm"
            },
            "answer_text": "Look up my article on Medium. How To Learn to Write Dialogue in your Spare Time. It will help you with practical tips. ",
            "date": "Answered March 7, 2020",
            "views": "21",
            "upvotes": "0"
        }
    ]
}