{
    "title": "How to write a poem for my friends - Quora",
    "tags": [
        "Writing Poetry",
        "Poems",
        "Poetry"
    ],
    "response": [
        {
            "author_info": {
                "name": "Prikta Srivastava",
                "href": "/profile/Prikta-Srivastava"
            },
            "answer_text": "You need a paper, a pen and a naughtily creative heart. Bingo. I love to surprise my loved ones with “Just for you\" poems and have written scores of them. Sharing with you few lines of one of them. I wrote this for my very loving elder brother whom I found not by birth but by destiny. “We saw that wavy hairs of your groomed every day, And your fingers running into them, styling them your way. . . The other day u appeared in a white pathan dress, 'Salman bhaiya' we kept ur name, a secret unexpressed. . . . I can still remember every single word of your emphatic appreciation For my essay that worked for me like a gauged yet boosting acceleration. A hundred thanks to Apoorva who then invited us at your bday A surprise that she had planned for you. We too enjoyed the play.” ….. And so on. (You will be bored if I write the complete poem here. :-P) It is really one of the best feelings of the world for me to witness them smiling, laughing and getting that glossy tearline while reading my poems. Thus, I find myself in a place to help you out with this question. Poems are to be written from heart but wait... Could you have ever be able to wish your mom with a self made greeting unless you knew writing abcd? Thus, even to express your heart you need properly arranged words. I assume that you want me to tell you the basic trick here. So, you can simply follow the following steps and you are done. Smile. 1. Choosing the theme-Find out what sort of theme your friend will actually like. On the basis of this your friend will most likely fall in one of the following categories. (a) likes to remember the past- you can choose the theme of how you met and how your friendship evolved. (Well this is my favorite themes as may be infered from the above example. :-) eg, We met in the bus as co-passengers, The clock had hit just nine And as we began to talk and talk The journey passed in no time. (b) likes appreciation for oneself - well there is nothing wrong in expecting appreciation provided one deserves them. So, you can choose to appreciate him/her honestly and in the best possible creative way. Eg, Your eyes are the periscope of your heart, Your naughtiness as cute as a child. Your imagination is as big as the world, But humbleness like a breeze so mild. (c) is extremely emotional person - Take my words, you can choose any theme for such a person because it's not the poem, rather you, who is damn important to him/her. If you have some other category friend, tell me. I will try to help you with the theme. 2. Collecting words-If you have got a good vocabulary. This step is a cake walk. You can just jot down some rhyming words that you can use in your poem. If you have a weak vocabulary don't worry. Simple words said with true heart last even longer than complicated words added just for the sake of the poem. A ‘sorry' is as effective as ‘remorseful’, a ‘sacred’ as effective as ‘sacrosanct’. Just make a list, see the pair that rhyme. Write them on a different page. And here you have to start with the most creative part. 3. Writing the poem - Use emotions while writing so that your friends feel connected, (jaise hindi pichcher me chitthi me chehra dikhta tha waise). Don't worry about the length. Follow no stereotypical rules because you won't get marks on the poem. You will get love. In case you are not able to get the rhyming words at the right place try rearranging the sentence, eg, Friends like you are extremely rare, Filled with so much love and care, How will I pass this one month, Stuck.... What to rhyme.... Wait for a moment... Write it like this... This one month, how will I pass, I shall count the stars and pluck the grass. 4. Conclusion - Well, this one trick will help you escape any embarrassment for mistakes in the poem. I use it often because I am still a ‘poet in making'. ;) Just end with a line apologizing for any mistake because you wrote it from your heart and not your mind. I am sure your friend will be very happy. Do share with me his/her reaction. I would love to listen. :-D ",
            "date": "Answered May 14, 2019",
            "views": "411",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Adarsh Mukul",
                    "user_href": "/profile/Adarsh-Mukul"
                },
                {
                    "user_id": "Apoorva Singh",
                    "user_href": "/profile/अपूर्वा-सिंह-Apoorva-Singh"
                }
            ]
        },
        {
            "author_info": {
                "name": "Margaret Ann Waddicor",
                "href": "/profile/Margaret-Ann-Waddicor"
            },
            "answer_text": "Perhaps this fits the bill? GRO'S POEM I thank you and you thank me, reflected help and harmony, I'm there for you, you're there for me, what more can I expect of thee, the kindest sort of mother, the sweetest kind of mother, who frets around and bothers, for ones she loves, and others. **** Gro is always there and casts a smile, so warm and full of feeling, goes a mile, she may have problems for a while, but smothers them and with such style, she's made of the very best, and all who know her they are blessed, when tired she doesn't even rest, she wins in every empathetic test. ****Salt of the earth, wine of the sky, I'll be there ever, I can tell you why, I love her very much and give a great big sigh, Her heart's so big it smothers you and I. Margaret Ann Waddicor 5th August 2010. ",
            "date": "Answered June 5, 2019",
            "views": "178",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Jasmine Arora",
                    "user_href": "/profile/जैसमिन-अरोड़ा-Jasmine-Arora"
                }
            ]
        },
        {
            "author_info": {
                "name": "Shraddha Thuwal",
                "href": "/profile/Shraddha-Thuwal"
            },
            "answer_text": "Well here is one I wrote for my best friend. Something like that... Like what do you know? Do you know I have a friend With whom I took a vow.. Vow to travel around And make our destiny profound And share the flaws ,the curses The lies, the reverses... Her bright eyes always catches The hints and the black patches In my red blood and in my tears Swear she blows all my fears. Pain that exhausts me Wraps me Around the thorny arms Her one look sway it Into my pellucid charm.. To god if you're there Or maybe my fortune now here Brought this chub Into my life... I love you so much Every day and every night.... ",
            "date": "Answered July 9, 2020",
            "views": "199",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Om Prakash",
                    "user_href": "/profile/Om-Prakash-6513"
                }
            ]
        },
        {
            "author_info": {
                "name": "Utpal Bordoloi",
                "href": "/profile/Utpal-Bordoloi-11"
            },
            "answer_text": "Write all their wonderful qualities in a streamline flow and how they have helped in your difficult times. And a friend is what holds us straight and keeps us walking in a situation where we even forget to crawl. Write it down even if they dont rhyme. I would suggest you should try naming for him/her at the last of the poem i.e. at that last say” its for you my best friend”. It will really make him/her happy. ",
            "date": "Answered July 9, 2020",
            "views": "63",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Saman",
                    "user_href": "/profile/Saman-84"
                }
            ]
        },
        {
            "author_info": {
                "name": "Helen Bennett",
                "href": "/profile/Helen-Bennett-61"
            },
            "answer_text": "I've written many poems about my family and for friends too. Of course knowing the person's personality is important, their likes and dislikes, what motivates them in life. With my children it was easy, as each child shows their characters early in life. Also been asked to write an inspirational poem for a person going through Cancer. I called it, * Somewhere In Time*. I concentrated on what in life gave them joy and happiness, what would inspire them to gain courage in fighting the Cancer. That poem was published in a book of Inspirational poetry. ",
            "date": "Answered July 6, 2019",
            "views": "60",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Smriti Chandra",
                "href": "/profile/Smriti-Chandra-6"
            },
            "answer_text": "Jasmine Arora thanks for A2A. I wrote this poem a while back. It was on the occasion of my friend's birthday.  I know it's a bit cheesy and may be kiddish . Down the line , however , she loved it.:) Hope you liked it. ThankYou. ",
            "date": "Answered June 6, 2019",
            "views": "229",
            "upvotes": " View 4 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Aparajita Singh",
                    "user_href": "/profile/Aparajita-Singh-62"
                },
                {
                    "user_id": "Sumit Sinha",
                    "user_href": "/profile/Sumit-Sinha-288"
                },
                {
                    "user_id": "Nishtha Gupta",
                    "user_href": "/profile/निष्ठा-गुप्ता-Nishtha-Gupta"
                },
                {
                    "user_id": "Jasmine Arora",
                    "user_href": "/profile/जैसमिन-अरोड़ा-Jasmine-Arora"
                }
            ]
        },
        {
            "author_info": {
                "name": "Shekhar chaNdra",
                "href": "/profile/Shekhar-chaNdra-92"
            },
            "answer_text": "Frnds aren't come from relations  But they made strong bond   Frnds aren't share blood lines  But they Connected to heart   A Ture Frnds aren't wishes b'days They celebrates those stupid days with U ",
            "date": "Answered June 14, 2019",
            "views": "49",
            "upvotes": "0"
        }
    ]
}