{
    "title": "How to find a comment section in a blog site - Quora",
    "tags": [
        "Comment Systems",
        "Online Commenting",
        "Comments (Quora feature)",
        "Blogs"
    ],
    "response": [
        {
            "author_info": {
                "name": "Jeffrey Conrad",
                "href": "/profile/Jeffrey-Conrad-5"
            },
            "answer_text": "It depends on what kind of blog platform you are commenting on. On WordPress, the comment section can be turned off by the publisher. If this happens, you're out of luck because there would be no comment section. The good news is, by default, the comment section is turned on. So, you only need to look for WordPress blogs that are self-hosted and scan down the page. Here's the problem, just because he has a comment section doesn't necessarily mean that once you enter a comment, whatever text you left, will be automatically published. It doesn't work that way. In fact, in a lot of cases, comments are moderated and never looked at. In other words, you basically wasting your time. So, keep this in mind, it's a numbers game. For example, if you are looking to publish 100 comments, it's probably a good idea to post 200 comments. At the back of your head, you're basically betting that at least half of your comments will get published. It also depends on the type of comments you're thinking of getting published. If you just want traffic for your website, that's why you are posting all these comments, you have to be very careful because a lot of administrators are very suspicious of those types of posts. If there's any kind of link in your post, there's a good chance that your content will never get published. That's just the nature of the beast. Another way you can look for a comment section on blogs, is if it uses a Facebook comments plugin. You can do a search on Google for Facebook comments plugin and the keywords related to the blog post that you would like to comment on. This is a very good way of finding niche or topic related blog posts that also use Facebook comments. The plus side of hitting these types of blogs is that they tend to be unmotivated. In other words, just because they're using Facebook, a lot of these publishers just let the comments grow. Here's the problem, if you are going to be spamming those comments by copying and pasting the same stuff over and over, your link will get flagged and before you know it you will be able to post that link anymore. You have to use your head. The good news is that there are many ways to get around this. You can use an email that it's tied to an autoresponder, you can also mention the name of a website that is so unique that people search for the name, you are probably going to be number one. Whatever the case may be, you have to find a workaround to link blocks because if you just routinely post links in your comments, there's a good chance that you will get blocked if not banned. ",
            "date": "Answered July 26, 2020",
            "views": "14",
            "upvotes": " Answer requested by Md Tanvir"
        },
        {
            "author_info": {
                "name": "James Kunle",
                "href": "/profile/James-Kunle"
            },
            "answer_text": "Mark Bishop ( below) gave you the perfect answer. You will find the comment section at the end of any blog post, even static pages sometimes do have the comment section enabled. I guess that one of the reasons you asked this question is probably that you are unable to find the comment section on a particular blog post. Well, for most blogs, especially the ones built with WordPress, the administrator ( owner of the blog) has the option to close the comment ( after some days, immediately after publication etc.). For example, the image below is just a snapshot of my own commenting section settings:  And some bloggers prefer to just turn it off to avoid blog commenting spams and trouble. I hope this solves the question!! ",
            "date": "Answered April 23, 2020",
            "views": "70",
            "upvotes": " Answer requested by Md Tanvir"
        },
        {
            "author_info": {
                "name": "Rashmi Deshpande",
                "href": "/profile/Rashmi-Deshpande-22"
            },
            "answer_text": "If you own a WordPress blog, you can monitor the comments and decide the comments that you want to display to the public by accepting. (Can even reply, decline & delete). As an admin, you can find your comments section in the backend, by going through the comments content type. (Found usually below the posts, pages section) You can name of the person who commented, their mail, their comment and the post on which they have commented. Happy Blogging! ",
            "date": "Answered April 25, 2020",
            "views": "17",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Mark Bishop",
                "href": "/profile/Mark-Bishop-36"
            },
            "answer_text": "A comment section in a blog is usually found after a post that someone added. However, in popular blogging software, like WordPress (CMS), admins have the ability to turn on/off comments. So, if you can’t find a comment section, that probably means it has been disabled and the admin doesn’t want the headache in dealing with lots of comments and opinions. Good Luck! ",
            "date": "Answered April 23, 2020",
            "views": "66",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Malik Habib",
                "href": "/profile/Malik-Habib-35"
            },
            "answer_text": "How to Add / Embed Comment Box below blogger post? Login to Blogger.com - Create a unique and beautiful blog. It’s easy and free..Go to Setting–>Comments. then change “Comment Form Placement” to be “Embedded below post” (look at the image below)Then “Save Setting” ...Go to “Layout–>Edit HTML”Check the “Expand widget templates” box.Find this code : ...Then replace it with this code : ...Save your Template.",
            "date": "Answered April 23, 2020",
            "views": "7",
            "upvotes": "0"
        }
    ]
}