{
    "title": "How to write a doctoral dissertation - Quora",
    "tags": [
        "PhD Thesis",
        "Theses and Dissertations",
        "Academic Research"
    ],
    "response": [
        {
            "author_info": {
                "name": "Daniel Berman",
                "href": "/profile/Daniel-Berman-1"
            },
            "answer_text": "Entire books have been written on this subject. The first step is deciding on a topic, so this might be the best point on which to focus for an answer to your question here. A thesis or dissertation study is supposed to make some contribution to the literature in whatever field in which the student is writing. You can do this by identifying a gap and then filling it. The more interesting and important the question is, the better. One good place to search for ideas is the \"Suggestions for Future Research\" section that can often be found in journal articles in your area of interest. You might also want to think in terms of the interests of your major adviser: What would the person you have in mind to be your thesis or dissertation adviser want to see researched? You can often find clues in that person's publications. Sometimes, all you need to do is ask for suggestions. Ideally, you should select a topic about which you are passionate or, at the very least, a topic about which you are very interested and likely to retain this interest for a significant length of time. It can also be helpful to recognize that a dissertation can often serve as an important springboard for the career you will have following receipt of your degree. For this reason, it can be worthwhile to keep this in mind when deciding upon a topic. Two other major and very practical considerations are (1) the feasibility of the study and (2) how easy it will be to attract committee members who will likely be easy to work with. With regard to (1) above, many a student has failed as a result of study design issues. With regard to (2) above, many a student has failed due to lack of foresight in selecting appropriate committee members.  If you are just thinking about how to get started, some of this should be helpful. If you are already at a later stage in the dissertation writing process, you are welcome to ask a more specific question.  ",
            "date": "Answered February 13, 2016",
            "views": "500",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "William Moxim",
                    "user_href": "/profile/William-Moxim"
                },
                {
                    "user_id": "Rocky Luo",
                    "user_href": "/profile/Rocky-Luo-3"
                }
            ]
        },
        {
            "author_info": {
                "name": "Jessica Larson",
                "href": "/profile/Jessica-Larson-18"
            },
            "answer_text": "Your dissertation is your union card. It is your entry into the academy. But writing a dissertation can seem overwhelming. It’s scary to imagine writing a work 200 or more pages and submitting it to distinguished scholars whose opinion of your intelligence and talent will depend on what you have completed. But remember: The single biggest obstacle to completion is psychological. To be sure, a dissertation involves far more research than you have ever done before. But by the time you begin your dissertation, you’ve already written countless essays, lab reports, and conference presentations. A dissertation is, in the end, simply a compilation of seminar papers—revised to provide conceptual unity. Completing a dissertation, then, is mainly a matter of perseverance. It means, first of all, that you must choose a topic that you are passionate about. Organize your dissertation, and its chapters, around questions: substantive, conceptual, and methodological. Then look at what other scholars have said about these questions and consider the ways that you agree or disagree with them. Don’t forget to proofread it. You can check how can Supreme essay guys help you. Give them a try. Why dissertations don’t get finished 1. The task seems overwhelming. The solution: Break the project into small, manageable units. 2. There are no clear deadlines. The solution: Work on sub-sections that you can finish in a predictable amount of time, preferably today. 3. Being overpowered by negative thoughts. Silence your internal critic. Ignore or repress self-defeating thoughts. ",
            "date": "Answered February 20, 2017",
            "views": "279",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Lee Jollans",
                    "user_href": "/profile/Lee-Jollans"
                }
            ]
        }
    ]
}