{
    "title": "How to say 'register for course' correctly in English - Quora",
    "tags": [
        "Learning English Grammar",
        "Learning English",
        "English Grammar"
    ],
    "response": [
        {
            "author_info": {
                "name": "CM Carson",
                "href": "/profile/CM-Carson"
            },
            "answer_text": "You can make that statement in a number of ways. As a general rule of thumb, American English uses class instead of course in nearly every way. Course is usual reserved for its other connotation meaning route, track, path, way or as a verb in the same sense of fixed direction. I registered for ____(name of the course)____.I am registering for three courses this term.The present tense of register is used as a simple or bare predicate at the end of a clause with only the verb phrase. Did you register for his other courses?You didn’t get up in time to register.",
            "date": "Answered September 25, 2019",
            "views": "41",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Thao Ly",
                    "user_href": "/profile/Thao-Ly-16"
                }
            ]
        },
        {
            "author_info": {
                "name": "Mark Barton",
                "href": "/profile/Mark-Barton-1"
            },
            "answer_text": "\"I enrolled in the course\" is a good choice. It's absolutely explicit that you have ensured your name is on the list of people who will be taking the course (the \"roll\").  \"I registered for the course\" means you have submitted your name, and it's on some sort of list. Depending on context that could be the list of students who have been approved to take the course, but it could also be perhaps just a waiting list. \"I enlisted in the course\" is rather too military. However a professor could enlist students in a course. ",
            "date": "Answered April 30, 2016",
            "views": "83",
            "upvotes": " View 5 Upvoters",
            "upvoters": [
                {
                    "user_id": "Thao Ly",
                    "user_href": "/profile/Thao-Ly-16"
                },
                {
                    "user_id": "Seolha Lee",
                    "user_href": "/profile/Seolha-Lee-1"
                },
                {
                    "user_id": "Gizem Acar",
                    "user_href": "/profile/Gizem-Acar-3"
                },
                {
                    "user_id": "Judith Dubois",
                    "user_href": "/profile/Judith-Dubois-1"
                },
                {
                    "user_id": "Ashley Aguirre",
                    "user_href": "/profile/Ashley-Aguirre-17"
                }
            ]
        }
    ]
}