{
    "title": "How different is the typical adult's cursive writing from what he or she learned years ago in school? - Quora",
    "tags": [
        "Cursive",
        "Penmanship",
        "Handwriting",
        "Writing Advice",
        "Writing"
    ],
    "response": [
        {
            "author_info": {
                "name": "Bunty McDougall",
                "href": "/profile/Bunty-McDougall"
            },
            "answer_text": "A typical adults cursive is probably very different to what they learned in school. Research seems to indicate that the fastest form of writing by hand is a mixed cursive script. Mixed cursive is the basic cursive taught in school, with variations added in by the child. Once the basic cursive script has been learned and a certain degree of automaticity has been achieved, many children go on to “personalise” their cursive handwriting. They substitute some print letters and experiment with handwriting styles. And this is where the change from what they were taught in school comes in. With time they settle into a personalized cursive style and this style of writing becomes hardwired. Unless they intentionally change the style at some point, their style of writing remains much as it was at this point. This is because the “motor maps” for how to form letters become hardwired. Unless you intentionally try to write in another style, you will automatically write in the same style. Where the handwriting style does not become automatic and children switch between styles, it compromises their ability to achieve speed and fluidity of cursive writing. Research indicates that handwriting quality does deteriorate over time, but the style remains much the same from the point where the child personalized their handwriting. For those who missed out on the personalizing step, their cursive would be closer to that taught in school than those who did personalise. There is more about how automaticity develops here: Automaticity in Handwriting. WHAT to write not HOW to write. ",
            "date": "Answered November 7, 2019",
            "views": "31",
            "upvotes": " Answer requested by Samuel Dickey"
        },
        {
            "author_info": {
                "name": "SJ \"Joon\" Thomas",
                "href": "/profile/SJ-Joon-Thomas"
            },
            "answer_text": "Quite different! A number of factors are at play. For some people eye hand coordination improves significantly over the course of adolescence and young adulthood. Many middle and high school students have an awkward, clunky handwriting that smooths out and becomes more fluid as they come into their twenties. On the other hand, the pressures of having to write a lot and write fast tend to work away at the precise cursive forms the person may have learned in school. College and university can be a destroyer of beautiful handwriting! And yet, under these pressures people also personalize their handwriting. They come up with their own shortcuts, connectors and methods of working through the strokes. All of this adds up to the individual handwriting that is so immediately identifiable. The handwriting has character! ",
            "date": "Answered November 5, 2019",
            "views": "41",
            "upvotes": " Answer requested by Samuel Dickey"
        }
    ]
}