{
    "title": "How to write compelling content - Quora",
    "tags": [
        "Creating Writing Advice",
        "Creative Writing",
        "Digital Marketing",
        "Writing Advice"
    ],
    "response": [
        {
            "author_info": {
                "name": "Sagareeka Pradhan",
                "href": "/profile/Sagareeka-Pradhan-1"
            },
            "answer_text": "To make your content engaging you need to take care of a few factors. But first, keep in mind that making a content engaging doesn't mean you have to find new topics that are unheard of. Our world today is filled with content from all over, so your focus should be on how your content can be helpful and accessible to your target audience. Keeping that in mind let's take a look at the few pointers that could help make a content engaging:  Topic selection: Do proper research on what your target audience wants. Take notice of their pain points and make topics that will help them in some way.Research: This is extremely crucial. No matter what the topic, you need to do extensive research and provide authentic sources. This will help to build your credibility and will make your readers trust you.Content placement: You need to know how to place your content so that it can reach your target audience. Remember that the readers are not specifically looking for your content but for information. It is your job to place it exactly where they can find it.Retain your originality: It is important to not just go with the flow but also see what you can bring to the content. Add your unique ideas to the content and see it get popular.Use simple language: Most content writers use jargon filled language thinking it will be impressive but it actually alienates the audience. Keep your language simple and remember that in that way it will accessible to an even larger audience.These pointers will surely assist you in making your content more engaging. Keep an open mindset and learn about the latest in content marketing so that you have clarity on the type of content you should create. Hope this was helpful. Good luck. :) ",
            "date": "Answered April 8, 2020",
            "views": "154",
            "upvotes": " View 2 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Vikas Kumar",
                    "user_href": "/profile/Vikas-Kumar-652"
                },
                {
                    "user_id": "Apoorva Malhotra",
                    "user_href": "/profile/Apoorva-Malhotra"
                }
            ]
        },
        {
            "author_info": {
                "name": "Jody Lebel",
                "href": "/profile/Jody-Lebel"
            },
            "answer_text": "Tricks Professionals Use For Richer Writing... 1) Create an evocative scene in two steps. The first step is to create a visual picture. Follow that with a second sentence making use of one the other sense. In other words show something then evoke a smell, taste, sound or feeling. \"The trellis was alive with yellow flowers. The sweet scent of jasmine hung in the warm night air.\"  2) Deepen a character with two distinctive traits, one physical and one psychological. Use these traits throughout your story to lock that character in the mind of the reader. For example your heroine could wear glasses and be afraid of highway driving. During the novel have her push her glasses up her nose, or clean them, or drop them. Have her take back roads or be late because she won't take the interstate.  Using something funny or odd endears your character to the reader. Let's say our hero always seems to be invisible to waiters. Much as he tries, he can never get their attention. They walk right by him. 3) Create a mood in two steps. Mood is often tied in with emotions. Setting a mood isn't an easy task. Begin with a detail: \"A car pulled into the driveway.\" Next announce the mood change because of that action. \"Even before looking, she knew it would be bad news.\"  \"The mail dropped through the slot and hit the floor and suddenly there was a morning rush feeling in the house.\"  4) Create a memory in two steps. Memories bring details to scenes that otherwise wouldn't be there. Start with a physical object and then associate it with a memory by the use of senses. For example a pressed prom corsage could conjure up memories of her date coming up the walk with the plastic flower box in his hand, his hair slicked back and dark with gel, and his tie a little crooked.  5) Twist a plot in two moves. Throw trouble at your characters. Make it totally surprising. \"It was the anniversary of his wife's death, something he never got over. That night as he was watching a live webcam of people in Times Square, he saw his wife walk by.\"  This works well with secondary characters. \"Mary was stunned to learn that her quiet housewife neighbor was a phone sex operator at night. How could she let that woman babysit her kids now?\"  6) Deepen your story line two ways. Use a witty remark or choose a subject at the beginning of your story, then repeat it near the end. Search for sentences that sum up the mood of the piece or some object that will tie the piece together. A man buys a fishing tackle box at a yard sale. At the end of the chapter have him fishing for a way to ask our heroine out. Or say she hooked him better than any lure in the box. Use of a symbol. Yellow is usually a cheerful color but make it always bring trouble to your hero. Maybe a school bus hits his car, or he tries to impress a woman who is wearing a yellow dress and he fails miserably. When he sees yellow, he walks the other way. This symbol could also be figurative. For example the heroine could live on the banks of a river. As with a river she finds her life rushing by or flowing or raging.  7) Create a distinct voice with two techniques. Regardless of their use of language, if your characters still sound alike give them vocal differences by use of pitch, timber, or volume. Another way to differentiate them is by use of unusual or exaggerated behavior. \"You make me sick,\" Tom said his voice low and menacing. \"And you're an angel?\" Ray's shrill voice carried across the bar. He smiled as he cracked the knuckles in his right hand with a sickening pop.  Throughout the story keep Tom's voice deep and mean. Tom doesn't chit chat; he gets right to the point. Ray likes to be more physically aggressive, cracking his knuckles, making fists and generally being macho. You won't get these two men confused if you keep them in character.  8) Craft your comparisons. Descriptions like tall, fat, old and funny are too vague. And boring. She had pretty blue eyes. \"She has Bette Davis eyes.\"  The young man was well built. \"He reminded her of a Spanish matador with his dark hair hitting his collar, and his muscular chest showing through his open shirt.\"  She was fat. \"The lady was unable to get out of her chair, her generous bottom catching the arms and holding her prisoner.\"  Now you're writing like the pros. ",
            "date": "Answered November 27, 2018",
            "views": "335",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Clayton Christopher",
                    "user_href": "/profile/Clayton-Christopher"
                }
            ]
        }
    ]
}