{
    "title": "How to write poems in Kannada - Quora",
    "tags": [
        "Writing Poetry",
        "Kannada (language)",
        "Poems"
    ],
    "response": [
        {
            "author_info": {
                "name": "Chandan",
                "href": "/profile/Chandan-258"
            },
            "answer_text": "In my case its all about the perspective you the things and the people. And some situations I have been they made me to write. By writing them I can say something which I csnt express in words. Below are the some which I wrtote. Note : Edits are welcome  1. ಬಿಗಿದಪ್ಪಿಕೊ ಒಮ್ಮೆ ನನ್ನ ನಾನೆಂಬ ನಾನು ಮರೆಯಾಗಲಿ ಬಿಗಿದಪ್ಪಿಕೊ ಒಮ್ಮೆ ನನ್ನ ಮನ ತುಂಬಿದ ದುಃಖ ಉಂಬಳಿಸಲಿ ಬಿಗಿದಪ್ಪಿಕೊ ಒಮ್ಮೆ ನನ್ನ ಕಂಡ ಕನಸುಗಳು ನನಸಾದಂತಾಗಲಿ ಬಿಗಿದಪ್ಪಿಕೊ ಒಮ್ಮೆ ನನ್ನ ನಾ ಒಂಟಿ ಎಂಬ ಆಲೋಚನೆ ದೂರಾಗಲಿ ಬಿಗಿದಪ್ಪಿಕೊ ಒಮ್ಮೆ ನನ್ನ ಅತ್ತ ಅದೆಷ್ಟೋ ದಿನಗಳು ನಗುವಿನ ನಗೆಯಾಗಲಿ ಕೊನೆಯ ಬಾರಿ ಬಿಗಿದಪ್ಪಿಕೊ ಒಮ್ಮೆ ನನ್ನ ಹೊರಟಿರುವ ಜೀವ ಮತ್ತೆ ಬಂದಂತಾಗಲಿ...! 2. ಕಂಡ ಎಷ್ಟೋ ಕನಸುಗಳ ಒಡತಿ ನೀನು ನೆನೆದ ಸಾವಿರ ನೆನಪುಗಳ ಉತ್ತರ ನೀನು ದಿನ ನಿನ್ನ ನೆನೆದು ಕಾಯುತ್ತಿದ್ದೆ ಈ ದಿನಕ್ಕಾಗಿ . ನನ್ನ ಬಳಿ ನನ್ನವಳು ನೀನು. ಮಂಜಿನ ಹನಿಯ ನಗು ಕಂಗಳ ಸೆಳೆಯುವ ಕೂದಲು ದೃಷ್ಟಿ ಆಗುವ ಆ ಮೂಗುತಿ ನೋಡಿದರೂ ನೋಡಬೇಕೆನ್ನುವ ಆ ಕಾಲು. ನನ್ನ ಪ್ರತಿ ಪ್ರಶ್ನೆಗೂ ಉತ್ತರ ನೀನು ಪ್ರತಿ ಪ್ರಾ ರ್ಥನೆಯ ಫಲ ನೀನು ನೀ ನಾನಲ್ಲವೇನು? ನಗುತಲಿರು ಈಗೆ ಎಂದು..ಏಕೆಂದರೆ ಜೊತೆಗಿರುವೆ ನಾನೆಂದೂ❤ 3. ನಗು ಮೊಗದ ನನ್ನವಳು ನೀನು ಕಣ್ಸನ್ನೆ ಯ ಕಾಮನಬಿಲ್ಲು ನೀನು ಮುದ್ದು ಮೂಗು ತಿಯ ಒಡತಿ ನೀನು ಕೇಶ ರಾಶಿಯ ಕುಂಚವೆ ನೀನು ತುಟಿಯಂಚಿನ ನಗುವು ನೀನು ನನ್ನೊಳಗಿನ ನಾನೇ ನೀನು ನನ್ನೆದೆಯ ಬಡಿತವು ನೀನು ನನ್ನುಸಿರಿನ ಗಾಳಿಯು ನೀನು ನನ್ನಯ ನಿನ್ನೆಯೂ ನೀನೇ,ನನ್ನಯ ನಾಳೆಯೂ ನೀನೇ. ಇರು ಹೀಗೆ ನಗುತಲಿ, ಹಿಡಿದಿರು ನನ್ನ ನಿನ್ನ ಕೈಯಲ್ಲಿ. ಮಾಡಿರುವೆ ಅರಮನೆಯ ನನ್ನೆದೆಯಲ್ಲಿ. ನೀನೇ ನನ್ನ ರಾಣಿ,ನೀನೇ ನನ್ನ ಅರಗಿಣಿ ,ನೀನೇ ನನ್ನ ನಲ್ಲೆ ಈ ಜಗದಲ್ಲಿ 4. ಹೇ ಮನಸೇ ಏಕೆ ಕೊರಗುವೆ ? ನಾನಿಲ್ಲವೇನು ನಿನ್ನ ತಣಿಸಲು? ಇರಲಿ ಬಿಡು ಆಗುವುದೆಲ್ಲವು ಅಸಂಭವ ಆಗಿದ್ದೆಲ್ಲವು ಅಪರಿಮಿತ ಆಗಬೇಕಾಗಿರುವುದು ಕೊಂಚ ನಕ್ಕರು, ಅತ್ತರು ನಂಟರಾಗುವರೆ? ಇರುವುದೇ ನೀನು.ಇದ್ದು ಜಯಿಸಬೇಕು ಈ ಜಗವ ಎಲ್ಲವ್ರು ನನ್ವರೆ ನಾನ್ಯಾರು ನಂಗೆ? ಮೊದಲಿದ್ದ ಖುಷಿ ಯಾಕಿಲ್ಲ ನಿಂಗೆ? 5. ಮರುಗದಿರು ಮನವೇ ನನಾಗರೆಂದು ಎಂದಿಗೂ ಮರೆಯದಿರು ನಿನಗೆ ನೀನೇ ಎಂದು ಬಂದು ಹೋದವರು ನೂರಾರು ನಿನ್ನ ಜೊತೆ ಉಳಿದವರಾರು ಕನಸು ಕೂಡ ಕೊನೆಗೊಂಡಿದೆ ಕತ್ತಲೆ ಮನ ತುಂಬಿದೆ. ನಗು ನಿನಗಾಗಿ, ಬಾಳು ನಿನಗಾಗಿ ಮರೆಯದಿರು ನಾ ಇರುವೆ ನಿನಗಾಗಿ 6. ಯಾರಿದ್ದರೇನು ?ಇಲ್ಲದಿದ್ದರೇನು? ಇರುವೆ ನೀ ಜೊತೆಗೆ. ಆಶಿಸಿಲ್ಲ ಎನ್ನನು ನನ್ನಿಂದ ಏನನ್ನು ಮರೆತಿಲ್ಲ ನಾ ನಿನ್ನನು ಜೊತೆಯಾಗಿರುವೆ ಕೊನೆಯವರೆಗೆ ನನ್ನರಿತ ನೀನು!ನಿನ್ನರಿತ ನಾನು ಹೋಗುವೆ ಬೇಗನೆ ಬರುವೆ ಮೆಲ್ಲನೆ ಬಣ್ಣದೇನಿದೆ ಇರಲು ನೀ ಜೊತೆಗೆ ಇರಲು ನೀ ಜೊತೆಗೆ ಜೇವನವೇ ಹೊಂಬಣ್ಣ ನೀ ಇರದಿದ್ದರೆ ಬದುಕೇ ಬರಡು ನೀ ಜೊತೆಗಿದ್ರೆ ಬದುಕೇ ಸೊಗಡು #To my Beard❤ 7. ಮರೆಯಾಗದ ಮರೆವು ನೀನು ನೆನಪುಗಳ ಒಡಲು ನೀನು ನನ್ನ ನಗುವಿಗೂ ಕಾರಣ ನೀನು ಈಗ ನನ್ನ ಕಂಬನಿಗೂ ಮೂಲ ನೀನು ಜೊತೆಯಾಗಿರಲು ಕನಸು ಕಂಡವ ನಾನು ಕಾರಣವ ಹೇಳದೆ ಹೊರಟು ಹೋದೆ ನೀನು ಇಷ್ಟಾದರೂ ನಿನ್ನ ನೆನಪುಗಳಿವೆ ನನ್ನಲ್ಲಿ ಸಿಗಬಹುದೇ ಅವುಗಳಿಗೂ ಮುಕ್ತಿ ಕೊನೆಯಲ್ಲಿ ಎಲ್ಲೇ ಇರು,ಹೇಗೆ ಇರು, ಖುಷಿ ಆಗಿರು ಒಮ್ಮೆಯಾದರೂ ನೆನಪಾದರೆ ಏದುಸಿರು ಬಿಡು ಅದೇ ಸಾಕು ಈ ಜೀವ ಬಾಳಲು 8 . ಕಂದೆಷ್ಟೋ ಕನಸುಗಳ ಮೂಲ ನೀನು ಕಾಣದ ನಗುವಿನ ಕಾರಣ ನೀನು ಚಿಂತೆ ಮರೆಮಾಚಿದ ಮುಗುಳುನಗೆ ನೀನು ನನ್ನೇ ನಾನಾಗಿಸಿದ ನನ್ನವಳು ನೀನು ಪ್ರೀತಿಯ ಒಡಲು ನೀನು,ಕರುಣೆಯ ಕೋಟೆ ನೀನು ಹುಸಿ ಕೋಪದ ಶೃಂಗ ನೀನು,ತುಸು ನಗೆಯ ಕಂಗಳು ನೀನು ನೀ ಹೊರಟ ನಂತರ ಇದು ಜೀವನವೇನು! 9. ಜೀವನಕ್ಕೆ ನೀ ಜೊತೆಯಾದೆ ಎಂದುಕೊಂಡೆ ಆದರೆ ಎಲ್ಲರಂತೆ ನೀ ನನ್ನ ಬಯಸಿದೆ ಕೊನೆಗೂ ನಿನಗೆ ನಾ ಸರಿ ಇಲ್ಲವೆಂಬ ಸತ್ಯ ಕಂಡುಕೊಂಡೆ ಅದೆಷ್ಟೋ ಕಷ್ಟಗಳ ನಡುವೆ ನಗಲು ಕಾರಣ ನೀನು ನಿನ್ನ ಕಂಬನಿಗೆ ,ಕೋಪಕ್ಕೆ ಕಾರಣವೂ ನಾನು ಬಲು ಚೆಂದ ನಿನ್ನಾ ಮಾತುಗಳು ಕಾರಣವಾಯಿತೆ ನನ್ನ ಕಣ್ಣೀರಿನ ಹೊಡಲು ತುಂಬಲು ಜೊತೆಗಿರುತ್ತೇನೆ ಎಂದ ನೀನು ಮತ್ತೆ ತಿರುಗಿ ಬರುವೆಯೇನೋ? ಪ್ರತಿ ದಿನವೂ ನಗುತ್ತಿರುವೆ ಕಾರಣ ನೀನು ಪ್ರತಿ ಕಣ್ಣೀರಿನ ಮೂಲ ನೀನು ನಗೆಗುಂದಿದೆ,ಕಂಬನಿ ತುಂಬಿದೆ ಜೀವ ಬೇಸತ್ತಿದೆ 10. ಹೇ ಹುಡುಗಿ ನಾ ಕೇಳುವುದೊಂದೆ ಇರು ನನ್ನ ಮುಂದೆ,ಇನ್ನೇನು ಬೇಡವೆಂದೆ ಕಾಯುತ್ತಿರುವೆ ನಿನ್ನ ಸಂದೇಶಕ್ಕೆ ಏಕೆಂದರೆ ಬೇರಾವುದು ಬೇಡವದಕ್ಕೆ ಒಂದೊಮ್ಮೆ ನಕ್ಕು ಬಿಡು,ನೋಡಿ ನನ್ನ ಸಾಕು ಈ ಜೀವ ಖುಷಿ ಯಾಗಲೂ. ಆ ಕಣ್ಣ ನೋಟ,ಮೆಲ್ಲ ಮಾತು ,ತುಸು ನಗೆ ಇದೆಸಾಕೇನೆಗೆ . ನಿನಗೆ ಸ್ನೇಹಿತರು, ಫ್ಯಾಮಿಲಿ ಎಲ್ಲವಾದರೆ? ಹೇಳೇ ಪ್ರೇಯಸಿ ನಾನ್ಯರೆ? ಇರಲು ಸಮಯವೆಲ್ಲರಿಗೆ ? ಇಲ್ಲವೇ ನಾನು ನಿನ್ನ ಬಯಸಿದ ಹಾಗೆ?. ",
            "date": "Answered December 12, 2018",
            "views": "920",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Varshini Varsh",
                    "user_href": "/profile/Varshini-Varsh-14"
                },
                {
                    "user_id": "Poojitha Yathiraj",
                    "user_href": "/profile/Poojitha-Yathiraj"
                },
                {
                    "user_id": "Skanda Ayur",
                    "user_href": "/profile/Skanda-Ayur"
                },
                {
                    "user_id": "Naveen Royal",
                    "user_href": "/profile/Naveen-Royal-33"
                }
            ]
        },
        {
            "author_info": {
                "name": "Shreyas Srinath",
                "href": "/profile/Shreyas-Srinath-5"
            },
            "answer_text": "The flow of your inner feelings on sheet will make a poem People did not sit and write to make the staza a poem but the transfer of imagination with choice of right word will make it a poem. To explain in Kannada …antarangada maatu kaavyada padagalalli haridu baruvude kaavya. There is a saying “A poet can see what a sun cannot see” meaning to say poet can go to depths of ocean inner feeling of human being but a sun cannot reach there . So you need to feel , you need to be with it only den you can write about it . Da. Ra bhendre wrote many poems which are actually his own life situations ..he could able to explain it so well and write poems because he was been through his life.. ",
            "date": "Answered April 18, 2018",
            "views": "488",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Chaitra Vrindraj",
                    "user_href": "/profile/Chaitra-Vrindraj"
                }
            ]
        }
    ]
}