{
    "title": "How to write a strong thesis paper - Quora",
    "tags": [
        "Major Concepts in Academia",
        "Specific Types of Writing",
        "Concepts in Higher Education",
        "Writing Theses and Dissertations",
        "Academic Writing",
        "Theses and Dissertations",
        "Best of X",
        "Academic Papers",
        "Writing"
    ],
    "response": [
        {
            "author_info": {
                "name": "Yunlok Lee",
                "href": "/profile/Yunlok-Lee"
            },
            "answer_text": "Answer: This is the approach I have used in presenting a thesis. The suggestions are pertinent for a research thesis in Humanities and Social sciences, and may not so relevant for STEMS thesis. Sufficient time allocated to write the thesis, but must not spent too much time writing a few chapters and neglect the other chapter. Written work must be properly edited. Useful to plan first what are to be written. Follow the plan closely. Then write a draft, put it away and return to improve it, edit and re-edit it. The whole thesis must be written like you are telling a story of your research work — you have spent a few years and invested much resources in researching a topic dear to you. Of not a story telling style but formal writing following the thesis guideline given to you by your school. Helpful to ask someone familiar with research in your research to read and critical it after you have written the thesis.In the introduction, the background to the research must be clearly written. The outline for each chapter is clearly presented. Likewise, the aim and objectives are clearly presented. The significance of the present tesearch is clearly noted. The writer’s research philosophy is made known. The structure of the research outline to be written is presented to offer the readers with a good overview of the research. A glossary of terms used in the thesis is succinctly defined and presented if offered.Have done a good literature review, proving you were very familiar with the related literature. Located the gap for your research. Use these effectively to develop the hypotheses if they are used. Pertinent notes from the literature review used, and correctly referenced. These notes are readily available for use in the writing process.Must ensure your work is well and formally written, where you strictly observed all the rules of grammar, with correct punctuations, and correct English expression in the language. No spoken English or colloquial used in the writing. Written sentences are kept relatively short so to not get yourself in a tangle in writing.The key areas presented are informative, succinctly and professionally discussed. There should be no patching! Each chapter must have an clear introduction and conclusion. Work must have section heads and within them paragraphing for new points in the discussion.Methodological approach used in the field work to collect the data is well-explained and its usage and its adoption for used, justified. The analysis is well discussed and findings clearly presented.The findings are clearly outlined, and are discussed, well supported by literature and where approriate underpinned by theories.Limitations of the current study are clearly stated, and recommendations for further research noted.A final conclusion chapter of the whole thesis is presented.Advise to keep copies of your written work safe in case in lose some of the completed work.",
            "date": "Answered January 22, 2020",
            "views": "450",
            "upvotes": " Answer requested by Quinn Saunders",
            "upvoters": [
                {
                    "user_id": "Paula Morales",
                    "user_href": "/profile/Paula-Morales-11"
                },
                {
                    "user_id": "Esther Dada Abiodun",
                    "user_href": "/profile/Esther-Dada-Abiodun"
                },
                {
                    "user_id": "Xi Lu",
                    "user_href": "/profile/Xi-Lu-55"
                },
                {
                    "user_id": "Anish Kumar Bhanja",
                    "user_href": "/profile/Anish-Kumar-Bhanja"
                },
                {
                    "user_id": "Ajar Sharma",
                    "user_href": "/profile/Ajar-Sharma"
                },
                {
                    "user_id": "Ainisah Yunus",
                    "user_href": "/profile/Ainisah-Yunus"
                },
                {
                    "user_id": "Adilson Boson, Jr.",
                    "user_href": "/profile/Adilson-Boson-Jr"
                },
                {
                    "user_id": "Patrick Ceaser Walugembe",
                    "user_href": "/profile/Patrick-Ceaser-Walugembe"
                },
                {
                    "user_id": "Elizabeth I",
                    "user_href": "/profile/Elizabeth-I-2"
                },
                {
                    "user_id": "Matthew Doppel",
                    "user_href": "/profile/Matthew-Doppel"
                },
                {
                    "user_id": "Sanchay Joshi",
                    "user_href": "/profile/Sanchay-Joshi-2"
                },
                {
                    "user_id": "Niki Balogh",
                    "user_href": "/profile/Niki-Balogh-1"
                },
                {
                    "user_id": "Vignesh Ramakrishnan",
                    "user_href": "/profile/विघ्नेश-रामकृष्णन-Vignesh-Ramakrishnan"
                },
                {
                    "user_id": "Abe Lopez",
                    "user_href": "/profile/Abe-Lopez-2"
                },
                {
                    "user_id": "Priscilla Chang",
                    "user_href": "/profile/Priscilla-Chang-3"
                },
                {
                    "user_id": "Jonathan Ng",
                    "user_href": "/profile/Jonathan-Ng-41"
                },
                {
                    "user_id": "Archie D’Cruz",
                    "user_href": "/profile/Archie-D’Cruz"
                },
                {
                    "user_id": "Scott Lee",
                    "user_href": "/profile/Scott-Lee-24"
                }
            ]
        },
        {
            "author_info": {
                "name": "Cecilia Sells",
                "href": "/profile/Cecilia-Sells"
            },
            "answer_text": "It all comes down to structure. If you structure your thoughts in a logical progression, your thesis will be strong. You'll know exactly where you need to do more research (if you do), and you'll be able to identify if there's a logical weakness in your argument (and then fix it, or simply acknowledge counter-arguements). Please read the answers here for the basics:Cecilia Sells' answer to How can I score a 6 on GRE writing?Cecilia Sells' answer to What are some essay hacks? If you're talking about a thesis for your masters' degree or a doctoral dissertation, your format is obviously going to be longer than a five-paragraph essay. So how do you expand this format without losing the basic structure? Here is an example: I believe X. X is true because A, B, C, D, and E. F and G are counter-arguments, but they are not important. X is important to the world because of Some Reason.A is important because Reasons. (need more depth? Go into the logic of the reasons in greater detail).B is also important because Other Reasons.C is even more important because Other Other Reasons.D is super important because More Reasons.E is important in some subset of cases of X, and here's why (Even More Reasons).F is a possible counter-argument against my thesis. I believe this counter-argument is not relevant in many cases (or ever) because Whatever Other Reasons.G is an argument that has been raised against X, but it is clearly not true because of Some Obviously Fallacious Reasons.So you see, X is clearly true in most or all cases. Is your paper too short? Think of this structure as fractal. You can do deeper in any area as long as you keep the structure. I know the most about writing humanities papers (not chemistry doctoral theses, for example), and for those, you can go deeper into pretty much any point. For scientific papers, you may need to go deeper into your methodology, or the reasons behind your experiment design, or the existing research you are building on, etc. Don't repeat yourself! This is an opportunity to write a better paper, not just a longer paper. Remember back when your teacher made you write an outline for your papers in school (middle school, high school, maybe even undergrad)? Do that. When your papers were short, it seemed like a waste of time. Now that you're working on a longer paper, with more research and higher standards, it will actually save you time and effort (and earn you a better grade). Write your outline and then start filling in the points as you do your research. Keep going... make that outline super beefy and thick, just full of information. This should be easy, because you don't have to worry about your language or fluidity... it's just a way of organizing your research. Pack in the info. Put little notes to yourself about those interesting thoughts that are part of your logical flow that are not cited. Now, read over your outline. Do you have any weak spots? Do a little more research or a little more thinking, and shore up those places. Does the logic flow in some kind of discernible order? Now is a great time to rearrange things if you need to. Maybe B should really be before A. Put things in the best, most logical order you can, and be consistent with that order throughout your paper. Do you have a huge outline, full of nested bullet points? If so, writing your paper should be super easy. You have everything all organized, ready to go, pre-sorted into sections and paragraphs. Translate those sentence fragments into sentences. Put transitions where they need to go. Don't forget to cite your sources! It's better to be overly careful about citations than to be lax about them. A thesis is strong when it does what it sets out to do. Structure is what allows the point of the writing to shine through. Good grammar and nice words are like icing... they're great, but they have to have a cake to hold them up. Structure is the cake beneath the icing. If your structure is good, your words don't have to be especially fancy to have a good thesis. If your structure is falling apart, all the nice words won't save it. ",
            "date": "Answered May 17, 2015",
            "views": "42",
            "upvotes": " View 18 Upvoters",
            "upvoters": [
                {
                    "user_id": "Ladi Ashwe",
                    "user_href": "/profile/Ladi-Ashwe"
                },
                {
                    "user_id": "Sara Ali",
                    "user_href": "/profile/Sara-Ali-613"
                },
                {
                    "user_id": "Isabel Allco",
                    "user_href": "/profile/Isabel-Allco-1"
                },
                {
                    "user_id": "Barnabas Eigege",
                    "user_href": "/profile/Barnabas-Eigege"
                }
            ]
        },
        {
            "author_info": {
                "name": "Gentle Delex",
                "href": "/profile/Gentle-Delex"
            },
            "answer_text": "Below are some 7 easy steps that can help you to write a thesis Before you start, think of your thesis as a case a lawyer has to defend. A thesis statement should explain to your readers the case you wish to make and how you will accomplish that. You can also think of your thesis as a contract. Introducing new ideas the reader is not prepared for may be alienating. An effective thesis statement controls the entire argument. It determines what you cannot say. If a paragraph does not support your thesis, either omit it or change your thesis. Pick a topic that interests you. This must be the first step in writing your paper and your thesis statement because all direction of the paper will depend on what topic you are writing about. Unfortunately, you must ignore this step if the topic is decided for you.Explore your topic. The goal of this step is to find a particular narrow subject in your topic which you can make an argument about. For example, take the topic of computers. There are many aspects of computers that can be expanded on such as hardware, software, and programming. However, vague topics like these do not make good theses. But something more narrow, such as the effects of Steve Jobs on the modern computer industry, allows for a much clearer focus.Know the type, purpose, and audience of the paper. These are usually assigned by the instructor, but even if you get to choose them, you must understand that these will affect your thesis statement considerably. If you are writing a persuasive paper topics, your purpose will be to prove something to a specific group. If you are writing a descriptive paper, your purpose will be to describe something to a specific group. Each of these must be expressed in your thesis somehow.Follow a rigid structure. Knowing the basic formulas will not only keep your thesis within the acceptable length but it will also help you see how your entire argument should be organized. Your thesis should contain two parts:A clear topic or subject matterA brief summary of what you will sayAnother way of looking at a thesis is as a formula, or a pattern, that comfortably holds your ideas:[Something] [does something] because [reason(s)].Because [reason(s)], [something] [does something].Although [opposing evidence], [reasons] show [Something] [does something].The last example includes a counter-argument, which complicates the thesis but strengthens the argument. In fact, you should always be aware of all counter-arguments against your thesis.Doing so will refine your thesis, and also force you to consider arguments you have to refute in your paper 5. Write down your thesis.Writing down a preliminary thesis will get you on the right track and force you to think about it, develop your ideas further, and clarify the content of the paper. You will be able to think about your thesis logically , clearly, and concisely. There are two schools of thought on thesis timing. Some people say you should not write the paper without a thesis in mind and written down, even if you have to alter it slightly by the end. The other school of thought says that you probably won't know where you're going until you get there, so don't write the thesis until you know what it should be. Do whatever seems best to you.6. Analyze your thesis statement once you think you have a final, or working, version. The point is to make sure you avoid making any mistakes that can weaken your thesis. To get a better idea of what to do and what to avoid, consider the following pointers: Never frame your thesis as a question.The job of a thesis is to answer a question, not ask one.A thesis is not a list. If you're trying to answer a specific question, too many variables will send your paper off-focus. Keep it concise and brief.Never mention a new topic that you do not intend to discuss in the paper.Do not write in the first person. Using sentences such as, \"I will show...,\" is generally frowned upon by scholars.Do not be combative. The point of your paper is to convince someone of your position, not turn them off, and the best way to achieve that is to make them want to listen to you. Express an open-minded tone, finding common ground between different views.7. Realize that your thesis does not have to be absolute. Consider it a \"working thesis\" that's subject to change. As you write your paper you may find that your opinion changes or that your direction has veered slightly. So make sure to continuously re-read your thesis, comparing it to your paper and making the appropriate changes so the two match. Once your paper is finished, go back to your thesis and determine if it needs another revision. ",
            "date": "Answered May 29, 2018",
            "views": "41",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/Arlene-88"
                },
                {
                    "user_id": "Karen Marie Shelton",
                    "user_href": "/profile/Karen-Marie-Shelton"
                },
                {
                    "user_id": "Ladi Ashwe",
                    "user_href": "/profile/Ladi-Ashwe"
                },
                {
                    "user_id": "Kelly Peterson",
                    "user_href": "/profile/Kelly-Peterson-71"
                }
            ]
        },
        {
            "author_info": {
                "name": "Sheri Fresonke Harper",
                "href": "/profile/Sheri-Fresonke-Harper"
            },
            "answer_text": "The word thesis is a hard word to understand and is much like theme and means the essence of the topic under examination. Note thesis is made of two words, the and is, directly connecting the idea that there is a noun involved in the discussion. Discover what that noun or subject is in relation to yourself and then decide what you think about it. Many writers don't know what they think. It helps to collect evidence first. So take your thesis topic and find out all the information you can find about the topic. Then sort the evidence into topical areas. Example: Ducks Books will reveal topics like territory, eating habits, mating, parenting, species, etc. How does the writer choose what they think? This is interesting or little know, informational essay that tells important factsContrast and compare, can offer controversy and allow the writer to choose one or otherOddball, apples versus oranges such as writers with ducks as a muse or cooking duck is improved with orange sauceSo first collect evidence, use the evidence to target a type of thesis, then decide what you think about it. ",
            "date": "Answered January 28, 2020",
            "views": "13",
            "upvotes": " View 4 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Rose Ann Tumulak",
                    "user_href": "/profile/Rose-Ann-Tumulak"
                }
            ]
        },
        {
            "author_info": {
                "name": "Dana Leigh",
                "href": "/profile/Dana-Leigh-5"
            },
            "answer_text": "You must start your first short paragraph stating your theory/thesis statement on what you are presenting (topic, idea, belief) and how you will validate it. This should stay very brief and clear. You must then demonstrate written references of various research from others to counter or agree with your theory and rationales throughout your entire paper. You must integrate your own ideas within the paper with your own professional judgements through statements with rationales to back up or contradict the theory (or theories) or topic for your thesis. Much of a thesis is research and data that should smoothly transition with each paragraph integrating idea to idea that reaches a conclusion. Don’t lose the reader. The conclusion must be clear and precise while providing other data through evidence based research weighing out other theoretical ideas from authors what you are presented as theory or factual belief in your thesis. The main factors in a thesis and/or dissertation is to transition clear thoughts and ideas in each paragraph throughout the paper to not lose the reader’s interest. Others’ curiosity must be achieved through researched data that is presented in a clear, understandable way. Jumping around from idea to idea is not warranted that causes confusion, and repeating or using obvious, known data to most readers will not keep their interest. The goal is to present a new fact, belief, a theory/outcome of a hypothesis that can change the reader’s outlook on a certain matter, or strengthen a previous theory through more validity of information. Thorough analysis of your reader/audience is a good starting point before writing while remembering what you are trying to persuade or teach in your paper. ",
            "date": "Answered October 17, 2017",
            "views": "339",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Lawrence Noel",
                "href": "/profile/Lawrence-Noel"
            },
            "answer_text": "Decide what opinion you have about the topic for which the essay is being written. Then make a statement about the topic, knowing that the body of your essay is going to be devoted to proving that what you stated in the thesis is actually true. Friendship is not a thesis. If your teacher tells you to write about friendship, you still have to make a statement about it. People who do not share the same political views can still be friends despite their differences. That would be your thesis. The next thing that you would do is to provide text/body paragraphs in which you presented evidence to support your point of view. You might introduce a pair of people and tell the reader about their political differences and then go on to describe how they are able to remain friends in spite of those differences. If you would like to consider a theses as having a secret, let it be that the thesis tells the reader what you think is true and will prove to the reader by the time he/she finishes reading what you write. ",
            "date": "Answered November 9, 2016",
            "views": "467",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Kiara Owens",
                    "user_href": "/profile/Kiara-Owens-15"
                },
                {
                    "user_id": "William Smith",
                    "user_href": "/profile/William-Smith-1034"
                },
                {
                    "user_id": "Christopher Perkins",
                    "user_href": "/profile/Christopher-Perkins-46"
                },
                {
                    "user_id": "Fatema Tuz Zohra",
                    "user_href": "/profile/Fatema-Tuz-Zohra-6"
                },
                {
                    "user_id": "Zohra Keya",
                    "user_href": "/profile/Zohra-Keya"
                },
                {
                    "user_id": "Baki Billah",
                    "user_href": "/profile/Baki-Billah-7"
                }
            ]
        },
        {
            "author_info": {
                "name": "Ragnar Brock",
                "href": "/profile/Ragnar-Brock"
            },
            "answer_text": "Explain what you want the reader to think, do, believe or know. Are usually just one sentence. Most often come at the end of the first or second paragraphs. May give a roadmap of the rest of the essay. 6 Easy Steps to Write a Thesis 1. Make a Thesis Question Take your essay topic idea and turn it into a question. Example: divorce. Thesis Question: How does divorce affect children? 2. Brainstorm Answers Write down as many ideas as you can think of. You might want Google search for ideas. Example: Divorce causes children to feel insecure about the future, not do as well in school, feel insecure in relationships, worry about their parents, become bullies or be bullied, have to get along with a new family of siblings, live a lower standard of income, wonder if they caused the divorce. 3. Pick a Thesis Answer Look at your brainstorming and decide your main answer. Example: How does divorce affect children? Divorce causes children to feel insecure. 4. Make a Thesis Road-Map Now go back to your brainstorming. What are the best reasons for your answer? Try to pick at least three. Add these to your thesis. Example: How does divorce affect children? Divorce causes children to feel insecure because they often have a lower standard of living after the divorce, they feel less secure in relationships, and they worry about the future. 5. Add Emphasis Steps 1-4 will make a solid thesis, but if you want to bump it up to the next level you can do two more steps: tell how your view contrasts with other people, and use intensifying transitions like \"in reality\" or \"in fact.\" ",
            "date": "Answered January 22, 2020",
            "views": "228",
            "upvotes": " Answer requested by Quinn Saunders",
            "upvoters": [
                {
                    "user_id": "Sandra Toler",
                    "user_href": "/profile/Sandra-Toler"
                },
                {
                    "user_id": "Robin Laungley",
                    "user_href": "/profile/Robin-Laungley"
                },
                {
                    "user_id": "Hannah Thynne",
                    "user_href": "/profile/Hannah-Thynne"
                }
            ]
        },
        {
            "author_info": {
                "name": "Mirembe Sarah",
                "href": "/profile/Mirembe-Sarah"
            },
            "answer_text": "Anything to do with good writing requires passion, well versed knowledge and determination. Whatever you are to write about make sure it is what you really want to write about. If you have a well developed passion in your research area then think about what it is in that you want to focus your attention on is what you will be testing. May be your passion is in government public relations, think about which area of government public relations you want to take on your thesis and what are you testing in the area of Government public relations.Is it the communication vehicles used in their activities or something hindering its successful developments? After knowing that strengthen your knowledge base with enough information in the area.Mostly the work of other researchers in the area of your research. Compare the knowledge and start writing yours. start with a problem statement , justification of your study, methodology and good measurable objectives. The rest will be so easy. ",
            "date": "Answered November 10, 2016",
            "views": "319",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Michael Sellars",
                "href": "/profile/Michael-Sellars-3"
            },
            "answer_text": "Choose your topic and reduce it.Ask the “so what question\" for some author’s thesis or topic sentenceDon't write long sentences. If they Write and reduce themAvoid burying a great thesis statement in the middle of a paragraph or late in the paper.Be as clear and as specific as possible; avoid vague words.Indicate the point of your paper but avoid sentence structures like, “The point of my paper is…”break them down. Do not be afraid to repeat the subject twice.A strong thesis statement expresses one main idea. Readers must be able to see that your paper has one main point. If your thesis statement expresses more than one idea, then you will likely confuse your readers about the subject. ",
            "date": "Answered June 25, 2020",
            "views": "27",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Olivia Bradley",
                "href": "/profile/Olivia-Bradley-54"
            },
            "answer_text": "For you to write a good thesis, a certain type of skill set is required as thesis writing is not an easy task. You need to have time, patience, good reading, and writing skills. Good knowledge of the area of study is required to even select the topic, and your thesis should contribute something new to that topic. The sole reason for a thesis is not just a written record undertaken by a candidate but also communicate the idea to a larger audience. A thesis should provide an informational enhancement to a specific community which it intends to reach. It should have a specific structure that is followed worldwide. THESIS STRUCTURE  Certain tips to writing a good thesis are- Record everything related to the topic of the thesis. Everything includes thoughts, perceptions, measurements, pictures while they are fresh in mind.Write with a reader's perception. Add new information and provide proper old information. Give quality content that makes the reader continue reading.Messy thinking leads to messy writing and messier thesis. Understand the writing process and levels of writing; starting with knowing the theme & object, Place documents according to time and topic, write with concentration and revise the work.Use Lindsay’s law of thesis writingTHINK>PLAN>WRITE>REVISE Understand all the elements related to your thesis.End with a bangUse this video as a reference before writing a killer thesis.  ",
            "date": "Updated February 24, 2020",
            "views": "125",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Pricella Betty",
                "href": "/profile/Pricella-Betty"
            },
            "answer_text": "Here are some tips for writing a strong thesis paper. Develop Your Argument. Your thesis is the most important part of your writing. Before you begin writing, you'll want to follow these tips for developing a good thesis statement: Read and compare your sources. What are the main points they make? Do your sources conflict with one another? Don't just summarize your sources' claims; look for the motivation behind their motives.  Draft your thesis. Good ideas are rarely born fully formed. They need to be refined. By committing your thesis to paper, you'll be able to refine it as you research and draft your essay. Consider the other side. Just like a court case, every argument has two sides. You'll be able to refine your thesis by considering the counterclaims and refuting them in your essay. Be Clear and Concise. An effective thesis should answer the reader question, \"So what?\" It should not be more than a sentence or two. Make a Statement. Although you do want to grab your reader's attention, asking a question is not the same as making a thesis statement. Your job is to persuade by presenting a clear, concise concept that explains both how and why. For research paper help you can choose My Paper Hub. ",
            "date": "Answered January 22, 2018",
            "views": "583",
            "upvotes": " View 6 Upvoters",
            "upvoters": [
                {
                    "user_id": "Woyin Adedigba",
                    "user_href": "/profile/Woyin-Adedigba"
                }
            ]
        },
        {
            "author_info": {
                "name": "Elsa J. Ogles",
                "href": "/profile/Elsa-J-Ogles"
            },
            "answer_text": " It is not easy to write a paper and takes commitment. Here is a short overview of how this can be handled. We mostly talk about a paper and/or a bachelor's thesis, but these tips you can naturally apply to any written work. Half the work is good practice. Therefore, think carefully first of all about what you want and what information you need. What are the hopes? Read the directions carefully. You can communicate them in class or the Study Guide, This guidelines include the teacher's expectations of the type of paper, the paper size, the layout of the paper, and the evaluation criteria. Talk to the teacher as soon as possible if you do not have this information.It can be interesting to create a framework before you start writing. You should place the key points on paper and use the keywords to build your text.You start to write once you have a structure. What are you saying? Is that your question?If you're interested in a topic, it's best to start by reading about it. In this way, you can become familiar with the subject matter and vocabulary and gain insight into the different facets of the subject. It's not intended to read in-depth, but you can save promising posts. Pause your brainstorming session reading activity. You have all the associations you have concerning the surface of the subject and write them down. You may be able to use a mind map. This should make it easier for you to formulate the topic of your paper in specific terms. You can only proceed with your paper if you know which question you want to answer. If you don't keep a particular topic in mind, you may only write something about a particular topic. So the message is demarcation.It's more fun, to begin with, a basic piece of paper. This way, you'll make more strides quickly. You don't have to type down the sentences right away.Your question is essential, first and foremost, but it is not and can not be concrete. your answer. It is tempting to devise some kind of response, then check for proof and ignore all that might run contrary to your response. The content of the document and in particular the claim would not benefit.Many an instructor of the language would frown on this advice and recommend it, however. Anyway, trust us. Do not be overly dismissive of sentence form, rhythm, word selection, dimensions, etc. when writing the first edition of a paper. A first draft can be accurate and then adapted more quickly than a perfect paper from scratch can be written. So first write down, in a manner that you feel is straightforward. You don't always check for the most original or most impressive expression. Many – often slow – versions are revised by the great writers.If you wish to produce a high-quality paper and / or bachelor's thesis, proper reference is very important. You will also stop plagiarism in this way!Rewrite the paper several times and give some time in writing as well. You read it with new eyes whenever you leave a document for one or two days.Assess the paper according to the following criteria: Is there a clear distinction?Is the paper scientifically organized?Will there be a difference between the beginning, middle, and end?Does a simple question arise in your paper?Is there a substantiation to your question?Does it have an answer to your question in your paper?Are your comments and claims clear?Are the points corroborated?Were you referring correctly?Does your paper meet the standards of the teacher?",
            "date": "Answered October 8, 2020",
            "views": "64",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Carol Thompson",
                "href": "/profile/Carol-Thompson-15"
            },
            "answer_text": "A thesis is, above all, a research project. It is not a research paper. You are now going to become a researcher yourself, not merely report the research of others.  Choosing a General Topic AreaObviously, this is the first step. What specific topic area has become of great interest to you? This is the area in which you should look for a topic.  Identifying a Research Question in the Topic AreaChoosing a research questions should not be all that difficult, if you ask yourself some pertinent questions. What do you really want to know more about? What chapter in your text or class lecture topic captivated your interest? Now, how can you formulate a research question related to that topic?  Developing a HypothesisYour hypothesis is developed from some preliminary research on the research question. Looking at the research question on bullying, preliminary study may have pointed to certain personality characteristics that you want to pursue – low self-esteem, response to a controlling parent figure, desire to please peer group, etc. The Thesis ProposalMany institutions will require a research proposal which must be approved by an adviser or committee.  It's just a part of heavy workload, Learn how to write a thesis with TrustedDissertations.com - here is the full guide for you. ",
            "date": "Answered September 10, 2015",
            "views": "502",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Amaya Cardinel",
                    "user_href": "/profile/Amaya-Cardinel"
                }
            ]
        },
        {
            "author_info": {
                "name": "Nita Ostroff",
                "href": "/profile/Nita-Ostroff"
            },
            "answer_text": "I'm going to provide a link to one of the best explanatory articles that I know of. It will guide you through establishing a research methodology. I noticed that one of the people who responded to this said you need a hypothesis. That is only true for quantitive (statistically oriented) studies. If you are studying why, what, or how, you likely have a qualitative study, which is more oriented to text and feelings. If you are trying to determine how much or to what degree, then the study is quantitative. Many studies these days are mixed, in which some of the study is one type and the rest is another. Here's a link to that article, by Saunders and Tosey (2013). They have a series of books on doing research, but this article summarizes it nicely and tells you were to look for more information for specific questions. The Layers of Research Design Saunders, M. & Tosey, P. (2013) The layers of research design. Rapport, 2012/2013. 58-59. ",
            "date": "Answered September 22, 2015",
            "views": "278",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Faiz Abidi",
                    "user_href": "/profile/Faiz-Abidi-1"
                },
                {
                    "user_id": "Delvin Jackson",
                    "user_href": "/profile/Delvin-Jackson"
                },
                {
                    "user_id": "Mainak Moitra",
                    "user_href": "/profile/Mainak-Moitra-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Jessica Larson",
                "href": "/profile/Jessica-Larson-18"
            },
            "answer_text": "A thesis statement is that sentence or two that asserts your position on a given issue, specifically, the position that you will be arguing for in your paper. This thesis statement should appear somewhere in the introduction to your paper. It can be the first sentence, although that’s often a rather simplistic and unexciting way to begin your paper. More often, then, a thesis statement should appear at or near the end of the first paragraph or two. The first step in developing a thesis (once you have decided on a topic) is to determine what your position is. To do this, you will need to thoroughly review all the relevant course materials. In most cases, you will have been presented with a number of arguments on both sides of the issue. Carefully analyze and evaluate all those arguments, taking notes as you do. In the process, you should develop your own take on the issue. To be honest, I am not really good at writing so I used to ask specialists like Supreme essay service to help me with it. If you want you can give them a try. Good luck! ",
            "date": "Answered November 10, 2016",
            "views": "340",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Fermin Johnson",
                "href": "/profile/Fermin-Johnson"
            },
            "answer_text": "Every paper you write should have a main point, a main idea, or central message. The argument(s) you make in your paper should reflect this main idea. The sentence that captures your position on this main idea is what we call a thesis statement. A thesis statement focuses your ideas into one or two sentences. It should present the topic of your paper and also make a comment about your position in relation to the topic. Your thesis statement should tell your reader what the paper is about and also help guide your writing and keep your argument focused. Your thesis should be limited to what can be accomplished in the specified number of pages. Shape your topic so that you can get straight to the \"meat\" of it. Being specific in your paper will be much more successful than writing about general things that do not say much. Don't settle for three pages of just skimming the surface. Your thesis statement is no exception to your writing: it needs to be as clear as possible. By being as clear as possible in your thesis statement, you will make sure that your reader understands exactly what you mean. ",
            "date": "Answered June 1, 2016",
            "views": "317",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Joseph Anderson",
                "href": "/profile/Joseph-Anderson-330"
            },
            "answer_text": "If you want to write a strong thesis paper just follow these simple steps. Analyze topicUnique ideasGather informationPlan different stages of thesisWriting different sections of ThesisFor more details check out this video.  ",
            "date": "Answered November 27, 2019",
            "views": "27",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Rose Robinson",
                "href": "/profile/Rose-Robinson-7"
            },
            "answer_text": "There is no secret of writing a good thesis or any type of writing. You must learn and know only the basic rules or things of writing. Apart from them you have grab the knowledge or read as much as about your thesis topics. When you collect all the thing of related thesis paper writing. Then you can write impressive thesis paper writing and score high grades. But still, you are confused and stuck with your writing then, you can take some help from thesis paper writing services or thesis paper help. ",
            "date": "Answered October 11, 2017",
            "views": "71",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Noah Davis",
                "href": "/profile/Noah-Davis-67"
            },
            "answer_text": "The question of a good thesis is a question of form. It is the sentence(s) that set the reader’s expectations for what they will learn reading your essay. An elementary version of thesis construction would look like this: Paragraph 1: Intro - explain what you’ll be talking about. Create a 3 point argument that you will try to convince the reader of. -Ends with thesis statement. Thesis could refer to points A, B, and C of paragraphs 1, 2, and 3. Paragraph 2: -Explores point 1. Paragraph 3: -Explores point 2. Paragraph 4: -Explores point 3. Paragraph 5: Conclusion. Briefly review points 1, 2, and 3 one more time.Snappy ending…if you wish…",
            "date": "Answered September 11, 2018",
            "views": "240",
            "upvotes": " View 1 Upvoter"
        },
        {
            "author_info": {
                "name": "Shirin Bismillah",
                "href": "/profile/Shirin-Bismillah"
            },
            "answer_text": "A thesis paper should be wholly based on your understanding and knowledge of the topic you choose to write on. It should convey a sense of theoretical sophistication and analytical understanding of the subject. Avoid giving summaries. And please, do not plagiarize. Even if you are borrowing an idea of any author or third person, mention it in the bibliography or footnotes. ",
            "date": "Answered December 4, 2013",
            "views": "583",
            "upvotes": " View 3 Upvoters"
        },
        {
            "author_info": {
                "name": "Haroldj Duk",
                "href": "/profile/Haroldj-Duk"
            },
            "answer_text": "Writing a thesis paper is a mainly accepted task in colleges and universities in which the learners must put forward their individual thoughts and suitable arguments on the subject of some issue or a topic. It is understandable that each thesis writing task takes a good deal of clear attention and researching from the part of every student. You need to get your hands on good facts, evidence and examples for supporting the main argument that you put forward. If you wish for getting a better grade, you must be very thoughtful and keep away from repetitions, inexactness, and spelling and grammar mistakes. However,  students used to fail to keep all these requirements while they write their essays.   ",
            "date": "Answered February 22, 2016",
            "views": "73",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Shivangi Patel",
                "href": "/profile/Shivangi-Patel-31"
            },
            "answer_text": "For More Details : https://www.wordsdoctorate.com/services/phd/ ",
            "date": "Answered December 8, 2018",
            "views": "126",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Amanda Liu",
                "href": "/profile/Amanda-Liu-21"
            },
            "answer_text": "you must try your best， ",
            "date": "Answered September 22, 2014",
            "views": "192",
            "upvotes": "0"
        }
    ]
}