{
    "title": "How to become a Quora writer - Quora",
    "tags": [
        "How-to Become Question",
        "Quora Community",
        "Using Quora",
        "Writers and Authors",
        "Writing"
    ],
    "response": [
        {
            "author_info": {
                "name": "Geraldine Cheung",
                "href": "/profile/Geraldine-Cheung"
            },
            "answer_text": "So. I’ve been here for about two and a half years. I think I’m qualified to answer this. Grammar, grammar, grammarDont rite like this (or try not to). most readers appreciate proper spelling and grammar. just look at this paragraph. it is an eyesore, isnt it? the grammar here is simply atrocious. dont assume grammar and spelling arent important. because they ARE, and peeple DO CARE. Even if u don’t.Similarly, dont rite in the way u would txt. say “you”, not “u”. say “great”, not “gr8”. dont be lazy with spelling and grammar.1 more thing — when someone suggests edits for ur answer, preferably dont tell them to back off. be thankful that they took the time. they r trying 2 help u. good grammar and spelling will increase ur credibility and audience size, which i assume is something you want to happen. Okay, I’ll stop that now. I can hear my school’s English Department screaming in the distance.Don’t just write. Write well.Here’s a thing I’ve noticed about Quora: the best answers aren’t necessarily the most informative ones, but the engaging ones. Great writers don’t just write. Just look at the writers here who have the highest follower counts. They write, and they write well. They’re informative, but they know how to craft words to engage the reader at the same time. If you’re not engaging, no one will read your answer. If you’re not informative, very few will like your answer. Quora is a lot like fiction writing — you have to learn how to write well, get your writing critiqued, research, read, and practice. Practice a lot.Master the art of proseWell, okay, you don’t have to be the next Stephen King, but you need to be able to write in a aurally and visually pleasing way. Knowing how to do this makes for, in my opinion, the best prose you could possibly hope for.What do I mean by “arually pleasing”? Well, look at the image below. It’s taken from a quote by American writer, Gary Provost: Notice how the words eventually begin to flow like natural speech. This is the effect you want to achieve. Read aloud what you write. You may notice that some of your sentences don’t flow well. Some sentences might be too short. Some might be too long. As Mr. Provost noted, the ear demands variety. So make variety. Now, what about making your writing “visually pleasing”? Well look at this paragraph I’ve created here. You haven’t even finished reading it yet, and it already looks like you’ll need a very long slog to get through all this text. There’s not even a photo nearby to break things up. It’s really not inviting. In fact, it looks dull. It looks drop-dead boring. And you’re not even halfway through! Now imagine that you write a pragraph this long. How many people would like to read it? Not very many, if any at all. But, you argue, your words flow very naturally. They are music to the ears (or so you hope). Well, okay. Fair enough. But the sheer length of a very long paragraph (like this one) is so uninviting that the reading experience grows dull anyway. Don’t believe me? Just try and stick a looong paragraph like this in the middle of your answers. Or even better, stick it at the opening of your answers. Very few, if anybody, will even attempt to read your answer. People are usually daunted by the appearance of a very long paragraph — even very keen readers. Learn how to break up your writing, not just for the flow, but also for the aesthetics.Whew, that was exhausting to write.Quora has many fancy features which allow you to visually change up your writing. There’s a quote feature, for instance. You can put images in your answers. You can link in webpages and Youtube videos. We have bold text, italic text, bullet points, and numbered lists.You have lots of visually stylistic opportunities which make for aesthetically pleasing answers. Use them.Write what you love.The main purpose of Quora is to teach others — content creators have to know their stuff, and that includes you. What are you good at? What do you already know? What information can you share with us that we don’t already know? That information can be literally anything: Harry Potter canon, pure math, life lessons… you can come up with practically millions of topics to talk about (I mean, it’s not exactly rocket science). Although no one’s stopping you from writing about that. The subject you love is the subject you’ve probably done your research on. Write about it. You’ll find a small audience who appreciates your efforts and knowledge. That audience will grow.Pick the “right questions”.Write answers to questions which spark inspiration in you. In my experience, answers sparked from some form of inspiration always make for the best answers.Pick questions for which you believe you can write engaging, accurate, and informative information. Admittedly, some writers here will write answers to questions which they know will do well, like survey questions (ahem, popular Quorans, I’m looking at you). There’s nothing wrong with that, really, if you’re concerned about your follower count and whatnot. In fact, I personally find that answering survey questions are the fastest and easiest way to get a huge follower count. Of course, your writing still has to be engaging and informative. Don’t forget about that.Read other answersModel your technique on good writers. What are they doing that you aren’t? What makes their writing not just good, but great?If you want pointers, I find Matthew Bates and Jordan Yates to be masters at wordsmithery. Their separate writing styles are practically unmatched.The most fact-heavy, yet engaging answers come from Spencer Alexander McDaniel. In my opinion, reading his material is like reading the action movie version of the encyclopedia.Funny answers work well too. Take a look at Alex Cooper, if you’re not worried about cracking a few ribs from laughter.And, of course, read outside of Quora as well (think good fiction books). Read bad answers too, to find out what you shouldn’t do (but don’t, of course, copy those answers). And, of course, read Quora’s answer policy, to make sure none of your answers get collapsed.Follow Quora conventionsThis means knowing what you should and shouldn’t do in terms of Quora answers. This means knowing that you don’t:Add a section at the end of your (viral) answer which basically says, “omg guys, 14k upvotes! I never thought this would happen. I’d like to thank my parents, my friends, and my goldfish”. I really don’t know why people do this. It adds nothing to your answer, and it’s an annoying thing to do.Write two sentence long answers which don’t say anything very interesting at all. Firstly, that answer will get collapsed. It’s too short. Secondly, you’re wasting people’s time with such an answer. Be interesting. Think of Quora as Youtube.Boast about your IQ/being in MENSA. In my experience, a lot of people found this to be very annoying. Thankfully, people don’t really do that anymore.Yes, I suppose you can do it, perhaps in your profile or where it’s relevant to the question, but for the most part it adds nothing to your answers except to scream, “nyah nyah ne nyah nyah, I’M smarter than YOU!”Violate Quora’s policies. Some of them are annoying, yes, but you’ll have to follow them if you don’t want your answers taken down.Add inside jokes or references to your answers. You can do this if your followers (or another popular Quoran) are in on the joke, but if you’re thinking of adding new people to your existing count, make yourself approachable and accessible to them.Provoke a troll. Let’s just say that bad things will happen to your follower count. To play it very safely, don’t write any sort of political answer, or a controversial answer. Although that’s only if you want to play very safe.Make yourself stand out.Some of the most successful Quorans have iconic phrases, profile pictures, and similar motifs which seem to help them greatly in terms of follower count. I’ve linked a few of their profiles here so you can get a good idea of what that looks like.Below is Sean Kernan’s profile. Notice how he’s called himself “the Son of Quora”. That’s worked very well for Sean’s Quora popularity. Some people choose to close their answers with a trademark tagline. This used to be in vogue a year or so ago, but it seems to be making a comeback. Try and make sure that your tagline is highly applicable and memorable. Just look at Julia Kvach’s trademark closing line.Oh, and remember that there’s a fine line between witty taglines and annoying ones.Another method is to pick an iconic profile picture. There are lots of examples for this: Nathan Stanish, for instance, being a Spiderman look-alike, obviously uses Tom Holland as his profile picture (apparently this doesn’t stop him from posting numerous selfies on Quora). I personally remember Dawn Amber’s material thanks to her “Legolas-trying-to-be-the-prettiest-member-of-the-fellowship” profile picture. And I can’t imagine Jake Williams as anything other than an anthropomorphic fox. Iconic, well chosen profile pictures give people something to visualize and relate to. A grainy picture of you holding your favourite shotgun is not really a well chosen profile picture.Another method is to constantly use your answers to say something which people can always refer to. Habib Fanny, for instance, is well known for being a cheesecake lover, and the Sultan of Sockistan (he has a thing for socks). Sean Kernan is obviously the Son of Quora. This works especially well for writers with a very large follower count, but that doesn’t mean that you shouldn’t try to do the same.Advertise yourself. Don’t be obnoxious about it, though.One last thing about not answers, but interacting with others…Quora commentsIn the comments, you must be polite and approachable. Above all, don’t violate BNBR. If you disagree with a comment, you can ignore it, block the commentor, or have a civil discussion with them, but DON’T go and blow up in the commentor’s face about it. Remember that other people see your comments too — they’re not private, and people will know if you deleted the comment. Replies to a deleted comment are also visible, so even if you’ve deleted a comment, people can still tell (roughly) what you said.It’s like internet safety. Think before you post. Don’t be stupid on the internet, as it’ll come back to haunt you later. Also, try and reply to your comments. This lets people get to know you, and might earn you a follower or two, or even a new friend. This gets more difficult with more followers, as the comments come surging in, but in the beginning, you should really try and talk to people. Let them get to know you.Quora MessagesIn case you’re new here and you didn’t know, Quora has a direct messaging feature (click your profile picture on the toolbar). Once you hit 1k followers (or so it was for me), you’ll start getting messages from people. These can be about practically anything, but here’s something I’ve noticed about messages:Be POLITE. You are talking to a stranger who has taken the time to message you. On that note, BE THANKFUL. If the message isn’t rude, getting a message from someone should be taken as an honor and a privilege. It means that someone has noticed your material and has taken the time to talk to you. Don’t play “high and mighty” with anyone except for your very close, real-life friends, who you can safely boast to (although Quora fame is pretty useless in real life, if I do say so myself — what a shame).Personally, I let others know how grateful I am that they took the time to message me, not just by saying so, but also by taking the time to put great thought into my (occasionally very lengthy) replies. I’ve found that people appreciate this a lot. It’s a much more effective way of showing your gratitude.If you are the messager, don’t for heaven’s sake begin the message with “hi”. To anyone, that just looks like you wandered into their messages not really knowing how you got there. A lot of Quorans will ignore you (though I personally don’t). You want to look like you know what you’re doing. In the writing industry, amateurs usually don’t look very good.Message someone with a purpose in mind. It might even get you a friend, who knows? Overall, Quora is a great place to write about what you love, read about what you love, and make some amazing friends (I’ve personally met a few people via Quora and met them in real life, which was a fantastic experience). However, if you’re to write on it, use it wisely. Use Quora badly, and you’ll get nothing from it. Use Quora well, and you’ll get many rewards, including an audience, a source of knowledge, and a place to practice your writing skills (and bragging rights to your friends, which I **cough** definitely don’t do). But don’t forget that with great power comes great responsibility. Quora should not be abused. It’s a community. It’s not a temple to you, or (for that matter) a dating site. Although I should note that people have married each other thanks to Quora before. Good luck on your Quora journey. And most importantly, have fun with Quora! ",
            "date": "Answered December 17, 2019",
            "views": "15",
            "upvotes": " View 50 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Garima Pegu",
                    "user_href": "/profile/Garima-Pegu-1"
                },
                {
                    "user_id": "Sarthak Joshi",
                    "user_href": "/profile/Sarthak-Joshi-67"
                },
                {
                    "user_id": "Samuel Edme",
                    "user_href": "/profile/Samuel-Edme-1"
                },
                {
                    "user_id": "Harriet Smith-Jones",
                    "user_href": "/profile/Harriet-Smith-Jones-2"
                },
                {
                    "user_id": "Tuula Närä",
                    "user_href": "/profile/Tuula-Närä"
                },
                {
                    "user_id": "Sarah Knitter",
                    "user_href": "/profile/Sarah-Knitter"
                },
                {
                    "user_id": "Neil Hiatt",
                    "user_href": "/profile/Neil-Hiatt"
                },
                {
                    "user_id": "Dinesh R",
                    "user_href": "/profile/Dinesh-R-158"
                },
                {
                    "user_id": "Bhagya De Silva",
                    "user_href": "/profile/Bhagya-De-Silva-1"
                },
                {
                    "user_id": "Koni Taylor",
                    "user_href": "/profile/Koni-Taylor"
                }
            ]
        },
        {
            "author_info": {
                "name": "Yusra Naaz",
                "href": "/profile/Yusra-Naaz-1"
            },
            "answer_text": "New quoran, and a female? This is for you! See whenever jussst whenever someone texts you on Quora for friendship, please please make sure that the person is genuine and the identity they present is their actual identity, before texting a word further. Why? So what happened some days ago was I got a text from a quora user, with an identity of a girl… Further on, this happened:  Okay no person nowadays is so cheesy to say 'dear' first of all, and secondly, I got the doubt as soon as I saw the text “let's start our friendship from the beginning”. Next:  So clearly this person introduced theirself as “Heera Naaz”, and the profile clearly has a girl's snap as the profile picture. This is something that can assure us that the person is genuine. But still as we need to be careful with everything online, I was like okay maybe I should have a quick check on this?! And Voila!:   Now I salute Quora for this. Thank you for keeping the edits section, Quora Even I got this idea from a person who wrote a similar answer like this on quora, but the answer got collapsed or I'm not sure what actually happened to it, but it's no more on here. Okay so coming back to the topic, the actual problem is the following. When I got my answer, I was like a ball of fire and so I replied the person as follows:  By this, I thought he will be ashamed or even if not, Quora is already here to solve my problem. So I did the very obvious thing anyone will do in this situation, is that I blocked this person, and reported them for not using their real name. And as it goes, Quora blocked the profile so as the person cannot use it untill they do not change the profile name to the real one. But but but…  Yes, as you see, he's at it again! We can see it clearly how this shameless person tried again and again untill quora let's him use his profile again. And now, I can't even report him again!! I was like wonderful then I should make people aware so that this garbage can be drained out of Quora. Now my point is, guys, please check out these things first and then go further with any conversation. It's more necessary than any other thing out there. Also, please be careful with online friendships, as our parent's always say. Also, if you guys can, please report this person! Update: Can't believe this guys! 😂😂 This person got reported by someone again, and omg he doesn't want to stop😂😂 (Read the below given screenshot starting from the bottom, as the latest is on top)  Godd!! ",
            "date": "Updated July 22, 2020",
            "views": "17",
            "upvotes": " View 370 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Siddhant Patil",
                    "user_href": "/profile/Siddhant-Patil-125"
                },
                {
                    "user_id": "Anshu Choudhary",
                    "user_href": "/profile/Anshu-Choudhary-64"
                },
                {
                    "user_id": "Sujata Singh",
                    "user_href": "/profile/Sujata-Singh-560"
                },
                {
                    "user_id": "Mrudula Laxmi Vallamkonda",
                    "user_href": "/profile/Mrudula-Laxmi-Vallamkonda"
                },
                {
                    "user_id": "Arpita Priya Agrawal",
                    "user_href": "/profile/Arpita-Priya-Agrawal"
                },
                {
                    "user_id": "Debangi Sinha",
                    "user_href": "/profile/Debangi-Sinha"
                },
                {
                    "user_id": "Rohit Rohilla",
                    "user_href": "/profile/Rohit-Rohilla-35"
                },
                {
                    "user_id": "Aloopa Panigrahi",
                    "user_href": "/profile/Aloopa-Panigrahi"
                },
                {
                    "user_id": "Nasiha",
                    "user_href": "/profile/Nasiha-5"
                },
                {
                    "user_id": "Riya Routh",
                    "user_href": "/profile/Riya-Routh-4"
                }
            ]
        }
    ]
}