{
    "title": "How to write a simple business letters - Quora",
    "tags": [
        "Business Letters",
        "Small Businesses",
        "Writing Advice",
        "Writing"
    ],
    "response": [
        {
            "author_info": {
                "name": "Arpit Patel",
                "href": "/profile/Arpit-Patel-545"
            },
            "answer_text": "A business letter is a type of letter which is serve as a mean of communication in a business organization. It is a professional way of communicating and exchanging information. The business letter uses a formal language and a specific format. It is a formal letter so it should be precise and to the point. It is important to use a proper format while writing a business letter. Avoid the usage of indentations and block paragraphs.Mention important details like name and address of your organization in separate lines.As it is a formal letter mention the full date.After mentioning the date , provide details of recipient in different lines.Use proper salutation is essential as it shows your respect to others. You can use “Dear Sir/Madam” or “ To whom it may concern “.Use polite words while writing the body of the letter.Your letter should be short and professional.",
            "date": "Answered May 29, 2019",
            "views": "353",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Leanne Eleazar",
                    "user_href": "/profile/Leanne-Eleazar"
                }
            ]
        },
        {
            "author_info": {
                "name": "Robert Charles Lee",
                "href": "/profile/Robert-Charles-Lee"
            },
            "answer_text": "It's amazing to see the litany of questions on Quora about how to write business letters. Most types of general business correspondence can be found in those secretarial typewriting and shorthand workbooks published by the major secretarial course providers (Pitman's, Gregg's, Newline, etc). The workbooks have been the staple for training out generations of secretaries for more than 100 years. The samples and exercises contained in those workbooks give out the most usual and generally established phraseology used in general business correspondence. Those workbooks should be your first port of call -- and learn them through general exposure and familiarity. Protip:- The general rule of thumb in starting any piece of general business correspondence is to use the phrase \"I shall be most grateful if you would kindly...\" Start with that and the rest of what you want to say tends to fall into place quite naturally. ",
            "date": "Answered December 17, 2015",
            "views": "858",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Edwin Lutiga",
                    "user_href": "/profile/Edwin-Lutiga"
                },
                {
                    "user_id": "Deepali Pandey",
                    "user_href": "/profile/Deepali-Pandey-10"
                }
            ]
        }
    ]
}