{
    "title": "How to write place descriptions better - The Writer’s Nook - Quora",
    "tags": [
        "Creative Writing",
        "Writers and Authors"
    ],
    "response": [
        {
            "author_info": {
                "name": "Mike Sweeney",
                "href": "/profile/Mike-Sweeney-135"
            },
            "answer_text": "In no particular order: Use the observer’s eyes and attitude. It is infrequent in fiction for the reader to be presented with an unbiased view. And not only does the narrative voice have opinions about the view, it will have peculiarities of focus. Putting that observer in the picture makes the description inherently more interesting. The mansion had solid brick walls, lightly crenelated, with two wings that reached towards a circular drive. A wide staircase opened into the double door. Olveg assumed that could be barred, but those tall glass windows were a weak point. For all its imposing bulk, this was not a defensible structure. Use five-senses writing. Much of your story will be visual — we are visual creatures, largely. That makes the mention of a sound or smell stand out more in the reader’s mind and make a place more memorable. Not all of this is direct senses either; the ornamentation on a place might be described as a gingerbread house. Or a half-timbered structure described as lacking only the beer garden. In neither of these cases is there a literal taste or smell, but the reader is going to be thinking of sweets or sausage and beer and that is going to color their impressions. Use — especially, lead off with — some vivid image or observation or opinion or simile. The desert gleamed like heated brass under the sun, the hot desert wind blowing in their faces. Pierre looked out at the low gray cliffs, the rubble of gray rocks, the crumbled gray gravel underfoot. “I feel like I’m in a Doctor Who episode,” he said. The first thing Sarah noticed was the wind. Under everything else, under the cries of the multitudinous and multicolored birds, the fugitive growls and cries from somewhere deep in the rain forest, the rustling of leaves and the steady drip and trickle from every broad leaf and from the corners of every flat surface, was the basso whisper of the coming wind. Use signatures. If you are going to be coming back to a location more than once, look for things in the description that can be repeated or echoed every time. You never want the reader floundering, wondering where they are, or worse yet seeing the unfolding scene as talking heads in a white room. Smack them with a color or sound or verb that says, “Yes, we are back in New Orleans for this scene.” Don’t try to cover everything. Let the reader do some of the work. In fact; cheat when you can. Instead of describing each and every denizen of an alien saloon, instead: An indescribable cacophony of alien tongues greeted him. Monstrous shapes could only be glimpsed in the shadows and the haze of taca and schill. Crowded onto a tiny stage, a quartet of big-headed aliens were doing their best at something that sounded like if you tried to train chipmunks to play Benny Goodman. And when the reader hits the cheat, they realize this is the Mos Eisley cantina, complete with Figrin D'an and the Modal Nodes. If you try to list out every single building and every color in use the reader will be dragged down. The trick is to pick a couple of things to single out and make examples of; then the reader will allow their own imagination to fill in the rest — or, rather, assume the rest has the same level of detail. ",
            "date": "May 29, 2020",
            "views": "224",
            "upvotes": " View 5 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Crepuscolo.",
                    "user_href": "/profile/Crepuscolo"
                },
                {
                    "user_id": "Albert Pajarilla",
                    "user_href": "/profile/Albert-Pajarilla-1"
                },
                {
                    "user_id": "Hemant Behera",
                    "user_href": "/profile/Hemant-Behera"
                },
                {
                    "user_id": "Anaïs Athena Grd",
                    "user_href": "/profile/Anaïs-Athena-Grd"
                },
                {
                    "user_id": "Stephanie Zawadzki",
                    "user_href": "/profile/Stephanie-Zawadzki-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Sanja Lang",
                "href": "/profile/Sanja-Lang"
            },
            "answer_text": " Personally, I don’t enjoy long descriptions, especially if they don’t have some specific purpose. The description should evoke the atmosphere of the space, the way that space affects the person entering that space, or the character of the person living in that space, or emphasizing some contrast. And most important of all, the description of the space must reflect the character of your main character who experiences that space. Once upon a time, I watched an episode from the Poirot series, based on the novel by Agatha Christie. In that episode, Poirot interrogates the people who were in the room playing cards during the murder. Poirot asks them to describe the room and to describe the course of the card game. Some people remember the furniture, carpet colors, etc., but do not remember the details of each card game. One person remembers parts of the card game, has no idea about the interior design of the room, but still remembers all the precious items the room was decorated with, especially the jewelry. The other lady remembers in detail who threw which card, how many points each of the participants scored, etc., but that’s all she can think of. In this case Poirot uses their descriptions of space as a kind of character study. So, if my main character is an architect, some architectural features will make sense in describing the space, if my main character understands painting, he will be interested in some good / bad picture on the wall of the room. I mean, if a three-year-old girl walks into an unfamiliar room, I won’t insert a description of French windows on the wall, a Persian rug on the floor, or a description of Art Nouveau furniture. You need to describe the space through the eye of the observer, not the way you see it. And with some purpose, and not just to fill the page with more words. ",
            "date": "May 30, 2020",
            "views": "899",
            "upvotes": " View 16 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Valentina Poslova ( Vally)",
                    "user_href": "/profile/Valentina-Poslova-Vally"
                },
                {
                    "user_id": "Claudio Chagas",
                    "user_href": "/profile/Claudio-Chagas-1"
                },
                {
                    "user_id": "Taylor Jones",
                    "user_href": "/profile/Taylor-Jones-218"
                },
                {
                    "user_id": "Sounds of Teaching",
                    "user_href": "/profile/Sounds-of-Teaching"
                },
                {
                    "user_id": "Terry Skaug",
                    "user_href": "/profile/Terry-Skaug"
                },
                {
                    "user_id": "Edvin Swiftarrow",
                    "user_href": "/profile/Edvin-Swiftarrow"
                },
                {
                    "user_id": "Luis Torres",
                    "user_href": "/profile/Luis-Torres-311"
                },
                {
                    "user_id": "Gaynor Lowell",
                    "user_href": "/profile/Gaynor-Lowell"
                },
                {
                    "user_id": "S. Harish (ச. ஹரிஷ்)",
                    "user_href": "/profile/S-Harish-ச-ஹரிஷ்"
                },
                {
                    "user_id": "Kristen Dearden",
                    "user_href": "/profile/Kristen-Dearden"
                }
            ]
        },
        {
            "author_info": {
                "name": "Annie Hansen",
                "href": "/profile/Annie-Hansen-16"
            },
            "answer_text": "What does it look like? How does it make you feel when you view it!? For instance…as I neared the shack memories came flooding in. My heart began pounding at the sight, as it held many dark secrets of life gone by. That my mother had never seen the child I gave birth to because she had died before the birth of my son made me sad and lost in my thoughts ! Sean grabbed my hand as he knew the strength it took to even look upon this dilapidated mess I grew up in. Shingles hung loose on the exterior and the putrefying pale green with a tattered wood shake roof! Many of which had blown off in wind storms but Were never replaced. I can recall the pails and pans scattered throughout on rainy days and nights….So you see in your imagination what the view of your object becomes and I do things a very old fashioned way…I first sort out a grabber sentence of whatever my imagination has Developed and I run with it. Beneath my grabber sentence I list as many descriptive words of that sentence I can muster. Then I do my paragraph. Sometimes the words just flow and other times you must be creative in your thinking to fit your descriptive words in! Be who you are… feel the freedom to just let go and hear your own personal voice…you can do this! Trust yourself! Good luck! ",
            "date": "May 29, 2020",
            "views": "126",
            "upvotes": " Submission accepted by Dirk Hooper"
        }
    ]
}