{
    "title": "How can one write two college application essays in a week? - Quora",
    "tags": [
        "College Application Essays",
        "Essay Writing Help",
        "Essays",
        "Writing Advice",
        "How-to Question",
        "Writing"
    ],
    "response": [
        {
            "author_info": {
                "name": "Aston Tsui",
                "href": "/profile/Aston-Tsui"
            },
            "answer_text": "“Five hundred twenty-five thousandSix hundred minutesFive hundred twenty-five thousandMoments so dearFive hundred twenty-five thousandSix hundred minutesHow do you measure - measure a year?In daylights - in sunsetsIn midnights - in cups of coffeeIn inches - in milesIn laughter - in strife” Wow, what a cheesy intro to your question. But the point I’m trying to make is, a week…or time for that matter, is what you make of it. More specifically, how you allocate it…and prioritize the things you need to do. Let’s tackle this bit by bit. There are many types of college applications, with the two most prominent being Common App and UC (debatably, depending on your schools of choice). First, consider the length (word limit) of your essays. Then, consider the prompt(s). Can you address the prompts instantly and quickly, or is it a slog of a struggle with nothing coming to mind? That will make a huge difference in time. Second, how quickly can you write? Think about all the standardized tests you have ever taken in your life. The AP English test is around 3 hours. The SAT writing section was 20 minutes and now 50 minutes I think. Under such time constraints, YOU WILL write it, lest you simply give up on yourself and take that score that you know is less than what you can achieve. If you think like that, there is no doubt you can complete the 650 words or so required by each essay. In fact, if pressed enough, you could probably write both in a day. But don’t let that be an excuse to put it off to the last minute, because the quality will suffer, as will your admissions, as will you, ultimately. To provide a more cogent, direct, and applicable plan for you, break down the week into 7 days. Then break down the 7 days into 24 hours. You sleep 8 hours. Then you have 16 hours, 8 for school. The rest is up to you to allocate. HOW you allocate the hours will depend how important these college applications are to you and how motivated you are to get it done. Next, address the prompts. If it’s Common App, there are 5, choose 1, 650 words. If it’s UC, there are 8 choose 4. There are also many other supplemental essays. Finally, just get to writing. The fact that you came onto quora seeking advice/guidance means that you just need a little push to get you moving, or else you would be writing right now instead of reading about how you should write. I’m going to cut and paste some resources I’ve compiled/written to help you get started. Good luck. Traditionally, college admissions essays/personal statements are written as a story that show character, qualities demonstrated such as leadership and perseverance, overcoming hardship, etc. That’s the WHAT, or the content of what you will be writing. In order to address the HOW, there could be several techniques you could utilize. Brainstorm-Brainstorming is something we’ve been familiar with since those worksheets we got in fourth grade, but the process can be daunting when you feel as if you have very little content to work with. The quickest way to start the process is to simply take a blank sheet of paper and in the middle, write down “ME”, or your name, or whatever the focal point of your personal statement should be. (It should be you.) Then, simply write down words that are offshoots of you. Focus on the positive and the qualities you’ve demonstrated in your life, but if it is negative, elaborate on how that has allowed you to grow and change and develop. Remember: the events in your life are objective. The interpretation of those events become your subjective reality, as you process your life through cognition.2. Mindmap-Next, take those words and try to find the links between them. For example, if you wrote down ME in the middle, and the offshoots were a) track and field b) NHS c) social acceptance d) AP English composition f) Your family This is quite like a jumble without any kind of coherence initially. As it should be, because you’re just getting started. Now let’s look for the links. I have no idea what your background or personality or how you want to “angle” yourself to the colleges, so this has to be purely hypothetical. These 5 offshoots that I thought of off the top of my head represent sports, extracurriculars, a larger scope of HS life, academic courses, and background. Always think about what your words, sentences, and paragraphs represent. The meaning is more important than the literal words. Now, going deeper, what can we extract from these topics? Sports-leadership, teamwork, dedication, passion, achievement, competition, spirit, growth extracurriculars-going above and beyond, volunteering, sustaining excellence, balancing multiple obligations, potential leadership social acceptance-insight, analysis, relationships, humanity AP English composition-academic excellence, dedication to academics, focus, industriousness, will, interest, potential family and background-Connections, support, love, hardship, learning, growth, forgiveness, understanding 1. Layered depth-If you want to get a little fancier, we can go with something I’ll call layered depth, which would be a kind of technique where you go deeper and deeper in a particular topic until you reach something so deep that it resonates and connects beyond a standard essay. Let’s use the social acceptance example. a) School is tough, hard to fit in, like Mean Girls b) Why is school structure like that? Then you notice cliques c) How do people behave in cliques? Each person has a role in each group d) What is the function of each role of each person? e) How can one enter an established group or become expelled from a group through violating social norms From here, you have the opportunity to transition into a more academic and mature discussion of topics related to anthropology and sociology to show that you are more than just a typical candidate. f) How similar are humans to animals in the animal kingdom? Wolfpacks, bonobo monkeys, flocks of migrating birds, etc. (zoology) g) in-group out-group theory (psychology) h) How society functions (sociology) 1. Micro/macrocosm Lastly, microcosm and macrocosm can be used to take one tiny microscopic event and use it to symbolize a grand universal theme. Let’s use sports in this example. You constantly finish last place. That’s a normal occurrence. Somebody has to finish last in every race. But how does that feel? What does that mean? What did you do in response? Did you languish and accept it? Did you analyze it? Did you feel inferior? Is Darwinism the be all end all of land, or does man possess the power to harness his or her own strengths to overcome a situation through force of will and perseverance? That’s one example. Another example could be SOMEONE ELSE constantly finishes last and gets bullied and picked on all the time. You, as an observer, do not contribute to the bullying nor do you aid this person. Meanwhile, you observe, and sit, and watch. How do you interpret this situation? What does this mean? What will you response in the future? Will you do anything? Did you feel compelled to help but felt powerless in the situation because of the power of the social situation? Or did you accept that such is life and one person can only do so much? These are the questions that will reveal your character, and the way you present your answers is the revelation of your own nature. There is no falsifying of content because you are who you are and nobody else. And nobody can be you. But just know that every instance, moment, event, or situation, no matter how mundane (such as Newton’s apple falling from a tree), or cataclysmic (natural disasters, the terror you see in the news ever day), can represent and symbolize the essence of who you are. If you can present it well enough, and it’s a good fit with the school, luck will be on your side. On that note, there will always be a factor of luck. But that doesn’t mean you don’t have the means to put yourself in the best position to become the best that you are capable of becoming. Also, here’s a free personal statement book that I wrote, but it’s extremely difficult to write a full length, polished, and satisfactory book to my standards. But it’s free so why not! Free Personal Statement Book Here’s a script I wrote for a video regarding the writing process… In this video, we’re going to skip a lot of the counseling process and move towards the personal statements because that’s where a lot of the value is. In order to hone your editing skills, you should employ a technique I’m going to refer to as “The 5 Point Check”. It is essentially a checklist of key aspects of the writing in your student’s essay. They are: 1) Tone 2) Structure 3) Grammar/Mechanics 4) Flow (transitions+diction) 5) Content Tone-Tone is the way something sounds. It can have a serious connotation, feeling, or vibe. This can be conveyed through periods and curt statements. Or…it could be suspenseful…and maybe even animated! The reader should try and stay consistent though, or else it can very difficult to establish the voice of the writer. Structure-The structure is the skeleton, template, or mold of the essay. The statement must progress forward in a way that is coherent, logical, and progressive. The classic way to ensure that structure exists before starting to write is by OUTLINING using a 5 paragraph essay. A 5 paragraph essay consists of: 1) Introduction, including the thesis statement at the end of the paragraph 2) Main Idea 1 (Body) 3) Main Idea 2 (Body) 4) Main Idea 3 (Body) 5) Conclusion that summarizes the essay and ties up loose ends That’s the most BASIC structure though. There are many different ways to create form out of your substance, but as long as the essay makes sense as a cohesive whole, then structure has been established. Grammar/Mechanics-Grammar and mechanics are the rules of conventional writing. For a more in depth review of grammar, please check out this supplemental video. Please keep in mind that language is constantly evolving, so rules can be broken if it somehow appropriate. An example would be colloquialism, or if you want to sound friendly, as if you were talking to a peer. Flow-Flow is progression. Flow is smooth. It could be jagged if that’s what you want to establish, but you want to put grab the reader with a hook, then put the reader in a trance with your articulate thoughts and your eloquent style. Simply progress naturally towards an eventual end of your story. Content-There is the ability to write. And then there’s content. Content is the material with which you write. If you are a swordswith, your art is making swords. Your tool is a hammer, or whatever you forge swords with. Your MATERIAL is steel, or whatever you MAKE swords with. If you are a writer, your art is writing. Your tool is your pen, rhetorical devices, and your mind. Your MATERIAL is your content. Content is what life is made of. Your content is the steel with which you’ll carve your character into the minds of your readers. It is most likely the most important component of the five aspects of writing we cover here. Content is important. Because content is king. Just write. That first step is always the hardest. Once you get started, it practically writes itself. Peace. Read more: RENT - Seasons Of Love Lyrics | MetroLyrics ",
            "date": "Answered December 8, 2016",
            "views": "11",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Lauren Marie",
                    "user_href": "/profile/Lauren-Marie-73"
                },
                {
                    "user_id": "Julie Edelstein",
                    "user_href": "/profile/Julie-Edelstein"
                }
            ]
        },
        {
            "author_info": {
                "name": "Brad Schiller",
                "href": "/profile/Brad-Schiller"
            },
            "answer_text": "Completing your final drafts can take a while, but a week should be doable. The first thing you need to do is brainstorm some potential answers to your prompt. From this, you should create an outline, and then write a very rough draft. You should be able to do this within 2-3 hours each. At that point, it becomes about feedback and revisions. Start showing your essays to people and get their reaction on the content. Does it answer the prompt? Is it impressive? Is it structured well and easy to read? There are a couple of FREE tools at your disposal that my company, EditRevise, has created for your benefit: 1) The free nearly 40,000 word eBook, Constructing Your College Application, which will walk you through the application process and the things you need to think about when writing your application. 2) Free feedback on your essays within 24 hours through doesmyessaysuck.com. Upload your essay and get a score on your content, structure, and grammar along with two pieces of actionable feedback provided by essay experts. Good luck! ",
            "date": "Answered January 20, 2016",
            "views": "683",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "John Parsons",
                    "user_href": "/profile/John-Parsons-26"
                }
            ]
        },
        {
            "author_info": {
                "name": "Giles Phoebe",
                "href": "/profile/Giles-Phoebe"
            },
            "answer_text": "I 100% agree with Sage Burch's answer to How can one write two college application essays in a week? These tips will help you with creating the layout of your application essay and gather all the important information together. Also, answer these questions: Why do you want to study this program at this school?What has influenced you?How the school you chose satisfies your desire for learning and your future?Often, school shares requirements for an essay (its length, formatting), so don’t forget about it. Also, school can ask to answer specific questions (like these questions - Our 2016-17 Application Essay Questions | MIT Admissions). It is very important to proofread you essay. You can do it here - Application Essay. And quoting Sage, “Put it away. Look at it with fresh eyes in a day or two.” ",
            "date": "Answered November 9, 2016",
            "views": "401",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "John Garrett",
                "href": "/profile/John-Garrett-35"
            },
            "answer_text": "On the off chance that you are attempting to compose a college application paper time is not on your side particularly on the off chance that you just have one week in which to compose it.  Fabricate off of your achievements  Begin by building off of your achievements. This is the quickest approach to locate an incredible theme on which to compose. With a specific end goal to compose a college application essay you have to inspire the reader and demonstrate to them why you would make a decent possibility for their academic institution.  Make your proposition  When you have your story or occasion in hand, you have to create a thesis. This implies having an essential issue to your essay. Despite the fact that it is not a formal academic essay it is critical that you have an understandable point. Attempt and abridge the motivation behind your essay in one sentence.  Stay particular  While you are composing your college application essay in less than one week you have to guarantee you are specific. ",
            "date": "Answered January 8, 2016",
            "views": "222",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Himali Shah",
                    "user_href": "/profile/Himali-Shah-3"
                }
            ]
        },
        {
            "author_info": {
                "name": "Patti Charron",
                "href": "/profile/Patti-Charron"
            },
            "answer_text": "I did six for grad school in about a week  You can do two. There's lots of overlap.  Stop fretting. Instead of telling yourself you can't possibly do it, sit down and get it taken care of. You'll kick yourself for fussing and making a mountain out of a foothill.  And you will be so relieved when you're finished.  Get busy.    ",
            "date": "Answered January 8, 2016",
            "views": "213",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Kenneth Hong",
                "href": "/profile/Kenneth-Hong-1"
            },
            "answer_text": "Get organized, Be clear, Write about your accomplishments not some far fetched un developed thought in the far corner of your  mind. Make sure you have a point to each of the essays. Remember its only a thousand words.  Its not a novel. I'm sure the essays can be done in much less time.  You just don't have the time to have multiple people edit it and give you feedback.  This may be a good thing as too much feedback confuses some people and the essay gets frankensteined. The main thing is sit down,  stay focussed, put your mind to the task (believe and have faith), and get it done.   ",
            "date": "Answered January 9, 2016",
            "views": "371",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Himali Shah",
                    "user_href": "/profile/Himali-Shah-3"
                }
            ]
        },
        {
            "author_info": {
                "name": "Sage Burch",
                "href": "/profile/Sage-Burch"
            },
            "answer_text": "Here's what you do. Make a list of all your achievements: certificates, scholarships, community service, community involvement, after school activities and your role in them, internships, awards...Make a list of who you think you are, and who you want to be.Make a list of the things you want to do in order to make the most of your college expierences.Turn those lists into one big lost in order of when you want them to appear in order to turn it into a cohesive narrative/story.Turn your bullet points into flowing sentences. Make sure to vary your sentence length. Paint a picture.Look over your essay for ways that you can tailor your essay to fit the college, and the opportunities your college will have. Put it away. Look at it with fresh eyes in a day or two. Have someone else look it over for errors. Hope that helps! ",
            "date": "Answered January 8, 2016",
            "views": "564",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Lisa Kirk",
                    "user_href": "/profile/Lisa-Kirk-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Jessica Millis",
                "href": "/profile/Jessica-Millis"
            },
            "answer_text": "You need to be extremely focused to fulfill that. Here are tips on how to write your essay fast - How to Write an Essay in Under 30 Minutes .  When out of time students usually start looking for writing services to get help. Be careful when making your choice even if you are in a hurry, check reviews, because you not always find the perfect ones - EssayTigers.com Review by AskPetersen, Total Score: 7.5/10 . Hope that it would help. ",
            "date": "Answered January 11, 2016",
            "views": "260",
            "upvotes": "0"
        }
    ]
}