{
    "title": "How to write a letter as a nurse for my patient for being away from school - Quora",
    "tags": [
        "Writing Letters"
    ],
    "response": [
        {
            "author_info": {
                "name": "Anne Brown",
                "href": "/profile/Anne-Brown-19"
            },
            "answer_text": "Be sure you talk to your patient about how much information s/he wants released. Review HIPAA guidelines before you write anything. They’re pretty stringent. Don’t offer what the illness was, or even that s/he was in the hospital unless the patient OK’s it—you must have some kind of form for release of information if you’re working at a hospital. I have found that very few education professionals have the slightest idea of what medical and psych diagnoses mean. Furthermore, they’re not as aware of HIPAA breaches as nurses are, and have a pretty gossipy culture. My daughter’s MS guidance counselor, for instance, did not know what OCD, or obsessive-compulsive disorder was. Not a clue. I’d limit it to: Name of person who gets it, who by rights should be a nurse aware of HIPAA, who can then pass on limited information as needed. Zena W. was under medical care from the period 7/7/07 - 9/9/07. Should you have further questions or want additional confirmation, you may call me at XXX-XXX-XXXX. Sincerely, ",
            "date": "Answered November 3, 2017",
            "views": "173",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Pat Hatch",
                    "user_href": "/profile/Pat-Hatch-3"
                }
            ]
        },
        {
            "author_info": {
                "name": "Edmund Tan",
                "href": "/profile/Edmund-Tan-27"
            },
            "answer_text": "Just state the facts. so-and-so student was in my office/clinic/care for a major/minor operation/activity from xx to yy. please contact me if you have any questions. Don’t put any details of the treatment (except ifit was something like a bad flu, or if the school needed to be aware of certain medical issues. ",
            "date": "Answered November 5, 2017",
            "views": "17",
            "upvotes": "0"
        }
    ]
}