{
    "title": "How much words should be included in a phD dissertation? - Quora",
    "tags": [
        "PhD Thesis",
        "Theses and Dissertations"
    ],
    "response": [
        {
            "author_info": {
                "name": "Michel Clasquin-Johnson",
                "href": "/profile/Michel-Clasquin-Johnson"
            },
            "answer_text": "TL:DR You use as many words as you need to say what you have to say. Then you stop.  Ok, now for the long explanation. There are distinct differences between disciplines and institutions. Classics is probably the worst - 700-1000 page dissertations are not unusual. I've seen Mathematics dissertations of 50-100 pages or so, but filled cover to cover with equations that make my brain hurt just looking at them. And some countries have traditions of verbosity while others do not, and some institutions  likewise have traditions of their own. You need to ask your supervisor about this, not strangers on Quora. Your supervisor should be able to give you an acceptable range for your discipline and institution. But the essential thing is to tell your story. If you are leaving importants part out, it's your supervisor's job to tell you that. If you are \"padding\" your dissertation with unneeeded material to reach an arbitrary word count, that means your central argument was too thin too begin with and the examiners will hammer you for it. So, tell your story. Make your argument. Show me where the problem came from, what else has been done about it, and why your way is better. Show me your conclusions, make a few recommendations. Then STOP.  ",
            "date": "Answered May 3, 2016",
            "views": "15",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Andrea Reisenauer",
                    "user_href": "/profile/Andrea-Reisenauer"
                }
            ]
        },
        {
            "author_info": {
                "name": "Barbara Robson",
                "href": "/profile/Barbara-Robson-1"
            },
            "answer_text": "Check the guidelines of your university. There is usually a maximum word length, but no minimum, as long as it satisfies the requirements of being a substantive, original work that contributes to the field. The maximum length is typically somewhere between 75,000 and 100,000 words. As a rule of thumb, the more equations you have, the shorter the thesis is likely to be: a humanties PhD thesis is likely to approach the maximum word-count, while a maths PhD is likely to be much shorter. ",
            "date": "Answered April 28, 2016",
            "views": "12",
            "upvotes": "0"
        }
    ]
}