{
    "title": "How bad is it to regularly be 5–15 minutes late for work? - Quora",
    "tags": [
        "Work Ethic",
        "Sleep Habits",
        "Work"
    ],
    "response": [
        {
            "author_info": {
                "name": "Ryan Duffee",
                "href": "/profile/Ryan-Duffee"
            },
            "answer_text": "As an HR manager, I’ve come to realize that there is absolutely no one who works a full 8 hours. Unless, you’re working in some capacity that requires your full attention 100% of the time. But, lets be real, nearly every job offers everyone a bit of downtime during their time. Another thing I’ve learned is that most managers are more guilty of “not working” during company hours than standard employees. A lot of time managers feel a sense of security or they’ve delegated enough work among employees that their day isn’t consumed by minor tasks or of course you have those who think they’ve earned it to be able to relax a bit. In contrast, most standard employees feel they are being watched, need to make an impression, have been threatened for termination, and many other things that make them think twice about taking time to themselves during the work day. Where am I going with this. One, I always live by the golden rule and this is included in my management style. If I’m 5 or 10 min late a couple days a week, I have no right to get upset at an employee who is 5–10 minutes late each week either. Now, if that employee starts taking advantage of my understanding and abuses it and is late every day, than I’d probably call them into my office and let them know there is a problem and reel it back in a little. Just because a person is on time to work every day, does not make the dependable, reliable, trustworthy, or a good employee. It’s definitely a good characteristic, but I have had many employees who show up on time, but do garbage work or waste a lot of time doing personal stuff when they should be working. I’d much rather have an employee who shows up 10–15 min late every day, but when they work, they are 100% committed and the quality of their work shows it. If I have an employee who checks social media 100 times a day, browses the internet, walks around the office, goes to the vending machines 4 times a day, etc. imagine how much time is being wasted by that employee. I mean they are here every day on time, but the amount of time they waste while here, is more of an issue than John Doe who strolls in 5–10 min late every other day or so, but works his butt off. There are many other factors that one must evaluate before saying someone is a problem or has a bad attitude. Hell, I love coming to work, but am I late from time to time, yeah, but that doesn’t make me a bad employee. I will say this though, if an employee is late consistently, you might have a deeper problem which should prompt you to have a sit-down conversation with that employee to determine if there is something personal going on, maybe they’re unhappy with work, they might even shed light on a hostile work situation where they bring up some negative leadership information within the company that makes them not want to come to work. There is a myriad of things that should be asked before giving someone the boot. Moreover, every human resource is an asset to the company and I personally evaluate how much of an asset based on the quality of work they are doing. Going back to what I said before, if you have an employee who wastes a cumulative 3 hours of work time over their 8 hours and performs mediocre work, I see this as more of an issue than a person who is 10 min late, but is very productive and the quality of their work is great. Who would I rather lose? This is not a green light to go be late every day, I think everyone on this thread has one thing we all agree on and that is that it shouldn’t become a habit and if you notice it, than you should at least speak to the employee. On a personal note, I had a boss that used to get pretty upset when people would show up 5–10 min late be it once or 5 times. However, he would leave every day 1–2 hours early. I had came in about 7 min late one morning after hitting unexpected construction on the way and I even tried to call his cell phone to let him know, but he did not answer. I walked in my office and sat in my chair and before I got my computer on, my desk phone rings and I answer to him asking me to come to his office. I came into his office and he attempted to give me this speech, “I know you’re not late a lot, but it sets a bad example when you are. You’re a leader at this company and I expect you above anyone else to set the example.” The prior military service in me kicked in and I sat back and rather try to argue with him or provide “my side of the story”, I said, “yes sir, I completely understand. I apologize about this morning, it won’t happen again.” He looked at me and said, “okay, great, see you later” and I walked out. I was really irritated. That afternoon, around 3:15, I see him with his cup and coat and he waives bye and walks out. This is an hour and forty five minutes before the day is supposed to end. The following day, I beat him to the office by about 5 min. As he walked in, I asked if he could come into my office. He sat down and I tactfully said to him, “sir, again, I apologize for yesterday and being late. I try my hard to get here on time every day as I believe in being on time and respecting the company’s time. You spoke about my role as a leader here yesterday and your expectations of my performance regarding it. I wanted to express to you that I agree with you 100% regarding our above average expectations which is why I wanted to bring this to your attention. You consistently leave the office each day 1.5 - 2 hours early each day. As my boss, I have no right to ask you of your motives or activities, but I want you to know that your early absence does not go unnoticed by the office and therefore, they believe that it is okay to be a little late or possibly quit working an hour or two before they are supposed to. I can personally care less about what time you leave, but I do believe that leadership starts from the top, the example starts from the top, and if there is an expectation for one, than it must be held by all. If being late 5–10 min is an issue for you, imagine what the VPs or President things when you take 10 hours of work away from them each week by leaving 2 hours early every day. This is by no means attempting to justify my tardiness yesterday, but take this as me attempting to bring solidarity and standardization to everyone for the benefit of our company. My boss at the time had this look in his eye like, “who does this guy think he is?” However, he politely said, “you’re right, I probably should stop going through the front door when I leave early” and we had a laugh, but he was not mad, he thanked me for the conversation and went to his office. He never again spoke to me regarding a tardiness nor did I see him get on anyone else. I think he realized that if he was going to hold someone to a standard, he also had to follow it. When he realized that the standard he was trying to set was tough for even him to hit, he lightened up a little bit. So, before you go pointing fingers and telling people what kind of unreliable, undependable, or bad employee they are for being a few minutes late, I’d say you need to do a lot of inner soul searching and ask yourself if you are living up to the standard yourself in addition to asking yourself how much effort are you really putting into your work; ",
            "date": "Answered February 14, 2020",
            "views": "61",
            "upvotes": " View 16 Upvoters",
            "upvoters": [
                {
                    "user_id": "Amelia johnson",
                    "user_href": "/profile/Amelia-johnson-115"
                },
                {
                    "user_id": "Jordan Munoz",
                    "user_href": "/profile/Jordan-Munoz-4"
                },
                {
                    "user_id": "Shell Roskom",
                    "user_href": "/profile/Shell-Roskom"
                },
                {
                    "user_id": "Robert Black",
                    "user_href": "/profile/Robert-Black-101"
                },
                {
                    "user_id": "Cyn Dartez Walker",
                    "user_href": "/profile/Cyn-Dartez-Walker"
                },
                {
                    "user_id": "Tegh Singh",
                    "user_href": "/profile/Tegh-Singh-5"
                },
                {
                    "user_id": "Luis Miguel Ferreira",
                    "user_href": "/profile/Luis-Miguel-Ferreira-1"
                },
                {
                    "user_id": "VIcky Taylor",
                    "user_href": "/profile/VIcky-Taylor-56"
                },
                {
                    "user_id": "Sabine Hahn",
                    "user_href": "/profile/Sabine-Hahn"
                },
                {
                    "user_id": "Carrie Tassey",
                    "user_href": "/profile/Carrie-Tassey"
                }
            ]
        },
        {
            "author_info": {
                "name": "Carol Thompson",
                "href": "/profile/Carol-Thompson-28"
            },
            "answer_text": "If you worked for me I'd let you go. You show a total lack of respect for not only the company you work for but for your boss and the other employees. It sends a signal to co-workers that you are above them and that you work on your own terms and at your own speed and according to your personal time clock. If you were habitually late whether it's 5 minutes or 15 minutes, you would get a warning from me first with a heart-to-heart that you cannot be treated any differently from any other employee in my organization. I would tell you that if you were late again that I would appreciate a phone call because I would remind you of our previous conversation and that you need to bring boxes to clear out your desk. No one is irreplaceable. I don't care what job you do. There's always somebody else waiting in the wings ready and able to pick up where you left off. There are absolutely special circumstances. A child or other family member is sick, a parent needs assistance, your babysitter didn't show up or is sick or quit last minute. Those things are completely out of your control but they shouldn't happen so often that it becomes habitual. It's when you constantly have to stop and put gas in your tank or you missed the train or there’s so much traffic that you couldn't get to work on time that I would suggest to you when we have that heart-to-heart that you may need to find a job that will work around and accommodate you rather than you accommodating your employer. We lived in Northern Virginia when my husband was stationed at US Army Command in Alexandria Virginia. He had to be to work by 8:00 am. In order to get there on time he had to leave the house at 5 AM. If he left at 5:30 he would be late by 30–60 because the traffic was so bad. He made sure he was on the road by 5 AM, Monday through Friday. If you value your job and you respect your co-workers and your boss then you'll do whatever's necessary to get to work on time every single day. If you don't then you should dust off and update your resumé. You're going to need it. Carol ",
            "date": "Updated November 27, 2018",
            "views": "256",
            "upvotes": " View 23 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Ken Scott",
                    "user_href": "/profile/Ken-Scott-60"
                },
                {
                    "user_id": "Rick Johnson",
                    "user_href": "/profile/Rick-Johnson-657"
                },
                {
                    "user_id": "Cyn Dartez Walker",
                    "user_href": "/profile/Cyn-Dartez-Walker"
                },
                {
                    "user_id": "Lauren Lee",
                    "user_href": "/profile/Lauren-Lee-414"
                },
                {
                    "user_id": "Carrie Tassey",
                    "user_href": "/profile/Carrie-Tassey"
                },
                {
                    "user_id": "Vera Li",
                    "user_href": "/profile/Vera-Li-34"
                },
                {
                    "user_id": "Raymond Crutcher",
                    "user_href": "/profile/Raymond-Crutcher-2"
                },
                {
                    "user_id": "Sandra Olney",
                    "user_href": "/profile/Sandra-Olney-1"
                },
                {
                    "user_id": "Celeste Tucker",
                    "user_href": "/profile/Celeste-Tucker-2"
                },
                {
                    "user_id": "Yay V",
                    "user_href": "/profile/Yay-V"
                }
            ]
        }
    ]
}