{
    "title": "How to write a 20-page research paper in 12 hours - Quora",
    "tags": [
        "Research Paper Writing",
        "Research Papers"
    ],
    "response": [
        {
            "author_info": {
                "name": "Yashdeep Yashdeep",
                "href": "/profile/Yashdeep-Yashdeep-2"
            },
            "answer_text": "Hi Thanks for the A2A. Short answer : Even if you can, Don’t! It is very difficult to form an unbiased, analytically sound paper (20 page) in 12 hours: It is not just about the words, it is about if it is readable. A research paper is directed towards the readers so you would need to reiterate to refine the paper according to the readership.It will be almost impossible to get a third person opinion on the paper in 12 hours and hence there will be somethings you might have skipped or over emphasized.If you copy paste content and use a rephrasing tool, it would end up making no sense whatsoever, again defeating the purpose of the paper. I recently reviewed a paper where I could easily make out that a rephrasing tool was used.Formatting the paper, adjusting the figures, cross-referencing, building up th bibliography alone will take atleast 4–5 hours even if they are near perfect from the start.What good is a research paper if it is not read by the people it is meant for?There can be many reasons why the effort will be a waste of your 12 hours. It is better to ask for an extension as mentioned in the other answer rather that attempting it half-heartedly. I hope that helps. Thank you! All the Best! I am Yashdeep and I love researching and developing Internet of Things and Energy Harvesting systems. Feel free to reach out if you would like to collaborate. Thank you! ",
            "date": "Answered May 18, 2020",
            "views": "179",
            "upvotes": " Answer requested by Hunter James Moffett",
            "upvoters": [
                {
                    "user_id": "Daniel Helman",
                    "user_href": "/profile/Daniel-Helman"
                }
            ]
        },
        {
            "author_info": {
                "name": "Dani Alexis",
                "href": "/profile/Dani-Alexis-2"
            },
            "answer_text": "You start by having all your research at hand, a detailed outline that already contains every item you plan to cite, your thesis statement and topic paragraph-level topic sentences written, and your bibliography ready to go. Then you start at the top and connect the dots. Be sure to schedule a couple extra hours after these 12 for editing, because you will have to fly through to get the draft itself done in 12 hours. That's the only way I know to do a 20 page research paper in 12 hours or less - by using those 12 hours for drafting ONLY, not for research, prewriting or revision. And I write for a living. ",
            "date": "Answered May 8, 2020",
            "views": "69",
            "upvotes": " View 1 Upvoter"
        }
    ]
}