{
    "title": "How to find out if my writing is good enough to become a freelance writer - Quora",
    "tags": [
        "Creating Writing Advice",
        "Freelancing",
        "Creative Writing",
        "Writers and Authors",
        "Writing Advice",
        "How-to Question"
    ],
    "response": [
        {
            "author_info": {
                "name": "Erwin Anciano",
                "href": "/profile/Erwin-Anciano-1"
            },
            "answer_text": "The truth is that the quality of your writing matters little when it comes to freelancing.  There are two main ways to qualify your writing: subjective and objective. The objective way has to do with grammar and all the actual rules that govern the English language. Everything else -- from style to width of vocabulary to whatever -- is actually all completely subjective.  And you'll find that even the so-called objective part isn't all that set in stone either.  I know many freelancers who I (subjectively) consider to be my lessers when it comes to \"writing quality\" but hey they are raking in thousands of dollars every month, way more than I make. Some are even bad technically and make grammatical mistakes all the time. But they still earn more than I do.  What matters the most in freelance writing is your ability to connect with editors. It's all about your ability to pitch an article and get accepted by the editor. After that, your ability to attract audiences.  And since editors and audiences have their own personal idea of what's good, your writing could be \"ghetto writing\" and still appeal to a wide demographic and an editor who wants that kind of thing for his publication.  What's important is your ingenuity -- your ability to find niches and markets that you want to send a message to. Finding opportunities in markets that aren't obvious to most people.  Your perseverance -- freelancing is all about pitching hundreds of times only to get accepted once. Building a relationship with an editor or publication -- you can't pitch all the time, you'll starve. The key is to find long-term retainer clients that you can have a standing relationship with, who will provide you work on a regular basis. This is the only real feasible way to sustain a career in freelancing for most freelancers. There will be exceptional outliers, but mostly you will need retainer clients or you'll just burn out from the fear of never having a steady income and the constant pitching. Networking is so important to anyone who wants to succeed in life, but doubly so with freelancers, it's a basic requirement. So you need to turn up the congeniality meter and connect with people. Use your passion to follow a course you want, and infect other people with your enthusiasm. If you can do this, the connections will follow. If you are a famous person for one reason or another, especially in a certain niche, then it's even easier to freelance because editors will realize that you can easily attract an audience. That's why so many people want to go viral. That's why some people can be paid $3,000 for a single blog post that it takes them an hour to do, while some can only make $2 working their butt off.  So TLDR, I wouldn't worry about my writing ability. If you can write a high school book report without flunking you should be fine. Focus on connecting with people and learning to pitch ideas. After that it's 100% hardwork and perseverance. ",
            "date": "Answered March 8, 2016",
            "views": "947",
            "upvotes": " View 6 Upvoters",
            "upvoters": [
                {
                    "user_id": "David De Jesus Oliveira",
                    "user_href": "/profile/David-De-Jesus-Oliveira"
                },
                {
                    "user_id": "Keith Franklin",
                    "user_href": "/profile/Keith-Franklin-1"
                },
                {
                    "user_id": "Wang",
                    "user_href": "/profile/Wang-47"
                },
                {
                    "user_id": "Girish I",
                    "user_href": "/profile/Girish-I-1"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/John-Widden"
                },
                {
                    "user_id": "Jane King",
                    "user_href": "/profile/Jane-King-21"
                }
            ]
        },
        {
            "author_info": {
                "name": "Dan Naumovich",
                "href": "/profile/Dan-Naumovich"
            },
            "answer_text": "I was going to suggest that you know you're writing is good enough when someone is willing to pay you for it. But then I remembered a couple of articles I recently read in a business publication and realized that you can get paid for bad writing as well. Having your writing critiqued is certainly a viable option, but be careful how you go about this. If you post a piece you wrote to an online forum and ask people for their thoughts, you may get some honest assessments of your work. However, you can also expect some people to rip your writing to shreds just for the \"fun\" of it, and then in response others may feel sorry for you and say that your writing is wonderful. Neither of these assessments can be relied upon. In my opinion, it's best to just get your writing out there in front of people without asking for a critique. If people are reading it, that's a good sign. If they're compelled to leave a comment saying they like it, even better. There are no shortage of people  who relish the opportunity to correct your grammar every chance they get, and that's not a bad thing if you want to make a go of it as a freelance writer. But I think the real test is if people are compelled to read what you wrote.  ",
            "date": "Answered December 30, 2015",
            "views": "11",
            "upvotes": " View 10 Upvoters",
            "upvoters": [
                {
                    "user_id": "Niyas Ibrahim",
                    "user_href": "/profile/Niyas-Ibrahim-3"
                },
                {
                    "user_id": "Amelia McNamara",
                    "user_href": "/profile/Amelia-McNamara-2"
                },
                {
                    "user_id": "Saikat Das",
                    "user_href": "/profile/Saikat-Das-48"
                },
                {
                    "user_id": "Prashanth Subramanian",
                    "user_href": "/profile/Prashanth-Subramanian-5"
                },
                {
                    "user_id": "Mansi Shrivastava",
                    "user_href": "/profile/Mansi-Shrivastava-7"
                },
                {
                    "user_id": "Beth D. Casey",
                    "user_href": "/profile/Beth-D-Casey-1"
                },
                {
                    "user_id": "Ben A. Wise",
                    "user_href": "/profile/Ben-A-Wise"
                },
                {
                    "user_id": "Ashmita Ahuja",
                    "user_href": "/profile/Ashmita-Ahuja"
                },
                {
                    "user_id": "Donn Lee",
                    "user_href": "/profile/Donn-Lee-1"
                },
                {
                    "user_id": "Sanjot Mondal",
                    "user_href": "/profile/Sanjot-Mondal"
                }
            ]
        },
        {
            "author_info": {
                "name": "Harry Dewulf",
                "href": "/profile/Harry-Dewulf"
            },
            "answer_text": "I can usually tell if a writer is good enough within 500 words. Sometimes it takes up to 2000. But the worst answer anyone gets from me is: you aren't good enough yet. Practice makes better, and quite quickly makes good enough for a lot of purposes. At Narrative Path, we have pretty high standards, though, because we want to partner with people who can produce top quality fiction. You can make money as a freelance writer without being that good. But the better you are, the more jobs you can get. In general, I wouldn't trust any formal test for writing ability. And I wouldn't trust critique sites and forums too much either, but mainly because the best way to judge is way more effective. The best way to tell if your writing is good enough is to submit your writing to companies that want writers. There's a lot of work for 'content writers' at the moment, and in my opinion most of the writing is pretty poor. So start offering articles to web journalism sites. Start offering articles to clickbait sites. (you know all those \"viral\" stories in your FB and Twitter feed? People get paid to write them). If you submit 100 articles to 100 companies and none of them wants your work, then your work is pretty terrible. But if just one or more does, congratulations, you're a freelance writer. And the next hundred you write will be better. ",
            "date": "Answered January 21, 2016",
            "views": "377",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Erwin Anciano",
                    "user_href": "/profile/Erwin-Anciano-1"
                },
                {
                    "user_id": "Chris Nutt",
                    "user_href": "/profile/Chris-Nutt"
                }
            ]
        },
        {
            "author_info": {
                "name": "Larry Dixon",
                "href": "/profile/Larry-Dixon-1"
            },
            "answer_text": "I'm throwing in with an add.  I've been at it for over 30 years, and in all honesty, it doesn't seem to be about the quality of the writing.  I am humble, and I know I am maybe a slightly above average writer.  I've hit a few high points, but I am no genius, and I've paid the bills at freelancing for a long time just the same.  Freelancing isn't only about the quality of the work, it is about your resourcefulness, integrity, reliability, and sheer show-must-go-on willpower. You see, one seldom-spoken-of thing about freelancers, in comics, illustration, and about everywhere else, is that they're assumed to be flakes.  I can't count on all fingers and toes how many times I have done gigs as \"rescues\" for publishers who were left high and dry by another freelancer that simply didn't deliver. So in the definition of \"if your writing is good enough,\" I'd like to encourage you to consider \"and can reliably be done under pressure\" as one of your criteria.  I have complete faith that you can learn every technical skill that you should have.  Just please, keep in mind, it isn't the work an editor hires, it's the person.  Be someone they can count on.  Be amazing. ",
            "date": "Answered January 21, 2016",
            "views": "718",
            "upvotes": " View 14 Upvoters",
            "upvoters": [
                {
                    "user_id": "Vinayakrishna",
                    "user_href": "/profile/Vinayakrishna"
                },
                {
                    "user_id": "Jim Miller",
                    "user_href": "/profile/Jim-Miller-139"
                },
                {
                    "user_id": "Mercedes Torres",
                    "user_href": "/profile/Mercedes-Torres-2"
                },
                {
                    "user_id": "Sara Napier",
                    "user_href": "/profile/Sara-Napier"
                },
                {
                    "user_id": "Mercedes R. Lackey",
                    "user_href": "/profile/Mercedes-R-Lackey"
                },
                {
                    "user_id": "Hannah Frome",
                    "user_href": "/profile/Hannah-Frome"
                },
                {
                    "user_id": "Prabhakar Tamil",
                    "user_href": "/profile/Prabhakar-Tamil"
                },
                {
                    "user_id": "Lukas Garcia",
                    "user_href": "/profile/Lukas-Garcia"
                },
                {
                    "user_id": "Danielle Newton",
                    "user_href": "/profile/Danielle-Newton-3"
                },
                {
                    "user_id": "Byron James Kimball",
                    "user_href": "/profile/Byron-James-Kimball"
                },
                {
                    "user_id": "Anne Bolender",
                    "user_href": "/profile/Anne-Bolender-1"
                },
                {
                    "user_id": "Drew Nichol",
                    "user_href": "/profile/Drew-Nichol-1"
                },
                {
                    "user_id": "Miles Dolphin",
                    "user_href": "/profile/Miles-Dolphin"
                },
                {
                    "user_id": "Harry Dewulf",
                    "user_href": "/profile/Harry-Dewulf"
                }
            ]
        },
        {
            "author_info": {
                "name": "Juan Pablo Forero",
                "href": "/profile/Juan-Pablo-Forero"
            },
            "answer_text": "Thank you for the A2a. The best way to know if your text is good is to ask right here in Quora. Post a small text, not more than one page long, and ask for honest feedback. It's not easy to know if you are good just by your own as other answers suggest, in fact, it's very difficult to know it because you are too close to what you write. The idea of taking lessons is great, that's the best way to have good feedback from the teacher and the people you do the course with. But I don't know about any good website to get feedback apart from Quora. So if you like, post a new question asking for people to tell you what they think about it. That way you can get good answers that will let you know in what place you are. Another important suggestion I can give you is to put apart your text for some time, like a month, and the read it again to see if it's good. Also, read works of people that are recognized to be good, that's the best way to learn how to do it right. Good luck with your work! ",
            "date": "Answered December 31, 2015",
            "views": "203",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Steve Cross",
                    "user_href": "/profile/Steve-Cross-1"
                },
                {
                    "user_id": "Petra Fort",
                    "user_href": "/profile/Petra-Fort"
                }
            ]
        },
        {
            "author_info": {
                "name": "Michael Brooks",
                "href": "/profile/Michael-Brooks-94"
            },
            "answer_text": "As a freelance writer the one thing you have to keep in mind is writing is NOT the same for every platform. For instance, the way you write a blog will be completely different to how you write copy on a website or the words you use in a social media post.  Some websites like UpWork test writers on their skills, but it's bogus. Most of those exams have been leaked online and a simple Google search will point you to the correct answer.  goLance is a better option because you can build out your profile and start applying for gigs to grow as a freelance writer.  The biggest thing I tell freelance writers is never stop learning. Never stop growing. If all you're looking to do is write blogs you're selling yourself short. Being a \"good\" writer doesn't mean jack nowadays. Being a bad writer does.  What do I mean by that? Well bad writers don't know how to write for SEO or copy for different mediums like the ones I mentioned above. Don't settle for that type of writer life. Always push yourself, learn and grow as a writer. You'll be far more valuable as a freelancer and have an easier time securing gigs.  ",
            "date": "Answered May 9, 2016",
            "views": "299",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Rajesh Menon",
                    "user_href": "/profile/Rajesh-Menon-23"
                }
            ]
        },
        {
            "author_info": {
                "name": "Patti Charron",
                "href": "/profile/Patti-Charron"
            },
            "answer_text": "There is no \"test\" to determine if your writing is \"good enough.\"  One of the responsibilities of a competent writer is know when the work is worthy to be set out for everyone to read it. A writer must be confident in his skills with language, usage, grammar, syntax, spelling, punctuation, and the many and varied  conventions and styles that go with different types of writing.  A writer who is unable to make those determinations on his own is a writer whose work is not ready for public consumption.  It takes a long time to become a competent writer, and longer still to become  a freelancer.  Frankly, if you don't know if you are \"good enough,\" you're not.  This is not to say you can't change that, but until you have the tools to measure your own skill and talent, don't frustrate yourself and sully future opportunities.  I would advise you against looking for helpful advice on \"writing websites.\" Those websites exist for the sole purpose of driving traffic to advertisers. Anyone can log on and tell you they're a fab, published, professional writer/novelist/life coach/etc.  and here's what you should do. But the fact is, you don't know who or what you're dealing with, and the \"advice\" is often rubbish.  There loads of books about writing and all the things we must consider when writing. There are lots of excellent websites that offer good instruction about the mechanics and rules of grammar, punctuation, etc.  I think you'll find that writing is an avocation, as well as a possible vocation. If you love writing, you'll find your way.  ",
            "date": "Answered December 30, 2015",
            "views": "549",
            "upvotes": " View 9 Upvoters",
            "upvoters": [
                {
                    "user_id": "Amelia McNamara",
                    "user_href": "/profile/Amelia-McNamara-2"
                },
                {
                    "user_id": "Alec Fane",
                    "user_href": "/profile/Alec-Fane"
                },
                {
                    "user_id": "Tom Milbourne",
                    "user_href": "/profile/Tom-Milbourne"
                },
                {
                    "user_id": "Beth D. Casey",
                    "user_href": "/profile/Beth-D-Casey-1"
                },
                {
                    "user_id": "Ben A. Wise",
                    "user_href": "/profile/Ben-A-Wise"
                },
                {
                    "user_id": "Ashmita Ahuja",
                    "user_href": "/profile/Ashmita-Ahuja"
                },
                {
                    "user_id": "Krishna DV",
                    "user_href": "/profile/Krishna-DV-1"
                },
                {
                    "user_id": "Lisa Almstead",
                    "user_href": "/profile/Lisa-Almstead"
                },
                {
                    "user_id": "Anupriya Saraswat",
                    "user_href": "/profile/Anupriya-Saraswat"
                }
            ]
        },
        {
            "author_info": {
                "name": "Charlotte Henley Babb",
                "href": "/profile/Charlotte-Henley-Babb"
            },
            "answer_text": "Freelance writing is like full-time job hunting. You are always looking for work, doing research for stories to query, keeping up with what's new and hot in your field, sending out queries, then doing the actual writing, proofing, beating the deadline, rinse and repeat.  When you are new at it, you work on spec, generally, unless you have some very good credentials (street, academic, experiential) that gives the editor a slant on the material. I'm a good writer but as a 64-year-old white woman from the South in the USA, my opinions on the hiphop scene are not likely to interest anyone (including me).  While you can find people to critique your writing, and the other answers here are good, you will have to start building relationships with editors and sending them story ideas. If you are accepted, then you deliver ahead of schedule.  You might look at Help A Reporter for story ideas, and learn to read a twitter feed. While they generally don't pay, you can do guest posts for blogs in your subject area to build your skills.  Thanks for A2A.  ",
            "date": "Answered January 2, 2016",
            "views": "13",
            "upvotes": " View 9 Upvoters",
            "upvoters": [
                {
                    "user_id": "Sudais Asif",
                    "user_href": "/profile/Sudais-Asif"
                },
                {
                    "user_id": "Sophie Gilmour",
                    "user_href": "/profile/Sophie-Gilmour-1"
                },
                {
                    "user_id": "Iyk Mezu",
                    "user_href": "/profile/Iyk-Mezu"
                },
                {
                    "user_id": "Lukas Garcia",
                    "user_href": "/profile/Lukas-Garcia"
                },
                {
                    "user_id": "Amelia McNamara",
                    "user_href": "/profile/Amelia-McNamara-2"
                },
                {
                    "user_id": "Soo J. Oh",
                    "user_href": "/profile/Soo-J-Oh"
                },
                {
                    "user_id": "Stephanie Vardavas",
                    "user_href": "/profile/Stephanie-Vardavas"
                },
                {
                    "user_id": "Aqil Khan",
                    "user_href": "/profile/Aqil-Khan-4"
                },
                {
                    "user_id": "Beth D. Casey",
                    "user_href": "/profile/Beth-D-Casey-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Anne Bolender",
                "href": "/profile/Anne-Bolender-1"
            },
            "answer_text": "The best way to find out if your writing is good enough for you to become a freelance writer is for you to become a freelance writer. Taking course will help you only so far in a writing career From taking writing courses you will learn the fundamentals of writing and get to know what writing teachers want from their students, but that's not necessarily what freelance writers are hired for. As has been mentioned already in a couple of the answers, there is so much more to freelance writing than just the writing. It's more of a complete package involving time management, meeting deadlines, research, subject knowledge, writing, and other things. Good luck!  ",
            "date": "Answered February 21, 2016",
            "views": "128",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Mary Ann Slavcheff",
                "href": "/profile/Mary-Ann-Slavcheff"
            },
            "answer_text": "\tTake a writing class. Free-lance writers often  teach writing classes to increase their income.  You can get valuable feedback from those classes. \tJoin a writer’s group, even one on-line.  Here writers read and comment on each other’s work. \tKnow that free-lance writing is a tough way to make a living. Few make more than five thousand dollars a year. Most have working spouses. Also know that free-lance writing is more than just putting words on paper. It is revision, subject research, market research, query letters, waiting for payment. \tI once published in a national magazine and didn’t get paid until two years later.  ",
            "date": "Answered December 30, 2015",
            "views": "288",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Soram Varun Singh",
                    "user_href": "/profile/Soram-Varun-Singh"
                },
                {
                    "user_id": "Ben A. Wise",
                    "user_href": "/profile/Ben-A-Wise"
                },
                {
                    "user_id": "Ashmita Ahuja",
                    "user_href": "/profile/Ashmita-Ahuja"
                },
                {
                    "user_id": "Dan Naumovich",
                    "user_href": "/profile/Dan-Naumovich"
                }
            ]
        },
        {
            "author_info": {
                "name": "Donn Lee",
                "href": "/profile/Donn-Lee-1"
            },
            "answer_text": "My advice is just go for it. Write, get feedback, and write some more. I've done quite a bit of freelance work (generally in IT - MS Excel and VBA programming), and when I first started I couldn't stop second-guessing myself (surely there are plenty of people out there who are greater Excel/VBA experts - why should these companies choose me?). But they did choose me, and I delivered most of the time. Those times I couldn't deliver what was expected I just took as a lesson to be learnt and moved on. The more work I did, the better I became. In terms of getting feedback, I find that programming and MS Excel skills, like writing, is quite hard to get feedback on. If a piece of writing fits the purpose and achieves its objective, it's good, if it doesn't, it isn't. For example, I believe I write pretty decent non-fiction, and writing advertising copy is something I'd consider dabbling in. But if I was tasked to write a novel I'd probably give it a miss. I do have in mind one neat little trick though that might give you some critique on your writing: editing or writing Wikipedia articles. If your articles are consistently being corrected due to grammatical, stylistic or any other issues, then you might have spotted aa area of weakness in your writing. If your articles generally remain as they are, with only factual corrections then you might be on to something. ",
            "date": "Answered December 30, 2015",
            "views": "313",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Muhamad Fakhrusy",
                    "user_href": "/profile/Muhamad-Fakhrusy"
                },
                {
                    "user_id": "Erwin Anciano",
                    "user_href": "/profile/Erwin-Anciano-1"
                },
                {
                    "user_id": "Krishna DV",
                    "user_href": "/profile/Krishna-DV-1"
                },
                {
                    "user_id": "Ekta",
                    "user_href": "/profile/Ekta-104"
                }
            ]
        },
        {
            "author_info": {
                "name": "Beth D. Casey",
                "href": "/profile/Beth-D-Casey-1"
            },
            "answer_text": "I agree with everyone here. Learn everything that you can about the craft of writing. Gain some practice and critiques. Use mistakes and critiques to further improve yourself. Join a writing community. But, eventually you are going to have to take a leap of faith and submit your writing to a publisher somewhere and find out for yourself. Don't be discouraged if your work gets rejected a few times. It happens to us all at some point in the journey. Use any suggestions as ways to improve. If you truly want to be a writer, then write and do everything you can to improve your work along the way. Never give up. There are some great blogs, podcasts, screencasts, YouTube videos, articles, and classes out there geared to help you. A couple of my personal favorites are Beyond Your Blog  and Write Better, Get Published, Be Creative | WritersDigest.com Write Better, Get Published, Be Creative | WritersDigest.com . There are many writing communities that you can join online and on social media websites like Facebook, LinkedIn, Twitter, and Google+. One of the first communities I joined a long time ago that is still around is Where the Writers Go to Write. You can also check out Writer's Digest 101 Best Websites for writers on their website. It's usually a download and they update it every year. Best wishes and good luck! ",
            "date": "Answered January 1, 2016",
            "views": "69",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "George Martinez",
                    "user_href": "/profile/George-Martinez-48"
                },
                {
                    "user_id": "Larry Dixon",
                    "user_href": "/profile/Larry-Dixon-1"
                },
                {
                    "user_id": "Ekta",
                    "user_href": "/profile/Ekta-104"
                },
                {
                    "user_id": "Aqil Khan",
                    "user_href": "/profile/Aqil-Khan-4"
                }
            ]
        },
        {
            "author_info": {
                "name": "Cassio L Moraes",
                "href": "/profile/Cassio-L-Moraes"
            },
            "answer_text": "A2A By becoming a freelance writer. No test will tell if you've got what it takes, only your results. You gotta dive head first. ",
            "date": "Answered January 5, 2016",
            "views": "122",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Amelia McNamara",
                    "user_href": "/profile/Amelia-McNamara-2"
                },
                {
                    "user_id": "Erwin Anciano",
                    "user_href": "/profile/Erwin-Anciano-1"
                },
                {
                    "user_id": "Anne Bolender",
                    "user_href": "/profile/Anne-Bolender-1"
                },
                {
                    "user_id": "Petra Fort",
                    "user_href": "/profile/Petra-Fort"
                }
            ]
        },
        {
            "author_info": {
                "name": "Jody Lebel",
                "href": "/profile/Jody-Lebel"
            },
            "answer_text": "Consider taking a few writing classes.  Not only will you learn the basics, but you will have to turn in some writing each week for feedback.  You can find these classes at your local community colleges.  There are also on-line classes but the feedback is limited.  If you can find a local writing group, join it.  That's another way to have others look at your work while you learn from everyone's mistakes. ",
            "date": "Answered December 30, 2015",
            "views": "229",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Mary Ann Slavcheff",
                    "user_href": "/profile/Mary-Ann-Slavcheff"
                },
                {
                    "user_id": "Amelia McNamara",
                    "user_href": "/profile/Amelia-McNamara-2"
                },
                {
                    "user_id": "Beth D. Casey",
                    "user_href": "/profile/Beth-D-Casey-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Shawn Ramirez",
                "href": "/profile/Shawn-Ramirez"
            },
            "answer_text": "You can check out textbroker.com They have writing samples of what they refer to as 2, 3, 4, and 5 star writers.   You can also use this website to find writing jobs. They also have an online forum, blog, and other tutorials to help out their writers. Good luck. ",
            "date": "Answered December 30, 2015",
            "views": "13",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Colin Rutherford",
                "href": "/profile/Colin-Rutherford-3"
            },
            "answer_text": "I would ask a few people to read it. Not friends or family. They will be biased. Join a few of the groups on Facebook or G+. Ask for beta readers. ",
            "date": "Answered January 5, 2016",
            "views": "107",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Jay Robert Baer",
                "href": "/profile/Jay-Robert-Baer"
            },
            "answer_text": "Yes. Public Speaking-Fight the Fear and Build Your Career  ",
            "date": "Answered December 30, 2015",
            "views": "74",
            "upvotes": "0"
        }
    ]
}