{
    "title": "How to write a college essay without seeming braggy - Quora",
    "tags": [
        "Essay Writing Help",
        "Essays",
        "Writing Advice"
    ],
    "response": [
        {
            "author_info": {
                "name": "Marianne Joyce",
                "href": "/profile/Marianne-Joyce-2"
            },
            "answer_text": "Take an inventory of your accomplishments and achievements, the things you might be tempted to brag about. Then think deeply about these things in your life and figure out what you have learned from each one that you will take into the future as you pursue your education. Think about how these achievements have motivated or inspired you to further your learning journey. Try to discern some pattern or theme winding through your achievements that hints at a future direction for your life. Look for the deeper meaning in your life so far and write about that. ",
            "date": "Answered October 15, 2019",
            "views": "44",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Joshua Reed",
                "href": "/profile/Joshua-Reed-123"
            },
            "answer_text": "Focus on what you learned and who helped you achieve those accomplishments. Bragging focuses on the product, focusing on the process and on what you learned from others shows your willingness to learn and adapt, take criticism, be flexible, all the while touting your accomplishments. As many have noted, this is your chance to show what you can bring to the Uni, so a sense of humility (by crediting others) and a demonstrated commitment to learning and self-reflection to help solve problems will go a long way to convincing the university that your worth acceptance. ",
            "date": "Answered October 17, 2019",
            "views": "38",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Lawrence Fagan",
                    "user_href": "/profile/Lawrence-Fagan-3"
                }
            ]
        }
    ]
}