{
    "title": "How to write a talk - Quora",
    "tags": [
        "Motivational Speaking",
        "Public Speakers",
        "Speech Writing",
        "Public Speaking Tips",
        "Presentations",
        "Public Speaking",
        "Speech",
        "Creative Writing",
        "Talking",
        "Writing Advice"
    ],
    "response": [
        {
            "author_info": {
                "name": "Arijit Goswami",
                "href": "/profile/Arijit-Goswami"
            },
            "answer_text": "This is one of the most important questions to be answered before one can start with public speaking. Even before you step on the stage and even before you can start to impress the audience, you need to know what to write and how to write. A well written content is always the major ingredient for a heart-winning speech. And here we will have a deep dive into how you can write a wonderful talk. Know your audience This is the very first step of writing a speech, even before you select a topic. You should select a theme or a topic which aligns to the interests of your audience. Try to include as many people as possible. For example, if your audience is comprised of school students, then it will be better to have a talk on ‘how to score better’ or ‘how to balance studies and play’. It is certainly not advisable to have a topic like ‘Engineering as a career option’ for not everyone may be interested in pursuing engineering. Therefore, select a topic which will be of interest to everyone or most of the people. Also, select a topic which does not offend your audience. O-B-C factor This is the first step towards structuring your speech. You should have a clear Opening-Body-Conclusion (OBC). Opening: The opening must be a captivating one. You can start with narrating an anecdote or state a shocking fact. Instead of saying “our climate is changing rapidly and our earth is getting destroyed inch by inch everyday.” try saying, “The ice sheets crack and float away everyday to the sea, as the innocent helpless polar bears watch in despair. And it's not just Antarctica! Can you imagine that an area of coastal ecosystems larger than New York City is destroyed every year because of climate change? Climate change is ruining the earth like you have never imagined before.\" Body: In the body, try having 3 to 4 main messages. State the message, provide an evidence and reiterate the message. “Preserving the nature can help the world save billions, which can go into other aspects of human welfare. Research says if Maldives had to build a sea wall for protecting its coast, it would cost about US$ 2.2 billion. Even after 10 years of maintenance costs, it is still four times cheaper to preserve the natural reef. And this is the saving that we can hope for around the world if we save nature.” Conclusion: Don’t add new points to the conclusion, rather just reiterate the main message. “I urge you all to open your eyes and not be in oblivion of the damage we are doing to the earth. It’s our only home and we need to save it. Join hands and take all steps to fight climate change.” Practice and Rewrite Once the first draft of your speech is written, rehearse speaking it before your friends or even alone. Record your rehearsals and identify the places where the speech sounds bland. Rewrite those pieces of speech and make it sound interesting with some humor or some rhetoric. Spice it up a bit to suit the occasion and get the final draft ready. Hope this steps help you to write a talk that you have always dreamed to deliver before a packed audience. All the best! You can also try the following answer to know how to speak eloquently. Arijit Goswami's answer to What are the best tips and hacks for speaking with eloquence and sophistication? ",
            "date": "Answered April 6, 2020",
            "views": "50",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Byron Connell",
                    "user_href": "/profile/Byron-Connell"
                }
            ]
        },
        {
            "author_info": {
                "name": "Terence Houghton",
                "href": "/profile/Terence-Houghton-2"
            },
            "answer_text": "Have a theme. This will be the thread that will go through the talk. Stick to the theme from the beginning to the end. Think what the conclusion is ie what do you want the talk to accomplish. Is it to educate or motivate? Then give thought what will support your information eg examples quotes illustrations etc. This will be the body of your talk. Any information has to be accurate and must relate to the theme, if not you will begin to deviate. When you have developed what you want to say, then you can think of an introduction that will get your listeners to think I need to listen to this because it involves me,or I am going to find this subject interesting. The introduction has to fit the subject well and it can also be referred to throughout the talk. An introduction can be an illustration, brief story or account, a question or experience. All the best. ",
            "date": "Answered September 15, 2017",
            "views": "139",
            "upvotes": "0"
        }
    ]
}