{
    "title": "How to write a white paper - Quora",
    "tags": [
        "White Papers",
        "Academic Writing",
        "Academic Research Papers",
        "Academic Papers",
        "Academic Research",
        "Research",
        "Writing Advice",
        "How-to Question"
    ],
    "response": [
        {
            "author_info": {
                "name": "Karthik Subramanian",
                "href": "/profile/Karthik-Subramanian-14"
            },
            "answer_text": "According to the B2B Content Marketing 2018 Benchmarks, Budgets, and Trends report, white papers emerged as one of the top 4 most effective types of marketing collateral that companies use with 71% companies preferring it. Here’s an easy guide on How to Write White Papers including free, downloadable templates for you to get started right away. At Paperflite, we compiled the best practices of the Top B2B White Papers created by various companies and shortlisted the ways a company can create a white paper. White papers are authoritative pieces that are compiled and published for a number of reasons, some of which are explained below. It primarily depends on your target audience on why you’re creating it. Implementation of a solution Companies are always looking for answers or best practices to implementing enterprise software such as CRM, ERP etc. If you are a company that sells such solutions or helps implement them, you may commission a white paper on it by either having an in-house expert author it or hire an external writer to do it for you. You could be impartial in your approach and really not talk about your solution, instead talk about the pitfalls to avoid while implementing it. Educating the audience You can educate the audience about stuff that they’re probably not aware of. For example, VansenBourne’s white paper on ‘How Banks can win New Small Business Customers’ produced in collaboration between Avoka explains customer acquisition and on-boarding journeys in financial services. It is compiled with responses to a survey administered to 300 small business owners in European countries laden with verbatim responses by respondents. Looking under the wraps of newer trends in the marketplace These sort of white papers explain the latest trends in the market. For example, Frost & Sullivan’s Digital Transformation in the Insurance Industry talks about how insurance companies can thrive in this changing industry landscape, and how technologies such as mobile, wearables, AR/VR are impacting the industry. Predicting the future These white papers make bold predictions. For example, Tony Seba’s white paper titled Rethinking Transportation 2020-2030 predicts the death of the automobile and the oil industry. These take a lot of expertise and experience to create and are rare path-breaking pieces. Take a look here at our blog on the best structures for white papers by B2B marketers across industries such as Financial Services, Insurance, Media & Communication, Retail, Technology, Transportation etc. ",
            "date": "Updated March 15, 2019",
            "views": "18",
            "upvotes": " View 12 Upvoters",
            "upvoters": [
                {
                    "user_id": "Akhil Gadi",
                    "user_href": "/profile/Akhil-Gadi"
                },
                {
                    "user_id": "Anjali Nagpal",
                    "user_href": "/profile/Anjali-Nagpal"
                },
                {
                    "user_id": "Sushma Kuruvada",
                    "user_href": "/profile/Sushma-Kuruvada-1"
                },
                {
                    "user_id": "Steve Hague",
                    "user_href": "/profile/Steve-Hague-3"
                },
                {
                    "user_id": "Shawnese Reneé",
                    "user_href": "/profile/Shawnese-Reneé"
                },
                {
                    "user_id": "V Mon",
                    "user_href": "/profile/V-Mon"
                },
                {
                    "user_id": "Anbarasan Murthy",
                    "user_href": "/profile/Anbarasan-Murthy"
                },
                {
                    "user_id": "Jeff Caudle",
                    "user_href": "/profile/Jeff-Caudle-7"
                },
                {
                    "user_id": "Chandrasekhar Brahmasa",
                    "user_href": "/profile/Chandrasekhar-Brahmasa"
                },
                {
                    "user_id": "Akash Unni",
                    "user_href": "/profile/Akash-Unni-13"
                }
            ]
        },
        {
            "author_info": {
                "name": "Robert Charles Lee",
                "href": "/profile/Robert-Charles-Lee"
            },
            "answer_text": "We first need to have a good idea what a \"white paper\" is -- and we'll presume you know this already. Wikipedia has a good overview: White paper. I can recommend these two websites, which are all about writing white papers and they seem reliable enough in their advice and steps: WhitePaperSource \" WritingMichael Stelzner’s Writing White Papers Thanks to Robert Larson Jr for the A2A. ",
            "date": "Answered December 31, 2014",
            "views": "13",
            "upvotes": " View 4 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Rakshit Gupta",
                    "user_href": "/profile/Rakshit-Gupta-10"
                },
                {
                    "user_id": "Tom Wills",
                    "user_href": "/profile/Tom-Wills-1"
                },
                {
                    "user_id": "Robert Larson Jr",
                    "user_href": "/profile/Robert-Larson-Jr"
                },
                {
                    "user_id": "Ashish Gupta",
                    "user_href": "/profile/Ashish-Gupta-32"
                }
            ]
        }
    ]
}