{
    "title": "How to write a letter of appeal for the termination of employment - Quora",
    "tags": [
        "Employment Law",
        "Writing Advice"
    ],
    "response": [
        {
            "author_info": {
                "name": "Dave Crisp",
                "href": "/profile/Dave-Crisp-2"
            },
            "answer_text": "Usually it is simple: Dear X, I believe I was fired for the wrong reasons and would appreciate you reviewing the matter and ideally rehiring me with uninterrupted service. The reason I think this was incorrect is because…. [whatever your reasons are]. Don’t expect a positive answer, though. Most firing is done only after some considerable thought by the employer and they won’t easily change their (usually collective) mind. You can try appealing to a higher manager or HR, but usually they’ve been involved before and approved the decision. That leaves the option of consulting an employment lawyer to see if anything can be done, but usually the only possibility is you get some severance pay, not the job back. ",
            "date": "Answered June 11, 2020",
            "views": "131",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Emm Butler",
                    "user_href": "/profile/Emm-Butler"
                },
                {
                    "user_id": "Roksana Parvin Yasmin",
                    "user_href": "/profile/Roksana-Parvin-Yasmin"
                }
            ]
        },
        {
            "author_info": {
                "name": "Emm Butler",
                "href": "/profile/Emm-Butler"
            },
            "answer_text": "Most likely you are going to have to file a claim for unemployment benefits since you have no job or wages. My sincere suggestion is please to do not put an appeal in writing. If you wish to discuss it in person, that might be a good choice. You put it in writing and I guarantee your employer will forward it to the unemployment office at the appropriate time. Understand that jobs and such are legal events and there is nothing more legal than putting something in writing and signing it. Not a good idea. You might wish to reconsider and maybe make an appointment to discuss the situation and offer your opinion etc. ",
            "date": "Answered October 26, 2020",
            "views": "22",
            "upvotes": "0"
        }
    ]
}