{
    "title": "How to make a song - Quora",
    "tags": [
        "Songwriting"
    ],
    "response": [
        {
            "author_info": {
                "name": "Anna McKay",
                "href": "/profile/Anna-McKay-3"
            },
            "answer_text": "Everyone has their own methods. But here are the basics for writing a good song: Find inspiration. Find something that makes you feel something. The best songs come from a lot of emotion. Find a song, a rap, spoken word, a speaker, a video, a book, a piece if art, or just anything that makes you feel angry or sad or overjoyed. Find something that makes you feel a lot of things.Find a topic. Use your inspiration to come up with a topic. Some ideas to ensure your song is unique:Something that isn’t thought about often. This could be something that’s taboo or an unpopular opinion. Just find a topic that can stir things up.A different take on widely known or popular idea. This way, you can relate to the masses, but it will also make them think.Move off the beaten path: write down some words you don’t hear in songs often. Think of words that might not “flow” easily, and then make them flow in your song.Write down everything. Write down everything that you can think of relating to your topic. Even if it looks or sounds stupid, still write it down. You can always take things out, but it’s hard to add onto a song if it’s nearly completed but not long enough.Pick out a simple tune. If you play guitar or piano, then try to find some notes or chords that sound good together. Write them down. There is nothing worse than finding a perfect-sounding tune to only lose it a few minutes later. If you don’t play an instrument, then figure out a tune with your voice and record yourself singing it. Record in small bits. I usually just do 5–8 second recordings of one line of the song, and then when I’ve figured it all out, I’ll put it together, and voila! A rough beginning of a song!Refine the words. Sing the words with the tune. Cut out what sounds sloppy and amateurish. Play around with it. Don’t be afraid to put verses together or make more than one bridge. Remember: there are no rules in music that cannot be broken.And that’s really all the basics of songwriting. You’ll have to form your own method, by seeing how you work best. Some personal tips I have: Don’t write about a cliche breakup or how beautiful a girl is. Even if it’s something that means a lot to you. If you want other people to listen to your music, stay away from cliche pop song topics, because we’ve all already heard it before. (Unless you have a unique take on those topics and an interesting tune) Juxtaposition is your friend. If you write about something depressing, (unless you want it to have a very blatant and harrowing effect) then make it in a happy tune. If your words are kind of shallow, put them to a complex and interesting tune. If both the tune and the lyrics are mundane, your song is going to be boring. Have a cheerful, easygoing sound and then write about something shocking or strange…something you don’t hear about often. The reason this contrast works so well is because it makes people stop and think about what’s going on. This contrast makes it more difficult for your music to be merely in the background. Stay away from repetitiveness. Even if you have beautiful music in the background, don’t make your super-short chorus repeat itself a thousand times. When I hear a repetitive song, it makes me cringe. Even if the part being repeated is clever and thought-provoking, it’ll lose it’s meaning the more it’s said. Oftentimes, the lyrics that hit me hardest in songs are the ones that are said so quickly or quietly that I didn’t even know they were there till I looked up the lyrics. People like discovering deep meanings, so don’t shove it in their face. Sorry for the long answer, but I hope this was helpful! Good luck! ",
            "date": "Answered February 28, 2017",
            "views": "17",
            "upvotes": " View 20 Upvoters ",
            "upvoters": [
                {
                    "user_id": "DEEDEE",
                    "user_href": "/profile/DEEDEE-140"
                },
                {
                    "user_id": "K.C. Cheng",
                    "user_href": "/profile/K-C-Cheng-1"
                },
                {
                    "user_id": "Moshe Katz",
                    "user_href": "/profile/Moshe-Katz-5"
                },
                {
                    "user_id": "Nyna Lopez",
                    "user_href": "/profile/Nyna-Lopez"
                },
                {
                    "user_id": "Gianna Dahlhausen",
                    "user_href": "/profile/Gianna-Dahlhausen"
                },
                {
                    "user_id": "Rebecca Anderson",
                    "user_href": "/profile/Rebecca-Anderson-492"
                },
                {
                    "user_id": "Divyansh Maduriya",
                    "user_href": "/profile/Divyansh-Maduriya-1"
                },
                {
                    "user_id": "Lekhana V Kammar",
                    "user_href": "/profile/Lekhana-V-Kammar"
                },
                {
                    "user_id": "Urvish B Patel",
                    "user_href": "/profile/Urvish-B-Patel"
                },
                {
                    "user_id": "Gary Thomas II",
                    "user_href": "/profile/Gary-Thomas-II-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Ed Trotter",
                "href": "/profile/Ed-Trotter"
            },
            "answer_text": "Because you're asking \"How do I make a song?\" as opposed to \"How do I write a song?\", I'll assume that you already have a song written, and that you're wishing to turn this into a recording. First of all, you'll need the tools for the job. There are a huge number of options available to someone who wishes to record and produce music but, for the sake of accessibility, any reasonably up-to-date computer will serve perfectly well for the task at hand. Get your hands on some music production software; Macs come with GarageBand already installed, and there are a plethora of great free recording options available for PC. If you're looking to spend a little bit of cash, you can't go far wrong with Ableton Live, which is a really intuitive but powerful bit of music production software. Finally, a decent quality microphone is necessary if you want to record vocals and other sounds that can't be plugged straight into your PC. So, now you're ready to get recording. The actual process of recording vocals and instruments is broad enough to warrant a whole other guide in itself, but there are a few best practices to stick to: First of all, keep an eye on the sound levels that are going into your computer. Most recording software allows you to adjust 'input gain', which controls how loud the signal is going into the software. Too loud, and you'll end up with an effect known as 'clipping', which gives the sound an ugly, muffled quality. This is usually signified by your volume meters going into the red, and displaying a warning light so it's usually easy to see if your sound is clipping, even I'd you can't hear it. Secondly, recording at home will usually result in harsh-sounding 'reverb', when bounces off the hard walls around you. Professional studios invest thousands of pounds into room treatments which cancel out this effect, however, you can achieve quite good results by simply hanging an old duvet up around you while you record! This home-made \"vocal booth\" will deaden the reverberations and lead to a cleaner, \"dryer\" recording. As a third and final recording tip, make sure you get plenty of takes of your recordings. Even if you get the perfect take first time (I've yet to see this happen!), it pays to get a few extra takes while you're in the position to do so. There's nothing more annoying than going back to re-record parts you've already done because of some small, previously-unnoticed problem with your earlier recordings. So, you've recorded everything and you're happy with how this all sounds. Now we need to mix the track. At this point, it is worth taking the time to go and listen to some songs that are similar in style/genre to what you're trying to achieve. Listen closely and analytically; try to figure out \"where\" all the instruments are in the mix. For example, you'll probably find that the vocals will be the focal point of the track, and so they will the one of the louder elements of the song, and will be positioned centrally in a stereo mix. Try to work out which instruments need to be very prominent, and which take more of a background role. Every genre is different in this regard, and so having a clear idea of how your genre needs to be mixed will help inform you later on. The mixing process itself needn't be over-complicated. There are lots of ways to mix tracks, but a very simple way to do it is the \"ground-up\" method. Start by turning the volume all the way down on all of your instruments in your music producing software. Then, find the main focal point of the song and bring the volume up to about 75% of that the volume slider will allow. For most pop and dance tracks, this should be the kick drum. For songs without a kick drum, try bringing up the volume the main vocal. Having done this, you should then begin slowly bring up the volume on the other instruments one-by-one. Judge the best volume for each instrument relative to the other instruments that you can already hear. Gradually, you'll find that each instrument will have found its \"place\" within the mix. You can tidy up the sound a little bit more using EQ and compression, which should be built into any good audio editor. As with the home recording stuff mentioned earlier, using these effects could fill an entire tutorial in itself, so I won't go into a huge amount of detail on these. Now the track is pretty much complete, the only thing left to do is the mastering. Before you start this, take a quick break to let your ears rest. Listening closely to music for protracted periods of time leads to 'ear fatigue', and makes you less able to hear in detail. Mastering is the process of taking a mixed track and adding a little bit more polish and volume to it, so it's suitable for playing in clubs, on the radio, etc. In an ideal world, the mastering process should be handled by a professional mastering engineer; however, not all of us are able to fork out the money to get it done this way every time! So, first of all, export the track that you've mixed. If you have the option to do so, export the track in a high-quality file format, such as .wav or .aiff. Formats such as .mp3 or .aac are not suitable. Next, start a new project in your production software and drop in the track that you've just exported. Now, there is arguably no single, definite process for mastering a track. When mastering a track, you have to accommodate the needs of the track you're working with. That said, there are a few general tools you can use to enhance the sound of the track. First of all, use some EQ to bring out some frequencies that aren't quite prominent enough, or to cut some frequencies that are too prominent. Try not to boost or cut any frequencies by more than +/-2dB. If you have to make any boosts or cuts larger than this, consider going back to your original mix and changing it up a bit there. Secondly, add a little bit of compression. The goal of this is to boost the volume of the quieter parts of the track, so that the general sound of the track is a little bit louder. There are no hard and fast rules for how to use compression on your track, but try setting the 'ratio' to between 1.2:1 and 2:1, and no higher than that. Then push the 'threshold' up until you're applying a gentle amount of compression. Depending on the track, you'll want around 1 - 2dB of compression, or up to about 4 - 6dB. This should be enough to boost the volume of the track without 'brickwalling' it. Beyond this, try looking for some mastering tutorials specific to the genre that you make. So, that's about it. Export the track and you're done! ",
            "date": "Answered December 8, 2011",
            "views": "827",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Lekhana V Kammar",
                    "user_href": "/profile/Lekhana-V-Kammar"
                },
                {
                    "user_id": "Kris Haamer",
                    "user_href": "/profile/Kris-Haamer"
                }
            ]
        }
    ]
}