{
    "title": "How to write thank you in a short form - Quora",
    "tags": [
        "Gratitude",
        "Manners and Etiquette",
        "Writing Advice"
    ],
    "response": [
        {
            "author_info": {
                "name": "Amy Goldfarb",
                "href": "/profile/Amy-Goldfarb-1"
            },
            "answer_text": "How do you write thank you in a short form? I have created a short form/template for writing a thank-you letter.. and even a more traditional contingency plan for a thank you (short form) at the bottom . I advise making many changes beyond personalization to the longer letter, given that it has been modified to hold your interest- that would be necessary to make this form letter appropriate for your specific use:  Dear —, Thanks so much for the baseball bat and the advice. You are very considerate, and I value your contributions to my night tremendously. I really connected to what you said. I was surprised to hear that you have also been bullied by obsessively persistent ceramic sculpture artists before. I thought this was a unique issue. I am extremely lucky to have a neighbor like you. What a bizarre building we live in! I will also change my locks as you advised. As we discussed, it has been truly exhausting to keep coming home to see more and more clay sculptures accumulating exponentially day after day in my personal space unsolicited. I’ve stopped reading the creepy notes. It was a relief to share this. You’re clearly the kind of person who goes above and beyond. Thanks for stopping by and for your quick assessment. I did as you suggested and waited until my neighbors left this morning, and I just spent the last two hours using your baseball bat to take care of my problem. Smashing clay sculpture is very cathartic I will hand off the bag to you tonight. Your offer to drop the ceramic shards off at the clay studio is above and beyond. You are the best. It’s so nice to have made a new friend. I feel surprisingly connected by all of this shared drama. To express my deep gratitude I have left this note and also a handmade paper collage I made just for you, conveniently in your apartment - the key was under the matt. Actually I left two - surprise! And I am working on another. Maybe I can help you decorate those walls! It’s the least I can do and you are welcome in advance :) Very best, Your Neighbor (the paper artist, not any of the ceramicists)  If that is too long ? You could always consider something more traditional or formal or basic like: (Your formal contact info) Dear ——, Thank you so much for —— (if for work be very specific about impacts and your formal thanks. If to a personal contact, be personal). Your —-<<rephrase of why you are appreciative perhaps by including another reason, specific point included>, —was sincerely appreciated (by you? By us all? By___?). Best wishes to you <and anyone else you mean to thank if relevant>. <<Any important leftover details, included in a way that is not too long and is integrated. If it is for work, make sure to mention how this act impacts your company or org. and what they do, and why that matters>>. Very best, Letter writer (you? You and a group? You on behalf of someone or a group?) Signature Your title, work info and perhaps digital info (in an email you may include digital contact info here linked and remove the top info space which would be for a printed page. A signature would also be opt in by email, but should be present in pen if possible for a mailing. If you are hand signing a typed letter you may as well use a blue or colored pen so it’s clear you cared enough to take the time ) But - where’s the flair?! You better know if you want or need flair… a collage takes a while. ",
            "date": "Answered August 27, 2020",
            "views": "254",
            "upvotes": " View 11 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Jonathan Chiu",
                    "user_href": "/profile/Jonathan-Chiu-27"
                },
                {
                    "user_id": "Lynn Mungo",
                    "user_href": "/profile/Lynn-Mungo"
                },
                {
                    "user_id": "Mary Nelson",
                    "user_href": "/profile/Mary-Nelson-4"
                },
                {
                    "user_id": "Oliver Ashmore",
                    "user_href": "/profile/Oliver-Ashmore-2"
                },
                {
                    "user_id": "Donovan Minckler",
                    "user_href": "/profile/Donovan-Minckler"
                },
                {
                    "user_id": "Prafful Allamraju (प्रफुल అల్లంరాజు)",
                    "user_href": "/profile/Prafful-Allamraju-प्रफुल-అల్లంరాజు"
                },
                {
                    "user_id": "Andrew Vanessa",
                    "user_href": "/profile/Andrew-Vanessa-2"
                },
                {
                    "user_id": "Eleanor Lang",
                    "user_href": "/profile/Eleanor-Lang"
                },
                {
                    "user_id": "Kai Kinzer",
                    "user_href": "/profile/Kai-Kinzer"
                },
                {
                    "user_id": "Joshua Grant",
                    "user_href": "/profile/Joshua-Grant-125"
                }
            ]
        }
    ]
}