{
    "title": "How I can write a letter to the principal to give me permission to attend extra classes after the school? - Quora",
    "tags": [
        "Formal Letter Writing"
    ],
    "response": [
        {
            "author_info": {
                "name": "Richard P. Morrall",
                "href": "/profile/Richard-P-Morrall"
            },
            "answer_text": "Are these offered at your own school site? In my school, anyone wanting to join such a class just showed up and took a seat. The teacher took his name, and that was it. Are you sure you have to write a letter? Isn't there a sign-up form somewhere? Are these classes at another school? If so, you would need that school's permission to attend. If you need a letter, I suggest something following this example. Format learned in grade school. Your name Your address or an identification such as: Student, form four homeroom sixteen Principal's name Name of the school Dear Sir: or Dear Principal Last Name I would like your permission to enroll in our/ your school's after school program in name of class. I have already spoken to Mr. Last Name who teaches the class, and I have his permission to ask you if I might enroll. I am very interested in the subject, and I am excited to be part of the class. I very much want your permission to enroll in Mr. Last name's class. Thank you for your consideration. Truly yours, First and Last name. ",
            "date": "Updated March 6, 2018",
            "views": "389",
            "upvotes": " View 9 Upvoters",
            "upvoters": [
                {
                    "user_id": "Kim Jisoo Stan",
                    "user_href": "/profile/Kim-Jisoo-Stan-1"
                },
                {
                    "user_id": "Aisha Barker",
                    "user_href": "/profile/Aisha-Barker-1"
                },
                {
                    "user_id": "Ankita Shukla",
                    "user_href": "/profile/Ankita-Shukla-178"
                },
                {
                    "user_id": "Rohit Anigol",
                    "user_href": "/profile/Rohit-Anigol"
                },
                {
                    "user_id": "Rebecca Chai",
                    "user_href": "/profile/Rebecca-Chai-3"
                },
                {
                    "user_id": "SallyMaria Renata",
                    "user_href": "/profile/SallyMaria-Renata"
                },
                {
                    "user_id": "Christian Elthorp",
                    "user_href": "/profile/Christian-Elthorp-1"
                },
                {
                    "user_id": "Sıla Okur",
                    "user_href": "/profile/Sıla-Okur"
                },
                {
                    "user_id": "Greg Burns",
                    "user_href": "/profile/Greg-Burns-5"
                }
            ]
        },
        {
            "author_info": {
                "name": "Stephen King",
                "href": "/profile/Stephen-King-110"
            },
            "answer_text": "For lack of any details, I’d say the first step you should take is to approach your principal’s administrative assistant. Wait till he or she acknowledges her/his readiness to address your question, then ask what the principal’s policy is on students attending extra classes after the school. Odds are that person will ask for specifics, and then give you the information you need. There may already be a form for that, but you should have a pencil and paper and be prepared to take notes on the instructions that person gives you. Thank them once you’re done, and you’ll have just impressed that person with your professionalism. ",
            "date": "Answered August 7, 2019",
            "views": "31",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Anita Munday",
                "href": "/profile/Anita-Munday"
            },
            "answer_text": "Why write a letter? I think the best way to go about it is to do it face to face. Just go to the principal and let him or her know that you would like to attend extra classes after school. Letters are great, but why write when you can speak with the principal and look him or her in the eyes and explain why and what you need? I think that doing it this way would be more productive. A letter can be overlooked or thrown away. Face to face leaves an impression. ",
            "date": "Answered July 7, 2018",
            "views": "55",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "SallyMaria Renata",
                "href": "/profile/SallyMaria-Renata"
            },
            "answer_text": "I agree with your other answer, but if you feel you want to attend those classes just for your own knowledge, it is called MONITOR. If you want to go to get a grade, have homework, etc., you want ADMISSION If you want admission, it probably will have to go through the principal. A simple letter to the principle giving the class, time and teacher and why you want to attend. Thank them for their time and and if they could let you know soon. Sign your name, give an email address and phone. ",
            "date": "Answered July 6, 2018",
            "views": "85",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Surya Muthu",
                    "user_href": "/profile/Surya-Muthu-6"
                },
                {
                    "user_id": "Yashas Blue",
                    "user_href": "/profile/Yashas-Blue"
                }
            ]
        },
        {
            "author_info": {
                "name": "Nancy Bradford-Wilken",
                "href": "/profile/Nancy-Bradford-Wilken"
            },
            "answer_text": "I did that 4 years in row with my counselor while at Hunter College HS NYC — if U don't have a counselor just write tell the truth why U would like the selected courses e.g wish Advanced placement at a desired college where U possibly select a major sophomore year Be excited to learn more! ",
            "date": "Answered June 8, 2018",
            "views": "142",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Christine Kaldahl",
                "href": "/profile/Christine-Kaldahl"
            },
            "answer_text": "I am not sure why your principal would have a say in you taking extra classes. I need more information to help you write a good persuasive argument. ",
            "date": "Answered June 1, 2018",
            "views": "57",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Chevuri Sunil Kumar",
                    "user_href": "/profile/Chevuri-Sunil-Kumar"
                }
            ]
        }
    ]
}