{
    "title": "How is your visualization? - Quora",
    "tags": [
        "Self-Awareness Advice",
        "Visualization",
        "Advice for Daily Life",
        "Self-Awareness",
        "Self-Improvement Advice",
        "Important Life Lessons",
        "Self-Improvement",
        "Life and Living",
        "Life Advice"
    ],
    "response": [
        {
            "author_info": {
                "name": "Margaret Weiss",
                "href": "/profile/Margo-Weiss-1"
            },
            "answer_text": "Very involved question - but a great one! Same as Gerry Mann, I have taught myself to first see where I need to be and then chart a path there. Depending on the goal, visualization is different but it needs to be brought to mind to spark the action.For example, if it's that elusive bikini-ready summer body, then I would have to find a picture of a model to motivate me to get to gym (and at the same time, a picture of the obese person to keep in mind in case I am not feeling like going to the gym): pulling myself with the ideal and pushing myself with the result of 'status quo'. In case of the professional goal, such as project delivery, it would be the documentation of how the final product will function, and then returning back to the current moment and asking, \"How do we get there?\" I believe that all actions have a reason, and if there is no reason (no positive result), then there's no need for any action. Just going through the motions to produce no-value-adding tasks is a waste of time and resources.At the same time, I believe that it takes very little to get us to where we want to be - we just need to concentrate some of the resources on a point that actually makes a difference. Without the visualization - either in my mind or through visual aids - I don't think I would accomplish much because I got where I am now, and I could be fine with that. Comparison of where I am now to where I could have been should I decide to put a little effort, is the actual driver. I was lucky enough to find an app (Everest) which allows to record goals (immediate, future, \"someday\", repetitive) - and then cut them into manageable tasks, which will add up to the accomplished goal, regardless of how lofty or impossible it may seem now.I like the thought of doing the impossible :) Thanks, Paul for a2a. ",
            "date": "Answered July 11, 2013",
            "views": "574",
            "upvotes": " View 2 Upvoters ",
            "upvoters": [
                {
                    "user_id": "James Senesac",
                    "user_href": "/profile/James-Senesac-2"
                },
                {
                    "user_id": "Victor Mathieux",
                    "user_href": "/profile/Victor-Mathieux"
                }
            ]
        },
        {
            "author_info": {
                "name": "Gerry Mann",
                "href": "/profile/Gerry-Mann"
            },
            "answer_text": "In Stephen Covey's \"The Seven Habits of Highly Effective People\", Habit Two is \"Begin With The End In Mind.\"  Covey asserts that all things are created twice, a first, mental creation and a second, physical creation.  We draw blueprints before we build a house. At work, as a manager, beginning with the end in mind is a critical part in building a high performing team. I know the mission of my team, and take the time to paint a series of mental pictures of what a day in the life of the team is in an ideal future condition.  I visualize how people are interacting during meetings, how they handle and resolve conflict in a professional manner, you they practice customer service with the best result of the end customer in mind. With those visualizations firmly in mind, I can observe the real-life work environment and understand where the gaps are -- who needs training and practice in conflict resolution, who needs knowledge around customer service goals, objectives and processes and so on.  With these two elements formed, I can proceed to the second creation - providing training, scheduling coaching sessions, demonstrating the techniques and methods and so on that will help me achieve the vision of that first creation. I am mostly a visual person, so seeing things aren't the problem. Adding the sounds and feelings is a little more work for me, and I find it is worth the effort. My end product turns out much better and it's easier to communicate that compelling vision to the team, inspiring them to action. ",
            "date": "Answered July 11, 2013",
            "views": "533",
            "upvotes": " View 4 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Rekha Karotiya",
                    "user_href": "/profile/Rekha-Karotiya"
                },
                {
                    "user_id": "Ave Gotten",
                    "user_href": "/profile/Ave-Gotten"
                },
                {
                    "user_id": "James Senesac",
                    "user_href": "/profile/James-Senesac-2"
                },
                {
                    "user_id": "Margaret Weiss",
                    "user_href": "/profile/Margo-Weiss-1"
                }
            ]
        }
    ]
}