{
    "title": "How to write an APA research paper - Quora",
    "tags": [
        "Critical Reading",
        "APA Style",
        "Reading Comprehension",
        "Academic Research Papers",
        "Essay Writing Help",
        "Academic Papers",
        "Academic Research",
        "Grammar"
    ],
    "response": [
        {
            "author_info": {
                "name": "Steve Roberts",
                "href": "/profile/Steve-Roberts-83"
            },
            "answer_text": "Well, the steps you follow are the same for any research for a particular discipline. Check this out: How to Write a Psychology Research Paper Set up the margins and type size right at the beginning, so you get an accurate idea of word count and page count as you write. It will also mean that you won’t forget to do that five minutes before it’s due. Personally, as I write and am in the content-generation (not content-editing) stage, sometimes I write in point form, sometimes I just blather on. Then I edit. Then I might add points and blather some more. You need to do whatever works for you to get stuff on paper before you edit. I recommend that as you find articles that support your points, you copy the citations (you know: author, title, etc. in APA format) into a rough reference list — don’t leave that job until the end. This way, you will not have to (or forget to) add them at the last minute. (If you search for papers using your school’s online library, each paper’s entry should include a citation that you can copy and paste into your paper.) For anything that is a quote or a paraphrase, type them in red to remind yourself to cite them properly. Everything else, type in blue or green as you write and edit. Only convert everything to black type when you are ready to submit the paper. Black = final. For APA style guidelines, go here: APA Formatting and Style Guide. There should be an example there. Barring that, you can Google “APA sample paper.” ",
            "date": "Answered March 26, 2017",
            "views": "380",
            "upvotes": " View 4 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Barbara Dautrich",
                    "user_href": "/profile/Barbara-Dautrich"
                },
                {
                    "user_id": "Mari Bonomi",
                    "user_href": "/profile/Mari-Bonomi"
                },
                {
                    "user_id": "Emily Reed",
                    "user_href": "/profile/Emily-Reed-21"
                },
                {
                    "user_id": "Johnny Hernandez",
                    "user_href": "/profile/Johnny-Hernandez-43"
                }
            ]
        },
        {
            "author_info": {
                "name": "Mary Ann Hoover",
                "href": "/profile/Mary-Ann-Hoover"
            },
            "answer_text": "As usual, the text is typed on standard white paper that has familiar parameters of 8.5\" x 11\".The APA style requires using an easy to read font and recommends using a 12pt Times New Roman font.Double spacing is required on both the title page and throughout the paper.Margins should be 1\" concerning all sides of the page.Paragraph indentation should be set to one-half inch from the left side of the page.The unique aspect is in creating a special page header that consists of the page number and the running head as typed on the title page in all capitals.It is seen that the style keeps up with world`s leading formatting standards not dwelling on having a lot of useless rules. The running head introduction visually brings both writer and reader back to the main idea of the research. In all other respects, the APA style is similar to the other guides. Format of an APA research paper The framework of how to write research papers is the most distinguishable part of each formatting standard. Hardly ever are there are common aspects of the structure of the paper. This style provides the following paper composition. Title page Every research paper, if it is not MLA, starts with a title page. The APA pays lots of attention to the design of the front page. The rules are simple but strict. The title of the paper is placed in the very center of the title page. It is centered regarding the side margins and lies in the middle of the vertical axis.The title may contain as many words and characters as the writer needs but the APA format recommends less than 12 words and to avoid using fruitless information and abbreviations.Keeping in mind that double-spacing is required, the name of the author is written beneath the title. The name of the author should not include any formalities such as Ph.D. or Mr. and only include the first and last name.The same procedure is undergone for the name of the institution which you represent writing this paper.The running head contains a capitalized short name of the title, the header of the title page includes the words ‘Running head’ followed by a colon and the shortened title is written the same way as before.These rules, are not as demanding as they could be, but still demand enough attention to the formatting of the title page. The APA must be thinking that having a cover attracts more consideration to the research. Abstract The abstract is another peculiarity of the style as other standards don`t usually recommend using abstract. The purpose of the abstract serves as an introduction to the ideas of the author, a brief summary of any questions the author investigated and by which means the author came to the answers. It contains all typical information such as defining any in-explicit abbreviations and/or special words and terms. As for the technical requirements, the abstract page starts with the word \"Abstract\" centered to the page and typed in a 12pt Times New Roman font. It is followed by non-indented text that doesn`t exceed 250 words summarizing the main points of the text and any keywords are typed in italics. The abstract page helps your paper be found in searches and gives the reader a brief overview of what is contained within the paper. Body The APA style adheres to the long-established rules of using essay-form while writing research work. The text in the body can contain as much paragraph or sections as the writer needs, but only on the condition of supporting the idea by answering the questions related to the topic. The beginning of the body once again starts with the name of the survey, which must not be bold, underlined, or italicized. To clearly identify each section, the APA standard advises centering the heading of each paragraph in a bold font. Text citation and references The APA format doesn`t differentiate from others regarding the theme of citation policies. The organizations manual reminds of the importance of academic honesty and invokes writers to cite other works properly. The style uses an in-text citation as well. Such a citation is placed in parenthesis where the author`s name and year of publication of the cited part are specified. This information has to be the same as in the reference list. Formatting of the reference list, or bibliography, is represented in the following manner. References indented one-half inch from the left margin.First, the reference list should be listed alphabetically by authors last name identify up to seven authors by first stating their last name and the initial of their first name.The year of the publication should immediately follow the author's names in parenthesis.Then the name of the reference is cited.Following the name of the reference the volume or page numbers of the referenced material is put in parenthesis.The final step is to indicate where the source was referenced i.e. a web-page where the material was obtained.",
            "date": "Answered June 24, 2019",
            "views": "240",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Sarah Madden",
                    "user_href": "/profile/Sarah-Madden-11"
                }
            ]
        }
    ]
}