{
    "title": "How does Google make money off of Google Docs? - Quora",
    "tags": [
        "Google Products and Services",
        "Google Docs"
    ],
    "response": [
        {
            "author_info": {
                "name": "Wesley Chun",
                "href": "/profile/Wesley-Chun"
            },
            "answer_text": "There is a monthly service charge for G Suite (formerly Google Apps for Work) which includes Gmail, Drive, Calendar, Docs, Sheets, Slides, and other corporate apps unavailable to free/consumer Gmail users. Go to the pricing page to see what those fees are. If you subtract out how much it costs Google to run the service, provide the compute power & data storage, as well as pay the engineers who build & maintain all these apps, you'll arrive at your answer. These are not ad-supported products, so you won’t see any when using them. NOTE 1: there is a 14-day free trial, so you'd have to use it beyond 2 weeks to incur a charge, thus for Google to make money after subtracting out the costs described above. NOTE 2: the consumer version of Google Apps/G Suite does not have a monthly charge. (The same is true for the education version, G Suite for Education.) The goal is to get more people online and using the Internet, and at some point, users may click on a Google advertisement, which indirectly leads to some revenue for the company. If you're wondering about the free consumer version vs. the for-pay version, that and other questions are answered on the FAQ page. NOTE 3: Google Drive itself supplies storage for your documents (Docs, Sheets, Slides, Gmail, etc., and photos). The consumer version (currently) provides for 15GB of free storage (more for the paid versions described above), and if you exceed the free storage and pay for more, then subtract out Google's cost for storage & supplying this particular service, then you'll also have another part of the answer. See your storage settings for more info. ",
            "date": "Updated May 21, 2018",
            "views": "91",
            "upvotes": " View 13 Upvoters",
            "upvoters": [
                {
                    "user_id": "Jeremy Miles",
                    "user_href": "/profile/Jeremy-Miles"
                },
                {
                    "user_id": "Shubahm Garg",
                    "user_href": "/profile/Shubahm-Garg-1"
                },
                {
                    "user_id": "Lance Miranda",
                    "user_href": "/profile/Lance-Miranda-4"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/S-K-3883"
                },
                {
                    "user_id": "Ken Mcdevins",
                    "user_href": "/profile/Ken-Mcdevins"
                },
                {
                    "user_id": "Zachary Thomas",
                    "user_href": "/profile/Zachary-Thomas-2"
                },
                {
                    "user_id": "Jenn Ng",
                    "user_href": "/profile/Jenn-Ng-1"
                },
                {
                    "user_id": "Amit Jadhav",
                    "user_href": "/profile/अमित-जाधव-Amit-Jadhav"
                },
                {
                    "user_id": "Gregory Kramida",
                    "user_href": "/profile/Gregory-Kramida"
                },
                {
                    "user_id": "Raghunandan Jahagirdar",
                    "user_href": "/profile/Raghunandan-Jahagirdar"
                }
            ]
        },
        {
            "author_info": {
                "name": "Michael Vogel",
                "href": "/profile/Michael-Vogel-5"
            },
            "answer_text": "The same way they make money off of everything else: ads. Google services work as a whole. Some of them don't have ads placed directly in their products but if you use one of their products you're likely to use more and so you will encounter ads. ",
            "date": "Updated December 16, 2018",
            "views": "67",
            "upvotes": " View 7 Upvoters",
            "upvoters": [
                {
                    "user_id": "Jack Kellerk",
                    "user_href": "/profile/Jack-Kellerk-1"
                },
                {
                    "user_id": "Subash VT",
                    "user_href": "/profile/Subash-VT"
                },
                {
                    "user_id": "Tatiyapot Srikarnchanakas",
                    "user_href": "/profile/Tatiyapot-Srikarnchanakas"
                },
                {
                    "user_id": "Elliott Beach",
                    "user_href": "/profile/Elliott-Beach"
                },
                {
                    "user_id": "Joel Taylor",
                    "user_href": "/profile/Joel-Taylor-19"
                },
                {
                    "user_id": "Matthew Brach",
                    "user_href": "/profile/Matthew-Brach-1"
                },
                {
                    "user_id": "Nathan Amery",
                    "user_href": "/profile/Nathan-Amery"
                }
            ]
        }
    ]
}