{
    "title": "How to learn to read and write another language - Quora",
    "tags": [
        "Learning Languages",
        "Learning New Things",
        "Learning",
        "Reading",
        "Language"
    ],
    "response": [
        {
            "author_info": {
                "name": "Oscar Tay",
                "href": "/profile/Oscar-Tay-1"
            },
            "answer_text": "I understand how I would go about memorising new words, but how do I learn the grammar/structure? As with learning anything, there’s no single method that works for everybody. I suggest trying several methods and finding one that fits you. Take a look here for some general tips first. I want to learn Mongolian and there are very few resources around. I don’t even know where to begin! Do I practice writing sentences? Translate documents? Do flash cards? Mongolian is a weird language by European standards. It’s agglutinative, meaning its word-building is like German on steroids, and it has seven or eight cases (when a noun changes depending on its role in the sentence), as opposed to English’s two or Russian’s six. The language is unrelated to English (or any other major world language), so unless you speak one of those few languages related to it, you may have a hard time picking up vocabulary outside of loanwords. It’s also got some funny sounds, but those are fairly easy to learn. A problem with learning a less-than-common language that you may have run into is that there are often few resources. However, there are still some: Colloquial Mongolian: A basic course in Mongolian. The linked book is from the Internet Archive, which is the largest online library in the world.Mongolian on Memrise: Memrise is a flashcard/spaced repetition/mnemonics website. Most of the courses are user-made, but they’re often quite well-done.Easy Languages: If it’s phrases and conversations you’re after, this is a YouTube channel for learning the basics of the colloquial forms of several languages. See Mongolian phrases here and interviews with random people in Mongolia here.Forvo: Online pronunciation dictionary.iTalki: Online tutoring website for lots of languages. It also has a place where you can submit written pieces in the language you’re learning and get feedback on them from native speakers.If you have any more questions or resources you’d like to know about, feel free to ask. Good luck! ",
            "date": "Answered July 28, 2017",
            "views": "765",
            "upvotes": " View 3 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Bilguun Byambajav",
                    "user_href": "/profile/Bilguun-Byambajav-1"
                },
                {
                    "user_id": "Floyd Dargatz",
                    "user_href": "/profile/Floyd-Dargatz"
                },
                {
                    "user_id": "Georg Thomas",
                    "user_href": "/profile/Georg-Thomas-2"
                }
            ]
        }
    ]
}