{
    "title": "How do blueprints work? - Quora",
    "tags": [
        "Blueprints",
        "Architecture"
    ],
    "response": [
        {
            "author_info": {
                "name": "Tammy Chambless",
                "href": "/profile/Tammy-Chambless"
            },
            "answer_text": "Many people call the drawings that architects produce \"blueprints\", but these days hardly anyone uses the blueprint technology.  We mostly take our digital images and print them out on plotters that are similar to large laser jet printers, that print black lines on white paper much like your desktop printer.  However, we only do that if we want a full size drawing, such as a 30\"x42\" print.  Many times though, I just print my drawings to a laser jet printer on 11\"x17\".  To me, as an architect, when I hear someone ask to see my blueprints, it sounds similar to asking someone to ride in their Model T when they mean their car.  It sounds antiquated.   From Wikipedia:   A blueprint is a reproduction of a technical drawing, documenting an architecture or an engineering design, using a contact print process on light-sensitive sheets. Introduced in the 19th century, the process allowed rapid and accurate reproduction of documents used in construction and industry. The blue-print process was characterized by light colored lines on a blue background, a negative of the original. The process was unable to reproduce color or shades of grey.Various base materials have been used for blueprints. Paper was a common choice; for more durable prints linen was sometimes used, but with time, the linen prints would shrink slightly. To combat this problem, printing on imitation vellum and, later, polyester film (Mylar) was implemented.The process has been largely displaced by the diazo whiteprint process and by large-format xerographic photocopiers, so reproduced drawings are usually called \"prints\" or just \"drawings\".The term blueprint is also used less formally to refer to any plan.[1] In addition to blueprints, there were many other technologies used to make copies of drawings.  In architecture, there was a great need to make drawings reproducible.   In older technology, drawings were done on linen, with a coating of plastic to be able to draw on them with pen and ink.  These drawings were then used to make the blueprints and diazo prints shown below.  Later we would draw on vellum or mylar, which could be run through a diazo printer, which replaced the older blueprint technology.  These original drawings were then copied using a diazo machine onto a sepia paper, that could then be distributed to contractors for their use in the field, and they could make their own prints from those sepia prints.  Mylar was transparent enough that we could draw different disciplines on different sheets, and mix and match as needed to create a set of prints.  For example, we'd have the columns and column grids on one sheet of mylar, the architectural walls on another, the ceiling grid on another, and the HVAC system on another, and by mixing and matching the mylars we would print out floor plans, ceiling plans, and HVAC plans just by the combination of mylars.  This required registering the drawings using a \"pin bar\" that connected the drawings using holes in each drawing, and pinning them together.  Printing these required running them through a vacu-frame where a sheet of photographic paper was laid in a machine, then the mylars laid on top and then all were exposed to light to transmit the image to the paper.   Photography has also been used to make multicolored prints with each disciplines work showing as a different color.    Here's a print that is a true \"blueprint\":   Here's what a print would look like that was made with a diazo printer:  Here's what a drawing printed on sepia paper looked like:   Here's a drawing as it would look printed on today's technology.  (This is a view of the PDF file on the screen, but it would look the same printed out, with black lines on white paper - no color):  ",
            "date": "Answered May 9, 2015",
            "views": "6",
            "upvotes": " View 6 Upvoters",
            "upvoters": [
                {
                    "user_id": "Ian Bee",
                    "user_href": "/profile/Ian-Bee-5"
                },
                {
                    "user_id": "John Carlo Cerillano",
                    "user_href": "/profile/John-Carlo-Cerillano"
                },
                {
                    "user_id": "Shane Dailey",
                    "user_href": "/profile/Shane-Dailey-2"
                },
                {
                    "user_id": "Sameer Gupta",
                    "user_href": "/profile/Sameer-Gupta"
                },
                {
                    "user_id": "David Yoo",
                    "user_href": "/profile/David-Yoo-17"
                },
                {
                    "user_id": "Vighnesh Ramakrishnan",
                    "user_href": "/profile/Vighnesh-Ramakrishnan"
                }
            ]
        },
        {
            "author_info": {
                "name": "Tim Simpson",
                "href": "/profile/Tim-Simpson-1"
            },
            "answer_text": "To add to Tammy Chambless's very comprehensive answer: I've studied old blueprints, but never created one. I find them attractive to look at, apart from their novelty these days. The blueprint process is capable if very fine resolution, and the image is apparently quite stable. Diazo prints, which I used to make for large format reproductions when large format copying of manually drafted drawings was specialised and expensive, are cheap to make. There are drawbacks: the process uses ammonia and the fumes can be a problem. The prints are not stable and degrade with exposure to sunlight.  The advent of digital images such as PDFs has put an end not only to the widespread use of diazo copying but to much use of plotters which are more or less automatic drawing machines. For example for large format reproductions I now email PDFs to the local stationery warehouse where they are printed quite cheaply with ver high quality on a laser printer. I can happily live without diazo, inkjet and plotter reproductions, but I still like the look and feel of blue prints. ",
            "date": "Answered May 10, 2015",
            "views": "18",
            "upvotes": "0"
        }
    ]
}