{
    "title": "How to develop supporting characters in a novel without having them get in the way of the main plot - Quora",
    "tags": [
        "Creative Writing",
        "Novels"
    ],
    "response": [
        {
            "author_info": {
                "name": "Mirna El Mahdy",
                "href": "/profile/Mirna-El-Mahdy"
            },
            "answer_text": "I don’t actually understand what you mean by “get in the way of the plot” but if by that you mean like not having a real role solving the case or the conflict or fighting in the war (depending on your plot) then I totally recommend writing one dimensional characters because usually that what differentiate the protagonist from the secondary characters. Protagonists have layers, qualities and flaws secondary characters don’t. Whether it’s the funny guy at work and makes the protagonist laugh, or the sexy neighbor that the protagonist has a crush on or his caring mother or annoying brother who doesn’t have a main role in the plot or the bullying kid or the cruel teacher…etc. Just add characters with no back stories or real interesting events in life and make them just like this is the friend that your readers don’t know much about other than they just meet the protagonist in the bar each Friday night or whatever don’t make these supporting characters as interesting and dimensional as our main characters and probably this won’t make them get in the way especially if these characters were dead like maybe his long gone grandma who he has lots of memories with her and these memories someway how relate to the plot or support it. Or the ghost of an old friend visits him in his dreams or nightmares. This looks a bit interesting, memories and dreams can support your protagonist and won’t “get in the way of the plot”. Right? ",
            "date": "Answered January 8, 2017",
            "views": "223",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Beth Goldowitz",
                "href": "/profile/Beth-Goldowitz"
            },
            "answer_text": "Remember that stories run better on two legs. Secondary plots involving your other characters need to intersect with the main plot and affect the main characters in a significant way, or they are useless. My suggestion is to watch a few episodes of Fawlty Towers, with John Cleese and Prunella Scales. Every episode is a tightly;y plotted masterpiece, with seemingly insignificant plot devices that vanish, only to reappear at the most inappropriate moment possible, to he consternation of poor Basil Fawlty at the end of the episode. The entire series is a collection of comedy gems. Watch Basil the Rat, or The Kipper and the Corpse. You won’t regret it. Amazon.com: Fawlty Towers: The Complete Collection Remastered: John Cleese, Andrew Sachs, Connie Booth, Prunella Scales: Movies & TV ",
            "date": "Answered January 6, 2017",
            "views": "175",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Thorr Stevens",
                    "user_href": "/profile/Thorr-Stevens"
                }
            ]
        }
    ]
}