{
    "title": "How to concentrate on writing my PhD Thesis - Quora",
    "tags": [
        "PhD Thesis",
        "Theses and Dissertations",
        "Focusing and Concentrating"
    ],
    "response": [
        {
            "author_info": {
                "name": "Michael Smith",
                "href": "/profile/Michael-Smith-989"
            },
            "answer_text": "One of the biggest problems to quality output is a lack of focus. It is soooooo easy to do anything but put one letter in front of the other and turn them into sentences and into paragraphs. Whether it’s e-mails, hunting down additional resources on the Net, fixing a software issue to make writing easier, you name it, all of these things can keep us from our real goals of creating good drafts of sections or chapters in our dissertation. 4 tips to keep your focus on writing Recently, I started using the following focus ideas to jump-start my writing output. I wanted to share them with you in hopes that you might be able to avoid that time drift during your writing sessions (of course, if you are a disciplined person, then just keep doing what you are doing!) #1 – Batch your e-mail Check your e-mail twice a day only, at 12:00 PM, right after lunch, and at 4:00 PM. This may seem quite difficult to do especially if you are connected all day and your computer beeps every time you get an e-mail. (If this is too much to ask of you, add a 7:30 AM e-mail check, but nothing more.) You would be surprised how much you can get done when you have 3-4 straight hours of free, uninterrupted time. (Those unannounced e-mails can be monumental time killers. What’s more, they interrupt the flow of your thinking.) If something is an emergency, people will use the phone. Let’s face it, we’re not that important, and being unplugged is probably something we all need a little more of… #2 – Turn off your wireless connection This would take care of your e-mail problem as well, but it is a separate issue. Having your wireless on just gives you permission to start tracking something down on the Internet that you feel you need at the moment. Again, nothing is that critical. Just make a note in your text (make it a different color if need be) that lets you know what book, author, idea or content is so important. Gather those up at the end of the day and track them down all at once. The goal is to keep thinking and writing. #3 – Give yourself permission to just write It has been said that the best writing is simply rewriting. There is a lot of truth to that. If you start with a good outline, sometimes your best bet for cranking out some good content is to write ideas freely without care for grammar, punctuation, choosing the right word or organizing every last thought. It doesn’t have to be perfect the first or second time out. What is important is that you begin to sort out the main ideas and to make the connections between sections. In addition, when you finally start to get something down on paper (besides a bunch of random notes) you will quickly realize where you have gaps in your thinking and research. #4 – Don’t get up for anything! Someone once told me that to write a dissertation you must have an iron butt! I’ll stand up and cheer for that one. When you sit down to write, don’t get up to eat, to drink water, to check if the mailman has arrived, to brush your teeth or even to go to the bathroom. Just write and write and write! Conclusion Focus on your writing! Don’t let anything distract you, not your blasted e-mail that calls to you (or used to call to you now that you shut it off), not that tempting wireless signal that gives you permission to surf, not that doughnut in the fridge, not anything. Just stay focused on your output and you will make some significant progress on your dissertation. I’d love to hear any ideas you have for staying focused while writing! Please feel free to message me if you need any help. Happy researching! ",
            "date": "Answered January 20, 2016",
            "views": "3",
            "upvotes": " View 35 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Olivér Ősz",
                    "user_href": "/profile/Olivér-Ősz"
                },
                {
                    "user_id": "Stanley Gorzelnik",
                    "user_href": "/profile/Stanley-Gorzelnik"
                },
                {
                    "user_id": "Arjun Narayanan",
                    "user_href": "/profile/Arjun-Narayanan-13"
                },
                {
                    "user_id": "Nayana Carneiro",
                    "user_href": "/profile/Nayana-Carneiro"
                },
                {
                    "user_id": "Sajidur Rahman",
                    "user_href": "/profile/Sajidur-Rahman-22"
                },
                {
                    "user_id": "Dainius Jakubauskas",
                    "user_href": "/profile/Dainius-Jakubauskas"
                },
                {
                    "user_id": "Pooja Ruhal",
                    "user_href": "/profile/Pooja-Ruhal-1"
                },
                {
                    "user_id": "Charles Libby",
                    "user_href": "/profile/Charles-Libby-3"
                },
                {
                    "user_id": "Cato Evans",
                    "user_href": "/profile/Cato-Evans-2"
                },
                {
                    "user_id": "Ahmed Bennakhi",
                    "user_href": "/profile/Ahmed-Bennakhi"
                }
            ]
        },
        {
            "author_info": {
                "name": "David Belair",
                "href": "/profile/David-Belair"
            },
            "answer_text": "Set aside time to write and scale back your social activities. If your field involves lab work, scale back the number of experiments you do per week, and spend only enough time at your office to interact with committee members, colleagues, and your PI. Find the least distracting environment for you to focus, and get to writing. I hope you use a reference organizing software like EndNote or Mendeley to help you, and take advantage of the templates available on Word or software like Latex. Use a software like Adobe Illustrator or PowerPoint to generate publication-quality images and figures. Finally, make sure you organize your thesis to tell a complete story with appendices, prefaces, an intro, and a conclusion to help guide the reader and highlight the novelty and potential impact of your work. Good luck! I think you will find that thesis writing can be very satisfying and lead to new ideas that will form the basis of your future directions section. A great thesis will explain the motivation for your work and lay the groundwork for future work based on your project and related side-projects. ",
            "date": "Answered January 9, 2016",
            "views": "15",
            "upvotes": " View 6 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Francesco Castellani",
                    "user_href": "/profile/Francesco-Castellani"
                },
                {
                    "user_id": "Hairul Azmi",
                    "user_href": "/profile/Hairul-Azmi"
                },
                {
                    "user_id": "Mohamed Tehami",
                    "user_href": "/profile/Mohamed-Tehami"
                },
                {
                    "user_id": "Virendrasinh Vaghela",
                    "user_href": "/profile/Virendrasinh-Vaghela"
                },
                {
                    "user_id": "Haizhen",
                    "user_href": "/profile/Haizhen"
                },
                {
                    "user_id": "Vishwanath Subramanian",
                    "user_href": "/profile/Vishwanath-Subramanian-1"
                }
            ]
        }
    ]
}