{
    "title": "How can someone get experience in (freelance) resume writing? - Quora",
    "tags": [
        "Resume",
        "Freelancers",
        "Freelancing Tips and Hacks",
        "Résumé and CV writing",
        "Résumés and CVs",
        "Freelancing",
        "Job Searches",
        "Writing",
        "Jobs and Careers"
    ],
    "response": [
        {
            "author_info": {
                "name": "Rox Newsome",
                "href": "/profile/Rox-Newsome-1"
            },
            "answer_text": "How can someone get experience in (freelance) resume writing? What Jim (see other answer) says about hiring managers being able to distinguish a professionally commissioned CV/resume from a candidate written CV/resume may be true, but as it is increasingly the norm to have a professionally written CV/resume (especially for senior managers and executives), the employer/hiring manager does not care who has written it. What matters is that it accurately represents the candidate and sells them persuasively. Let’s face it, some people aren’t that great at selling themselves or writing, even though they are fantastically valuable in a job role. They would get overlooked without some help. CV/resume writing demands more than just writing skills, knowledge and research. It is intuitive. Maybe you know someone you think of as lucky, who always seems to get an interview for every role they apply for? Well, it has nothing to do with luck. If they can’t articulate the secret of their success, it is because they intuitively understand what to write and how to write it. They also undoubtedly put effort in (though they are unlikely to think of it as effort). You can begin by writing resumes for friends and family to find out what gets results and what doesn’t. Perhaps volunteer to write resumes for those with specific obstacles, such as those with poor literacy skills or people who don’t have English as their first language, through a charity. Collect as many resumes from other people as you can, learn how to critique them and recognise what mistakes they are making. It would be useful to get some grounding through work where you are dealing with people who are looking for work, to gain insight into the problems of finding a suitable job role, the labour market and what hiring managers want to see. ",
            "date": "Answered February 20, 2020",
            "views": "94",
            "upvotes": "0"
        }
    ]
}