{
    "title": "How to write to someone that is in jail - Quora",
    "tags": [
        "Prisoners",
        "Prisons and Prison Life"
    ],
    "response": [
        {
            "author_info": {
                "name": "Debra Slone",
                "href": "/profile/Debra-Slone"
            },
            "answer_text": "In California, whether in county jail or state prison, each inmate has an ID number (PFN, PIN, CDCR#, etc.). That number can generally be obtained online, at the County Sheriff’s jail website, or the CDCR site, or, often, by calling the jail. Once you have the #, as well as the correct institution, there will be an address, likely the main address of the jail, to send letters addressed to the jail with the name and ID# of the inmate. THE MAIL WILL BE OPENED AND EXAMINED. Be sure not to mail anything that will get them, or yourself, in trouble. Put your return name and address. It can be delayed by the jail process. You should not send money. Money can be added to the inmate’s “book” by another process. ",
            "date": "Answered August 3, 2020",
            "views": "56",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Brian Solomon",
                    "user_href": "/profile/Brian-Solomon-3"
                }
            ]
        },
        {
            "author_info": {
                "name": "Sharon Fletcher-Medeiros",
                "href": "/profile/Sharon-Fletcher-Medeiros"
            },
            "answer_text": "You simply write them..lol j/k You have to have their information to write.. you'll need inmate id#, full name , location of person (whichever jail/prison their in) and house&bunk #.. if you dont know these things there is online inmate finder database systems. You again will need the full name,state person is in and birthday to find them. Also you can call the jail if very recently arrested and ask the info too,this isn't usually the best way.. P.s there is a format for filling out the envelope too,it helps to get to them quicker. P.s.s ha Jpay app has emails its 25 cents per mail and the officers print it out and give it to them ,you cam add 1 item to prison tour like photo or ever at additional 25 cents that is black and white. The emails do go to them a bit quicker. I hope this helped ",
            "date": "Answered August 4, 2020",
            "views": "38",
            "upvotes": "0"
        }
    ]
}