{
    "title": "How to publish a book on internet - Quora",
    "tags": [
        "Self-Publishing",
        "Book Publishing",
        "Publishing",
        "The Internet"
    ],
    "response": [
        {
            "author_info": {
                "name": "Bryan Collins",
                "href": "/profile/Bryan-Collins-5"
            },
            "answer_text": " Congrats. Now the real work begins. The good news is authors today don’t have to ask for permission from publishers, editors or even readers to get their books online! However, you still need the funds to publish a great book that sells. It cost me around EUR600 to self-publish my first book, EUR1000 to self-publish my second and EUR2000 to self-publish my third. In each case, I hired more expensive editors, designers and so on to improve the quality of the book in question. You can spend as much or as little as you want self-publishing you book. If you invest just a little, you’ll break even on the cost of your book faster. But if you invest more, you’ll create a better product and improve your craft with the help of a professional. Unlike years ago, you control all of your creative choices (including the budget), and that’s a liberating place to be for most non-fiction authors. Here’s what you need to self-publish your book: An editor – he or she will help you finalise your book - Try Reedsy or KibinA proofreader - see aboveA cover - 99designs is a great startA title - A/B test your titles with PickFu or Facebook adsAn author platform to market your book - start a blogReaders! - and that’s a post in itselfNeed help writing your book? I’ve put together a free online course for writers. ",
            "date": "Updated October 29, 2017",
            "views": "13",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Theo Daniel",
                    "user_href": "/profile/Theo-Daniel-3"
                },
                {
                    "user_id": "Davina Buckley",
                    "user_href": "/profile/Davina-Buckley"
                }
            ]
        },
        {
            "author_info": {
                "name": "Trevor D. Carss",
                "href": "/profile/Trevor-D-Carss"
            },
            "answer_text": "In order to get your book onto the Internet, here are the best two ways to do it: PDF download from your website.Amazon (both traditional and self-publishing). Now there are many other ways to get your book out there, including platforms to use, but I don’t want to drown you in choices. Your goal is to launch, not contemplate. Some brilliant authors like Tim Ferriss decided to give their book away for free on the Internet, in the form of a PDF file. This eliminated copyright issues, with the logic that people grabbing the PDF weren’t really the true customers anyways. This is why I mentioned PDF first. If you want to launch a book, it can be done easily, especially when you control your website. Amazon could shut down tomorrow, but if you own your website, you own the control. Since you are asking about publishing, I will leave out the most important component post-publish, which is marketing. Marketing is more than half the battle to actually succeed in the self-publishing world. Expect most of your work to go into this activity, just to get noticed. Also, publishing happens after you have: Written your bookEdited your bookDesigned the cover for your book.You can write, edit and design, or you can outsource any or all of those tasks. I believe that authors should learn how to be their own writer, editor and designer. There are so many resources out there to do these tasks, and at the very least, it helps to have a base understanding when competing with the pros. Now some of these ideas are unconventional, like the PDF release, but there are just so many authors, it helps to be different in your approach. To conclude, I will say that the publishing possibilities are endless, which is why you need the quickest mechanism to launch. Your website and Amazon are the places to be. ",
            "date": "Answered May 15, 2020",
            "views": "12",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Kong Moi Yen",
                    "user_href": "/profile/Kong-Moi-Yen"
                },
                {
                    "user_id": "Stephen Lambley",
                    "user_href": "/profile/Stephen-Lambley"
                }
            ]
        }
    ]
}