{
    "title": "How did Vikram Seth manage to research so much for 'A Suitable Boy'? - Quora",
    "tags": [
        "Vikram Seth (Indian novelist and poet)",
        "Indian Literature",
        "Indian Authors and Writers"
    ],
    "response": [
        {
            "author_info": {
                "name": "Apurba Kundu",
                "href": "/profile/Apurba-Kundu"
            },
            "answer_text": "Vikram Seth’s mother Leila Seth is the first woman Chief Justice of a High Court. In her very readable autobiography, On Balance, she writes, ‘Vikram’s novel A Suitable Boy was launched in February 1993 in New Delhi by Penguin Books. He was very keen that the first publication should be in India. He had worked very hard on the book. When we were living in 8 Rajaji Marg, he used to walk to the Nehru Memorial Museum and Library regularly and read the newspapers and gazettes pertaining to the period. He also watched movies from the late forties and early fifties; he must have seen Deedar half a dozen times. He learnt urdu from a teacher in order to understand the nuances of Muslim culture better. He met and interviewed our extended family, our friends, our acquaintances and many others whom he felt could give him an insight into understanding particular aspects of life or work or the psyche of the times. This included boxwallahs, bureaucrats, doctors, judges, lawyers, musicians, naturalists, politicians, policeman, professors, teachers, sants and gurus. He read all the land reform cases in the law reports, went – as Shantum had done earlier-to live with a Jatav shoemaker’s family in Agra, stayed for a month at the height of summer in a largely Muslim village in eastern UP, tried to figure out how one visited a courtesan, and bathed in the Kumbh Mela at Allahabad’.  ------------------------------------------------------------------------------------------------------------------- ‘Though Vikram wrote the bulk of A Suitable Boy in 8 Rajaji Marg, its revision and some addition were completed in Armsdell in Shimla. During the long process-lasting many years-of writing,revising and producing the book, quite apart from the creative stresses and difficulties, he had many problems: with his hand, which at one stage he could hardly write or type with; with his computer and printer which were forever malfunctioning; and later during the typesetting process, with his cheerfully optimistic friend and publisher, David Davidar. Vikram, facing deadlines from his foreign publishers who were dependant on Penguin India’s typesetting and film, and impatient with the slow and erratic progress which he could not control from distant Noida, moved with a bridge table and chair, clothes, bedding, papers and books into David’s flat in Delhi. At night he would sit through hours of power cuts and system crashes in the typesetter’s small shop. By day he would sleep or correct proofs. Whenever he became too fraught, David offered him Whisky. It was rather turbulent time and tempers ran high. But when the book finally appeared, resplendent in dark red and gold and elegantly printed on fine paper, all was forgotten’. ",
            "date": "Answered July 15, 2013",
            "views": "37",
            "upvotes": " View 52 Upvoters",
            "upvoters": [
                {
                    "user_id": "Zinnia Saha",
                    "user_href": "/profile/Zinnia-Saha"
                },
                {
                    "user_id": "Dhruv Kandhari",
                    "user_href": "/profile/Dhruv-Kandhari"
                },
                {
                    "user_id": "Gaurang Pandya",
                    "user_href": "/profile/Gaurang-Pandya-12"
                },
                {
                    "user_id": "Manvendra Nigam",
                    "user_href": "/profile/Manvendra-Nigam"
                },
                {
                    "user_id": "Ishan Gupta",
                    "user_href": "/profile/Ishan-Gupta-33"
                },
                {
                    "user_id": "Yashaswini Joshi",
                    "user_href": "/profile/Yashaswini-Joshi-1"
                },
                {
                    "user_id": "Madhulika Singh",
                    "user_href": "/profile/Madhulika-Singh-9"
                },
                {
                    "user_id": "Thanku Sagir",
                    "user_href": "/profile/Thanku-Sagir"
                },
                {
                    "user_id": "Shraddha Pandya",
                    "user_href": "/profile/Shraddha-Pandya-1"
                },
                {
                    "user_id": "Ujjwal Munshi",
                    "user_href": "/profile/Ujjwal-Munshi"
                }
            ]
        },
        {
            "author_info": {
                "name": "Nikhil Jha",
                "href": "/profile/Nikhil-Jha"
            },
            "answer_text": "I have been a Seth fan since my school days,when my dad used to read out sections of the book during our evening 'chai' sessions. Like you mentioned - the detailed and accurate description of every small element really fascinated me. I read the book twice, then read all of Seth's creation. Now during my 'fan-boy' phase, I read up a lot of Seth interviews, searched the net for any Seth resources; unfortunately none of which I can locate to cite here. So I will just mention the top few things that I can recall from memory  Seth spent 10 years researching to write that 'great Indian novel'. For someone as meticulous as him, it certainly is a good enough time to assimilate all that he didSeth visited his ancestral place multiple times, to gather material related to family stereotypes, behavior and anecdote. One of his interviews has a collection amusing incidents narrated from these visits, which I will try and find out to link hereLata is based on Seth's mother, and Harish on his father; who himself was a Bata employee. If you read 'Two Lives', you can relate Harish's character to Prem Seth's personality (he is mentioned in that book a few times)I will try and dig interesting interview links and add more to this answer. ",
            "date": "Answered July 3, 2013",
            "views": "1",
            "upvotes": " View 7 Upvoters",
            "upvoters": [
                {
                    "user_id": "Manasa D Kulkarni",
                    "user_href": "/profile/Manasa-D-Kulkarni"
                },
                {
                    "user_id": "Manvendra Nigam",
                    "user_href": "/profile/Manvendra-Nigam"
                },
                {
                    "user_id": "Punit Thakkar",
                    "user_href": "/profile/Punit-Thakkar-1"
                },
                {
                    "user_id": "Meghali Joshi",
                    "user_href": "/profile/Meghali-Joshi"
                },
                {
                    "user_id": "Aadya Antya",
                    "user_href": "/profile/Aadya-Antya"
                },
                {
                    "user_id": "Sanyukta Srinivasan",
                    "user_href": "/profile/Sanyukta-Srinivasan"
                },
                {
                    "user_id": "Kshitiz Uttam",
                    "user_href": "/profile/Kshitiz-Uttam"
                }
            ]
        }
    ]
}