{
    "title": "How long would it take me to die, if my left carotid artery was cut with a knife? Would I be able to survive with medical assistance? - Quora",
    "tags": [
        "Arteries",
        "Circulatory System",
        "Doctors"
    ],
    "response": [
        {
            "author_info": {
                "name": "Pooya Jazayeri",
                "href": "/profile/Pooya-Jazayeri"
            },
            "answer_text": "If your left carotid artery were completely transected and you were nowhere near a hospital, you would die pretty quickly. Here is a rough calculation. Your cardiac output is about 5L/min. Roughly 20% of that goes to your carotids, so 10% each. So your left carotid sees a flow of about 500mL/min. At that rate, you would have no blood left in 10 minutes. Obviously that flow would not stay constant as you continued to lose blood, but it’s a good starting point. Your next question is would you be able to survive with medical assistance?The answer is yes, most likely. We transect carotids in the operating room all the time. If you came to the operating room with a transected carotid, we would put a clamp on it. Then we would shunt it, and finally do a definitive repair. You may experience a stroke on the left side of your brain, depending on how healthy you are and how long you were bleeding for, or you may be just fine. ",
            "date": "Answered January 2, 2018",
            "views": "29",
            "upvotes": " View 64 Upvoters ",
            "upvoters": [
                {
                    "user_id": "David Chan",
                    "user_href": "/profile/David-Chan-316"
                },
                {
                    "user_id": "Adam Louie",
                    "user_href": "/profile/Adam-Louie-3"
                },
                {
                    "user_id": "Viraj Thakur",
                    "user_href": "/profile/Viraj-Thakur-12"
                },
                {
                    "user_id": "Sara Lydic",
                    "user_href": "/profile/Sara-Lydic"
                },
                {
                    "user_id": "Jasmine Chaity",
                    "user_href": "/profile/Jasmine-Chaity-2"
                },
                {
                    "user_id": "Kevin Piibemann",
                    "user_href": "/profile/Kevin-Piibemann"
                },
                {
                    "user_id": "Kasee Manly",
                    "user_href": "/profile/Kasee-Manly-1"
                },
                {
                    "user_id": "Eva Mason",
                    "user_href": "/profile/Eva-Mason-20"
                },
                {
                    "user_id": "Rohan Rance",
                    "user_href": "/profile/Rohan-Rance-1"
                },
                {
                    "user_id": "Ayşegül Özdemir",
                    "user_href": "/profile/Ayşegül-Özdemir-7"
                }
            ]
        },
        {
            "author_info": {
                "name": "Rob Seddon-Smith",
                "href": "/profile/Rob-Seddon-Smith"
            },
            "answer_text": "It is impossible to say as you are not particularly specific about the degree of cutting. A small cut would kill you if left untreated, but you could simply press very hard upon the wound and this would stem the bleeding effectively. If your artery was cut completely, you would probably die quite quickly without medical assistance as it is very difficult to stem the bleeding effectively without surgical instruments. If you could aget someone else to apply enough pressure, however you might be ok as eventually your blood pressure would drop to a level which would allow the bleeding to be controlled but still permit you to remain alive. As others have said, in hospital we do this occasionally. It is one way to control a particularly severe nosebleed. ",
            "date": "Answered August 22, 2018",
            "views": "10",
            "upvotes": " View 8 Upvoters",
            "upvoters": [
                {
                    "user_id": "Rohan Rance",
                    "user_href": "/profile/Rohan-Rance-1"
                },
                {
                    "user_id": "Trevor Davies",
                    "user_href": "/profile/Trevor-Davies-66"
                },
                {
                    "user_id": "Brandi Cain",
                    "user_href": "/profile/Brandi-Cain-2"
                },
                {
                    "user_id": "Nerissa Allegra",
                    "user_href": "/profile/Nerissa-Allegra"
                },
                {
                    "user_id": "Holly Shaffer",
                    "user_href": "/profile/Holly-Shaffer-12"
                },
                {
                    "user_id": "Susan Price",
                    "user_href": "/profile/Susan-Price-34"
                },
                {
                    "user_id": "Annathesa Darksbane",
                    "user_href": "/profile/Annathesa-Darksbane"
                },
                {
                    "user_id": "Susan Price",
                    "user_href": "/profile/Susan-Price-10"
                }
            ]
        }
    ]
}