{
    "title": "How to create distinct characters in a story - Quora",
    "tags": [
        "Character Design",
        "Character Development",
        "Fiction Writing",
        "Fiction",
        "How-to Question"
    ],
    "response": [
        {
            "author_info": {
                "name": "Kris Herndon",
                "href": "/profile/Kris-Herndon"
            },
            "answer_text": "Here are some ways:  1) Think about people you've met. Base the characters on them.  2) Make up, or obtain from somewhere, a \"character worksheet\" (Scrivener contains these) and fill it out with things like: Name, occupation, visible tattoos, height, weight, occupation, astrological sign, favorite beverage, mannerisms and quirks, favorite phrases or verbal tics.  3) Take a writing workshop, and ask your fellow critiquers: \"One thing I'm working on is making my characters distinct from each other. How can I make Molly memorably different from Megan?\" Writers love to tinker with things like this! We will tell you that Molly has freckles and Megan has cropped, bleached hair and wears men's shoes. We will tell you that Molly is a hypocrite, whereas Megan is merely a liar. We will advise you to make Megan's name start with an \"S\" and Molly's name start with a \"B\" because readers tend to see the first capital letter and read nothing beyond that and they WILL get Megan and Molly mixed up.  4) Read a lot or watch a lot of movies and TV, and remember the villains you hated and the heroes you liked. Think about what happened to them to make them the way that they are. Write down character-defining lines in a notebook. Ask yourself, \"Why would Batman SAY that?\" \"Why would Gandalf choose Bilbo?\" \"Why does Billy Eickhorn Orsini decide NOT to buy the rubies?\" \"Why did Lady Chatterley cry about the baby birds?\" Etc.  5) Listen to the way people talk, both in stories and in life. The way a person talks defines the person. Non-sequitors can really tell you what is on a person's mind. Use the information you find out in your stories.  6) Invent things about people. Real people and imagined people. Gossip is the start of a story. At the center of every bit of gossip is a character. When you hear about a scandal, ask \"Why?\"  7) Break the people you make up. I know it seems cruel, you made these little people up and they've done nothing to deserve it. But it's the breaks that define the character. Break them into little pieces, drive them up a cliff and throw rocks at them. Then see how they behave. ",
            "date": "Updated August 28, 2014",
            "views": "687",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Certified Yelp Reviewer",
                    "user_href": "/profile/Certified-Yelp-Reviewer"
                },
                {
                    "user_id": "Claudia Cruz",
                    "user_href": "/profile/Claudia-Cruz-29"
                },
                {
                    "user_id": "Nneka Eleh",
                    "user_href": "/profile/Nneka-Eleh"
                },
                {
                    "user_id": "Susan Smith",
                    "user_href": "/profile/Susan-Smith-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Jay Taylor",
                "href": "/profile/Jay-Taylor-17"
            },
            "answer_text": "Creating a distinct character can be done by providing a good back story, quirks, a novel way of phrasing things.... The list goes on. Perhaps what you should be doing is developing a character or characters that resonate with people. Make them vulnerable, believable and consistent. Having a connection with a character is much better than just remembering them because they are distinct. Think of the old man in Hemingway's \"The Old Man and the Sea\". He was not distinct but he was believable and we easily connect with him. Good luck in creating what it is you want. ",
            "date": "Answered June 28, 2014",
            "views": "263",
            "upvotes": "0"
        }
    ]
}