{
    "title": "How to get more views and upvotes on Quora - Quora",
    "tags": [
        "Quora Upvotes",
        "Views (Quora feature)",
        "Using Quora",
        "How-to Question"
    ],
    "response": [
        {
            "author_info": {
                "name": "Mihnea Nastase",
                "href": "/profile/Mihnea-Nastase"
            },
            "answer_text": "I remember asking myself this exact question when I started on Quora. Does it really matter? probably not. It’s a nice incentive to see that what you’ve written actually matters. So here’s what you should do: Firstly, it is important to understand exactly what Quora is. This was very difficult for me to grasp at the beginning. I thought that writing on Quora will bring me hundreds if not thousands of views on my blog. It didn't. People only look at your profile bio on Quora in order to check out if you are qualified to write what you are writing and see other posts. It is very rare that someone will jump off the platform to search for you.So, here's the first point, get a great profile bio. This should be simple and short! Mine is: Foreign Policy Advisor - Writer - Blogger @Herebedragons.live. I post this bio for every topic I write on. I find that it is easier to get people to identify me (ah the dragons guy).Quora is a platform that welcomes everyone that makes a contribution. KEEP EVERYTHING RELEVANT. People will tear you apart if you don't. People will bleed you dry, drink your blood and continue their day as if nothing happened. Be smart. Be professional. Quora is like a job. Do it right. Don't fool around.Another point that links to the previous is – be unique! Being repetitive does not make you relevant.Second, you are going to write a lot at the beginning. You will get few views. Keep writing. You are going to start getting slightly more. Then, slightly less. Keep Writing. You will feel that it's not going very well. Keep writing. I cannot emphasize enough how much \"keep writing\" matters.Find a topic you like and something that is popular. I write on many topics. Nothing performs better for me than TV series and Game of Thrones. Finding a good, wide topic to write on is crucial. Writing in a niche will get you renowned among your peers, but not a lot of visibility.Insert at least one image or visual aid in each and every one of your posts. Simple. It is proven that people are attracted visually. Quora adds your pic (even from the text body) in the feed view.Start with a catchy line. I like to start my posts with \"here be spoilers\". It links well with who I am and offers good information. People respect the extra time you put into it.Get people who are writers in your field to upvote and contribute to your post. Upvotes on Quora weigh differently. An upvote from a \"most viewed writer\" will count much more than an upvote from average Joe.Weekends are good days to post. However, it is entirely up to your topic. GoT used to air on Mondays. That means that I wouldn't sleep much on Monday night. I'd try to beat everyone to the bell. Write before everyone else.Also, you should write on questions that don't have many answers. This makes you relevant and will get you more views (even though it doesn't seem like it at the beginning).Use bullet points and all the tools that Quora gives you. Bullet points make your text easier to read. If I see a big bulky text, unless it's from some great writer I like, I'll skip it. People tend to read in an \"F\" style. Read up on how people go through a text and follow it.Upvotes are more important than views in the Quora algorithm. You should aim to have about 2-3% upvotes to views ratio when you start getting a lot of views.Write long, well-structured answers. A short answer will get less attention than a long one with pictures and tools. Quorans like to see that you put time into your post. Aim for 400 words or more. Besides making your answer more relevant through a lengthier answer, try to avoid long drawn out sentences. Use short sentences. Pack a punch. Keep people engaged.Also, you should respond to comments. Even if they try to contradict what you are saying. Be nice and positive. People will respect that. You can build some community around yourself.",
            "date": "Answered September 11, 2016",
            "views": "69",
            "upvotes": " View 121 Upvoters",
            "upvoters": [
                {
                    "user_id": "Harikrishnan Ks",
                    "user_href": "/profile/Harikrishnan-Ks-19"
                },
                {
                    "user_id": "Adib Kahatt",
                    "user_href": "/profile/Adib-Kahatt-3"
                },
                {
                    "user_id": "Jared McCartney",
                    "user_href": "/profile/Jared-McCartney-6"
                },
                {
                    "user_id": "Rosalind Gillam",
                    "user_href": "/profile/Rosalind-Gillam"
                },
                {
                    "user_id": "Shwetha Sankari",
                    "user_href": "/profile/Shwetha-Sankari"
                },
                {
                    "user_id": "Prasad Nagarajan",
                    "user_href": "/profile/Prasad-Nagarajan"
                },
                {
                    "user_id": "Rivki Schwartz",
                    "user_href": "/profile/Rivki-Schwartz"
                },
                {
                    "user_id": "Tamanna Goel",
                    "user_href": "/profile/Tamanna-Goel-1"
                },
                {
                    "user_id": "Sathish Kumar",
                    "user_href": "/profile/Sathish-Kumar-8331"
                },
                {
                    "user_id": "Farhan",
                    "user_href": "/profile/Farhan-270"
                }
            ]
        },
        {
            "author_info": {
                "name": "GJ Coop",
                "href": "/profile/GJ-Coop"
            },
            "answer_text": "The best method to gather more views is to be completely shameless, and use all possible means to up your views. Find a question in a very popular topic, ie, that plenty of people already follow.Answer a question that has been answered 100+ times before. The more the merrier.Construct the initial two sentences for full impact. An arresting first sentence will get you a long way.The bulk of the answer should be an engaging anecdote with a heartwarming message.Be concise. Be entertaining.That is, short and sweet.Present a very conformist point of view, but it must have a little twist at the end, some new sliver of insight.No negativity.Add an attractive image. If you can add an image of an attractive female, or an ugly cat you will triple those views. Extra points for being scantily clad.And give the source of the image.Format with bullet points, italics, bold, et cetera.Don't present a long paragraph slab.One sentence paragraphs are good.Never ask for upvotes.To have your answer rate high in the answer list, to generate additional views down the track, there's the usual tricks: Add some cross links to reputable websites, like Wikipedia.Having a few footnotes is also useful in pushing your ranking up. Seems more academic.Be definite in your views, particularly in your first paragraph. Don't use any negative words like “no”, “maybe”, “not”, “perhaps”, because, the Quora bot will mark you down.And if you want to get upvotes you need to finish with a snappy one line ending, not fizzle out like this answer.  There are two ways to get big views, ie, over 5000. Fast and furious, or slow burn. I've only ever had one answer go viral, over 100,000 views, but that is an experience that all writers here should have at least once, ie, seeing your views click over faster than a Rio de Janeiro taxi meter, as I said at the time. GJ Coop's answer to What is the shortest flight that you have ever taken? Those viral answers burn brightly, but not for long. Note that the half life is pretty short.  A few days of 20k+ views, then not a lot . . . The other approach is to write a canonical answer, that just keeps kicking over with those views as the months go on. A question people routinely ask on Google. My most consistently viewed answer is for what might be considered a particularly dumb question: GJ Coop's answer to Are bicycle tire valve caps necessary? It's never had more than 60 views on a day, but for as long as I remember there's never been a day when someone hasn't looked at it. Those 8 views a day add up to more than 5000.  Ultimately, I think the second approach is more fulfilling. That important question about bike tube valve caps will be around for as long as Quora is. ",
            "date": "Answered April 19, 2019",
            "views": "1",
            "upvotes": " View 14 Upvoters",
            "upvoters": [
                {
                    "user_id": "Jared McCartney",
                    "user_href": "/profile/Jared-McCartney-6"
                },
                {
                    "user_id": "Waleed Aslam",
                    "user_href": "/profile/Waleed-Aslam-23"
                },
                {
                    "user_id": "Joshua Schneider",
                    "user_href": "/profile/Joshua-Schneider-58"
                },
                {
                    "user_id": "Shalini Sinha",
                    "user_href": "/profile/Shalini-Sinha-7"
                },
                {
                    "user_id": "Amy E. Brown",
                    "user_href": "/profile/Amy-E-Brown-1"
                },
                {
                    "user_id": "Garry Taylor",
                    "user_href": "/profile/Garry-Taylor-5"
                },
                {
                    "user_id": "Nidarshana Gohain (নিদৰ্শনা)",
                    "user_href": "/profile/Nidarshana-Gohain-নিদৰ্শনা"
                },
                {
                    "user_id": "Rohan Ackerman",
                    "user_href": "/profile/Rohan-Ackerman"
                },
                {
                    "user_id": "Kathy Fleming",
                    "user_href": "/profile/Kathy-Fleming-14"
                },
                {
                    "user_id": "Irina Aleksandrova",
                    "user_href": "/profile/Irina-Aleksandrova"
                }
            ]
        }
    ]
}