{
    "title": "How to write a killer ending for your screenplay - Quora",
    "tags": [
        "Screenplays",
        "Screenwriting",
        "Writing"
    ],
    "response": [
        {
            "author_info": {
                "name": "Jim Mercurio",
                "href": "/profile/Jim-Mercurio"
            },
            "answer_text": "Good question. I may have termed or at least popularized the phrase “Killer Ending” in my DVD called Killer Endings. A Killer Ending is when the goal and the need unify in the climax into one succinct action. The growth the character needs to achieve his character arc is what he or she needs to attain the goal (save the day, get the girl, defeat villain, etc.). You want to align the external journey of “story” with the internal emotional journey of the character. Scenes have to “turn” or change both story and character. A Killer Ending does this too. You create an ending that simultaneously addresses the story and the character. This is the classical Hollywood narrative done well. This is your typical “happy ending.” You can play with this to create other sorts of ending. A tragedy is when the character flaw weighs on the character so much that they don’t get the goal and are wounded and destroyed by the attempt. A “bittersweet” ending is when a character has the character arc and growth, i.e., they learn the lesson, but they don’t attain the goal. I hope this helps. ",
            "date": "Answered October 8, 2018",
            "views": "153",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Wayne Chiang",
                    "user_href": "/profile/Wayne-Chiang-6"
                }
            ]
        },
        {
            "author_info": {
                "name": "David Greenberg",
                "href": "/profile/David-Greenberg-49"
            },
            "answer_text": "I’ll do my best to answer this question but I’m not sure if it is what you’re looking for. A good ending should be directly connected to the beginning and grow organically from everything leading up to it. Most movies are about characters growing and changing. You can almost think of it as a “before” and “after” ad. If a character is a certain way at the beginning of a movie, the character will often be the opposite at the end, usually improving. If you’re talking about having a surprise twist at the end, just make sure that it doesn’t come out of the blue like a deus ex machina. The hints and clues should be hidden in plain sight, embedded into your plot but not so obvious that they’ll ruin the surprise. ",
            "date": "Answered October 8, 2018",
            "views": "135",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Wayne Chiang",
                    "user_href": "/profile/Wayne-Chiang-6"
                },
                {
                    "user_id": "Kelly Erickson",
                    "user_href": "/profile/Kelly-Erickson"
                }
            ]
        }
    ]
}