{
    "title": "How to know whether it is best to optimize or delete your old blog content - Quora",
    "tags": [
        "Blog Posts",
        "Web Content Curation",
        "Content Strategy",
        "Blogging Advice!",
        "Content Marketing",
        "Bloggers",
        "Blogs",
        "Blogging"
    ],
    "response": [
        {
            "author_info": {
                "name": "Andrea Lam",
                "href": "/profile/Andrea-Lam-29"
            },
            "answer_text": "Building links isn’t as simple as saying…If you haven't found your own Backlinks finder, you can check out the service:SEO, PPC, Website Monetize, Keyword Group Buy Tools Let’s Not Be Too Hasty to Delete… OK, so now you may be concerned about all those old posts lying around on your blog and anxious to start deleting them all. Keep in mind that old content can be an asset you are failing to exploit. Here are some of the ways your old content can be (and may already be) an asset to your business: Traffic: Some of your old content may have been widely shared, and may have a lot of incoming links from other websites. These “oldies but goodies” might be key traffic drivers, and could be even more so if they were refreshed/updated.Renewed relevance: Some topics are cyclical (like boom/bust cycles in the economy). You may have a blog gathering dust that becomes highly relevant again and only requires a small amount of editing to become a compelling, new blog entry.Cost/value: Updating old content is typically easier and faster than creating new content. You may save time and money on your blogging efforts by refreshing some of the old stuff. This is especially true if your blogging topics tend to be “evergreen” rather than highly topical.What to Do? So old blog posts are bad, yet they can also be beneficial? Confusing, right? Here’s what you can do. You want to maximize every blog post by either updating it or recycling it. Some of your old blog posts may simply be a little outdated and a quick refresh can bring it all up to date: Refresh the Good Stuff Re-edit the content to make it relevant and timely: Check and correct references to public figures who have changed titles, retired, passed away, etc.Delete or edit references to defunct businesses, technologies, etc.Update references to “current” cultural and political trends, especially “of-the-moment” trends in fashion, humor, etc.Clean up time-based references that are relative to the post date (“it’s been 2 years since…” etc.)Change tense where applicable (e.g. change “is” to “was”).Consider adding a blurb at the top of the blog to note the update.Tune-up the SEO: Add in newly relevant keywords where possible. There may be new terms that are relevant to your content now that were not in use when you first posted.Update on-page optimization where applicable (meta-description, image alt tags, etc.).Consider adding new images to update the visual appeal, especially the thumbnail. This may draw in people who have read the old content but pass over the new version because they associate the image with the old content.Consider publishing in a second format, e.g. a video version. Two versions are better than one.Rethinking Your Content Marketing Approach Google spokespeople have downplayed the idea that “old content won’t hurt you.” They have also warned that removing content is a dangerous SEO strategy. But is it really? Not based on our results. For the last 20 months, we’ve been hacking and slashing our way through our archives which resulted to increased pageviews and organic traffic of up 60+ percent YoY. Just check out these numbers: When I started as Executive Editor in July 2017, we had 910,000 pageviews. In January of this year, we just had a record month – 1.7 million pageviews. At that time, we had about 18,000 pages. And we just topped that record again in March – more than 1.9 million pageviews. Today, we still have 18,000 pages indexed – we’re just getting more out of the same amount of content. So how did we achieve this growth? Here’s the process we used. Step 1: Audit Your Content The process all begins with auditing and evaluating your content. There are basically three buckets of content: Content that helps you.Content that does absolutely nothing for you.Content that can hurt you.We need to figure out which bucket all of our content fits in. Since 2003, Search Engine Journal has been creating tons of content and it came to a point where it got really messy and disorganized. We needed to get out of that chaos. The first step in the process is to crawl your content. Some options that you can use to crawl your content include: ScreamingfrogDeepCrawlOncrawlSitebulbBotifyHere are even more crawlers. Choose whichever crawler works for you. After you get through the crawling process, you need to know about the following elements: Title: Is it optimized? Does it include a reader benefit?URL: Is it SEO friendly? Do you need to change it?Author: Who wrote it? Is it an expert/authority in the field?Publication date: Is it still fresh or out of date?Number of reads: The more reads, the better. It’s a sign of good content that connected with your audienceWord count: It isn’t necessarily a sign of low-quality content but it could potentially indicate quality issues.Number of links: How many inbound and internal links do you have?Trust Flow and Citation Flow: This is Majestic’s metrics for quality score and link equity.Step 2: Evaluate the Quality of Your Content Next, you’ll need to analyze the quality of the content you have on the website. I define quality content as content that is: AccurateMobile-FriendlyAnswers QuestionsInformativeOriginalShareableSolves ProblemsInspiringReadableVisualEntertainingEducationalAnd for me, low-quality content: Has no target audience.Has no goal / purpose.Is not optimized.Is unsuccessful.On the other hand, Google defines quality content as: Useful and informative.More valuable and useful than other sites.Credible.High quality.Engaging.A term that also comes up often is E-A-T which comes from Google’s search quality rating guidelines. Simply put E-A-T means: Expertise: Your unique skills, information, or knowledge.Authority: Other people know about and recognize your skills or knowledge.Trust: People believe what you think, say, or do and feel secure buying from or endorsing you.Google considers content as low quality when it has the following elements: Inadequate E-A-T.Main content quality is low.Unsatisfying amount of main content.Exaggerated / shocking title.Ads or supporting content distracts from main content.Unsatisfying amount of info about website or content creator.Mildly negative reputation of website or content creator.What’s the best action to take when you find out that you have low-quality content? Should you remove or improve it? ",
            "date": "Answered May 11, 2020",
            "views": "51",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Leah Jakson",
                    "user_href": "/profile/Leah-Jakson"
                }
            ]
        },
        {
            "author_info": {
                "name": "Austin Mallick",
                "href": "/profile/Austin-Mallick"
            },
            "answer_text": "I’m an advocate for blogs as a way to help companies and individuals differentiate themselves in today’s internet landscape. They allow companies and individuals to set the customer experience, define their tone and voice, and share content that is relevant to their particular industry. Blogs are a great way to get traffic to your site — and if you have good content, then its much easier to keep visitors coming back! It’s much better to optimize existing blog content instead of deleting it, especially if its a piece of evergreen content. This content is always relevant, regardless of seasonality or new trends. Evergreen content can be a source of traffic no matter what. To find out which posts you should optimize, view your previous blogs and look at the following: Visits - high traffic on a particular post means that people find it interesting or helpful…hell, it might even just rank well! You’ll want to update and optimize these pieces for sure.Engagement (like comments and shares) - your content is a conversation starter! Use this blog as inspiration for future blog topics to keep the conversation going.Backlinks - use a backlink checker like Ahrefs to see who is linking to your content. If you’re finding some backlinks to a particular piece of content, it means that others find it helpful as well. Plus, backlinks (or should I say, quality backlinks) play an important role in ranking well on Google!Topics - perhaps you wrote on a topic that is starting to trend again. Update and optimize these previous posts to start ranking better without having to start from scratch.By looking at these factors, you’ll be able to identify which posts are worth optimizing and which are better left to the archives. ",
            "date": "Answered September 28, 2019",
            "views": "226",
            "upvotes": " View 4 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Nadeem Jalwania",
                    "user_href": "/profile/Nadeem-Jalwania"
                },
                {
                    "user_id": "Suraj Pokhrel",
                    "user_href": "/profile/Suraj-Pokhrel-21"
                },
                {
                    "user_id": "Judith Engelstad",
                    "user_href": "/profile/Judith-Engelstad"
                },
                {
                    "user_id": "Zahid Ahmed",
                    "user_href": "/profile/Zahid-Ahmed-14"
                }
            ]
        }
    ]
}