{
    "title": "How to become an active Quora writer - Quora",
    "tags": [
        "Writers and Authors"
    ],
    "response": [
        {
            "author_info": {
                "name": "Vipul Gupta",
                "href": "/profile/Vipul-Gupta-150"
            },
            "answer_text": "Just write one answer per day just like me, and you will not get bored doing this. If you write many answers daily you will somehow lose interest after sometime. Most importantly don't write for upvotes. Yes, upvotes do keep you motivated but that doesnot mean if you don't get upvote you are a bad writer or if you get many upvotes you are excellent writer. People only upvote when they relate themselves with the answer or are fully satisfied. Cheers!! ",
            "date": "Answered July 12, 2017",
            "views": "456",
            "upvotes": " View 5 Upvoters",
            "upvoters": [
                {
                    "user_id": "Learner",
                    "user_href": "/profile/Learner-365"
                },
                {
                    "user_id": "Ojay Ken-Erhimu",
                    "user_href": "/profile/Ojay-Ken-Erhimu"
                },
                {
                    "user_id": "Duru Chukwumaobi Harrison",
                    "user_href": "/profile/Duru-Chukwumaobi-Harrison"
                },
                {
                    "user_id": "Sparsh Rawat",
                    "user_href": "/profile/Sparsh-Rawat-1"
                },
                {
                    "user_id": "Rahul Meena",
                    "user_href": "/profile/Rahul-Meena-258"
                }
            ]
        },
        {
            "author_info": {
                "name": "Kathleen Grace",
                "href": "/profile/Kathleen-Grace"
            },
            "answer_text": "Simple. Look for questions you feel you can answer. Then write. Be informative and thorough in your answers, don’t use one-word answers, don’t duplicate other answers, and use proper grammar. Be careful of the traps that people fall into - this is a site for information, your answer needs to add value to the site, you’re not here to just comment, but you’d be a contributor to the knowledge base. ",
            "date": "Answered July 14, 2017",
            "views": "664",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Howard Delaney",
                    "user_href": "/profile/Howard-Delaney-2"
                },
                {
                    "user_id": "Casper Omland",
                    "user_href": "/profile/Casper-Omland"
                },
                {
                    "user_id": "Dot McHale",
                    "user_href": "/profile/Dot-McHale"
                }
            ]
        },
        {
            "author_info": {
                "name": "Nisha Jc",
                "href": "/profile/Nisha-Jc"
            },
            "answer_text": "Keep on looking for the trending topics either from Google or from Twitter hastags. Read more on the topic and have profound knowledge. Read from others to know the different writing styles. Organize your thoughts, put your thoughts into words and then begin your writing journey. Most important of all “practice”. Make writing one of your basic behaviour. You will be an expert.😊 ",
            "date": "Answered June 12, 2020",
            "views": "104",
            "upvotes": "0"
        }
    ]
}