{
    "title": "How to write a good reflective essay - Quora",
    "tags": [
        "Essay Writing Help",
        "Essays",
        "Writing Advice",
        "How-to Question"
    ],
    "response": [
        {
            "author_info": {
                "name": "Grace Acosta",
                "href": "/profile/Grace-Acosta-2"
            },
            "answer_text": "If this is for a college application, first and foremost bear in mind that the essay should reflect more about you than the parking lot. I assume this won’t be much of an issue because there aren’t too many details to get into regarding a garden variety parking lot, but it’s a common mistake that a lot of students make— getting lost in the physical space, or blow-by-blow description of an incident, or even a person. The parking lot is a only a springboard. No one cares about it. However, they will care about your observations and thoughts, and what the parking lot inspires in you, or what memories it evokes. When you ask, “How do I write a good (reflective) essay?” you’re asking the wrong question. Instead, ask yourself “Do my reflections on a parking lot get my mind rolling on lots of substantive issues— either personally substantive, or topically substantive?” In other words, do you have enough material for a good essay? If the parking lot is merely a device— something you think is an inventive or clever tool by which to introduce a theme—and it really doesn’t carry weight in your head regarding anything in particular (memories, experiences, musings, metaphors/symbolism), you might have trouble with producing content which is what any good or excellent essay of any kind relies upon. Content is critical— one or two strong ideas, a clear vision, commitment to a point of view, passion for the subject matter. Other elements such as organized sentences, good grammar/spelling, an alluring opening sentence, and a satisfying conclusion are vital as well, but they are organized around the content. Without content, you have a string of well-written sentences stating and/or clarifying nothing exceptional. Before writing a single sentence, think about the parking lot, and ascertain whether or not you have anything interesting to say about yourself through the vehicle of an essay on a parking lot. If you don’t, choose another vehicle, or just start writing about yourself more directly. I don’t know what the prompt you are responding to is, but read it over carefully so you understand what the college is asking for. If the prompt is “Tell us about yourself,” or “Topic of your choice,” then just remember that the question underneath the prompt is, “Who are you?” How do you think? What do you value? What makes you happy? What are your struggles? Who is important to you and why? What are coping mechanisms you employ to get through challenging times? What are your passions? What or who influences you? What talent/energy/viewpoint do you bring to our campus/community? You don’t have to answer all those questions in one essay, of course. But in general, this is what colleges want to know. Who are you? If you can answer that question in an authentic, meaningful way, you will have written a good essay ostensibly about a parking lot. ",
            "date": "Answered February 10, 2017",
            "views": "895",
            "upvotes": " View 3 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Marie Yam",
                    "user_href": "/profile/Marie-Yam-1"
                },
                {
                    "user_id": "Rebecca Conway",
                    "user_href": "/profile/Rebecca-Conway"
                },
                {
                    "user_id": "Kairos T",
                    "user_href": "/profile/Kairos-T-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Lorraine Lordi",
                "href": "/profile/Lorraine-Lordi"
            },
            "answer_text": "First, make a list of things that you really wonder about. Topics that make you angry, sad, happy, are all good places to start. If the assignment calls for something specific, such as nature, then be specific. You can write 500 words (at least) on a blade of grass by digging deeply into it from many perspectives: What purpose does it serve? Why does it matter, this one little blade of grass? How do most people see it? Do they? How does an ant see it? And on and on. By picking one specific topic you care about and listing at list ten questions, you will see that this type of writing actually helps you discover what you didn’t even know you thought or felt before. ",
            "date": "Answered February 10, 2017",
            "views": "294",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Kairos T",
                    "user_href": "/profile/Kairos-T-1"
                }
            ]
        }
    ]
}