{
    "title": "How to write cover letter in SEO - Quora",
    "tags": [
        "Cover Letters"
    ],
    "response": [
        {
            "author_info": {
                "name": "Ahmed Sohail",
                "href": "/profile/Ahmed-Sohail-82"
            },
            "answer_text": "Not only for SEO you can use the below formula for any JOB profile cover letter. 3-4 paragraphs of 2-3 sentences each.Paragraph 1: why you are applying. Give a reason and note exactly what you are applying for. You want to mention the role specifically to make it easier for recruiters who receive applications for multiple positions. This it the paragraph where you demonstrate your enthusiasm for them specifically. You think the company is the best in its space, you have tons of experience in the space, you've been targeting the industry/role in your career, etc. Be specific to stand out.Paragraph 2: who you are. Name drop good companies you've worked for, summarize your experience briefly only including roles and tasks that are specifically related to the open position. This is the paragraph where you communicate you are a qualified, experienced worker.Paragraph 3: what you can do. This is like paragraph 2 but the goal now is to indicate that you've read their job description and match your specific experience to their specific asks. If the job description asks for everything and the kitchen sink, pick two or three things you feel are the core of what they need and address that.Paragraph 4: what you're like. This is the closing paragraph or sentence and you want to say more than just \"look forward to speaking with you!\" Give them an idea what that might be like. The content of this paragraph is less easy to describe because sometimes you may know the company's business well enough to say \"look forward to hearing more about your plans for [whatever challenge they face as a business] and how I can help!\" In other instances you may want to fall back on your enthusiasm and why you want to work with them.",
            "date": "Answered June 21, 2016",
            "views": "11",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Adiba Nuradzkia",
                    "user_href": "/profile/Adiba-Nuradzkia-1"
                },
                {
                    "user_id": "Wang Jiangyao",
                    "user_href": "/profile/Wang-Jiangyao"
                },
                {
                    "user_id": "Priya Srivastava",
                    "user_href": "/profile/Priya-Srivastava-19"
                },
                {
                    "user_id": "Raihan Farooq",
                    "user_href": "/profile/Raihan-Farooq"
                }
            ]
        },
        {
            "author_info": {
                "name": "Nagilla Karthik",
                "href": "/profile/Nagilla-Karthik"
            },
            "answer_text": "Kelly Technologies Flat no :212,2nd floor,Annapurna Block, AdityaEnclave,Ameerpet,Hyderabad-16. RE: SEO Specialist, December 10, 2016 Dear Ms. Ramana, As a highly skilled SEO Specialist, I read your posting for a new SEO Specialist with interest. My experience aligns well with the qualifications you are seeking, in particular my role as a SEO Specialist at New Market Solutions, and I am certain I would make a valuable addition to your organization. With more than 8 years' experience as a SEO Specialist, I am adept in original content development, search friendly architecture solutions, and keyword research. Moreover, while my on-the-job experience has afforded me a well-rounded skill set, including first-rate problem-solving and analytical thinking skills, I excel at: Systems Implementation and TrainingBusiness Intelligence and Data Analysise-Marketing and Social MediaWebsite and Keyword AnalysisIn addition to my experience and personal qualities, I have a solid educational foundation and a passion for business development and Internet marketing. Please review my attached resume for additional details regarding my expertise and abilities. I will follow up to request an appointment to discuss how my experience and background meets your needs. Thank you for your time and consideration. Sincerely, Rmana ",
            "date": "Answered December 12, 2016",
            "views": "324",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "FG Ọlọrunṣàiyé",
                    "user_href": "/profile/FG-Ọlọrunṣàiyé"
                },
                {
                    "user_id": "Hugh Little",
                    "user_href": "/profile/Hugh-Little-1"
                }
            ]
        }
    ]
}