{
    "title": "How to run a successful gaming blog - Quora",
    "tags": [
        "Blogs",
        "Blogging",
        "Startup Strategy"
    ],
    "response": [
        {
            "author_info": {
                "name": "Jiwan Shrestha",
                "href": "/profile/Jiwan-Shrestha-14"
            },
            "answer_text": "Thankx for the query, As like in other fields, blogging has also been transformed in these years. Whatever be the method, the main objective is to deliver high quality content to your users. I don’t have any deep knowledge about gaming blogs but there are certain youtube channels which have more than 2 million subscribers and run by a single person. Like a guy named Nickatnyte who runs a channel teaching people about a popular game (Clash Royale by supercell). So, i suggest you to open up an youtube channel featuring some tutorials about games and integrate it on your blog with a transcription. That way, you will have visual content for users as well as textual content to rank on search engines. Apart of that, you can always try to collaborate with other bloggers and blogs related to your niche. Generate coupons for special events and giveaways can be a great initiative for gamers to subscribe your blog. Regards!! ",
            "date": "Answered June 18, 2017",
            "views": "896",
            "upvotes": " View 2 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Sandeept (Ankit) Dhakal",
                    "user_href": "/profile/Sandeept-Ankit-Dhakal"
                },
                {
                    "user_id": "David Sharper",
                    "user_href": "/profile/David-Sharper"
                }
            ]
        },
        {
            "author_info": {
                "name": "Antony Vitillo",
                "href": "/profile/Antony-Vitillo"
            },
            "answer_text": "Start a blog with Wordpress and start writing high-quality content. Give your blog an original touch or you will only be “one of the many gaming blogs out there”. Keep the blog frequently updated. The more you go on, the more you have to write interesting news and updates. If you can, do also videos and publish them on Youtube. Connect with other gaming bloggers and do guest blogging. And keep going, because it needs time, long time to become successful. ",
            "date": "Answered June 19, 2017",
            "views": "479",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Shibnarayan Ghosh",
                    "user_href": "/profile/Shibnarayan-Ghosh-2"
                }
            ]
        }
    ]
}