{
    "title": "How to improve the affiliate product conversion rate on your blog - Quora",
    "tags": [
        "Conversion Rates",
        "Conversion Funnels",
        "Conversion (marketing)",
        "Conversion Optimization",
        "Affiliate Networks",
        "Affiliate Marketing",
        "Blogs",
        "Blogging"
    ],
    "response": [
        {
            "author_info": {
                "name": "Peter Nyiri",
                "href": "/profile/Peter-Nyiri-1"
            },
            "answer_text": "Let’s illustrate what happens when someone wants to buy a product: Joe needs a new laptop. He spends 2 days searching through eBay, Amazon, look at reviews on affiliate sites, unboxing videos, etc. Finally they manage to decide.John signs up for a keyword research tool for $39. Since he is not a keyword guru, he cancels his subscription after the first month. He is lost as a customer.Someone offers Eva backlinks, articles, autoresponder service, social media posting… She has little idea how to break even after investing her money into such tools and stops after a while.Takeaway: Your potential customers have no clue Which product is best for themHow to use the product to get their investment back out of it.Therefore we have two standard approaches: Affiliate sites (churn out articles and rank in Google building links)Info products (create an online course and sell it for $999 or $274 or $37).The problem with the first approach is that your conversion rate is low. In the second approach the “paywall” excludes a lot of potential customers. The Successful Approach Successful companies like Facebook, Google, YouTube, etc use a totally different approach. They don’t care about keywords, SEO, writing blog posts, building links, etc. They are BEYOND SEO. Facebook gives you a social platform with messaging. They could charge you a monthly fee just like phone companies do. But instead they attract you by giving away this valuable service for free while they make tons of money though selling a completely different service (advertising). How You Can Adopt This Model You as a blog owner may not have the capital to build a tool like YouTube. But you can leverage the above through the power of free info product funnels. Let’s say you offer laptops, either as your own product or as an affiliate. The usual model is to create a comparison article where people click on your link, maybe buy, but never return. How about creating a free course with a title like this: Laptop Secrets: How to get a laptop so that it will serve you for yearsYou can cover different things (from my own experience, things I ran into when I needed one). How much RAM do you need for blogging/gaming/etc?How many GHz CPU?How big should be the screen?Mouse pad being annoying?How do you spare the battery?What to do when it doesn’t start?How to add more RAM?What kind of mouse should you use?What kind of headphone for gaming?Inside the course you can recommend all of those related products through your affiliate links. How I Built This Strategy My blog income comes from plugins related to sales funnels. I created a premium course, WordPress (Affiliate) Funnels Pro. It is priced at $228, but with a coupon people get it for free, which makes it very desirable. I have no reason to hold information back, because my income doesn’t come from the course, but it comes from the affiliate link clicks. The people, instead of just reading one blog post and disappearing forever, sign up for the course, which contains ALL my money-generating blog posts in one “playlist” and forcing people to read them all. The course is treated as a full blown premium course, with full sales page and email marketing. That’s why people see value in it. Does it work? You can judge based on the commissions.  I also collected the email addresses, which can be used to steer people back to the course and later on I can market additional products to them. The above course is a beta test project and I welcome any feedback. Anyone can sign up if you can find the promo code on the sales page. ",
            "date": "Answered June 25, 2020",
            "views": "337",
            "upvotes": " View 13 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Nina Shah",
                    "user_href": "/profile/Nina-Shah-71"
                },
                {
                    "user_id": "Nooramin Emon",
                    "user_href": "/profile/Nooramin-Emon"
                },
                {
                    "user_id": "April Chilldres",
                    "user_href": "/profile/April-Chilldres"
                },
                {
                    "user_id": "David Spiljak",
                    "user_href": "/profile/David-Spiljak"
                },
                {
                    "user_id": "Keshav Gautam",
                    "user_href": "/profile/Keshav-Gautam-58"
                },
                {
                    "user_id": "Afdholudin",
                    "user_href": "/profile/Afdholudin"
                },
                {
                    "user_id": "Nick Ruba",
                    "user_href": "/profile/Nick-Ruba"
                },
                {
                    "user_id": "Tushar Rex",
                    "user_href": "/profile/Tushar-Rex"
                },
                {
                    "user_id": "Ajmer Singh",
                    "user_href": "/profile/Ajmer-Singh-238"
                },
                {
                    "user_id": "Ravi Prajapati",
                    "user_href": "/profile/Ravi-Prajapati-4"
                }
            ]
        },
        {
            "author_info": {
                "name": "Kris Werkmeister",
                "href": "/profile/Kris-Werkmeister"
            },
            "answer_text": "Without seeing your site, it is hard to answer this question exactly, but here are a few recommendations that have helped me on my own website. Create a lead generation funnel, and use email marketing to increase your conversion rate.If you are not collecting people’s email addresses at this point, you are absolutely missing out on tons of profits. Email marketing is free, and allows you to connect better with your website viewers and paying customers. 2. Don’t make it a sales page… keep in mind that your website is a blog, not a sales page. It is fine to recommend products, but do not be too pushy, and absolutely do not make your articles into sales content. Instead focus on building trust and knowledge in your customers by creating well balanced, informative content, and cultivating a relationship with your customers through your email funnels. 3. Visuals Once again, this is quite website specific, but it is important to check into your website visuals. When is the last time that you bought something from an ugly or scammy looking website? Probably never right? Sometimes it is important to take a step back, and take the customer’s perspective. Make sure that your website is something that you would trust and purchase from if you were your ideal customer. Those are my three main tips. If you want to learn more about increasing affiliate conversions, you may consider checking out these sites: Free Affiliate Marketing Hacks For 2020| Free Sales Funnel| Easy To Follow Free Training Course Secrets Of Viral Email Marketing 39 Quick Ways to Increase Your Website's Conversion Rate Hope this helps! ",
            "date": "Answered July 10, 2020",
            "views": "97",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "David Alexander",
                    "user_href": "/profile/David-Alexander-14"
                }
            ]
        }
    ]
}