{
    "title": "How to write in first person without using 'I' all the time - Quora",
    "tags": [
        "Third Person Pronouns",
        "Narration",
        "Narratives"
    ],
    "response": [
        {
            "author_info": {
                "name": "Mike Sweeney",
                "href": "/profile/Mike-Sweeney-135"
            },
            "answer_text": "The others have covered it decently (but you know I have to put my stick in anyhow). “I” is no different than “he.” Both vanish. Both also can be used sparingly. Just as in dialog attribution: “Is that the plane?” he asked. “No,” I told him. “Are you sure?” “Yes.” “This is absurd!” “There is no need,” I said, “to get angry.” As in all dialog, action, motivations, placement, verbal ticks, and more than anything else the place in the conversation helps the reader keep track and allows you to use the attributions sparsely. The same goes for pronouns. First Person, like the typical Single-Viewpoint Third Person, is an immersive point of view. Everything is seen through and understood to be filtered through that experience. It isn’t a mistake to occasionally put in a “I looked” or “I saw” but you should reserve them for when the character is making a specific effort; when they are in effect noticing they are noticing: Trees, trees everywhere. Tangled, verdant detail close-up, all leaves and twigs and suspicious shadows. Rank after rank as they crested the low hills, blending into a seamless horizon. There. A cloud of birds had suddenly burst from the canopy. I looked in that direction, saw a tall alder that stood just slightly above its brothers. If the sniper was here, that was his most likely nest. I jiggled the above to put a specific “I looked” in it. There were actually smoother ways of doing it, such as “I focused my attention on a tall alder…” Even actions can be described without the pronoun. But I personally feel that this is somewhere where the immediacy and the efficiency of pronouns wins. After all, who wants to read a fight scene in which, “blows were exchanged.” I’d rather read one in which the protagonist tells me, “I hit him twice in the face and he fell back.” ",
            "date": "Answered October 24, 2019",
            "views": "16",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Norma McPhee",
                "href": "/profile/Norma-McPhee"
            },
            "answer_text": "Just make sure your viewpoint character spends at least as much time observing what other characters are saying and doing as they do talking about themself. “Good evening, Viewpoint Character,” said the butler. “May I take your coat?” “No thank you. It’s a bit chilly in here.” The butler looked offended. “Sorry. Circulatory issues.” “Quite understandable,” said the butler. “My master’s guests often have circulatory issues—particularly after a few visits.” He bit his lip. It looked like it had been bitten quite a few times before. And let the fact that it is the viewpoint character experiencing the scene be understood rather than stated. Avoid phrases like “I noticed” “I thought” or “I heard.” The rocking chair was rocking on its own, despite the absence of any breeze; a loose floorboard under the left rocker creaked rhythmically—in a different rhythm than the rocking of the chair itself. Hmm. It was possible this room was incompetently haunted. And finally, don’t go overboard. Sometimes it’s important to know that an observation comes from, and is therefore colored by, your character’s personal viewpoint. It wasn’t the out-of-sync creaking that I objected to so much as the choice of a Regency era rocking chair for such an obviously Victorian-inspired haunting. Took me quite out of the moment. I’ve always thought eclectic decor best for a haunted house for just this reason. I hope you found this useful, or at least amusing. ",
            "date": "Answered April 18, 2018",
            "views": "27",
            "upvotes": " View 11 Upvoters",
            "upvoters": [
                {
                    "user_id": "Andrew Toynbee",
                    "user_href": "/profile/Andrew-Toynbee"
                },
                {
                    "user_id": "Ceecee C",
                    "user_href": "/profile/Ceecee-C-3"
                },
                {
                    "user_id": "M.C.",
                    "user_href": "/profile/M-C-1400"
                },
                {
                    "user_id": "Mindy Lin",
                    "user_href": "/profile/Mindy-Lin-18"
                },
                {
                    "user_id": "Krystal Morgan",
                    "user_href": "/profile/Krystal-Morgan"
                },
                {
                    "user_id": "Candy Corn Cat",
                    "user_href": "/profile/Candy-Corn-Cat"
                },
                {
                    "user_id": "Aiden Fleming",
                    "user_href": "/profile/Aiden-Fleming"
                },
                {
                    "user_id": "Janelle Bailey",
                    "user_href": "/profile/Janelle-Bailey-3"
                },
                {
                    "user_id": "Sam Austin",
                    "user_href": "/profile/Sam-Austin-1"
                },
                {
                    "user_id": "Jodi Compton",
                    "user_href": "/profile/Jodi-Compton-1"
                }
            ]
        }
    ]
}