{
    "title": "How to analyse a picture - Quora",
    "tags": [],
    "response": [
        {
            "author_info": {
                "name": "Joseph Finkleman",
                "href": "/profile/Joseph-Finkleman"
            },
            "answer_text": "The first question is for what purpose? There are two basic analysis that I can think of. One is on an art experience basis, a little bit is aesthetics but most is not. The other is on a technical basis, which also touches aesthetics but aesthetics are a small part of an analysis. In art, the first thing to look at in a photograph, is to at least examine what photographic information is there in the image? What can you discern from the information given? An image of a person, or a place or a thing, it is also an examination of the thing itself. Sometimes there is little to discern, because the context is limited, but it is one of the major to examine. The next thing to examine is the aesthetics. Not so much does this please you or not, that is irrelevant, but does the composition, the actual mechanistic elements of the image support the story or do they detract or are they irrelevant to the story? Aesthetics are just constructs, conventions that we use to organize a story. We call it composition because that is what we do, we compose elements into a story. So how well the composition tells the story matters. The last past of an art analysis is very subjective. To be a successful piece of art the piece has to have a portal, a doorway that is there if the viewer chooses to use it. And by stepping through the doorway, the viewer can tell you their story. Often times in an art piece we can see that the artist created the doorway, just as we as an individual simply choose not to enter. That is the subjective nature, in an analysis we need to be able to see objectively if there is a doorway, regardless of our participation. This is the objective nature of viewing art. All art does not have to appeal to us. We just have to know how to see beyond our personal taste. The other kind of analysis is strictly technical, as it pertains to photography. The first part has to do with sheer technique of exposure and presentation. Was it properly exposed and processed. Most digital work is very poor in processing. When we are analysing an image, we look at the black point, there must be D-Max black somewhere in the image, unless there is a cogent reason for its absence. Next, the middle tones, are the middle tones alive or dead? Mid tone contrast is the single weakest point of most digital capture. It shows up in a color picture mostly and the most frequent response is to punch up the color. This is a correct recognition that something is wrong, and an incorrect solution to the problem. It is a luminosity problem not a color problem and as a result we see over saturated color out of a poor understanding of the role of tonal value. Then there is the composition itself. The image has a point, it can be composed in a contained manner or an un-contained manner, that is irrelevant as long as the point of the story is supported by the composition. Anyone who tells you that there is only one way to compose is simply wrong. The rule of thirds is but one compositional tool. Do not be a slave to it. In the processing of an image, to analyze it, one has to disassociate our memory of being there from the actual structure of the image. This is not easy, but it is necessary. After making certain that the composition supports the story, after making certain that in a global sense we exposed properly and processed properly, then we need to look at the parts of the structure that comprises the image. What are the planes that need emphasizing and what are the parts that need de-emphasizing? Those are your regional and local adjustments. I hope that answered your question. It helps in a question to be very specific. In this case I tried to cover all of the types of an analysis that we do. Probably only one of them was actually your question. ",
            "date": "Answered April 13, 2018",
            "views": "487",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Dean Botteron",
                "href": "/profile/Dean-Botteron"
            },
            "answer_text": "Approach it either as an art critic who knows design and style and technique and pick it apart or praise it from a technical point of view… Or as a simple observer who is meant to feel and think something from the impression it is intended to leave you with… Whether it is what the artist wanted, if they wanted anything specific, or not, is a subjective call, unless you know the artist and they explain it to you… (or is it just meant to be a record and snapshot of a moment preserved for history)… It really depends on how you choose to see it, and how the artist meant for it to be viewed…, [can’t resist an example…]  Is it attractive? Pretty? Meaningful? Provoking? Boring? Complimentary to your wallpaper? Hotel lobby friendly? ",
            "date": "Answered July 2, 2017",
            "views": "193",
            "upvotes": "0"
        }
    ]
}