{
    "title": "How to keep friends from sharing my posts on FB - Quora",
    "tags": [
        "Facebook (product)"
    ],
    "response": [
        {
            "author_info": {
                "name": "Isra Al Qaisi",
                "href": "/profile/Isra-Al-Qaisi"
            },
            "answer_text": "You can't prevent people from sharing your posts . However, if you set your posts as to be seen by Friends, then only your friends who can see it even it's shared. now if you wont to turn off sharing for all even your friends , lease check the follow :) Dues to a recent change made by Facebook, only ‘Public” posts have the “Share” button on them now. If you publish your own posts with their privacy level set to “Friends” that will prevent your posts from having the “Share” button as well. To change the privacy of your old posts at once check the follow :) Click at the top right of any Facebook page and choose Settings.Select Privacy from the left menu.Under the Your Activity section, click Limit the audience for posts I've shared with friends of friends or Public?Click Limit Past Posts.If you just want the new posts to be only with friends, Click on the triangle next to the \"Post\" button below the text box for creating new Facebook posts. A menu appears allowing you to select the individuals to whom the post will be visible. The audience you select for the post are the ones who will be able to see and share the post. ",
            "date": "Answered August 26, 2018",
            "views": "321",
            "upvotes": " View 13 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Wilson Samuel",
                    "user_href": "/profile/Wilson-Samuel-13"
                },
                {
                    "user_id": "Mona Crutchfield",
                    "user_href": "/profile/Mona-Crutchfield"
                },
                {
                    "user_id": "Martina Qaramehmedi",
                    "user_href": "/profile/Martina-Qaramehmedi"
                },
                {
                    "user_id": "Amanda Jaramillo",
                    "user_href": "/profile/Amanda-Jaramillo-26"
                },
                {
                    "user_id": "David Randall",
                    "user_href": "/profile/David-Randall-56"
                },
                {
                    "user_id": "Jane Blackburn",
                    "user_href": "/profile/Jane-Blackburn-12"
                },
                {
                    "user_id": "Karly Patricia",
                    "user_href": "/profile/Karly-Patricia"
                },
                {
                    "user_id": "Saleheen Chowdhury",
                    "user_href": "/profile/Saleheen-Chowdhury"
                },
                {
                    "user_id": "Josh Bonilla",
                    "user_href": "/profile/Josh-Bonilla-4"
                },
                {
                    "user_id": "Garrick Miller",
                    "user_href": "/profile/Garrick-Miller-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Sam",
                "href": "/profile/Sam-366"
            },
            "answer_text": "If your post permissions are set for only your friends to see the post then they would not be able to share it. If the post is to set the public and they can share it with the public as well. You can change your default settings of who can see your posts and you can also go back to old posts and change the permissions. ",
            "date": "Answered August 26, 2018",
            "views": "8",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Odalys Sanchez",
                    "user_href": "/profile/Odalys-Sanchez-18"
                }
            ]
        }
    ]
}