{
    "title": "How to find sponsorship for traveling - Quora",
    "tags": [
        "Sponsorship"
    ],
    "response": [
        {
            "author_info": {
                "name": "Sathish Kumar",
                "href": "/profile/Sathish-Kumar-379"
            },
            "answer_text": "You get a travel sponsor by doing the following: Asking companies to sponsor.Not just one or two, you have to ask atleast 300 different companies.Draft what value you can provide to their brand.Reason them how sponsoring you will help them.Follow up with gentle reminders for the update.Prepare yourself to be patient in trying, persevere in requesting to n number of organisations.Choose organisations that match your travel style. E.g: Cycling accessories manufacturer in case you are going to travel long distance by a cycle.Good luck. ",
            "date": "Answered August 26, 2018",
            "views": "650",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Mahdhevan Moodley",
                    "user_href": "/profile/Mahdhevan-Moodley"
                },
                {
                    "user_id": "Shubham Garg",
                    "user_href": "/profile/Shubham-Garg-28"
                },
                {
                    "user_id": "Namita Kumari",
                    "user_href": "/profile/Namita-Kumari-3"
                },
                {
                    "user_id": "Nitin Soni",
                    "user_href": "/profile/Nitin-Soni-81"
                }
            ]
        },
        {
            "author_info": {
                "name": "Gaurav Gupta",
                "href": "/profile/Gaurav-Gupta-295"
            },
            "answer_text": "Best way would be following: Plan an international route on bike and target SUV Car, Sports Bike companies to barter with you. Companies instead of providing money gets agreed to pay for your fuel and sometimes even provide the vehicle as wellInstead of asking for sponsorship, why don’t you do freelance work and earn online. You just need to carry your laptop everywhere. Making money online is not tough now a days. You just need to identify your strength",
            "date": "Answered August 14, 2019",
            "views": "86",
            "upvotes": "0"
        }
    ]
}