{
    "title": "How and why do we dream sometimes, and sometimes we don't? - Quora",
    "tags": [
        "Dreams and Dreaming"
    ],
    "response": [
        {
            "author_info": {
                "name": "Peter Bendtsen",
                "href": "/profile/Peter-Bendtsen"
            },
            "answer_text": "We dream multiple dreams every night. Especially in the REM phase of sleep. We enter the REM stage when we’ve been sleeping for around 90 minutes and it lasts 90 minutes as well. This happens around 4–6 times per night, resulting in the same amount of dreams. The reason why we don’t think we dream, is that we forget our dreams. We do actually forget between 95–99% of the dreams we dream. Why we do not remember our dreams is based on 2 theories. The first theory is that we do only remember dreams which meant something to us, a dream which had our interest. Another theory is that a part of our memory or all of it is turned off when we sleep, because of a hormone named norepinephrine. if you want to remember your dreams better, try to tell yourself every night, when you go to sleep, that you want to remember your dreams. When you wake up the next day, do your best to recall them. Even though you might only remember a few snippets of your dreams, you’ll train your brain to remember them better in the future. ",
            "date": "Answered January 5, 2018",
            "views": "38",
            "upvotes": " View 5 Upvoters",
            "upvoters": [
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/Ahmad-851"
                },
                {
                    "user_id": "Eduardo",
                    "user_href": "/profile/Eduardo-253"
                },
                {
                    "user_id": "Spam Skeppy Is A Diamond Block",
                    "user_href": "/profile/Spam-Skeppy-Is-A-Diamond-Block"
                },
                {
                    "user_id": "Victoria Uribe",
                    "user_href": "/profile/Victoria-Uribe-1"
                },
                {
                    "user_id": "Daniel Weaver",
                    "user_href": "/profile/Daniel-Weaver-54"
                }
            ]
        }
    ]
}