{
    "title": "How to write the best college application essay - Quora",
    "tags": [
        "Expert Advice",
        "College Application Essays",
        "Essays"
    ],
    "response": [
        {
            "author_info": {
                "name": "Grace Acosta",
                "href": "/profile/Grace-Acosta-2"
            },
            "answer_text": "Read each prompt carefully, and choose wisely. Pick the question (to answer) that evokes the strongest, most passionate, most emotional, or most excited response. If you choose “Topic of your choice,” you should still write about something deeply personal and meaningful to you. After you’ve chosen, read, then re-read the prompt again. You’d be surprised how many students don’t answer the question, or answer it incompletely. Sometimes, this comes as a result of reusing previously written essays from some junior year English class assignment. Sometimes, it’s because the student wants to make a statement about himself, and doesn’t even pay attention to what the actual question is. Either way, answering the question erroneously or incompletely is a common mistake that is easily avoided. Give the question a good think. Be authentic and honest. You want to impress the reader with YOU— your thoughts, your observations, your problem-solving abilities, your character, your humanity, etc., etc.— not your big-fat vocabulary or your complicated sentences. Once you have figured out the one or two points that you want to make (“I’m a pragmatist, but I like to dream big,” “I love the challenge of solving a knotty problem,” “I’ve faced huge obstacles in my life, but I’m stronger and wiser for them,”), try to write a narrative that makes sense. In other words, take the reader on a journey: 1) I started in this place, or with this problem. 2) I was dazed and confused, or people treated me badly. 3) I mourned, raged, or felt isolated. 4) I got off my behind, and decided to do something about it. 5) Once I did, there were a lot of setbacks, but I pushed through. 6) I got over the hump, and here’s what I learned about me. 7) I’m happy I experienced all of it— the good, the bad, the ugly. Be honest. Be authentic. Be sincere. Oh, and make sure you have good/appropriate paragraph breaks. You’d also be surprised at how many students’ final drafts are just one huge chunk of sentences, all in one block. Regardless of content, that makes for a visually difficult and arduous read, and you definitely don’t want to make an admissions officer work very hard at understanding your story. ",
            "date": "Answered December 23, 2017",
            "views": "12",
            "upvotes": " View 6 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Ogolla Lorens",
                    "user_href": "/profile/Ogolla-Lorens"
                },
                {
                    "user_id": "Armand Lin",
                    "user_href": "/profile/Armand-Lin"
                },
                {
                    "user_id": "Branden Sattler",
                    "user_href": "/profile/Branden-Sattler"
                },
                {
                    "user_id": "Kaya Eber",
                    "user_href": "/profile/Kaya-Eber"
                },
                {
                    "user_id": "Lianne Ramos",
                    "user_href": "/profile/Lianne-Ramos-9"
                },
                {
                    "user_id": "Hilla Nasruddin",
                    "user_href": "/profile/Hilla-Nasruddin"
                }
            ]
        },
        {
            "author_info": {
                "name": "James Bal",
                "href": "/profile/James-Bal"
            },
            "answer_text": "I got into a university that had a much higher average GPA and SAT than mine. And I have no doubt that it was my personal statement that got me admitted. I am not an admissions officer and am certainly not an expert on this issue, but I can share my own lessons from this experience: Don’t write a Shakespearean essay. Make sure that your essay has perfect grammar and spelling, and you can certainly use some intelligent vocabulary where you see fit. But I am sure that colleges receive thousands of essays that sound as if they have been copied and pasted from a thesaurus. They don’t care how many fancy words you use.Your topic doesn’t have to be dramatic or extraordinary. You can write an essay about a very emotional topic, or you can choose to write about more ordinary issues. Either way, try to highlight what is important without feeling the need to make everything poetic. I wrote my personal statement about my passion towards politics, and my supplement by simply explaining my role in an extracurricular activity. I included some personal anecdotes where I found was fit, but most of it was very to-the-point. As long as you tell a meaningful story with a clear vision, there’s nothing wrong with keeping the topic simple.Brag without bragging. I found it very difficult to state positive things about myself without sounding as if I saw myself as holier than thou. But after much editing, I found it to be possible. My advice is don’t try to sneak in anything, such as “After I left debate prep -an area in which I won several awards- I headed to cello practice.” Don’t include anything that is irrelevant either. If you talk about debating in your essay, simply write “I was a successful debater, winning several awards.” If debating has no relevance to the topic of your essay, leave it out.Research what kind of student that university wants. (This advice only works for supplement writing, since a personal statement has to apply to each university.) If, for example, Harvard prefers a holistic applicant, include multiple different areas of interest in your essay and outline how you have succeeded in different fields. If Princeton wants someone devoted to what they’re passionate about, write in detail about how you came to love engineering and how you pursued that interest in your activities.Use your voice. This was an advice I found annoying when it was given to me by my counsellor, but I came to understand what it meant. Yes, you should edit your essays to perfection. But don’t calculate every single word and sentence. That would just sound robotic. Write with your heart and with passion. Remember that it is a human being that will read your essay. Make sure that they hear your unique voice and perspective.Manage feedback wisely. Don’t get feedback on an essay until you are personally certain of it. And when you do ask for feedback, ask people whose opinions you actually trust. There’s no point in asking twenty various people what they think; ask three or four who you know have an idea about what they’re talking about and will make constructive comments. Once you do receive feedback, decide whether or not you want to use it. This may sound like wrong advice since the conventional wisdom is that more editing makes it better, but don’t change your essay to the point where it’s unrecognizable. At the end of the day, it is your essay.In conclusion (/TLTR), the most important thing is that the essay is yours. Your words, your experiences, and your voice. It is you -not your counsellor, parents, friends, etc.- who will get accepted or rejected from universities. So make sure that you are happy with the essay you send and that they hear from your unique perspective. That way, if you do get in, it is because of you. And if you don’t, it’s their loss. ",
            "date": "Answered December 26, 2018",
            "views": "53",
            "upvotes": " View 31 Upvoters",
            "upvoters": [
                {
                    "user_id": "Jaymee Salazar",
                    "user_href": "/profile/Jaymee-Salazar-1"
                },
                {
                    "user_id": "Sugar Brown",
                    "user_href": "/profile/Sugar-Brown-3"
                },
                {
                    "user_id": "Kay Mangoes",
                    "user_href": "/profile/Kay-Mangoes"
                },
                {
                    "user_id": "Sitora Sultonova",
                    "user_href": "/profile/Sitora-Sultonova-2"
                },
                {
                    "user_id": "Gauranga Prem Das",
                    "user_href": "/profile/Gauranga-Prem-Das"
                },
                {
                    "user_id": "Žiga Kovačič",
                    "user_href": "/profile/Žiga-Kovačič-2"
                },
                {
                    "user_id": "Umesh Giri",
                    "user_href": "/profile/Umesh-Giri-79"
                },
                {
                    "user_id": "Khdao Hamimo",
                    "user_href": "/profile/Khdao-Hamimo"
                },
                {
                    "user_id": "Lianne Ramos",
                    "user_href": "/profile/Lianne-Ramos-9"
                },
                {
                    "user_id": "Pachtun Zalmé",
                    "user_href": "/profile/Pachtun-Zalmé"
                }
            ]
        }
    ]
}