{
    "title": "How to know if my photography is good - Quora",
    "tags": [
        "Photographers",
        "Digital Photography"
    ],
    "response": [
        {
            "author_info": {
                "name": "Greg Edwards",
                "href": "/profile/Greg-Edwards-78"
            },
            "answer_text": "Q - How do I know if my photography is good? A - You test it. Good places to test is your local camera club (here is a good list List of Clubs & Councils), Facebook groups on area of your interest (for California try California Color or any of a number of similar groups), Viewbug and more. I’d suggest posting on a regular basis to several groups. You may be amused to see that one group like your image a lot and another not so much, but on another day it is reversed. Or try photo competitions through camera clubs, Viewbug, and some Facebook groups have regular contests. And before COVID-19 I would show my pictures I wanted to test to the checker at the market, the waitress at the restaurant, the nurse at the hospital, etc. via my cell phone. Those people will always say that they like it. Ignore that. Instead look at their eyes. If the picture is good there will be a startle in their eyes. And they will ask to look at more of your images. Good luck! ",
            "date": "Answered May 31, 2020",
            "views": "201",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "David Sandoz",
                    "user_href": "/profile/David-Sandoz-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "John Van Steenberg",
                "href": "/profile/John-Van-Steenberg"
            },
            "answer_text": "Study the work of the great classical painters. Study the work of modern abstract painters. Study the work of several generations of great photographers. Examine your own work and see if the themes, the composition, the subtleties compared to any of the above. The closer you get the more likely it is that you will have excellent images. ",
            "date": "Answered May 31, 2020",
            "views": "111",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Sean Durham",
                    "user_href": "/profile/Sean-Durham-3"
                }
            ]
        }
    ]
}