{
    "title": "How to write an adapted screenplay - Quora",
    "tags": [
        "Screenwriting",
        "Writing Advice"
    ],
    "response": [
        {
            "author_info": {
                "name": "David Greenberg",
                "href": "/profile/David-Greenberg-49"
            },
            "answer_text": "Do you mean “how can I adapt an existing property or concept by someone else into a screenplay?” If that is the question, the short answer is: acquire the rights. If someone else has created something and you want to turn it into a movie, you have to compensate them. If the question is “conceptually and practically, what is involved in adapting something for the screen?” I'd say that you need to remember that it was probably not originally written with a movie adaptation in mind so you might have to make certain changes in order to make it work as a movie. The conventional model tells us that a screenplay employing three act structure should have an inciting incident within the first ten pages. In a novel, the inciting incident might be 100 pages in. Look at all of the backstory etc. that was cut or condensed when adapted the first Harry Potter book into a film. Similarl, the experience of reading a book is a very different sensation than watching a move. A movie can be a very visceral experience. The way the shark dies in the film version of “Jaws” is very different from the way it dies in the book. In adapting a book, you will cut scenes and characters , make up new scenes and characters. I hear that there is a talking dog in the novel “Forest Gump.” Wonder why that plot element didn't make it into the movie. ",
            "date": "Answered June 2, 2017",
            "views": "332",
            "upvotes": " Answer requested by Antonio Byrd",
            "upvoters": [
                {
                    "user_id": "Joe Velikovsky",
                    "user_href": "/profile/Joe-Velikovsky"
                },
                {
                    "user_id": "Clifford Garstka Sr.",
                    "user_href": "/profile/Clifford-Garstka-Sr"
                }
            ]
        },
        {
            "author_info": {
                "name": "Walter D. Petrovic",
                "href": "/profile/Walter-D-Petrovic-1"
            },
            "answer_text": "You first need to learn something about how films are made and the costs that are involved to film certain scenes. Equipped with this information you then choose a book you would like to see made into a movie. Get a copy you can destroy and highlight all dialogue with a highlighter. Transcribe all this dialogue onto your word processor then place the dialogue in the appropriate setting as described in the novel. Note, you do not need to be as descriptive but concentrate on the key visuals and audio that will be involved in the scene. Rewrite the text until you are happy with its flow then set it up in screenplay format. That is the quickest way to adapt a book into a screenplay. ",
            "date": "Answered May 30, 2017",
            "views": "146",
            "upvotes": " Answer requested by Antonio Byrd"
        },
        {
            "author_info": {
                "name": "Abu Bello",
                "href": "/profile/Abu-Bello"
            },
            "answer_text": "I assume you mean adapt from a book. Break down and outline the principle story elements and pull out the iconic moments.Throw away anything that doesn’t work.Use these pieces to outline a new plot and if the dialogue is transferable do so as much as possible.Stay true to the reality of your new construction as much as possible.",
            "date": "Answered May 31, 2017",
            "views": "107",
            "upvotes": " Answer requested by Antonio Byrd"
        },
        {
            "author_info": {
                "name": "Lauri Donahue",
                "href": "/profile/Lauri-Donahue"
            },
            "answer_text": "A2A The same way you write any other type of screenplay. The only difference is, you need to first obtain the rights to whatever you’re adapting, or use something in the public domain. Lauri Donahue's answer to How can I become a better screenwriter? ",
            "date": "Answered May 31, 2017",
            "views": "319",
            "upvotes": " View 2 Upvoters "
        }
    ]
}