{
    "title": "How to write a career objective - Quora",
    "tags": [
        "Jobs and Careers in Writing",
        "Writing Advice",
        "Writing",
        "Jobs and Careers"
    ],
    "response": [
        {
            "author_info": {
                "name": "Michael George",
                "href": "/profile/Michael-George-92"
            },
            "answer_text": "A2A. Are you referring to a career objective that is included in your resume — or one you want to create for yourself in your career? I had a look at the couple of anwers you received. I was rather surprised by the advice given by a person “who has hired 10,000 people.” The numbers of people I have hired is in the several hundreds — but they all ended up working for me. Possibly it makes me more careful about “details?” Many resumes I get include a career objective. I find them quite useful — in fact, I always ask about career plans when I interview a candidate. Companies always have tactical and strategic needs in hiring — the specific need at hand is one where you would like to be able to also meet some more long term objectives, in terms of middle management, technical expertise, and long-term stability of manpower. Discussion of a career goal gives you the ability to figure out how well the applicant might fit in the next few years in the company. It also means, btw, that the wrong career goal may not fit as well, and may make you a worse candidate — but, in that case, it is probably better for you as well. An effective career objective needs to be short and precise. One or two sentences are enough (no more please). It needs to truly map to who you are and to where you want to go — but it also must be realistic: no vaporware. It is best for it to be neither too short term (next 1.5 years) nor too long term (next 10–15 years). I find that a 3–5 year horizon is the best. A few caveats: your career goal should probably be focused on professional objectives: discussing the fact that, for instance, you want to find personal happiness in life, is likely to be nefarious to your application (although I am sure there are exceptions).while it should be true to you, you also want to make sure that it also matches the company values and needs to which you are applying.your career goal should not reference aspects that will not meet some of the company’s hiring goals. For instance, don’t mention you want to change jobs or locations in the next 18 months: most hiring managers want to hire for longer than that.it should be reasonably ambitious — but not exceedlingly so.As for HOW to focus on the right career objective: ask yourself where professionally you would like to be in five yearsdescribe what you see in one to two sentences, following the above criteriaGood luck! ",
            "date": "Answered April 15, 2017",
            "views": "28",
            "upvotes": " View 3 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Srihari Jwalapuram",
                    "user_href": "/profile/Srihari-Jwalapuram"
                },
                {
                    "user_id": "Deepak Chouhan",
                    "user_href": "/profile/Deepak-Chouhan-96"
                },
                {
                    "user_id": "Lizel Puducay",
                    "user_href": "/profile/Lizel-Puducay"
                }
            ]
        },
        {
            "author_info": {
                "name": "Jason Barber",
                "href": "/profile/Jason-Barber-4"
            },
            "answer_text": "I’ve hired over 10,000 people in the last 10 years. I’ve never read or do I remember one single career objective ever written by a candidate. Your written career objective doesn’t matter to hiring managers. It may matter to you. And it should! Your ability to write and communicate how you get results and can solve a problem for a hiring manager is all that matters to a hiring manager. If you need to write a career objective as a matter of course then go to the LinkedIn profiles of 5–6 people you respect and copy and paste some of their content to your resume. Rework and reword the content so that it is applicable to your experience. Good artists borrow. Great artists steal. That’s the beauty of the internet. There is all kinds of great content that you can steal. Yay! Now Jason isn’t that unethical to copy and paste content from other people’s LinkedIn profile? I don’t know? One of my most favorite Healthcare IT executives is Jonathan Bush and he has this content posted on his LinkedIn profile: Bush's views on health care and the idea for athenahealth were born from failures with the earliest iteration of its business model. Bush co-founded and operated a birthing clinic with the idea of franchising a network of clinics that viewed pregnancy holistically. Bush would soon realize that his birthing clinic vision was challenged by his business' own inability to track outstanding claims to insurers and get paid in a reasonable timeframe. This challenge would shape the formation of athenahealth as it is known today. As a result of the challenges with the clinics, Bush and his partners set about designing a solution to address the costly administrative inefficiencies that plagued their business. In doing so, they came to realize their circumstance was more typical than unique and that the solution they architected had great application and utility for the broader health delivery system. Given his vision for an information infrastructure that makes health care work as it should, Bush is focused on creating a true, win-win marketplace that enables a broad and efficient exchange of health information. I can take some of the generic content from the above paragraphs and rework them into my own LinkedIn profile and resume. I’ve never worked at a birthing clinic but I can replace it with Emergency Department. You get the point. That’s how you write a career objective. ",
            "date": "Answered April 15, 2017",
            "views": "36",
            "upvotes": " View 5 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Mownesh Muniappan",
                    "user_href": "/profile/Mownesh-Muniappan"
                },
                {
                    "user_id": "Srihari Jwalapuram",
                    "user_href": "/profile/Srihari-Jwalapuram"
                },
                {
                    "user_id": "Alfredo Iglesias",
                    "user_href": "/profile/Alfredo-Iglesias-2"
                },
                {
                    "user_id": "Al Simmons",
                    "user_href": "/profile/Al-Simmons-27"
                },
                {
                    "user_id": "James Clark",
                    "user_href": "/profile/James-Clark-253"
                }
            ]
        }
    ]
}