{
    "title": "How to write an essay describing a person - Quora",
    "tags": [
        "Essay Writing",
        "Essay Writing Help"
    ],
    "response": [
        {
            "author_info": {
                "name": "Allison Moser",
                "href": "/profile/Allison-Moser-3"
            },
            "answer_text": "I normally make pals without difficulty, so I even have a variety of buddies – schoolmates, neighbours, family. I can’t consider my lifestyles without them. But there is one, who will always be within the first location in my heart. Her name is Anna and she is my closest friend. Anna is a completely lovely and fascinating girl and always draws men’ interest. She is taller than me and has instantly brown hair and deep chestnut brown eyes. Like maximum young adults she can pay a whole lot of interest to her look and likes dressing inside the latest and maximum extravagant style. I don’t think I’ve ever visible her in a T- blouse or jeans. By nature Anna is communicative and outgoing and the issue she likes great is being the centre of interest. Her biggest dream is to come to be a singer and I surely trust that in the future she’ll make her desire come real. Anna has received many prizes and has taken element in lots of concert events, because she sings in reality tremendously. As a normal human being, but, Anna additionally has her shortcomings. She by no means goes on time to her dates. Sometimes she is absent-minded and inconsiderate and that makes human beings assume she by no means takes things significantly. But this isn't genuine. She has a robust sense of responsibility and you can continually depend on her. Another characteristic she has is that she’s gregarious, touchy and emotional. She additionally receives careworn without difficulty and doesn’t neglect those who've induced her damage. The component I respect maximum about Anna is that she is defensive and loves to look after people. Believe it or no longer, once she ever saved my life! I’ll in no way overlook that day. We went swimming in a pool. Suddenly, my left leg went lifeless I couldn’t go on swimming. I lost awareness. When I opened my eyes I determined myself mendacity and Anna protecting my palms. She, herself had pulled me out of the water. That turned into a actual narrow escape from the demise, and if she weren’t there, I would have drowned. ",
            "date": "Answered July 16, 2018",
            "views": "49",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Tom Odell",
                "href": "/profile/Tom-Odell-14"
            },
            "answer_text": "I have found the list of words you can use in your essay. They are related to the parts of the body. So, you can surely use them when describing the person: Face Shape Square Oval Round Triangular Heart-shaped Thin Wide Chiseled Skin and Complexion Wrinkled: covered with lines or loose folds of skin; often associated with age Freckled: sprinkled or covered with light brown spots Ruddy: skin that has a reddish tint; may have the appearance of sunburn Sallow: skin that has a yellowish tint; may be associated with illness Tanned: skin with a warm, golden-brown tint Rosy or fresh-faced: pink-cheeked, fair complexion that glows with a hint of pink Eyes Shape, size, and appearance: large, small, almond-shaped, round, squinty, crinkly, bulging, heavy-lidded, hooded, deep-set, close-set, hollow, tear-filled Eye color: black, brown, hazel, green, blue, violet, gray, amber Eye expressions: piercing, mesmerizing, sad, sorrowful, haunted, gentle, sympathetic, warm, compassionate, expressive, bright, twinkling, lively, dancing, laughing, shifty, sly, distrusting, sleepy Other: brown-eyed boy, bright-eyed sister, wide-eyed child, gold-flecked eyes Mouth and Lips Lip shape and size: thin, full, pouting, rosebud (baby’s lips, often), pursed (puckered up, as when concentrating) Mouth expressions: laugh, smile, beam, grin, frown, grimace, scowl, sneer, curl, pout Adjectives describing the mouth or mouth expressions: toothy, toothless, gap-toothed, kind, sweet, dimpled, relaxed, firm, serious, cruel, snarling Hair How to describe a person using vivid vocabulary and good observation skillsHair color: black, brunette, brown, chestnut-brown, blond, honey-blond, golden-blond, ash-blond, fair, cornsilk, auburn, red, strawberry-blond, gray, silver, white, salt-and-pepper Texture or appearance: wispy, fuzzy, wavy, curly, kinky, frizzy, wild, untamed, unmanageable, straight, spiky, stiff, buzzed, shaved, parted, neatly-combed, tamed, cascading, long, short, cropped, dull, shiny Hair styles: braids, ponytail, pigtails, bun, messy bun, twist, bob, ringlets, flip, cornrows, extensions, bangs, buzz, layered, feathered, chopped, gelled, spiked, slicked down Lots of hair: thick, full, lustrous, bushy, coarse, wiry, stiff Little hair: thin, scraggly, fine, baby-fine, downy, wispy, limp, flat, balding, bald, bald spot, receding (gradual loss of hair at the front of the head) Treated hair: permed, dyed, bleached, highlighted, weaved, streaked, colored Facial Hair Hair: beard, goatee, mustache, soul patch, sideburns Beard growth: stubble, fuzz, peach fuzz, bristles, five o’clock shadow (describes new beard growth that’s shadowy in appearance. It’s usually more noticeable late in the day on the jaw, chin, or cheek area, but some men purposely grow five o’clock shadows.) Adjectives: bearded, bushy, stubbly, bristly, scratchy, unshaven, shaggy, whiskered, beardless, clean-shaven, smooth, trimmed, neatly-trimmed, pencil-thin Body Build: small, slim, slight, thin, lean, willowy, skinny, angular, bony, fine-boned, chunky, chubby, large, portly, plump, round, stout, pudgy, full-figured, ample, broad-shouldered, burly, solid, muscular Posture: stand, sit, slouch, flop, lean, recline, rest, stretch, sprawl, curl up, roost, squirm, arch, slump, stoop, bend, hunch, scoot, walk, run, race, jog. You may also turn for the help to the writers I know personally. Have you ever thought about using the online writing service like grand-essays.com? Their prices are not that high and the writing quality is perfect. ",
            "date": "Answered May 25, 2018",
            "views": "15",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Ely Sugg",
                    "user_href": "/profile/Ely-Sugg"
                }
            ]
        },
        {
            "author_info": {
                "name": "Abu Al Nahihan",
                "href": "/profile/Abu-Al-Nahihan"
            },
            "answer_text": "You cannot write a character sketch about anyone you do not know intimately. This person can be a member of your family, a close friend, or even a main character in a novel or movie if you loved it so much you read or saw it many times. You can select a totally fictitious person, of course, but it is probably wise to make the person at least a combination of people you know, so that your description “sounds” authentic to a reader. Most fiction writers admit that their major characters are a bit autobiographical or combinations of people they know, because they are just more believable. Also it will help you to get more ideas about what to write and you won’t get lost. If you want you may even have some sort of an interview with the person you are writing about in order to know more about them. Thus you will present them in a way more realistic and truthful way. Trustmypaper.com3 rating can give you better tips. ",
            "date": "Answered March 10, 2017",
            "views": "622",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Tap Roniart",
                "href": "/profile/Tap-Roniart"
            },
            "answer_text": "Essays take a few different forms, and those who have already answered have gone into the technical aspects of how to construct such things. I prefer to formulate this kind of writing by having a conversational tone, as if you were simply talking to someone in a coffee shop. Each style can be applied many ways, and there is no right/wrong way-only poor communication/communicators. 🙂 Try using the recorder on your cell phone and imagining that the cell phone is a good friend of yours who you can let your guard down with, and tell them the story of the essay. You don't have to worry about it being in chronological order, or missing any parts, so relax and tell someone who you know really cares about what you're going to tell them an interesting and engaging story. Let's face it; We learn not to be boring and put people to sleep as a part of our naturally fitting in socially. Take a conversational tone, one with a friendly informative feeling, and not only will you have tons of content to edit and move around, but it will be a work that you were personally attached to, not one that you are impartial and separated from. If you play this back, and some recorders let you play back at slower speeds, you can then start to write the skeleton or framework of how you want that story to be laid out, understanding that when you recorded it you were talking to someone whom you have a good relationship with, but the potential reader could be someone out of the blue who doesn't know anything at all. So you will find yourself explaining things in an essay that you wouldn't have explained where you having that chat over a cup of coffee. So just relax, and have a conversation with your recording device, imagining them to be someone in your life or not, and sit back, even close your eyes, and focus on telling a compelling and complete story. You might just astonish yourself, if you're not careful. ",
            "date": "Updated September 17, 2019",
            "views": "784",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Jessica Larson",
                "href": "/profile/Jessica-Larson-18"
            },
            "answer_text": "Elements of a Character Sketch 1. The subject: The subject may be real or imaginary. There should be some outstanding quality, feature, accomplishment, or trait that will make the subject interesting to the reader. 2. The Point of View: You may write from your own point of view, or if you have an active imagination, write from a fictional point of view, e.g., that of a close friend, a son or daughter or even a pet dog. You may also write from the third person point of view, or you may assume a \"personae\", i.e., a voice other than your own. 3. The Method: Choose a method parallel to the way you want to build up character, or parallel to the way impressions of characters are made. a. let the characters reveal themselves b. let other characters shed light on the main character c. show the way the writers themselves perceive the characters d. describe a setting in which the character appears e. give the character a name that will reveal something to the reader f. relate the character to a symbolic object or action g. present a series of scenes that reveals some change in the character. Well, you know what, If you need some kind of professional help, I would recommend you to check how can Supreme essay service help you. Hope this helps! ",
            "date": "Answered February 14, 2017",
            "views": "32",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Jenna Rodriguez",
                    "user_href": "/profile/Jenna-Rodriguez-2"
                },
                {
                    "user_id": "Shauntell Journet",
                    "user_href": "/profile/Shauntell-Journet"
                },
                {
                    "user_id": "Avinash Mishra",
                    "user_href": "/profile/Avinash-Mishra-264"
                }
            ]
        },
        {
            "author_info": {
                "name": "Don Welty",
                "href": "/profile/Don-Welty"
            },
            "answer_text": "Choose three aspects of the person you want to write about and write. Personality: persistence, expertise, ability to learn Physical features: face, body, back Abilities: mathematical ability, ability to take care of himself/herself, ability to relate to others. personality: ability to restrain anger, ability to show concern for others, depression. History: early life, young adult years, old age ",
            "date": "Answered January 18, 2017",
            "views": "23",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Asshika M Nair",
                    "user_href": "/profile/Asshika-M-Nair"
                },
                {
                    "user_id": "Ria Foster",
                    "user_href": "/profile/Ria-Foster-1"
                },
                {
                    "user_id": "July Morgan",
                    "user_href": "/profile/July-Morgan"
                }
            ]
        },
        {
            "author_info": {
                "name": "Kelly Batty",
                "href": "/profile/Kelly-Batty"
            },
            "answer_text": "There is no actual difference between the person and the tree if you say about an essay that describes something. The first thing that I can advise you - is to use proofreading or just any help from professionals here https://myessaywriting.co.uk/, or from your teacher. When you describe something, you need to understand your feelings about the subject and write all essay in either negative or positive style ( the reader should have the same feeling at the end of reading). Don’t mix physical and ethical qualities, they need to be apart and could be with the different feelings (ugly man with a good heart). In the end, you should write how you actually feel about this man (I love ugly with a good heart, for example). ",
            "date": "Answered August 8, 2017",
            "views": "18",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Davis Andres",
                "href": "/profile/Davis-Andres"
            },
            "answer_text": "First you should know about this topic well with a good information about that person so it can make easy to write about your topics. If you need help from professionals then you can visit here:- https://limeessay.com/cheap-research-papers/ ",
            "date": "Answered February 6, 2019",
            "views": "297",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Daisy Simpson",
                "href": "/profile/Daisy-Simpson-16"
            },
            "answer_text": "Hi there, If you are writing an essay on a person then you should know about that person so that you can be able to write. Write about the person personality, nature, looks etc and you are there with an essay. ",
            "date": "Answered September 27, 2019",
            "views": "92",
            "upvotes": "0"
        }
    ]
}