{
    "title": "How to write a letter to God and make it reach - Quora",
    "tags": [
        "Writing Letters",
        "Letters (mail)",
        "Creative Writing",
        "Theology",
        "Writing Advice",
        "God",
        "Christianity",
        "Writing",
        "Religion"
    ],
    "response": [
        {
            "author_info": {
                "name": "Laveeza",
                "href": "/profile/Laveeza"
            },
            "answer_text": "There is no need to write a letter, my friend :) God has created all of us and he loves us a lot. He is really close to us. God knows the inner thoughts of your subconcious mind. If you want to say something to god just open your heart and say it. Have true intentions and always believe that God hears you. If you don't get an instant fulfillment to your wish just remember that god plans the best. Whenever time is right you will get what you want and if your wish is good for your well being it will surely be accepted but when time is right. You have to be a little patient. It is all God's test. ",
            "date": "Answered July 4, 2019",
            "views": "118",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Velavan Murugan",
                    "user_href": "/profile/वेलवन-मुरुगन-Velavan-Murugan"
                }
            ]
        },
        {
            "author_info": {
                "name": "Ajay Abraham",
                "href": "/profile/Ajay-Abraham-4"
            },
            "answer_text": "Thanks for the A2A Velavan Murugan (வேலவன் முருகன்) How do I write a letter to God and make it reach? You can pray to Jehovah God and He will listen to your supplications. Psalm 65: 2 O Hearer of prayer, to you people of all sorts will come. He is only One who listens to you prayers. In order to understand Gods message to you read the Bible and meditate on it. Thank you for reading. ",
            "date": "Answered July 7, 2019",
            "views": "68",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Velavan Murugan",
                    "user_href": "/profile/वेलवन-मुरुगन-Velavan-Murugan"
                }
            ]
        }
    ]
}