{
    "title": "How does academic writing different from a letter? - Quora",
    "tags": [
        "Academic Writing",
        "Letters (mail)",
        "Writing Advice"
    ],
    "response": [
        {
            "author_info": {
                "name": "Sara Johnson",
                "href": "/profile/Sara-Johnson-126"
            },
            "answer_text": "How is academic writing different from other kinds of writing? In some ways, writing at university (i.e. academic writing) is similar to other styles of writing – e.g. business or professional writing. For example, academic writing is generally quite formal and impersonal. It is formal by avoiding casual or ‘conversational’ language, such as contractions or informal vocabulary. It is impersonal and objective by avoiding direct reference to people or feelings, and instead emphasising objects, facts and ideas. For example: \"do not\" is more formal than \"don’t\"\"very large\" is more formal than \"huge\"\"This study will investigate whether…\" is more objective than \"I want to prove to you that…\"However, even if you already have good skills for writing in a formal and objective style, that might not be enough for good academic writing. This is for three reasons. First, you also have to write technically. This means that you need to develop a large vocabulary for the concepts and objects which are specific to your discipline(s) of study – e.g. linguistics, physics, accounting. Moreover, you will need to keep developing your technical vocabulary for the specialised areas within each discipline. For example, within the discipline of linguistics, there are different technical vocabularies for the fields of phonology, pragmatics and sociolinguistics. Secondly, for each different discipline, there are not only differences in vocabulary, but also in style. For example, some disciplines (e.g. some of the Arts and Humanities disciplines) expect longer paragraphs, which include topic sentences to show how your argument is structured. In contrast, some disciplines (e.g. Sciences) expect short paragraphs, with no topic sentences, which are denser in factual information. As another example, some disciplines will accept more subjectivity (e.g. “My view is that…” ) while other disciplines avoid any use of personal pronouns (e.g. I, my, you, we). Finally, you need to use not only the right style but also the right structure. Some types of text, such as an essay, have the same basic structure in all disciplines. However, there are some genres which have a different structure in each discipline (e.g. a case study, a report). There are also genres which are only used in one specific discipline (e.g. a legal problem answer, a proof). There are many online resources, workshops and books about academic writing, which can help you develop your general skills and knowledge. However, to be a good academic writer, you will also need to keep learning the specific styles and structures for your subject area, as well as for each individual writing task. Some ways to do this are to: ask for more information from your lecturer/supervisor/tutortalk to other studentslook at the successful writing by other students in your subject areastudy the writing style of the academic articles in the most prestigious journals in your discipline.",
            "date": "Answered January 12, 2018",
            "views": "45",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Sarah Madden",
                    "user_href": "/profile/Sarah-Madden-11"
                }
            ]
        },
        {
            "author_info": {
                "name": "Marla Brunker",
                "href": "/profile/Marla-Brunker"
            },
            "answer_text": "A letter can be anything you want, to anyone you want, for whatever reason you want. In contrast, an academic article is specifically intended to present information (or at least, a very well-supported point-of-view) to an academic journal and its readers. It must therefore be prepared and formatted according to the journal’s guidelines [1], and its findings and conclusions must be supported sufficiently well to satisfy peer reviewers (possibly after some rewriting and additions). Not only should the writing be formal, but the journal usually has specific expectations regarding formatting and the order in which the information is presented. (The latter is especially true of research articles—i.e., title page, abstract, keywords, introduction methods, results, discussion, acknowledgements, disclosures, references, figure legends, and tables, usually in that exact order, with the illustrations submitted separately [2]. Review articles have more leeway.) _____[1] Journals tend to be very persnickety about how submissions are prepared. This may seem petty, but they want manuscripts that need as few changes as possible before publication. If the authors don’t handle these details themselves, then someone at the journal has to do it… …and that’s not going to happen. [2] Why, yes, I do edit science papers for a living. What tipped you off? ",
            "date": "Updated September 8, 2020",
            "views": "18",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Ma. Theresa Solomon",
                    "user_href": "/profile/Ma-Theresa-Solomon"
                }
            ]
        }
    ]
}