{
    "title": "How to write a three paragraph essay - Quora",
    "tags": [
        "Paragraphs",
        "Essay Writing Help",
        "Essays",
        "Writing Advice"
    ],
    "response": [
        {
            "author_info": {
                "name": "Jennifer Grotpeter",
                "href": "/profile/Jennifer-Grotpeter"
            },
            "answer_text": "A 3 paragraph essay is simply a shortened version of a 5 paragraph essay and follows the same formula. If you stick to the formula you will be fine. First sentence of first paragraph- something to catch the readers’ attention (don't quote the dictionary or use a cliche). Add some details, then the last sentence of the 1st paragraph is your thesis statement. This is your paper and thus your thoughts. Therefore, you never need to say anything in first person like “I think hedgehogs are the best pet ever.” Just say “Hedgehogs are the best pet for kids,” or Hedgehogs are the best pet for apartment dwellers,” or if we are literary “Moby Dick is the worst book in the American literary canon,” or “In her Harry Potter book series, author Rowling makes frequent use of water symbolism.” Paragraph two should contain three (three, two is too few, four is too many, five is right out) back up points for your thesis. If I were writing on Harry Potter, I would pick three times where Harry encounters water, If I were writing about Hedgehogs, I would find 3 reasons they are great pets. It would look something like this: Rowling makes frequent use of water throughout the series, but the symbolism shifts in different circumstances. (TOPIC SENTENCE) For example (transitional phrase!), in the Goblet of Fire, Harry must rescue his friend from the depths of the lake. (Set up main idea) The friends are not in any danger, but Harry doesn't know this and rescues more than just his assigned friend, for which he is rewarded (what happened). After this event, he is changed both in how he is perceived by others and how he sees himself, paralleling the impact of Christian baptism by water (this is the main point; if I were writing a much longer essay, I would write a ton on this and flesh it out, but I am not, so I stick to the formula and move on). Next sentence is Set Up again, so I would write “Later (chronological transition!) in the same book, Lord Voldemort is re-born from a bubbling cauldron (set up). Harry attempts to will the water not to boil (use the actual quote here, but I don't have my book handy), but it is futile and Voldemort emerges fully grown and reptilian from its depths(what happened). Here, the baptismal symbolism is reversed, the potion water is not the warm loving amniotic fluids of a Mother, nor is it the blessing of a baptismal font, rather it is evil born again (main point).” Time for the third point, so I would write “Watery baptism is not reserved for the main characters, however (I am referring back to my two previous examples to smooth my transition here in this set up), as Ron Weasley discovers in Deathly Hallows. Ron returns to his friends after some estrangement, dives into an icy pool to save Harry (returning the favor from Goblet of Fire, only this time the danger was real) and retrieves the Sword of Gryffindor (what happened). Ron now has evolved more than any character in the book and emerging from the icy water finds him not a petulant boy, plagued by self-doubt and envy, but an adult man, ready to face his fears and stand with his friends; his chilly baptism may be the most significant of the three (the point).” Move on to your conclusion now- easy peasy. Rephrase your thesis statement as the first sentence. Add something interesting after that, but No New Information. Add a quote from the book, something to make this conclusion at least two or three sentences long, but don't wander off into the lake of the Inferi, or how ferrets are almost as good as hedgehogs. Done! After you check your spelling and grammar, of course. ",
            "date": "Answered December 26, 2016",
            "views": "39",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Jessie Zhu",
                    "user_href": "/profile/Jessie-Zhu-57"
                },
                {
                    "user_id": "KoTay",
                    "user_href": "/profile/KoTay-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Saptarsi Sengupta",
                "href": "/profile/Saptarsi-Sengupta"
            },
            "answer_text": "Ya You can write it easily. First, break your total content of essay into three parts- Introduction, Body and Conclusion. Now, start writing the first paragraph with your introductory lines. Carefully notice that these lines should cover first half of your first paragraph, the second half should contain lines which You have intended to write in the body part. After completing the first paragraph, go for the second one and write it fully with lines from the body part. Then, cover first half of the third paragraph with lines from the body part, and cover the second one with lines from the conclusion part. But remember ,don't mistakably finish the essay in a single paragraph-just like my answer……….Best of luck ",
            "date": "Answered December 26, 2016",
            "views": "11",
            "upvotes": "0"
        }
    ]
}