{
    "title": "How quickly can you write a 50,000 word novel? - Quora",
    "tags": [
        "Breaking in as a New Author or Novelist",
        "Creating Writing Advice",
        "Novel Writing",
        "Book Writing",
        "Creative Writing",
        "Novels",
        "Writers and Authors",
        "Writing Advice"
    ],
    "response": [
        {
            "author_info": {
                "name": "Jo Roderick",
                "href": "/profile/Jo-Roderick"
            },
            "answer_text": "I’m going to answer this from personal experience, and also because the people saying it will be ‘crap’, are those that — for some reason — are unable to do it themselves. With Six For Seven, I wrote, edited, did the book covers, the typesetting for print and electronic eBook formatting, had it independently edited, and published in 25 days. If I remember correctly (I can’t check at the moment), it’s about 66k words. I didn’t wait for the editor, for example. I was already busy with the covers, the formats, and the promotional material. This book is proof that it can be done, not that it should be done this way. I didn’t set out to break any records. It just went very well. This happens when you write what you want, and not something because it’s a product to sell. It’s a very quirky book that has only ever received one bad review while it was on Amazon. I can write over 10 000 words in one day, but that is the exception. I normally aim for 3000–5000 a day … when I write. I only write when I want to. Last year, I wrote two books in a few months, but I haven’t published them. When inspired, sometimes I will write for as long as 12 hours or more. This is how these things get done for some of us. A book isn’t good or bad because of how long it takes you to write it. Alex Boast, thanks for the A2A. The original question was: How quickly can you write a 50,000 word novel? ",
            "date": "Answered May 20, 2020",
            "views": "344",
            "upvotes": " View 6 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Lisa Dooley Fisk",
                    "user_href": "/profile/Lisa-Dooley-Fisk"
                },
                {
                    "user_id": "Harvey Ardman",
                    "user_href": "/profile/Harvey-Ardman-1"
                },
                {
                    "user_id": "Rob Wanless",
                    "user_href": "/profile/Rob-Wanless-3"
                },
                {
                    "user_id": "John Hudson",
                    "user_href": "/profile/John-Hudson-158"
                },
                {
                    "user_id": "Rayshan Dewnarain",
                    "user_href": "/profile/Rayshan-Dewnarain"
                },
                {
                    "user_id": "Alex Boast",
                    "user_href": "/profile/Alex-Boast-4"
                }
            ]
        },
        {
            "author_info": {
                "name": "Lily Potter",
                "href": "/profile/Lily-Potter-63"
            },
            "answer_text": "Okay, so, I actually wrote a 127,000 word novel in about 3 months— and that was where I spend almost all of my free time writing and not going back, just continuing on and on, so let’s assume I could have hypothetically written 50,000 words in, oh, one month. Let’s rephrase the question. How quickly can I write a good 50,000 word novel? Because let me tell you, that one I wrote in 3 months? Absolute trash. I wrote it two years ago. I renovated it and changed it up quite a bit about a year back. You know what I just started doing a couple of days ago? Re-reading and editing it again. It’s not trash anymore. It’s actually comprehensive narrative and whatnot. I’ve been adding more body language to the dialogue, so it’s not so stiff. Anyway. Easier. I wrote what I would consider to be a pretty good 60,000 word novel more recently, which is much closer to the 50,000 words in the question. I did that one a chapter a week, with one week missed when I was really busy. It’s about 23 chapters long, so I did it in 24 weeks. The main difference here is that I spent more time on it, and had the time to re-read chapters as I wrote the new ones, had more time to edit what I already had to be better. While I will doubtless edit it as my writing skills improve, I won’t edit it as heavily as I have been my bigger novel because, well, it’s already better. So, short answer? A hypothetical month, but it would be trash, or, a hypothetical five months with a much better result. ",
            "date": "Answered July 1, 2020",
            "views": "73",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Lisa Dooley Fisk",
                    "user_href": "/profile/Lisa-Dooley-Fisk"
                }
            ]
        },
        {
            "author_info": {
                "name": "Janet Fitch",
                "href": "/profile/Janet-Fitch-3"
            },
            "answer_text": "How quickly can I, the writer that I am, write a short novel? I could probably TYPE the first draft of a short novel, 50,000 words, 180 pages, in six months, if I had a very clear idea of the story—if it was say, autobiographical. But I wouldn’t consider it a finished novel. It might surprise you, but it can be harder to write short than long—to get one’s complete thoughts down, the full action, in a few beautiful strokes of the pen. I admire people who can write elegant short books—Marguerite Duras’ the Lover is a thing of beauty. Joan Didion’s Play it As It Lays. Jean Toomer’s Cane. Kozinsky’s Being There, Annie Dillard’s The Maytrees. It’s interesting that Didion and Duras were both screenwriters. For me, cutting is ferociously difficult, takes a lot of insight and some stamina. But many writers do write quite quickly. Most are genre writers, responding to the needs of certain kind of reader. Simenon, the French mystery writer, could write a book in 6 weeks. In America, many mystery writers have to turn out a book a year. Romance writers—writing to formula—often write a book every two months. Genre readers are very specific as to their needs, and very tolerant as to what is a ‘novel’ let alone a ‘good novel.’ ",
            "date": "Answered May 27, 2020",
            "views": "152",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "David De Jesus Oliveira",
                    "user_href": "/profile/David-De-Jesus-Oliveira"
                }
            ]
        },
        {
            "author_info": {
                "name": "D.L. Zaragoza",
                "href": "/profile/D-L-Zaragoza"
            },
            "answer_text": "Right now, my life is full and happy…so I don’t have a lot of time for writing, but since the virus that must not be named has struck and I’ve spent more time in lockdown than in commute, my writing has happily progressed a little faster. I tend to write 500–1000 words a day these days, so if my math is correct, that’s a 50,000 word first draft in approximately 50–100 days or around four months on the outside. My current work in progress is around 65,000 words and showing no signs of stopping yet. I think each of the novels in my trilogy might run about 100k each. Fifty thousands words sounds positively cute at this point. You have to realize though, that a first draft is not a novel. After that, there’s at least six passes of editing, then beta reading, then more edits. Then, it’s ready to send out to publishers to see if someone wants to make it a novel. So a finished novel would take significantly longer than four months to write. Sometimes I think to my creative papa, Ray Bradbury, and marvel at how he cranked out the rough draft for Fahrenheit 411 in like, a month. I am not that prolific, and I’m okay with that. It’s no good scouring your brain at top speed to write a book if you aren’t enjoying the process. Life = too short. ",
            "date": "Answered June 8, 2020",
            "views": "59",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Sonia Randhawa",
                    "user_href": "/profile/Sonia-Randhawa-3"
                }
            ]
        },
        {
            "author_info": {
                "name": "Nancy Norbeck",
                "href": "/profile/Nancy-Norbeck"
            },
            "answer_text": "Why are you so fixated on speed? Writing a novel is a marathon, not a sprint. Anyone who says otherwise is selling something. There are people who would ask a marathoner how quickly they can run a marathon, and sure, for some runners, time matters, but a lot of others are a lot more concerned with finishing than breaking some sort of arbitrary record. Writing is not widget-making. It doesn’t happen on an assembly line on a particular schedule. It takes time to plan (are we including planning here, or just assuming that a novel springs fully formed from the author’s mind?). It takes time to revise. It needs time to sit for a while so the author can come back to it with fresh eyes. There’s the time it takes someone else to read it and offer feedback. Then more revision, and perhaps an agent or editor gets involved. Lather, rinse, repeat. It takes as long as it takes, and that’s all there is to it. It’s not like challenging yourself to paint a house in a weekend, just to see if you can do it. Sure, people do National Novel Writing Month and churn something out in 30 days, but the goal there is 50,000 words, which is pretty short for a novel, and doesn’t involve anything but getting those words on paper. No revision, no editing, no nothing, because the only thing you have time for to hit that goal in 30 days is pure writing. (And if you think anyone has a publishable novel at the end of that month, I have some oceanfront properly in Kansas you might be interested in.) If you’re thinking about writing a novel, just sit down and start writing. Don’t get hung up on how long it’ll take, because it’s always going to be longer than you think when you start. If time is your only concern, be okay with writing a bad novel, because you won’t have the patience to make it good. If you’d rather write a good novel, decide it’s going to take as long as it takes, and be okay with that. Good luck! ",
            "date": "Answered May 30, 2020",
            "views": "119",
            "upvotes": " View 4 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Sarah Moran",
                    "user_href": "/profile/Sarah-Moran-38"
                },
                {
                    "user_id": "Laura White",
                    "user_href": "/profile/Laura-White-28"
                },
                {
                    "user_id": "Isac Galvao",
                    "user_href": "/profile/Isac-Galvao"
                },
                {
                    "user_id": "Raymond van Over",
                    "user_href": "/profile/Raymond-van-Over"
                }
            ]
        },
        {
            "author_info": {
                "name": "Mike Sweeney",
                "href": "/profile/Mike-Sweeney-135"
            },
            "answer_text": "Almost certainly the wrong question. As the others have put it, the question is more of how rushed a job are you willing to put up with? There’s also a question of how you measure start to finish. Less than half the time is spent in actually putting words on the page. Roughly speaking, there’s four different tasks that go into writing a novel. Brainstorming, planning, writing, editing. Make it five if you want to talk about the publishing process, including the effort of, say, sending out queries and drafts and waiting for reply. The brainstorming phase is when you are putting together ideas. You might say, “Got an idea already, let’s go.” But that’s not where brainstorming ends. It also involves gathering sufficient elements to fill a novel. And it includes figuring out how you are going to dramatize them. This shades into planning/outlining. The more you pre-plan, the faster the actual writing can be. But is that a net saving or not? The thing is, the early parts of this work — the brainstorming, the research, the synopsis — can be done while you are writing something else. So the measure of “how long does it take to write this one book?” Is a little nonsensical when you are talking about the process of a working writer. (The same goes for editing, and especially for publication.) Editing, too, is hard to measure. It is best done after a pause, and do you include the pause in your estimate? Rush to edit, skimp on the edit, count only time until first draft and, sure, you can make the numbers look better. But, again, are we after the numbers, or after a book that people will want to read?  So last year I set out to put a novel on Kindle before the year was out. I made it with a month to spare. But… It was under-edited. I’d been working on the ideas for years before that. But on the other hand, it also could have been less ambitious. ",
            "date": "Answered May 20, 2020",
            "views": "85",
            "upvotes": " View 2 Upvoters ",
            "upvoters": [
                {
                    "user_id": "John Hudson",
                    "user_href": "/profile/John-Hudson-158"
                },
                {
                    "user_id": "Wendy Waters",
                    "user_href": "/profile/Wendy-Waters-3"
                }
            ]
        },
        {
            "author_info": {
                "name": "Kevin McLaughlin",
                "href": "/profile/Kevin-McLaughlin-170"
            },
            "answer_text": "I’ll answer, but first some caveats. I’m sixty+ novels into my career. Please don’t compare what I am doing now with what a novice does in their first few books, ok? :) Also, I write novels full-time. It’s my day job. Comparisontitis sucks. Don’t get caught in that trap. I average about 2000-2500 words per hour, which means a fifty thousand word novel takes me about 20–25 hours of typing to finish. I often will do that over the course of a week or so. Sometimes a month, but I never write less than 50k a month these days. I’ve also trained myself to write fairly clean. As a result, I don’t have to do revisions. I write the book and send it immediately to my editor. She goes over it, I get it back and look over the typos and such she caught, and then it gets published. Thats fast, but I know some writers who manage 4000–5000 words per hour via dictation. Writing a book is a bunch of work, but mostly it is about the discipline to sit down and do the work - and building the storytelling skills that will let you write books people want to read. ",
            "date": "Answered May 23, 2020",
            "views": "78",
            "upvotes": " View 3 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Heena Rathore",
                    "user_href": "/profile/Heena-Rathore-4"
                },
                {
                    "user_id": "Shoshanna Gabriel",
                    "user_href": "/profile/Shoshanna-Gabriel"
                },
                {
                    "user_id": "Rob Wanless",
                    "user_href": "/profile/Rob-Wanless-3"
                }
            ]
        },
        {
            "author_info": {
                "name": "Harvey Ardman",
                "href": "/profile/Harvey-Ardman-1"
            },
            "answer_text": "First, 50,000 words is pretty short for a novel. Aim for about 80,000 words Second, how good do you want it to be? Crap can be written pretty quickly. You don’t give it much thought, you don’t rewrite or even polish. Quality takes longer, in my experience two or three times as long. Third, if speed is your only measure, you should be able to do it in a month of eight-hour days. But for me, it takes longer. I can easily spend a month on an outline and another three-four months on the actual writing. The journalist A.J. Liebling once said, “I can write faster than anyone who can write better than I can and I can write better than anyone who can write faster.” But is speed the measure by which you want to be judged? ",
            "date": "Answered May 26, 2020",
            "views": "202",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Juliet Mean",
                    "user_href": "/profile/Juliet-Mean"
                }
            ]
        },
        {
            "author_info": {
                "name": "Barry Lancet",
                "href": "/profile/Barry-Lancet"
            },
            "answer_text": "Every author I know has a different pace. Since you have asked about length, I must mention that length tends to vary by genre/subgenre, though there is no hard, fast rule (though some editors have preferences, which I wouldn’t worry about too much). Most of the authors in the mystery & thriller genre tend to write between 80k to 100k. Some go over, some finish under. Those in the romantic suspense & cozy genre often center around 50k. Fwiw, there is no rule. It is whatever it takes to tell the story. So with that in mind, some v good genre writers I know can do two books a year (at their chosen length). I do one book a year once I have a clear idea of where it’s going, even if I don’t yet have all the details in mind. I tend to rewrite and edit extensively after the first draft, and sometimes during a first draft. I don’t like to let the ms go until I’m very happy with it. Some good authors will do 2.5 to 3 books a year, but this pace is not common. And sometimes the higher book count comes in spurts. Romantic suspense writers crank them out. The genre demands it. All that said, first-time writers generally take more time, and require more time, as they are not only writing a book but also finding their voice and style. Hope this helps. ",
            "date": "Answered June 16, 2020",
            "views": "44",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Shana Chen",
                    "user_href": "/profile/Shana-Chen-3"
                }
            ]
        },
        {
            "author_info": {
                "name": "Avakhon Khinsharri",
                "href": "/profile/Avakhon-Khinsharri"
            },
            "answer_text": "Easy Answer- On what topic? Genre specifics are needed to answer this type of question. I just released a Dark Noir detective novel set in 1877 Victorian England that’s around 100,000 words. The writing took a couple of months as it was submitted to a group for approvals, and used in a contest. Afterward, I collected those postings, put them into context for a story, edited them for proper formatting and terms. (Can’t have a Sherlock Holmesian detective using a cell phone now can we?) then got it ready for publication. I just released it about 4 days ago. It details the adventures of characters that have unique and very different types of backgrounds than what is normal. While the creative process was fast and furious, the writing took the time necessary as it was, as I said, a submission for a contest I had entered. Hard Answer- Word counts are NOT what determines the time it takes. Too many are concerned with this as they presume a PAY per word situation. THOSE are prevalent in print media, such as magazines, newspapers, and public blogs. As a writer/author, you aren’t PAID per word, so a word count has little value to your considerations for a novel. Writing what is good, quality prose, and involving character development is what’s needed. Look at some of the greatest for your inspirations. READ something by Shakespeare, H.G. Wells, Jules Verne J.R.R.Tolkien, Isaac Asimov, Arthur C. Clarke, and any number of others in whatever genre you choose to find out what WORKS and why it does. Then find YOUR own version of this to make it work for you. Concentrating on word counts is self-defeating. I can crank out tons of words, but do they make a coherent, cohesive story that draws the reader into it? Probably not. Just like my answers here, I try to engage the questioner and look for others to reply with insights and experiences they share. ",
            "date": "Answered June 7, 2020",
            "views": "48",
            "upvotes": " Answer requested by Alex Boast",
            "upvoters": [
                {
                    "user_id": "Heena Rathore",
                    "user_href": "/profile/Heena-Rathore-4"
                }
            ]
        },
        {
            "author_info": {
                "name": "Charlie Aylett",
                "href": "/profile/Charlie-Aylett"
            },
            "answer_text": "Every November, thousands of writers write 50000 words in thirty days in a thing called Nanowrimo. However, that would be a first draft. Revising and editing could take any amount of time, depending on your experience, how strong the idea is, how much research is required, on your time management and to what level of quality you intend it to reach. In other words, there's no one-size-fits-all answer to your question. Lee Child starts a new novel every September, but he has years of copywriting experience before he became a novelist and now has a whole team behind him to read through the manuscript and flag any inconsistencies or other areas that require editing. That would cut down his production time quite considerably. And if they are all Jack Reacher novels, he has the added advantage of knowing his main character inside out, which makes the creation process much easier. Still, if a fully revised and edited story came in completed at 50k words, it would fall under the scope of being a novella, not a novel. A novel usually hits the 65k mark as a minimum, though the ideal size is between 75–90k. Writing the first 50k is just the start. Do not underestimate the need to revise and edit, especially if you are an inexperienced writer. ",
            "date": "Answered June 21, 2020",
            "views": "98",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "John Hudson",
                    "user_href": "/profile/John-Hudson-158"
                },
                {
                    "user_id": "Thomas Weaver",
                    "user_href": "/profile/Thomas-Weaver-10"
                },
                {
                    "user_id": "Raymond van Over",
                    "user_href": "/profile/Raymond-van-Over"
                }
            ]
        },
        {
            "author_info": {
                "name": "Stan Marshall",
                "href": "/profile/Stan-Marshall-25"
            },
            "answer_text": "Not to be flippant or rude, but one could conceivably do it in one day. The odds of it being anything worth reading are probably 1 in a billion. Speed is not the issue unless you have some sort of a hard deadline. Writers come in all speeds. Some are always fast (Not 50,000 word a day fast), some are slow, and some are fast one minute, hour/day/month/year and slow the next. We all have good days and bad. Productive and unproductive. I believe passion for the story should dictate your schedule unless you are experienced, writing to pay the rent, and no longer writing for your own pleasure. ",
            "date": "Answered May 20, 2020",
            "views": "79",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Shana Chen",
                    "user_href": "/profile/Shana-Chen-3"
                }
            ]
        },
        {
            "author_info": {
                "name": "Edward Eaton",
                "href": "/profile/Edward-Eaton-2"
            },
            "answer_text": "From conception to conclusion. If my wife and kid are visiting her mother? I can do 50K in about two weeks. That would be a first draft. It might include a polish. I’m not going to say it will be ‘finished’. Nothing I write is finished until the final proofs are sent to the publisher. However, I’m not going to fall into that old saw of ‘first drafts of course suck.’ There are any number of cases of some work that was brilliant and was written fairly quickly without much in the way of drafting. But, yeah, if I have nothing else to do but write, I can do 50k in about two weeks. Or, rather, I once did about 120K in 4. ",
            "date": "Answered June 30, 2020",
            "views": "54",
            "upvotes": " Answer requested by Alex Boast",
            "upvoters": [
                {
                    "user_id": "Sefa Kuyumcu",
                    "user_href": "/profile/Sefa-Kuyumcu"
                },
                {
                    "user_id": "Dan Vincent-Schaub",
                    "user_href": "/profile/Dan-Vincent-Schaub"
                }
            ]
        },
        {
            "author_info": {
                "name": "Joe Weinberg",
                "href": "/profile/Joe-Weinberg-10"
            },
            "answer_text": "Based on my history, the fastest I’ve ever done it was 11 days. That’s a faster pace than I like, but it can be done. Easier if I didn’t have to work. Assuming I didn’t, and could stay motivated and inspired, I’d say 10–12 days per novel, 2 per month. (Extra time for calming down and taking a bit of a break). Now, the real question: how good would it be? I like to think it was pretty good. But no matter how good it is, that’s just the first draft. At maximum output, with nothing else requiring my time and professional energy, I think I could probably pump out 6–10 solid novels a year at that length. But it doesn’t matter; my speed isn’t important. Only yours. ",
            "date": "Answered June 11, 2020",
            "views": "53",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "John Hudson",
                    "user_href": "/profile/John-Hudson-158"
                },
                {
                    "user_id": "Wendy Waters",
                    "user_href": "/profile/Wendy-Waters-3"
                },
                {
                    "user_id": "Mark DeCoursey",
                    "user_href": "/profile/Mark-DeCoursey"
                },
                {
                    "user_id": "Thomas Weaver",
                    "user_href": "/profile/Thomas-Weaver-10"
                },
                {
                    "user_id": "Chester Davis",
                    "user_href": "/profile/Chester-Davis"
                }
            ]
        },
        {
            "author_info": {
                "name": "Skai Heim",
                "href": "/profile/Skai-Heim"
            },
            "answer_text": "I’m not sure if I’ve ever written a 50,000 word novel, but if you combine what I have from one of my longest stories on my Wattpad, I’m sure it’s close to 50,000 words. I also don’t usually keep track of how long it takes me to write something, I guess I really only do that when I do the NaNoWriMo contests every few months or so. Then I can usually hammer out a couple thousand, at most 10,000 or so word stories within a month ",
            "date": "Answered June 29, 2020",
            "views": "42",
            "upvotes": " Answer requested by Alex Boast",
            "upvoters": [
                {
                    "user_id": "Rob Wanless",
                    "user_href": "/profile/Rob-Wanless-3"
                },
                {
                    "user_id": "John Hudson",
                    "user_href": "/profile/John-Hudson-158"
                },
                {
                    "user_id": "Frederik Kreijmborg",
                    "user_href": "/profile/Frederik-Kreijmborg"
                }
            ]
        },
        {
            "author_info": {
                "name": "Lucas Schmidt",
                "href": "/profile/Lucas-Schmidt-21"
            },
            "answer_text": "It takes about a month to two months. Here are some short novels that took a short amount of time to complete: Jack Kerouac wrote “On the Road” in about a month. “As I Lay Dying” by William Faulkner took two weeks. “A Clockwork Orange” took three weeks. I write about 1,000 words an hour, so that’s only about two hours of writing a day to write one book a month. I usually write a book a month, but I only like about one out of three books I write. Writing is fun, difficult, stressful, and I love it. It’s best to not take the first draft too seriously. It’s serious, but mistakes can always be corrected in the later drafts. I just wrote a science fiction book for the first time, but it was terrible. I realized I had a much better idea, which involves scrapping the entire book and writing about a time before the events in the current novel. Oh, well. You learn and get better over time. Some say writing books will get easier over time; some say otherwise. It doesn’t matter to me. I’ll write forever. ",
            "date": "Updated June 21, 2020",
            "views": "46",
            "upvotes": " Answer requested by Alex Boast",
            "upvoters": [
                {
                    "user_id": "Alex Boast",
                    "user_href": "/profile/Alex-Boast-4"
                }
            ]
        },
        {
            "author_info": {
                "name": "Trevor Locke",
                "href": "/profile/Trevor-Locke-3"
            },
            "answer_text": "How is the novel to be written? On a typewriter? On a computer? On on sheets of paper using a pencil? Each method takes a different span of time. Writing ‘quickly’ should not be your objective. You should write carefully, thoughtfully and be prepared to edit any piece several times before it is considered to be finished. As a wild guess, I would say a novel of 50,000 words could not be finished in under two years. ",
            "date": "Answered May 26, 2020",
            "views": "39",
            "upvotes": " Answer requested by Alex Boast",
            "upvoters": [
                {
                    "user_id": "Judy Mail",
                    "user_href": "/profile/Judy-Mail"
                }
            ]
        },
        {
            "author_info": {
                "name": "Howard Berg",
                "href": "/profile/Howard-Berg-3"
            },
            "answer_text": "I can write a 50,000-word novel in less than 8 hours. Using brain-based learning strategies, I enter a creative state where I am inflow. Most people can learn to write a 60-page e-book in a few hours. Do this for several more hours and you have a full book. I typically write non-fiction. My last book took 5 hours to write and went to #1 on Amazon the next day. ",
            "date": "Answered May 28, 2020",
            "views": "151",
            "upvotes": " View 2 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Phil Boyd",
                    "user_href": "/profile/Phil-Boyd-25"
                }
            ]
        },
        {
            "author_info": {
                "name": "Dave Payton",
                "href": "/profile/Dave-Payton-1"
            },
            "answer_text": "Thanks for the A2A. Not very quickly at all. Of course, writing a novel has multiple facets to it. It’s not just a matter of typing up a story, and hitting “publish”. You have to plan the nuances of the story, you have to ensure the quality of the writing, and you have to ensure it’s balanced enough so that your readers won’t get bored. To be honest, I think most of my work is going to be centered around Novellas specifically, because they’re a decent length for me as a writer. Although my current project has a goal of 50K words. ",
            "date": "Answered June 2, 2020",
            "views": "30",
            "upvotes": " Answer requested by Alex Boast",
            "upvoters": [
                {
                    "user_id": "G M",
                    "user_href": "/profile/G-M-1460"
                },
                {
                    "user_id": "David Asher-Grace",
                    "user_href": "/profile/David-Asher-Grace"
                }
            ]
        },
        {
            "author_info": {
                "name": "Tony K Boatright",
                "href": "/profile/Tony-K-Boatright"
            },
            "answer_text": "Writing 50,000 words is no problem. Editing 50,000 words into a story worthy of publishing is a whole different question. My first draft usually comes in between 35,000 and 50,000 words. It is just a brain dump to get the basic storyline written where I can begin to change it from an idea to a captivating story. What a writer puts out must always be quality over quantity. How much can you write? How fast can you write? Both are irrelevant details. The important question is how well can you write? The answer to that is usually based on how well can you edit what you write. ",
            "date": "Answered June 7, 2020",
            "views": "50",
            "upvotes": " Answer requested by Alex Boast",
            "upvoters": [
                {
                    "user_id": "Erica Hoh",
                    "user_href": "/profile/Erica-Hoh"
                }
            ]
        },
        {
            "author_info": {
                "name": "Heidi Kortman",
                "href": "/profile/Heidi-Kortman"
            },
            "answer_text": "Probably not as quickly as you can. I have a handicap that affects the flexibility of my left hand, so my typing speed has never been an asset to qualify me for employment. That said, I’m firmly convinced that the most important thing about writing fiction is taking the time, and energy to polish every other skill needed to produce an excellent story. Focusing on speed is more likely to produce work with errors and weak spots left in. ",
            "date": "Answered May 25, 2020",
            "views": "36",
            "upvotes": " Answer requested by Alex Boast",
            "upvoters": [
                {
                    "user_id": "John Hudson",
                    "user_href": "/profile/John-Hudson-158"
                },
                {
                    "user_id": "Wendy Waters",
                    "user_href": "/profile/Wendy-Waters-3"
                }
            ]
        },
        {
            "author_info": {
                "name": "Clifford Heseltine",
                "href": "/profile/Clifford-Heseltine"
            },
            "answer_text": "An accomplished writer can create 10,000 words per day. In theory, then, he could write that novel in 5 days. It would most likely be crap. In a novel you are looking for quality (at least most of us are), not quantity. You may get your concept on paper in 5 days but proofing and editing and other adjustments/corrections take time. Getting the story on the page might go quickly. Getting it in shape to publish may take a bit longer. Note: I read a lot of fiction, mostly by well known and respected authors. Even then, once in a while, you will run across an unsatisfactory ending in the last few chapters and you know he was up against a publisher's deadline and just cranked out an ending to the story to get it done , not get it right. Don't do that. Don't rush it. Speed of production is not the measure of a good writer. Quality of production is. ",
            "date": "Answered May 20, 2020",
            "views": "348",
            "upvotes": " View 5 Upvoters",
            "upvoters": [
                {
                    "user_id": "John Hudson",
                    "user_href": "/profile/John-Hudson-158"
                },
                {
                    "user_id": "Darrell Blank",
                    "user_href": "/profile/Darrell-Blank"
                }
            ]
        },
        {
            "author_info": {
                "name": "Liz Milne",
                "href": "/profile/Liz-Milne-4"
            },
            "answer_text": "Assuming someone else is paying the bills and I can spend all day just writing - probably a week - two weeks would be preferable tho. If you want it proofed and edited and all the revisions and rewritten bits sorted, probably closer to two months. That timeframe would probably be approximately the same for novels up to 100k (the bigger word count would allow for looser and therefore quicker writing). ",
            "date": "Answered May 30, 2020",
            "views": "35",
            "upvotes": " Answer requested by Alex Boast"
        },
        {
            "author_info": {
                "name": "Melissa Swenka",
                "href": "/profile/Melissa-Swenka"
            },
            "answer_text": "This would all depend on how many words an author could compose per day, or even per hour. NaNoWriMo (National Novel Writing Month, celebrated in November) helps an author create a 50,000-word manuscript in one month’s time—establishing a daily writing goal of 1,667 words. However, if the author can write 10,000 words per day, they could have a 50,000-word novel in just 5 days. ",
            "date": "Answered July 11, 2020",
            "views": "47",
            "upvotes": " Answer requested by Alex Boast"
        },
        {
            "author_info": {
                "name": "Daniel Reed",
                "href": "/profile/Daniel-Reed-38"
            },
            "answer_text": "Writing 50000 words takes about 30 days, if I make time for it. With a decent plan, that is. I'm not a full-blown planner, but I like to work with rough outlines and summaries. Typically, I would set out about an hour a day for writing. In that time and depending on how much is in my head, I'll write about 2000 words. I can do 10000 in a day (8 hours, including meal and short breaks) if I focus on it and ignore everything else. The 30 days also makes time for having a bad day, or a 0 count day. Editing is a whole different story, though. I like to self-edit (read: I have no budget to pay an editor), and that's a much longer process. About 3-4 hours per 2000 words. Thanks for the A2A. ",
            "date": "Answered May 27, 2020",
            "views": "45",
            "upvotes": " Answer requested by Alex Boast"
        },
        {
            "author_info": {
                "name": "John Hedtke",
                "href": "/profile/John-Hedtke-2"
            },
            "answer_text": "There’ve been a few cases where mass-market books have been turned out in a weekend. It’s not been great writing, it’s not necessarily even been >good< writing, but it was a story and it played more or less. :) Robert Silverberg in his classic essay “My Life as a Pornographer” (link below) talks about how he was cranking out 50,000 word novels every 6 days for 5 years. Was it great fiction? No. But it was fiction and it sold very well. He learned a great deal from the experience about dialog, plotting, scene setting, and TYPING! I Wrote 150 Porno Novels in Five Years ",
            "date": "Answered May 20, 2020",
            "views": "119",
            "upvotes": " View 3 Upvoters"
        },
        {
            "author_info": {
                "name": "Hannah O'Donnell",
                "href": "/profile/Hannah-ODonnell-12"
            },
            "answer_text": "The amount of time I take depends on certain factors: How much research will need to take place prior/during working on the novel.How much creative freedom I’m allowed with the novel.How many other projects or responsibilities require my attention whilst writing the novel.To name a few. However, my collection of short stories FATLIP is 40,000 words and took three months to write in between other projects. ",
            "date": "Answered August 20, 2020",
            "views": "39",
            "upvotes": " View 1 Upvoter "
        },
        {
            "author_info": {
                "name": "Jo Ann Ruth",
                "href": "/profile/Jo-Ann-Ruth"
            },
            "answer_text": "I don’t know if you mean ‘finish with all the editing and everything’ by write, but I have managed to just get all the words down for a book twice that length in like 4 months. If you have a plot worked out (I’m assuming for a fiction book) depending on your writing speed it could take anything from 2 months, to 4 months, just to get the words down. For editing, it could take double that, to get all the kinks out, change the wording to get emotions across better, etc. The better you want it to be, the longer you would work on it. As a rough estimate, it could take you 6 months to a year to get it ready to be handed over to a publisher. ",
            "date": "Answered May 22, 2020",
            "views": "55",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Nicole A.D.",
                "href": "/profile/Nicole-A-D"
            },
            "answer_text": "It takes me a while. Since I mostly write a 1000 to 2000 words a day. So it takes me a while to get to 50,000. With Novels I tend to plot, research, and outline. And it makes it a longer process before I even start writing. So I say about a few weeks to months or so? ",
            "date": "Answered June 4, 2020",
            "views": "26",
            "upvotes": " Answer requested by Alex Boast"
        },
        {
            "author_info": {
                "name": "Albany Publishing LLC",
                "href": "/profile/Albany-Publishing-LLC"
            },
            "answer_text": "If I didn’t have a day job anymore probably two weeks. As it stands with a day job I consistently write 50k in one month for National Novel Writing Month. Those drafts aren’t as clean as I’d like, but it gets the words on the paper and I can figure out a lot more of the story after that! ",
            "date": "Answered May 24, 2020",
            "views": "29",
            "upvotes": " Answer requested by Alex Boast"
        },
        {
            "author_info": {
                "name": "Jim Murison",
                "href": "/profile/Jim-Murison"
            },
            "answer_text": "Don’t do the word count thing, it pisses me off big time. It is an obsession, and a bad one. I will tell you two things. Fifty thousand words is barely a novel. The fastest I wrote a novel was in twenty one day’s. It is 375 pages on a 5x6 preformatted template. ",
            "date": "Answered May 20, 2020",
            "views": "53",
            "upvotes": " Answer requested by Alex Boast"
        },
        {
            "author_info": {
                "name": "Robert Johnston",
                "href": "/profile/Robert-Johnston-26"
            },
            "answer_text": "When I see questions like that, and Quora captures a huge number of them, I can only suggest you order a McDonalds Happy Meal and watch a commercial, because they can be done very quickly and don’t require paying attention or getting involved. Otherwise, read Harvey Ardman’s response, he nails it in his second paragraph. ",
            "date": "Answered June 29, 2020",
            "views": "28",
            "upvotes": " Answer requested by Alex Boast"
        },
        {
            "author_info": {
                "name": "Lisa Dooley Fisk",
                "href": "/profile/Lisa-Dooley-Fisk"
            },
            "answer_text": "I have done it three times. It takes me significantly longer for me to edit it. Editing for me is a lot of rewriting and reconceiving of the project. Usually it has little to nothing to do with the initial draft if all I am doing is writing for speed. ",
            "date": "Answered July 14, 2020",
            "views": "84",
            "upvotes": " View 1 Upvoter"
        },
        {
            "author_info": {
                "name": "Gethmini Priyanvada Welikala",
                "href": "/profile/Gethmini-Priyanvada-Welikala-1"
            },
            "answer_text": "My most using word range is 15,000 - 25,000 and I can write a novel in a week or three. My quickest writing is my first publishable novel, “Vilapa Dena Govipole Vikramaya” (The Adventure of The Moaning Farm) and it took only five days. There were 15,347 words. So, I guess, for a 50,000-word novel will take about a month or a month and two weeks. Hope this helped you. Thanks for A2A. ",
            "date": "Answered May 27, 2020",
            "views": "47",
            "upvotes": " View 1 Upvoter "
        },
        {
            "author_info": {
                "name": "Ally Fargo",
                "href": "/profile/Ally-Fargo"
            },
            "answer_text": "It depends on the novel and how much I outline in advance. Also, are you writing full time or on the side? Ideally it would take me three months to go through the process of writing, then polishing a novel that size. But I’ve written one in ten days before. So it’s a very subjective answer. ",
            "date": "Answered July 3, 2020",
            "views": "27",
            "upvotes": " Answer requested by Alex Boast"
        },
        {
            "author_info": {
                "name": "Ronal Reynier",
                "href": "/profile/Ronal-Reynier"
            },
            "answer_text": "50,000 words are not a novel but a novelette. With this question are you including a outline, word, grammar changes and editing? My first novel was 419 pages at an average of 380 words per page. My next was 287 pages at an average of 408 words per page after discarding 79 pages and 32,232 hard earned words. ",
            "date": "Answered May 27, 2020",
            "views": "29",
            "upvotes": " Answer requested by Alex Boast"
        },
        {
            "author_info": {
                "name": "Rachel Caine",
                "href": "/profile/Rachel-Caine-3"
            },
            "answer_text": "50k is half a novel to me, so I could easily do it in three weeks or less, depending on content and situation. ",
            "date": "Answered May 20, 2020",
            "views": "25",
            "upvotes": " Answer requested by Alex Boast"
        },
        {
            "author_info": {
                "name": "Hannah Myers",
                "href": "/profile/Hannah-Myers-21"
            },
            "answer_text": "I write 40 scenes and a scene a day. So, that’s only 1,250 words a day for 40 days. I can write more if I wish, bringing the project somewhere around 35 days. Of course, that’s only a rough draft. A second draft and so on would take months of critiques and rewriting. ",
            "date": "Answered May 31, 2020",
            "views": "29",
            "upvotes": " View 2 Upvoters "
        },
        {
            "author_info": {
                "name": "Oren Cohen",
                "href": "/profile/Oren-Cohen-47"
            },
            "answer_text": "A week. Technically, I write an average of 100k words every week. At least that’s what Grammarly’s Insights tell me every week. Granted, they are spread on blog posts, emails, guides, and other uses - like answering questions on Quora - so they are not invested into one cohesive work like a novel. But, it’s possible. And also a little staggering. ",
            "date": "Answered May 26, 2020",
            "views": "52",
            "upvotes": " Answer requested by Alex Boast"
        },
        {
            "author_info": {
                "name": "Peter Sacks",
                "href": "/profile/Peter-Sacks-5"
            },
            "answer_text": "I find the question innane and am amazed so many writers have tried to answer it with all sincerity yet wasting precious time. Unless the questioner is commissioning such a novel, the discussion is pointless, adding virtually nothing to the craft or the business of publishing. ",
            "date": "Answered May 30, 2020",
            "views": "43",
            "upvotes": " Answer requested by Alex Boast"
        },
        {
            "author_info": {
                "name": "Stephanie Van Dyke",
                "href": "/profile/Stephanie-Van-Dyke-3"
            },
            "answer_text": "It depends on the writer. If they’re a fast typist they could probably get it done in a few weeks or months. You never know, but usually it just relies on how fast they can write it. ",
            "date": "Answered May 22, 2020",
            "views": "36",
            "upvotes": " View 1 Upvoter "
        },
        {
            "author_info": {
                "name": "Oliver Jones",
                "href": "/profile/Oliver-Jones-301"
            },
            "answer_text": "I started writing my first book, which is still a work in progress, maybe some time in early April. I have just gotten past the 35,000 mark. On my best day I wrote over 2,000 words, on my worst I added a comma. However that is just me as a person, everyone is different. ",
            "date": "Answered August 2, 2020",
            "views": "40",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Marianne Joyce",
                "href": "/profile/Marianne-Joyce-2"
            },
            "answer_text": "I wrote my first two novels in five weeks apiece. I worked on my seventh novel on and off for twenty years. ",
            "date": "Answered May 20, 2020",
            "views": "17",
            "upvotes": " View 2 Upvoters "
        },
        {
            "author_info": {
                "name": "Elsa Kennington",
                "href": "/profile/Elsa-Kennington"
            },
            "answer_text": "It really depends on how interested I am in writing it- if I’m completely into it, I’d say about two or so months. But that’s just because I’m young and don’t have/need a job. :) so, if you have a busy schedule, around four months would sound right… and of not, then half that. Thanks, Elsa ",
            "date": "Answered May 22, 2020",
            "views": "47",
            "upvotes": " Answer requested by Alex Boast"
        },
        {
            "author_info": {
                "name": "Nadine Gallo",
                "href": "/profile/Nadine-Gallo"
            },
            "answer_text": "That depends on how good I want it to be. I could write it in 2 months or 3 but a year would be necessary for it to be good. ",
            "date": "Answered May 21, 2020",
            "views": "23",
            "upvotes": " View 2 Upvoters "
        },
        {
            "author_info": {
                "name": "Austin Valenzuela",
                "href": "/profile/Austin-Valenzuela-5"
            },
            "answer_text": "It depends on how much you write per day. Set a goal to write say, 2,000 word a day, and you will finish a 50,000 word novel in less than a month. ",
            "date": "Answered May 20, 2020",
            "views": "14",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Frank Haynes",
                "href": "/profile/Frank-Haynes-10"
            },
            "answer_text": "try it and see. One thing I recommend is NANOWRIMO. Every November they had a writing challenge and the goal is to reach a minimum of 50,000 words by he end of the month. ",
            "date": "Answered July 14, 2020",
            "views": "22",
            "upvotes": " Answer requested by Alex Boast"
        }
    ]
}