{
    "title": "How to increase your pace in writing - Quora",
    "tags": [
        "Pace University",
        "Creative Writing",
        "Time Management",
        "Writers and Authors",
        "Writing Advice",
        "Writing"
    ],
    "response": [
        {
            "author_info": {
                "name": "Christian Killeen",
                "href": "/profile/Christian-Killeen"
            },
            "answer_text": "I think there's two ways I can interpret this question: number of words written per day and the development and pace of the story. Anne Lamott say that you need a good writing habit. One of her suggestions is to get up early before you have anything else to do. Whatever time you normally get up then get up an hour before that. Write. Write anything and everything. She suggests free writing and willingness to throw it away. There are many techniques to creating a writing habit so I suggest start with her advice and branch out to find what works for you. Secondly the pace of the story. I find it very difficult to keep a pace going in the story and not getting bogged down in description or overly explaining a bit of the story which ruins the readers experience. Luckily your redraft process will help clear that up and you can rewrite bits of it. However, first time writing: I use a basic story plan and write with an idea for each chapter. So, one of my chapters could be the main character needs to drive from one place to another and goes through a difficult emotional reflection during the journey. I'm not attempting to write the whole novel. I'm only attempting to write one chapter and I know the specific aim of the chapter so it keeps me focused on the task and makes my writing efficient and will in some way draw to a close at the end of the chapter. I've found focused chapter writing very useful. I hope you do too. ",
            "date": "Answered July 22, 2020",
            "views": "24",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Karuna",
                "href": "/profile/Karuna-126"
            },
            "answer_text": "Practise that is the only way. Practise writing by setting a timer to complete a page of text in a certain period of time and try to complete it.Initially your hands hurt. Its like muscle they get stronger through time as you push them to write faster.Later it takes not so much of effort to write so fast. Love. ",
            "date": "Updated August 31, 2020",
            "views": "28",
            "upvotes": "0"
        }
    ]
}