{
    "title": "How to write a letter of leave for a vacation - Quora",
    "tags": [
        "Leave of Absence",
        "Writing Letters",
        "Letters (mail)",
        "Vacations",
        "Writing Advice"
    ],
    "response": [
        {
            "author_info": {
                "name": "T.Y. Freberg",
                "href": "/profile/T-Y-Freberg"
            },
            "answer_text": "The most important thing when addressing correspondence to your employer: never assume too much familiarity; do not assume you are appreciated and respected as a fixed condition! [Do not assume an employer knows exactly who are you as an employee.] Employee/employer relations evolve: your work environment might seem casual or informal, but being overly \"chummy\" w/correspondence is not appropriate. It seems a request for an extended leave should only be initiated for good cause: if you are not owed vacation time—per an existing agreement—it might be wise not to ask at all, but if you choose to persist… It can be a memo form or formal letter, depending on your employer. A memo form simply has a date—centered at least 3 blank spaces down from the top of the page—and then \"Attention\" line [starting at the left margin, 2–3 blank line spaces down from the date line]. A formal letter has the company name and address—3 blank line spaces down from top of the page—at the top of the page left margin: drop down 2–3 blank line spaces to center the date and then use an attention or salutation line that begins 2–3 blank line spaces below the date; \"Attention: …\" or \"Dear Employer Name…\" starts at the left margin. And then drop down 2–3 blank line spaces to begin the body text at the far left margin, with or without paragraph tab indention. Example… \"Dear or Greetings Mr./Ms. Employer Full Name\", My name is […] and I am an employee of the [name your] department [exact work position] who has a very consistent work attendance history to prove I have not yet experienced any leave of absence for vacation or other reason during the time of my [however many months, years, days] of employment. [If you have been congratulated, elevated in position for good work or otherwise overtly appreciated by your employer or supervisor at a previous time, mention it correctly in the second paragraph; each paragraph should have a least one blank line space down from the previous one and all paragraphs should start at the left corner of the page margin, with/without tab indentation of the first sentence to each paragraph.] \"If you will please recall: I was voted as the best departmental accountant just three months ago. I felt most honored and honorable to learn my most diligent work towards your concern was noticed and appreciated.\" \"However, my request for your attention at this time is not necessarily related by reason: this communication is a request for an extended leave, starting… [starting date] and then returning with renewed vigor [return date].\" [Declare your work ethic responsibility during a 3rd paragraph, then wrap it up: don't blab, don't grovel, don't try to suck up; don't offer explanations about what you plan to do with the time off, unless it's for relevant for education that will enhance your employment ability—do not express notions of being abused if not getting time off—and don't try to belittle or issue reprimand to your employer if he/she chooses refusal.] \"I am aware that the company schedule or agenda to which I am not yet privy might cause my leave of absence at the time I am requesting to be inconvenient; I would not request this leave if I knew of any issues that could arise during my suggested time of leave. \"I respectfully await your decision to the matter.\" [Drop down 2–3 blank line spaces for closing salutation line at left margin.] Sincerely, [Drop down 2–3 blank line spaces: type your full legal name, then your job title; leave enough space between \"Sincerely\" and the typed name line to sign your full legal name. Your handwritten signature should not include your job title after it. After the typed name/title line: you might also type your direct to you telephone number and email.] Signature Your full name, your job title [and if it seems necessary for the employment situation], your work phone number direct—not your personal cell or home phone number—and your specific work (only) email address. Memos do not have a \"Dear or Greetings\" line under the \"Attention\" line; a memo does not get a \"Sincerely\" line. But to conclude a Memo does still require at least your full name and job title typed 2–3 blank line spaces below the last line of the last paragraph, starting at the left margin. Memo or a formal letter should have at least 3–4 blank line spaces left at the bottom of each page. ",
            "date": "Answered July 5, 2019",
            "views": "124",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Kllean Pearl Cornista",
                    "user_href": "/profile/Kllean-Pearl-Cornista"
                }
            ]
        },
        {
            "author_info": {
                "name": "Nick Lamber",
                "href": "/profile/Nick-Lamber"
            },
            "answer_text": "Before you end your vacation plans, first request a vacation based leave of absence from your employer. It is common that companies offer a paid vacation time as a form of benefit of employment. Whether you request just a few days or weeks, your time off must first get an approval from your supervisor to formally request for a time off for vacations you have to write a letter to your supervisor and you also need to send a copy to the human resources department, then you have to wait for an official approval before you can schedule your traveling plans. Tips and Recommendations Here are some other tips before you schedule your traveling plans, ask if your company requires employees to complete a company time off request form, if it is applicable in this case then by all means include this document with the formal letter with a request to a vacation leave. Here is an example on how to make a vacation request letter. Mr.: _____________President _______________(here put the name of your employer and your position or that of the person you would have to ask for your vacations)Reference: vacation I am writing to ask for my vacations for the year 2013 (or the year that corresponds to you, if you’re asking for the ones that corresponded to you in 2012 then you ask for the vacations of the year 2012) Such leave will be from the day ______until day ______ inclusive, totaling _____ days (in the spaces put the number of days that you’re asking) Thanks so much for your time in reading this letter, I look forward to your prompt reply. xxxxx (Signature) xxxxxx (put your name) For this sort of letter you must remember to write it with time so spare and not just in the last minute. Sample – vacation letter.  ",
            "date": "Answered March 22, 2018",
            "views": "679",
            "upvotes": " View 11 Upvoters",
            "upvoters": [
                {
                    "user_id": "Brianna Hill",
                    "user_href": "/profile/Brianna-Hill-103"
                },
                {
                    "user_id": "Mathiyalagan King",
                    "user_href": "/profile/Mathiyalagan-King"
                },
                {
                    "user_id": "Gay Imbong",
                    "user_href": "/profile/Gay-Imbong"
                },
                {
                    "user_id": "Nirupa Jaiswal",
                    "user_href": "/profile/Nirupa-Jaiswal-2"
                },
                {
                    "user_id": "Sandie Hoares",
                    "user_href": "/profile/Sandie-Hoares"
                },
                {
                    "user_id": "Leyla Perres",
                    "user_href": "/profile/Leyla-Perres"
                },
                {
                    "user_id": "Nina Pallar",
                    "user_href": "/profile/Nina-Pallar"
                },
                {
                    "user_id": "Aggie Bester",
                    "user_href": "/profile/Aggie-Bester"
                },
                {
                    "user_id": "Tom Bernet",
                    "user_href": "/profile/Tom-Bernet"
                },
                {
                    "user_id": "Marta Crebner",
                    "user_href": "/profile/Marta-Crebner"
                }
            ]
        }
    ]
}