{
    "title": "How important are college essays in the college application process? - Quora",
    "tags": [
        "College Application Essays",
        "College Applications",
        "Essays"
    ],
    "response": [
        {
            "author_info": {
                "name": "Esther Littlefield",
                "href": "/profile/Esther-Littlefield-1"
            },
            "answer_text": "Conventional thought says that college essays can make or break an application. This is not entirely true. A Tutor's View: How Important are College Application Essays and Personal Statements? Essays are one of many parts of a college application, and while it is important to write a quality essay, it won’t, on its own, get you admitted into college. A great essay won’t make up for crappy statistics or an arrogant personality (which will probably come through on what is said - or not said - in letters of recommendation). However, a terrible essay may call into question whether or not you are a good match for the school. So it’s important to read these answers knowing that, whether or not the essay is super important, you should still write well-thought-out essays that paint a picture of who you are. Essays, while not the “Golden Ticket” to a “Congratulations!” email from your universities of choice, are a piece to a puzzle that admissions officers will use to gauge whether or not you are right for their college. The job of the essay is to give the applicant a dimensionality that is difficult to get out of stats alone. However, the essay is also meant to confirm and bolster what the rest of your application says about you. NOT by repeating information already there, but by showing that you are who you (and others through LOR) say you are. For example, during the Early Admissions process, my son wrote a LOT of essays (he was applying to four colleges, one of which required use of its own institutional application). His essays were good, but they basically just retold, in creative ways, things you could already find out in his application. In other words, they simply weren’t giving any new information that they didn’t already know by reading his accomplishments, etc. They weren’t showing him through a new or different lens. At the same time, he was working on an essay for one of the schools he had considered applying EA but ended up deciding to go RD. That essay was AMAZING! He had found a new way to show who he was by telling a story found nowhere in the rest of his application. This new essay showed his giftedness in how he relates to others, not by SAYING he did, but by retelling a story that SHOWED he did. I don’t think even he knew what he had done until his advisor, his counselor, and I told him. He simply stopped trying to retell what he had done and let his experiences tell the story. This ended up becoming his Common App essay. He did it again with an essay that he wrote for a prompt for the same college application he was working on. It had to do with a favorite quote from a book and why. My son had read a book in his Literature and Neuroscience class that had been extremely insightful (I don’t believe in coincidences - I think this class was a HUGE reason why he got into Yale, but that’s a whole ‘nother story) and he chose a quote from this book. He ended up writing a very unique essay that at first I didn’t like at all. In fact, I told him to show it to his English teacher (who was also his Lit and Neuro teacher as well as his advisor all four years), thinking she would dissuade him, but she loved it, so he used it (to my dismay). When he was filling out his Yale RD application later that year, one of the optional essays was to write something that needed to be said that wasn’t already said in your application. He decided to use this second essay. I cringed. Thinking it was a BIG mistake to include it, I tried to talk him out of it. But of course, it was his decision, so he used it… And I’m SO glad he did! After he was accepted and we attended Bulldog Days (where an admissions officer told parents about how vital a role social intelligence and interpersonal abilities played in selecting the Class of 2022), I reread the essay and realized it was PERFECT for what Yale was looking for. Of course, my son didn’t know this. He wasn’t pretending to be someone he wasn’t. He was being himself - and I almost stopped him!!! So why did I just bore you with this story? To show that it wasn’t the fact that he wrote these amazing essays that got him into Yale. Rather, they were reflections of who his application (and letters of recommendation) showed he was - a caring, thoughtful, gifted student that excelled academically and athletically even though he put others’ needs above his own. He is the kid that gets others involved. He’s the kid that gets things done. He is the kid that would rather sit with one outcast student than with his varsity athlete buddies. He is the kid that sees beauty in simplicity, lives in the moment, and makes the most out of the opportunities afforded to him. The essays merely showed, in stories, what Yale already knew because his extracurricular activities supported this. His letters of recommendation supported this. His interview supported this. And of course, he had the GPA and the test scores to be in the top percentiles for admissions. Essays are a part. Not a huge part, but a part nonetheless. Might he have gotten in if his essays were mediocre? We will never know. But who would want to find out the hard way? ",
            "date": "Answered August 31, 2018",
            "views": "13",
            "upvotes": " View 31 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Chelsea An",
                    "user_href": "/profile/Chelsea-An-2"
                },
                {
                    "user_id": "Georgia Dixon",
                    "user_href": "/profile/Georgia-Dixon-28"
                },
                {
                    "user_id": "Amber Pommier",
                    "user_href": "/profile/Amber-Pommier"
                },
                {
                    "user_id": "Quynh Nguyen",
                    "user_href": "/profile/Quynh-Nguyen-608"
                },
                {
                    "user_id": "Elianna Nazginov",
                    "user_href": "/profile/Elianna-Nazginov-1"
                },
                {
                    "user_id": "Ayomide Ayeni",
                    "user_href": "/profile/Ayomide-Ayeni-8"
                },
                {
                    "user_id": "Eli",
                    "user_href": "/profile/Eli-332"
                },
                {
                    "user_id": "Selma Kinkead",
                    "user_href": "/profile/Selma-Kinkead"
                },
                {
                    "user_id": "Turza Saha",
                    "user_href": "/profile/Turza-Saha"
                },
                {
                    "user_id": "Angie Cruz",
                    "user_href": "/profile/Angie-Cruz-70"
                }
            ]
        },
        {
            "author_info": {
                "name": "Ted Lehmann",
                "href": "/profile/Ted-Lehmann-2"
            },
            "answer_text": " In an article about the College Essay, the College Board States: “How important is the essay? The National Association for College Admission Counseling’s 2011 State of College Admission report found that while grades, strength of curriculum and admission test scores are the top factors in the college admission decision, a majority of colleges and universities believe the essay to be of considerable or moderate importance in determining which academically qualified students they would choose. In other words, when all else is equal between competing applicants, a compelling essay can make the difference. A powerful, well-written essay can also tip the balance for a marginal applicant.” That seems like a pretty clear statement. Highly competitive colleges receive thousands of applications for a limited number of spaces each year. So many, that in highly selective schools, fewer than 10% of applicants are accepted. That being the case, the college essay becomes a crucial vehicle for students to clearly show how they stand out from the others. What is it that makes “me” attractive to the college? The freshman class is more than just another year of filling the cash drawer at colleges taking seriously their mission and image. Each college stands or falls based on the reputation it builds. They seek to make themselves attractive to students as much as students wish to be attractive to them. This means the need to build an attractive, interesting, and diversified freshman class. Accomplishing that requires the essay. You need to carefully craft an essay the shows the real you with an emphasis on what you’ve accomplished in and out of school to reflect your interests, concerns, and enthusiasms. Don’t make your essay an afterthought! ",
            "date": "Answered August 30, 2018",
            "views": "974",
            "upvotes": " View 2 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Lisa Mooc",
                    "user_href": "/profile/Lisa-Mooc"
                },
                {
                    "user_id": "Esther Littlefield",
                    "user_href": "/profile/Esther-Littlefield-1"
                }
            ]
        }
    ]
}