{
    "title": "How write best essay in UPSC? - Quora",
    "tags": [
        "Ace UPSC Essay",
        "Essay Writing Help",
        "Essays",
        "Union Public Service Commission of India",
        "Writing Advice"
    ],
    "response": [
        {
            "author_info": {
                "name": "Arvind Shah",
                "href": "/profile/अरविंद-शाह-Arvind-Shah"
            },
            "answer_text": "I feared Essay. I feared it because I didn’t know what to write that would fetch me marks. I would see the essays asked in previous year papers. Just one quote. What the hell should I write in it? Below are some suggestions from what I have learned in my UPSC journey. First. Remember that this is not a GS paper. Content is not the primary criteria for marks. Then what is the primary criteria? Coherence and clarity of ideas. Second. Complex language and uninteresting, long sentences can irk examiner. Your language should be lucid. Break the complex sentences into smaller ones. Third. Your words should be simple and common. Don’t force the examiner to open the dictionary. Now, Let us understand how to prepare yourself to a coherent, interesting essay using short sentences and simple words: Make a habit to collect the quotes. Ponder upon the topics on which the quote can be used. Try to write it couple of times so that you can use it verbatim (not required to be exact, yet it is preferable). Try to bring the quotes in your conversation with your UPSC aspirant friends. It is a long drawn process hence it is advisable to start this point as early in your preparation as you can. Introduction with one relevant quote still remains to be one of the most effective way. Quotes can also be used in mid of essay appropriately. Practice the art of writing in simple words. Practice to break complex sentences into small ones. If you really want to use one complex word, especially in technical topics, please try to define it first. Expect that examiner checking the essay copy is an average graduate. (Not that he is. Yet don’t take any chances by expecting your examiner to be subject expert.) Collect paragraphs from topper copies, excerpts from books, dialogues from TV shows,movies, stories from Panchtantra, Mahabharata. Prepare success stories of Hard work, integrity, passion, compassion etc. Whatever grabbed your interest and is appropriate for a topic, it can be used. Writing the mock tests: Either explicitly or implicitly, essay should have political, social, historical, global, ethical, technological, environmental dimensions. Thus start writing essay mocks once you are done with GS preparation on satisfactory level. Learn to choose topics wisely. Take up to 5 minutes to choose the topics. Experiment in the mocks by choosing different genres of topics. But once the choice has been made, its been made forever. Don’t try to look at other topics and have second thoughts in middle of writing that whether you have made correct choice or not. It doesn’t matter now. Introduce your essay either by a relevant quote, or a hard hitting statistics, or any dichotomy, or some anecdote. Which one is better approach? There is no clear answer. Find the answer yourself. Experiment in the mocks and see what works for you. I found out that I couldn’t fabricate appropriate anecdotes. Hence I did not make up any story. I limited my anecdotes to the one which I had heard from Mahabharata, Panchtantra, or any current event. You can end your introduction by asking some questions. And answer those questions in your body. Body can be with subheadings or without subheading. If you are worried that some dimensions might go unaddressed, use subheadings. It will force you to limit yourself on the subheading and will not let you wander around. If you are using subheadings, make them catchy. How? You can learn from the greatest strategist I know - Mr Anudeep Durashetti, Rank 1, 2017 ( His notes are at the end of this write up.) There are two major approaches to cover multiple dimensions. One is PESTLE approach. Start from political dimension, move to economic and so on… Another approach is to generate 5–6 sub-questions from the topics. And make those sub-question as subheadings. For every question write thesis, antithesis and reach at synthesis. Keep in mind to maintain the flow. There must not be any abrupt transition, but should be smooth transition. But how? For smooth transition, Mr Anudeep has suggested many ways. Ask the question at the end of para. Start the next para like ‘Now that we have discussed X, Lets discuss Y’ and many more (Anudeep’s note’s link are at the end of this write up). After many such smooth transition, you will be done analyzing possible dimensions, their pro and cons. Its time to wind up the discussion. Its time to conclude. Conclusion is not summary. Conclusion is telling what was the result of this multidimensional debate. What are the points that we are taking home. If some points are still undecided, what does the future hold for them. Conclusion must be visionary. Conclusion can be ended with some poems such as Tagore’s ‘Where the mind is without fear’, or some Sanskrit sloka such as ‘Sarve Bhavantu sukhina’ or with preamble of the constitution such as ‘Lets make our nation a sovereign, secular, republic where dignity,liberty, integrity and justice is ensured… Once you learn the art of Essay writing. It is one such paper which gives you immense ease and very good marks. You can re-read this answer and notice that I have written it in format of an UPSC essay and is of about 900 words. It doesn’t contain any bullet points. It doesn’t have long sentences or complex words. It has smooth transition. Whatever is in bold, is supposed to be underlined in the exam. Best Wishes Link to Anudeep’s note: Essay Notes- Anudeep Durishetty AIR 1.pdf Edit: I stumbled upon Anudeep’s answer for essay on Quora today. Believe me when I say it. Treat his strategy as gospel. Nobody knows better than him. Below is the link- Anudeep Durishetty's answer to How do I write an effective essay for the UPSC Mains?  Arvind Shah's answer to How was your UPSC CSE Prelim exam (2019)? Arvind Shah's answer to How do I improve my writing skills for the UPSC? ",
            "date": "Updated November 8, 2019",
            "views": "54",
            "upvotes": " View 23 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Simran Kaur",
                    "user_href": "/profile/Simran-Kaur-1041"
                },
                {
                    "user_id": "Kunal Shukla",
                    "user_href": "/profile/Kunal-Shukla-56"
                },
                {
                    "user_id": "Debjit Konar",
                    "user_href": "/profile/Debjit-Konar"
                },
                {
                    "user_id": "Abhishek Kumar(Aman)",
                    "user_href": "/profile/Abhishek-Kumar-Aman-4"
                },
                {
                    "user_id": "Karan G",
                    "user_href": "/profile/Karan-G-33"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/Mk-852"
                },
                {
                    "user_id": "Vinod Kumar Prajapati",
                    "user_href": "/profile/Vinod-Kumar-Prajapati-2"
                },
                {
                    "user_id": "Neeraj Tilekar (नीरज टिळेकर)",
                    "user_href": "/profile/Neeraj-Tilekar-नीरज-टिळेकर"
                },
                {
                    "user_id": "Anurag Meena",
                    "user_href": "/profile/Anurag-Meena-16"
                },
                {
                    "user_id": "Prakash Aawati",
                    "user_href": "/profile/Prakash-Aawati"
                }
            ]
        },
        {
            "author_info": {
                "name": "Kriti Pandey",
                "href": "/profile/Kriti-Pandey-18"
            },
            "answer_text": "Essay is a test of what your thoughts are on any given topic, and also how aware you are about the same. The flexibility that the essay paper provides (1000 words to express yourself in any way you wish to) can be used to one’s advantage to articulate your thoughts in the most creative ways possible. I’ll give some pointers about how I prepared for the essay paper. I hope this helps! Select your topic carefully- Give this enough thought. See on what topics you have enough thoughts and ideas, and also some facts to substantiate your ideas. Eliminate the topics you can’t write on to arrive at the one you will attempt. Now this is a crucial step because you can’t go back and change your topic after writing half the essay, so never doubt your choice once you’ve made it!Brainstorming and brain mapping ideas- Once you have chosen your topic, prepare to jot down anything and everything that comes to your mind regarding that topic. Don’t think too much about the right and wrong. Use the last sheet of the answer leaflet to quickly jot down everything, relevant or irrelevant, in 5–7 minutes or so. Once your brain stops buzzing, then begin to organize those ideas in a logical manner under multiple heads to form a logical flow to the essay. Eg. you could start with the history of the topic, then talk about the contemporary aspects. Then there is the common approach of putting points under social, economic, political, psychological, cultural, environmental, technological etc. heads. Draw out a mindmap of your ideas, thinking about what comes after what. Give 15–20 minutes to this exercise. Trust me, once this is done well, writing the essay will be a breeze!Start with a bang- The introduction will determine how interested the examiner will be in your essay. Make it interesting, You could use a real/fictional anecdote, some data, any current happening, a quote, dialogues from a movie and so on. Anything that is relevant to the topic can be written. Eg. in an essay I had written about corruption in a test, I had talked about the famous Bollywood dialogue “Mera Bharat mahaan, 100 me se 99 beimaan”(My India is great, 99 out of 100 fellows are corrupt here). Show creativity within the boundary of the topic.Lucidity- Flowery language is unnecessary. Keep it simple and maintain a natural flow in thoughts. Don’t jump around the points, and don’t come back to the same point in some other part of the essay. This is where your brain mapping will really come in handy. A well mapped essay is clear, crisp, lucid and conveys thoughts well.Conclude on a high note- Refrain from ending the essay on a gloomy note. There should be some way forward, some hope for the future, or some philosophical thought at the end for the examiner to reflect on. A good ending will ensure you get a good score too, just like a good dessert completes a nice meal! :)Use of facts, quotes, reports etc.- Make good use of these tools. Don’t stuff your essay with facts though, because the examiner is more interested in your views. However, some relevant substantiation only adds to your understanding of the topic. Use quotes judiciously, not more than 2–3, and very strategically.There could a lot more additions to this list, but this is mostly how I tackled essays. Do write a few practice essays and research some case studies and anecdotes in advance on some common topics like women empowerment, education, technology, democracy etc. Good luck! ",
            "date": "Answered August 3, 2018",
            "views": "96",
            "upvotes": " View 111 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Jp Manu",
                    "user_href": "/profile/Jp-Manu"
                },
                {
                    "user_id": "Inderpreet Singh",
                    "user_href": "/profile/Inderpreet-Singh-21"
                },
                {
                    "user_id": "Akkshu Cool",
                    "user_href": "/profile/Akkshu-Cool"
                },
                {
                    "user_id": "Riya",
                    "user_href": "/profile/Riya-232"
                },
                {
                    "user_id": "Bala Krishnan",
                    "user_href": "/profile/Bala-Krishnan-444"
                },
                {
                    "user_id": "Agrawal Y",
                    "user_href": "/profile/Agrawal-Y"
                },
                {
                    "user_id": "Daanish Naithani",
                    "user_href": "/profile/Daanish-Naithani"
                },
                {
                    "user_id": "Nipun Mittal",
                    "user_href": "/profile/Nipun-Mittal-17"
                },
                {
                    "user_id": "Shivanand Telagade",
                    "user_href": "/profile/Shivanand-Telagade"
                },
                {
                    "user_id": "Kirti Dalal",
                    "user_href": "/profile/Kirti-Dalal-1"
                }
            ]
        }
    ]
}