{
    "title": "How to write a permission letter for an internship to the principal - Quora",
    "tags": [
        "School Principals",
        "Recommendation Letters",
        "Writing Letters",
        "Internships",
        "Writing Advice"
    ],
    "response": [
        {
            "author_info": {
                "name": "Manikandan M.S.",
                "href": "/profile/Manikandan-M-S-10"
            },
            "answer_text": "Writing a permission letter for an internship This answer comprises two samples for your reference, please read both of them, and select whichever is best appropriate for you.  Sample 1 This is a format for writing a formal application letter to the school /college principal. From, xxxxxx (your name) xxxxxx (address) xxxxxx (place) xx-xx-xxxx (Date) To, The Principal xxxxxxxxxx (school name) xxxxxx (place) Subject: Application for an internship Sir/Ma'am, I would like to apply for an internship in your reputed school/college under the teaching department for a period of xxxx (mention the period). I am also attaching my resume that lists out all my academic qualifications, achievements and credentials. I request you to kindly have a look at it and consider my application. I will be looking forward to hearing from you about the possibility and opportunity. Thanking you. Yours sincerely xxxxxx (your name) xxxxxx (contact)  Sample 2 From, xxxxxx (your name) xxxxxx (address) xxxxxx (place) xx-xx-xxxx (Date) To, The Principal xxxxxxxxxx (school name) xxxxxx (place) Subject: Application for an internship Sir/Ma'am, I am xxxxx (your name), studying in final year xxxxx (write about the course). I would like ask your permission to start my internship as part of my course requirements from the month June, 2020. It's a 3 month internship training. Therefore, I request you to grant me a permission to start my internship for the period mentioned above. Thanking you in anticipation Yours obediently xxxxx (your name) Department Admission No.  I hope this answer is helpful to you. Thank you. ",
            "date": "Answered December 2, 2019",
            "views": "129",
            "upvotes": " View 12 Upvoters",
            "upvoters": [
                {
                    "user_id": "K.Manoj Gowda",
                    "user_href": "/profile/K-Manoj-Gowda"
                },
                {
                    "user_id": "Ritvik Verma",
                    "user_href": "/profile/Ritvik-Verma-16"
                },
                {
                    "user_id": "Sai Sagar Ghorpade",
                    "user_href": "/profile/Sai-Sagar-Ghorpade"
                },
                {
                    "user_id": "Shweta Bihat",
                    "user_href": "/profile/Shweta-Bihat"
                },
                {
                    "user_id": "Prerna Saini",
                    "user_href": "/profile/Prerna-Saini-61"
                },
                {
                    "user_id": "PRINCE RAZ",
                    "user_href": "/profile/PRINCE-RAZ-7"
                },
                {
                    "user_id": "Dimpho Jele",
                    "user_href": "/profile/Dimpho-Jele"
                },
                {
                    "user_id": "Harsh Yadav",
                    "user_href": "/profile/Harsh-Yadav-164"
                },
                {
                    "user_id": "Saurav Kumar",
                    "user_href": "/profile/Saurav-Kumar-768"
                },
                {
                    "user_id": "Alok Singh",
                    "user_href": "/profile/Alok-Singh-3368"
                }
            ]
        },
        {
            "author_info": {
                "name": "Shobha Pai",
                "href": "/profile/Shobha-Pai-15"
            },
            "answer_text": "your name Address Date To, The Principal, address Kind attention : Name of the principal. Respected Sir/Madam, Sub : Request for an internship in your esteemed school. With reference to the above, I take this opportunity to kindly request you to allow me to do internship in your reputed school. I enclose herewith a short resume for your perusal and record. I hope you will be kind enough to oblige and looking forward to positive reply. Thanking you, Yours Sincerely Name. ",
            "date": "Answered August 15, 2019",
            "views": "158",
            "upvotes": " View 9 Upvoters ",
            "upvoters": [
                {
                    "user_id": "MUHAMMAD BILAL",
                    "user_href": "/profile/MUHAMMAD-BILAL-2875"
                },
                {
                    "user_id": "IMRAN HUSSAIN",
                    "user_href": "/profile/IMRAN-HUSSAIN-1011"
                },
                {
                    "user_id": "Nytacha Siddiq",
                    "user_href": "/profile/Nytacha-Siddiq"
                },
                {
                    "user_id": "Misbaul Laskar",
                    "user_href": "/profile/Misbaul-Laskar"
                },
                {
                    "user_id": "Annu Meghwal",
                    "user_href": "/profile/Annu-Meghwal"
                },
                {
                    "user_id": "Abhishek R",
                    "user_href": "/profile/Abhishek-R-84"
                },
                {
                    "user_id": "Angel Poonam",
                    "user_href": "/profile/Angel-Poonam-4"
                },
                {
                    "user_id": "Skippy Valentino",
                    "user_href": "/profile/Skippy-Valentino"
                },
                {
                    "user_id": "Devan Sheffie",
                    "user_href": "/profile/Devan-Sheffie"
                }
            ]
        }
    ]
}