{
    "title": "How to write good academic research articles for research journals - Quora",
    "tags": [
        "Academic Research Journals",
        "Papers in Academic Journals",
        "Academic Journals",
        "Academic Research Papers",
        "Academic Papers",
        "Academic Research",
        "Research"
    ],
    "response": [
        {
            "author_info": {
                "name": "Martin Garix",
                "href": "/profile/Martin-Garix-2"
            },
            "answer_text": "Once the research question is clearly defined, writing the paper becomes considerably easier. The paper will ask the question, then answer it. The key to successful scientific writing is getting the structure of the paper right. The basic structure of a typical research paper is the sequence of Introduction, Methods, Results, and Discussion . Each section addresses a different objective. The authors state: (i) the problem they intend to address—in other terms, the research question—in the Introduction; (ii) what they did to answer the question in the Methods section; (iii) what they observed in the Results section; and (iv) what they think the results mean in the Discussion. Get more ideas at Papersmart. ",
            "date": "Answered October 5, 2017",
            "views": "93",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Juan Fernando Gómez Pérez",
                    "user_href": "/profile/Juan-Fernando-Gómez-Pérez"
                }
            ]
        },
        {
            "author_info": {
                "name": "Arif Perdana",
                "href": "/profile/Arif-Perdana"
            },
            "answer_text": "I had a chance to talk to one of notable professors in information systems. I asked him pretty much the same question, How do I write a good academic paper. Then he asked me how do you define good papers, or you can think about how do you define good music? Are you defining good papers based on the contents or citation? He said that, he met many authors that he thought have written good academic papers, but the authors said that they did not think whether their papers are good or bad when they wrote their papers. They are just passionate on what they are doing with their research and paper. The academic community in particular disciplines decides whether a paper is good or bad via its contents, citations and academic discussion. Even though, citation can be bias as well to consider whether the paper is good or bad. If the definition of a good paper is the paper that contains interesting research questions, robust research methodology, and well-written paragraphs, Then what you can do is read papers, attend seminars or conferences and discuss with scholars in your discipline. By doing so, you will be able to formulate interesting research questions. Reading papers makes you familiar with writing styles and how to formulate well-written paragraphs. Talking with scholars will keep abreast of your knowledge and open possibilities to generate research collaboration that may produce good papers. ",
            "date": "Answered June 19, 2016",
            "views": "684",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Ansu Ceesay",
                    "user_href": "/profile/Ansu-Ceesay-3"
                },
                {
                    "user_id": "Mokhtar Kouadri",
                    "user_href": "/profile/Mokhtar-Kouadri"
                },
                {
                    "user_id": "Harto Gunardi",
                    "user_href": "/profile/Harto-Gunardi"
                },
                {
                    "user_id": "Rishikesh Misal",
                    "user_href": "/profile/Rishikesh-Misal"
                }
            ]
        },
        {
            "author_info": {
                "name": "Dilip Mutum",
                "href": "/profile/Dilip-Mutum"
            },
            "answer_text": "Follow the following steps: Read a lot of academic journal articles.Start with a good research and you can then look to converting the findings into a good research article.It is a good idea to collaborate with more experienced academics who have a lot of experience writing research articles. Learn from the best.Once you are done with your first draft, it might be a good idea to present the paper at research conferences to get feedback from your peers.Also get an expert to go through your paper if possible. No harm in adding their name to the list of authors if they do add value to the final product.Updated: Make sure that once you have identified the target journal, you are aware of all the requirements.Make sure you cite a few papers from the journal as well.",
            "date": "Updated June 20, 2016",
            "views": "497",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Carlos Soto",
                    "user_href": "/profile/Carlos-Soto-13"
                },
                {
                    "user_id": "Mike Adams",
                    "user_href": "/profile/Mike-Adams-50"
                }
            ]
        },
        {
            "author_info": {
                "name": "Mike Adams",
                "href": "/profile/Mike-Adams-50"
            },
            "answer_text": "Like any skill, practice, practice, practice. Our students are required to write up every lab and, by the end of four years, most can produce a report that is satisfactory. Of course, for a journal you need results that are worth publishing; but submitting great results in an unreadable form is a waste of time. A poorly written article will probably be returned without even going to reviewers. So, try collaborating with someone who has already published or ask several people for meaningful criticism of your paper. ",
            "date": "Answered April 30, 2019",
            "views": "121",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Abhijeet Choudhury",
                    "user_href": "/profile/Abhijeet-Choudhury-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Carlos Soto",
                "href": "/profile/Carlos-Soto-13"
            },
            "answer_text": "Complementing the others answer, take a course on good writing for example: Stanford Scientific Writing Course From the side of writing, the quality can be determined by (and not only), and some piece of advice to keep it: The description of the main idea, make it clear and concise.The impact of the contribution. Make clear what are you improving, how it helps, what is new, why it is better or worst. if your idea doesn’t works you can still publish the paper (Why science needs to publish negative results).The writing should flows logically.The connection between ideas, paragraphs, and sections.",
            "date": "Answered June 21, 2016",
            "views": "484",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Murat Sahin",
                    "user_href": "/profile/Murat-Sahin"
                },
                {
                    "user_id": "Harto Gunardi",
                    "user_href": "/profile/Harto-Gunardi"
                }
            ]
        },
        {
            "author_info": {
                "name": "Mohammad Saikot",
                "href": "/profile/Mohammad-Saikot"
            },
            "answer_text": "Start writing before the experiments are complete. Start writing while you are still doing the experiments. Writing often evokes new ideas: you may realize that there are additional experiments to run or additional controls that you need to add. If you wait until you are done in the lab, have dismantled the equipment, and possibly moved on to another position, you will not have the opportunity to test these ideas. You can be helped with more directions from college writer. ",
            "date": "Answered March 14, 2017",
            "views": "240",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Robert Morgan",
                "href": "/profile/Robert-Morgan-28"
            },
            "answer_text": "First you must do the research. if it is a literature review based on previous publications then a meta-analysis may be appropriate. If you are trying to present an orderly review of a messy topic, there is a place for laying out the various conclusions. Whatever you do, plan on doing a lot of work before attempting any writing. And when you write it up remember that easy writing makes damn hard reading and easy reading reflects damn hard writing. And if you have nothing to say, stop now. ",
            "date": "Answered June 26, 2016",
            "views": "453",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Lori M Kelman",
                    "user_href": "/profile/Lori-M-Kelman"
                }
            ]
        },
        {
            "author_info": {
                "name": "Zhong Xin",
                "href": "/profile/Zhong-Xin-17"
            },
            "answer_text": "Power Papers talk by A/Prof. Terence Sim http://www.comp.nus.edu.sg/~tsim/PowerPapers1.pdf http://www.comp.nus.edu.sg/~tsim/PowerPapers2.pdf ",
            "date": "Updated May 31, 2017",
            "views": "210",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Terence Sim",
                    "user_href": "/profile/Terence-Sim"
                }
            ]
        }
    ]
}