{
    "title": "How to write a leave application email - Quora",
    "tags": [
        "Leave Application",
        "Leave of Absence",
        "Email"
    ],
    "response": [
        {
            "author_info": {
                "name": "Kausikan Kausikan",
                "href": "/profile/Kausikan-Kausikan"
            },
            "answer_text": "Hi, I am just reproducing the leave application send by my son through Email : From: Revanth Kausikan <revanth.kausikan@xx.com>Date: Thu, May 2, 2019 at 10:34 PMSubject: Might not come tomorrow...To: <freshfone-xx@xx.com> TLDR in the end. Revanth's Diary:May 3, 2019: Most of them argue that college days are the best ones in their life. But coming from the infamous St. Joseph's college of Engineering that makes the students to follow \"Tie ah podu, tuck-in pannu\" rules in Chennai veyil, it is unnatural for me to deny the inevitable otherwise.Of course I had a lot of precious moments to cherish from there, but that no way makes it easier to actually even try to miss my college.But here is the catch: Asgard is not a place, it's a people.I literally HATE my college, but love my friends. So here I am, actually on the last day of my entire college life, where I will be formally parting my friends, in the same place where I met those lovely souls 4 years ago.Today, I will say bye to them all, and miss them for the rest of my life. Today, I'll have my last lunch at college mess, with my friends for the last time. Today, I'll get to thank all those souls, including some of the staff, who made it easier for me to get through this damn college. And yeah, today I'll have to submit the no-due form and do all other useless procedures too... TLDR:I have to submit the no-due form tomorrow, in the last working day of my college. I'll try to come to the office, if it is a half day for me. Else, prepare yourselves to miss me. For more search his page : Revanth Kausikan in Quora ",
            "date": "Answered May 6, 2019",
            "views": "6",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Vivienne Anderson",
                "href": "/profile/Vivienne-Anderson-2"
            },
            "answer_text": "How do I write a leave application email? Well, not much different as an LOA request per letter. Just keep it brief and formal. As an employee or student, it’s occasionally allowed to request for a leave of absence. When you are applying for a leave from office or school, here is how to write a decent leave application: Leave Letter Templates.  When requesting a school leave of absence, your letter should include: the reason for your temporary leave;from when to when you expect to be away from office or school;the date you are planning to return;don't forget to say thanks for considering your LOA request.Good luck! ",
            "date": "Answered November 13, 2019",
            "views": "44",
            "upvotes": " View 6 Upvoters",
            "upvoters": [
                {
                    "user_id": "Fernando Gonzalez",
                    "user_href": "/profile/Fernando-Gonzalez-227"
                },
                {
                    "user_id": "Brianna Hill",
                    "user_href": "/profile/Brianna-Hill-103"
                },
                {
                    "user_id": "Jan Steen",
                    "user_href": "/profile/Jan-Steen-5"
                },
                {
                    "user_id": "Nathan Waters",
                    "user_href": "/profile/Nathan-Waters-23"
                },
                {
                    "user_id": "Peter Liu",
                    "user_href": "/profile/Peter-Liu-152"
                },
                {
                    "user_id": "Elliot Hu",
                    "user_href": "/profile/Elliot-Hu-3"
                }
            ]
        }
    ]
}