{
    "title": "How to write a gay character - Quora",
    "tags": [
        "Creating Writing Advice",
        "Creative Writing",
        "Fictional Characters",
        "Homosexuality",
        "LGBTQ",
        "Writing Advice"
    ],
    "response": [
        {
            "author_info": {
                "name": "Murphy Barrett",
                "href": "/profile/Murphy-Barrett"
            },
            "answer_text": "For the most part, just like you’d write any other character. A pair of characters in one of my story worlds are bisexual women who are a couple. But that’s almost never the focus of what I’m writing about. When I do write about their relationship, it’s not about how they’re both women. It’s about Selena trying to help Nadya cope with the PTSD she refuses to admit she has. Or Nadya protecting Selena from the consequences of her naivete. That they’re both women is not the whole of their relationship. The stories themselves for the most part revolve around their work, or in the earlier stories about Nadya adjusting to life in the US after being a street-kid in Russia. They’re about dealing with being a witch and a werewolf in a world that tends to see them as monsters by default. They’re about protecting the people they care about. And when the story does focus on them being women in a relationship, I do my research. While they live in Seattle which is a very permissive environment for gays, lesbians, and bisexuals (so I’m told), they do run into the odd bigot. Or the time Nadya was in hospital, and Selena had to lie and claim to be her mother so she could see her (Nadya is very small and often mistaken for a child, which she both hates and uses to her advantage) because they aren’t married and otherwise she’d have been denied visitation. But for the most part, just write gays like you’d write anybody else. The mark of a good gay character is that being gay should never be the most interesting thing about him.  Another good example would be Captain Raymond Holt.  While being gay and black are important aspects to his character, and in fact relate to why he worked so hard to make Captain, neither of those facts are by themselves the most interesting thing about him. That is, “Gay Black Cop” is not his character. He’s Captain Raymond Holt, who always speaks in a low, nearly flat voice, is impeccably tidy, quick witted, erudite, and excellent foil for Jake Peralta, and happens to be gay and black. There’s also Detective Rosa Diaz, who is bisexual, but that’s certainly not the most interesting thing about her.  But just like with Captain Holt, it’s not window dressing either. It actually matters to her character, it just doesn’t define her character. Hell, there’s even Albert and Armand Goldman, and even their characters aren’t defined by being gay, even though that’s central to the whole plot of the movie!  In short, gays are people too. Remember that when you write them.  Original question-How do I write a gay character? ",
            "date": "Answered March 11, 2020",
            "views": "143",
            "upvotes": " View 1.5K Upvoters ",
            "upvoters": [
                {
                    "user_id": "Edgar Li",
                    "user_href": "/profile/Edgar-Li-8"
                },
                {
                    "user_id": "YN Ln",
                    "user_href": "/profile/YN-Ln-2"
                },
                {
                    "user_id": "Nilgun Duman",
                    "user_href": "/profile/Nilgun-Duman-1"
                },
                {
                    "user_id": "Lee Tiggins",
                    "user_href": "/profile/Lee-Tiggins"
                },
                {
                    "user_id": "Indigo Ferret",
                    "user_href": "/profile/Indigo-Ferret"
                },
                {
                    "user_id": "Giulio Cellocco",
                    "user_href": "/profile/Giulio-Cellocco"
                },
                {
                    "user_id": "James Tobin",
                    "user_href": "/profile/James-Tobin-2"
                },
                {
                    "user_id": "Graham Pronk",
                    "user_href": "/profile/Graham-Pronk-1"
                },
                {
                    "user_id": "Devon Trinh",
                    "user_href": "/profile/Devon-Trinh"
                },
                {
                    "user_id": "Philip Cunningham",
                    "user_href": "/profile/Philip-Cunningham-47"
                }
            ]
        },
        {
            "author_info": {
                "name": "Daniel Masters",
                "href": "/profile/Daniel-Masters-38"
            },
            "answer_text": "You don’t. You write a character who is gay. You might think that means the same thing, as, “Write a gay character,” but that subtle change of wording makes leagues of difference. It makes the difference between Netflix gay characters, whom tend to have the issue of gay is their personality, and wonderful gay characters like Captain Ray Holt in Brooklyn Nine-Nine. Ray Holt is an accomplished man who is gay. Write your character, and then decide if they’re gay, and do keep in mind, that anyone can be gay. From the buff manliest body builder, to the effeminate hairdresser. There are no pre-requisites to be gay. It’s something you’re born as, and opposite can hold true. Soldiers can be gay, and stylists can be straight. Also, don’t just focus on gay people. Write people throughout the LGBT spectrum. Write characters who are gay, lesbian, bisexual, pan, or ace, as well. Can really help with inclusion. ",
            "date": "Answered July 16, 2020",
            "views": "57",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Prathamesh Chavan",
                    "user_href": "/profile/Prathamesh-Chavan-38"
                }
            ]
        }
    ]
}