{
    "title": "How to become better at controlling emotions - Quora",
    "tags": [
        "Self-Control",
        "Self-Improvement Advice",
        "Understanding Self-Improvement",
        "Self-Improvement",
        "Emotions",
        "Understanding Human Behavior"
    ],
    "response": [
        {
            "author_info": {
                "name": "David Hunter",
                "href": "/profile/David-Hunter-69"
            },
            "answer_text": "You shouldn’t ignore emotions. Even if you manage to suppress or stifle an emotion for a length of time, it is always counter productive in the long run. Emotions serve a vital function. They are like pain signals being sent to inform you that something is hurting. The problem is, people confuse the messenger for the message. Getting upset at an emotion without addressing its cause is like getting angry at your hand for hurting while you’re holding it over a hot stove. Remove your hand and the pain stops. As strange as it sounds, however, a lot of people fail to find the source of our emotional distress and would rather blame and ignore the emotion itself. When you don’t allow your emotions to serve their essential function, your entire being get’s thrown out of whack. The communication line between your heart and your mind is cut. Instead of ignoring or repressing your emotions, you need to figure out where they are coming from. To put it very briefly, most of our strong emotions are rooted in fundamental beliefs about ourselves. They are also rooted in basic misconceptions about the nature of reality: what is permanent and impermanent, what poses a real danger or an imaginary danger. Many of these beliefs are formed when we are young, helpless, defenseless, and simply want to be loved. That’s one of the reasons people are inclined to ignore their emotions. Addressing your emotions often takes you back to a place of vulnerability and helplessness. Addressing your beliefs about the nature of the world can trigger strong resistance from yourself and others. I can’t summarize the whole path I follow in one answer, but here’s what I recommend. If an emotion is bothering you, you need to stay with the emotion and then follow it to it’s source. Find the beliefs that are causing you pain. You do this by just feeling the emotion as an observer, not wanting to change it any way. The beliefs at its root will eventually become clear to you. It will often become clear as a physical sensation or intuition. You will link the emotion with a sensation in the body, which will then allow you to revisit the belief or the trauma at its origin. Then you need to-without judgment and with nothing but compassionate awareness and acceptance- analyze the belief and start to realize that it is nothing more than an illusion. This can take repeated, patient and courageous revisitation. We often compulsively and unconsciously repeat the beliefs that harm us most, inflating them into little dramas that repeat as well. Seeing these dramas unfold from a place of neutrality and warmth, we can slowly understand that our hurtful beliefs about ourselves are rooted in circumstance and distorted perception, not in present reality. We tell ourselves a lot of stories. It’s important to know that that is all they are: stories. They can keep us amused and entertained, but they should never cause us pain. Once you have realized that the core belief at the root of the emotion isn’t ‘real’, the negative emotions that are attached to it have nothing to cling to, and they go away. ",
            "date": "Updated August 25, 2019",
            "views": "32",
            "upvotes": " View 15 Upvoters",
            "upvoters": [
                {
                    "user_id": "Cyrus White",
                    "user_href": "/profile/Cyrus-White"
                },
                {
                    "user_id": "Ashley Garcia",
                    "user_href": "/profile/Ashley-Garcia-1197"
                },
                {
                    "user_id": "Lisa Schwartz",
                    "user_href": "/profile/Lisa-Schwartz-118"
                },
                {
                    "user_id": "Ammar Khan",
                    "user_href": "/profile/Ammar-Khan-733"
                },
                {
                    "user_id": "Imis Giab",
                    "user_href": "/profile/Imis-Giab"
                },
                {
                    "user_id": "Jackie Barnett",
                    "user_href": "/profile/Jackie-Barnett-32"
                },
                {
                    "user_id": "Erik Vargas",
                    "user_href": "/profile/Erik-Vargas-1"
                },
                {
                    "user_id": "Katia Thorsvik",
                    "user_href": "/profile/Katia-Thorsvik-2"
                },
                {
                    "user_id": "Swati Dubey",
                    "user_href": "/profile/Swati-Dubey-227"
                },
                {
                    "user_id": "Philip Parsons",
                    "user_href": "/profile/Philip-Parsons-9"
                }
            ]
        },
        {
            "author_info": {
                "name": "Liz Huber",
                "href": "/profile/Liz-Huber-4"
            },
            "answer_text": "As an Entrepreneur, I experience an Emotional Rollercoaster every single day. But if I want to stay productive and be happy, I need to master these emotions. That’s why I have added the 4-Step-Emotional Reset Process as an absolute essential to my Entrepreneur Toolkit. I am not the inventor of the process, it is rather an adaptation of the many variations of this out there. For example the 90 seconds rule from Robyn Openshaw from her book “Vibe”. How the 4-Step-Emotional Reset works The 4-Step-Emotional Reset is designed to move you from a deeply negative emotion like fear or anger through a simple, 4-step process of accepting, metabolising, reframing and releasing the emotion. The goal is to let go of your negative emotion quickly so you can move on with your day. However, the process is NOT about ignoring your emotions — it is actually the opposite: it is about actively dealing with an emotion so you can extract the lesson or insight it is trying to tell you without letting yourself get caught up in it for hours. This helps you to operate at peak performance as much as possible and lets you truly enjoy the moment without being clouded by lingering negative emotions. Here is are the 4 Steps: Step 1: Notice & Accept your Emotion When you notice a negative emotion or thought entering your mental space, stop, take a deep breath and actively acknowledge your emotion. Remind yourself that you can’t control which thoughts and feelings are entering your mind. Suffering and experiencing negative emotions is inevitably part of our shared human condition. Ask yourself: How do I feel right now?What is happening?How is it affecting me?For example: “I notice that I am feeling angry and annoyed at myself. Maybe a little bit anxious and nervous as well. It is giving me a hard time to relax and enjoy the evening with my boyfriend. But it is okay because I know that experiencing this emotion is part of being an imperfect human and I am going to move through this now.” Step 2: Metabolise the Emotion & Extract the Lesson Ask yourself: Why am I feeling X (insert negative emotion)?What is this feeling trying to tell me?What can I learn from this experience?What are actionable steps I am taking away from this?For example: “I think I am feeling angry and anxious because I wasn’t able to finish all the things I wanted to get done today. Through this experience, I realise that I might have over-scheduled my day today and underestimated the time it would take me to complete certain tasks. To deal with this better in the future I will try the following tomorrow: Define 1–2 most important tasks for the day and focus on completing them. After that, see everything else that gets done as a bonus.” Step 3: Reframe Ask yourself: How could I see this differently?What if I reacted the opposite way?For example: “If I am being honest with myself, I actually got a lot done today. I was able to complete a big project for my business, research a new marketing channel, squeezed in a 30min workout, did the groceries and booked a hotel for an upcoming trip. Finding and booking the hotel took way longer than I expected but the good thing is that I found a really nice one and I can now really look forward to that trip. So I am deciding to focus on being proud of the things I DID get done and feeling joyful and excited about the upcoming trip.” Step 4: Release Take a deep breath and consciously choose to let go of the experience and fully immerse yourself in the positive emotions of the reframing exercise. If you are having troubles finding a positive emotion to feel instead, try feeling grateful. It works every time, because you can feel grateful for the most “basic” things like having a warm place to sleep, that you and your family are well or that you get to work on your company every single day. For example: “I’m releasing all the negative energies of this experience and keeping only what I’ve learned. I am feeling accomplished and joyful now.” If you are just getting started with the 4-Step-Emotional Reset, try writing in your journal as you go through the steps one-by-one. It helps you move through the process quickly and prevents you from getting stuck over-analysing the situation. Over time you will get better and faster at this process and you’ll be able to do it on the fly — wherever you are — letting go negative emotions within minutes, if not seconds. What you need to make the process work for you: Although the process sounds easy, you might actually find it very hard. If this is the case, go back to basics and do the following steps first: 1. Develop sufficient Self-Awareness Being aware of how and what you feel is an absolute pre-requisite for applying the 4-Step-Emotional Reset Process successfully. Meditation and journaling can be great tools to deepen your self-awareness and pin-point your emotions. Another great way is to take multiple little breaks in your day where you stop what you are doing and ask yourself “How do I feel?”. If you get to a point where you are able to describe your emotions in 1 or 2 words, you are ready to apply the 4-Step-Emotional Reset Process. 2. Make the Choice to Feel Great If you want this process to work for you, you need to make a deal with yourself. You need to WANT to feel great and move on from negative emotions. Letting go of anger and fear is a CHOICE. Don’t underestimate this. Some entrepreneurs are addicted to the rollercoaster because deep down they believe this is how it is supposed to be. Building a company is SUPPOSED to be hard. No pain no gain! But there is a better way: you CAN feel great and still be very successful. Or rather: be very successful BECAUSE you feel great and you are able to use the lessons from the emotional rollercoaster without spending hours spinning in it. Making this deal with yourself is especially important if you started your business because you wanted to FEEL better (e.g. because you hated your job or you wanted more flexibility). In 2017, I quit my job to feel more fulfilled, more free, more motivated and more excited in my life and work. But a few months into starting my business I had to be honest with myself: On average, I was feeling WORSE. I was not dreading to go to work anymore, but I suffered from chronic anxiety and inability to relax. I felt more purpose in my day to day life, but I felt guilty for every minute I spend away from my business. Until I made the active choice to feel GREAT. EVERY SINGLE DAY. I still feel guilty, angry and anxious on some days but now I am able to metabolise these emotions and let go of them in less than 5 minutes. 3. Be Willing to Work through your Emotions There is a second deal you need to make with yourself if you want to benefit from the 4-Step-Emotional Reset Process: The decision to work through and deal with your emotions. If you are used to swallowing and ignoring your emotions and “just getting on with shit”, you are most likely missing out on the valuable insights that are underlying your emotions. You will experience the same negative emotion over and over again without learning the lesson and taking the action to improve the underlying issue. And in some cases, this could be very dangerous for business if you are ignoring important emotional signs (also called your intuition) when it comes to vital decisions. Or it could be very dangerous for your health & well-being if you are ignoring the signs to slow down or take action to deal with your chronic anxiety. ",
            "date": "Answered February 28, 2018",
            "views": "23",
            "upvotes": " View 14 Upvoters",
            "upvoters": [
                {
                    "user_id": "Rhea Bansen",
                    "user_href": "/profile/Rhea-Bansen-1"
                },
                {
                    "user_id": "Afia Lubaina",
                    "user_href": "/profile/Afia-Lubaina"
                },
                {
                    "user_id": "Ashley Garcia",
                    "user_href": "/profile/Ashley-Garcia-1197"
                },
                {
                    "user_id": "Ammar Khan",
                    "user_href": "/profile/Ammar-Khan-733"
                },
                {
                    "user_id": "Taylor Gambino",
                    "user_href": "/profile/Taylor-Gambino"
                },
                {
                    "user_id": "Norhan Bitar",
                    "user_href": "/profile/Norhan-Bitar-1"
                },
                {
                    "user_id": "Isaiah L. Wright",
                    "user_href": "/profile/Isaiah-L-Wright"
                },
                {
                    "user_id": "Amono Komona",
                    "user_href": "/profile/Amono-Komona"
                },
                {
                    "user_id": "Sidi Mohamed Bounoua",
                    "user_href": "/profile/Sidi-Mohamed-Bounoua"
                },
                {
                    "user_id": "Ayaan Husain",
                    "user_href": "/profile/Ayaan-Husain"
                }
            ]
        }
    ]
}