{
    "title": "How to start writing an article in Tamil - Quora",
    "tags": [
        "News Articles",
        "Tamil (language)",
        "Writing Advice"
    ],
    "response": [
        {
            "author_info": {
                "name": "Bharath Kumar",
                "href": "/profile/Bharath-Kumar-741"
            },
            "answer_text": "Great! I really appreciate you for showing interest in writing article in Tamil. First, choose the topics that you want to write. Then, just note them as points and the information in relevance to those topics in english, or any other language you are comfortable with, even maybe colloquial tamil. Then, read it yourself. Upon reading it again and again, you may do some improvisations. Repeat this step until you are satisfied. Next will be obvious. Share them with your friends who are also interested in tamil, and most importantly, persons who will encourage you. Make sure that those persons should also be able to correct your wrongs without any hesitation. But before all these steps, the simplest way to get yourself so strong in tamil is to start your own blog and try to write some small stories, or real life incidents, or any other thing that interests you. You may also get many suggestions from many tamil experts and also from your viewers for the topics that they are interested in so that you can also know the interests of the people who are gonna read your article in the near future. And last but not least, don’t ever give up on this whatsoever might happen, and be genuine in writing. All the very best, and I am eagerly waiting for your first article in the very near future. Hope this helped you. Cheers! ",
            "date": "Answered November 8, 2018",
            "views": "23",
            "upvotes": " View 7 Upvoters",
            "upvoters": [
                {
                    "user_id": "Aafrin Fathima",
                    "user_href": "/profile/Aafrin-Fathima-3"
                },
                {
                    "user_id": "Mahalakshmi Mahalakshmi",
                    "user_href": "/profile/Mahalakshmi-Mahalakshmi-54"
                },
                {
                    "user_id": "Munusami Sreenivasan",
                    "user_href": "/profile/Munusami-Sreenivasan"
                },
                {
                    "user_id": "Shanthi Balakumar",
                    "user_href": "/profile/Shanthi-Balakumar"
                },
                {
                    "user_id": "Mangani Selvaraj",
                    "user_href": "/profile/Mangani-Selvaraj"
                },
                {
                    "user_id": "Santhiya Viswanathan",
                    "user_href": "/profile/Santhiya-Viswanathan-1"
                },
                {
                    "user_id": "Iswaryalakshmi",
                    "user_href": "/profile/ஐஸ்வர்யலக்ஷ்மி-Iswaryalakshmi"
                }
            ]
        },
        {
            "author_info": {
                "name": "Sivakumaran Manivachakam",
                "href": "/profile/Sivakumaran-Manivachakam"
            },
            "answer_text": "The basics we should know before answering the question are 1) are you already writing articles in other language(s) and wants to extend your skill in Tamil 2) or you are new to the field of writing articles 3) the purpose of writing - to share ideas and thoughts or to add more readers to you in Tamil also 4) where do you want to publish your article — in a literary magazine, in a scientific journal, or communicating through social media. This is to know what type of readers you want to attract. Anyway , if your idea is to translate , it is very simple. Put it down as you feel, get it corrected through a person with experience. During the course of time you can write without corrections. Or you know Tamil and new to the field of article writing, first collect all your points you want to convey. Put them in order . Divide them as paragraphs for relevant ideas/ points. Introduce the subject first in the introduction para. Develope relevant points as subject matter. Conclude what you want to impress upon as theme. Close the subject with the words so as it can be reopened for more discussions. Style of language depends on the type of readers you are focusing. Perfectoin comes after practice, but jump in the pool to swim! Best of luck. ",
            "date": "Answered November 8, 2018",
            "views": "851",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Vishnu Priya Ramesh",
                "href": "/profile/Vishnu-Priya-Ramesh-1"
            },
            "answer_text": "Read read read!!!! Read a lot of Tamil books and articles. Start with writing small stories or notes. This helps you in writing fluently in Tamil and mitigate the spelling/grammatical mistakes ",
            "date": "Answered November 7, 2018",
            "views": "476",
            "upvotes": "0"
        }
    ]
}