{
    "title": "How to write a thank you letter for an interview fiasco - Quora",
    "tags": [
        "Thank You Letter",
        "Thank You Notes",
        "Writing Letters",
        "Gratitude",
        "Job Interview Questions",
        "Interviews",
        "Manners and Etiquette",
        "Writing Advice",
        "Job Interviews"
    ],
    "response": [
        {
            "author_info": {
                "name": "Sarabjeet Sachar",
                "href": "/profile/Sarabjeet-Sachar"
            },
            "answer_text": "Hi Partha, It happens with most that at that moment when you have to say the right thing, we say something which is inappropriate and later realise it. This is a huge opportunity for you to demonstrate your ‘attitude’ towards how you respond when there is a mistake made. Look at it that way and structure your note with the following 4 things while writing a thank you note: 1] First thank the interviewer for his/her time and inputs you got during the interview. 2] Appreciate something about the interviewer or the organisation which you genuinely were impressed with. It is always human tendency to feel more connected to people who notice and appreciate us. 3] Mention that there has been a great learning ( referring to the fiasco) and say that you reflected on it. Then share your point of view of how you would approach it to make it effective. Do some additional research to back up your point. Accepting one’s mistake and then offering a corrective measure reflects a great positive attitude. Because in work situations too no one is perfect and bound to make errors. It is more important what you choose to do about it rather than simply focusing on the fiasco. 4] And finally reiterate your interest level in the job and tell the interviewer that you are keen to have another opportunity to meet them if required. If not, simply communicating about your interest level itself leaves a good impression about you. Trust this helps ! Best of luck! Sarabjeet Sachar Founder & CEO www.aspirationjobs.com ",
            "date": "Answered October 24, 2020",
            "views": "134",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Nidhi Verma",
                    "user_href": "/profile/Nidhi-Verma-47"
                },
                {
                    "user_id": "Jayant Grover",
                    "user_href": "/profile/Jayant-Grover-6"
                }
            ]
        }
    ]
}