{
    "title": "How to write a letter to my crush? What should I say - Quora",
    "tags": [
        "Letters (mail)",
        "Crushes",
        "Writing Advice"
    ],
    "response": [
        {
            "author_info": {
                "name": "Danielle Parker",
                "href": "/profile/Danielle-Parker-83"
            },
            "answer_text": "It depends on how much you’re crushing on them, if you two are close, or if you feel like you’re ready. If it’s not that big a crush but you still want to tell them, be short and quick to the point. If they’re your best friend you’ve known for several years, you want to write more in depth about how you feel and kinda write about the fun things you’ve done together, saying something like “I wanna do that more”. If they’re just a friend that you kinda know you could say you want to get to know them better and explain your feelings for them (although don’t profess your undying love for them. Several guys I know have done that and it never worked out, just scared the girls away). Also think about how they’re likely to take it. If they’re shy then being too foreword about it might freak them out. All in all though, it’s probably better to tell them in person. ",
            "date": "Answered May 25, 2018",
            "views": "43",
            "upvotes": " View 2 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Sarah S",
                    "user_href": "/profile/Sarah-S-725"
                },
                {
                    "user_id": "Michael Silver",
                    "user_href": "/profile/Michael-Silver-68"
                }
            ]
        },
        {
            "author_info": {
                "name": "Jessica Mogilevichkova Prochazkova",
                "href": "/profile/Jessica-Mogilevichkova-Prochazkova"
            },
            "answer_text": "I love this idea! There is something so romantic, in the extreme, fundamental sense of the word. Powerful. Intense. Committed. With this being said, I would be remiss not to caution you . Simply for I know not of whom you have in your sights ,and this fashion of expression may not be taken as it is intended, or as it was in a less tech advanced world. Certainly if it is “you”, and such of your being, as I feel it must be , carry on! The response would carry such telling. This type of writing is for the writer, as opposed to the reader. Meaning, it is your very own personal core in ink. Let it flow from you. Do not, I repeat, do not begin this undertaking, if it comes with expectation, or manipulation. Ill not bore to explain the obvious here. Three bits of advice; do not ramble indefinitely. Remain focused, and on point. Always give an open reread. And most importantly, do not forget to mist you fragrance ever so long lightly. Love is for all the senses. And best of luck! ;) ",
            "date": "Answered May 28, 2018",
            "views": "27",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Caesar Ekene",
                    "user_href": "/profile/Caesar-Ekene"
                }
            ]
        },
        {
            "author_info": {
                "name": "Szabolcs Pap",
                "href": "/profile/Szabolcs-Pap-2"
            },
            "answer_text": "With a pen on paper…you write letters that make up words that hopefully make up sentences that will hopefully make sense and convey your feelings. don't drool on it though… Lol Or you can write a email text or whatever really. Just tell em you got a crush on them or go into all that metaphorical expressions. Really whatever floats your boat, and won't turn you into a blushing mess before you can actually send or give them the letter. ",
            "date": "Answered July 27, 2020",
            "views": "262",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "David Miller",
                "href": "/profile/David-Miller-1180"
            },
            "answer_text": "Don’t say too much. Hopefully it will be the first letter of many between you two. Save the more serious things for later when you know each other better. Write about something that you both enjoy. Ask a question about what they think about the subject. Hopefully, that will cause them to write back. Keep it light and friendly. If something more comes of the relationship someday, fine. If not, no harm done with a few friendly letters. ",
            "date": "Answered May 25, 2018",
            "views": "53",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Sanaka Dinesh",
                    "user_href": "/profile/Sanaka-Dinesh"
                },
                {
                    "user_id": "Wimalka Rathnayake",
                    "user_href": "/profile/Wimalka-Rathnayake-1"
                },
                {
                    "user_id": "Linda Chelmowski",
                    "user_href": "/profile/Linda-Chelmowski"
                }
            ]
        },
        {
            "author_info": {
                "name": "Alka Azalea",
                "href": "/profile/Alka-Azalea"
            },
            "answer_text": "i had a crush on someone he was very cute and handsome just like troye sivan when he was in school i wrote a letter but i didn’t write my name coz i don’t want it to be obvious because he was 3 years older than me its just what happened. and now i don’t know where he is sad for me……….. ",
            "date": "Answered July 27, 2020",
            "views": "172",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Efrayim Bulka",
                    "user_href": "/profile/Efrayim-Bulka-1"
                }
            ]
        }
    ]
}