{
    "title": "How to build confidence in myself - Quora",
    "tags": [
        "Improving Self-Confidence",
        "Mental Health Advice",
        "Self-Esteem",
        "Self-Confidence",
        "Understanding Self-Improvement",
        "Understanding and Improving Mental Health"
    ],
    "response": [
        {
            "author_info": {
                "name": "Anthony Andranik Moumjian",
                "href": "/profile/Anthony-Andranik-Moumjian"
            },
            "answer_text": "Everyone in your ecosystem is the same in most ways. We have different heights, of course. Some male, some female. All of us go to the bathroom in the same way, and all of us clean our bottoms. At some point, all our lives end. The difference between you and those who society places above you is perception. Building confidence in yourself is the thought experiment in which every problem in your life has an array of solutions. More importantly, it’s the confirmation that those solutions don’t require nervousness or anxiety. Successful people grown from the bottom by themselves have this. Because, along the curve of existence, they learned quicker than the rest how to adapt and survive. Society places a lot of value in the idea of self-made individuals. The reason for this is obvious: They relate better. You think to yourself that one day this person could be you. And you’re right. This person could be you. Why doesn’t the rich person who came from rich parents matter as much? Why can’t most people even pretend to like those such as Kim Kardashian or Donald Trump? These people were born to wealth. Kim Kardashian sprung into the limelight partly due to her father and partly due to a sex-tape with a second-rate celebrity. Donald Trump’s fortune came from his father’s illegal real estate construction projects with the Federal Housing Authority (aka the taxpayer)—he would grossly over-estimate construction costs and frequently refuse to provide low-cost housing to African American families. When you come from zero and make it to the top, you’re legend to most. People render you larger than life. You’re almost not human. When people think about Keanu Reeves, they think about the nicest human on the planet. He’s not flashy, he has a million amazing stories about his kindness, he looks relatable, he plays in movies that everybody loves. But neither Donald Trump or Keanu Reeves is larger than life. These are people no different than you and me. Trump is overweight and has had terrible hair transplants. This is a man who suffers from very serious self-esteem problems. He has this hideous orange tint to him that nobody stops making fun of. Keanu is, quite literally, you and me. One of his best friends, River Phoenix, overdosed and died when they were young adults. The power of this short existence is the gift you’ve been given to enable change. To figure one thing out and own it. I look at mathematicians that existed before my time and I think about the brilliance it took to connect the ideas about gravity, calculus, relativity, or electromagnetism. All of those people were no different than the people of today. Actually, those people had far less than we have today. Everyone today has a computer in their pocket. 400 years ago, nobody even had a calculator. To crunch large numbers they needed to use logarithms. The most powerful moment in all of history to better yourself is exactly right now. Every resource you could have ever dreamed of now exists. If you told Isaac Newton about computers today, you’d blow his mind. Whether it’s Leonhard Euler or Keanu Reeves, they’re people, like you and me, who were driven to change the contents of their reality. Their contributions span from transcendental numbers to amazing cinema. To sit around and think about building your confidence is a waste of precious time. In the end, you don’t have enough of that precious ticking resource. The odds of our existence right now are essentially zero. If you are breathing, you’re already in an exclusive club of those that exist. You are the event of a long span of lineage that went unbroken, from physical and chemical processes that came from the stars, with some probability and luck that the sperm and egg specifically made you out of anybody else it could have created. Your confidence doesn’t need to be built. You don’t need to be built. You being here is a privilege all on its own. ",
            "date": "Answered March 24, 2020",
            "views": "951",
            "upvotes": " View 13 Upvoters",
            "upvoters": [
                {
                    "user_id": "Caroline James",
                    "user_href": "/profile/Caroline-James-116"
                },
                {
                    "user_id": "Andre Lalonde",
                    "user_href": "/profile/Andre-Lalonde-2"
                },
                {
                    "user_id": "Elexia Nicholson",
                    "user_href": "/profile/Elexia-Nicholson"
                },
                {
                    "user_id": "Lisa Camille",
                    "user_href": "/profile/Lisa-Camille-6"
                },
                {
                    "user_id": "She Hud",
                    "user_href": "/profile/She-Hud"
                },
                {
                    "user_id": "Ebeku Gerald",
                    "user_href": "/profile/Ebeku-Gerald"
                },
                {
                    "user_id": "Awunli Edith",
                    "user_href": "/profile/Awunli-Edith"
                },
                {
                    "user_id": "Hina Zahoor",
                    "user_href": "/profile/Hina-Zahoor-5"
                },
                {
                    "user_id": "Brown Eyes Are Beautiful",
                    "user_href": "/profile/Brown-Eyes-Are-Beautiful"
                },
                {
                    "user_id": "Lane Votapka",
                    "user_href": "/profile/Lane-Votapka"
                }
            ]
        }
    ]
}