{
    "title": "How to get ideas to write - Quora",
    "tags": [
        "Creating Writing Advice",
        "Ideas",
        "Creative Writing",
        "Writing Advice"
    ],
    "response": [
        {
            "author_info": {
                "name": "Aidan Colyer",
                "href": "/profile/Aidan-Colyer"
            },
            "answer_text": "Ideas can be tricky to come up with for many people so you are not alone. Personally I often have a lot of ideas but when I open a blank document on word my mind goes blank. I have found a few ways round this and now have lots of ideas that I can go to. I will outline some of the methods that I have used below.  I found that the issue was the blank page. This, I discovered, is quite common. The question is do you have ideas when you are not staring at that blank page? I found that this was one of my main issues. The answer to this is simple. Keep a notebook near you as often as you can. Then write down bits of ideas that come to you when you are walking down the street, on your lunch break, sat watching TV etc.. next time you sit down at a computer you can then use some of these ideas to start writing. This can also lead to issues of writers block when you exhaust the idea and still cant get into the story. I shall return to this a bit further down. You can also use Google to find lists of novel ideas. The best ones are one line questions or scenarios. Everyone will come out with a different story from these whereas a more detailed plan may lead you to write a similar piece of work to others and then you can slowly get into issues of plagiarism etc. so its best to go for the one sentence ideas as a base line. Work through these writing down the ideas that you like and try to expand a little as you write them down.  Free writing. This is an interesting technique. I use it to expand ideas rather than in the more conventional sense it is for. Normally you would just start typing or writing literally anything. whatever comes to mind. type about the fact you cant think of an idea, describe the wall or scene behind your computer write about an issue rattling around in your brain, type I can do this over and over and over again... anything goes down. Then after a set time stop and read it. there may well be a gem in there. Copy and paste that into another document and keep going. I tend to use this technique with one line questions or ideas. I just write practical things around the idea. Say you have a sci-fi idea. answer questions about what weapons, what ships, what planets, who lives on them, what government they have, what is the plant life like. In essence start building the world and a story may appear. Why do they have that type of government with their technology etc.. As I mentioned above I wanted to return to a point. Writers block. I found a good way round this is planning. I have a series of templates set up that I can fill in. Some are practical. These ones are a breakdown of how many chapters, how many words in them, how much has been written and edited. These help to keep me going. If I can see that I have written three chapters in two weeks then that gives me hope that I can do the same till I finish. I use this to set targets as well which can help a lot. I also have plot outlines and roughly what I want in each chapter. That way if I get stuck I can skip ahead to start on another chapter and still make progress. I have other files where i have character information. Sometimes I also generate a bunch of characters and names ahead of time so I don't get stuck on a name and can just throw one in (you can change the name later) and keep the writing flowing. As an aside I am a roleplayer and tend to use roleplaying resources to build characters as they are quite formalised and don't require as much thought to make a bare bones character so that is a route you could go. A lot of the time these planning sheets end up with less information added as I get further into the novel and just record my word counts. This is a good sign that the story is flowing. They can then be used in editing to track things as you go along.  To sum up. If you cant think of any yourself even away from the computer use prompts found on the internet to kick start the process. You may well find the issue is just that blank page open when you want to start writing an idea! ",
            "date": "Answered March 12, 2016",
            "views": "256",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Sheri Fresonke Harper",
                    "user_href": "/profile/Sheri-Fresonke-Harper"
                }
            ]
        },
        {
            "author_info": {
                "name": "Mike Bowerbank",
                "href": "/profile/Mike-Bowerbank"
            },
            "answer_text": "Some terrific advice here, which saves me a lot of writing. :-) I will second the idea of running through \"what if?\" scenarios in your mind. Make curiosity a habit. As an example, if you see a simple crow outside your window, start asking \"what if?\" questions about crows. What would crows look like if there were crows on Mars? What if crows were meat eaters and developed a taste for humans? What if crows were spirits of the deceased with messages or warnings for the living? That sort of thing.  Do you already have a main character in mind? Let's say your protagonist is Joe Cool (thank you Snoopy) and your story is a detective story and it's set in 1964. What else was happening in the world in 1964? What does Joe think of it? How does the events of 1964 shape the person he is? If it takes place today, read the news. How would your character react to pop culture, music, TV, movies, politics, the state of the world, etc. The more you explore, the more ideas will come. Find those \"getting to know you\" quizzes on the internet and fill one out as your character.  My second suggestion is mind-mapping.  How to Use Mind Maps to Unleash Your Brain's Creativity and PotentialI always mind-map when I'm stuck.  Also, never, never, EVER stare at a blank white screen. Distract yourself. Read. Cook a new recipe. Walk around the block and try to observe ten new things in the neighbourhood you hadn't noticed before. (In short, try to stimulate different sections of your brain.)  Carry a small notebook and pen everywhere you go. Any time even the slightest idea pop into your mind, pause what you're doing and write it down. Eventually, one idea will intersect with another idea, and a plot is born! ",
            "date": "Answered December 9, 2015",
            "views": "952",
            "upvotes": " View 15 Upvoters",
            "upvoters": [
                {
                    "user_id": "Sheri Fresonke Harper",
                    "user_href": "/profile/Sheri-Fresonke-Harper"
                },
                {
                    "user_id": "Thaddeus Howze",
                    "user_href": "/profile/Thaddeus-Howze"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/White-Walker-70"
                },
                {
                    "user_id": "Lucy Engels",
                    "user_href": "/profile/Lucy-Engels"
                },
                {
                    "user_id": "Afsar Saman",
                    "user_href": "/profile/Afsar-Saman"
                },
                {
                    "user_id": "Leon Orozco",
                    "user_href": "/profile/Leon-Orozco"
                },
                {
                    "user_id": "Andre Matthews",
                    "user_href": "/profile/Andre-Matthews-2"
                },
                {
                    "user_id": "Connie Gamarra",
                    "user_href": "/profile/Connie-Gamarra-1"
                },
                {
                    "user_id": "Sparsh Thakur",
                    "user_href": "/profile/Sparsh-Thakur"
                },
                {
                    "user_id": "Pratik Dash",
                    "user_href": "/profile/Pratik-Dash-3"
                }
            ]
        }
    ]
}