{
    "title": "How does a publishing house work and how important is it in publishing a book? - Quora",
    "tags": [
        "Publishing Houses",
        "Publishing Industry",
        "Publishing Companies",
        "Digital Publishing",
        "Publishers",
        "Self-Publishing",
        "Book Publishing",
        "Publishing",
        "Writers and Authors"
    ],
    "response": [
        {
            "author_info": {
                "name": "Judy Gill",
                "href": "/profile/Judy-Gill-2"
            },
            "answer_text": "First, how a publishing house works: You write a story or a how-to-manual or some other book that could be of interest to the public.You send your work to the publishing house and ask if it interests them and fits their needs.If it does and they accept it, they pay you for the right to publish it by offering you a percentage of the earnings your book will make.They provide editing, cover art, printing, binding and shipping at no cost to you.If your book earns more than the amount they agreed to pay you upfront (called the Advance), they eventually send you royalties.As you can imagine, it’s pretty hard to publish a book without a “publishing house” of some sort, whether it’s in a glass-and-steel office tower in New York or London, or an online site where you upload your work and have it made available in digital and/or print to readers who pay for the privilege of reading your work. Some of those online sites are independent publishing houses, known as Indies. They, like the glass-and-steel jobs, also provide editorial and formatting services at no cost to you, and get your work into the hands of readers, paying you a portion of the earnings. Others are self-publishing platforms such as Amazon Kindle, Smashwords, Draft2Digital and others I may not know about. None of the three mentioned above charge you for their services but they do take a cut of your earnings. Some offer the option of “going to print” or “releasing in audible” both of which are viable formats that will help you reach wider audiences and earn you a little more money. If you run into a publishing house that wants you to pay for their services, please run the other way unless your work is a slick coffee table book filled with glorious photos of your family’s extraordinarily beautiful babies. Most glass-and-steel places will avoid such books and self-publishing venues won’t do them justice. ",
            "date": "Answered August 17, 2019",
            "views": "292",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Logan Brooks",
                    "user_href": "/profile/Logan-Brooks-54"
                },
                {
                    "user_id": "Neil Aitken",
                    "user_href": "/profile/Neil-Aitken-7"
                }
            ]
        }
    ]
}