{
    "title": "How to get my writing to connect with my audience - Quora",
    "tags": [
        "Audience Targeting",
        "Audiences",
        "Creative Writing",
        "Blogging",
        "Writers and Authors",
        "Writing Advice",
        "Writing"
    ],
    "response": [
        {
            "author_info": {
                "name": "Ritu Kaushal",
                "href": "/profile/Ritu-Kaushal-1"
            },
            "answer_text": "Does it connect with you? Does it bring you to tears or make you laugh? I think writers are pretty astute. If it’s boring us as we are writing it, it’s pretty much a given it’s going to bore the reader. But if it moves you as you write it, there’s energy there. And it’s that energy that will connect with your reader. Writers write from two places. Sometimes, we get stuck in our minds because we are such thinking creatures OR because we have had some trauma in the past and we are disassociated and fleeing into our minds. But sometimes, we write from deep within our bodies. And that’s the best kind of writing. It’s embodied. We are writing about things we KNOW. That knowing, that clarity is hard to fake. So, if you write about things you know are true, if you write from your own personal truth, it’s going to connect. Because true things have a resonance, and people can feel them. I hope this helped some. Writing is both an art and a craft. So, getting better at the craft through practice is important. And so is surrendering to the process and letting the art come through. ",
            "date": "Answered July 14, 2020",
            "views": "76",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Ryan Barnes",
                    "user_href": "/profile/Ryan-Barnes-35"
                }
            ]
        },
        {
            "author_info": {
                "name": "Christian Killeen",
                "href": "/profile/Christian-Killeen"
            },
            "answer_text": "Firstly realise that the early drafts of something is never going to be perfect. It will probably sound wooden and dull and lack a lot of the life that you notice in the books you love. I find that's because I have so much in my mind and so much to put down on the page that I will never get it right the first time. Please take your time. Just get down some basic ideas and over many drafts refine the work and try different parts in different places. Keep working on it. Keep reading and rewriting and noticing parts that need adjustment. Eventually it will have all the detail and life that you have in your mind when you first thought of it. One of the best writers I've come across, Patrick Rothfuss, took 9 years to get his first book published. Also, pick a couple mates or family members to read it. Don't tell them what they're reading. You know the characters but they don't so their impression will be gold dust. Ask them to be brutally honest. It will be uncomfortable to begin with but it will help. ",
            "date": "Answered July 10, 2020",
            "views": "64",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Ryan Barnes",
                    "user_href": "/profile/Ryan-Barnes-35"
                }
            ]
        }
    ]
}