{
    "title": "How to approach companies for sponsorship - Quora",
    "tags": [],
    "response": [
        {
            "author_info": {
                "name": "Evgenios Petoumenos",
                "href": "/profile/Evgenios-Petoumenos"
            },
            "answer_text": "A company, is its people. So to approach a company you should approach one of them. Here are a couple of thoughts to keep in mind. Where? Acquaintances can be made during events (e.g. a conference or an event for the launch of a project that the company has funded), through people you might know -who know people- don’t be shy ask to be introduced, reaching the call center and asking for the person or division responsible for sponsorships and so on. Most important however, is the next point. Who? Fund raisers tend to believe that if they approach the person being highest in the hierarchy they will make their case heard. No. The point is just to find one person and no matter how low in the hierarchy, focus on them. Help them see the value the company can get supporting you. He or she can be your best or worst ambassador. How? Approach them gently -but not humbly, state briefly your case, ask if they would be interested to hear more, follow up after a couple of days to organize a meeting (briefly remind what the value would be). If nobody returns the call, send an email. If nobody answers to your email, give another call after a week. Again if nothing happens, don’t lose more time. Go for the next one and come back after some time until you get a clear “yes” or “no”. You deserve to have that. Remember: Corporate people struggle to budget what they will have for the year. Respect that by offering some figures that will help make your case. Avoid: Getting frustrated when trying to communicate. “You told me to call you yesterday but nobody was answering” is not the best sentence to make your case. Not dealing with your own feelings. You might know how huge your idea can get; however, for someone who knows nothing about it, it really is nothing. So when they say “why is it so important?” or “there’s no potential here” don’t lose it. Calmly explain your points two and three and four times. Not wanting what they can give. You need everything a corporation can offer: cash, know-how, business plans, facilities, volunteers. Even if you don’t see an immediate use for something, always say “we’ll take it”. Then go back to figure out the best use for what they gave. Keep them happy, involve them, make them ambassadors of your work. They will bond with what you’re doing. Then money will follow. Wear no hats. For some reason the old-school phrase “now i’m gonna wear my other hat” (meaning i’m gonna put myself in your shoes) is still used. Don’t say it. Ever. Nobody can ever know the specific context under which the person with whom he’s talking, is there. And you just sound naif and funny. We were the first ones. Overstating the fact that you were the first to have done something, usually means two things: 1. “we cannot cope with competition”, 2. “we’re afraid we won’t have other ideas”. Thankfully, money does not go to those who had a moment of brilliance, but to those who managed to take it to the next level. So if you’re stuck repeating this “first one” thing, you’re repeatedly shooting your legs – not only towards being funded, but as a whole in terms of your mindset. ",
            "date": "Answered September 16, 2016",
            "views": "76",
            "upvotes": " View 11 Upvoters",
            "upvoters": [
                {
                    "user_id": "Sharwadi Shatank",
                    "user_href": "/profile/Sharwadi-Shatank-2"
                },
                {
                    "user_id": "Chandresh Singh",
                    "user_href": "/profile/Chandresh-Singh-35"
                },
                {
                    "user_id": "Yitzchok Fordsham",
                    "user_href": "/profile/Yitzchok-Fordsham"
                },
                {
                    "user_id": "Ghiorghita Popescu",
                    "user_href": "/profile/Ghiorghita-Popescu"
                },
                {
                    "user_id": "Bhautik Delat",
                    "user_href": "/profile/Bhautik-Delat"
                },
                {
                    "user_id": "Shivam Yeole",
                    "user_href": "/profile/Shivam-Yeole"
                },
                {
                    "user_id": "Laxmi Ramagouni",
                    "user_href": "/profile/Laxmi-Ramagouni"
                },
                {
                    "user_id": "Mumeed Melkavi",
                    "user_href": "/profile/Mumeed-Melkavi"
                },
                {
                    "user_id": "Siddharth Jain",
                    "user_href": "/profile/Siddharth-Jain-454"
                },
                {
                    "user_id": "Albert Alba",
                    "user_href": "/profile/Albert-Alba-5"
                }
            ]
        },
        {
            "author_info": {
                "name": "Zac Scy",
                "href": "/profile/Zac-Scy"
            },
            "answer_text": "As I see it there are two approaches: 1) Go wide.2) Go deep. Personally I prefer the second one. Here's what you do. Find out all the possible sponsors you could have and contact them all. Present your case like this: \"Here's the exposure I can give you and this is what I need\" send it out to all of them and see who bites. Basically cold calling. The second one is requires more time and effort. But it also creates something the first one doesn't. Connection.   Let's say you have a blog, alright? You write about a certain topic and you've got your eyes on a perfect partnership with a brand or whatever. Create some content for them without asking for anything in return. You keep doing this over and over and over until they get sick of you. Then, once you've given more than anyone could hope for you can go in for \"the ask\". Remember, there are no guarantees here. What you've done is simply to buy more lottery tickets in order to increase your chances at landing this sponsor. They still have the freedom to say no. A positive side effect of this however is the relationships you've hopefully managed to build along the way. You've probably corresponded with a few of the people there and have connected with them via e-mail, on social media or in meatspace.  Look, the way most people think is in terms of \"What can I get?\" rather than \"What can I give?\". This applies to work, relationships, business etc. If you really need a sponsor right now then go wide. If you want to play the long game go deep. Have a kick-ass ₢eative day! =) ",
            "date": "Answered July 8, 2015",
            "views": "71",
            "upvotes": " View 24 Upvoters",
            "upvoters": [
                {
                    "user_id": "Vineet Varma",
                    "user_href": "/profile/Vineet-Varma"
                },
                {
                    "user_id": "Trio Triga",
                    "user_href": "/profile/Trio-Triga"
                },
                {
                    "user_id": "Monica Michalec",
                    "user_href": "/profile/Monica-Michalec"
                },
                {
                    "user_id": "Simrann",
                    "user_href": "/profile/Simrann-4"
                },
                {
                    "user_id": "Pratik Kalra",
                    "user_href": "/profile/Pratik-Kalra-1"
                },
                {
                    "user_id": "JR Wu",
                    "user_href": "/profile/JR-Wu"
                },
                {
                    "user_id": "Piyush Kumar Sahu",
                    "user_href": "/profile/Piyush-Kumar-Sahu-9"
                },
                {
                    "user_id": "Nuwajuna Destinie",
                    "user_href": "/profile/Nuwajuna-Destinie"
                },
                {
                    "user_id": "NONSTOPDINGO",
                    "user_href": "/profile/NONSTOPDINGO"
                },
                {
                    "user_id": "Jake Oldford",
                    "user_href": "/profile/Jake-Oldford"
                }
            ]
        }
    ]
}