{
    "title": "How to politely respond to a horribly written email asking for clarification - Quora",
    "tags": [
        "Email, Texting, and Voicemail Etiquette",
        "Manners and Etiquette",
        "Email",
        "Social Advice"
    ],
    "response": [
        {
            "author_info": {
                "name": "Mary Vee",
                "href": "/profile/Mary-Vee-15"
            },
            "answer_text": "I would do my best to try and decipher any and all possible meanings the writer might be trying to convey. When you don’t understand what someone is asking, it’s best to appear to be ‘owning’ it so as to allow the illiterate writer to save face. I usually say something like, ‘let me see if I’m understanding your question correctly. Are you asking if (blah blah blah)? Or are you wondering if (such and such)? If you could help for me, I’ll be happy to help in any way I can.’ What they’re asking may be the first thing you suggested, or the second thing, or none of the above, but it will convey to the writer that you don’t understand what they’re saying, BUT THAT YOU WANT TO UNDERSTAND SO YOU CAN HELO THEM. The reason for the all-caps is that that is usually what matters most to people, and if you can convey that to them, there won’t be a ‘stinger’ in the part where you’re diplomatically letting them know that their e-mail was incoherent. ",
            "date": "Answered January 14, 2019",
            "views": "24",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Kate Vergara",
                    "user_href": "/profile/Kate-Vergara-8"
                },
                {
                    "user_id": "Claire Snibbe",
                    "user_href": "/profile/Claire-Snibbe"
                }
            ]
        },
        {
            "author_info": {
                "name": "Pamela Lea",
                "href": "/profile/Pamela-Lea-1"
            },
            "answer_text": "Decipher as much as you can and then find those points where you need clarification. One by one, copy and paste these into a response asking the sender to please clarify. For example, you may say something like “You mentioned dessert but I am not sure if you want this to be just dessert or if this is something to follow a meal. Please clarify.’ Do this point by point. If the e-mail, in its entirety makes no sense, respond telling the writer that you may have just been having ‘one of those days,’ but you were really having trouble understanding what they were saying (or asking). If you have some idea, briefly tell the writer what you think they were saying but wanted to be sure that you had it right. Finally, if it is possible, ask that the writer contact you by phone. So much of communication gets lost when put into writing. If you have the opportunity to talk with the writer, you may be able to get a better sense of what they mean from the tone of their voice, etc. Good luck. ",
            "date": "Answered January 14, 2019",
            "views": "16",
            "upvotes": "0"
        }
    ]
}