{
    "title": "How many paragraphs should an introduction of an essay have? - Quora",
    "tags": [
        "Paragraphs",
        "Essay Writing Help",
        "Essays",
        "Writing Advice"
    ],
    "response": [
        {
            "author_info": {
                "name": "Aimee Hanson",
                "href": "/profile/Aimee-Hanson-6"
            },
            "answer_text": "Writing an essay is not an easy task well you should have to plan your essay first. There are a lot of people who say that an essay should be about five, four or three paragraphs. First, you can introduce your topic to your reader and elaborate little bit about what you are going to say. You can give detail explanation in body text in which you discuss the topic in more detail by using examples, and finally, you have conclusion in the last para of essay. I believe that one intro para is enough and is also a standard. ",
            "date": "Answered October 19, 2019",
            "views": "571",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Zoe Law",
                    "user_href": "/profile/Zoe-Law-21"
                },
                {
                    "user_id": "Aliyah Bricks",
                    "user_href": "/profile/Aliyah-Bricks"
                }
            ]
        },
        {
            "author_info": {
                "name": "Evelyn Elwell Uyemura",
                "href": "/profile/Evelyn-Elwell-Uyemura"
            },
            "answer_text": "If the essay is 2, 3, 4, or even 5 pages, a single paragraph is usual for the introduction. I would say, as a rough estimate, that the introduction should be no more than 20% of the length of the entire essay. When my students write 6–7 page research essays, the introduction, which includes the thesis statement, is usually less than a page and is a single paragraph long. Any longer and it starts to seem unfocused—where is this going? A much longer paper, like a master’s thesis or something, would have a whole chapter as an introduction. ",
            "date": "Answered April 14, 2020",
            "views": "566",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "David Nicolow",
                    "user_href": "/profile/David-Nicolow"
                }
            ]
        }
    ]
}