{
    "title": "How to write a character or from the perspective of a character that is dangerous, smart, and slightly sociopathic - Quora",
    "tags": [
        "Character Development",
        "Fiction Writing",
        "Perspective",
        "Sociopathy and Sociopaths",
        "Creative Writing",
        "Fictional Characters",
        "Character and Personality"
    ],
    "response": [
        {
            "author_info": {
                "name": "Walter D. Petrovic",
                "href": "/profile/Walter-D-Petrovic-1"
            },
            "answer_text": "Are you actually asking a genuine question, or are you just asking to find out if someone can answer it? There is absolutely no character that is difficult to write. Why? If you design characters from scratch, and you go back into their family backgrounds to grandparents on each side, then you explore your character’s own life within their frame of experience, you will then be able to write that character. As for the specifics you listed, if you don’t already know then you will need to research and find out what personality types you are looking at emulating within your character. This would entail learning the dull definitions of those words and then thinking about how your narrative will deal with their interlock within your character. If you have done sufficient reading, you will have noticed that not bad story characters are really bad and not all heroes are really that good. Their actions are based upon their experiences in life and what path they have chosen due to those experiences. One thing — a person can be slightly psychopathic but there really is not such thing as mildly sociopathic. Learn the meaning of those two words and you will understand the conclusion I provided. I just spoke to my best friend about this last evening because he brought it up asking me the difference. Here is what I told him: A Psychopath is someone who does bad things and knows they do bad things, but have the inability to stop doing the bad things. A sociopath does bad things, knows he is doing bad things, but doesn’t give a damn. Sociopaths will often be strikingly intelligent and taunt those who will investigate the crimes they commit with the anticipation that they will never ever be caught. You can have a slight psychopath who is rehabilitated through therapy and medication but sociopaths do not have that safety switch which therapy and medication would fix. ",
            "date": "Answered December 29, 2019",
            "views": "65",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Dixie Golden",
                    "user_href": "/profile/Dixie-Guill-Golden"
                }
            ]
        },
        {
            "author_info": {
                "name": "Elizabeth Porco",
                "href": "/profile/Elizabeth-Porco-5"
            },
            "answer_text": "Dangerous is actually difficult. I think a dangerous person could write a dangerous person best. This is partially because most people don't really have the attitude and skills to be dangerous. Also different people are dangerous in different circumstances. Joseph the boxer might not be that good on the battlefield. Smart comes from rewriting and eliminating stupid things you’ve had your character do. It also comes from research. If the guy is smart, he’ll have retained some information about lots of things. He also will have some ideas about what he doesn't know. A smart person who's not a mathematician might say that he’s heard there are multiple definitions of the integral. This is both talking about something most people have little clue about and realizing and admitting lack of knowledge, something that would be practically and emotionally difficult for someone with less intelligence. Sociopathy is probably the easiest. Electricity is a good metaphor. It wants to ground itself out and doesn't care if you get hurt in the process. Human sociopaths are the same way except they’d want money, sex, or power. ",
            "date": "Answered December 28, 2019",
            "views": "102",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Jazzy Raine",
                    "user_href": "/profile/Jazzy-Raine"
                }
            ]
        }
    ]
}