{
    "title": "How to get a content writing job without experience - Quora",
    "tags": [
        "Web Content Writers",
        "Content Writers",
        "Jobs and Careers in Writing",
        "Content Writing"
    ],
    "response": [
        {
            "author_info": {
                "name": "Amrita Angappa",
                "href": "/profile/Amrita-Angappa-4"
            },
            "answer_text": "Getting a content writing job without any experience isn’t that tough, if you spend considerable time on building your portfolio. So, what is a portfolio? It can be anything, even your Quora answers, if it well-researched and written carefully. You can start publishing your blogs on Medium. All these should be extremely compact and authentic. It should be as per your industry guidelines and standards. Ensure that you create a proper portfolio if you want to build your career around content writing. The next step would be to start taking up freelance gigs. It can be through your reference or on LinkedIn or on Upwork. Do it with utmost sincerity. Try approaching content writing agencies for regular projects. If you are looking for a full-time job, all these experiences would help. Keep reading, keep researching and keep writing. ",
            "date": "Answered July 2, 2020",
            "views": "301",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Abhijeet Mokale",
                    "user_href": "/profile/Abhijeet-Mokale-2"
                },
                {
                    "user_id": "Nakul Sethuram",
                    "user_href": "/profile/Nakul-Sethuram"
                }
            ]
        },
        {
            "author_info": {
                "name": "Shravan Kamath",
                "href": "/profile/Shravan-Kamath-6"
            },
            "answer_text": "I will start by telling exactly what I did in my initial days. I started to write good quality content on platforms like Quora. Not only did it help me showcase my writing abilities but also I got something better in return, feedback yes most valuable feedback from the vast community which is priceless. Slowly my confidence improved with time and the more I wrote people started messaging me. I got few offers to write blogs and content for few websites. I also got an offer to complete a book as a ghost writer. All these leads were generated solely through Quora. I also keep updated with the trend and also learnt how to capture readers attention through my innovative writing abilities. I applied for content writer roles for ads placed on Facebook. That was my other way to generate leads. Lastly I just need to say keep writing, its hard in the beginning and later it just goes on easily! Its like learning to ride a bike or learning to swim. Looks hard at the beginning and becomes effortless once you get a hold of it.  Image source: Google -SK ",
            "date": "Answered December 7, 2017",
            "views": "17",
            "upvotes": " View 33 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Prof.X",
                    "user_href": "/profile/Prof-X-2"
                },
                {
                    "user_id": "Amir Nazir",
                    "user_href": "/profile/Amir-Nazir-71"
                },
                {
                    "user_id": "Toni Phoenix",
                    "user_href": "/profile/Toni-Phoenix-1"
                },
                {
                    "user_id": "Mita Patnaik (ମିତା ପଟ୍ଟନାୟକ)",
                    "user_href": "/profile/Mita-Patnaik-ମିତା-ପଟ୍ଟନାୟକ"
                },
                {
                    "user_id": "Shaily Rai",
                    "user_href": "/profile/Shaily-Rai"
                },
                {
                    "user_id": "Soundarya Palli",
                    "user_href": "/profile/Soundarya-Palli"
                },
                {
                    "user_id": "Anurag Modi",
                    "user_href": "/profile/Anurag-Modi-20"
                },
                {
                    "user_id": "Mathew David",
                    "user_href": "/profile/Mathew-David-10"
                },
                {
                    "user_id": "Deepika Karan",
                    "user_href": "/profile/Deepika-Karan-6"
                },
                {
                    "user_id": "Thenmozhi S E",
                    "user_href": "/profile/Thenmozhi-S-E"
                }
            ]
        },
        {
            "author_info": {
                "name": "Shivam Gupta",
                "href": "/profile/Shivam-Gupta-1197"
            },
            "answer_text": "Every experienced person is a fresher once. So you have to be fresher to gain experience. And I don't know who told you that you won't get a job if you don't have any experience in such. If writing is your passion, keep writing more stuffs and about everything you love. And if your motto is only to get a job in Content writing, still you need to work on writing because you can not sit in Maths exam without preparing for it. Similarly, you can't get a job in Content writing without knowing about writing. So trust me you can get a job in content writing without having prior experience in this field. You may get less salary in starting but once your knowledge will be known to everyone. You could not be stopped. Thanks! ",
            "date": "Answered December 7, 2017",
            "views": "556",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Abhijeet Mokale",
                    "user_href": "/profile/Abhijeet-Mokale-2"
                }
            ]
        },
        {
            "author_info": {
                "name": "Sonali Venkatesh",
                "href": "/profile/Sonali-Venkatesh-2"
            },
            "answer_text": "Hi future content writer, being in the writing and compiling ecosystem, I think I’m qualified to answer this question. You need to start with a focused area, preferably some part that you know well enough to answer. For example, if you studied business you may go on writing simplified blogs and post them or medicine then explain how the medicine is given, signs symptoms etc. and post about them. Once you have a good enough understanding of the writing, you may approach content writing companies like Taletel or some similar companies to pitch yourself as a writer. Alternatively, you can Directly contact them for vacancies. Content writing is a sophisticated profession which uses a person’s intellect, ability to think and frame words properly. A lot of reputed companies hire content writers directly to market their product, write advertisements etc. on top of that, one can work as a content writer in certain digital marketing companies. Overall, the opportunities are huge, it is a growing market and one can easily make money out of content writing. I hope I answered your question. Good luck!! ",
            "date": "Answered September 14, 2020",
            "views": "59",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Sandeep",
                "href": "/profile/Sandeep-1181"
            },
            "answer_text": "The people who have good command over the language, those people can get the content writer job. Should have excellent writing skills with unblemished grammar expertise and also be well versed with creative web content, blogs, articles, and press release according to the requirements.Must have some knowledge in SEO writing and internet research. They also demand some experience with online marketing and lead generation.Should have the basic understanding of Keyword relevancy and keyword density and should also be familiar with Keyword placement and other SEO best practices.The people who have good command over the language, but what you need to realize is that only expertise in language skills can never make you a successful content writer! SEO content is any content created with the goal of attracting search engine traffic. The most innovative & relevant content from the best content writers in Hyderabad with expert techno marketers for its marketing. ",
            "date": "Answered October 1, 2018",
            "views": "328",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Ravikumar Mishra",
                    "user_href": "/profile/Ravikumar-Mishra-6"
                }
            ]
        },
        {
            "author_info": {
                "name": "Rita Kalsyan",
                "href": "/profile/Rita-Kalsyan"
            },
            "answer_text": "Be creative & keep trying like this Web Content Writers ",
            "date": "Answered July 13, 2018",
            "views": "248",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Aayushi Dadhich",
                    "user_href": "/profile/Aayushi-Dadhich-3"
                }
            ]
        }
    ]
}