{
    "title": "How much should an author of a children's book expect to pay an illustrator? - Quora",
    "tags": [
        "Illustrators",
        "Illustration",
        "Children's and Young Adult Books"
    ],
    "response": [
        {
            "author_info": {
                "name": "Dominic Catalano",
                "href": "/profile/Dominic-Catalano"
            },
            "answer_text": "The answers previous to mine are all pretty much correct except for one thing that is worth mentioning. Before and author tries to hire someone to create images for their manuscript either as a self publishing venture or as a vanity project, they need to have it critiqued and evaluated by folks who know the picturebook market. SCBWI can provide some information on this. As others have said, if an author hopes to have the work published by a reputable house then the publisher will contract an illustrator they feel would be best for the project. If this is a self publishing venture that the author hopes to sell on Amazon, the illustrations will be extremely critical. Most published illustrators will not take on such projects so often illustrations for such ventures are done by friends or relatives that have little or no background in the field. It is a specialized area of knowledge after all. If the manuscript is critiqued favorably, the author may want to take the work to a university or art school and see if there might be an illustration major who might be interested. The manuscript need to be divided into a 32 page format. Commonly pages 1–5 are front matter so the story is divided into 13 spreads and one final single page 32. As on of the other answers suggested, the book design is another aspect that should be handled by someone who knows the book industry. Again, this might be an interesting college project or you might want to hire a local design firm which could be costly. If an author is serious and has has favorable feedback about their manuscript and wants to self publish then they should pay for the quality they need. Poorly executed illustrations and design would kill the project even if the story is good. Bottom line for a professional, minimum $150 per page for a total of $4,800 for illustrations, minimum of $50 per page for design for a total of $1,600. For a university student you could reasonably cut these cost in half but know that the success of your project will depend on these features, which is why flat fees and all rights buy out are so unfair to illustrators, artists and designers. ",
            "date": "Answered July 5, 2018",
            "views": "375",
            "upvotes": " View 21 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Machia .",
                    "user_href": "/profile/Machia"
                },
                {
                    "user_id": "Brianna Ware",
                    "user_href": "/profile/Brianna-Ware"
                },
                {
                    "user_id": "IV Arts",
                    "user_href": "/profile/IV-Arts"
                },
                {
                    "user_id": "Richard Siskind",
                    "user_href": "/profile/Richard-Siskind"
                },
                {
                    "user_id": "Dave Stephens",
                    "user_href": "/profile/Dave-Stephens-4"
                },
                {
                    "user_id": "Anna Korula",
                    "user_href": "/profile/Anna-Korula"
                },
                {
                    "user_id": "Joanna Mustard",
                    "user_href": "/profile/Joanna-Mustard"
                },
                {
                    "user_id": "Jeanie Egolf",
                    "user_href": "/profile/Jeanie-Egolf"
                },
                {
                    "user_id": "Biljana Biba",
                    "user_href": "/profile/Biljana-Biba"
                },
                {
                    "user_id": "Rachael Saltzman",
                    "user_href": "/profile/Rachael-Saltzman"
                }
            ]
        },
        {
            "author_info": {
                "name": "Emil Fortune",
                "href": "/profile/Emil-Fortune-1"
            },
            "answer_text": "An author probably shouldn't expect to pay an illustrator. An illustrator should be engaged by your publisher, at their expense, and should be paid an advance against royalties. So, an amount of money up front, and a percentage of each sale once such sales have accrued above the level of that advance. If you're looking for a trade publishing contract, don't get your book illustrated first. If the publisher doesn't like the art, it can be difficult to disentangle the text from the illustrations. If you're looking to self-publish, think hard. You're going to need to spend several thousand pounds at least. Are you going to sell thousands of copies? If you can't guarantee that, you're going to be thousands of pounds out of pocket. There have been very few self-published picture-book successes that I can think of. UPDATE: Just to note the huge recent success of the self-published picture book The Rabbit Who Wanted To Go To Sleep. It *can* happen - but not very often. ",
            "date": "Updated December 3, 2015",
            "views": "305",
            "upvotes": " View 8 Upvoters",
            "upvoters": [
                {
                    "user_id": "Bradley Macdonald",
                    "user_href": "/profile/Bradley-Macdonald-10"
                },
                {
                    "user_id": "Joanna Mustard",
                    "user_href": "/profile/Joanna-Mustard"
                },
                {
                    "user_id": "Carolyn Cohagan",
                    "user_href": "/profile/Carolyn-Cohagan"
                },
                {
                    "user_id": "Abeer Tehseen",
                    "user_href": "/profile/Abeer-Tehseen-1"
                },
                {
                    "user_id": "Lawrence Fletcher",
                    "user_href": "/profile/Lawrence-Fletcher"
                },
                {
                    "user_id": "Jill Pickle",
                    "user_href": "/profile/Jill-Pickle"
                },
                {
                    "user_id": "Tarita Subramanian",
                    "user_href": "/profile/Tarita-Subramanian"
                },
                {
                    "user_id": "Paul Ringo",
                    "user_href": "/profile/Paul-Ringo"
                }
            ]
        }
    ]
}