{
    "title": "How to find someone that can write a successful grant proposal - Quora",
    "tags": [
        "Writing Grant Applications",
        "Research Proposals",
        "Business Proposals",
        "Proposal Writing",
        "Grants",
        "Marriage Proposals",
        "Creative Writing",
        "Writers and Authors",
        "Writing Advice"
    ],
    "response": [
        {
            "author_info": {
                "name": "Miles Fidelman",
                "href": "/profile/Miles-Fidelman"
            },
            "answer_text": "Speaking as someone who’s written more than a few… There are plenty of folks who specialize in grant & proposal writing. For non-profits, check with your nearest Foundation Center Library - they might be able to refer you. For government contracts, try contacting the APMP (Association of Proposal Management Professionals).But… success has as much to do with substance & sales as proposal writing. Yes, organizing & presenting well is critical to receiving high evaluation scores. But… if your proposal doesn’t align with the funder & solicitation, if it isn’t substantive, if you’re sending your proposal in cold (they have no idea who you are, you’ve never talked with them, you’ve never vetted your concept with them), don’t even bother submitting a proposal. For foundation grants, more often than not, if they haven’t explicitly asked for a proposal, you’ll be dead in the water.Someone can write a proposal for you, but you (or key people) have to be seriously involved. You’re selling the people & the project, the proposal is just a vehicle - so you need to be reflected in the proposal, and that takes time. It’s also important that the proposal be worded in the language of your field & funder (e.g., when I write an R&D proposal to the Army, the reviewer had better feel sand between their toes) - that requires both intimate knowledge of the customer, how they think, and the language they use, as well as intimate knowledge of your subject area - a hired writer can organize & polish, but a lot of that has to come from you.Nobody can guarantee success. It’s a statistical game. If you win one in four proposals, you’re doing well. You have to play a long game.",
            "date": "Answered March 20, 2019",
            "views": "86",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Stephen Ndubuisi",
                "href": "/profile/Stephen-Ndubuisi"
            },
            "answer_text": "Writing a grant proposal is no big deal, you just need to write directly from your heart. You should concentrate on identifying ways your proposed idea or project can directly affect the lives of people in the community. It’s not rocket science, you can do it if you really want to. There are still some persons that can help out. There are professionals out there who are willing to help you write successful grant proposal. Maybe you should find them. Here is one I know of Nancy proposal writer Maybe you can ask her for help. Goodluck! ",
            "date": "Answered March 22, 2019",
            "views": "42",
            "upvotes": "0"
        }
    ]
}