{
    "title": "How to write a poetry book - Quora",
    "tags": [
        "Poems",
        "Poetry",
        "Literature"
    ],
    "response": [
        {
            "author_info": {
                "name": "MT",
                "href": "/profile/MT-86"
            },
            "answer_text": "I am not very good at poetry writing but here’s a list of dos I’d definitely suggest: Find your style. A lot of people claim to be well versed in all forms of poetry but personally I’d recommending finding what suits you amd your temperament the best. I can’t write poems with fixed rhyme scheme. I can’t even write something that’s entirely in free verse. My style is somewhere in between a set of stanzas with lines that rhyme, a long stanza in blank verse and then several shorts stanzas or maybe just a single line. So find your style. You might not realise it but it is the most important aspect of writing a poem.Try to have a theme. There are very few people who actually enjoy poetry. Most people would rather pick up a non fiction book than a book on poetry. (Not that it is bad.) so have a theme. It attracts people. For instance, I’d pick a book of poetry on lilies but not a book of poetry on flowers in general. Weird right? But that’s just how I am and how most people are.Find inspiration. Don’t rush yourself to write something and don’t pick up a topic which you find “attractive”. Don’t write about lgbtq if you can’t see beyond the term. There is nothing shameful or silly about writing on a cricket (insect) if that is what is inspiring you. Choose your subjects wisely because ultimately the poet is to some extent reflected in what they choose to write.Have Confidence! And Believe in yourself!I hope I answered your question! Good Luck! ",
            "date": "Answered August 16, 2019",
            "views": "94",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Srikaran Anand",
                "href": "/profile/Srikaran-Anand-1"
            },
            "answer_text": "I have published one book so far and it was a poetry book. It wasn’t really preconceived to write a poetry book but I ended up writing one when one of the poems showed me the good potential for a series of poems. It took about a month to finish, and another to review and edit (if you do it yourself). I can tell that depending on the genre you’ve chosen, you can start writing poems without trying too hard to link them with the previous ones. You can divide it into parts, writing small ones and spreading them throughout or you can choose to write long ones, whichever’s your speciality. What I did was I went on writing poems until I reached a saturation point and picked out the ones that would fit well in my book. And then I went about closing open ends so that they start making sense, eventually ending up with a solid base. You don’t necessarily have to follow this, but it did wonders for me. It will take a little bit longer than usual, but it is very effective. If you want to check my book out, here’s a link - https://notionpress.com/read/love-struck-and-sick-in-the-head Happy Writing :) ",
            "date": "Answered August 13, 2019",
            "views": "67",
            "upvotes": "0"
        }
    ]
}