{
    "title": "How to get a good work - Quora",
    "tags": [
        "Work",
        "Jobs and Careers"
    ],
    "response": [
        {
            "author_info": {
                "name": "Elizabeth McDougall",
                "href": "/profile/Elizabeth-McDougall-3"
            },
            "answer_text": " The best way to figure it out is to go out there and find different jobs and get experience. There will be jobs you hate, there will be jobs you enjoy. With experience you’ll be able to piece together your preferences. Keep your eyes open for opportunities, just because a job doesn’t seem appealing at first it doesn’t mean it’s not Ideal. You’ll be surprised at the type of jobs you’ll end up enjoying. Also, understand that ideal jobs, don’t come without flaws. There’s a part of it that’s going to be a hassle. Consider video game streaming for example:  A lot of people see this as an Ideal job, I mean who doesn’t want to earn money from just playing video games all day right? Well as a matter of fact, this job isn’t all sunshine and rainbows aside from the cost of having to set-up a good rig, you have to go through the trouble of getting yourself to earn a lot of viewers and followers in order to make decent income to sustain yourself. Some streamers get burnt out and don’t enjoy the game anymore and just play because they have to. Yes that can happen. So as a conclusion when figuring out an ideal job it’s good to plan it out but take into consideration the costs and the negative repercussion of a seemingly ideal one. At the same time actively get to work, you won’t find your ideal job just trying to figure it out. Go at it! Good Luck! ",
            "date": "Answered August 16, 2017",
            "views": "379",
            "upvotes": " View 5 Upvoters",
            "upvoters": [
                {
                    "user_id": "Shreya Bollock",
                    "user_href": "/profile/Shreya-Bollock"
                },
                {
                    "user_id": "John Chang",
                    "user_href": "/profile/John-Chang-7"
                },
                {
                    "user_id": "Jonatan Tesfome",
                    "user_href": "/profile/Jonatan-Tesfome"
                },
                {
                    "user_id": "Geraldine McDonagh",
                    "user_href": "/profile/Geraldine-McDonagh-1"
                },
                {
                    "user_id": "Praban Dhanjal",
                    "user_href": "/profile/Praban-Dhanjal"
                }
            ]
        },
        {
            "author_info": {
                "name": "Sid Kato",
                "href": "/profile/Sid-Kato"
            },
            "answer_text": "Start working and find a way to enjoy whatever you do. Soon you will find out what you excel in and what you don’t. As an example my first job was at Kentucky Fried Chicken. I loved it but soon realized it’s very hard work and couldn’t see me doing that unless I owned the store. My second job was at a grocery store. I loved that as well and worked my way up to a journeyman clerk while I was in college. I worked with brilliant people that had college degrees but didn’t want to take a cut in pay to start over in their fields of study. I decided I didn’t want to work in a store my entire life so I took a dramatic cut in pay to begin computer programming. Then I found my passion. ",
            "date": "Answered April 5, 2018",
            "views": "25",
            "upvotes": " Answer requested by Gordon Campbell"
        }
    ]
}