{
    "title": "How to get the most from Grammarly - Quora",
    "tags": [
        "Grammar Checker",
        "Grammarly (company)",
        "Grammarly (product)",
        "Learning English",
        "Grammar",
        "English Grammar",
        "Software and Applications"
    ],
    "response": [
        {
            "author_info": {
                "name": "Sakibul Hasan",
                "href": "/profile/Sakibul-Hasan-13"
            },
            "answer_text": "Grammarly is nine years in, and just getting started. This year, the company took funding for the first time, raising $110M in a round led by General Catalyst to ramp up hiring, as well as the machine-learning algorithms powering its product. In an interview, General Catalyst Managing Director, Hemant Taneja, said, “The company is at a very interesting inflection point. They’ve got solid user growth and sustainable business, but to really be bold in their mission, they’re going to need to scale their team and go after real solutions to some hard problems. And they’ll probably need to broaden the use cases and types of users they support at the same time.” While AI and machine learning have been all the rage in the current tech hype-cycle, Grammarly Checker is actually using these new technologies to solve real problems that millions of people face every day. There’s clearly a lot of room for the company to grow. Here are just a few ways Grammarly might expand in the future: Machine learning and AI: Every time someone is typing while using Grammarly’s Chrome extension, web app, or MS Office plugin, the company is collecting data they can use to make its product better. The latest application of this is the launch of Grammarly Insights 2.0. Insights send users a weekly trend report about how they write, which includes everything from vocabulary metrics to productivity. In the future, Grammarly might use machine learning not just to provide a better algorithm, but to deliver highly personalized recommendations to users.Attack new channels: As Grammarly’s marketing efforts begin to tap out paid search and content channels, there’s a lot of room for the company to experiment with new channels for acquisition. One of these is television. I moderated a panel with Grammarly’s Head of Growth, Yuriy Timen, who talked about the company’s efforts with television ads and billboards. With such a wide product that anyone can use, these broadcast channels give Grammarly an opportunity to expand its reach.Back to the enterprise: The biggest threat to Grammarly comes from Microsoft and Google both of which have a lot of machine-learning expertise and are closing in on the productivity space. Grammarly can defend against this threat by moving back into the enterprise space. As Grammarly expands its market, it will continue to build out its self-serve enterprise product, Grammarly @ Edu, to target universities and institutions.While AI and machine learning have been all the rage in the current tech hype-cycle, Grammarly is using these new technologies to solve real problems that millions of people have every day. ",
            "date": "Answered June 9, 2020",
            "views": "42",
            "upvotes": "0"
        }
    ]
}