{
    "title": "How scary is American Horror Story: Coven? - Quora",
    "tags": [
        "American Horror Story: Coven (Season 3)",
        "American Horror Story (TV series)",
        "Horror (genre)"
    ],
    "response": [
        {
            "author_info": {
                "name": "Jeff Kay",
                "href": "/profile/Jeff-Kay"
            },
            "answer_text": "The answer to this is strictly subjective.  I've found that AHS is really a mash of the various horror genres, and different genres scare different types of people. AHS Coven uses witchcraft as its primary theme, but then incorporates voodoo, zombies, blind intuition, bestiality, serial slashers, buried alive, torture porn, and an anti witchcraft cabal, all into the narrative.  It even throws in a fundamentalist Christian family as neighbors. While I enjoyed Coven, I didn't find it all that scary.  My scares come from darker themes, many of which were explored in the previous season, Asylum.  There were parts I found disturbing, in a good way, and others I found gratuitous while not actually integral to the plot.   The strength of the show is really in the cast, both recurring and single season.  Jessica Lange, Kathy Bates and Angela Bassett are perfect for their individual roles, and Gabourey Sidbe of \"Precious\" (a controversial choice  simply for superficial reasons) is a great addition to the season.   Stevie Nicks also makes extended muliptle cameos as herself.  I have always been a big fan of her and her music, and she is still as beautful now as when I was a kid, but the musical interlude feels more like a variety show segment.   Overall, AHS is worth the watch.  It incorporates so many types of horror, it's likely you'll find something in it that scares you. ",
            "date": "Answered September 25, 2015",
            "views": "58",
            "upvotes": " View 9 Upvoters",
            "upvoters": [
                {
                    "user_id": "Daryl Lim",
                    "user_href": "/profile/Daryl-Lim-34"
                },
                {
                    "user_id": "Shalin Choksi",
                    "user_href": "/profile/Shalin-Choksi"
                },
                {
                    "user_id": "Roby Nurdinho",
                    "user_href": "/profile/Roby-Nurdinho"
                },
                {
                    "user_id": "Jennie Rich",
                    "user_href": "/profile/Jennie-Rich-1"
                },
                {
                    "user_id": "Anthony Medina",
                    "user_href": "/profile/Anthony-Medina-222"
                },
                {
                    "user_id": "Leonor Pereira",
                    "user_href": "/profile/Leonor-Pereira"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/QUEENIE-38"
                },
                {
                    "user_id": "Mohammad Jilan",
                    "user_href": "/profile/Mohammad-Jilan"
                },
                {
                    "user_id": "A",
                    "user_href": "/profile/A-2444"
                }
            ]
        }
    ]
}