{
    "title": "How to write great stories out of bad ideas - Ask a Screenwriter - Quora",
    "tags": [
        "Screenwriting",
        "Television Series"
    ],
    "response": [
        {
            "author_info": {
                "name": "Mark Hughes",
                "href": "/profile/Mark-Hughes-1"
            },
            "answer_text": "I generally agree with Ken Miyamoto’s answer that there are no bad ideas, but rather bad execution. That said, and as Ken likewise explains in more detail in his answer details, I have to admit I have actually heard some terrible “ideas” — not the underlying basic concept, mind you, but the specific story ideas as pitched to me when I was being asked to develop a project. I won’t go into specifics about them, but to make my point I’ll offer a hypothetical example based on reversing an existing movie’s “idea.” If someone has an idea for a drama about a gay person who goes through “conversion therapy” and has a wonderful experience that convinces them being gay was just a “choice” that ruined their lives, and who successfully complete “conversion” to become a straight person who marries an opposite-sex partner at the end, that’s a horrible idea as it is specifically expressed in this manner. The idea here extends beyond mere concept, since making such a story into a serious drama is an idea. The question is, does that larger specific idea have the seeds of a different idea based on the same vague concept? Perhaps. A story about someone desperately entering “conversion therapy” only to discover the therapy is a fraud, forcing them to accept the truth of their sexuality and learn to be happy with who they are rather than trying to change it, is a worthwhile — and true, for many people — story to tell. Alternately, you could make a satire about someone entering “conversion therapy” and portray it all precisely as described — person is gay, goes into “conversion therapy,” experiences all manner of ironic situations that actually send the message that being gay is not a “choice” and even the people running the so-called therapy are gay but in denial about it, and the person finally exiting therapy supposedly “cured” but demonstrably still gay and just badly hiding the truth from themselves. You can denounce, mock, and tear apart the false concept of “conversion therapy” through satirically representing the truth about its failure, its cruelty, and the need to ban it altogether as an abusive, dangerous practice. The point is, what we consider an “idea” depends on the specifics of a situation, and each element of our conception of a story and how to develop it contains many “ideas” that can be good or bad, depending on context. But in general terms, if you have an idea for a story in front of you, the most basic form of that story is the one that sheds interpretive ideas attached to flesh it out, so the underlying concept is not “bad” and is simply diminished by the bad additions built atop that concept to express the concept in more specific terms. Which brings us back to Ken’s point — there are no bad ideas, just bad execution. We begin to execute an idea the moment we take the foundational concept (for example, someone going through conversion therapy because they are desperate to change themselves) and express the themes behind it and how to portray it in a story. If you strip away those “ideas” of theme and portrayal, the main idea can stand on its own and offer itself to any number of superior, good storytelling approaches. So when we talk about “bad ideas” becoming great stories, we need to remember to specify that we mean bad conceptualization and development of ideas, as opposed to pure concepts. ",
            "date": "June 4, 2019",
            "views": "538",
            "upvotes": " View 7 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Hanan Nasser",
                    "user_href": "/profile/Hanan-Nasser-1"
                },
                {
                    "user_id": "Zaki Zakaria",
                    "user_href": "/profile/Zaki-Zakaria"
                },
                {
                    "user_id": "Peter Anderson",
                    "user_href": "/profile/Peter-Anderson-443"
                },
                {
                    "user_id": "Onwuzuruike Chidera",
                    "user_href": "/profile/Onwuzuruike-Chidera"
                },
                {
                    "user_id": "Ken Miyamoto",
                    "user_href": "/profile/Ken-Miyamoto"
                },
                {
                    "user_id": "David Wigram",
                    "user_href": "/profile/David-Wigram"
                },
                {
                    "user_id": "Ilham Akbar",
                    "user_href": "/profile/Ilham-Akbar-8"
                }
            ]
        },
        {
            "author_info": {
                "name": "Ken Miyamoto",
                "href": "/profile/Ken-Miyamoto"
            },
            "answer_text": "There are no bad ideas. Just horrible executions. In a world where a screenplay about Michael Jackson told through the eyes of his pet chimp Bubbles can go on to become one of the hottest scripts in Hollywood, it’s really about the execution of the idea. Now, yes, I’m being a little tongue in cheek saying that there are no bad ideas — there certainly are — but it really depends on the execution of it. It starts with character. A great character can elevate an otherwise bad idea. But the full execution from beginning to end has to be solid. Let’s take Brie Larson’s directorial debut UNICORN STORE (on Netflix). After failing out of art school and taking a humdrum office job, a whimsical painter gets a chance to fulfill her lifelong dream of adopting a unicorn. This idea is a bit ludicrous and could certainly be looked at by some as “bad.” However, the script had an amazing character study. And that character elevated the concept. So just write it well. Write the hell out of it. Embrace the ridiculousness of it if the idea is that “bad” and find a way to make it great. ",
            "date": "May 20, 2019",
            "views": "643",
            "upvotes": " View 17 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Hanan Nasser",
                    "user_href": "/profile/Hanan-Nasser-1"
                },
                {
                    "user_id": "Mark Hughes",
                    "user_href": "/profile/Mark-Hughes-1"
                },
                {
                    "user_id": "Holly Root-Gutteridge",
                    "user_href": "/profile/Holly-Root-Gutteridge"
                },
                {
                    "user_id": "Edmond \"Bubbles\" Gagnon",
                    "user_href": "/profile/Edmond-Bubbles-Gagnon"
                },
                {
                    "user_id": "Cal Galicia",
                    "user_href": "/profile/Cal-Galicia"
                },
                {
                    "user_id": "Michael Paul Smith Jr.",
                    "user_href": "/profile/Michael-Paul-Smith-Jr"
                },
                {
                    "user_id": "Arsya Asharhadi",
                    "user_href": "/profile/Arsya-Asharhadi"
                },
                {
                    "user_id": "Thomas P. Buehner",
                    "user_href": "/profile/Thomas-P-Buehner"
                },
                {
                    "user_id": "Amlan Naskar",
                    "user_href": "/profile/अमलान-नसकर-Amlan-Naskar"
                },
                {
                    "user_id": "Hannah Marie",
                    "user_href": "/profile/Hannah-Marie-230"
                }
            ]
        }
    ]
}