{
    "title": "How to write in third person and first person - Quora",
    "tags": [
        "First Person Pronouns ",
        "Third Person Pronouns",
        "Writing Advice"
    ],
    "response": [
        {
            "author_info": {
                "name": "Scott Beckman",
                "href": "/profile/Scott-Beckman-5"
            },
            "answer_text": "Third person uses “he” and “she” pronouns exclusively outside of dialogue. “He went to the store. The clerk smiled when he walked in.” First person uses “I” to indicate the point of view character and narrator. “I went to the store. The clerk smiled when I walked in.” First person is perhaps easier because the narrator is always the point-of-view character. The only internal thoughts or emotions you express are the narrator’s. For example, you could write “I thought she was pretty” because you’re inside the narrator’s head and know their thoughts. You couldn’t say “She thought I was pretty” because the narrator isn’t in her head and can’t actually know that. Third person is perhaps more difficult because the writer has to make a decision about point of view. Is there only one point of view character? If so, the writing follows the same rules as first person - you can only indicate the thoughts and emotions inside the POV character’s head. For example, “He thought she was pretty.” Alternatively, is the narrator able to see inside everyone’s head, meaning there are multiple POV characters? For example, “He thought she was pretty, but she thought he was ugly.” Alternatively, is the narrator totally separate from all the characters, meaning there’s no POV character? For example, “He smiled flirtatiously. She rolled her eyes.” First person is great for showing how one person perceives the story. Third person is better when you want to have multiple POVs and/or show how several different people perceive the story. ",
            "date": "Answered July 13, 2017",
            "views": "874",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Jasz Singh",
                    "user_href": "/profile/Jasz-Singh"
                }
            ]
        }
    ]
}