{
    "title": "How to write a poem about myself - Quora",
    "tags": [
        "Writing Poetry",
        "Poems",
        "Poetry"
    ],
    "response": [
        {
            "author_info": {
                "name": "Denis Martindale",
                "href": "/profile/Denis-Martindale"
            },
            "answer_text": "The question has been asked and uses the English language. You have a potential audience of a few billion people. That didn’t stop me from uploading poems to the poemhunter poetry website. It merely challenges me to write new poetry to meet that demand for more poetry. Readers and reciters prefer poetry that flows well to poetry that doesn’t quite work. So it’s why I prefer the rhyming style and a structured verse style of 8 syllables then 6 then 8 then 6. This is the common metre hymn style pattern that helped me to recognise phrases that worked for 8 syllables suitable for titles and for first lines, too. Such phrases come unbidden and I merely follow these writing prompts to get to the first line and then it’s a sudden switch to the Writing Zone or the Try Write Zone as I like to think of it. : If writing about yourself, then it is expected to be some true event or personal belief or private thoughts being made available to the public. Even so, many poets write for themselves and refuse to share… the little meanies that they are! I hope that you will upload poetry to the poemhunter website. I add a free photo image underneath my new poem thanks to websites like unsplash, pixabay and gratisography as well as others, found when searching for free stock images using the pinterest website search feature… My free e-book poetry collection has over 2,800 poems already. I like finding and installing fonts to test which ones work to inspire me to write. Some do, some don’t. Finding lovely ones like the LORA font can help poets to write and see how beautiful the text looks. The myfonts website recently emailed me about getting some free fonts. I got those and visited the website, registered there and searched for free fonts offered in the available font groups. I got about 50 font files yesterday and tested these out with a recent poem. I like several of the fonts I tested. I save the files using WORDPAD rather than some complex word processor. I save the text as RTF files such as: a-poem-about-writing-poems-cambria-bolditalic16.rtf : I’m replying here using the Chrome web browser and the Grammarly add-on as this is currently getting the text checked. GET THE TEXT CHECKED! So queries are underlined in red and these point out suggestions or corrections to me. So even here, I can write a poem on-the-spot… Notice the title and the first line make 8 syllables yet again! : WRITE A POEM ABOUT YOURSELF!:Write a poem about yourself… the person that is you…Why leave your words upon the shelf? Try poemhunter, too…Register there, upload your text… with free pic underneath…And pretty soon, no more perplexed… words wise beyond belief…:Collections start with just one verse… free e-books then to share…If you in poetry immerse… if you take time to care…So are you tall or are you short? Tell us if young or old…Do you like all that you were taught? Are you as good as gold?:Are you a meanie now and then… a naughty so-and-so?Or one who gets ten out of ten… because of all you know?And were there times you fell in love? Be careful what you write!Just share what proves to say enough… and try to stay polite!:Folks like to read such poems out… so try to keep things clean…Decide things best to write about… if you know what I mean…Yes, have a go… and start today! Inspired by my verse…Write better, if you can, O.K.? No point in doing worse…:Denis Martindale October 2019.: ",
            "date": "Answered October 1, 2019",
            "views": "12",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Chris Sivewright",
                    "user_href": "/profile/Chris-Sivewright"
                }
            ]
        },
        {
            "author_info": {
                "name": "Read Gildner-Blinn",
                "href": "/profile/Read-Gildner-Blinn"
            },
            "answer_text": "All lyric poems, you might say, are about the self — not directly maybe, but the things (“no ideas but in things”), the handling of things, conclusions drawn from things, tone, rhythm, line-breaks, all reflect in some way the self. How could they not? Only you would make those decisions. (If you make the same decisions others might make, that says something, too.) I don’t mean to suggest making a conscious correlation between things in the world and elements of your self, as in allegory (e.g., the rabbit equals jumpiness, the swan, grace), just that you write what you’re prompted to write, go where impulse leads (and revise at a later date). The poem can’t help but be intimately about yourself. even if you never appear. In other words, the self needn’t be the conscious subject of the poem for the poem to be about the self. In fact, be wary of subjects. That’s one way, I think, people find their way. ",
            "date": "Answered June 1, 2019",
            "views": "736",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Kate Barnes",
                    "user_href": "/profile/Kate-Barnes-48"
                }
            ]
        },
        {
            "author_info": {
                "name": "Margaret Ann Waddicor",
                "href": "/profile/Margaret-Ann-Waddicor"
            },
            "answer_text": "How can you not? Just start and the rest will follow. A Poem is Born The willow wrote my thoughts on the surface of the river remember them then she said but I did not they flowed on down into the sea of my other thoughts and mixed up in its melting pot churning and turning about in the weeds at the bottom of nowhere we catch glimpses of our old thoughts often inspired by something that moves us and if we don't write them down they go on and are forgotten this is part of what poets try to capture the moments that have stirred the mind into sensing something special something out of the ordinary and so a poem is born Margaret Ann Waddicor January 2016 © ",
            "date": "Answered June 1, 2019",
            "views": "526",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Luke Iaxe Cruz",
                    "user_href": "/profile/Luke-Iaxe-Cruz"
                }
            ]
        },
        {
            "author_info": {
                "name": "Marina Pavlova",
                "href": "/profile/Marina-Pavlova-10"
            },
            "answer_text": "Nobody knows you better than you. Don’t be afraid of saying what you want, but make sure that it’s related to one topic about you, your feelings, fears. And they shouldn’t be necessarily rhymed. It can be a free verse. Just free your mind and try to see some images that you can use as metaphors for your poetry. And of course the more you practice, read other authors’ poems and get inspired, the better creator of your universe you become. Good luck;) ",
            "date": "Answered September 28, 2019",
            "views": "159",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Sarah Shahzad",
                "href": "/profile/Sarah-Shahzad-10"
            },
            "answer_text": "easy way Get inspired Carry the inspiration until something sparks.Just say it. Challenge yourself to tell a story or describe a moment in, say, no more than five lines.Select your words. Choose and explore the right words: don't be afraid to turn to a rhyming dictionary or a thesaurus.Read.Style.Get some space.Share.",
            "date": "Answered September 26, 2019",
            "views": "97",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Martha Clark",
                    "user_href": "/profile/Martha-Clark-56"
                }
            ]
        }
    ]
}