{
    "title": "How many times is Jesus mentioned in the Book of Mormon, using any of his names and titles? - Quora",
    "tags": [
        "Book of Mormon",
        "The Church of Jesus Christ of Latter-day Saints (Mormons)"
    ],
    "response": [
        {
            "author_info": {
                "name": "Broderick 'Cliff' Elliott",
                "href": "/profile/Broderick-Cliff-Elliott"
            },
            "answer_text": "I actually did a read through once where I underlined every reference to Jesus Christ as I came across it and circled the page total in the bottom outside corner. I never tallied all my page totals (project for some future day), but I have some observations on the number of references: It’s easier to count the number of pages that don’t contain a reference to Jesus than to count the actual number of times His name or Person is mentioned. There are less than five. If memory serves accurately, the highest count on a page was 53.The figure commonly given– 3,923ish, is not concrete. The ambiguity arises in the famous “Isaiah Chapters” of 2 Nephi. In these (and other passages) the Book of Mormon prophet Nephi (and others later) quotes(s) the Old Testament prophet Isaiah extensively. (I’ve done word-for-word comparisons of these versus the corresponding chapters of Isaiah in the King James Bible and they are NOT the same, although a study of the differences is worth a write up of it’s own.) Isaiah employs myriad titles and symbols to reference Jesus in His role as the Messiah, and it’s not always clear if he’s talking about the Savior or someone else, or someone who serves wholly or partially as a type and shadow in similitude of Jesus. How do you count something like that? Does every reference to the individual who prefigures the Savior count as a reference to Him, or does the whole passage count as one reference to Jesus because it’s about one person who prefigures him? There’s also some dizzying use of the term “the LORD.” LDS theology holds that the Jehovah of the Old Testament is the pre-mortal Jesus ordering the work of Salvation and Exaltation for this world in advance of His advent here. As any Jehovah’s Witness (with whom The Church of Jesus Christ of Latter-day Saints is NOT affiliated) will quickly tell you, when one encounters in one’s reading the word “LORD” in all capitals in the King James Bible, it is a reference to Jehovah and is rendered so in other English translations. (The actual name Jehovah only appears 4 times in the King James translation.) One infers the same meaning behind the term in the Book of Mormon quotations. However, there are a handful of cases where following the winding trail of pronouns and details of certain statements in these passages leaves a person with some suspicion that they may have encountered an exception to the rule. In both of these situations, the reader who wishes to make a count has to make a call based on their level of education on the subject and their impressions from the Holy Ghost. For this reason, although I find the foregoing figure useful, I don’t consider it or any other to be definitive.",
            "date": "Updated June 30, 2020",
            "views": "28",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Brook West",
                    "user_href": "/profile/Brook-West"
                },
                {
                    "user_id": "Colin Jensen",
                    "user_href": "/profile/Colin-Jensen"
                },
                {
                    "user_id": "Tara Glaese",
                    "user_href": "/profile/Tara-Glaese-1"
                },
                {
                    "user_id": "Yanick Rochon",
                    "user_href": "/profile/Yanick-Rochon"
                }
            ]
        },
        {
            "author_info": {
                "name": "Toby Dillon",
                "href": "/profile/Toby-Dillon"
            },
            "answer_text": "Oh man. You did not go there. Charles Tate, an English professor at BYU did some number-crunching and here’s what he found: Research and Perspectives: - ensign. To quote from his article here: “Page 519 alone has 26 references to Deity.” According to LDS Infographic, there are 3,925 references to Christ in the volume. There literally is not a more Christ-centered book in the world. ",
            "date": "Answered April 4, 2018",
            "views": "65",
            "upvotes": " View 59 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Sativa Rugg",
                    "user_href": "/profile/Sativa-Rugg-1"
                },
                {
                    "user_id": "Kim Robinson",
                    "user_href": "/profile/Kim-Robinson-26"
                },
                {
                    "user_id": "Amber Bodily",
                    "user_href": "/profile/Amber-Bodily-2"
                },
                {
                    "user_id": "Shalon Hutchison",
                    "user_href": "/profile/Shalon-Hutchison"
                },
                {
                    "user_id": "Paul Austin",
                    "user_href": "/profile/Paul-Austin-125"
                },
                {
                    "user_id": "Tara Glaese",
                    "user_href": "/profile/Tara-Glaese-1"
                },
                {
                    "user_id": "James Bishop",
                    "user_href": "/profile/James-Bishop-188"
                },
                {
                    "user_id": "Datha McCrea",
                    "user_href": "/profile/Datha-McCrea"
                },
                {
                    "user_id": "Robert Hampton",
                    "user_href": "/profile/Robert-Hampton-53"
                },
                {
                    "user_id": "Julien Connault",
                    "user_href": "/profile/Julien-Connault"
                }
            ]
        }
    ]
}