{
    "title": "How to write an essay on a rhetorical situation - Quora",
    "tags": [
        "Rhetorical Questions",
        "Rhetoric",
        "Essay Writing Help",
        "Essays",
        "Writing Advice"
    ],
    "response": [
        {
            "author_info": {
                "name": "Natalie",
                "href": "/profile/Natalie-907"
            },
            "answer_text": "A rhetorical situation is the context of a rhetorical act, made up (at a minimum) of a rhetor (a speaker or writer), an issue (or exigence), a medium (such as a speech or a written text), and an audience.  One of the first modern scholars to focus on the concept of the rhetorical situation was Lloyd Bitzer in his influential and controversial article \"The Rhetorical Situation\" (Philosophy and Rhetoric, 1968). \"Rhetorical discourse comes into existence,\" said Bitzer, \"as a response to a situation, in the same sense that an answer comes into existence in response to a question, or a solution in response to a problem.\" In the book Standardizing Written English (1989), English professor Amy Devitt points out the close relationship between rhetorical situations and discourse types: \"[A] rhetorical situation calls for an appropriate response in discourse. As speakers and writers respond to the situation, they use certain discourse characteristics: a particular type of organization, a certain amount and type of detail, a level of formality, a syntactic style, and so on.\" Observations Lloyd Bitzer states that rhetorical discourse occurs in response to a rhetorical situation. Bitzer identifies three key components that define and make-up any rhetorical situation:Exigence: \"An imperfection marked by urgency; it is a defect, an obstacle, something waiting to be done, a thing which is other than it should be.\" There are many different kinds of exigencies, but a rhetorical one exists when discourse can positively modify it.Audience: an \"audience consists only of those persons who are capable of being influenced by discourse and of being mediators of change.\"A set of constraints: \"made up of persons, events, objects, and relations which are parts of the situation because they have the power to constrain decision and action needed to modify the exigence.\"Once we recognize these three elements that make up the rhetorical situation, Bitzer says that rhetorical discourse can come into play.(from Lloyd Bitzer, \"The Rhetorical Situation.\" Philosophy and Rhetoric 1, 1968: 1-14)Determining the Rhetorical Situation \"[A] coherent view of rhetoric, or in this case a coherent view of student writing, includes both a 'rhetorical situation' and the acknowledgment that writers are agents within a rhetorical situation. Thus, the writer determines the rhetorical situation as much as the situation gives meaning to the utterance. Through an act of publication (making ideas available to a reader) within a rhetorical situation, a writer establishes or reestablishes her individuality within that culture and community.\"(John Ackerman, \"Translating Context Into Action.\" Reading-to-Write: Exploring a Cognitive and Social Process, ed. by Linda Flower et al. Oxford University Press, 1990) The Rhetorical Situation as a Dual Process \"Most rhetorical scholars believe it is not a question of whether discourse either responds to or creates situations; in fact, it does both. In a 1979 [article], . . . John Patton notes how 'the meaning of rhetorical situations is a dual process, partly a matter of recognition, i.e., clarity and accuracy of perception, and partly a matter of intentional, artistic, human action.'\" (James Jasinski, \"Rhetorical Situation,\" in Encyclopedia of Rhetoric, 2001)\"The rhetorical situation is an indeterminate context marked by troublesome disorder which the rhetor must structure so as to disclose and formulate problems; hence [Lloyd] Bitzer errs in construing the situation as determinate and predetermining a 'fitting' response. But the rhetorical situation is not one created solely through the imagination and discourse of the rhetor. It involves particularities of persons, actions, and agencies in a certain place and time; and the rhetor cannot ignore these constraints if he is to function effectively. . . . Not every strategy proposed by the rhetor will be fruitful and functional in a given situation, and the rhetor must be responsive to what Kenneth Burke calls the 'recalcitrance' of the given situation, those aspects and orders which the rhetor discloses through engagement, which 'may force [him] to alter [his] original strategy.'\" (Scott Consigny, \"Rhetoric and Its Situations.\" Landmark Essays on Rhetorical Invention in Writing, ed. by Richard E. Young and Yameng Liu. Hermagoras Press, 1994)This is the sample thesis for you. Source ",
            "date": "Answered February 6, 2019",
            "views": "13",
            "upvotes": "0"
        }
    ]
}