{
    "title": "How to write a warning letter to an employee for poor performance - Quora",
    "tags": [
        "Cover Letters",
        "Letters (mail)",
        "Employees",
        "Workplace and Professional Etiquette",
        "Human Resources",
        "Writing Advice",
        "Writing",
        "Business",
        "Jobs and Careers"
    ],
    "response": [
        {
            "author_info": {
                "name": "John E. Smith",
                "href": "/profile/John-E-Smith-1"
            },
            "answer_text": "If you are just wanting to warn the employee, just say “You better improve or I’ll fire you” … Now, if you want to help them improve their performance, which is far more valuable for them, you, and the organization, try the steps below. BTW, I have answered according to the order for a letter, but if you have NOT talked face-to-face with the employee about these issues, that needs to occur first. Then reinforce the face-to-face meeting with a letter that repeats what was said in the meeting: First, clearly and directly state the nature of the poor performance. If the person has several points to improve, each should be a separate paragraph. List clearly what you have already done to help the employee improve. If previous discussions have occurred, list them with dates, times, location, and what specifically was discussed. Attach assuming you have written document (which you should have). State clearly and directly what behavior needs to change, with any needed details. Ask the employee for their response and LISTEN to what they say. Correct any factual errors and acknowledge any legitimate points they make. In concert with the employee, develop a detailed for how they will improve and what support will be needed from you to help them do so. Establish a time frame for revisiting the situation to assess whether improvement has occurred or not. End with a sincere desire that they are able to improve their performance as agreed upon during your meeting. John ",
            "date": "Answered June 6, 2020",
            "views": "243",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Darryl Erentzen",
                    "user_href": "/profile/Darryl-Erentzen"
                }
            ]
        },
        {
            "author_info": {
                "name": "Rob Wanless",
                "href": "/profile/Rob-Wanless-3"
            },
            "answer_text": "This is a great time for a sandwich.If you are giving a warning letter, and not a letter of reprimand, that should mean that you are giving your employee the opportunity to grow and get better. So, use the sandwich method, but also include the message verbally. The employee should be able to “come back” from a mistake. Begin with telling the employee that you or the company value their work. Then, in simple, plain language, describe the behavior that you want to talk about. DO NOT use the word “attitude” anywhere in your letter. Do not do any mind reading, as you cannot read minds, only tell about the actual behavior. If possible, avoid any subjectivity. Anything that could be considered subjective (like “I believe” statements, or “I think”—delete those) After describing the behavior or action that you are warning the employee about, give clear indications of what will happen to the employee if the action is repeated or behavior continues. (Be careful, do not include any emotions in this) Then, end with a compliment of some kind (non-sexist, try to find a positive trait that benefits the company) Have someone in HR or another manager read over your letter before sending. ",
            "date": "Answered June 6, 2020",
            "views": "130",
            "upvotes": "0"
        }
    ]
}