{
    "title": "How to build up an audience as a writer - Quora",
    "tags": [
        "Creating Writing Advice",
        "Blog Writing",
        "Creative Writing",
        "Blogging",
        "Writers and Authors",
        "Writing Advice",
        "How-to Question"
    ],
    "response": [
        {
            "author_info": {
                "name": "Saumya Sharma",
                "href": "/profile/Saumya-Sharma-39"
            },
            "answer_text": "Building an audience requires a lot of patience, effort and research but all that totally pays off. The amount of effort you`ll be required to put in if you`re publishing traditionally i.e. with a publisher or a literary agent will be much less. Even then it`s not advised to just sit back and wait for the marketing deptt. to the magic, you can always do your bit to promote the book because nobody knows your book better than you. Even top publishing houses expect writers to do some running around when it comes to creating a readership, though may have a well-functioning marketing and promotions deptt. No writer is born with an audience. And if you`re planning to self-publish, then you anyway might want to gear up for some serious marketing yourself. Here are some things you can do on your part to ensure that more people read what you write- 1. Begin at home, at a smaller scale- Start popularizing your work by word-of-mouth. Start with your family, they`ll obviously be genuinely interested and will make real effort in getting your book across to more people. Tell about friends and colleagues about your book and distribute samples to close ones. Attend book-clubs and talk to other readers and writers about your book. Talk to as many people as you can about your book. Word-of-mouth can go a long way in creating an audience.  2. Social Media- Social Media is the most powerful promotional tool today. From businesses to websites to blogs to books, social media nails marketing and promotions like anything. Tweet, write about your book, share snippets and quotes, and stay very active on social media. Write teasers about the book and post any articles/clippings about the book. There`s nothing called too much publicity. Make the most of Goodreads and Amazon. There`s Pinterest and Instagram to share some non-textual visual material like illustrations, promotional art, book covers- front/back etc. 3. Press releases- Go nuts with press releases. Give away as many press releases as you can in as many places as you can, newspapers, local papers, magazines, online, whatever you gets your hands on. Go an extra step by holding out events and promotional meets at book-shops, malls, your alma mater etc. Visit the bookshops in your vicinity and personally talk to the owners about your book. Talk about your book at literature fests, book-clubs, literary meets, bookstore sales etc. Leave no stones unturned.  4. Build a good and credible profile- Try to enhance your image as a writer by maintaining a blog or promoting the one that you already have. Share links and blog-posts regularly on social media showing off your writing skills. Write interesting and catchy posts about your upcoming/already-out book, the more likes/retweets they get, the more they show up in people`s feed, the more your writing gets noticed. Try to develop a good writer-reader relationship with your audience by asking for feedback, replying nicely to comments, being grateful, personal wishes and greetings etc. This will be helpful not only for your latest book, but for your future projects also. Try to drive traffic as much traffic as you can, to your blogs and social media accounts and from there to your writings. Convincing people of your amazing literary skills via blogs, short stories, etc. will keep you in their good books(literally :p).  5. Seek professional help- If you`re self-publishing, talk to other writers who`ve also self-published and learn from their experience. Do research online, there`s valuable help available on the web. If you`re publishing under a publishing house, talk to your editor and the marketing deptt about all that you can do to build an audience. They`ll be able to guide you best, likewise with a literary agent.  6. Know your audience and focus more on it- You`ve written the book and nobody knows better than you( or your editor) about who`d like to read the book and who won`t. So figure out who the target audience is and focus more on getting their attention first. For instance, if you`ve written a college romance, you might want to get the attention of college students and youngsters. If you`ve written a cook-book or a self-help book, you might want to focus more on middle-aged women and housewives and devise ways of getting your book on their shelves. If it`s a non-fiction or scholarly work, you might want to focus more on the academic circle. Of course, getting your book to a diverse audience is  great idea, but try to put in extra cents and more effort in winning over the target audience.  Take your audience, no matter how small or large it is, seriously, and keep aiming for more. Do not at any point stop interacting with your readers and keep in touch with them even as the numbers shoot up. Having interned with top publishing houses and trained under senior commissioning editors, I can assure you that writers lose their audience sooner than you can imagine if marketing is not top-notch. The idea is not just have an audience, but to have a long-term, loyal readership for life that will eagerly look forward to your next book.  Good luck with your book and hope that helped !! :) ",
            "date": "Answered August 28, 2015",
            "views": "23",
            "upvotes": " View 7 Upvoters",
            "upvoters": [
                {
                    "user_id": "Shashank Sharma",
                    "user_href": "/profile/Shashank-Sharma-16"
                },
                {
                    "user_id": "Aditya Balakrishnan",
                    "user_href": "/profile/Aditya-Balakrishnan-2"
                },
                {
                    "user_id": "Ashutosh Mehndiratta",
                    "user_href": "/profile/Ashutosh-Mehndiratta"
                },
                {
                    "user_id": "Ashwani Chauhan",
                    "user_href": "/profile/Ashwani-Chauhan-53"
                },
                {
                    "user_id": "Ankit Mahar",
                    "user_href": "/profile/Ankit-Mahar-1"
                },
                {
                    "user_id": "Hemant Shardul",
                    "user_href": "/profile/Hemant-Shardul"
                },
                {
                    "user_id": "Akshay Kumar G",
                    "user_href": "/profile/Akshay-Kumar-G"
                }
            ]
        },
        {
            "author_info": {
                "name": "Liz Verano",
                "href": "/profile/Liz-Verano"
            },
            "answer_text": "3 Ways to Deliver Delightful Content Experiences  As a writer we want to build a sizable amount, if not great, of readership under our name. We love for our contents to be noticed and read by others, and yes, receive a praise or five maybe. Read these tips by an expert on how he was able to build an audience and proliferate his writing career: Quality content. Making your content SEO friendly enough for Google to notice is not enough. What makes a reader finish a content is the fact that it's got killer quality. Delight and entertain them by providing good content. It will surely commemorate your name into their memories and subscribe to you.Relevant topic. What makes a reader leave faster than it took him to find your content is the fact that it’s not what he is looking for. A content’s relevance significantly adds to the reason why a reader would want to stay. So cater to a readership that is aligned to your area of writing. The best way to find such readers is guest posting to websites that are also aligned to your niche.Social media that line! If you want to build an audience, another good way of reaching potential readers is through social media. If you have a good catchphrase or an attention-snagging line don’t be shy to promote it on social media with the link to your whole masterpiece.Make it personal. A reader wants to have a personal connection with what they are reading. If your content comes to them as something that is written by a heartless cyborg, then, by all means, say goodbye to your writing career. Write a piece that will connect to them on a personal level, like it’s really you who is talking to them.That's about all it. I hope these tips will help you build that amount of readership you have in mind. You can also read more expert tips here. ",
            "date": "Answered March 20, 2017",
            "views": "636",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Prachi J. Shah",
                    "user_href": "/profile/Prachi-J-Shah"
                },
                {
                    "user_id": "Krishna Prasath Ashok Kumar",
                    "user_href": "/profile/Krishna-Prasath-Ashok-Kumar-1"
                }
            ]
        }
    ]
}