{
    "title": "How to earn money online without investment - Quora",
    "tags": [
        "Making Money Online",
        "Wanting and Making Money",
        "Investing"
    ],
    "response": [
        {
            "author_info": {
                "name": "Peter Nguyen",
                "href": "/profile/Peter-Nguyen-2"
            },
            "answer_text": "I once made $2,600 within a few minutes. No, it was not a drug deal and yes, it was perfectly legal. But first, let’s talk about 4 major mistakes that most people make when they ask a question like this one: They only think of “investment” in terms of “money.” EVERYBODY has assets that could be used and leveraged as investments. For example, before they became Uber drivers, their cars were not business assets. But once they join Uber, they can make money from that asset. Same with Airbnb. So get creative. Look at the assets you do have, and use/leverage them to make $$$.They only think of “investment” as “their money” (you can always get others to invest, but of course, you gotta be persuasive)They never consider past investments they made, and thus never leverage such investments (including the trust they built in their social/professional network)They try to be creative from a place of scarcity, of fear, of stress and of negativity. Nothing comes out of nothing. Something comes out of something. So a better question is, “How can I make x dollars by using my y education, my z experience, and my w skills?” Abundance can only come from abundance.How many ways to make money? Infinite ways. The number is limited only by your imagination (or, more precisely, your willingness to let your imagination run WILD and give you tons and tons of ideas, which you implement, and you then keep the good ideas). I’ve got hundreds of ideas, and will update this answer with them over time. But here’s one: contact the prolific Quora writers, and pitch to them the idea of compiling their best answers into an ebook that you can sell on Gumroad, and you split the profits with the authors (there can be MANY authors in this ebook). Note: The $2600 was a finder’s fee for connecting a buyer and seller. ",
            "date": "Answered July 27, 2017",
            "views": "176",
            "upvotes": " View 28 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Collins Chibuike",
                    "user_href": "/profile/Collins-Chibuike-4"
                },
                {
                    "user_id": "Mohd Asraar",
                    "user_href": "/profile/Mohd-Asraar"
                },
                {
                    "user_id": "Sarah Ebhodaghe",
                    "user_href": "/profile/Sarah-Ebhodaghe-1"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/Jahir-Miah-MIoD"
                },
                {
                    "user_id": "Jacob Tickens",
                    "user_href": "/profile/Jacob-Tickens"
                },
                {
                    "user_id": "Tanzil Rimu",
                    "user_href": "/profile/Tanzil-Rimu"
                },
                {
                    "user_id": "Ali Am",
                    "user_href": "/profile/Ali-Am-18"
                },
                {
                    "user_id": "Khanyo Mali",
                    "user_href": "/profile/Khanyo-Mali"
                },
                {
                    "user_id": "Jamal Eddine",
                    "user_href": "/profile/Jamal-Eddine-1-1"
                },
                {
                    "user_id": "Jawed Mohammad",
                    "user_href": "/profile/Jawed-Mohammad-6"
                }
            ]
        },
        {
            "author_info": {
                "name": "Ashraful Saikat",
                "href": "/profile/Ashraful-Saikat-2"
            },
            "answer_text": "To make online there is no mandatory rule to invest. In fact who can make money online without investment , they reach to long term and established online marketer. Like I have never spent any dime to drive traffic. So, the question is if you can earn money online without investment ? Right ? Yes, You can obviously !!!  Here are some ways with which you can make money without any investments :  1. BLOGGINGBlogging is one of the most popular and best ways to earn money online. Most importantly, you are getting paid by writing while sitting at home. For free blogs, you just need to sign up and start writing blogs. BlogSpot(Bloggers) is the most popular platform for writing free blogs. Below I will mention all the popular platforms (both free and paid) for blogging. 2. As a Freelancer : Freelancer users typically pocket around anywhere $4 to $100 per hour depending upon their niche, level of expertise and difficulty of the project. Which freelancing sites are best for beginners? Upwork Freelancer Fiverr PeoplePerHour How can you get a freelance job with no experience? Focus on getting certifications as well working on resume plus on how do you bid on different projects. The more personalized responses with better answer to customer issues can make you win a job quickly. 3. YOUTUBEYes, you heard right you can make money by uploading videos to YouTube. Nowadays most of the people prefer YouTube than google search. And it takes only a few minutes to create your channel and upload videos. But I suggest uploading videos according to your interest so that you didn’t get bored and enjoy creating videos. You know most of the YouTubers start the channel, upload some videos and then quit. Why? Because they don’t know what to upload next. That’s why I recommend to everyone that before starting the youtube channel first decide your niche. TIP – Keep uploading videos, grow audience and have patience. Once youtube start recommending your channel then you will know how much you earn. Patience is the only key to success in this field. 4. Selling Courses Online : You can make money selling service online If you are good at a particular field of knowledge, or if you have a particular skill in which you specialize in, then I have a good news for you and that is, You can earn money online fast by selling your knowledge in terms of courses online. There are many sites where you can upload and sell your course. One such example is, Udemy. 5. MAKE MONEY AS A VIRTUAL ASSISTANT :Get clear on your WHY – Staying connected to your Why will keep you focused, centered, and help you move your business forward. Especially on those days when you lack motivation (it happens to all of us!). Read my Why here. Create your service offerings – Take a look at your existing skills and talents to create services that you enjoy doing. Get clear on what you want to offer. Figure out your ideal client -Who do you want to work with? Learn how to determine who your ideal client is and why it’s so important. Identify your niche – Now that you know the services you want to offer and the type of client you want to work with, you might see a niche or a theme. Your niche is basically what you specialize in. What type of VA do you want to be? Is there a specific industry you want to work in? Don’t worry if you don’t quite have a niche yet! You’ll figure it out eventually!  6. As an Affiliate Marketer :Are you interested in affiliate marketing but worried that you need loads of money to get into the business? Well, we have good news for you. You can definitely get started in affiliate marketing, even if you’re short on cash. There are just a few things you need to understand first. What is Affiliate Marketing All About? With affiliate marketing, you make money by promoting products and services to your audience members and referring them to the websites of retailers selling those products and services. When someone you refer purchases something or completes an action, such as signing up for a service or an email list, you earn a commission. This marketing technique benefits both the advertiser and affiliate. The affiliate gets paid while the seller makes a sale. Bloggers Use Affiliate Marketing These days many bloggers use affiliate marketing to earn money. You may have heard that some of the best bloggers out there are making as much as $40 thousand each month on affiliate sales alone. Of course, to make this kind of money, you have to have a huge, loyal audience. But what if you don’t have that kind of following? Let alone a blog at all? Can you still become an affiliate? Fortunately, the answer is yes. No Money, No Worries! We want to start by saying that having a blog and website should be your ultimate goal as an affiliate marketer. It is, hands down, the best way to run a successful affiliate marketing business. However, when you’re new to the business and you’re on a shoestring budget (or have no budget at all) there are a few things you can do to start generating the income you’ll need to eventually start your website and blog. Create a Social Media Presence Being an affiliate doesn’t mean you have to become a blogger right away. Instead, you can begin monetizing your online presence through social media. You can do this by placing affiliate links within your posts, updates, and profiles. Social media platforms like Instagram, Twitter, Pinterest and so on are packed with millions of users. You can easily integrate links into your posts and see results. Just make sure to follow the rules and restrictions of these sites, as you technically don’t own your accounts. Be on Facebook A lot of people, in fact, billions of people, are in Facebook these days, which makes it the largest social media platform. If you have an account, you can promote affiliate products on your page. The important thing is to focus your page on a subject of interest to your audience. It could be health, money, fitness, relationships, or pretty much anything else folks are interested in learning about. Be a YouTube Star Have you ever considered starting a YouTube channel? If not, then this is the best time to do so! YouTube is an incredibly effective platform for affiliate marketing and has millions of users. The most successful YouTubers are earning millions each year just by making videos promoting products they enjoy. This is perhaps one of the best ways to become an affiliate without investing in a blog and website. Just know that you won’t likely have very many subscribers in your first few months, but if you keep posting interesting and useful videos, you’ll eventually build the audience you need to succeed. Join an Affiliate Program Once you’ve established your following on social media or YouTube, you can begin to apply for affiliate network programs like ShareASale and Rakuten. These programs are constantly seeking publishers who can promote well. However, to join these programs, you’ll need to qualify, and that usually means having a solid online presence and following. So it’s important that you have quality content to be considered a good source. What Should You Do Then?  If you’ve set your mind on becoming an affiliate, there’s no way to go but up. And if you’re truly determined, you should always approach your work with the best practices and strategies in mind. Building an audience is critical, as well, so follow the rules of the trade. And when you do become a good source of information, expect people to recommend the products you write about. Your opinion will become gold in the end. So to answer the question, can you do affiliate marketing without money? The answer is a resounding yes! It just takes time, patience, opportunity, and determination; the rest is history. It’s never too late to start! ",
            "date": "Answered October 8, 2020",
            "views": "138",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Collins Chibuike",
                    "user_href": "/profile/Collins-Chibuike-4"
                }
            ]
        }
    ]
}