{
    "title": "How to write a dissertation topic - Quora",
    "tags": [
        "On Laser",
        "PhD Thesis",
        "Theses and Dissertations",
        "Academic Research"
    ],
    "response": [
        {
            "author_info": {
                "name": "Mathew Andreson",
                "href": "/profile/Mathew-Andreson-1"
            },
            "answer_text": "Picking a Dissertation Topic – 5 Guidelines to Remember When it comes to choosing a topic for your dissertation, many problems and confusions are sure to come your way. As dissertation is the most important part of your academic degree, you want to make the most out of it and try your best to secure good grades. But if you get stuck in the first step of picking a good topic, how will you handle the rest of it? After all, you need to have a clear direction before you proceed with the writing. So, here we have 5 helpful guidelines that will help you to select a dissertation topic without much difficulty. 1.Pick the topic that interests you Your interest, inspiration, and motivation are all what matters for a successful dissertation. Choose the topic that captures your interest and enthusiasm till the end. Try to find a topic that benefits your career and focuses on your professional goals. If you are curious and want to know something about a topic, pick it. This will make your dissertation writing process enjoyable and interesting. http://2.Do good research-work on your topic Research always helps you in finalizing your topic. It will guide you whether you are choosing the right topic and whether this topic has a vast scope to gather enough writing material. A good research is also helpful in getting a clear direction about how you are going to write your dissertation and what you’ll include in it. It even expands your ideas regarding the subject. 3.Choose a unique topic or any current issue You definitely won’t like to write your dissertation on a topic that doesn’t even sound different or unique. Reflect on new ideas, take inspiration from innovative concepts, or simply approach an ordinary topic from a different angle. Another advice is to look into the current affairs or recent issues going on in your industry or field of study. This will help you to come up with some trending topics that intrigues the readers. But remember one thing here, don’t deviate from your subject or course outline. Be relevant and practical. 4.Get help from friends and experts If you still can’t decide what topic to choose, discuss it with your friends or consult an academic expert. You can also take dissertation help from a trusted dissertation writing service that can guide you through the whole process of dissertation writing. They help you to pick the right topic and direct you from hypothesis making and literature review to data analysis, result, and conclusion. Moreover, they provide you the best services with on-time delivery. 5. Be clear and don’t be vague If your goals, concepts, and understanding are clear, you’ll be able to write dissertation efficiently. You will also be able to draw conclusions explicitly. So, we advise you to remove any vague explanation and follow a clear structure. Furthermore, if your topic has a narrow scope, you will face difficulty in expanding your arguments and drawing concise conclusions. Follow these guidelines and be confident that you can also produce a fine dissertation that will give you good grades. Best of luck with your dissertation process! ",
            "date": "Answered July 4, 2019",
            "views": "444",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Daisy Simpson",
                "href": "/profile/Daisy-Simpson-16"
            },
            "answer_text": "As you are thinking to write a dissertation topic, you should find out the requirements first. After this process, you need to research for your dissertation subject that you want to add in your dissertation writing. The research should be done with careful observation as you should keep the URLs from where you have read or choose the content to be added to your writing. It will help you to add the references part after your writing finish. Also, make some short points while researching so it can help you while writing the dissertation. Now you are ready with all the data so it’s time to select the topic or title for the dissertation which you are going to write it. Chose the topic by considering your reader's choice or interest which can attract your readers to read your content and pull them to share your piece of content. Make sure that you can manage your dissertation topic until the end of your dissertation because such a topic will help you to become confident as well as relaxed in front of your supervisor. ",
            "date": "Answered January 11, 2020",
            "views": "49",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Nionica Starc",
                "href": "/profile/Nionica-Starc"
            },
            "answer_text": "Dissertation takes you through the vicissitudes of academic life. You toil at least for two years: listing topics, judging their potential, scouting through meticulous data to get an in-depth knowledge, structuring 100-page document, making sure nothing slips from your mind and lastly penning down the ideas and thoughts. Your life starts revolving around your dissertation research work and you often get nightmares of failing deadlines. But when you see yourself receiving the final degree, you realize your hard work paid off. But before you experience that triumph, you have many things to do to come up with an excellent quality dissertation. Frankly, this is not a formal dissertation writing guide which would spoon-feed everything about dissertation for starters. You already know what a dissertation is. You need to how to start it because there is so much to do. Here we cover few things that students commonly face problems with. Overview How to start dissertation writing? How to organize everything for dissertation writing? What should be your approach while writing a dissertation proposal? What goes into a dissertation? How to find resources for dissertation writing? Plagiarism: How to avoid it? These sections pertain to submitting a top quality dissertation. The advice given here by best and professional dissertation editors are useful to the students who commonly face difficulties in these aspects. ",
            "date": "Answered January 16, 2020",
            "views": "95",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Michael Smith",
                "href": "/profile/Michael-Smith-989"
            },
            "answer_text": "Choosing the right topic is crucial. The topic you choose will be with you for a while, maybe even for life! Look Inside Not Outside Your topic reflects your research interests, and you should think about how you want to leverage your research when you graduate. Think of creating, rather than finding, a topic. You may want to begin with research interests you've already begun—in your job, in your graduate course work, your master's thesis, or with other research projects in which you've been involved. Is It the Right One? Use the following criteria to evaluate your topic area: Are you passionate about your topic?Are you well grounded in the scholarly literature?Is your topic manageable, given your time frame, resources, and availability of data sources?Is your topic within your range of competence?Is your topic significant in practical or theoretical terms?Is your topic original? (Has it been done before?)Does it take you where you want to go?",
            "date": "Answered January 20, 2016",
            "views": "542",
            "upvotes": " View 5 Upvoters",
            "upvoters": [
                {
                    "user_id": "Selimira Jhons",
                    "user_href": "/profile/Selimira-Jhons"
                },
                {
                    "user_id": "Lindsay Harris",
                    "user_href": "/profile/Lindsay-Harris-26"
                },
                {
                    "user_id": "Kim Mona",
                    "user_href": "/profile/Kim-Mona-1"
                },
                {
                    "user_id": "Bilal Bouchkaren",
                    "user_href": "/profile/Bilal-Bouchkaren"
                },
                {
                    "user_id": "Shriyash Chougule",
                    "user_href": "/profile/Shriyash-Chougule-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "All Assignment Services",
                "href": "/profile/All-Assignment-Services"
            },
            "answer_text": "Choosing a topic for your dissertation can be a tough task. At the same time, it is an essential task, as it gives the first impression of your dissertation to the teacher. To get a good grade, this is where you start from; writing a good dissertation topic! A few tips to search and land for a good dissertation topic are: Find your area of interest in the subject you’re writing the dissertation for.Look for popular topics around your interestSee, what all has been researched and written aboutFigure out what value your dissertation topic would add to the existing researchSelect 3-5 topics for the dissertationContact your mentor and discuss the topicsChoose the topic closest to your heart and the one you want to base your research onEnsure that the topic doesn’t involve too less or too many perspectives but at the same time gives you enough room to explore different perspectives.Reference:- Reddit.com ",
            "date": "Answered August 27, 2020",
            "views": "42",
            "upvotes": " View 9 Upvoters",
            "upvoters": [
                {
                    "user_id": "Swati Roy",
                    "user_href": "/profile/Swati-Roy-31"
                },
                {
                    "user_id": "Hope James",
                    "user_href": "/profile/Hope-James-54"
                },
                {
                    "user_id": "Stella Brown",
                    "user_href": "/profile/Stella-Brown-106"
                },
                {
                    "user_id": "Laxman Kumar",
                    "user_href": "/profile/Laxman-Kumar-142"
                },
                {
                    "user_id": "Cristina Parker",
                    "user_href": "/profile/Cristina-Parker-10"
                },
                {
                    "user_id": "Alexa Tate",
                    "user_href": "/profile/Alexa-Tate-2"
                },
                {
                    "user_id": "Shweta Chauhan",
                    "user_href": "/profile/Shweta-Chauhan-236"
                },
                {
                    "user_id": "John Mathew",
                    "user_href": "/profile/John-Mathew-869"
                },
                {
                    "user_id": "Nick Hebrew",
                    "user_href": "/profile/Nick-Hebrew"
                }
            ]
        },
        {
            "author_info": {
                "name": "Selimira Jhons",
                "href": "/profile/Selimira-Jhons"
            },
            "answer_text": "Hello, everyone, most of the students come across with major problems while writing their dissertation or while choosing their dissertation topics. In Ph.d Life dissertation plays the major as it is the proof of your research and a major grade factor. Some major problems student come across while writing there dissertation are : Topic Selection First, huddle students face or encounter with is the topic selection for their dissertation. Deciding on a topic can be a bit difficult. While deciding a topic for your dissertation one must focus on these points Topic broadnessTime RequirementEfforts and Energy required in that topicStudents must keep these factors in there mind while deciding their topic of dissertation. Time Management Time management is the major and biggest issue students face while writing their dissertations. Balancing their time to accomplish everything is a big challenge in front of most of the students while writing there dissertation. Some Major problem student come across in managing their time are: Procrastination Poor work Plan Formatting Documentation The formatting document is also a major issue due to which student suffers a lot. Every university has its style guidance that student has to use in formatting their dissertation documents. Some citation formats like APA, MLA or CHICAGO. Student are unaware of these styles or do not have proper knowledge of citing that put the student in trouble in the end. These are some major difficulties that come while writing a dissertation. I have found a nice video that help the student to overcome these problems and to guide them to choose their topic  ",
            "date": "Answered April 21, 2020",
            "views": "32",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Hamish Writer",
                    "user_href": "/profile/Hamish-Writer"
                }
            ]
        },
        {
            "author_info": {
                "name": "Raj Maurya",
                "href": "/profile/Raj-Maurya-49"
            },
            "answer_text": "Start with going through the topic, check of similar published work on internet. Bookmark some interesting articles, download the more important ones. Plan and schedule the chapters according to number of words and deadline. Preliminary research will help you to start the introduction chapter. More reading and understanding of other articles will help you in literature review chapter. Manage the latest articles (published within last 5 years). For next chapters, I can’t suggest anything as it will depend on the methodology you choose. Good luck. ",
            "date": "Answered January 28, 2017",
            "views": "108",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Selimira Jhons",
                    "user_href": "/profile/Selimira-Jhons"
                }
            ]
        },
        {
            "author_info": {
                "name": "Betty Dhughes",
                "href": "/profile/Betty-Dhughes"
            },
            "answer_text": "Your theme mirrors your exploration hobbies, and you ought to consider how you need to influence your examination when you graduate. Consider making, instead of finding, a subject. You might need in any case research intrigues you've as of now started—in your employment, in your graduate course work, your expert's postulation, or with other exploration ventures in which you've been included. ",
            "date": "Answered February 26, 2016",
            "views": "83",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Victoria Stone",
                "href": "/profile/Victoria-Stone-31"
            },
            "answer_text": "Many students face a lot of problems writing a dissertation. Do you need Dissertation tips and tricks ? Learn how to write a dissertation following five tips ",
            "date": "Answered February 13, 2018",
            "views": "67",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Ry Rey",
                    "user_href": "/profile/Ry-Rey"
                },
                {
                    "user_id": "Lillian Vaughan",
                    "user_href": "/profile/Lillian-Vaughan-1"
                },
                {
                    "user_id": "Stephanie Hicks",
                    "user_href": "/profile/Stephanie-Hicks-37"
                }
            ]
        },
        {
            "author_info": {
                "name": "Stephanie Smith",
                "href": "/profile/Stephanie-Smith-370"
            },
            "answer_text": "I am not sure about the best writing service. Few months ago I used MasterPaperWriters review and got a very bad paper from there. I think you should justify the services from the people who used it. Hope you will get your desired paper from there. All the best. ",
            "date": "Answered November 9, 2016",
            "views": "79",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Tonya Hagerman",
                    "user_href": "/profile/Tonya-Hagerman"
                }
            ]
        },
        {
            "author_info": {
                "name": "Crys Sirrah",
                "href": "/profile/Crys-Sirrah"
            },
            "answer_text": "pencil, pen, crayon - if you are a juvenial; these usually go at the top of the page; once you have made you mark on yon paper… Quean! ",
            "date": "Answered March 16, 2018",
            "views": "45",
            "upvotes": "0"
        }
    ]
}