{
    "title": "How to describe a kissing scene in my writing - Quora",
    "tags": [
        "Reunion (short story)",
        "Movie Scenes",
        "Descriptions",
        "Kissing",
        "Creative Writing"
    ],
    "response": [
        {
            "author_info": {
                "name": "Amber Dawn",
                "href": "/profile/Amber-Dawn-42"
            },
            "answer_text": "I heard him walk up behind me. I begin to turn around and I see his smiling face. He says, “Don't turn, this is about you.” My heart begins to pound. I stood there, feeling a desire run from my heart, to my chest, and down toward my inner thighs. His finger touched my neck, and the hair as it was moved away nearly gave me the chills. His hands went from the sides of my head and down to my neck, out to my shoulders and down to my hands. He grabbed my hands gently yet firm, put them in front of me and paused. I felt safe, he spoke no words. My heart is about to beat out of my chest and I close my eyes and take a deep breath out. He kisses my shoulder, and runs his lips on my skin towards my ear, but doesn't quite make it that far. I tilt my head and after his deep breath out he bites me gently. It doesnt hurt, it only makes me want more. He turns me around, and we are facing each other. He stares into my eyes and smiles. His two hands grab my left hand and he places my open palm on his heart, and he holds it there. His eyes exude love, protection, security, safety, patience, and respect. I smile and he lets go of my hands, with one hand he runs his fingers through my hair and gently guides my face closer to his, eventually leaning me in to rest my head on his chest. His other arm wraps around me, I hope he never lets go. While in that moment against his chest, I could only think about what I could do to make his heart pound. Next thing I know, “Babe, I have to get back to work. Five hours left in the day.” ",
            "date": "Answered January 18, 2017",
            "views": "237",
            "upvotes": " View 23 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Refiloe Lebuso",
                    "user_href": "/profile/Refiloe-Lebuso-1"
                },
                {
                    "user_id": "Ajibola Doyinsola",
                    "user_href": "/profile/Ajibola-Doyinsola"
                },
                {
                    "user_id": "Yanislava Dinkova",
                    "user_href": "/profile/Yanislava-Dinkova"
                },
                {
                    "user_id": "Yeetapril",
                    "user_href": "/profile/Yeetapril"
                },
                {
                    "user_id": "Shambhavi Bhardwaj",
                    "user_href": "/profile/Shambhavi-Bhardwaj-3"
                },
                {
                    "user_id": "Jim D.h",
                    "user_href": "/profile/Jim-D-h"
                },
                {
                    "user_id": "Mindy Lin",
                    "user_href": "/profile/Mindy-Lin-18"
                },
                {
                    "user_id": "Avula Thiru",
                    "user_href": "/profile/Avula-Thiru"
                },
                {
                    "user_id": "Ayushi Sharma",
                    "user_href": "/profile/Ayushi-Sharma-5"
                },
                {
                    "user_id": "Laurie Wilson-Taylor",
                    "user_href": "/profile/Laurie-Wilson-Taylor-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Chrissy Coleman Miles",
                "href": "/profile/Chrissy-Coleman-Miles"
            },
            "answer_text": "No two people kiss alike; each kiss scene should be as personal and unique as what led them to physical union. The backstory drives the tension to release. Let’s look at backstory . . . How your characters kiss will depend in large part by who they are and what got them there. Consider your possibilities and imagine how each backstory's tension could lead to a satisfactory release in the kiss. For instance: Are they two people from opposing sides in a war-torn world seeking peace in each other’s arms in the secret cover of night?Are they friends turned lovers in a first-time embrace, fumbling in reluctance, hoping it doesn’t mess up their friendship?Is this a makeup kiss from a separated union reunited that feels like coming home after a prodigal journey to discover what’s really important in life?Are they a longtime affair who has agreed to one last tryst before calling it quits because the relationship has run its course?Are they two inebriated strangers in the night after last call, drunk on loneliness, looking for connection in a disconnected world?Is it a conjugal kiss before death for a prison inmate prior to his execution?Is this the first in-person date of two longtime literary pen-pals who have only wooed each other on screen, but now are seeking sonnets in each other’s eyes?The backstory builds tension, the kiss is the release. Let’s redefine a kiss . . . There are also many different kinds of kisses; romantic or sexual expression is only one kind part. Here are a few different types of kisses to help you start thinking how kissing can be incorporated into a story: A mother who kisses her young infant’s head as she whispers a bedtime lullaby in a quiet nursery. Aww….A French funeral/wake procession line in which all guests engage in cheek kissing (left and right) to say hello and pay their respects. Maybe the protagonist does the same to the deceased lying in an open casket. Farewell, Maman.A gentleman hand-kisser with a magical ability to make women swoon with just a mesmerizing gaze and a mere kiss on the back of the hand, certainly a dangerous skill in the repressed Victorian colonies. Rowr!A never-been-kissed teen applying a bright shade of lipstick and kissing a mirror, dreaming of a someday magical first kiss. Mwah!A neighborhood cougar in a senior center whose legendary lips are the rumored “kiss of death” for the “new guys” on the block. Widows gone wild! (lol)Hope this helps. All in all, have fun with it! ",
            "date": "Updated February 6, 2018",
            "views": "114",
            "upvotes": " View 14 Upvoters",
            "upvoters": [
                {
                    "user_id": "Kathryn Demuro",
                    "user_href": "/profile/Kathryn-Demuro"
                },
                {
                    "user_id": "Kaos",
                    "user_href": "/profile/Kaos-43"
                },
                {
                    "user_id": "Garage Truck",
                    "user_href": "/profile/Garage-Truck"
                },
                {
                    "user_id": "Nur Syafiqah Azmi",
                    "user_href": "/profile/Nur-Syafiqah-Azmi"
                },
                {
                    "user_id": "Aileen Olsen Hampton",
                    "user_href": "/profile/Aileen-Olsen-Hampton"
                },
                {
                    "user_id": "Stacia Priyono",
                    "user_href": "/profile/Stacia-Priyono"
                },
                {
                    "user_id": "Chim Cakes",
                    "user_href": "/profile/Chim-Cakes"
                },
                {
                    "user_id": "Abbie Borcherding",
                    "user_href": "/profile/Abbie-Borcherding"
                },
                {
                    "user_id": "Alex Quincey",
                    "user_href": "/profile/Alex-Quincey"
                },
                {
                    "user_id": "Aiden Artemis",
                    "user_href": "/profile/Aiden-Artemis"
                }
            ]
        }
    ]
}