{
    "title": "How should movies portray strong female characters? - Quora",
    "tags": [
        "Female Characters in Fiction",
        "Movie and TV Characters",
        "Fictional Characters"
    ],
    "response": [
        {
            "author_info": {
                "name": "Kenny Nguyen",
                "href": "/profile/Kenny-Nguyen-44"
            },
            "answer_text": "By making them likeable. It's a common stigma that men only like female characters because they look “hot.”  I am sorry, but that's completely false. Most men don't like female characters just so we can have dirty dreams about them. That's completely false. Ellen Ripley doesn't have a “smoking hot body,” yet she’s a GREAT female character that everyone enjoys because of her likeable personality.  You know how to make a strong female character? Create a strong, developed likeable character that just so happens to be female.  …instead of a female character that happens to be strong.  I think the biggest problem is that some female characters are written as “men, but with BOOBS.” Or every single female character has to have masculine features or something. Also, apparently, it's okay for men to fail and learn from their mistakes, but it's not okay for women to fail and learn from their mistakes because it is not “female empowerment.”    In my opinion, having a person who fails multiple times but keeps on trying until they succeed is more EMPOWERING compared to a woman who just succeeds all the time and never grows as a character. Not to mention, but I find it kind of sexist and mean that women think men are just perverts who only like females because of their looks, and not their personality. My favorite female comic book character is Kamala Khan.  Look at that clothing. It's not revealing at all. She’s not my favorite comic book character because she’s “hot” or wears revealing clothing, or is busty. She’s my favorite character because she’s super nice, has flaws, and has a developed character arc.  I can name like at least five strong movie characters that happened to be female. The Bride from Kill Bill  Wonder Woman (DCEU)  Black Widow (MCU)  Rebecca Ferguson from Mission Impossible  DCEU Black Canary  And those are like the five major female characters that are developed. There are so many more female characters in movies that are likeable. Such as… Clarice Starling from The Silence of the Lambs  Regina George from Mean Girls  Furiosa from Mad Max: Fury Road  Katniss from The Hunger Games  Princess Leia from Star Wars  Those are all strong, female characters that men genuinely liked because of their personalities (well, except maybe Leia because of that slave outfit). The majority of them are not overpowered. They have limits, but they make up with their likeable personality. Toxic feminists need to get it through their heads that not all men are perverts and like to have dirty dreams. We don't care if the character is hot or not. All we care about is likeable female characters. That's it. Stop trying to show female empowerment by making the female characters be perfect and talk trash on men. Not all men are oppressive or sexists. The recent Charlie’s Angels reboot is a perfect example of how not to create a female-led movie.  In case people do not know what the difference is between a likeable character and a Mary Sue (a female character who’s perfect) here is a picture.  ",
            "date": "Answered September 15, 2020",
            "views": "297",
            "upvotes": " View 652 Upvoters ",
            "upvoters": [
                {
                    "user_id": "James Timothy",
                    "user_href": "/profile/James-Timothy-20"
                },
                {
                    "user_id": "Steven Neamonitis",
                    "user_href": "/profile/Steven-Neamonitis"
                },
                {
                    "user_id": "Julien Filion-Villeneuve",
                    "user_href": "/profile/Julien-Filion-Villeneuve"
                },
                {
                    "user_id": "Francisco Ancer",
                    "user_href": "/profile/Francisco-Ancer"
                },
                {
                    "user_id": "Stas Sonin",
                    "user_href": "/profile/Stas-Sonin"
                },
                {
                    "user_id": "Lao-Ann Omiloli",
                    "user_href": "/profile/Lao-Ann-Omiloli-1"
                },
                {
                    "user_id": "Clyde Fife",
                    "user_href": "/profile/Clyde-Fife"
                },
                {
                    "user_id": "Matthew Koscak",
                    "user_href": "/profile/Matthew-Koscak"
                },
                {
                    "user_id": "Babette Plitz",
                    "user_href": "/profile/Babette-Plitz"
                },
                {
                    "user_id": "Jonah Martinez",
                    "user_href": "/profile/Jonah-Martinez-11"
                }
            ]
        },
        {
            "author_info": {
                "name": "Alex Jackson",
                "href": "/profile/Alex-Jackson-189"
            },
            "answer_text": "Make them weak, make them human. The reason a character like Ellen Ripley is so beloved is because Ellen Ripley is NOT a strong person, at least not physically, but she makes up for it with a willingness to learn and a lot of bravery. She EARNS the respect of her audience in this way, by asking questions, by facing danger head on with the skills she has learned, and simply by being a human being. She works with everyone, helps out where she can, and treats no one with disdain or rudeness unless they’re somehow being rude to her. And she can shine on her own merit without requiring that others be lowered or debased.  On the other hand, modern “strong female characters” earn nothing, yet the very presence of their character demands that you respect them for no other reason than what they have between her legs. They spend their runtime looking down on everything and everyone with a sneer, acting rude and impulsive, elbowing their way to the film’s climax. I can only describe their behavior as this: a feminist making a female character that behaves as a male caricature. “Strong female character” simply becomes a marketing ploy; there is nothing otherwise feminine about the character. Then if people complain they accuse them of being somehow sexist for not enjoying a “strong female character” on the screen. It’s not that I mind an ACTUALLY strong character, but I DO mind it if that character’s “strength” comes at the expense of someone else’s legacy or anything else. If they were really strong, they would know it within themselves, and wouldn’t feel the need to bring others down so they could stand out.  This is not strength. This is narcissism. And this isn’t just for female characters either; I think all characters can benefit from some level of weakness, or a confrontation that they may not have expected, or just something that allows them to showcase their own unique talents and wit AS a character, thus adding to the story and their own merit. Personally, I feel that if more filmmakers watched this one single scene, and tried to incorporate the INTELLIGENCE of said scene into their own filmmaking, we would be spoiled with all the good films coming out every year.  Or perhaps this one:  (basically just watch a bunch of Bruce Lee and you should be well on your way) But there’s something important in both of these scenes. Yes, Bruce is a powerful man. But he is not arrogant. He genuinely tries to train this man, and while the training is hard, it is also gentle in a sense, exactly like water, as he speaks of. The character demands respect, not on the sole merit of being a man, but on his humanity. Had a woman been the key player in either scene I would have respected her exactly the same, not because of her gender, but because of her character. Because her humanity made me believe that she was a real person. But when you FOCUS on gender, you force it to be recognized as the only thing worthy of respect, and you shouldn’t respect someone based solely on gender. You dehumanize them when you do that. You objectify them when you do that. Make your characters weak so they can persevere. Make them human so your audience can actually relate to them. And always remember to make a good story instead of good politics. ",
            "date": "Answered October 30, 2020",
            "views": "59",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Geoffrey Hoffmann",
                    "user_href": "/profile/Geoffrey-Hoffmann"
                },
                {
                    "user_id": "Jerry Jacques",
                    "user_href": "/profile/Jerry-Jacques"
                },
                {
                    "user_id": "James Timothy",
                    "user_href": "/profile/James-Timothy-20"
                }
            ]
        }
    ]
}