{
    "title": "How many people have had success with self publishing their books? - Quora",
    "tags": [
        "Self-Publishing",
        "Book Publishing",
        "Publishing"
    ],
    "response": [
        {
            "author_info": {
                "name": "Murray Sampson",
                "href": "/profile/Murray-Sampson"
            },
            "answer_text": "So… my big piece of advice is don’t self-publish. Try and get in with a publishing house. A REPUTABLE publishing house - not a vanity press, not some rando you’ve never seen in bookstores. If you self-publish, your book will likely never see the light of day beyond those family and friends who buy a copy out of a desire to help you out. You might “get it into stores”, but unless it sells steadily it will either come back to you after a couple years, get destroyed, or sit languishing on their “consignment” shelf. There are VERY few Patrick Carmans in the world. You’ll be hard pressed to find stores that will take you seriously if you’re self-published, both because of the low-quality of most self-publishing services and the tendency for self-published books to be… not good. I’m not saying yours isn’t good, but the VAST majority of self-published books are… not good. If you’re having trouble getting published, find a good agent. They can help you refine your book and guide you on where to submit. It’s a process, and you’ll benefit from it. ",
            "date": "Answered April 9, 2019",
            "views": "159",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Janet Sellers",
                    "user_href": "/profile/Janet-Sellers-8"
                },
                {
                    "user_id": "Sarah Young",
                    "user_href": "/profile/Sarah-Young-523"
                }
            ]
        },
        {
            "author_info": {
                "name": "Jay Greene",
                "href": "/profile/Jay-Greene-35"
            },
            "answer_text": "Yes. People no longer have to rely on traditional publishing for success. “Amanda Hocking’s success story is also interesting and worth knowing: She wrote 17 novels while working at a full-time job. She self-published them all as ebooks selling more than a million copies.” “A writer of paranormal fiction who started her writing career as an unknown author and has become a bestseller when deciding on self-publishing on Amazon Kindle. But the road to success wasn’t easy for her. She had a day job caring for disabled people to make ends meet and a night job when she was writing until dawn. By 2010 she had a total of 17 unpublished novels all of which have been rejected by book agents and publishers. At that time she was out of money and frustrated having spent years trying to interest traditional publishers in her work.” “A few days after publishing her vampire novel, My Blood Approves, on Amazon’s website, she started selling nine copies a day. A few weeks later she published three further books to the series. Sales went up to more than $4,000 followed by $6,000 in pure profit, so she ended up quitting her job.” “Ashwin Sanghi, the author of bestselling novels such as The Rozabal Line, has also turned to self-publishing after being rejected by dozens of publishers. Unwilling to give up on his dream, he decided to go to the self-publishing way, and the book is now a bestseller.” “Rob Dirks self-published his first science fiction novel, Where the Hell is Tesla?, and it got sold 10,000 copies in the first twelve months after being rejected by publishers. He claims it wasn’t luck.” E.L. James “Arguably the most well-known self-publishing success story is E.L. James’ 50 Shades of Grey trilogy. She self-published the first book in 2011 as an ebook and print (on demand paperback) through an independent publisher. What began as Twilight fan-fiction, soon became a world-known bestseller. Despite the mixed critical responses, Fifty Shades of Grey alone has sold over 100 million copies worldwide, and the book holds the record for the fastest selling paperback which made her the richest of self-published authors.” [1] Footnotes[1] Self-Publishing Success Stories You Need to Hear About",
            "date": "Answered November 19, 2018",
            "views": "111",
            "upvotes": "0"
        }
    ]
}