{
    "title": "How to terminate an employee due to poor performance - Quora",
    "tags": [
        "Employment Law",
        "Employees",
        "Human Resources"
    ],
    "response": [
        {
            "author_info": {
                "name": "Michael Scott",
                "href": "/profile/Michael-Scott-1253"
            },
            "answer_text": "Terminating an employee is very difficult to do. It can be done, however it’s a process. First off, you should have a policy handbook that talks about performance, and how the employees will be judged on performance. Specifically each employee will receive performance appraisals. Forecample: A new hire will be on 30–60–or 90 day probation and at the end of this time period, they will be given an appraisal. Set up a rating from 1 to 5. 1 very unsatisfactory, 2 Unsatisfactory, 3 satisfactory-meets expectations, 4 above expectations, 5 exceptional —-something along these lines. You must make it clear and understandable to each employee these are the standards. It’s not uncommon to add an addendum to your employee handbook about performance if you already have one, always insure each employee signs an acknowledgment of receipt. If you do not have an employee handbook now is a good time to make one..!Once you have done this, and everyone is onboard, you can proceed with your performance appraisals. However remember you must treat everyone the same. You can start by giving the new hires the 39–60–90 appraisals, employees with tenure a year out more every year, on their anniversary date, as an example. You also need to insure each employee understands their lack of performance will be met with a: 1st offense-Verbal warning and coaching 2nd offense-written warning-put on an ““Employee Performance Developmental Plan” (EPDP) this is a written warning listing the problem area and how you and the employee are going to improve the area that needs improving. Depending on the issue you can make a follow in 30–60–90 days up to 6 months as well. At which time if there has not been improvement they could be terminated. Insure the employee understands this plan is meant to help them improve their performance and is meant to help them. Make it clear with the employee should their be any issues within this time period, they can be terminated. When the time period is up, and their performance has improved. You start the process over. If the employee has not improved, you terminate for performance. 3rd offense (or additional issue while on EPDP) will result in immediate termination. incidentally you must make sure you document, document, document…If you do terminate an employee for performance you will have to show the UI investigator the employee was aware his/her job was in jeopardy by providing copies of all the documentation. A personal thought, when I was the district manager with a Fortune 500 company in Dallas, it was my opinion it was better to try and save an employee as opposed having to hire and train a new one. But yes, there are some employees who you just can’t save no matter how much you try…..BEST OF LUCK….STAY SAFE…. ",
            "date": "Answered April 21, 2020",
            "views": "126",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "ADEBISI ADEGBOLA",
                    "user_href": "/profile/ADEBISI-ADEGBOLA-1"
                },
                {
                    "user_id": "Roksana Parvin Yasmin",
                    "user_href": "/profile/Roksana-Parvin-Yasmin"
                }
            ]
        },
        {
            "author_info": {
                "name": "Martijn Sinninghe Damste",
                "href": "/profile/Martijn-Sinninghe-Damste"
            },
            "answer_text": "I would always have a talk with him or her together with somebody from HRM or maybe my boss or the supervisor below me. I would be very direct with hhim or er, tell him or her the bad news and explain in clear terms why this decision was taken. If needed I would give a clear explanation why, but I would not enter into any discussion with the employee. I would not be very cuddly but I would be above all very clear about the decision, the reason why, and what to do next. Important in these bad-news talks is to be clear so that the employee does not think there is still a chance to revise the decission; after all the decision was taken already. ",
            "date": "Answered April 19, 2020",
            "views": "76",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Dale Poncy",
                    "user_href": "/profile/Dale-Poncy-1"
                },
                {
                    "user_id": "Roksana Parvin Yasmin",
                    "user_href": "/profile/Roksana-Parvin-Yasmin"
                }
            ]
        }
    ]
}