{
    "title": "How many books have you written through NaNoWriMo? - Quora",
    "tags": [
        "National Novel Writing Month",
        "Book Writing",
        "Creative Writing",
        "Novels",
        "Writers and Authors",
        "Reading",
        "Writing"
    ],
    "response": [
        {
            "author_info": {
                "name": "Rose Demica",
                "href": "/profile/Rose-Demica"
            },
            "answer_text": "Heya, thanks for the A2A. I want to point out real quick that you said books written, not books finished - is a slight technicality, I know, but it changes my answer slightly. Simply because I have not finished writing anything in a very long time - excluding one shots, but I don’t count those. So, this absolutely amazing person in our group NaNo chat created a bot called Sassbot ages before I joined the chat, She’s undergone a lot of changes since I first met her, and one of her newest updates - linking in with the new website, will give you a list of all your past NaNo’s. Here’s mine: NaNoWriMo 2019: 19293 currentlyCamp NaNoWriMo July 2019: 28Camp NaNoWriMo April 2019: 38328,NaNoWriMo 2018: 50597,Camp NaNoWriMo April 2018: 2139NaNoWriMo 2017: 3963Camp NaNoWriMo April 2017: 28330,NaNoWriMo 2016: 38268Camp NaNoWriMo April 2016: 5020,NaNoWriMo 2015: 50121Camp NaNoWriMo April 2015: 12055,NaNoWriMo 2014: 50044,I think some of those numbers are wrong - mainly because I was too lazy to update my word count during camps - until Jester started doing them, then it was a competition. Anyway, now I had a different project for every NaNo, I do not think I have used the same idea twice - even with all my recent rewrites. (As in, I wrote battleships in 2014, and never again, but I would recycle old ideas I started outside of NaNo). Which means! One book for every NaNo done, so 12. Minus this years camp July - Something big happened and I couldn’t do it, but I don’t remember what? Probably another health thing knowing my past year and a bit. So 11, I have worked on at least 11 various books throughout my NaNo Career. Some NaNo’s I’d have one-four projects active especially since I got sick, because I can’t focus on just one story, I need to be able to jump around. I really need to cut down on the amount of stories I have sitting around and actually finish some of them, which I’m kind of working on with all these rewrites? Anyway, let’s say 11 - unless you meant finished, then none. Thanks for asking! ",
            "date": "Answered November 9, 2019",
            "views": "693",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Alex LaMaster",
                    "user_href": "/profile/Alex-LaMaster"
                }
            ]
        },
        {
            "author_info": {
                "name": "Yayenia Thompson",
                "href": "/profile/Yayenia-Thompson"
            },
            "answer_text": "None. I don’t participate in NaNoWriMo. The reason being that as a professional author, I don’t dedicate one particular time to writing; that would be both unproductive and inane. I follow NaNoWriMo on Instagram for some inexplicable reason, but usually their posts seem ridiculous and ‘high-school-motivatory’ to me. I can’t really explain it, I don’t have anything personal against the program, I just feel that actual authors don’t need programs like it to do their job… Maybe it’s because I feel it’s promoting yet more fluff writing that’ll be published on amazon without editing, or the writer having to go through the real publishing process, and therefore not learning the lessons real authors learn by doing so. It just encourages a continuous flood of mediocre writing from which there is no rescue. I think it’s a great program for hobbyist writers to bond together over their never-gonna-finish books and get excited about the possibility of actually finishing. One of my high school writing teachers made us participate one year and I thought it was such a massive waste of energy and time when I could’ve easily written just as much, if not more, on my own. I know some people love it and get excited, but I really don’t find it worthwhile. It’s great in how it encourages people to write; that’s fantastic. It’s not great in how it produces a vast majority of sub-par drivel and gives the participants unhealthy and unrealistic hope of being published. ",
            "date": "Answered November 19, 2019",
            "views": "802",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Connor Thompson",
                    "user_href": "/profile/Connor-Thompson-13"
                }
            ]
        }
    ]
}