{
    "title": "How to make someone feel special - Quora",
    "tags": [],
    "response": [
        {
            "author_info": {
                "name": "Tyla Smith",
                "href": "/profile/Tyla-Smith-3"
            },
            "answer_text": "Tell them you care be there for them listen to them show them they mean something to you Accept people the way they are. Because most people are judgmental and critical, to be unconditionally accepted by another person raises that person’s self-esteem, reinforces his or her self-image, and makes that person much more likely to accept you and follow your lead.Show your appreciation for others. When you appreciate another person for anything that he or she has done or said, they will like themselves and you more as well. The simplest way to express appreciation is to simply say, “Thank you” for an idea, some good feedback, time spent together, or an order. Be agreeable. The most welcomed people in every situation are those who are generally agreeable and positive with others. Entrepreneurs who like to be argumentative, complaining, or disagreeable, will have a hard time closing a contract, investment, or a customer contract. Show your admiration. People invest a lot of personal emotion in their possessions, traits, and accomplishments. When you admire something belonging to another person, it makes him feel happy about himself. Everyone has positives, and it’s up to you to find them. In turn, these positives will be reflected back on you. Pay attention to others. The most powerful way to pay attention to someone is to listen attentively first, even ask questions, before you launch into a monologue answering every question they might never ask. Believe it or not, before you even say a word, you will become a more interesting and intelligent person in their eyes. Never criticize, condemn, or complain. In business as well as personal relationships, the most harmful force of all is destructive criticism. It lowers a person’s self-esteem, makes him feel angry and defensive, and causes him to dislike you. If your target is someone not present, it still causes a loss of trust in you, since your listener could be the next target. Be courteous, concerned, and considerate of everyone you meet. When you treat a person with courtesy and respect, they will value and respect you more. By being concerned, you connect with their emotions. Consideration is the discipline to do and say things to people that are important to them. Think back on your own recent experiences as a customer or contractor. You don’t always buy the cheapest product or service, if you have a good relationship with the people involved. On the other hand, I almost never buy from someone that treats me like I’m not important. If you want to be a leader, you need to inspire followership. Great leaders develop a good relationship with good people, who are then inspired to follow. A successful leader inspires people to do more than they might have done without the relationship, and more than they may have even dreamed possible. So, if you follow all these seven ways to make other people feel important, you will receive a seven-fold payback on your own objectives of being a leader and building a successful business. That’s a lot cheaper and lot longer lasting than the best advertising and public relations you can buy. Seven Ways to Make People Feel Important click on blue for source ",
            "date": "Answered November 15, 2016",
            "views": "15",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "L E",
                    "user_href": "/profile/L-E-102"
                },
                {
                    "user_id": "Manoj Kotnala",
                    "user_href": "/profile/Manoj-Kotnala"
                }
            ]
        },
        {
            "author_info": {
                "name": "Saysi Winter",
                "href": "/profile/Saysi-Winter"
            },
            "answer_text": "It is not difficult….act yourself and if you like to listen and respond and share conversation and opinions with me, so that I can respond, and also be interested in what I have to say to some extent at least (!) then we could get to know each other. If we share a sense of fun or humour then we may well laugh together and that is great fun to be able to enjoy our time together. Thoughtfulness goes a long way too..if someone considers the likes and dislikes of the object of their affection then they will become closer so much faster. Consideration and paying attention and also being attentive is all bonding and good for making people feeling loved or special. Allowing me to share your personal adventures or things that may have been an important part of your life will help me feel closer to you and the fact that you share those things with me will make me feel closer to you and grateful that we can confide and trust each other. Likewise, listening to me sometimes, learning what makes me the person I am and generally taking an interest in me is all good for the ‘getting to know you’ thing that increases a closeness of special feelings and who knows, eventually maybe love! To encourage love to develop, essentially I think two people need to be respectful and easy going, reliable and ardent but not over ardent..lol…share normal days together and some special days that are mutually enjoyable such as a concert, or a trip or just about anything……….a bike ride! Doing things together is what it is all about. If after a short while you feel there is pleasure in your meetings and time together and both are looking forward to when they can be together, then something deeper maybe developing. But, nothing puts a woman off a person more than being swamped with calls or compliments all the time or even over enthusiastically trying to spend all your spare time together..at least early in a relationship. Everything in moderation and with consideration. Personally I like people who are kindly, and also who enjoy doing their own crazy thing such as building tree houses to watch the sun go down! That doesn’t mean I specifically mean that you could not make me feel special and loved without those things! I forgot something……if you can cook me an egg on toast or toasty cheese sandwich, I would be super impressed! Of course in reality, I have felt loved and special by very different kinds of men who had non of my ideals..so just be yourself, with consideration and thoughtfulness! ",
            "date": "Answered October 5, 2017",
            "views": "650",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Iribuka Jonathan",
                    "user_href": "/profile/Iribuka-Jonathan"
                },
                {
                    "user_id": "Dianne Mae",
                    "user_href": "/profile/Dianne-Mae-3"
                },
                {
                    "user_id": "Niklas Beau",
                    "user_href": "/profile/Niklas-Beau"
                },
                {
                    "user_id": "Ahmad Muhammad",
                    "user_href": "/profile/Ahmad-Muhammad-85"
                }
            ]
        }
    ]
}