{
    "title": "How to write research paper, what are the initial steps - Quora",
    "tags": [
        "Academic Research Papers",
        "Academic Papers",
        "Academic Research"
    ],
    "response": [
        {
            "author_info": {
                "name": "Abid Hussain",
                "href": "/profile/Abid-Hussain-625"
            },
            "answer_text": "Hello Everyone, Greetings of the day, Writing research paper is one of major problem of the Research Scholars. They don't understand that how to write their first research paper after taking the admission into Ph.D or M.Phil . So don't worry about it. As per my experience, Few steps to write Good Paper for the Beginner:- 1. First need to download 30 papers on interested research area, 2. Then, make one word file and copy Abstract and Conclusion of these 30 papers in one word file, 3. Then, start reading word file, after that, u will get to know \"What has been done in this area and What can be done in future ?\". 4. Then, start reading the papers thoroughly 5. After that only, start writing of your paper. May be, these steps will be useful for Beginner. For finding research paper of the relevant subjects or area of the research. You can easy to take an idea from these research papers.After that you can easy to write your first research paper without any confusion.Kindly visit following website: Google Scholarhttp://shodhganga.inflibnet.ac.inIEEE Xplore Digital Library*****Best of Luck***** ",
            "date": "Answered April 13, 2018",
            "views": "271",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Dr Gurudatt Kakkar",
                    "user_href": "/profile/Dr-Gurudatt-Kakkar"
                },
                {
                    "user_id": "Om Maheshwari",
                    "user_href": "/profile/Om-Maheshwari-1"
                },
                {
                    "user_id": "Meenakshi Sharma",
                    "user_href": "/profile/Meenakshi-Sharma-635"
                },
                {
                    "user_id": "Kunal Rohira",
                    "user_href": "/profile/Kunal-Rohira"
                }
            ]
        },
        {
            "author_info": {
                "name": "Veena Ekbote",
                "href": "/profile/Veena-Ekbote"
            },
            "answer_text": "The initial steps of writing a research paper is always lots of reading about the subject. (Generally the article goes like Introduction, methods, results, discussion and references.) The next step is finalizing the results, making tables, graphs that would go into the paper, writing the results section. And then writing the introduction, methods, discussion and references. The format of the paper also depends on the journal you want to submit. ",
            "date": "Answered May 19, 2016",
            "views": "106",
            "upvotes": "0"
        }
    ]
}