{
    "title": "How to bring a character to life when you're writing fiction - Quora",
    "tags": [
        "Creating Writing Advice",
        "Fiction Writing",
        "Fiction",
        "Creative Writing",
        "Fictional Characters",
        "Writing Advice"
    ],
    "response": [
        {
            "author_info": {
                "name": "James Johnson",
                "href": "/profile/James-Johnson-187"
            },
            "answer_text": "The character has to be really essential to the story, like without that character the story really wouldn’t be important. What would “The Great Gatsby” be if Gatsby wasn’t mysterious and interesting? Or any of your favorite books if the character’s emotions don’t dictate how the story unfolds. My point here is that if you make the character’s personal story closer to the plot, we can empathize with the character and that makes them feel much more real. Dialogue and subtext help, but the thing about dialogue and subtext is that they rely on a big problem the character faces, which is the central conflict driving the plot. Another thing that helps bring a character to life is when we don’t see everything about them on the page. Maybe something happened away from the view of the reader, and we’re only given the information second hand. That makes the character feel like they have more agency: more of an ability to effect their world. If we want to take away our protagonists agency, and make them seem like a smaller, less influential person, you can write a scene where the character is given information relevant to another character who isn’t in the room. There are lots of ways to bring a character to life, and the hardest techniques are usually the best, which are good dialogue and a well controlled flow of information: don’t advance the plot too quickly or too slowly. I know I’ve been kind of vague with all this, but you asked a tough question. ",
            "date": "Answered March 6, 2019",
            "views": "222",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Darrell Blank",
                    "user_href": "/profile/Darrell-Blank"
                }
            ]
        },
        {
            "author_info": {
                "name": "Anubhuti Anwekar",
                "href": "/profile/Anubhuti-Anwekar"
            },
            "answer_text": "As Nic Schuck already said, dialogue is extremely important; a character is brought to life by their external (or physical) descriptions, their manner of speaking, and their inner thoughts. In omniscient narratives, characters are often sketched with great vividity, and their speeches and interactions with other characters reveal a great deal about their personalities and psychology. For example, Heathcliff from Wuthering Heights: he is interpreted through the eyes of Nelly and Lockwood (who, by the by, is obviously a poor judge and not a very reliable narrator); as Nelly is the main narrator, her description of Heathcliff causes the readers to feel that he is almost a tangible, real person, not the product of an author's brilliant imagination. First person narration is also a pretty effective way of bringing a character to life; first person narratives allow the readers deep insight into the narrator's thoughts and feelings, making for a great and satisfying read. Of course, there are both active and passive first person narrators. First person narrators tend to break the fourth wall (not always, but frequently), interacting directly with the readers. Third person narratives, while a favoured style, sometimes feel… distant (?). That doesn't mean they can't describe a character accurately; all I'm saying is that first person narratives are more effective. (There is the difficulty of not being able to rely on them completely but... Unreliable narrators are intriguing!) ",
            "date": "Answered March 3, 2019",
            "views": "140",
            "upvotes": "0"
        }
    ]
}