{
    "title": "How to earn money writing online for clients - Quora",
    "tags": [
        "Online Writing",
        "Content Writing",
        "Online",
        "Freelancing",
        "Blogging",
        "Making Money Online",
        "Writing",
        "Wanting and Making Money"
    ],
    "response": [
        {
            "author_info": {
                "name": "Lacy Comley",
                "href": "/profile/Lacy-Comley-3"
            },
            "answer_text": "You can find below, a list of websites that pay you to write, and how much they pay: Upwork:Link: https://www.upwork.com/ Up work is basically a freelancing hub, it can offer a variety of freelancing jobs online, that range from graphic design web development and all others. What’s interesting about Up work is it also specializes in finding people who can write for them. The topics can range from Technology, Health, Fitness, Medical, Legal, Business and so much more. On average, clients pay up to $30-75 per 500 words if you’re already an Intermediate writer. For beginners, it pays around $2-$15 per 500 words.Freelancer:Link:https://www.freelancer.com You can download 500K articles here :500k SEO friendly articles( PLR ) Much like Up work, Freelance also offers a variety of writing opportunities for budding writers, it also offers the same rates as Up work but it’s not as restrictive as Up work.Upworthy Link: https://www.upworthy.com Upworthy is quite famous for beginner level writers. Here writers are usually asked to write stories of different kinds and stories worth sharing. This site usually pays around $0.035-$0.65 per word and can range to $200.00 per article.CEO Hangout Link: http://ceohangout.com If you’re looking for a place where you can write about career, business, and finance, then this website is the right one you are looking for. It pays up to $150-$200 dollars per article. It also talks about career options and income.E-Commerce Insiders Link: http://ecommerceinsiders.com Another website that pays good money for writers is E-commerce Insider. This website talks about a lot of topics from finance, management, investment banking, and etcetera. They focus on online advertising and retail. They pay around $70-$150 per article.Freelance Moms Link: http://www.freelancemom.com By the name itself, this website is ideal for young moms to share about their experience as moms. You can write stories about motherhood and pregnancy and the great part about this site is that you can negotiate the prices. Articles that are selected for publication will be paid between $75 to $100 via PayPal. You must have a PayPal account to be paid. Every month, if your article is at the top of our most shared, you’ll be the winner of a special bonus of $150.Income DiaryLink: http://www.incomediary.com If you’re adept in SEO writing and how it works, then income diary is the writing website for you. It offers ways to generate money through online advertising and how one can make money online. You can negotiate the amount of money that you want to be paid for your article. If your article is selected, you will be paid the amount of money that you have asked for.Guide PostsLink: https://www.guideposts.org Guideposts publishes true stories about people who have attained a goal, surmounted an obstacle or learned a helpful lesson through their faith. A typical story is a first-person narrative with a spiritual point that the reader can apply to his or her own life. The story may be your own or someone else’s. Payment for full-length stories (about 1,500 words) is made when the story is accepted for publication.ParentLink: http://www.parent.co The name of this website would speak for itself. This article is basically about parenthood and help guidelines for new parents who would want to share their stories to the world. They pay $50 or more depending on the length of the article, and every article is also eligible for a social bonus of upto $300.Anxiety FoundationLink: http://www.anxietyfoundation.com A good catch for anyone who would like to share their experience, knowledge or tips about mental health. They pay $50/article.Funds for WritersLink: http://www.fundsforwriters.com Funds for writers accept articles of 500-600 words each, about earning a living as a writer. They pay $50 for unpublished original articles and $15 for reprints.Writers WeeklyLink: http://writersweekly.com They accept 400-600 word articles on how to make more money by writing! They are also interested in other forms of home-based businesses and self-employment that may result from writing, such as self-publishing, corporate writing, ghostwriting, etc. They pay $40 or $60 depending on the type of the article.RefineryLink: http://www.makealivingwriting.com The owner of this website, Carol, pays $75-$150 and up for select, longer assigned posts on specific topics related to making money online.Word Candy Link: http://wordcandy.co Word Candy is actually different from all other sites because they offer full-time writing positions. If you are a freelance blogger, they pay around 0.04$ to 0.08$/word.ListverseLink: http://listverse.com You write your list (10 items per list minimum), you send it in, and they reply and say “Great—we’ll publish it” and send you $100 by PayPal. They encourage not just expert writers, but also newbies to write a list.Women On WritingLink: http://wow-womenonwriting.com Wow! Women on Writing is an active site that pays women to write about their daily lives, from beauty tips and makeup. Articles range anywhere from 1,000 to 3,000 words—whatever length is necessary to cover the topic. Pay is arranged between the writer and editor for the piece, but most articles pay $50 or $75.Rank PayLink: https://www.rankpay.com Rank Pay is an SEO service that helps online advertisers do their job. If you’re good at SEO then this is the easiest way you can make money. They pay $50 for every original article they publish.Essig MagazineLink: http://www.essigmagazine.com Essig Magazine is famous for sharing inspirational stories and testaments. It’s basically a motivational website. They pay around $50 and up depending on the article.Just ParentsLink: http://www.justparents.co.uk Just Parents is a UK based company that gathers articles about parenthood and pregnancy and family. They pay around $50 per article.Dollar StretcherLink: http://www.stretcher.com They’re looking for specific ways to help people save time and money. In depth articles with practical ideas that people can employ to help them stretch their dollars. Query your article idea before submitting it. They accept articles that are 500-800 words in length. Payment is at the rate of $0.10 per published word. ",
            "date": "Answered September 20, 2020",
            "views": "22",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Igor Katušić",
                "href": "/profile/Igor-Katušić"
            },
            "answer_text": "What do you prefer to write? In other words, where do you feel most comfortable? Is it cookbooks, blogging about a specific subject, direct response, copywriting, content marketing, PRs, academic writing, business and finances, blockchain…? That’s the first thing you gotta wrap your mind around. The next thing you should do is write a few things in that particular area and try to publish them somehow - even if it’s a publicly accessible blogging platform like Medium, for instance. That’s gonna be your portfolio. The third step would be to sign up for an account on a freelancing platform with a sizeable volume of freshly posted writing gigs. Say, Upwork, or goLance, or Freelancer, etc. Now comes the juice. You see, on freelancing platforms, there is no guessing game. That is to say, people there are actively looking for a ghostwriter; that means, you. So just swipe through the listing and find the job that fits your skills and expertise, write a proposal, send it, and, hopefully, assuming that you did everything right, a client will respond and you’ll work out all the details. Write the damn thing, triple-check it, send it over, and collect your money. It’s that easy. If, however, you decide not to engage via platforms in this early stage; then it’s a hard road ahead because you’ll have to pinpoint a few prospects who might be interested in your service among the 4,2 billion people who connect to the internet every day. You can imagine the level of knowledge required to pull something like that off. The alternative way is to cold-pitch the editors with your stuff and hope that they’ll accept your submission. These types of gigs are commonly paid anywhere between $50 and $300+ In the end, it’s entirely up to you. But as you can see, you have options. ",
            "date": "Answered September 15, 2020",
            "views": "106",
            "upvotes": "0"
        }
    ]
}