{
    "title": "How often do college professors cancel class? - Quora",
    "tags": [
        "Academia",
        "College and University Faculty",
        "Teachers",
        "Teaching",
        "The College and University Experience",
        "Higher Education",
        "Colleges and Universities"
    ],
    "response": [
        {
            "author_info": {
                "name": "Ben Waggoner",
                "href": "/profile/Ben-Waggoner-1"
            },
            "answer_text": "I try hard not to cancel class at all. It might happen if I get too sick to teach effectively, although I’ve been known to soldier on even when my wife is telling me to stay home. I recall one time when I’d lost my voice; I got our AV guy to wire me up with a microphone, and I lectured anyway. The show must go on. I’ve very rarely had to cancel class when, say, my son gets sick and my wife can’t pick him up or stay with him—but that doesn’t happen every semester, probably not every year. I had to cancel once when we’d had a freeze; the campus was open, but my house’s driveway (on a steep hill) was iced over so much that I doubted whether I could down it safely, or get back up it afterwards. In the event of extreme weather, such as a light snowfall, the entire campus may close. If that happens, all classes are canceled. That’s not my decision. So I might have to cancel class. . . maybe once per semester, but not even that much if I can help it. I feel that if students are paying to attend my class, I’d better give them the fullest possible value for their money. This philosophy is not always enthusiastically held by my students, but I hold to it all the same. Every so often you hear about professors who cancel the first day of class, or who hand out the syllabus and dismiss everyone because it’s “Syllabus Day” or “Syllabus Week.” Screw that. EDIT: There are times when I know well in advance that we won’t have class, because I have, say, a convention to attend or something like that. In those cases I don’t really “cancel” class; I come up with a plan in advance. Usually I’ll try to get a fellow faculty member to cover for me, either proctoring an exam or giving a lecture that I’ve prepared in advance. I return the favor when I get the chance. Occasionally I might replace my scheduled class meeting with a take-home assignment or something like that. But I wasn’t thinking of those as “cancellation”, because I don’t intend to hold class and then suddenly change my plans. ",
            "date": "Answered February 19, 2019",
            "views": "64",
            "upvotes": " View 75 Upvoters",
            "upvoters": [
                {
                    "user_id": "Razeen Hossain",
                    "user_href": "/profile/Razeen-Hossain"
                },
                {
                    "user_id": "Erin Morrey",
                    "user_href": "/profile/Erin-Morrey"
                },
                {
                    "user_id": "Patrick Dashiell",
                    "user_href": "/profile/Patrick-Dashiell"
                },
                {
                    "user_id": "Daniel Newman",
                    "user_href": "/profile/Daniel-Newman-30"
                },
                {
                    "user_id": "Kathy Kang",
                    "user_href": "/profile/Kathy-Kang-9"
                },
                {
                    "user_id": "Zunnur Awan",
                    "user_href": "/profile/Zunnur-Awan"
                },
                {
                    "user_id": "Anna Kay",
                    "user_href": "/profile/Anna-Kay-28"
                },
                {
                    "user_id": "Hunter Hendrick",
                    "user_href": "/profile/Hunter-Hendrick"
                },
                {
                    "user_id": "Rebekah Mesa",
                    "user_href": "/profile/Rebekah-Mesa"
                },
                {
                    "user_id": "Alexander Fortier",
                    "user_href": "/profile/Alexander-Fortier"
                }
            ]
        },
        {
            "author_info": {
                "name": "Kip Wheeler",
                "href": "/profile/Kip-Wheeler-1"
            },
            "answer_text": "Entirely anecdotal here, but in general, the university as a whole (not the professors individually) may cancel a class in case of severe weather. At my current institution in Tennessee, that is typically about one day of class every other year, on average. Some years, no cancellations at all, and other years 1–3 days of snow cancellations in a single winter. I’ve had to cancel my own individual classes in an unscheduled manner (i.e., less than 24 hours warning in advance) a grand total of twice in 25 years, due to illness or whatnot. However, there’s usually at least one and sometimes two classes each semester that I specifically list as canceled so I can attend a convention or conference. That can be taking students to the Alpha Chi Honor Society national convention, where they compete for scholarships for each April, or it can be to present a paper at a medieval conference such as the one each May in Kalamazoo, Michigan. So, that’s usually 1–2 classes each year, but the students know about it months in advance, as it’s clearly marked in the syllabus. TL, DR: Unannounced cancellations? Very rarely. Scheduled cancellations? Maybe once or twice a year. ",
            "date": "Answered February 19, 2019",
            "views": "11",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Razeen Hossain",
                    "user_href": "/profile/Razeen-Hossain"
                },
                {
                    "user_id": "Sumedh Khanolkar",
                    "user_href": "/profile/Sumedh-Khanolkar"
                },
                {
                    "user_id": "Mariana Garcia",
                    "user_href": "/profile/Mariana-Garcia-31"
                },
                {
                    "user_id": "Ben Waggoner",
                    "user_href": "/profile/Ben-Waggoner-1"
                }
            ]
        }
    ]
}