{
    "title": "How to develop a 'never give up' attitude - Quora",
    "tags": [
        "Never Give Up",
        "Attitude",
        "Self-Improvement Advice",
        "Leadership",
        "Personal Goals",
        "Understanding Self-Improvement",
        "Self-Improvement"
    ],
    "response": [
        {
            "author_info": {
                "name": "LaRae Quy",
                "href": "/profile/LaRae-Quy"
            },
            "answer_text": " Determination and persistence were a way of life for me growing up as a hillbilly in Wyoming. We were among the poor and rural that make up most of this state—a two-hour drive from the nearest small town. It was a hard at times since I had no friends but my family moved on in life as stoic and stalwart people who knew how to keep going when it got tough. We had a never give-up attitude because plans work, until they don’t, and you feel sucker-punched. Often, your determination is the glue that holds your organization together when plans go awry or you’re confronted with an unexpected obstacle. Here is why determination is essential if we want to develop a “never give up” attitude: 1. DETERMINATION HELPS YOU OVERCOME THE UNEXPECTED  When things do not go according to plan, it’s tempting to give up. We lose our confidence and think about moving on to something that is easier. This is exactly what most people do because we’re afraid of failure and shirk away from things that are hard and necessary. Plans make us feel safe, but be ready when things spin out of your control so you can still land on your feet. You may need to change course and adapt in some way. Your goal remains the same, but your roadmap to get there may need to be changed. My parents could never have anticipated Mrs. Garrity’s death, but they drilled into me the dangers of surviving winters at an altitude of 7,000 ft. We always had extra blankets and clothes in our pickup when we traveled in cold weather. Mrs. Garrity was found wearing nothing but a dress, light jacket, low heels, and a flimsy scarf. What It Means For You: Develop an agile mindset by trying to anticipate potential setbacks and have a contingency plan for them. 2. DETERMINATION ENABLES YOU TO KEEP FOCUSED  When things go wrong it is hard to maintain motivation and focus. Determination allows you to remain focused on long term goals so you can adjust your behavior accordingly. Often, this requires you to keep emotions in check to prevent them from sabotaging your efforts to keep moving forward. We were laden with grief when Mrs. Garrity died. Packing up her things and sending them, along with her body, back to Chicago was emotionally very difficult. Maintaining focus on our duty to her family remained at the forefront of our thinking. What It Means For You: Visualize yourself accomplishing your goal no matter what it takes. Keep your eye on the goal and see yourself reaching the end. 3. DETERMINATION IS FED BY ENCOURAGEMENT AND SUPPORT  When things spin out of your control, find support and encouragement from those around you whom you trust and admire. Based on their experience and expertise, seek out their advice and suggestions on how to keep moving forward. Successful people with determination understand that they still need to do the hard work, but it is very encouraging when you are surrounded with positive reinforcement. No one is their own island and we all need other people’s assistance. It might just be a short chat or a few words of support. Be the person who reaches out when you need support rather than give up. A former schoolteacher heard about our situation and agreed to replace Mrs. Garrity so I could graduate from first grade. Our predictament was shared by many good friends and neighbors who wanted to reach out and help. What It Means For You: Do not be afraid to share your situation with others, but be picky about it. Make sure they are people who truly want what is best for you and will give you both constructive and positive feedback. Look for “mirror” friends who will be honest, loving, and objective. 4. DETERMINATION MAKES YOU DIG DEEP DOWN  If you are on a path that has value and meaning for you, you are definitely on the right path, so keep going. If you are not, then a setback or failure will be enough to make you give up and try something else. Success can be very misleading because often it is where we stay, whether it’s what really fuels us or not. It is a success that is based in complacency because we are too scared of failure to pursue the type of work that would provide value and meaning. What It Means For You: Don’t take the easy way out. Dig deep down and find the things that you can’t walk away from; that is your true north. When you are pursuing that kind of goal, it won’t matter what other people say because your inner vision is far stronger than any external obstacle you will come up against. ",
            "date": "Updated July 7, 2020",
            "views": "775",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Antti Vanhanen",
                "href": "/profile/Antti-Vanhanen"
            },
            "answer_text": "One of the biggest lies in today’s culture is that we get to choose our attitude. If that were true, why would anyone ever be insecure, jealous, or lacking motivation? Furthermore, wouldn't we be able to find someone - even a single individual - who has mastered this in every area and moment of their lives? And yet, no one can find this individual because he doesn't exist. So what does that tell us about attitude? Perhaps it is that attitude isn't something we really develop. Instead, we find something that is more important or interesting to us than anything else, and then that something pulls us through long hours, set backs, difficult problems, and unsupportive people.  Most people see motivation as the ability to keep pushing. It’s as if they have a heavy sleigh that they’re tasked to push everywhere they go, through swamps and forests and up mountains. From this perspective, isn’t it obvious how limited motivation is? Isn’t it clear that at some point, we are just going to get tired of pushing and our strength is going to run out? Fortunately, motivation isn’t about pushing. It’s about finding something that pulls you. When Michael Jordan spent his offseason doing hundreds of jump shots every single day, he wasn’t “forcing” himself to do it. When former Starbucks CEO Howard Schulz worked 13 hours a day and then continued working from home, he wasn’t “forcing” himself to do it. When GE CEO Jeffrey Immelt put in 100 hour work weeks for 24 years, he wasn’t “forcing” himself to do it. It's so deceptively easy to look at these examples and conclude that the key to their success was their work ethic and their ability to motivate themselves. I think that's completely backwards. I don't believe these guys motivated themselves to their success, but rather that they all found something that PULLED them to greater heights. They were so fascinated and inspired by what they were doing that putting in crazy hours wasn’t that big of a deal or sacrifice to make. Their magic ability wasn't their ability to motivate themselves but to stumble upon something that captured their imagination so completely that it pulled them forward like an invisible ski lift.  So does that mean we never need to push ourselves? Not quite. No matter how much you love what you do, there are going to be moments when you just don’t have much fight in you. You feel tired, demotivated, and insecure. In those moments, you will have to push through. But the pushing can never be done for a long time, because our ability to push is very limited. That’s why it’s vital that we find that which pulls us. What this essentially points to is that motivation isn't up to us, but rather we have to open up for motivation to find us. And when it does find us, in whatever form, we latch on and see where it takes us. And if it sometimes gets stuck in the mud, we help to push it along. We are like the man sitting on the cart, my friend, while life is the horse. Stop trying to be the horse. ",
            "date": "Answered January 24, 2020",
            "views": "89",
            "upvotes": " View 84 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Inna Zakin",
                    "user_href": "/profile/Inna-Zakin"
                },
                {
                    "user_id": "Wei Song",
                    "user_href": "/profile/Wei-Song-14"
                },
                {
                    "user_id": "Job Maosa",
                    "user_href": "/profile/Job-Maosa"
                },
                {
                    "user_id": "Suresh Mahanta",
                    "user_href": "/profile/Suresh-Mahanta"
                },
                {
                    "user_id": "Terry Dayle",
                    "user_href": "/profile/Terry-Dayle"
                },
                {
                    "user_id": "Kaylen Fletcher",
                    "user_href": "/profile/Kaylen-Fletcher-1"
                },
                {
                    "user_id": "Mani Ji",
                    "user_href": "/profile/Mani-Ji-2"
                },
                {
                    "user_id": "Stuart Roome",
                    "user_href": "/profile/Stuart-Roome-1"
                },
                {
                    "user_id": "Paula Harris",
                    "user_href": "/profile/Paula-Harris-40"
                },
                {
                    "user_id": "Nguyen Nam Phong",
                    "user_href": "/profile/Nguyen-Nam-Phong"
                }
            ]
        }
    ]
}