{
    "title": "How does the Medium website work? - Quora",
    "tags": [
        "Medium (social media)",
        "Work"
    ],
    "response": [
        {
            "author_info": {
                "name": "Victor Suarez",
                "href": "/profile/Victor-Suarez-18"
            },
            "answer_text": "After you create your profile using your twitter account, you can do this: 1-Write a Story or any number of them. Stories are your writings. Get your hands on the keyboard and write. You can add tags to your stories so you have more chance to be read. 2-Create a Publication/Collection: Publications are like categories, but better. They will help you group and organize your stories by topic, genre and whatever you like... The best thing is that people can subscribe to those publications and anytime you post a story to it they will be \"notified\" about the new story you created. 3-Follow your favorite authors, and... you guessed, people can follow you as well. You will get the same effect of the Publications but with anything the writer posts. 4-Recommend stories. That is, letting your followers know that you liked a specific post of another author. 5-You can search for content. This is pretty much self-explanatory. 6-See the list of top stories (the hot stories on medium at the moment). 7-Read posts from recognized authors and personalities, the medium staff, good writers, amateurs and the like. So there is content for everyone on medium. 8-View stats of your stories. Visits, reads, etc. 9-Share your stories and other people stories with your friends. 10-Comment on any line of a story; yes, you read it right \"any line of a story\" which is pretty cool. You can let the author know that you agree or disagree with a specific line on the story. 11-Import your stories/writings from another site and publish them on medium. 12-Last but not least... the interface; it is so simple to write a story, to comment, to add images, to edit...  you name it. All of it without losing the beauty that a great \"medium\" should have. If you want to learn more about Medium, I Recommend you to Write a Story and start your Publications. The more you write the better the chances you'll have to get a good number of followers of your publications and stories. ",
            "date": "Answered March 16, 2015",
            "views": "11",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Aswanth",
                    "user_href": "/profile/Aswanth-23"
                },
                {
                    "user_id": "Jacob Kim",
                    "user_href": "/profile/Jacob-Kim-1"
                }
            ]
        }
    ]
}