{
    "title": "How to remove permanent marker pen from inside a drying machine - Quora",
    "tags": [
        "Markers"
    ],
    "response": [
        {
            "author_info": {
                "name": "Betsy Megas",
                "href": "/profile/Betsy-Megas"
            },
            "answer_text": "In my experience, most permanent markers will come off most hard surfaces just by rubbing gently but persistently with a little rubbing alcohol. Hand sanitizer, which is mostly the same stuff, will work just as well. Pour a little onto a paper towel and just start rubbing gently in circles. Give the stuff a little time to dissolve if it seems to need it. I predict on the metal enamel surfaces, the marker will come right off. If it’s on plastic, it may leave a little discoloration, but nothing that’s going to prevent the machine from continuing to operate, or cause others’ clothing to be ruined. I’d avoid the stronger stuff (Goof off, WD40, etc.) both because they’re unneeded and they’re likely to do more damage. Rubbing alcohol is flammable, so leave the dryer open and give it plenty of time to evaporate before running the machine again. Once it’s evaporated (use plenty of ventilation, by the way, and try to avoid breathing too much), you should be good to go. Good luck. ",
            "date": "Answered February 20, 2017",
            "views": "15",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Ivan Braun",
                    "user_href": "/profile/Ivan-Braun-1"
                },
                {
                    "user_id": "Ankit Shai",
                    "user_href": "/profile/Ankit-Shai-2"
                }
            ]
        },
        {
            "author_info": {
                "name": "Godfrey McDonnell",
                "href": "/profile/Godfrey-McDonnell"
            },
            "answer_text": "In my experience the 500 is going to have to be paid as it’s management policy. My guess is if it’s permanent then it will not taint or come off under heat. To try it out put a wet white towel in the dryer and turn it on to see if it picks up any marks. When the appliance is cold and turned off you can try cleaning the marker off with a solvent like nail varnish remover or acetone. NB; Check the solvents do not damage or melt the surface about to be cleaned first and ventilate the area you are working in. One other product might work to clean with try WD40? If neither else works or first. ",
            "date": "Answered February 20, 2017",
            "views": "669",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Natalia Popova",
                    "user_href": "/profile/Natalia-Popova"
                },
                {
                    "user_id": "Patrick Daly",
                    "user_href": "/profile/Patrick-Daly-34"
                },
                {
                    "user_id": "Michael Dixon",
                    "user_href": "/profile/Michael-Dixon-29"
                },
                {
                    "user_id": "Sohail Ahmed",
                    "user_href": "/profile/Sohail-Ahmed-7"
                }
            ]
        }
    ]
}