{
    "title": "How to excel in essay writing exams - Quora",
    "tags": [
        "Essay Writing Skills",
        "Essays",
        "Writing Advice",
        "Grammar",
        "English Grammar"
    ],
    "response": [
        {
            "author_info": {
                "name": "Adrian Parr",
                "href": "/profile/Adrian-Parr-3"
            },
            "answer_text": "Quora have been vague about why they have collapsed this answer. I think that they have collapsed it because I have reused a lot of text in many of my answers (including this answer) to a lot of similar Quora questions.  The following is a summary of official advice about the academic essay part of the highly time-constrained exam IELTS. I have altered parts of the advice to make it apply more generally. For more information about IELTS, see my IELTS information page here on Quora. Depending on the question and circumstances, the default position is that you are allowed to, and should, include your own opinion. Your writing will normally need to include material that elucidates opposing points of view.You should not give too much personal information; we are looking at the bigger picture. Personal information is often completely inappropriate. If you do include personal information, it doesn’t matter if whether it’s a lie or not (as long as it’s plausible!).The examiners may be looking for (so you get credit for) a reasonable variety of language (in particular, vocabulary), ideally hopefully using some different vocabulary from the question. Your response should be logical.The biggest problem may be understanding exactly what the question requires, and answering it properly. When faced with the question, you can rewrite it to help to start forming your plan. For example, you have been asked to write about the following topic (in addition to further instructions on the page): “In many countries children are engaged in some kind of paid work. Some people regard this as completely wrong, while others consider it as valuable work experience, important for learning and taking responsibility. Discuss both these views and give your own opinion.” This long question can be re-written as follows:- Is paid work (children) wrong?Can paid work (children) be valuable work experience?Is it important for learning?Is it important for taking responsibility?What is my opinion?Answering each of the above questions to at least some extent is compulsory for a good mark. You may have other questions that pop up in your brain:- Where do children work?How do you define “children”?An alternative to the above is just circling the different parts of the question and adding your own questions if they pop up. You are advised to select 3 or 4 main points (arguments) for your essay. These will be points of view that (you imagine) people might have. 6, 7 or 8 is too many, because you won’t have time to write enough details. For example:- Children who don’t work are shielded too much from the realities of society, which will cause them problems later.Poor children who work are denied a proper education, so they will never be able to lift themselves out of poverty.It’s important to get the balance right - they should go to school and work part-time but not full-time.There should be a new work-based education system.I have written the above arguments in full, but of course you can abbreviate. You can write them as a list as above, or if you want you can do it as a “spidergram”, with the re-written questions, or the original question with parts circled, at the centre, and the main points radiating out. You are going to write 1 paragraph for each main point. You may not need an extra introductory paragraph or an extra concluding paragraph. The next stage is deciding your order of paragraphs (i.e. your order of main points). It works best if the final paragraph (at least) contains your opinion, the final paragraph links back to the question, and your opinion reflects the balance of arguments in the essay. (in other words, there should be more material in the essay supporting than opposing your opinion.) If there is no extra introductory paragraph, make sure that for your first paragraph, which obviously is going to introduce the topic as a whole, you choose a key argument that is quite strongly linked to most of the other arguments. In the above scenario you can conclude (your last paragraph) with your own opinion, which will hopefully be related to one of the arguments. In the above scenario you have the option of deciding that one of the arguments is less important and could be mentioned in one of the other paragraphs, in which case your essay is going to have 3 paragraphs. ↑ ↑ ↑ ↑ ↑ ↑ ↑ ↑ planning ↑ ↑ ↑ ↑ ↑ ↑ ↑ ↑ Above I have written hints for planning (5 min.) After this, it’s time to do the actual writing, directly onto the answer sheet. Each paragraph should contain its argument as a topic sentence, normally the first sentence of the paragraph (occasionally the second). So, this argument is the main point in the paragraph. The other sentences support or clarify the main point. Here is a possible paragraph 1, where I have chosen to use the first argument from the above list; the essay would begin as follows:- In many countries there is a school of thought that claims that children who are not employed are shielded from the realities of life and society, which is likely to cause them problems in their future life. In these types of society, children often work together with their families and learn a trade at the same time; in some cases this is considered the best form of education. However, many disagree, saying that this type of education is very limited, and in fact there are many problems with this; often children do not like their work and are working in dangerous conditions and sometimes even die.A possible start to paragraph 2 (where I have chosen the 2nd argument from the above list) could be:- The dominant view in the “developed West” is that most children in full-time paid work throughout the world are being denied a proper education, making it almost impossible for them to ever lift themselves out of poverty. In many European countries there are strict laws that regulate the employment of children; however there is a minority view that this restricts the freedom of children to….",
            "date": "Updated April 25, 2020",
            "views": "153",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Lillian Taylor",
                "href": "/profile/Lillian-Taylor-4"
            },
            "answer_text": "Thesis statements are usually written at the beginning of an essay giving the main purpose for writing the essay. All paragraphs following the thesis statement are written to develop the thesis statement. Example: Of the many factors which contributed to in the precipitation of the “Trail of Tears” were the increased number of immigrants the to United States in the mid 1800’s, the lack of available land, and the attitude toward the Indians of those claiming the land. Writing essay answers for an exam follow the rules of writing a good paragraph. That means your topic sentence will introduce the paragraph. This is followed by at least two (preferably three or more) sentences supporting the topic sentence. The closing sentence clinches or ties the preceding sentences together. Example 1: Just thinking about Meredith’s action made Josh angry (topic sentence). They had been friends since they were freshman , and now she was acting as though she hardly knew him (supporting sentence 1). Why did she have to put all that stuff on her face? He hardly recognized her any more (supporting sentence 2). Why, she didn’t even dress the same as she had last year! Sometimes when he saw her in the cafeteria, it seemed to him that she was posing for a photo shoot (supporting sentence 3). He felt a sharp pain of loss along with the anger. Where had Meredith gone? (closing sentence of paragraph) Example 2: “The Trail of Tears” refers to the cruel removal of Indians from their ancestral land to make space for the large number of farmers entering the United States.  These  farmers pushed the American government to make more land available (supporting  sentence 1). Thousands of Indians died on the forced march out of their ancestral lands (supporting sentence 2). They died for different reasons—- starvation, exposure, harassment attacks from frontiersmen, and weather conditions (supporting sentence 3) In addition to those Indians who died on the trail were the men who died taking arms against those forcing them from their homes (supporting sentence 4) This period of American history is considered to be one of the saddest.(closing sentence). Of the two paragraphs above, you will most likely use the type of paragraph shown by Example 2 which is basted strictly on facts, Other suggestions: Try to use different types of sentences—-declarative, interrogative, imperative, exclamatoryMake sure your punctuation is correct.Avoid making repetitive use of a word.",
            "date": "Answered April 3, 2017",
            "views": "605",
            "upvotes": " Answer requested by Johnny Lopez"
        }
    ]
}