{
    "title": "How to improve my leadership skills in university - Quora",
    "tags": [
        "Leadership Skills",
        "Leadership Development",
        "Leaders",
        "Leadership",
        "Management",
        "Skills",
        "Higher Education",
        "Self-Improvement",
        "Colleges and Universities"
    ],
    "response": [
        {
            "author_info": {
                "name": "Sanjib Kumar Ray",
                "href": "/profile/Sanjib-Kumar-Ray"
            },
            "answer_text": "Your steps - Try to speak whenever you are with your friends.Speak in such a way so that your friends like your speech.Try to know each and every problems faced by the students. Prepare your speech regarding the solution of those problems.Try to speak with the Principal or Professors when you are participating a group of representatives of some or other students’ union.Be patient enough to listen and withstand the criticism of others regarding your movements.",
            "date": "Answered May 30, 2019",
            "views": "8",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Soham Dey",
                    "user_href": "/profile/Soham-Dey-39"
                }
            ]
        },
        {
            "author_info": {
                "name": "Keith Johnston",
                "href": "/profile/Keith-Johnston-11"
            },
            "answer_text": "You can join organizations on campus that are providing services to the rest of the students. Every organization needs leadership and are constantly looking for people who can provide leadership. Demonstrate to the members of the organization you join that you can be trusted, you can get things done and that you are willing to listen to ideas presented by other members. You will do many tasks by yourself, but more importantly you need to help them get organized and get things done by leveraging the skills of the entire organization. ",
            "date": "Answered June 11, 2019",
            "views": "12",
            "upvotes": " Answer requested by Prateek Jain"
        }
    ]
}