{
    "title": "How can 'cumbersome' be used in a sentence? - Quora",
    "tags": [
        "Sentences",
        "English Diction and Word Usage",
        "Diction and Word Usage",
        "Grammar",
        "English Grammar"
    ],
    "response": [
        {
            "author_info": {
                "name": "Jian She",
                "href": "/profile/Jian-She"
            },
            "answer_text": "Some sentences on our Website sentencedict.com, hope helps: 1. The organization has promised to eliminate cumbersome and unnecessary bureaucracy. 2. Although the machine looks cumbersome, it is actually easy to use. 3. They're making efforts to streamline their normallycumbersome bureaucracy. 4. Our Intelligence Service was untrained, cumbersome, and almost wholly ineffectual. 5. Doctors are complaining that the system is cumbersome and bureaucratic. 6. The organization changed its cumbersome title to something easier to remember. 7. It's rather cumbersome having to carry all these cases around. 8. Donors also remain intrusive, cumbersome and rivalrous in their giving. 9. He lowed his head in shame, his cumbersome face burning . His fingers felt gross and unwieldy. 10. The cumbersome eighteen - wheeled vehicle was spread across the road, blocking all traffic movement. 11. The proposed regulations are ill-defined and cumbersome and could be unnecessarily costly. 12. The furniture is too cumbersome to move. 13. Quiet, roomy cabin and off-road adeptness overshadowed by cumbersome curb weight, soft suspenders, and a tacky dash. 14. Editing text or changing tab order involved a cumbersome process. 15. Quiet, roomy cabin and adeptness overshadowed by cumbersome curb weight, soft suspenders, and a tacky dash. ",
            "date": "Answered October 4, 2016",
            "views": "312",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Hua Li",
                    "user_href": "/profile/Hua-Li-51"
                }
            ]
        }
    ]
}