{
    "title": "How to earn money online by writing movie scripts or sending ideas - Quora",
    "tags": [
        "Screenwriters",
        "Movie Scripts",
        "Screenwriting",
        "Making Money Online",
        "How-to Question"
    ],
    "response": [
        {
            "author_info": {
                "name": "Julie Frey",
                "href": "/profile/Julie-Frey-3"
            },
            "answer_text": "There are greeting card companies that accept your content and artwork. You have to submit your content according to company rules. You are only paid if your submissions are accepted and used. Oatmeal StudiosAvanti PressBlue Mountain ArtsCracked humor website accepts your articles written in a style much like what you read now. Or you can start your own content website and post content in your style. Put up your script ideas. Get feedback from readers. Once you start a serious project, it is your job to complete it to the end according to industry standards and expectations. ",
            "date": "Answered April 25, 2018",
            "views": "37",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Steven Cateris",
                    "user_href": "/profile/Steven-Cateris"
                }
            ]
        },
        {
            "author_info": {
                "name": "Nick Hopkins",
                "href": "/profile/Nick-Hopkins-53"
            },
            "answer_text": "Writing scripts is not the same as running a business on Etsy. You don’t just knock out a script or idea and sell it online. No such business model exists because that is simply not how the industry works. If you are prepared to put the substantial work and skill into writing a script or a treatment then you will have to pitch and sell it like everyone else, but to think this is some sort of online side job is, frankly, ludicrous and insulting to the profession. ",
            "date": "Answered August 22, 2019",
            "views": "777",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Mani Gill",
                    "user_href": "/profile/Mani-Gill-4"
                }
            ]
        }
    ]
}