{
    "title": "How good is Adobe InDesign? - Quora",
    "tags": [
        "Is X Any Good?"
    ],
    "response": [
        {
            "author_info": {
                "name": "Jitendra Singh",
                "href": "/profile/Jitendra-Singh-544"
            },
            "answer_text": "There isn’t much confusion making when it comes to Adobe Indesign. Since Adobe Indesign itself is pretty specific in terms of what it can do and what it doesn’t do, while Photoshop and Indesign both share similar tools, interface, and abilities to create web graphics to in almost identical level. Indesign is generally used for: Editorial designBook designMultiple page brochuresAnnual reportsInteractive PDF documentsCommon mistakes/misconceptions Although it is possible to “draw” objects in Indesign, it is not superior to drawing as it is with Illustrator. You should not draw elements in Indesign, but instead, use programs such as Illustrator or Photoshop to draw out the elements and import them into Indesign. Indesign also does not have filters like Photoshop. Creating a logo in Indesign is next to impossible. Although there isn’t much misconception with Indesign, there is much wide spread debate about Illustrator having better layout support than Indesign. Indesign however has better layout support, if not, identical to Illustrator. When to use Indesign If your project consist of a print project that has multiple pages or a master layout, Indesign has the master page function to do this. Indesign also has excellent support for 3 column layouts and so on. Creating type wrap in Indesign is much straightforward than Illustrator. ",
            "date": "Answered October 4, 2019",
            "views": "353",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Olise Onwuka",
                    "user_href": "/profile/Olise-Onwuka"
                }
            ]
        },
        {
            "author_info": {
                "name": "Steven Lee",
                "href": "/profile/Steven-Lee-9"
            },
            "answer_text": "Indesign is a layout program, not a word processor, it is not so much like MS Word but more like Quark Xpress, and Aldus Pagemaker. With Indesign, you can combine various artwork like photographs, diagrams, charts, scanned images, with typography, into a page layout. This could be a single page, like a postcard, poster, or billboard, or multiple pages, like a booklet, magazine, or book. You can create documents of many types, from brochures to  banners, business cards, bumper stickers, restaurant menus, stationary, hang tags, convention signage, anything from a simple document like a note card with a little bit of text, to a full-color magazine with images and as many variety of graphical devices that you can think of. When properly constructed, the Indesign file can be saved as a .pdf and sent to a print vendor for printing, or the .pdf can be used for online distribution. ",
            "date": "Answered March 18, 2014",
            "views": "2",
            "upvotes": " View 5 Upvoters",
            "upvoters": [
                {
                    "user_id": "Yang Liu",
                    "user_href": "/profile/Yang-Liu-1125"
                },
                {
                    "user_id": "Jenna Appleseed",
                    "user_href": "/profile/Jenna-Appleseed"
                },
                {
                    "user_id": "Jide Adewunmi",
                    "user_href": "/profile/Jide-Adewunmi"
                },
                {
                    "user_id": "Thomas Phinney",
                    "user_href": "/profile/Thomas-Phinney"
                },
                {
                    "user_id": "Gaurav Chaudhary",
                    "user_href": "/profile/Gaurav-Chaudhary-32"
                }
            ]
        }
    ]
}