{
    "title": "How much money do authors make when releasing their first book? - Quora",
    "tags": [
        "Publishing",
        "Writers and Authors",
        "Writing"
    ],
    "response": [
        {
            "author_info": {
                "name": "Roger Parker",
                "href": "/profile/Roger-Parker-17"
            },
            "answer_text": "Hello! One size does not fit all! To begin with, it depends on who you are. Do you have a large and growing following, as measured by the size of your email list? Are you a regular contributor to large and credible blogs? Have you enjoyed much creditibility and visibility in your field? Finally, does your network include respected authors of previous successful books in your field that might write a Foreward for your book or.provide a testimonial? Your financial position also plays a role. Do you have the resources to hire a publicist? How many copies of your book are you prepared to purchase? What about your speaking career? How many people will you be speaking in front of during the next year? Additional criteria Other criteria that potential book publishers consider include: Size of the market. How large is the potential market? Is the market for your topic expanding or contracting?Competing books. How many existing book will yours have to compete against? What’s the leading book in your field? When did it first appear, or when was it last updated?Differentiation. How do you intend to differentiate your book from competing books? Successful books have a definite position, one that separates them from competing books. Rob William’s Design for Non-Designers is just one example of obvious book positioning—targeting inexperienced designers. Another example is What to Expect When You’re Expecting. You can target books on market characteristics like age, income, education, occupation, marital status, or even the Zip Coded where they live?Market activity. How many reader reviews appear on the pages describing competing books? When was the last review posted? Do you consider the reader reviews credible or “planted?”Background and motivation. If you’re a published author, what kind of sales track record and/or reviews have your earlier books enjoyed? If you’re not a published author, your book proposal will receive more attention than most. What kinds of long-form writing have you done in the past? Publishers look for authors who are passionate about their topics. Does your book proposal accurately reflect your motivation?As you can see, it’s extremely difficult to offer a range of potential author advances and royalties. There are simply too many factors to be considered. Obvious, books written by Bill and Hilary Clinton would be more likely to receive a People Magazine-worthy advance than you and I. Nevertheless, your book proposal is extremely important to your future success, so much so that I have a lot to say about the topic. Let me know if you’d like me to address your questions about book proposals! Roger Online Shopping for Electronics, Apparel, Computers, Books, DVDs & more page activity. ",
            "date": "Answered January 27, 2019",
            "views": "969",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Bill Giovannetti",
                "href": "/profile/Bill-Giovannetti"
            },
            "answer_text": "The answer will be different for self-published writers and traditionally-published writers. Self-published writers: you will probably use Amazon/CreateSpace as your platform. In that case, you will make a percentage of every book you sell on Amazon — these royalties are listed for you to the penny when you create the book. For a $14.99 cover price, you will make $3–5 per paperback book, and a bit less for e-books. So, go forth and sell! For Traditionally published writers: you will receive an advance, ranging from $3,500 to $7,500 depending on what field you’re writing into, and how hot your topic is. If you’re new, it will be on the low end. Expect it to take at least a year for your book to hit the shelves. After that, you will make about 15% of the sale price of each book (if the book is discounted, so is the royalty). However, you do not see that money. That money goes to the publisher to pay back your advance. BTW, you NEVER have to pay back your advance if you don’t earn enough in sales, unless you signed a very shady contract to begin with. Get a good agent! Once the advance has “earned out” you will start making that 15% royalty on every book sold. You receive a quarterly sales report from your publisher, showing the math on all this. In both cases, it’s all about selling! ",
            "date": "Answered May 1, 2019",
            "views": "883",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Emily Lee",
                    "user_href": "/profile/Emily-Lee-538"
                },
                {
                    "user_id": "Sambhav",
                    "user_href": "/profile/Sambhav-16"
                }
            ]
        }
    ]
}