{
    "title": "How to change all periods to size 14 on Google Docs - Quora",
    "tags": [],
    "response": [
        {
            "author_info": {
                "name": "Laura Christina Warren",
                "href": "/profile/Laura-Christina-Warren"
            },
            "answer_text": "The only way I know of that you can do this is to use an Add-on that makes Google Docs Find and Replace act like Word’s Find and Replace. Here’s the link: Advanced Find & Replace - Google Docs add-on I tried adding it on and it told me that I can use it 30 times. Once you install the Add-on, you can find it by clicking on the Add-ons menu and choosing Advanced Find & Replace > Find & replace.  The Advanced Find & Replace pane will appear. Fill it out like the image here. Enter a period in the Find box and another period in the Replace box. Beneath the Replace box, select the Change formatting option and in the Font size box enter 14.  When you click on the Find/Replace all button, your changes will be made. I added a color to the periods so that you can see them more easily.  ",
            "date": "Answered November 13, 2019",
            "views": "51",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Harry Parker",
                    "user_href": "/profile/Harry-Parker"
                }
            ]
        },
        {
            "author_info": {
                "name": "Ian Wanyonyi",
                "href": "/profile/Ian-Wanyonyi"
            },
            "answer_text": "Just SELECT the period and alter its size to 14. However, this could be tiresome if you intend to change the sizes of periods in the whole document. The FIND AND REPLACE option could prove valuable here. Put one period in the find box and another one in the replace box. Under the replace box, there is a sign that reads CHANGE FORMATTING OPTION. Select it and enter size 14 in that box CLICK OK and wait to observe some magic. Additionally, if you intend your text and periods to be of size 14, the select the whole document and change the size. The FIND AND REPLACE method is only important if you want your text and periods to have different sizes. ",
            "date": "Answered May 17, 2020",
            "views": "31",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Devante Stewart",
                    "user_href": "/profile/Devante-Stewart-4"
                }
            ]
        }
    ]
}