{
    "title": "How to write a detailed yet concise summary of an article - Quora",
    "tags": [
        "Journalism",
        "How-to Question"
    ],
    "response": [
        {
            "author_info": {
                "name": "Robert Charles Lee",
                "href": "/profile/Robert-Charles-Lee"
            },
            "answer_text": "Thanks for the A2A. We have to take a practical approach to the matter. A summary is a summary is a précis. It's an abridgment of the full article. It's an expository type of writing -- the purpose is to describe or inform rather than explain. Typical lengths are less than 500 to 1,000 words, depending on the subject matter and the subject field. The usual (often taught) way is to pick the article's most important details and then describe them in short form to produce your summary. But picking details isn't exactly an easy thing to do. The summariser might not be knowledgeable or familiar with the topic. That makes it hard for the summariser to decide which are the important points to select. So the emergency measure to summarising boils down to rewriting the article. Several rounds of rewriting are often necessary to pare things down. Over time, that experience will generally help the summariser get the hang of things. So in short: A summary abridges the full article. It describes and inform rather than to explain. A summary is around 500 to 1,000 words, depending on the topic. Picking the important details is the usual way, but that can be problematic for the person not familiar with the topic. Therefore, continual rewriting of the full article into shorter and shorter form is a practical way to pare it down. I think you get the general idea. ",
            "date": "Answered December 27, 2014",
            "views": "44",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Tomo Albanese",
                    "user_href": "/profile/Tomo-Albanese"
                },
                {
                    "user_id": "Sangram Gaikwad",
                    "user_href": "/profile/Sangram-Gaikwad-1"
                },
                {
                    "user_id": "Ankit Singh",
                    "user_href": "/profile/Ankit-Singh-127"
                },
                {
                    "user_id": "Christian Hege",
                    "user_href": "/profile/Christian-Hege"
                }
            ]
        },
        {
            "author_info": {
                "name": "Holly Coates",
                "href": "/profile/Holly-Coates-2"
            },
            "answer_text": "Writing a summary of an article can be tricky because you need to understand: the article itself and what’s it about;all the requirements for writing an article.So, before you start, read the article very carefully and thoughtfully. When done, re-read it and take notes: you will further use them when writing a summary itself. When you’re reading an article. think what was the main point of it, what author wanted to point out, etc. When ready. make a draft of the summary. Read it and see if it has enough information to understand the original text. If not - rewrite it, add the important information. And if everything is ok, proceed with writing.  For additional information, check out this site: How to Write a Summary ",
            "date": "Answered August 19, 2017",
            "views": "32",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Muhammad Hakim",
                    "user_href": "/profile/Muhammad-Hakim-35"
                }
            ]
        }
    ]
}