{
    "title": "How to stop feeling jealous and worthless when I see other people who have achieved more than me - Quora",
    "tags": [
        "Jealousy and Envy",
        "Understanding Emotions"
    ],
    "response": [
        {
            "author_info": {
                "name": "Vikas",
                "href": "/profile/Vikas-88"
            },
            "answer_text": "Once in a while even I feel jealous. If you are jealous and feel worthless, you will always feel that way even if you achieve the stars, sun and the moon. Even if a jealous person achieves everything, the next step that person would take is to make sure that no one reach up to his/her level. And he will try to put down everyone who comes on a par with him. Such people never enjoy their life. No matter how much you try, universe will always sent someone who is better well off than you, more beautiful than you, stronger than you. You can become No.1, But you cannot be No.1 forever. Happiness is an inside job. Money, power, a beautiful partner will never eradicate the feeling of jealousy or low self-worth. You are special, unique like your DNA and same applies to everyone. If you want to compare, Do it with yourself. Everyday try hard to be a better person than yesterday. BUT NEVER EVER COMPARE WITH OTHERS. People who don’t have anything have problems and people who have everything suffers as well. Problem of rich and famous are endless. Few problems mentioned on this link 10 Ways Rich People Are Worse Off Than You Never compromise on your happiness. Never hurt anyone and never be a reason for others unhappiness. That’s all matters. ",
            "date": "Answered October 28, 2017",
            "views": "813",
            "upvotes": " View 5 Upvoters",
            "upvoters": [
                {
                    "user_id": "Janna Ukoko",
                    "user_href": "/profile/Janna-Ukoko"
                },
                {
                    "user_id": "Katryn Lerisya",
                    "user_href": "/profile/Katryn-Lerisya"
                },
                {
                    "user_id": "Gurleen Kaur",
                    "user_href": "/profile/Gurleen-Kaur-85"
                },
                {
                    "user_id": "Joanna Tan",
                    "user_href": "/profile/Joanna-Tan-44"
                },
                {
                    "user_id": "Neha Singh",
                    "user_href": "/profile/Neha-Singh-1861"
                }
            ]
        },
        {
            "author_info": {
                "name": "Vivek Singh",
                "href": "/profile/Vivek-Singh-3284"
            },
            "answer_text": "ONE stop simple solution for this problem is to use it PRODUCTIVELY. First of all, never think that by feeling jealous of other’s achievement , you have done any SIN. Jealousy is a natural human emotion like feeling happy and sad. If this is done half of the issue is resolved. Next , try to figure out why were you left behind. We naturally think about it when we feel jealous and DONT IGNORE THEM And then think of the ways you can overcome these hurdles cuz of which you were left behind and work on then . You might fail a couple of time but once you start overcoming them ,feeling of WORTHLESSNESS will never bother you. Life alwaysys gives you SECOND chance to achieve THE BIGGER GOAL. It's only a matter of perspective. I think feeling jealous is not bad , rather it's a sign of being human. Only rational man and achievers feel jealous . The word jealous might sound oxamoron with the word achiever but achievers are the people who utilize this feeling positively by analysing faults in themselves and working on them rather than finding faults in success of others. Lastly I would say that jealousy is not bad till it takes you to a negative path or towards a negative bent of mind. When human can make productive things out of waste / garbage , I am sure we humans are innovative enough to bring out our own ways to use jealously PRODUCTIVELY. ",
            "date": "Answered October 26, 2017",
            "views": "469",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Janna Ukoko",
                    "user_href": "/profile/Janna-Ukoko"
                },
                {
                    "user_id": "Luna Shaik",
                    "user_href": "/profile/Luna-Shaik"
                }
            ]
        }
    ]
}