{
    "title": "How to write a great sale copy - Blogging And Marketing - Quora",
    "tags": [
        "Copy Editing",
        "Copywriters",
        "Copywriting",
        "Buying and Selling",
        "Creative Writing",
        "Sales",
        "Writing Advice",
        "Marketing",
        "Writing"
    ],
    "response": [
        {
            "author_info": {
                "name": "Nina",
                "href": "/profile/Nina-1569"
            },
            "answer_text": "Know your product. Not just basic specs or general details, but go in-depth and see beyond what’s written on the box. Make it a bit personal on would you use them, how do you feel about the products and so on. Know your products like you would for a friend.Know the target market of that product. Who are they aiming to. Think of the product as your friend, and you’d want to introduce this awesome friend to a guy/girl. You’d want to give great impression that their relationship is going to last.Clear and Concise. Concise doesn’t always mean short. Write what you need to write and that’s it. Write it clearly that people don’t have to think like they’re reading a detective novel. Play a bit here and there if you want, but still it has to be clear and doesn’t leave people guessing what you’re trying to say. If they have to think, analyze and eventually come with their own interpretation, I guess I’m in trouble.",
            "date": "June 19, 2020",
            "views": "110",
            "upvotes": " View 2 Upvoters ",
            "upvoters": [
                {
                    "user_id": "David Clive Ramsey",
                    "user_href": "/profile/David-Clive-Ramsey"
                },
                {
                    "user_id": "Aamir Kamal",
                    "user_href": "/profile/Aamir-Kamal-2"
                }
            ]
        },
        {
            "author_info": {
                "name": "Elnur Abasli",
                "href": "/profile/Elnur-Abasli-1"
            },
            "answer_text": "These are some things I keep in mind when writing my own sales copies and so far they work fine. Let me share them with you : Keep it dumb simple: Don’t make your copy seem “smart” keep it simple. Use simple language to explain your product or service. A good friend of mine once told me: “Explain your product to your customers as if you are explaining it to a 5-year-old”Prioritize headline: If your headline doesn’t catch the attention of the reader then it doesn’t matter how good body copy is, no one is going to read it. Make sure your headline is attention-grabbing. I wrote a headline for a “posture corrector” product. Original headline was this: “Your posture is the reason behind your bad health.” I changed it to “Your posture is the reason behind your varicose” (Which is true) and that simple headline change increased click-through-rates by 7%. This point brings me to my second point which is!Research your product or service: Research what will your product help your potential customers with and mention them in your copy! Know who is most likely going to read your copy. Men or women? Young or old? All of these change how you should write your copy immensely!Explain benefits first, technical details the second: Show the benefits of your product or service to your customer. Explain how your product will help them with a specific problem they are facing right now.Build trust: Remember that your product is no silver bullet. It is better that you point out your flaws first then let your customers unveil it. Remember that being honest especially online is going to differentiate your entire business from others that are less transparent!I hope this simple list helps you in writing a better sales copy, it certainly helped me! Have a great one! :) ",
            "date": "June 19, 2020",
            "views": "314",
            "upvotes": " View 6 Upvoters ",
            "upvoters": [
                {
                    "user_id": "David Clive Ramsey",
                    "user_href": "/profile/David-Clive-Ramsey"
                },
                {
                    "user_id": "Esraa Kasem",
                    "user_href": "/profile/Esraa-Kasem-1"
                },
                {
                    "user_id": "Anastasiia Sereda",
                    "user_href": "/profile/Anastasiia-Sereda"
                },
                {
                    "user_id": "Todd Haley",
                    "user_href": "/profile/Todd-Haley-11"
                },
                {
                    "user_id": "Ali Mohd",
                    "user_href": "/profile/Ali-Mohd-125"
                },
                {
                    "user_id": "Aamir Kamal",
                    "user_href": "/profile/Aamir-Kamal-2"
                }
            ]
        }
    ]
}