{
    "title": "How long will it take me to write 1000 words? - Quora",
    "tags": [
        "Creating Writing Advice",
        "Essays",
        "Creative Writing",
        "Writing Advice",
        "Learning New Things",
        "Linguistics",
        "Language",
        "Writing",
        "English (language)"
    ],
    "response": [
        {
            "author_info": {
                "name": "Rob Wanless",
                "href": "/profile/Rob-Wanless-3"
            },
            "answer_text": "How Long will it take me to write 1000 words? So, roughly, if you write a word a day, then this will take about three years. Good luck—this will be time well spent. I think you should very carefully pick each word when you do your daily word writing. Do not start right away, make each word, and each day count. If you want to put all these words together, then please, do not think of these as “1000 words” think of words together as sentences and paragraphs; these are interrelated. Think of an idea or topic—then make a statement about that topic. Tell us about that statement, explain that statement. Give us some background about the topic. I will joke that many of my students will finish a 1000 word homework assignment twenty minutes before it is due. They will come in and finish and print right before class. And I can tell that they just finished. If you want to write five good paragraphs (that is roughly a thousand words) take some time, do some reading, take a week to write it. It takes about fifteen minutes to type a thousand words, but to write a good essay, take a week. ",
            "date": "Answered August 29, 2020",
            "views": "28",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Om Kaushik",
                    "user_href": "/profile/ओम-कौशिक-Om-Kaushik"
                }
            ]
        },
        {
            "author_info": {
                "name": "Chhavi Kandhway",
                "href": "/profile/Chhavi-Kandhway"
            },
            "answer_text": "It depends on the topic you are writing about. If you have enough knowledge about the topic it should take you one hour to make the first draft of the article. After you have made your first draft you can then take a break of half an hour come back and edit the article. With this process, approx 3 hours per day is enough to write a 1000 word article. If you continue to write regularly this time will reduce considerably and you will be able to write 1000 words article in around 45 minutes. Three years back when I started writing it took me a week to write 1000 words. But now I write 1000 words in 2 hours. ",
            "date": "Answered August 31, 2020",
            "views": "15",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Om Kaushik",
                    "user_href": "/profile/ओम-कौशिक-Om-Kaushik"
                }
            ]
        }
    ]
}