{
    "title": "How many pages should I write a resume in order to apply for a software engineer role? - Quora",
    "tags": [
        "Résumé and CV writing",
        "Résumés and CVs",
        "Software Engineers",
        "Software Engineering",
        "Jobs and Careers"
    ],
    "response": [
        {
            "author_info": {
                "name": "Kiruthick R",
                "href": "/profile/Kiruthick-R"
            },
            "answer_text": "Software engineer jobs can receive hundreds of resumes and the biggest mistake we see at The Onset is when an applicant’s relevant experience is diluted by a heap of information around it. A ten-page long resume that goes into detail about every small-scale job or piece of technology used in the last 20 years will likely bore the reader and dilute your essential strengths. It’s also important to understand the nature of the role you’re applying for and the type of company and be as concise as you can. If you internalize exactly what an employer wants from a job posting, and show in your resume how your skills match what they’re looking for, you’ll be ahead of the pack. ",
            "date": "Answered May 29, 2020",
            "views": "38",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Ron Auerbach",
                "href": "/profile/Ron-Auerbach-2"
            },
            "answer_text": "With a resume, the general rule is 2 pages at the maximum. But whether it should be one page, 1 1/2 pages, 1 3/4 pages, etc all depends upon your overall background, wording of things, and the resume’s layout. What you want to do is make sure that it impresses enough to get you an interview. If all it takes is 1 page, great! If you need to go to a second page, fine too. So as long as it’s professional, looks good, and says what it needs to in order to impress, that’s exactly what you want most of all. ",
            "date": "Answered June 1, 2020",
            "views": "47",
            "upvotes": "0"
        }
    ]
}