{
    "title": "How should I do article submission for SEO? - Quora",
    "tags": [
        "Article Submission",
        "SEO Tools"
    ],
    "response": [
        {
            "author_info": {
                "name": "Piyush Parmar",
                "href": "/profile/Piyush-Parmar-8"
            },
            "answer_text": "1. Headlines should be descriptive As I mentioned in a recent post on journalism and SEO, some lamented the passing of the pun headline with the coming of the web. They were fun, and there’s nothing to stop them being used in print, but web headlines do need to be descriptive. Who knows, maybe you can manage both in one headline. The problem is that non-descriptive headlines don’t work so well out of context. The headline has a big effect on rankings too, so they don’t work for SEO. It short, it needs to tell people what they can expect from the article. 2. Avoid crappy clickbait headlines Definitions of clickbait will vary, but I think many people will agree on what crappy clickbait is. There’s this kind of garbage which appears on many news sites these days. There’s worse out there, but this is from a Washington Post article on Syria, very relevant… Clickbait can also refer to headlines that don’t deliver on their promises. Too much hyperbole, tips on SEO that promise to revolutionise your marketing strategy, and so on. Yes, headlines need to be enticing, but there’s a balance to strike. Don’t overdo it. Headlines which promise the world and bring in traffic only to disappoint will not work as a long-term strategy. 3. Headlines have to work on their own When we write articles, it’s easy to think of them placed on top of the article and forgot that they’re often seen out of this context. They’ll be seen in tweets, newsfeeds, newsletters, search results pages and more. They’re often competing for attention with other articles, and your potential readers will scan and decide whether to click in a relatively short space of time. So, the headline needs to work alone as, hopefully, these examples from SEW’s Twitter do: 4. Think about headline length The web, in various ways, limits the length of your headlines: Google will only show the first 55-60 characters of a page title, so bear this in mind when creating headlines. Keep it under 55, or consider what will happen if it cuts off at that point. We’ve just about made it with our internal linking article, while Moz and SEOmark are well within the limit. As for the KISSmetrics post, we’ll have to click to find out what these commandments will do…Social media. Consider the character limits on social posts. For example, if you want to tweet an article, adding the URL and image, then the headline shouldn’t be too long.Email newsletters. It varies according to the device or email program your subscribers are using, but shorter headlines are more likely to be viewed in full.Readability. Sorry to state the obvious, but it’s easier to read and digest a shorter headline quickly. Make it too long and people are less likely to read it.All in all, my advice would be to keep headlines under 60 characters where possible, especially if you’re looking to create evergreen content which works well in search results. Which is why the following headline is 103 characters long. 5. Don’t promise what you can’t deliver This ties in with the clickbait point to an extent, but you can write a good headline and not deliver on the content. Now, some of this comes down to quality. If you offer what you bill as ‘killer tips’ and they’re just collated from a bunch of posts around the web, without much original thought or detail, people will feel like they’ve been had. There’s a tendency towards adjectives in headline writing that can sometimes oversell content -‘amazing tips which will supercharge your content marketing’ etc. If you’re going to go bold, you’d best be confident that your content matches the title. I’ve gone for ‘the ultimate guide’ on a recent ClickZ post. Think I’ve gotten away with it so far… 6. Be concise As we know from point four, there are a number of reasons to keep headlines relatively short. Take time and look at your headlines. Is every word essential? If not, remove it. 7. See what works and learn from it Take a look at your analytics, and look at the articles that are being shared more on social media. Can you spot a few common features? For example, these are the five most shared SEW articles from the past six months, as shown by Buzzsumo. I’d say in all cases the title tells the user what to expect if they click on it. They’re all relatively short too, and of course, we have a couple of lists in there. It’s good to look at a mixture of tools to get the right idea. What works on social isn’t necessarily the same as what works in terms of traffic, or in terms of leads or conversions. However, some common factors should emerge that will help you create better headlines. 8. Add keywords to headlines The rule was always to front-load keywords, but this is supposed to be less important to Google now. I’d still want to get my keywords in the title though. It will help with ranking, it’s more likely to be used as anchor text if people link back to your site, and these keywords can also catch the attention of your target audience on social sites, in newsletters or in search results. 9. Don’t be afraid of lists It’s easy to mock the listicle, but the plain fact is that they work well online. People like lists, it tells them that the article has a defined structure and should therefore be easy to read and digest. These are the top ten pages from the past year on SEW. Five are number, six are lists. If I stripped out the homepage and category pages, there’d be more. ‘How to’ also works well for us – four of the top 20 fit this pattern. Then there’s asking and answering a question – these work on people’s natural curiosity and, if written well, are useful to the reader. 10. Collaborate on headlines Sometimes I’ll come up with headlines alone, but I find it helps a lot to discuss with colleagues and bounce ideas around. Source: https://searchenginewatch.com/2016/03/21/10-tips-for-writing-effective-headlines-for-the-web/ ",
            "date": "Answered May 2, 2016",
            "views": "19",
            "upvotes": " View Sharers ",
            "upvoters": [
                {
                    "user_id": "Annabelle Adams",
                    "user_href": "/profile/Annabelle-Adams-23"
                },
                {
                    "user_id": "Emma Milner",
                    "user_href": "/profile/Emma-Milner-24"
                },
                {
                    "user_id": "Emily Conlin",
                    "user_href": "/profile/Emily-Conlin-9"
                },
                {
                    "user_id": "Julia McManaman",
                    "user_href": "/profile/Julia-McManaman"
                },
                {
                    "user_id": "Vlad Apex",
                    "user_href": "/profile/Vlad-Apex"
                },
                {
                    "user_id": "James Apex",
                    "user_href": "/profile/James-Apex-1"
                },
                {
                    "user_id": "Ewald Langosh",
                    "user_href": "/profile/Ewald-Langosh"
                },
                {
                    "user_id": "Darien Langosh",
                    "user_href": "/profile/Darien-Langosh"
                },
                {
                    "user_id": "Adolph Cummings",
                    "user_href": "/profile/Adolph-Cummings"
                },
                {
                    "user_id": "Alex Perotti",
                    "user_href": "/profile/Alex-Perotti-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Seobeans",
                "href": "/profile/Seobeans"
            },
            "answer_text": "What is article? Article is like an essay and it gives detail knowledge about a specific subject. It's best way to give perfect describe about our product.  Suppose, if you have a product like pen that has some special and attractive features. Here, you will write about a product in detail and publish with world's best article websites where people like to read about their interest. It is the best way to engage more visitors with your product. Famous article websites have been visited by curious customers who want to detail knowledge about a specific product or service that's why they read article because it has been written through expert writers.  ezinearticles is one of the most famous article website where we find all kinds of article for getting detail information.  Article importance in SEO When, we write article and publish with well known article submission websites then we engage it with our target website link. It means, if you have catchy article then visitor will surely visit your website for finding more relevant topics.  Link building- A good article website offers maximum 3 links where we can build our target website's link.Link juice- If an article website publish your post then you receive link juice for better page rank.page authority & domain authority- article submission increase both kind of authority for your target website. more visitors- article submission divert visitors to your website for finding relevant topics. quality backlinks- article submission generate always quality backlink for your target website that has very less chance to be dead.I hope the information will help you. ",
            "date": "Answered May 2, 2016",
            "views": "529",
            "upvotes": " Answer requested by Gautam Kumar Singh",
            "upvoters": [
                {
                    "user_id": "Kinjal S",
                    "user_href": "/profile/Kinjal-S-4"
                }
            ]
        },
        {
            "author_info": {
                "name": "Leslie Martindale",
                "href": "/profile/Leslie-Martindale"
            },
            "answer_text": "If you want to do article submission for SEO then first you need to create quality contents. Word count should be not less than 300 words. Do not copy any content, edit it properly. Include the required keyword and add anchor text and your link. Once you ready with your content submit them on different article sharing sites.  ",
            "date": "Answered May 10, 2016",
            "views": "309",
            "upvotes": " Answer requested by Gautam Kumar Singh"
        },
        {
            "author_info": {
                "name": "Jammal Marly",
                "href": "/profile/Jammal-Marly"
            },
            "answer_text": "This tutorial will provide detailed information on how to get the most out of article directories for SEO and which article sites you should use. Keep your best work.1 article per directory.Add keyword text links to your signature.Don't over do it.Submit to quality directories.Submit to niche directories.Conclusion.",
            "date": "Answered March 20, 2020",
            "views": "190",
            "upvotes": " View 10 Upvoters "
        },
        {
            "author_info": {
                "name": "Shashi Ranjan Sharma",
                "href": "/profile/Shashi-Ranjan-Sharma-3"
            },
            "answer_text": "For article submission you have to firstly write a good article and then go on google their search for article submission site , for submitting you have to register first after complete registration clink on submit article and put you content their .Want to know more about seo go on this site shashiranjansharma.com ",
            "date": "Answered March 26, 2017",
            "views": "310",
            "upvotes": " View 1 Upvoter"
        },
        {
            "author_info": {
                "name": "Anand Gupta",
                "href": "/profile/Anand-Gupta-144"
            },
            "answer_text": "Hey first we should have our URL, Tittle, Keyword, and meta description. and then search list of article submission sites with high pr then open the article submission sites and then put the Url and tittle and site description also and then press the submite buttonthen finally you have done article submission www.jsinformatics.com ",
            "date": "Answered February 18, 2017",
            "views": "255",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Ravi Sharma",
                "href": "/profile/Ravi-Sharma-444"
            },
            "answer_text": "You should submit your article on the high PR article submission sites like sooperarticles, sites.google, ezinearticles, skyrock, seekingalpha ",
            "date": "Answered May 2, 2016",
            "views": "235",
            "upvotes": " Answer requested by Gautam Kumar Singh"
        }
    ]
}