{
    "title": "How to become a better communicator and story teller - Quora",
    "tags": [
        "Storyteller",
        "Storytelling",
        "Communication",
        "Self-Improvement"
    ],
    "response": [
        {
            "author_info": {
                "name": "Alberto Olivo",
                "href": "/profile/Alberto-Olivo-7"
            },
            "answer_text": "Communication in all its forms (social networks, writing, books, and novels) has a fundamental factor that can increase its artistic and communicative value: empathy and imagination. What I want to say is that to be an excellent communicator (or writer) it is essential that you know how to put yourself in the skin and in the voice of other people who can have lives or opinions very different from yours. I think that's why the vast majority of people like stories like Game of Thrones or The Lord of the Rings: the incredible variety of characters and situations that pass within the mind of the author. Developing this skill requires a lot of interaction with the world, with people, with the political and social processes of humanity, but it also needs artistic thinking and empathy towards human problems. My main recommendation is that you learn to observe the world from many perspectives and then be able to communicate your thoughts on any subject. This can produce an incredible story or an artistic piece of great emotional and social value. At the same time, you also need to immerse yourself in many stories, from many cultures. Music, movies, food, situations in general, and even history from other countries. Personally, oriental cultures inspire me a lot, and in their folk myths and art, I find a lot of inspiration that I can apply to my environment that is purely Western. The reinterpretation of artistic and social phenomena is also fundamental. Practice your story and say what you have to say to the world. Slowly, you will develop a personal voice. For example, I remember that when I was younger, I read Jules Verne's books with great enthusiasm because of all the creative and fantastic aspects I found in those stories. And within those stories, there was also a human, social, and ultimately, universal component. To be a good storyteller, you must see the world as what it is: a great unity of disparate things, of which there is still much to be said. ",
            "date": "Answered June 17, 2019",
            "views": "233",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Vero Khan",
                    "user_href": "/profile/Vero-Khan"
                }
            ]
        },
        {
            "author_info": {
                "name": "Carla Enfield",
                "href": "/profile/Carla-Enfield-1"
            },
            "answer_text": "Practice. Practice a thousand times. Also, prepare what you are going to say ahead of time. That way it will easily fit into a conversation or conference discussion at the right moment. Be prepared and then wait for the right moment. You will be amazed at your results. ",
            "date": "Answered June 17, 2019",
            "views": "75",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Vero Khan",
                    "user_href": "/profile/Vero-Khan"
                }
            ]
        }
    ]
}