{
    "title": "How should an aspiring author approach beginning to write their first book? - Quora",
    "tags": [
        "Book Writing",
        "Book Publishing",
        "Publishing",
        "Creative Writing",
        "Writers and Authors",
        "Writing Advice",
        "Writing"
    ],
    "response": [
        {
            "author_info": {
                "name": "Kathleen Buckley",
                "href": "/profile/Kathleen-Buckley-14"
            },
            "answer_text": "Sit down and write it. If you’re a planner, outline the story, then write it. If you’re not that together, just start writing. You’ve read books (I hope, if you are an aspiring writer); you know what you like. One of two things will happen: Either you’ll write a few pages, or a few chapters, and realize you don’t love writing for its own sake, or You’ll finish your first novel. Once again, one of two things will happen. You’ll read it over (after a month or so) and say, “Wow, this is bad. I wonder how I can fix it…” You might have a friend with good literary taste read it to check for problems. Don’t be thin-skinned when he/she tells you what they are. Think about any criticism you get and try to figure out if it’s right. Or else you’ll say, “I’m never doing this again.” You can also ease into writing by starting with a short story or two before you leap into writing your first novel. Be advised: everyone’s first novel is bad. (What, everyone’s? Well, almost everyone’s. The chances are you will not be one of the very few whose first novel is great. ). The thing is, you get better with practice…unless you don’t. You will not earn a million dollars from writing. Probably. Some, probably a lot, of the criticism your writing will receive is deserved. Learn how to fix the problems. Keep writing if you love it. If you don’t, take up something you do love doing. ",
            "date": "Answered May 19, 2020",
            "views": "96",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Khaled Aldubhani",
                "href": "/profile/Khaled-Aldubhani"
            },
            "answer_text": "Hello dear Greg Scott With all my heart, I hope that you will become a famous writer, and that your writing will be in goodness, because evil has multiplied and has become everywhere and turned our lives into hell. Yes my friend Greg Scott I hope that you do so and write to the people a beautiful story or novel that restores to the people the hope that the world is still fine and that there are good and kind people who wish good for all. Because all that we read or see in movies is glorification of the bad guys, killers and thugs of criminal gangs and we see them as the hero who does what he wants and the police cannot stop them because they are stronger than the police We are bored when we see corrupt officers who don't care about the death of women and children because these criminal gangs give them money to do their pernicious work. Well my friend Greg Scott When you go to a job, you wear your most beautiful clothes and speak wonderfully. Likewise, when you go to your girlfriend’s family’s house to ask for marriage in order to make a great impression on them, you must do so with your first book to be successful. I wish you my friend and that your book is translated into Arabic so that I can read it With all my heart, I wish you success ",
            "date": "Answered May 20, 2020",
            "views": "26",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "David Rada",
                "href": "/profile/David-Rada"
            },
            "answer_text": "In my case, I started with a photo of when I was eight. And I never liked it. I probably would have burned it but my then girlfriend (now wife), told me not to. One photo was the inspiration to two books. Inspiration comes from all around and most times when you least expect it. My third book is very different. It's historical. That means I've spent almost five years in research and collection. It spans over 70 years. The inspiration is there but not all the facts I require. Be open and embrace the work and grind that it's going to take. Writing ain't an easy job. ",
            "date": "Answered May 19, 2020",
            "views": "45",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Wayne Allen Sallee",
                "href": "/profile/Wayne-Allen-Sallee"
            },
            "answer_text": "I’m jumping the gun a bit, but you have to know this. You have to realize this. Don’t write five or ten pages or your first chapter…and then go back and read them and decide you have to make changes. You don’t not yet. Because that means you’ll end up doing it again. Any writer will tell you that you have to write every single day, and some days it might be good, others not so good, but you need to have a fair amount of days behind you to understand what your work looks like. ",
            "date": "Answered June 26, 2020",
            "views": "72",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "David Njihia",
                "href": "/profile/David-Njihia-6"
            },
            "answer_text": "Research. I don’t care whether you’re a planner or a pantser. I’m a failed pantser, and I know why. (I’ve never published a book, btw). I didn’t do research. Grab the reader by the throat with the first word (no, no; don’t do that. That’s what made me not read Delirium). Get the grip of the way stories flow. Grab a book and read. Don’t be lazy; don’t be crazy. Just research… Oh, did you think I was going to say write? No. That’s why there are so many horribly written books in the world. Just research. And research, and research, and research. For a day. Then, next day, if at all you’ve felt like the research was enough, STOP and get to work. It’s pretty simple. ",
            "date": "Answered May 23, 2020",
            "views": "22",
            "upvotes": "0"
        }
    ]
}