{
    "title": "How to hire someone to fix an ugly WordPress site? It is kind of complicated so I hired a coder to build it, and it works mechanically, but my guy has no sense of style. Is there such a thing as a 'Wordpress styler' - Quora",
    "tags": [
        "WordPress Themes",
        "WordPress"
    ],
    "response": [
        {
            "author_info": {
                "name": "Dave Chu",
                "href": "/profile/Dave-Chu-6"
            },
            "answer_text": "Wow, this answer stimulated a lot of ads/answers! :) I do this type of work. I am a developer, but have good design skills, too. Many developers aren’t really interested in “the look”, and that’s probably what you ran into. They are more interested in the inner workings, the back-end stuff. Without seeing your site, I can generally say that you’d need someone who was very strong in CSS, and had a good feel for layout, color, and design in general. You could try some scattershot quickie solutions that may be nice and cheap, but probably with a low chance of success. I’d suggest consulting a professional design firm to get good advice. You’d need to ask around and maybe see if you can find a firm near you that can visit you or vice versa. ",
            "date": "Answered April 16, 2018",
            "views": "151",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Rebecca Baldwin",
                    "user_href": "/profile/Rebecca-Baldwin-8"
                }
            ]
        },
        {
            "author_info": {
                "name": "Colin Foster",
                "href": "/profile/Colin-Foster-3"
            },
            "answer_text": "Without reviewing the site, it's hard to know if the problem is a good design (WordPress theme) that's been implemented badly, or just a bad design (or both). Hiring competent web developers is extremely hard to do. There's far more work available than there are people to do the work. A lack of any formal certification process means a lot of people are selling bad work. The best way to find someone competent is to ask other people for recommendations. No one is really a \"WordPress Styler\" as an occupation as this is too specific a skill. (It would be like looking for screwdrivermatician within the construction industry.) You definitely need someone who knows how to set up WordPress, but wether they need to more of a designer or a developer depends on the nature of the \"ugly\" you're trying to fix. Hopefully you can find someone who will at least be honest about telling you if they are the right person to fix the problem or if you're really looking for someone with a different skill set. ",
            "date": "Answered April 14, 2018",
            "views": "127",
            "upvotes": " Answer requested by Marie Meyer"
        }
    ]
}