{
    "title": "How does someone's handwriting reveal their personality? - Quora",
    "tags": [
        "Graphology",
        "Handwriting",
        "Comparisons",
        "Character and Personality"
    ],
    "response": [
        {
            "author_info": {
                "name": "Somesh Joshi",
                "href": "/profile/Somesh-Joshi-3"
            },
            "answer_text": "It might tell you a lot about your personality, check it out below: How big or small do you write?  Big, outgoing personalities tend to write in large letters; shy, introverted types prefer to write small. If you have average-sized writing, it demonstrates a strong ability to focus and concentrate. These are hidden strengths of being an introvert. How much do you space your words?  People who leave large spaces between their words enjoy freedom and independence, while those who squeeze their words together tend to like the company of others. If your words are totally jammed together, you might be intrusive or have the tendency to crowd people. How much pen pressure do you use?  While a very heavy pen pressure can suggest tension and anger; a moderately heavy pressure is a sign of commitment. A soft pressure means you're empathetic and sensitive; you might also lack vitality.These are other signs of having empathy. How do you dot your \"i's\"?  If you dot your \"i's\" high on the page you likely have an active imagination. A closely dotted \"i\" is the mark of an organized and detail-oriented mind. If you dot your \"i's\" to the left, you might be a procrastinator. And if you dot your \"i's\" with a circle, you likely have playful and childlike qualities. How legible is your signature?  Sign your documents accordingly: A legible signature is a sign of confidence and comfort in one's own skin, while an illegible signature is the mark of a private or hard-to-read person. Which way does your handwriting slant?  A right slant means you like to meet and work with new people, while a left slant means you prefer to keep to yourself. Left slanters also tend to be reserved and introspective. How do you cross your \"t's\"?  If you cap off your \"t's\" with a long cross, you're likely determined and enthusiastic, possibly with stubborn tendencies. If you use a short cross, however, it could be because you're lazy. If you cross you lowercase \"t's\" up high, you likely have many goals and aim high. If you cross them low, it could mean it's time to raise the bar for yourself; low crossers tend to aim low as well. How do you loop your lowercase \"l\"?  A widely looped \"l\" suggests you're relaxed and spontaneous, while a narrow or retraced \"l\" means you might be restricting yourself. What do your \"y\" hooks look like?  The hook on your lowercase \"y\" is a huge indicator of personality. A broad loop means you've got a large circle of friends, while a slender loop suggests you're more selective with whom you allow close to you. A short hook means you're a homebody, while a long hook could be a signal of wanderlust. Are your letters pointed or rounded?  Pointed letters are a sign of an intelligent person who might be holding back aggression. Rounded letters signal creativity and artistic ability. These are science-backed ways to boost creative writing. How quickly do you write?  If you write quickly, it's highly likely that you're impatient and dislike wasting time. If you take your time getting your words down, you are self reliant and methodical. You might have a big head if...  If you write the letter 'I' (as a pronoun) much larger than any other capital letter, you might be arrogant. You might be lying if...  If the slant of your writing (or any other feature of your handwriting) changes dramatically over the course of a piece of writing, there's a good change you're lying. Caught ya. CHEERS! ",
            "date": "Answered June 17, 2017",
            "views": "31",
            "upvotes": " View 30 Upvoters",
            "upvoters": [
                {
                    "user_id": "Henrick Hym",
                    "user_href": "/profile/Henrick-Hym"
                },
                {
                    "user_id": "Huang Han",
                    "user_href": "/profile/Huang-Han-27"
                },
                {
                    "user_id": "Vonk Oblind",
                    "user_href": "/profile/Vonk-Oblind"
                },
                {
                    "user_id": "Christian Bastiampillai",
                    "user_href": "/profile/Christian-Bastiampillai"
                },
                {
                    "user_id": "Anamika",
                    "user_href": "/profile/Anamika-674"
                },
                {
                    "user_id": "Carlo Volpe",
                    "user_href": "/profile/Carlo-Volpe-1"
                },
                {
                    "user_id": "Vandana Sharma",
                    "user_href": "/profile/Vandana-Sharma-63"
                },
                {
                    "user_id": "Pretty Rezk",
                    "user_href": "/profile/Pretty-Rezk-1"
                },
                {
                    "user_id": "Jolly Miller",
                    "user_href": "/profile/Jolly-Miller"
                },
                {
                    "user_id": "Ravee Ssant",
                    "user_href": "/profile/Ravee-Ssant"
                }
            ]
        },
        {
            "author_info": {
                "name": "David Yanor",
                "href": "/profile/David-Yanor"
            },
            "answer_text": "For sure. The only qualification is that few people have been properly trained and these days there seems to be scant places where one could learn the proper quasi-scientific method to assess handwriting strokes. Graphoanalysis, which is the method I was taught, teaches that different strokes have great meaning. Milton Bunker was an explorer of the mind in the early twentieth century and he collected handwriting from thousands of people of all stripes. From his vast inventory of the writing of writers, actors, criminals, politicians (often one and the same!) and a wide variety of people, he derived a correlation between handwriting strokes and personality. I have done hundreds of analyses and found it to be unerringly accurate, revealing the traits of a person in sharp detail. What we look for is the slant, pressure, loops and slashes, what happens with the upper and lower loops, the stability of the baseline, whether it wavers like a wave or shoots upward and a hundred other clues. I’ll give you three examples that you can test on your own to ascertain the accuracy of handwriting analysis: 1) Look at the slant of the writing. You can determine the slant by drawing a baseline under the words on a line and then making a line from where the letter stroke leaves the baseline to where it begins to go down. Do this a dozen times and you’ll see a pattern. The farther right the slant, the more emotional the person. Someone with a moderate right-leaning slant will be compassionate, caring and be able to put themselves in others’ shoes. If the slant is very extreme to the right, this denotes someone who’s excessively emotional – a drama queen, if it’s a woman’s writing. If the slant is all the way to the left – backhanded is the term, then you have someone who is emotionally withdrawn. We see this slant more in high school writing, when kids are still trying to figure out their place in the world and basically living in a self-imposed cocoon. Not a good candidate for a stable relationship. 2) Did you know that the most revealing stroke in handwriting is the “t” bar? Depending on where it sits on the t stem (or if it floats above) as well as the length, thickness, whether it points up or down, ends bluntly or in a sharp point, is positioned to the left or right of the stem or precisely balanced – these all affect interpretation. But here’s a key thing to look at – how high on the t-stem does it sit? Self-esteem is denoted in the height of the t-bar. Just like a flag on a flagpole, the lower the t-bar, the lower the person’s self-esteem. If the bar is found in the bottom half of the stem, we have someone who questions himself, lacks confidence and has wavering self-belief. The higher the t-bar on the t-stem, the more confident and ambitious the writer. But if the t-bar is floating above the stem, we might have someone who’s a daydreamer, building castles in the air without a solid foundation. If the t-bar is thin and short, there’s little force behind the person’s desires. Too much wishing and hoping and not enough internal drive. A t-bar can also indicate enthusiasm, sarcasm, pessimism, a domineering personality and much more. You can see this for yourself in people’s writing. 3) Here’s an easy thing to check. How large is the handwriting? The larger the writing, the more the person is easily distracted – looking for the next party, perhaps. It’s called hedonistic writing. On the other hand, writing that is tiny, compressed and almost microscopic denotes intelligence, a person who can focus like crazy and is not easily distracted. Einstein’s writing was very small, as one would expect. So in this case, smaller is better. You can tell who are the best students by scanning the script size and some other elements. Handwriting analysis isn’t just individual traits (I’ve identified over 200 traits), but it’s the combination of traits that tell the story. And that takes practice before you can not only put it all together. I’ve had people tell me that they learned more in an hour’s session than with 2 years of work with a psychiatrist, though I question that. But in my experience, handwriting, if analyzed by someone with the requisite experience, can yield great clues as to who you are and why you are as well as how you have formed certain traits to adapt to the world around you. And most people will agree: there is nothing more fascinating than exploring subconscious elements of yourself. ",
            "date": "Answered February 22, 2018",
            "views": "25",
            "upvotes": " View 10 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Jeevan Ponnappa",
                    "user_href": "/profile/Jeevan-Ponnappa-3"
                },
                {
                    "user_id": "Gita Permatasari",
                    "user_href": "/profile/Gita-Permatasari-2"
                },
                {
                    "user_id": "Emily Frost",
                    "user_href": "/profile/Emily-Frost-41"
                },
                {
                    "user_id": "Joy Yeong",
                    "user_href": "/profile/Joy-Yeong"
                },
                {
                    "user_id": "Sadhana Shukla",
                    "user_href": "/profile/Sadhana-Shukla-33"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/Phantasmica"
                },
                {
                    "user_id": "Layla Ismail",
                    "user_href": "/profile/Layla-Ismail-7"
                },
                {
                    "user_id": "Nancy Dills",
                    "user_href": "/profile/Nancy-Dills"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/Ramm-Rras"
                },
                {
                    "user_id": "Anita Sam",
                    "user_href": "/profile/Anita-Sam-11"
                }
            ]
        }
    ]
}