{
    "title": "How important are your grades in high school senior year? - Quora",
    "tags": [
        "Grades (education)"
    ],
    "response": [
        {
            "author_info": {
                "name": "Tom Stagliano",
                "href": "/profile/Tom-Stagliano"
            },
            "answer_text": "Very important. For most college applicants, the first term senior year grades are Included in the transcript that the colleges review, and therefore the colleges expect to see: Difficult/challenging courses and excellent grades. Granted, students that are admitted early do not have their senior grades reviewed for the acceptance process, but the colleges know that those are students who should Not slack off……. But if they slack off, they will eventually Pay the Price: Every early admission student has her/his first term senior grades sent to all of the colleges to which she/he applied, including the early admission college. If the grades have fallen, then the early admission student may be issued a warning by the college to get her/his “act together”. Then, once the person accepts an offer of admission and sends in the non-refundable deposit, that college Demands to see the final transcript for that student, which should include consistency in good grades, the fact that the person graduated and no major disciplinary actions. Otherwise, the college may Likely rescind the offer of admission and gladly hold onto that nonrefundable deposit. Finally, and Most importantly, at Least two of my senior year courses were a direct basis for freshman classes that I subsequently took at MIT. It is impossible to sip from the MIT fire hose without proper preparation. Slacking off senior year and eking into college is most likely merely setting yourself up to drop-out or flunk out of college. Enjoy senior year, Responsibly, which includes being a consistent student. ",
            "date": "Answered February 9, 2017",
            "views": "27",
            "upvotes": " View 6 Upvoters",
            "upvoters": [
                {
                    "user_id": "Shilpa Bhandari",
                    "user_href": "/profile/Shilpa-Bhandari-2"
                },
                {
                    "user_id": "Tracey Sneed",
                    "user_href": "/profile/Tracey-Sneed"
                },
                {
                    "user_id": "Peter Kenealy",
                    "user_href": "/profile/Peter-Kenealy"
                },
                {
                    "user_id": "Sabeen Zahra",
                    "user_href": "/profile/Sabeen-Zahra"
                },
                {
                    "user_id": "Esther Littlefield",
                    "user_href": "/profile/Esther-Littlefield-1"
                },
                {
                    "user_id": "Ashutosh Sangwan",
                    "user_href": "/profile/Ashutosh-Sangwan"
                }
            ]
        },
        {
            "author_info": {
                "name": "Bruce Boldenow",
                "href": "/profile/Bruce-Boldenow"
            },
            "answer_text": "I know employers who look carefully at the SR year grades. They are interested in people who work hard all the way to the finish, not someone who ‘lets down’ when the finish is in sight, often having the attitude, “I’ll graduate, as long as I pass, what can they do to me?” To put this in business terms, if an employee is giving notice, or even being terminated, for whatever reason, can the business expect them to do their job properly until the last day, or will they say, “so I’m not getting much done, I’m finished in a few weeks (or?), what can they do to me?” ",
            "date": "Answered February 10, 2020",
            "views": "72",
            "upvotes": "0"
        }
    ]
}