{
    "title": "How to buy publishing rights to an out-of-print book with a living author - Quora",
    "tags": [
        "Publishing Rights",
        "Out Of Print (OOP)",
        "Publishers",
        "Self-Publishing",
        "Book Publishing",
        "Printing",
        "Copyright Law",
        "Publishing"
    ],
    "response": [
        {
            "author_info": {
                "name": "Chris A. Baird",
                "href": "/profile/Chris-A-Baird"
            },
            "answer_text": "Hi, Great Question! This is a tricky one. Many authors have a challenge in just purchasing their own book rights from publishing houses. What can happen is that an author gets published under a publishing house and then sees no sales on their book after a year or two. The problem is that they have no control over pricing and marketing and such. So, they decide they want to buy back the rights. The problem is that this transfer process can be extremely complex and demanding of time and money. A contract will need to be drafted and you will need to use time of the people at the publishing house who own the rights. The people who own the rights will not get anything for this work. So, functionally, the entire process will just drain their time and money. So, without the incentive, this process will move very slowly. However, it isn’t hopeless. You first need to find who owns the rights. Make direct contact with them and ask them if they are open to transferring the rights to you and setting the terms of the price. Keep in mind that they will need to receive enough of a compensation to cover even the transaction costs themselves and also make a profit on this. Please let me know how it goes. It is possible, but often is much more difficult than it first seems. Was this answer helpful? ☆★☆ Click on my Profile for answers to all of your self-publishing questions! ",
            "date": "Answered May 12, 2020",
            "views": "31",
            "upvotes": " Answer requested by Jonny Wojer",
            "upvoters": [
                {
                    "user_id": "Gia Daniel",
                    "user_href": "/profile/Gia-Daniel"
                },
                {
                    "user_id": "Matthew Beasley",
                    "user_href": "/profile/Matthew-Beasley-5"
                },
                {
                    "user_id": "Amy Bowersox",
                    "user_href": "/profile/Amy-Bowersox"
                },
                {
                    "user_id": "René Villarreal",
                    "user_href": "/profile/René-Villarreal"
                },
                {
                    "user_id": "Lena Seckman",
                    "user_href": "/profile/Lena-Seckman"
                },
                {
                    "user_id": "Elias Artur Fjellander",
                    "user_href": "/profile/Elias-Artur-Fjellander"
                },
                {
                    "user_id": "Michael Bird",
                    "user_href": "/profile/Michael-Bird-54"
                },
                {
                    "user_id": "Luke Dai",
                    "user_href": "/profile/Luke-Dai-1"
                },
                {
                    "user_id": "Steven P Robinson",
                    "user_href": "/profile/Steven-P-Robinson"
                },
                {
                    "user_id": "Chrys Jordan",
                    "user_href": "/profile/Chrys-Jordan"
                }
            ]
        },
        {
            "author_info": {
                "name": "Mercedes R. Lackey",
                "href": "/profile/Mercedes-R-Lackey"
            },
            "answer_text": "Contact the original publishing house, which will do one of three things: Recognize there is demand and reissue the book (probably as an e-book) so it is no longer out of print. Put you in touch with the author. Put you in touch with the author’s agent. ",
            "date": "Answered May 12, 2020",
            "views": "23",
            "upvotes": " View 98 Upvoters "
        }
    ]
}