{
    "title": "How to make sure that my fictional character doesn't sound blank - Quora",
    "tags": [
        "Fiction Writing",
        "Movie and TV Characters",
        "Fiction"
    ],
    "response": [
        {
            "author_info": {
                "name": "Jody Lebel",
                "href": "/profile/Jody-Lebel"
            },
            "answer_text": "Characters You have to have a good idea of who your characters are before you write them. Who they are, how they were raised or how broken they are will determine how they react to situations. If you have flat characters with no personalities, no life problems, they will not make for very interesting reading. I often talk about compelling characters and this is exactly what I mean. A very sweet woman, a young new bride, who was daddy's little girl, sheltered for most of her life, is not going to have the same verbal or physical reaction to bad news or bad luck as a hardened hooker. You have to know what you're dealing with in order to write realistic dialogue and reactions. So let's say you're writing a bank robbery scene. The two women above are taken hostage. Right from the get-go you need to know who your characters are so you can have them react in a way that doesn't leave the reader scratching his/her head. Their personalities will determine how they will behave with regard to the situation they find themselves in, to the robbers themselves, and to each other. Each will have their own style of speaking, body language, and attitude. I do a rough list of my characters that I can refer to. The 'why' of how someone reacts has to be believable. Daddy's girl will probably sit in the corner of the van and shiver and cry. It would be out of character for her to boldly try to seduce one of the robbers into letting her go. But the hooker would do that. The lists that you see people use are a bit long for me. I don't really think what my character's favorite movie is is going to matter for my bank robber. Unless he is trying to emulate his favorite movie character himself. Their favorite holidays, colors, favorite teacher? Their favorite flower? I can see where someone who likes to fill all that out would really understand their character, but it's too petty for me. I stick with the following list. Fill it out and you know pretty much what you have to work with for a character and why they do the things they do, which is the most important aspect of doing this bit of pre-writing work. · Name, sex, age. (Davin, male, 32) · Physical description (Short, thin, bad complexion, one weak leg that drags sometimes.) · Educational background: field of work (Dropped out of school in 9th grade, works as laborer on construction sites.) · Family issues/ friends (Never knew his father, mother was a drunk. His few friends are mostly in prison now. Never had a girlfriend for any length of time. Is a bit intimidated by women.) · Flaws/strengths (Stubborn, opinionated. Is very mechanical, can fix things.) · Dreams/ aspirations (dreams of opening his own repair shop) . Fears (That he'll never amount to anything, and will live alone in a dirty trailer until the day he dies.) Now, when Davin goes in to rob the bank the reader knows why, they know how he's going to react to the two vastly different women hostages -- and you can write realistic scenes. Check out my e-book for more writing tips: Write Better Right Now: Creative Writing Tips http://amzn.com/B00IHIWUDC Only $1.99. ",
            "date": "Answered November 27, 2018",
            "views": "91",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Avery Jensan",
                    "user_href": "/profile/Avery-Jensan"
                }
            ]
        },
        {
            "author_info": {
                "name": "Jess Sprehix",
                "href": "/profile/Jess-Sprehix"
            },
            "answer_text": "One of my favorite things to do is to take a character, and write about them way before your plotline happens. For instance, I have a character named Phillip. He’s a nice guy, and he has cool skills. He’s a wizard (literally - this is fantasy). And he’s scarred and blind. Oh, no - I’ve created a Mary Sue (doez dat sound lik a Maru Sue 2 u?[1]) Now I’ve gotta give this guy some depth, or he’s going to be the most boring wizard ever. So I take him back to when he was a teenager, before he was blinded by a foster-parent in a fit of rage. I’m going to need this scene anyway. Now here’s the trick. Reconstruct the circumstances of this event, from the character’s POV. Maybe start at Saturday morning. What does Phillip do on Saturday? I write everything, from getting up in the morning to get the Wall Street Journal from the end of the driveway for his functional alcoholic father, Alan, figure to the moment he falls asleep that night, having spent his day avoiding Alan as much as possible. Now write Sunday. Does he go to church? If yes, do people there have any sense of Alan’s abusiveness? Does anyone try to help, or do they ignore it? Is there brunch at the country club afterwards? Again, follow your character through the whole day. In the process I found that Phillip spends time at the archery range while Alan golfs. This adds depth - it’s painful to lose a hobby like that, after he’s lost his sight. When I write Monday, I find that Phillip is a subpar student who has no motivation, but he’s bright. His teachers are disappointed because he used to be so much better. When I write Tuesday, I find that Phillip has a Mouse Ears hat from when a previous foster-family took him and their own kids to Disneyland. It’s bittersweet, because they were so good to him, and yet they didn’t love him enough not to send him away. While you’re here, take the time to write the trip to Disneyland. Write the day he had to go to live with a new family. On Wednesday, he and his friend finish Silent Hill (they get the good ending this time) on his friend’s Playstation before he has to go home and make dinner before Alan comes home drunk. This gives you the chance to explore what happened to Alan’s wife. Maybe she left him for another man. Maybe Phillip doesn’t know either - she was just gone one day, and Alan was angrier than usual. Maybe that we the first day he hit Phillip. You get the picture. Explore their past. A character with no past is a flat character. They don’t have quirks. Look how much I can relate to, just with this amount of information. Not everything you write should end up in the final draft, but don’t get rid of it. Refer back to it, so you can be consistent. BTW - Phillip is no longer my main character, he’s my main character’s adoptive dad. And he certainly doesn’t feel like a flat caricature of a dad. Footnotes[1] Chapters 1 - 22",
            "date": "Answered November 27, 2018",
            "views": "91",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Nati Löffler",
                    "user_href": "/profile/Nati-Löffler"
                },
                {
                    "user_id": "Kiara Nara",
                    "user_href": "/profile/Kiara-Nara"
                }
            ]
        }
    ]
}