{
    "title": "How to write an e-mail for applying for articleship - Quora",
    "tags": [
        "CA - Articleship",
        "The Institute of Chartered Accountants of India (ICAI)",
        "Chartered Accountants (CA)"
    ],
    "response": [
        {
            "author_info": {
                "name": "Vijay Kumar",
                "href": "/profile/Vijay-Kumar-1252"
            },
            "answer_text": "Few don'ts first: Don't add names of prospective employers in a single mail. No CCs or BCCs to other CAs . No forwards also. I immediately delete mails forwarded to me. Also don't send blank mail. Don't use informal salutations like Hi Now few Dos : Address the name of the firm or employer with proper salutation like Dear Sir / Madam. Give a brief introduction about yourself in the mail itself and then say “please see my resume attached herewith”. If you have clarity about your goal like practice or job or setting up your own business, you can mention about it so that you can get into the right kind of firm for pursuing your goal. You may also mention the areas of work you would like to get trained like taxation and audit and assure him/her that you will put in your best efforts to live up to the standards laid down by ICAI. Conclude your mail with a request to give you an opportunity of learning the practical aspects of the profession under his / her guidance and with a further request to meet him/her personally to present your case. Your mail helps the prospective employer to assess clarity of your thoughts, your ability in written communication and most importantly your commitment. ",
            "date": "Answered December 11, 2016",
            "views": "169",
            "upvotes": " View 15 Upvoters",
            "upvoters": [
                {
                    "user_id": "Gaikhuanlung Gangmei",
                    "user_href": "/profile/Gaikhuanlung-Gangmei"
                },
                {
                    "user_id": "Vaibhav Dixit",
                    "user_href": "/profile/Vaibhav-Dixit-123"
                },
                {
                    "user_id": "Azagappan Karuppaiah",
                    "user_href": "/profile/Azagappan-Karuppaiah"
                },
                {
                    "user_id": "Santhya Sundar",
                    "user_href": "/profile/Santhya-Sundar"
                },
                {
                    "user_id": "Dinesh Solanki",
                    "user_href": "/profile/Dinesh-Solanki-113"
                },
                {
                    "user_id": "Kunal Phapale",
                    "user_href": "/profile/Kunal-Phapale-2"
                },
                {
                    "user_id": "Tushant Pherwani",
                    "user_href": "/profile/Tushant-Pherwani"
                },
                {
                    "user_id": "Shivanand Reddy",
                    "user_href": "/profile/Shivanand-Reddy-8"
                },
                {
                    "user_id": "Rae Ashokk",
                    "user_href": "/profile/Rae-Ashokk"
                },
                {
                    "user_id": "Sasi Kuamr",
                    "user_href": "/profile/Sasi-Kuamr"
                }
            ]
        },
        {
            "author_info": {
                "name": "Jay Laddha",
                "href": "/profile/Jay-Laddha-1"
            },
            "answer_text": "This is a decent one: Subject : Application for Articleship To whomsoever it may concern, This letter conveys my interest in applying for the post of an associate (articled assistant) with your firm. I have recently cleared my IPCC examinations (your marks with subjects in which you got exemption) & I seek to pursue my formative years of training with your highly reputed firm because of the vast learning opportunities that are at your dispense. My dexterity, quick learning ability and diligence towards my work make me a candidate of quality. I have attached herewith a copy of my Curriculum Vitaè, which shall provide you a glance into my past records. (Make sure to attach cv) I can only hope of lasting cordial work relations. Thanking you, With utmost sincerity, (Your name) Hope it helps.. ",
            "date": "Answered August 4, 2016",
            "views": "345",
            "upvotes": " View 93 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Ansh Datta",
                    "user_href": "/profile/Ansh-Datta"
                },
                {
                    "user_id": "Keshav Tiwari",
                    "user_href": "/profile/Keshav-Tiwari-21"
                },
                {
                    "user_id": "Akash Gupta",
                    "user_href": "/profile/Akash-Gupta-1893"
                },
                {
                    "user_id": "Snehal Ramtekkar",
                    "user_href": "/profile/Snehal-Ramtekkar"
                },
                {
                    "user_id": "Kavitha Prakash",
                    "user_href": "/profile/Kavitha-Prakash-30"
                },
                {
                    "user_id": "Priyank Savla",
                    "user_href": "/profile/Priyank-Savla-4"
                },
                {
                    "user_id": "Gaikhuanlung Gangmei",
                    "user_href": "/profile/Gaikhuanlung-Gangmei"
                },
                {
                    "user_id": "Chhavi Murdia",
                    "user_href": "/profile/Chhavi-Murdia"
                },
                {
                    "user_id": "Sriprarthanaa A.M.",
                    "user_href": "/profile/Sriprarthanaa-A-M"
                },
                {
                    "user_id": "Nivin Samuel",
                    "user_href": "/profile/Nivin-Samuel-1"
                }
            ]
        }
    ]
}