{
    "title": "How much of a comedian's material do they write themselves? - Quora",
    "tags": [
        "Stand-Up Comedy",
        "Comedians",
        "Creative Writing"
    ],
    "response": [
        {
            "author_info": {
                "name": "Ian Donovan",
                "href": "/profile/Ian-Donovan"
            },
            "answer_text": "I would say that all comics, barring a select few -- literally a handful of prominent ones -- write their own material. Everyone just starting out writes material: they can't afford a ghost writer, but more importantly, writing one's own jokes vastly improves the quality of one's humor. Writing your own jokes allows you to find exactly what makes you funny. The more you write, the more you hone in on your persona, and the jokes simply get better. Almost all comics (99%+) continue writing their own jokes. So who has others write their material? There are stories of Robin Williams buying jokes from other comics, and some of the old folks (Rodney Dangerfield, Milton Berle) were kind of infamous for not writing their own jokes. Berle in particular was accused of stealing. But having someone else write your jokes is (A) incredibly uncommon and (B) harmful for your career, as you never personalize your jokes to make you stand out. Obviously, having ghost writers after you've accrued huge fame is a different story. ",
            "date": "Answered May 26, 2012",
            "views": "17",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Benjamin Marlin",
                    "user_href": "/profile/Benjamin-Marlin-1"
                },
                {
                    "user_id": "Jacob Shirley",
                    "user_href": "/profile/Jacob-Shirley-8"
                },
                {
                    "user_id": "John Greengrass",
                    "user_href": "/profile/John-Greengrass"
                },
                {
                    "user_id": "Kieran Shah",
                    "user_href": "/profile/Kieran-Shah"
                }
            ]
        }
    ]
}