{
    "title": "How to write a goodbye letter - Quora",
    "tags": [
        "Goodbyes",
        "Saying Goodbye",
        "Letters (mail)",
        "Writing Advice"
    ],
    "response": [
        {
            "author_info": {
                "name": "Robert Charles Lee",
                "href": "/profile/Robert-Charles-Lee"
            },
            "answer_text": "Depends on your purpose and the readership. Generally speaking, don't be drippy (sentimental) about it. Stay neutral and get the main point up front and early. Something like this usually works: Dear all, It is time for me to say goodbye to all of you. We've had good times together and I will always treasure the memories. I am leaving on [date] for [purpose and location]. Do stay in touch, and all the best to all. Yours sincerely,A.N. Other Simple as cake, easy as pie. ",
            "date": "Answered May 5, 2015",
            "views": "23",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Sam Hobbs",
                    "user_href": "/profile/Sam-Hobbs-7"
                },
                {
                    "user_id": "R.L. Anderson",
                    "user_href": "/profile/R-L-Anderson"
                },
                {
                    "user_id": "Raqib Zaman",
                    "user_href": "/profile/Raqib-Zaman"
                }
            ]
        },
        {
            "author_info": {
                "name": "Erick Navarro",
                "href": "/profile/Erick-Navarro-4"
            },
            "answer_text": "Be honest, explaing why you leave, remember the good thinks, ask to be forgive for your bads, as you promise to forgive them, say goodbye whith the most valuable lesson you learned there, and make sure they know you are reachable if they need to. ",
            "date": "Updated March 4, 2016",
            "views": "686",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Jenelle Farkas",
                    "user_href": "/profile/Jenelle-Farkas"
                },
                {
                    "user_id": "Sam Hobbs",
                    "user_href": "/profile/Sam-Hobbs-7"
                },
                {
                    "user_id": "Jett Miles",
                    "user_href": "/profile/Jett-Miles"
                }
            ]
        },
        {
            "author_info": {
                "name": "Therese Down",
                "href": "/profile/Therese-Down"
            },
            "answer_text": "To whom are you bidding adieu? A lover? A spouse? An employer? Your mother? Are you resigning your chairperson-ship of the local Tennis Club? Are you dying, deserting, running away, joining up or simply leaving for pastures new? Have they been beastly to you? Do they know you’re going? Will they be horrified or relieved? Perhaps your removal is the result of much heartache and deliberation and is the best thing for all concerned? Just a little more information would be helpful in sorting out this one :) ",
            "date": "Answered November 9, 2019",
            "views": "242",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Margaret Weiss",
                "href": "/profile/Margo-Weiss-1"
            },
            "answer_text": "It's best not to put anything in writing - any misstated sentiment can come back to haunt you in the past.A simple off-the-record farewell or nothing at all would be best. ",
            "date": "Answered May 5, 2015",
            "views": "729",
            "upvotes": "0"
        }
    ]
}