{
    "title": "How many paragraphs are there in a feature? - Quora",
    "tags": [
        "Paragraphs",
        "English Grammar Writing Advice",
        "Writing Advice",
        "Grammar"
    ],
    "response": [
        {
            "author_info": {
                "name": "Robert Charles Lee",
                "href": "/profile/Robert-Charles-Lee"
            },
            "answer_text": "In journalism — indeed, the business of writing — a “feature” isn’t measured in paragraphs. The actual wordcount is the measure. A ‘feature’ doesn’t have a set number of paragraphs, and the length of each isn’t fixed either. That’s because the professional rule of thumb is 20–25 words a sentence, and 2–4 sentences per paragraph. That means the paragraph length is anywhere from 40 words to 100 words. A ‘feature’ is a longer piece of writing — longer than the usual run of stories for that publication. Most usually for most professional magazine writers, the rule of thumb for a feature is between 1,200 to 2,000 words in order to be regarded as a ‘feature.’ But it could be as short as 750 words — anything shorter isn’t really a ‘feature’ in most people’s eyes. ",
            "date": "Answered October 23, 2017",
            "views": "14",
            "upvotes": " View 4 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Salve Regina Mayol",
                    "user_href": "/profile/Salve-Regina-Mayol"
                },
                {
                    "user_id": "Jhurick Padon",
                    "user_href": "/profile/Jhurick-Padon"
                },
                {
                    "user_id": "Elinor Greenberg",
                    "user_href": "/profile/Elinor-Greenberg"
                },
                {
                    "user_id": "Ilana Halupovich",
                    "user_href": "/profile/Ilana-Halupovich"
                }
            ]
        },
        {
            "author_info": {
                "name": "Robert Dixon",
                "href": "/profile/Robert-Dixon-1"
            },
            "answer_text": "There's no set number. Modern feature articles tend to range anywhere from 750 to 4,000 words in length. Paragraphs can be as short as 10 words, perhaps as long as 100. Every publication has its own guidelines. I've personally never seen one measures in terms of paragraphs. ",
            "date": "Answered October 23, 2017",
            "views": "345",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Robert Charles Lee",
                    "user_href": "/profile/Robert-Charles-Lee"
                }
            ]
        }
    ]
}