{
    "title": "How to start writing a novel from the ending - Quora",
    "tags": [
        "Novel Writing",
        "Creative Writing",
        "Novels",
        "Writing Advice"
    ],
    "response": [
        {
            "author_info": {
                "name": "Jim Murison",
                "href": "/profile/Jim-Murison"
            },
            "answer_text": "I presume you mean you have thought up a great ending and want to know how to start the book, because only an idiot or a genius would try and write a book backwards. Okay you have your ending, start by working the story backwards in your head. (I do this all the time). Who is involved, how did they get into that position. What elements do you need to bring together to get your characters to the end. Identity the elements, then work them forward. Example, you need a tank in the final scene, you main character is a civilian, how the hell do you get a tank? Is your best buddy ex army and just happens to have a spare one in his back garden. I doubt it, so you are going to have to add an army element somewhere. In some ways this is easy, other ways it is hard. Inspect the element and how it fits in. Is it a zombie novel, some kind of invasion, okay piece of piss, there are going to be lots of them on the go. If not, then you need to have an army base close by. Do you have weapons, do you need them, where would you get them, again easy in some countries, more difficult in others. Inspect the element, decide on where you are going to procure them. Who exists in the last element, is there a baddie, how did he get there, who is he, what made him a baddie. He becomes a separate element, work it backwards. Why is here there, how did he get there, what is his major problem, what caused it? If he is a super rich guy, then he probably flew in on his private jet. If he is a poor guy on the run, then where did he get his transportation, hitch, steal, murder. I hope you are seeing how this is building here. Work the story backwards, identifying key parts in the story that will help take you to that end, inspect the elements required to get your character to that point, work it out. Keep going backwards until you get to a point where the only element required is the introduction of the characters, and you have your beginning. Kinda hope this makes sense to you. ",
            "date": "Answered September 3, 2018",
            "views": "94",
            "upvotes": " View 2 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Vanessa Buckner",
                    "user_href": "/profile/Vanessa-Buckner"
                },
                {
                    "user_id": "Anita Philip-Iria",
                    "user_href": "/profile/Anita-Philip-Iria"
                }
            ]
        },
        {
            "author_info": {
                "name": "Nick Travers",
                "href": "/profile/Nick-Travers-2"
            },
            "answer_text": "Good question. Actually it makes good sense to plan any story backwards. The climax of a novel needs to be the emotional and dramatic high of the story - this is the thing that the overarching story is about. Everything that happens before this point needs to be a build up. Some new novelists make the mistake of having the story peak too early. There is no way back from this,except to shorten the novel or re-plan the entire story. The trouble is, it’s really hard to put the story back in the bag once it has been released/created/given life. It is virtually impossible to tone down a story that has peaked too early, so planning backwards from the end makes great sense. All you are doing is to reverse the cause and effect sequence. What you do is work out what had to happen in the previous scene to cause the scene you have just planned. In fact, most authors who plan out a novel before they start writing, plan it in both directions: forwards then backwards, forwards again with new elements/sub plots, backwards again filling in the gaps/plot holes, forwards adding reveals, backward correcting the cause & effect/responses. Once you have thoroughly planned out you novel, you can write whichever part of it you like in whatever order, because you already know where you are going and what is happening in each scene. I tend to write in chronological order, because I find that helps me develop the characters better, but I may already have some key scenes sketched out/written. When it come to writing a novel, there are no rules - if you want to write a novel backwards, you go for it - whatever works for you. Hope this helps, Nick ",
            "date": "Answered September 6, 2018",
            "views": "292",
            "upvotes": " View 3 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Lisa Pais",
                    "user_href": "/profile/Lisa-Pais-2"
                },
                {
                    "user_id": "Devina Dany",
                    "user_href": "/profile/Devina-Dany"
                },
                {
                    "user_id": "Paulie Ravel",
                    "user_href": "/profile/Paulie-Ravel"
                }
            ]
        }
    ]
}