{
    "title": "How to accept an apology in writing - Quora",
    "tags": [
        "Creating Writing Advice",
        "Creative Writing",
        "Manners and Etiquette",
        "Writing Advice",
        "How-to Question",
        "Writing"
    ],
    "response": [
        {
            "author_info": {
                "name": "Alyissa Austin",
                "href": "/profile/Alyissa-Austin"
            },
            "answer_text": "Yes. I am horribly emotional and have a very hard time expressing myself clearly because my brain is clouded with feelings of fear (of rejection, abandonment, not being good enough) and feeling afraid can sometimes make the smallest thing (like misinterpretation of what I’m trying to say) feel as though I’m being attacked which can put me on the defense (kind of how a scared dog will attack it’s rescuer in a stressful situation.) so if I know I have messed up, or have something important I need to express (doesn’t even have to be an apology just something important about how I feel or what is happening in a certain circumstance) I don’t want to leave any room for error. So I will sit down and I will write a letter. I will edit it to make sure things are clear and that I don’t ever sound sarcastic or like I’m trying to attack the other person. I make sure to include solutions and sometimes even things I might need for the other person so we can be successful together. I express any fear, insecurities, misinterpretations, that may have influenced my behavior and emotions (not an excuse it doesn’t mean what I did was acceptable I just am trying to help them understand how I got from point a to c.) I express any gratitude I might feel towards that person. And then I give them the letter, when they are done reading it, we can talk if they have questions and usually I will apologize again. And at this point they have a clear understanding of my state of mind and I have organized my thoughts and emotions so I also know what needs to be said and how I might feel if they choose not to forgive so I can respond appropriately and not like a crying mess of an asshole but with self control. So yes, if someone writes me an apology letter, and it is legitimate and they are willing to answer questions and discuss it afterword, yes I would accept it. ",
            "date": "Answered February 22, 2019",
            "views": "24",
            "upvotes": " View 2 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Carolyn Henning",
                    "user_href": "/profile/Carolyn-Henning"
                },
                {
                    "user_id": "Okandeji Kamaldeen",
                    "user_href": "/profile/Okandeji-Kamaldeen"
                }
            ]
        },
        {
            "author_info": {
                "name": "Chris Mills",
                "href": "/profile/Chris-Mills-7"
            },
            "answer_text": "First of all, if you are accepting an apology, whether in writing or in person, you are finished holding any kind of grudge. It’s over. This should come across in your letter. Be explicit about your acceptance of their apology. If they know you have taken it seriously, so will they. There is no room in this letter for reliving the offense. If you do that, you have not accepted the apology in reality. Short and sweet is good. I accept your apology.I hold no grudge.Thank you for apologizing. It takes great character to do that.If this is a close friendship, it might be good to suggest getting together soon so the relationship can move beyond this crisis. ",
            "date": "Answered June 14, 2018",
            "views": "296",
            "upvotes": " View 8 Upvoters",
            "upvoters": [
                {
                    "user_id": "F Khan",
                    "user_href": "/profile/F-Khan-134"
                },
                {
                    "user_id": "Kai Kristoff",
                    "user_href": "/profile/Kai-Kristoff-2"
                },
                {
                    "user_id": "Austin Kim",
                    "user_href": "/profile/Austin-Kim-70"
                },
                {
                    "user_id": "Angela Murphy",
                    "user_href": "/profile/Angela-Murphy-159"
                },
                {
                    "user_id": "Rully Indriani",
                    "user_href": "/profile/Rully-Indriani"
                },
                {
                    "user_id": "Susan Bubb",
                    "user_href": "/profile/Susan-Bubb"
                },
                {
                    "user_id": "Zynab Al-Hassany",
                    "user_href": "/profile/Zynab-Al-Hassany"
                },
                {
                    "user_id": "Mitesh Bhatia",
                    "user_href": "/profile/Mitesh-Bhatia-1"
                }
            ]
        }
    ]
}