{
    "title": "How does assistive technology help people with disabilities? - Quora",
    "tags": [
        "Disability and Disabilities"
    ],
    "response": [
        {
            "author_info": {
                "name": "P Priyanka",
                "href": "/profile/P-Priyanka-22"
            },
            "answer_text": "Gladly this week is Global Accessibility Awareness Day. I am accessibility advocate and here to post accessibility tips. It totally change lives of disabled and make them confident. Accessibility solve barriers that disabled person faces ( and doesn’t fix the disability instead). It also ensures that inclusion exists. It will focus on for the deaf and hard-of-hearing peers. Captions - such as live seminars, classrooms, meetings.There is difference between auto-captions and manual captions. Manual captions is preferred since it is 100% accuracy and no typos. Also it is smooth and easier to read. (Refer to Netflix captions. Love it !) Captions should be little big and in white color with black outline. It will reduce pressure on eyes.  Source: Netflix Live Captioning also greatly improves our understanding and ensures that we are INVOLVED.  Source: Google Images 2. Sign Language Intrepreters Acts as a third person to bridge the communication gap between deaf and hearing worlds. Sign language intrepreters work across in many fields such as video relay services ( alternatively called as phone calls for the Deafs), meetings, news etc.  Source: Google Images  Source: Video Relay Services - Google Images It makes us easier to make appointments with doctors and other formal services quickly and independently. 3. AI tools Might be helpful for short term or quick communication. Auto-captioning software translate voice to text in real time - to 90% accuracy depending on the speaker’s accent and the background noise. Not ideal for long term use- for instance, in technical meetings etc. 4. FM systems (only for hard of hearing): FM devices cancels all the background noises and send sound signals from speaker directly to the hearing aid or cochlear implant to increase speech understanding in large halls or classrooms. (Deaf might not find it beneficial)  Not only all these methods helps the disabilities, also on the business level, ensuring the websites or products are accessible will expand the customer base and promotes diversity. (Products not intended for brand endorsement) ",
            "date": "Answered May 24, 2020",
            "views": "17",
            "upvotes": " View 13 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Sarah Moran",
                    "user_href": "/profile/Sarah-Moran-38"
                },
                {
                    "user_id": "Toyen Newing",
                    "user_href": "/profile/Toyen-Newing"
                },
                {
                    "user_id": "Sakshi Gangwar",
                    "user_href": "/profile/Sakshi-Gangwar-26"
                },
                {
                    "user_id": "Apoorva",
                    "user_href": "/profile/Apoorva-135"
                },
                {
                    "user_id": "Parikshit Kamat",
                    "user_href": "/profile/Parikshit-Kamat-2"
                },
                {
                    "user_id": "Sandeep Kanabar",
                    "user_href": "/profile/Sandeep-Kanabar"
                },
                {
                    "user_id": "Bhavana Narapareddy",
                    "user_href": "/profile/Bhavana-Narapareddy-1"
                },
                {
                    "user_id": "Bharat",
                    "user_href": "/profile/Bharat-253"
                },
                {
                    "user_id": "Lijin NS",
                    "user_href": "/profile/Lijin-NS"
                },
                {
                    "user_id": "Abhijit Sarma",
                    "user_href": "/profile/Abhijit-Sarma-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Vijay Meena",
                "href": "/profile/Vijay-Meena-152"
            },
            "answer_text": "➟ Mobility aids, such as wheelchairs, scooters, walkers, canes, crutches1, prosthetic devices, and orthotic devices. ➟ Hearing aids to help people hear or hear more clearly. ➟ Cognitive aids, including computer or electrical assistive devices, to help people with memory, attention, or other challenges in their thinking skills. ➟ Computer software and hardware, such as voice recognition programs, screen readers, and screen enlargement applications, to help people with mobility and sensory impairments use computers and mobile devices. ➟ Tools such as automatic page-turners, book holders and adapted pencil grips to help learners with disabilities participate in educational activities. ➟ Closed captioning to allow people with hearing problems to watch movies, television programs, and other digital media. ➟ Physical modifications in the built environment, including ramps, grab bars, and wider doorways to enable access to buildings, businesses, and workplaces. ➟ Lightweight, high-performance mobile devices that enable persons with disabilities to play sports and be physically active. ➟ Adaptive switches and utensils to allow those with limited motor skills to eat, play games, and accomplish other activities. ➟ Devices and features of devices to help perform tasks such as cooking, dressing, and grooming; specialized handles and grips, devices that extend reach, and lights on telephones and doorbells are a few examples. ",
            "date": "Answered September 19, 2020",
            "views": "366",
            "upvotes": "0"
        }
    ]
}