{
    "title": "How are words in a personal statement counted? - Quora",
    "tags": [
        "Personal Statements",
        "Writing Advice"
    ],
    "response": [
        {
            "author_info": {
                "name": "Briana Carper",
                "href": "/profile/Briana-Carper"
            },
            "answer_text": "Do you need help with a short personal statement for graduate school? You’ll find some useful tips here. It often happens that the university admissions process is cutting down the personal statement to less than 4000 characters (which is 47 lines in total). It’s quite difficult to retain as much content as possible and at the same time stick to the character/word count, so here are a few tips which will hopefully make everything much easier. Avoid quotations and clichesRead your personal statement through and delete any clichés – for example, ‘I’ve wanted to become a doctor since I was young…’. the same is with quotes: unless they bring true value to your personal statement, nevertheless, it’s recommended to remove them. You only have 4000 characters to let the admissions committee understand who you are, so don't waste your time by plagiarizing someone’s words.  2. Make sure everything is relevant Never lose focus by using the “so what?” rule. Ask this question to each sentence of your essay and see if the answer is adequate. Don’t write too much odd information as it can put the reader out of your statement. 3. Use colour coding to see which paragraphs are eating up your characters It’s an easy way to see where you are losing most of your characters to outline sections of your essay. 4. Watch your language Look for any irrelevant words in your text and decide whether it is better to rephrase something or change your writing style completely. 5. Polish your text and remove the last few characters Once you’ve finished writing your statement, there are a few last things you need to do. Some of the ‘and’s’ can be removed in order to make full stops shorter. Also, keep in mind that it isn’t necessary to use names, for examples, hospitals, or volunteering places, etc. Cutting your personal statement down won’t make it worse because universities know you can’t describe everything in just 4000 characters. ",
            "date": "Answered March 14, 2019",
            "views": "634",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Jhoniartur",
                "href": "/profile/Jhoniartur"
            },
            "answer_text": "To make sure that the candidates will write only about important stuff, and that the admissions officers can read every person’s personal statement, the word count was introduced. When your personal statement instruction say that you must have specified word count, this means only words, without any other characters. But often the instruction specify character count. This can be confusing, because character count includes all the characters in your personal statement. It can be hard to manually count all of the dots, and commas in your personal statement, and it is a really time consuming process. Luckily, this service can do it for you http://www.personalstatementcounter.com/ ",
            "date": "Answered August 1, 2016",
            "views": "396",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Younes AM",
                    "user_href": "/profile/Younes-AM"
                },
                {
                    "user_id": "Sheri Fresonke Harper",
                    "user_href": "/profile/Sheri-Fresonke-Harper"
                }
            ]
        },
        {
            "author_info": {
                "name": "Ellie Carroll",
                "href": "/profile/Ellie-Carroll-9"
            },
            "answer_text": "Write short and brief cases to exhibit your aptitudes and accomplishments while limiting your personal statement word count. Numerous personal statements will expect you to utilize under 500 words and some not as much as only 250 so you should figure out how to be extremely succinct with your written work on the off chance that you would prefer not to surpass that point of confinement.  You should figure out how you to can compose your personal statement viably without surpassing the page check that you are permitted. You can guarantee that each word that you compose is increasing the value of your personal statement. Avoid the data that is clear, for example, disclosing to them what your obligations were for a particular employment when those duties are surmised by the activity title.Abstain from utilizing data that is now incorporated into different parts of your application, there is no compelling reason to copy data inside your personal statement.",
            "date": "Updated December 13, 2017",
            "views": "421",
            "upvotes": "0"
        }
    ]
}