{
    "title": "How to type next to a picture in Microsoft Word - Quora",
    "tags": [
        "Word Processors",
        "Microsoft Word",
        "Microsoft Office",
        "Microsoft (company)"
    ],
    "response": [
        {
            "author_info": {
                "name": "Julie Frey",
                "href": "/profile/Julie-Frey-3"
            },
            "answer_text": "There are various ways to get text next to an image in Word. One easy way is to add text to the picture if you are the one creating the image. That is a huge time saver and ensures that the text is with the image. Another way is to create a table and put image in one cell and text into another. This is an excellent method if you are making an ad or poster. You can then adjust the table cells to fit both image and text. And decide what sizes work best, too. I think this is most flexible if you do not want to edit down your caption to fit image or have to adjust image size to fit. (This may affect quality if you mess with resizing too much.) Another method is a text box. You make box and type text it. You’ll have to work out how to arrange image and text box. This is good for art or cartoons. Most text is placed with images in various formats and fits. You will need to access form that sets how text is placed. You should become familiar with your options. In my experience with Word, text and image layout may be most difficult and frustrating at times as all must be correct to work. You may have to make font smaller if the caption has many words. Or you may decide that you can reduce number of words used for a better fit. Plus it will depend upon what you are publishing, who will see it and the purpose of your document. With Word, you become a publisher and printer so it is important that you learn about these trades and terms as these are established industries with a very long history and tradition. ",
            "date": "Answered September 21, 2020",
            "views": "28",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Revett Eldred",
                "href": "/profile/Revett-Eldred"
            },
            "answer_text": "Right click the picture and then do one or both of two things: Click ‘Insert caption’ to add a caption under the picture that will move with the picture if you reposition it.Click ‘Wrap text’ and then click how you want text to flow around, behind, or in front of the picture.  Then just type your text.Alternatively, you can insert a table with two cells, paste/insert the picture in one cell and type text in the other.  You can make the table invisible by selecting it and clicking the down arrow next to the ‘borders’ icon and clicking ‘No Border’. ",
            "date": "Answered July 5, 2016",
            "views": "294",
            "upvotes": " View 14 Upvoters",
            "upvoters": [
                {
                    "user_id": "Elizabeth Offia",
                    "user_href": "/profile/Elizabeth-Offia"
                },
                {
                    "user_id": "Aditya Joshi",
                    "user_href": "/profile/Aditya-Joshi-537"
                },
                {
                    "user_id": "Sajidul Hoque",
                    "user_href": "/profile/Sajidul-Hoque-9"
                },
                {
                    "user_id": "Mohamed Atef",
                    "user_href": "/profile/Mohamed-Atef-261"
                },
                {
                    "user_id": "Vivek Iyer",
                    "user_href": "/profile/Vivek-Iyer-130"
                },
                {
                    "user_id": "Harshit Gupta",
                    "user_href": "/profile/Harshit-Gupta-99"
                },
                {
                    "user_id": "Anindita Nalli",
                    "user_href": "/profile/Anindita-Nalli-1"
                },
                {
                    "user_id": "Killar Tim",
                    "user_href": "/profile/Killar-Tim"
                },
                {
                    "user_id": "Vakho Akobia",
                    "user_href": "/profile/Vakho-Akobia"
                },
                {
                    "user_id": "Rohan Dayal",
                    "user_href": "/profile/Rohan-Dayal-9"
                },
                {
                    "user_id": "Arpita Chakraborty",
                    "user_href": "/profile/Arpita-Chakraborty-14"
                },
                {
                    "user_id": "Joseph Qin",
                    "user_href": "/profile/Joseph-Qin-4"
                },
                {
                    "user_id": "Saddam Ateeg",
                    "user_href": "/profile/Saddam-Ateeg"
                },
                {
                    "user_id": "Gautam Patel",
                    "user_href": "/profile/Gautam-Patel-26"
                }
            ]
        },
        {
            "author_info": {
                "name": "Robert Dixon",
                "href": "/profile/Robert-Dixon-1"
            },
            "answer_text": "Insert the image, resize it and position it where you want it, then begin typing. It is usually easier to do this if you start with a few lines of type before you insert the image. Text can be flowed around it as you position or resize the image. In some versions of Word, and with some image formats, you may find it easier to start by inserting a text box, sizing and positioning it, then inserting the imageI'm in the text box. ",
            "date": "Answered July 5, 2016",
            "views": "86",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Learn Vern",
                "href": "/profile/Learn-Vern-7"
            },
            "answer_text": "Select the image you want to wrap text around. The Format tab will appear on the right side of the Ribbon.On the Format tab, click the Wrap Text command in the Arrange group.Hover the mouse over the various text-wrapping options.The text will wrap around the image.To Know more with free videos visit Learnvern ",
            "date": "Answered March 23, 2018",
            "views": "52",
            "upvotes": "0"
        }
    ]
}