{
    "title": "How to deal with a highly productive employee who is always late for work - Quora",
    "tags": [
        "Punctuality",
        "Office and Workplace Culture",
        "Productivity",
        "Employees",
        "Workplace and Professional Etiquette",
        "Time Management",
        "Work",
        "Interpersonal Interaction",
        "Jobs and Careers"
    ],
    "response": [
        {
            "author_info": {
                "name": "Steve Baker",
                "href": "/profile/Steve-Baker-100"
            },
            "answer_text": "In my line of business - software engineering - we really don’t watch the clock too carefully. The presumption is that “so long as the work gets done on time” - we can cope with a modest amount of bad timing. Some companies (including the one my son works for) don’t even bother to tell people how much vacation time they can take. “Take as much as you need”. Of course - this does induce a certain degree of pressure to get the work done…and if the work isn’t getting done - then people are going to get fired regardless of whether they worked long hours or short and regardless of the amount of time they were on vacation. It’s kinda refreshing actually! But assuming this isn’t that kind of business, you have two problems: If the person isn’t in the office when people expect to be able to hold meetings and such - then poor timekeeping can affect the group as a whole.If other (less productive) people see that it’s “OK” to be late - then they may decide to do the same thing - and then you really are eating into overall productivity. It’s tough to yell at one person for being late - if some other person is getting away with it.",
            "date": "Answered February 12, 2019",
            "views": "935",
            "upvotes": " View 10 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Ritu Bhushan",
                    "user_href": "/profile/Ritu-Bhushan-6"
                },
                {
                    "user_id": "Elle Gogh",
                    "user_href": "/profile/Elle-Gogh"
                },
                {
                    "user_id": "Joseph Holdom",
                    "user_href": "/profile/Joseph-Holdom"
                },
                {
                    "user_id": "Stan Hanks",
                    "user_href": "/profile/Stan-Hanks"
                },
                {
                    "user_id": "Diane Riley",
                    "user_href": "/profile/Diane-Riley-11"
                },
                {
                    "user_id": "Faizan Anwar",
                    "user_href": "/profile/Faizan-Anwar-2"
                },
                {
                    "user_id": "Ed Bell",
                    "user_href": "/profile/Ed-Bell-9"
                },
                {
                    "user_id": "Gregory Zannatos",
                    "user_href": "/profile/Gregory-Zannatos"
                },
                {
                    "user_id": "Jonathan Wyman",
                    "user_href": "/profile/Jonathan-Wyman"
                },
                {
                    "user_id": "Lance C. Anderson",
                    "user_href": "/profile/Lance-C-Anderson"
                }
            ]
        },
        {
            "author_info": {
                "name": "Diane Riley",
                "href": "/profile/Diane-Riley-11"
            },
            "answer_text": "“How do you deal with a highly productive employee who is always late for work?” There are a number of things to take into consideration… How does it affect the other employees?Is there another employee that is waiting for this employee so they can clock out and go home?Is the “production flow” affected, is there an ‘on time’ employee sitting idle at any time because they are waiting for the ‘late, but productive’ employee to start producing?How is their tardiness affecting your customers?How is their tardiness affecting the morale of the other employees?Is this a precedent that you really want to establish?I’d have a serious talk with this employee and get to the bottom of why they are always late. If they depend on public transportation and because of the schedules they have to be either an hour early or 15 minutes late, or if their spouse works a different shift and they have young children that need to be cared for (has to wait to leave once they get home)…I might be understanding. But, remember that every other employee should be given the same consideration. Are they not hearing their alarm clock, or just not setting the alarm early enough? They just need to work that out on their own…and be on time. If they are capable of being highly efficient at work, they are capable of acting like an adult with their own time. Yes, being productive is important, but so is dependability, maturity, and workplace morale. What good is a highly productive employee if they cause overall production to lag because of the declining morale of the other employees? ",
            "date": "Answered February 16, 2019",
            "views": "220",
            "upvotes": " Answer requested by Gregory Zannatos"
        }
    ]
}