{
    "title": "How does it feels to write a poem for someone? - Quora",
    "tags": [
        "Poems",
        "Poetry"
    ],
    "response": [
        {
            "author_info": {
                "name": "Robert Girard",
                "href": "/profile/Robert-Girard-1"
            },
            "answer_text": "You imagine that person as you put each word down, honing the tone to be just right, shifting words, searching for just the right one. Read it once, twice, a million times trying to imagine how that person will look as she's reading it. How she will react. How she will feel. If she will understand more than just the words, but be able to read down to the intent, to the essence of the meaning. You're hesitant, uncertain of your certainty, certain of your uncertainty, confused by your own feelings burbling within, but if you know each word is true despite not being adequate enough to say what you mean. Then the fear dissipates and you entrust your thoughts with another. Does she know how much of yourself you infused in each word? Can she understand what you are trying to say?  Then the payoff: comprehension. Knowing your heart's depth, your mind's reach, she acknowledges what you are saying. . . and perhaps there will be waves of joy or the undertow of disappointment. But if you have delivered your truth, if you have done so without expectations, if the words are now released from the cage of your mind, perhaps now you will find more than just joy or sorrow or contentment or promise. Perhaps you will find your own heart's peace. ",
            "date": "Answered February 18, 2016",
            "views": "18",
            "upvotes": " View 8 Upvoters",
            "upvoters": [
                {
                    "user_id": "Russel Joyce Cortes",
                    "user_href": "/profile/Russel-Joyce-Cortes"
                },
                {
                    "user_id": "Oana Lesnic",
                    "user_href": "/profile/Oana-Lesnic-1"
                },
                {
                    "user_id": "Jordon Williams",
                    "user_href": "/profile/Jordon-Williams-23"
                },
                {
                    "user_id": "Anurag Sawant",
                    "user_href": "/profile/Anurag-Sawant-6"
                },
                {
                    "user_id": "Pinkpup11 .",
                    "user_href": "/profile/Pinkpup11"
                },
                {
                    "user_id": "Perry Sams",
                    "user_href": "/profile/Perry-Sams"
                },
                {
                    "user_id": "Althea Juanich",
                    "user_href": "/profile/Althea-Juanich"
                },
                {
                    "user_id": "Vachaspathy",
                    "user_href": "/profile/Vachaspathy-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Perry Sams",
                "href": "/profile/Perry-Sams"
            },
            "answer_text": "It feels good in short.  To present that poem is a gift that asks only one thing in return. That thing is attention. In any friendship or relationship there might be feelings or things that fall through the cracks, that are left unsaid. Poetry is the spackle over the cracks and says things that need to be said. Lately I have felt grateful to have this gift and to be able and willing to practice it. Yeats called poetry \"these quarrels we have with ourselves\", as opposed to \"rhetoric\" which he said, arise out of our quarrels with others.  With the poem we're asking someone else to join the discussion. With the poem we intend to record one little flash of beauty in paper as a gift, a yes to life and connection; or with Song of Myself, or in the epic long narratives of Shelley, Keats, or Byron to tell of journeys romantic, slightly shocking and sublime. So, it feels good. At the least, you ask the recipient, or an audience to slow down and to join you in your poem-song, your overflowing cup of \"a liquor never brewed\", as said in verse by Emily Dickinson. ",
            "date": "Answered February 24, 2016",
            "views": "15",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Nihal A",
                    "user_href": "/profile/Nihal-A-2"
                }
            ]
        }
    ]
}