{
    "title": "How to write a letter to an elderly relative - Quora",
    "tags": [
        "Writing Letters",
        "Letters (mail)",
        "Senior Citizens",
        "Writing Advice"
    ],
    "response": [
        {
            "author_info": {
                "name": "Bianca White",
                "href": "/profile/Bianca-White-62"
            },
            "answer_text": "First, be sure that whatever you write is legible. Many people say that something handwritten is more personal, but so many older people have vision problems that unless you can write very clearly it might be better to type it. Second, write with their interests in mind. Family news is usually very interesting to elderly relatives (eg, “I started a new job,” “little Cindy got all As on her report card,” etc) but also think about what that relative did or does enjoy. My great aunt was a master gardener, so I write to her about what I planted in my garden and what I saw in the local arboretum I visited. Third, include pictures! Everyone likes pictures. It could be photos of a trip you took, or of the family, or pets; it could be a sketch or a crayon drawing from your kid; it could even be a pretty card they can keep. Especially if the relative is in a care facility space is limited but there’s always a little space to tape or pin a picture in the wall. It really brightens things up. Really it matters less what exactly you write than that you took the time to write and that you cared enough to tell them something that would interest them. ",
            "date": "Answered October 4, 2020",
            "views": "498",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Efrayim Bulka",
                    "user_href": "/profile/Efrayim-Bulka-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Sally Nyhus",
                "href": "/profile/Sally-Nyhus"
            },
            "answer_text": "In addition to the other two answers, I would add (since I’m 71 and kind of fit the description of “an elderly relative”) be sure it’s written in a large enough and dark enough “hand” that the relative can read it—some of us have cataracts, low vision, macular degeneration, glaucoma, etc. Someone else may need to read your letter to your relative, but don’t let any of that deter you—we’d love to get letters from our younger relatives. If you cannot print or write in cursive well enough, none of us would mind a computer-generated letter (font size about 14 or 16; I personally like Times New Roman because I don’t have to decide if that’s a lower case l or an upper case I—see what I mean?), printed out and mailed, with your handwritten signature. My sister and brothers write handwritten notes and letters, but I usually generate them from the computer because I can edit it before sending it off: correct typos, re-organize my thoughts, change phrases around, etc. Otherwise, I tend to have cross-outs, arrows to complete a thought, and blotches! Enclose a picture or two, or if you have children, a drawing from them, and you will be THE favorite of this relative, and should you ever visit, you’d find the pictures/drawing prominently and lovingly displayed in his/her home. ",
            "date": "Answered October 3, 2020",
            "views": "284",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Chikwado Anodere",
                    "user_href": "/profile/Chikwado-Anodere"
                }
            ]
        }
    ]
}