{
    "title": "How do authors feel about knowing their own stories? - Quora",
    "tags": [],
    "response": [
        {
            "author_info": {
                "name": "Wallace Lee",
                "href": "/profile/Wallace-Lee-6"
            },
            "answer_text": "Authors usually have a general idea of the plot they are going to write. They never pre-plan everything, and they then enjoy the process of ‘transformation’ that will turn the idea into an actual novel. And this process is not so different from the average reader’s experience: it’s just somewhat less exciting and much, much more tiring, because let’s say it: writing is job. And then okay, authors won’t enjoy this process as their the most addicted readers do while reading, but it doesn’t matter. They usually enjoy it anyway, and it is important that they do so. Why’s that? Because… What people ignore about writing, is that the author’s feelings about his own plot are MORE important than the plot itself. As a matter of fact, the better a writer’s style is, the more the reader will feel what the author felt while writing his own novel. And that’s the reason why writing in order to become successfull is by war the worst way of writing: because people will feel bored. They will feel as if they were reading something grey at best. For the same reason, this is why EXTREMELY GOOD writers - like Stephen King - are extreme improvisors. They plan NOTHING. Yep. Think about it: the best way to surprise the reader, is surprising yourself, isn’t it? Of course it is. So, those kind of extremely experienced writers embark themselves on a two years-long work HOPING the final result will be worth a read. You need the balls to do so, isn’t it? Of course you do. This is an extremely difficult way of writing, but when successfull, the writer is excited, enthralled and even scared by his own plot, if it’s an horror novel. He is not creating it, but following it. He is helping it out, not forging it. And he will ‘watch’ it like a movie inside his own mind (while trying to write it down the best he can at the same time). King once said that, a long time ago, an inmate of the death row wrote him saying that he was going to die before the end of the DARK TOWER series of novels was going to be published. Thus he asked King if he could be so kind to send him the Tower’s ending in advance. Just a spoiler. There was no need for anything big. A letter would have been enough. What did King reply? He replied that he was very sorry, but he honestly had no idea how the Dark Tower was going to end. The only way for King to know how the DARK TOWER was going to end, was writing the whole saga down, which he could not do before the guy’s death. ",
            "date": "Answered August 6, 2017",
            "views": "145",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Lisa Van Sleeuwen",
                    "user_href": "/profile/Lisa-Van-Sleeuwen"
                },
                {
                    "user_id": "Aleena Afzal",
                    "user_href": "/profile/Aleena-Afzal"
                }
            ]
        },
        {
            "author_info": {
                "name": "Sayed Ali",
                "href": "/profile/Sayed-Ali-126"
            },
            "answer_text": "It seems that I can’t add question detail so I am writing it here: George R. R. Martin authored the mindblowing story of game of thrones, Oichiro Oda created the manga masterpiece One Piece, J R. R. Tolkein authored The Hobbit and Lord of the ring among other masterpieces, all of which many people enjoy and look forward to more than anything else. But how do the authors in this scenario feel if they already know the ending to a story which they would have enjoyed. ",
            "date": "Answered August 6, 2017",
            "views": "57",
            "upvotes": "0"
        }
    ]
}