{
    "title": "How to write professional business plan - Quora",
    "tags": [
        "Startup Business Plan Advice",
        "Business Plans",
        "Entrepreneur Advice",
        "Entrepreneurship",
        "Startup Strategy"
    ],
    "response": [
        {
            "author_info": {
                "name": "Michael Bosio",
                "href": "/profile/Michael-Bosio-2"
            },
            "answer_text": "Writing a business plan is the first step in starting a business after you decide you are going to do it. It is tedious, not really the fun part, but it is one of the most important steps. It can be so tempting to just jump in and do the business plan later, or to just plan in your head and never really pull together an official, professionally written plan. That is a mistake though, because the business plan is absolutely necessary when looking for small business funding. Beyond that, it helps to have something written to refer to during the course of your business. Even if you do not need funding now, you likely will at some point, especially to fund growth, and it is easier to update the original plan rather than start from scratch when that day comes. If you can afford to hire a professional business plan writer, it is worth it. If you cannot, here is what you need to know. Don’t Skip the Research Know the industry, your competition, the market, inventory vendors, and everything else inside and out. The only way to get this information is to research like your life depends on it. · Know all the ins and outs of your particular business. · Know your market and how your product will be received by it. · Know who your competition is and research what you can do to surpass what they offer. · Know how your money will need to be spent, and what the best prioritization of funds will be for now and in the future. Test the Plan Read your plan from the standpoint of determining if it will work, how long it will work, and what you can do if and when the time comes that it does not work. Put it to the test in each and every situation you can imagine and try to determine how it will stand up. ",
            "date": "Answered August 2, 2019",
            "views": "200",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Govinda Gurung",
                    "user_href": "/profile/Govinda-Gurung-6"
                },
                {
                    "user_id": "Hojjat Mohseni",
                    "user_href": "/profile/Hojjat-Mohseni"
                }
            ]
        },
        {
            "author_info": {
                "name": "Randall Reade",
                "href": "/profile/Randall-Reade"
            },
            "answer_text": "The other answers are very good. I would just add a few thoughts: Few investors really care about the business plan that is written out.   Most prefer a two page executive summary, and if further interested, they will ask for a slide deck or just a telephone conversation.  Why? Because good investors know how to zero in on certain key issues.  They have no time or interest to read a 20 page business plan (unless they already committed and are doing the due diligence).  A 10 minute phone conversation usually exposes the poseurs and the unready.   Just last week, I had a company approach me with a possible cure for a widespread medical illness.  I was skeptical, but they insisted they had done clinical trials on patients with a spectacular cure rate.  So I cut to the chase and asked how this doctor found the compound that cures an intractable disease, and I was told that it was given to the doctor secretly by a shaman who convened with the spirits.   So instead of reading a 20 page business plan, which didn't address this issue anyway, I got my answer within less than five minutes.  Why would I waste any more time reading a lengthy plan? The business plan isn't really for investors, but for you.  It forces you do to do due diligence upon yourself and your business idea.  Who is the competition?  How are you better?  Why would people buy this?  How do you plan to make money?  What strengths and weaknesses exist in your management team?  How do you plan to scale quickly?   Any investor is going to ask you tough questions, and you need ready answers to all of them.  And I mean ALL of them!  You do not get to say, \"I didn't think of that,\" or \"Let me get back to you on that issue.\"  If you say those, you are dead in the water because it shows you did not really think this through.  Why should I give any money to a person who hasn't taken the time to know his own business? The best thing you can do is realize what questions an investor will ask you, and then do your research and plan your business so that you can shoot down every objection with real facts and solid confidence.   IF you can do that, the end result of writing it all down on paper is rather superfluous. ",
            "date": "Answered October 14, 2015",
            "views": "23",
            "upvotes": " View 8 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Emmanuel Oladapo",
                    "user_href": "/profile/Emmanuel-Oladapo-6"
                },
                {
                    "user_id": "Hojjat Mohseni",
                    "user_href": "/profile/Hojjat-Mohseni"
                },
                {
                    "user_id": "Felix Lu",
                    "user_href": "/profile/Felix-Lu-9"
                },
                {
                    "user_id": "Amr Hussien",
                    "user_href": "/profile/Amr-Hussien-2"
                },
                {
                    "user_id": "Juan E Figueroa",
                    "user_href": "/profile/Juan-E-Figueroa"
                },
                {
                    "user_id": "Weilunou Ou",
                    "user_href": "/profile/Weilunou-Ou"
                },
                {
                    "user_id": "Adam Leffert",
                    "user_href": "/profile/Adam-Leffert"
                },
                {
                    "user_id": "Sushil Sharma",
                    "user_href": "/profile/Sushil-Sharma-73"
                }
            ]
        },
        {
            "author_info": {
                "name": "Marquez Comelab",
                "href": "/profile/Marquez-Comelab"
            },
            "answer_text": "Important sections for a business plan? I would say... 1. Research and Marketing Strategy You present your case about the opportunity available and why you, your team and your business are going to be best positioned to take advantage of this opportunity. Do a SWOT (Strengths, Weakness, Opportunities, Threats) Analysis.  2. Operations, Business Model, Law and Regulation You detail how you make your money. Detail all items you need to run, as well as how you expect to generate revenue over a period of say a year, 2 years, 3 years and 5 years, if you can. Cover legal and regulatory requirements.  3. Financials: Budgets and Projections Detail what costs you incur over time and your projected returns over time. Generate the Balance Sheet and Profit and Loss Statements during those time periods. State the assumptions you are making. Justify why those are reasonable assumptions to make.  If you need big capital and need to attract big investors, it would probably be good to do some financial analysis on those projections to help prospective investors compare your business as an investment with other alternative investments.  Hope this helps. ",
            "date": "Answered October 14, 2015",
            "views": "504",
            "upvotes": " View 7 Upvoters",
            "upvoters": [
                {
                    "user_id": "Krishna Dewangan",
                    "user_href": "/profile/Krishna-Dewangan-31"
                },
                {
                    "user_id": "Hojjat Mohseni",
                    "user_href": "/profile/Hojjat-Mohseni"
                },
                {
                    "user_id": "Bridge Pin",
                    "user_href": "/profile/Bridge-Pin"
                },
                {
                    "user_id": "Samuel Efe Obrikogho",
                    "user_href": "/profile/Samuel-Efe-Obrikogho"
                },
                {
                    "user_id": "Amr Hussien",
                    "user_href": "/profile/Amr-Hussien-2"
                },
                {
                    "user_id": "Randall Reade",
                    "user_href": "/profile/Randall-Reade"
                },
                {
                    "user_id": "Bruce Marino",
                    "user_href": "/profile/Bruce-Marino"
                }
            ]
        },
        {
            "author_info": {
                "name": "Tim Berry",
                "href": "/profile/Tim-Berry"
            },
            "answer_text": "U.S. angel investors are looking for a credible team with startup experience, plus product-market fit, good growth potential and scalability, defensibility, traction, validation, and prospects for an exit in a reasonable amount of time. I recommend doing a lean business plan summarizing strategy, tactics, major milestones, metrics, sales forecast, spending budget, and cash flow. Use that as the script for a summary memo and pitch deck. for more on that, my free site at Lean Business Planning - by Tim Berry Investors care about the business, not the document, deck, summaries. Use the plan to communicate, not embellish. Although every case is different, the process most often starts with the summary memo or summary profile on http://gust.com, AngelList, or elsewhere; if they like the summary they invite a company to pitch. And if they like the pitch, then they need the business plan as a guide to due diligence. So the plan is the core, but not a selling document. It's what you really want to do, laid out in steps, trackable, and reviewed and refreshed often. [Bias alert: my work, my company] LivePlan at Business Plan Software | LivePlan is a web app, subscribe per month for $19.95 or less, very valuable, a tool to build a unique plan, not canned rehash, with very good financials and a very modifiable outline.",
            "date": "Answered October 14, 2015",
            "views": "14",
            "upvotes": " View 8 Upvoters ",
            "upvoters": [
                {
                    "user_id": "David S. Rose",
                    "user_href": "/profile/David-S-Rose"
                },
                {
                    "user_id": "Krishna Dewangan",
                    "user_href": "/profile/Krishna-Dewangan-31"
                },
                {
                    "user_id": "Hojjat Mohseni",
                    "user_href": "/profile/Hojjat-Mohseni"
                },
                {
                    "user_id": "Aditya Phatak",
                    "user_href": "/profile/Aditya-Phatak"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/Ryan-733"
                },
                {
                    "user_id": "Amr Hussien",
                    "user_href": "/profile/Amr-Hussien-2"
                },
                {
                    "user_id": "Randall Reade",
                    "user_href": "/profile/Randall-Reade"
                },
                {
                    "user_id": "Sushil Sharma",
                    "user_href": "/profile/Sushil-Sharma-73"
                }
            ]
        },
        {
            "author_info": {
                "name": "Nisha Agarwal",
                "href": "/profile/Nisha-Agarwal-258"
            },
            "answer_text": "Here are many good answers to the question. However, I thought, I should add few more things. Since most of the answers explain how it should be written, I’m not repeating those aspects. Rather, I’m providing a complete structure. It is like this: Table of ContentExecutive SummaryIntroduction to Your BusinessYour Business GoalVision and Mission StatementStatistical Market Research ReportSWOT AnalysisProducts / ServicesPricing Models and Quality CriteriaCharacteristics of Buying PersonaFormulation of CompetitorOperational and Management StructureMarketing and Sales StrategiesFinancial PlansMilestones to AchieveSocial ResponsibilitiesConclusion and AppendixesFor more information, you may refer Step by Step Guide to Business Plan. ",
            "date": "Answered April 27, 2020",
            "views": "183",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Prabash Ranjan Sahoo",
                    "user_href": "/profile/Prabash-Ranjan-Sahoo"
                }
            ]
        },
        {
            "author_info": {
                "name": "Alina Khonda",
                "href": "/profile/Alina-Khonda"
            },
            "answer_text": "Business plan is a written document that describes in detail how a new business is going to achieve its goals. A business plan will lay out a written plan from a marketing, financial and operational viewpoint. Sometimes a business plan is prepared for an established business that is moving in a new direction. A business plan helps you to: clarify your business ideaspot potential problemsset out your goalsmeasure your progressYou’ll need a business plan if youA business plan includes a description of a company or small business, its services and/or products and how the business will achieve its goals. The plan includes the overall budget, current and projected financing, a market analysis, and its marketing strategy approach. In a business plan, a business owner projects revenues and expenses for a certain period of time and describes the operational activity and costs related to the business. Typical structure for a business plan for a startup venture: cover page and table of contentsexecutive summarymission statementbusiness descriptionbusiness environment analysisSWOT analysisindustry backgroundcompetitor analysismarket analysismarketing planoperations planmanagement summaryfinancial planattachments and milestones",
            "date": "Answered September 17, 2020",
            "views": "325",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Krishna Dewangan",
                    "user_href": "/profile/Krishna-Dewangan-31"
                }
            ]
        },
        {
            "author_info": {
                "name": "Januar",
                "href": "/profile/Januar-9"
            },
            "answer_text": "There are some important factors to make a business plan looks proffessional and can convince investors to have interest on your ideas.  For a more detail explanation of how to make a good business plan, visit this site: How to Write A Business Plan. There you can learn more about the business plans, and find some sources for best business plan templates. ",
            "date": "Updated January 15, 2020",
            "views": "371",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Felix Lu",
                    "user_href": "/profile/Felix-Lu-9"
                },
                {
                    "user_id": "Halo Halo Bandung",
                    "user_href": "/profile/Halo-Halo-Bandung"
                },
                {
                    "user_id": "Sanyam Jain",
                    "user_href": "/profile/Sanyam-Jain-115"
                }
            ]
        },
        {
            "author_info": {
                "name": "Bruce Marino",
                "href": "/profile/Bruce-Marino"
            },
            "answer_text": "The financials, although overal you have to make the plan make sense to the viewer: When the viewer reads this plan can the viewer easily understand and see that the plan has legs?Does the plan show that the business model will work?Does the plan provide the viewer with momentum and interest?",
            "date": "Answered October 13, 2015",
            "views": "185",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Amr Hussien",
                    "user_href": "/profile/Amr-Hussien-2"
                }
            ]
        },
        {
            "author_info": {
                "name": "Sushil Sharma",
                "href": "/profile/Sushil-Sharma-73"
            },
            "answer_text": "First learn about nine elements of business model canvas. Goto the site given below and start filling the business model canvas. You'll get a near perfect business plan.Create a new Business Model Canvas ",
            "date": "Answered October 13, 2015",
            "views": "179",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Rabinson Maharjan",
                    "user_href": "/profile/Rabinson-Maharjan-2"
                },
                {
                    "user_id": "Amr Hussien",
                    "user_href": "/profile/Amr-Hussien-2"
                }
            ]
        }
    ]
}