{
    "title": "How to track your meeting action items - Quora",
    "tags": [
        "Track Meet",
        "Action"
    ],
    "response": [
        {
            "author_info": {
                "name": "Allen Watson",
                "href": "/profile/Allen-Watson-18"
            },
            "answer_text": "So, before I answer, my first question would be- Are you using a meeting management solution for your business? Because, if you are using one, then it may have a feature that allows you to conveniently track your meeting action items anytime, anywhere. The meeting action follow up software that I use has this amazingly helpful feature that allows me to track all my documented actions and lets me and my team members have the information on fingertips.  Being a project manager, I am concerned about the distribution and storage of the documented actions discussed during the meeting. My meeting software has an integrated cloud solution where all my meeting actions are saved and are secured from any security issue. Only the authorized teammates can have access to those documents. Also, the distribution of minutes and actions is done automatically and they are electronically recorded. So, it makes sense that I have ample time for planning about business growth as much of my time spent in meeting management is saved with this amazing meeting management software. It has many more features that I am sure, you would like. Alternatively, if you are not using a meeting management solution, you might face a lot of trouble in keeping track of all the actions, checking outstanding tasks, distributing the minutes and actions to attendees of meetings. I suggest you keep the process as simple as possible. Just try to manage it with Google spreadsheets or other such platforms that can allow easy sharing and storage. However, I did try it once and then I shifted to this best online meeting software as I wanted meeting management to take lesser time. I hope the information mentioned above would help you find the right way of managing and tracking your meeting actions. ",
            "date": "Answered June 18, 2020",
            "views": "81",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Shibabrata Mondal",
                "href": "/profile/Shibabrata-Mondal"
            },
            "answer_text": "Broadly speaking, Action Items comes out of meetings because what needs to be done and by who and by when is somethings that teams plan and decide on collectively (in a meeting). But then the actual carrying out of this work happens outside of the meeting by individuals. And tracking of Action Item status needs to happen on a daily basis. You can try out Wizergos Meetings and Action Item Management tool. Its a web based tool (with mobile apps as well). The tool is designed to make meeting scheduling, running meetings, tracking action items easy with collaborative screens during meeting and daily plans and reports in emails. ",
            "date": "Updated January 5, 2018",
            "views": "968",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Srikant Mishra",
                    "user_href": "/profile/Srikant-Mishra-3"
                },
                {
                    "user_id": "Swamy Gowda",
                    "user_href": "/profile/Swamy-Gowda"
                },
                {
                    "user_id": "Kaustav Majumdar",
                    "user_href": "/profile/Kaustav-Majumdar-5"
                },
                {
                    "user_id": "Sudip Talukder",
                    "user_href": "/profile/Sudip-Talukder-1"
                }
            ]
        }
    ]
}