{
    "title": "How do the top copywriters know what to write? - Quora",
    "tags": [
        "Copywriters",
        "Copywriting",
        "Creative Writing",
        "Writers and Authors",
        "Writing Advice"
    ],
    "response": [
        {
            "author_info": {
                "name": "Stephen Paul",
                "href": "/profile/Stephen-Paul-206"
            },
            "answer_text": "The term “style” is thrown around a lot by writers, but it’s a misnomer for copywriters because “style” doesn’t work in the extremely short attention economy of the internet. Good copy isn’t necessarily “stylish.” But copy that establishes trust, authority, builds relationships, and gets people talking, sharing, and buying is in high demand. A lack of style is what makes it work, so writers who master this “style” are sought after and revered. Legendary ad man David Ogilvy was one of those writers, and he said, “A good advertisement is one which sells the product without drawing attention to itself.” It sounds counterintuitive, but it holds up under pressure, and I’ll explain why great content marketing is built on that exact premise. Clear communication is the key to effective copy Your best copy needs to be “display window clear,” and you need to be out there every morning with your Windex, to make sure it doesn’t distract from the product or service you provide for your clients and customers. Every writer eventually reaches for a style guide to help them craft clear copy, and there are countless helpful rulebooks and list posts that offer writers advice about proper usage and consistent language. Copyblogger actually has its own internal style guide, and members of the editorial crew often squabble about usage over (virtual) martinis. I am also a big fan of the classic English guidebook, The Elements of Style by Strunk & White. The aged copy I keep handy is dog-eared and yellowing. In it, William Strunk advises writers, A sentence should contain no unnecessary words, a paragraph no unnecessary sentences, for the same reason that a drawing should have no unnecessary lines and a machine no unnecessary parts. This requires not that the writer make all his sentences short, or that he avoid all detail and treat his subjects only in outline, but that every word tell. This is very solid advice for online publishers A copywriter comes to the rescue It was actually famed writer E. B. White who updated professor Strunk’s “little” 43 page English He revived it from scholastic obscurity to become what Time magazine has called “one of the 100 best and most influential books written in English since 1923.” E. B. White was more than a revered journalist (contributor to the New Yorker for 60 years), and award-winning children’s author (Charlotte’s Web). He honed his writing style as a copywriter in the 1920s, and contributed what he learned to The Elements of Style re-issue in chapter V, “An Approach to Style.” It’s no secret why this revered text is so short, and so effective. Mr. White edited the style guide with some reluctance, and was quoted years later as saying, My role in the revival of Strunk’s book was a fluke — just something I took on because I was not doing anything else at the time. It cost me a year out of my life, so little did I know about grammar. Make every word tell White’s lack of grammatical knowledge did not prevent the guide from becoming a bestseller for the better part of the last 50 years. In interviews, White wanted to remind writers that rules are meant to be broken, and that every writer has their own unique point of view and voice. Style results more from what a person is than from what he knows. In other words, every writer can memorize rules, but how you get people’s attention requires some creativity. Don’t get too hung up on the rules, or your copy might end up sucking, and that would break the first rule of Copyblogger. In honor of E. B. White I have updated Dean Rieck’s post The Ultimate Blogger Writing Guide. This list is only a sampling of the vast amount of knowledge available to online publishers and content marketers, but they are a few things that have helped me most along the way. What I present to you is an annotated guide to effective online copywriting “style” … 1. Headline Writing 101 Every writer who wants to make an impact online must take this clinic. There is only one reason your client or prospect will read a single word of the copy you’ve written: your headline. This is where you should spend 70% of your time. Start with the 4 U’s: UsefulUrgentUniqueUltra-Specific",
            "date": "Answered February 20, 2020",
            "views": "90",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Noah Logman",
                    "user_href": "/profile/Noah-Logman-1"
                },
                {
                    "user_id": "Grace Patton",
                    "user_href": "/profile/Grace-Patton-16"
                },
                {
                    "user_id": "Leah Jakson",
                    "user_href": "/profile/Leah-Jakson"
                },
                {
                    "user_id": "Samuel Rogerson",
                    "user_href": "/profile/Samuel-Rogerson"
                }
            ]
        },
        {
            "author_info": {
                "name": "Deanna Blanchard",
                "href": "/profile/Deanna-Blanchard"
            },
            "answer_text": "It really depends on the industry. When I wrote copy for the alternative health industry, I was usually selling a supplement. I determined what to write by doing a boatload of research on the ingredients and on the conditions they help. Plus, I had to be intimately acquainted with the worries, needs, and desires of my target market, so that I could paint a compelling picture of how this supplement was the best way to solve their problems or achieve their dreams. It’s different in the financial publishing industry. There, a promotion starts with a Big Idea. The copywriter has to write up a copy platform describing the idea and making a strong case for why it could be a successful promotion. This involves a lot of research as well. You have to have a fascinating story to tell. And you must prove that it’s something that can make investors money. Plus, you need to come up with some stocks with a large enough market cap that are on a upward trajectory. It’s a tall order. But if the copy platform is approved, you have the basic outline you need to write the promotion. ",
            "date": "Answered February 20, 2020",
            "views": "213",
            "upvotes": " View 6 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Grace Patton",
                    "user_href": "/profile/Grace-Patton-16"
                },
                {
                    "user_id": "Noah Logman",
                    "user_href": "/profile/Noah-Logman-1"
                },
                {
                    "user_id": "Ashley Robertson",
                    "user_href": "/profile/Ashley-Robertson-174"
                },
                {
                    "user_id": "Sofia Rotford",
                    "user_href": "/profile/Sofia-Rotford"
                },
                {
                    "user_id": "Samuel Rogerson",
                    "user_href": "/profile/Samuel-Rogerson"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/Amelia-Rogers-20"
                }
            ]
        }
    ]
}