{
    "title": "How to deal with an employee who shows attitude to a supervisor - Quora",
    "tags": [
        "Supervisor",
        "Attitude",
        "Office and Workplace Culture",
        "Employees",
        "Workplace and Professional Etiquette",
        "Psychology of Everyday Life",
        "Interpersonal Interaction",
        "Human Behavior"
    ],
    "response": [
        {
            "author_info": {
                "name": "Ehlers Zorgman",
                "href": "/profile/Ehlers-Zorgman"
            },
            "answer_text": "Why is the employee having the attitude ? Firstly if a person has an attitude it’s because they have an insecurity. This can be fear, or it can be something that comes from childhood. Now i’d like to say firstly you should be attention if the person is projecting on the supervisor. Then after you have that you can make a more controlled decision. on the other hand taking none of the above into consideration I may suggest the following : Treat the person with respect and inform them in a kind way that what they are doing isn’t ok.Do not point fingers or through authority around, as the person in a normal discussion how he would feel about ( create a similar situation in a different environment and ask him for his opinion). This will be able to show you how this person is thinking and how they will continue to react towards your supervisor.When you talk don’t create an atmosphere where there will be a serious talk.Additionally - speak to you supervisor get his side and give him some advice and see if the employee changes their attitude after the supervisor has addressed the employee , then only does someone of higher importance come into play if the above didn’t work.Never get angry or let your ego jump up, who ever addresses the person has to be humble soft and sincere.(those who anger you control you) Be receptive and listen to the employee, and find a win win solution for everyone, if there is still difficulty then we have to take more formal steps such as warning etc. To follow the legal way. good luck with your decision ! ",
            "date": "Answered May 10, 2020",
            "views": "149",
            "upvotes": " Answer requested by Sam LastV"
        },
        {
            "author_info": {
                "name": "Richard Hurtz",
                "href": "/profile/Richard-Hurtz-17"
            },
            "answer_text": "Well, are you the boss, or above the supervisor? I would say that the first action must come from the supervisor. If the supervisor can’t handle it, I would sit down with the employee and ask why there is a problem. I would listen, then explain to the employee that the way business works so that we can all do well, is that there are bosses and supervisors and workers. The boss determines the direction, and the supervisors make sure the work gets done. IF you think the supervisor has done something wrong to intimidate the employee, then you need to discuss that with the supervisor, but the employee still needs to know that he or she must follow the instructions of the supervisor. IS it that the supervisor has not handled this person well? IF so, work with the supervisor, but you also have to back the supervisor if you want to maintain control. Maybe the supervisor needs to work out things with the employee. IF, after you try to work with the employee, the employee still gives the supervisor a hard time, you will need to let that employee go. ",
            "date": "Answered May 10, 2020",
            "views": "37",
            "upvotes": " Answer requested by Sam LastV"
        }
    ]
}