{
    "title": "How to write a good application letter for becoming a prefect in your school - Quora",
    "tags": [
        "Writing Applications",
        "Writing Letters",
        "Graduate School Education",
        "Schools",
        "Education"
    ],
    "response": [
        {
            "author_info": {
                "name": "GR Gustafson",
                "href": "/profile/GR-Gustafson"
            },
            "answer_text": "I appreciate your confidence in my answers, and pray this helps you obtain your goal. Sections are numbered for clarity. Good luck! I was unsure what a prefect is and in my search I noticed that several schools have their program details posted. Here are two schools to get you started:www.buckswood.co.uk%2Flife-at-school-and-campus%2Flife-at-school%2Fthe-prefect-system%2F http://r.duckduckgo.com/l/?kh=-1&uddg=http%3A%2F%2Fwww.cncs.school%2FPrefect-System If your school doesn’t have their program online, ask school administration for information. If they don’t, creating the resource (ready for uploading) might be that gesture discussed in number 4. 3. The paragraph below might serve as an outline for your application. Your examples of these qualities should be concise. Try to show quality without using “I” statements. Students applying for the position of prefect must exhibit leadership qualities and a willingness to help others. They must be able to organize and delegate tasks, as well as possess excellent time management and administration skills. A portfolio of personal achievements is also helpful in garnering the prefect role. —-from What Are the Qualities of a School Prefect? 4. A small gesture of innovation might give you the edge you need to get the job. One of the best applications I have ever seen had what I’m talking about. I worked for a zoo that was looking for a new director. ONE stood out. FedEx delivered a small flat box. Upon opening, a butterfly on a wire “flew” up. The application was laying on a bed of grass. A small, unexpected gesture can make all the difference! 5. Your application should be pristine and succinct. Be careful of too many “I” statements (bears repeating). Review and revise with an eye for sounding too full of yourself. If you can include personal references, do so. Remember that your audience has seen tons of these applications. You want to impress, not bore. Let us know how your journey goes. GR ",
            "date": "Answered July 5, 2018",
            "views": "209",
            "upvotes": " View 2 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Jennifer Appiah",
                    "user_href": "/profile/Jennifer-Appiah-17"
                },
                {
                    "user_id": "Bethan Gagg",
                    "user_href": "/profile/Bethan-Gagg"
                }
            ]
        },
        {
            "author_info": {
                "name": "Rui Fang",
                "href": "/profile/Rui-Fang-25"
            },
            "answer_text": "A good application letter is like writing a resume for a job you really want. In order for you to get the job, you would need recommendations from teachers or bosses to increase your chances. Writing a lot about your involvement with school like services and extra curricular activities will help as well. Writing also about your experiences with service activities that you do in your own time is also a bonus when looking through applications whether for school or jobs. If you have any roles in your school or clubs like president of the Music Council or something, this will also boost chances. Being able to write well in your letter is also a plus, no one likes reading things with bad English, it is off putting. Make sure to check your tenses and your grammar too! Hope this helps! If you need any other tips, or suggestions, just comment on this answer and I will help you the best I can :) All the best! Hope you get it! ",
            "date": "Answered July 11, 2018",
            "views": "278",
            "upvotes": " View 17 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Ajayi Deborah",
                    "user_href": "/profile/Ajayi-Deborah-20"
                },
                {
                    "user_id": "Mercy Marachi",
                    "user_href": "/profile/Mercy-Marachi"
                },
                {
                    "user_id": "Anahad Kaur Bhatia",
                    "user_href": "/profile/Anahad-Kaur-Bhatia"
                },
                {
                    "user_id": "Hannah Mclean",
                    "user_href": "/profile/Hannah-Mclean-42"
                },
                {
                    "user_id": "Daisy Zhou",
                    "user_href": "/profile/Daisy-Zhou-17"
                },
                {
                    "user_id": "Toheer Abdulrazaq",
                    "user_href": "/profile/Toheer-Abdulrazaq"
                },
                {
                    "user_id": "OOQWERASD",
                    "user_href": "/profile/OOQWERASD"
                },
                {
                    "user_id": "Jennifer Samai",
                    "user_href": "/profile/Jennifer-Samai"
                },
                {
                    "user_id": "Yetunde Yemi-Adenuga",
                    "user_href": "/profile/Yetunde-Yemi-Adenuga"
                },
                {
                    "user_id": "Bibas Kandel",
                    "user_href": "/profile/Bibas-Kandel"
                }
            ]
        }
    ]
}