{
    "title": "How to write history to a fictional country - Quora",
    "tags": [
        "Fiction Writing",
        "Fiction",
        "Writers and Authors"
    ],
    "response": [
        {
            "author_info": {
                "name": "Natalie Kalos",
                "href": "/profile/Natalie-Kalos"
            },
            "answer_text": "Think of how it might have started, and maybe mirror it after some actual nation, past or present (maybe technologically adjusted) And throw some major random historical events For example, I’ve been playing around with a possible fantasy setting, but a little more Roman than medieval socially though also with influences of American independence as well. Mostly medieval technology at the present day, though So how does that look so far? Centuries of slow colonialization of the new land (this is really under-explored)Sort of supposed to mirror US colonial periods, though maybe not quite as awful treatment of natives (though yes, there WERE natives there already)Tyrannical kings from motherland start oppressing, causing revolts and ultimately independence (one of the independence events almost mixes the Boston Tea Party and the Trojan Horse together, in favor of the rebels)New nation has some peace mostly after deciding to form a council with limited powers to overrule the king (not progressive enough to make a President like actual US history, council not always actually going to turn out to be a major check almost like how the Roman Senate didn’t really mean no emperor). Ultimately there still are ten major regions mostly ruled by own major lords, and usually council members are those lords’ personal allies, such as their own family members.That kind of mirrors how Roman Senators were always upper class folk anyway pretty muchTensions rise against between new nation and nation they had split from, another war flaring up and new nation wins again (new nation actually not so old)Later on a few decades later, succession crisis occurs as believed king’s brother may have cuckolded him for the (first-born?) child who’s supposed to be heir if legitimate - there was an unquestionably legitimate (younger son or only son???) who many want to support instead of him. Ends sadly for the unquestionably legitimate one (think almost Red Wedding from GOT)Succession crises are ALWAYS a good idea for history ideas if you have any monarchies, by the way. They are so common to historical monarchy it is weird if you don’t have even one!The potentially illegitimate ruler now has a daughter who hates his guts after knowing how dishonorably he had “won” the throne, embarrassing the ruler and if anything making healing the divisions even harder (some lords’ families split on the question of who to back).A few decades later finally more decent rulers come though many still see them as having illegitimate, corrupted, blood from their ancestry. For their credit, they managed to somewhat improve equality among the peopleOne family particularly brutally treated in said succession war forever is ever itching to rebel, even almost a whole century later in the present day as the ruling dynasty seems to be on its last legs. Some even whisper they are behind the recent misfortunes behind the ruling dynastyVery broad strokes, and certainly could have a lot more detail. Maybe isn’t even conflict dense enough. But has some believable events for sure There also are some ethnic groups assigned already which I would want to incorporate as, say, explaining why alliances fell as they did in that succession war. I’m still figuring that out, as it was, again, a big enough wound that it matters to the present history I’m also leaving out the more fantastical elements as it is not as important to understanding the political situation as the story starts, with an uncertain fate of the dynasty. Though yes, there were some more fantastical touches to some of the events ",
            "date": "Answered February 18, 2020",
            "views": "716",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Robert Russell",
                    "user_href": "/profile/Robert-Russell-116"
                }
            ]
        },
        {
            "author_info": {
                "name": "Feifei Wang",
                "href": "/profile/Feifei-Wang-6"
            },
            "answer_text": "Here’s a comprehensive questionnaire you can use to guide your worldbuilding. I find it very useful when working on the subject, especially if you need to build a fantasy world from scratch. You don’t need to answer all of the questions, but it does help you think of your world more thoroughly. The Zaharam-Chapelle-Parunas Ethnographical Questionnaire Once you answer these questions, you will have the fictional history of your country and your world. Another thing you might want to consider is to use real-world history as reference. No. let’s not write another parallel story based on western “Christendom” history. You can’t out write GRRM so might as well pass on War of The Roses and look elsewhere. Try (relatively) less known histories from non-European Countries (from a western reader perspective). Try Indian history, try Chinese history, Japanese history, Aztec history, Polynesian history, try Southeast Asian history (Khmer Empire), try (non-Egypt) African history… You’ll find a lot of interesting things you can borrow. History, oftentimes, is more strange, more extraordinary than anything you can think of. I forget how many times I tell myself “damn I wouldn’t believe it if I read this in novels!” when I studied history. So do your research. ",
            "date": "Answered February 13, 2020",
            "views": "3",
            "upvotes": " View 82 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Jithin Mathew",
                    "user_href": "/profile/Jithin-Mathew-13"
                },
                {
                    "user_id": "Akhil Gupta",
                    "user_href": "/profile/Akhil-Gupta-198"
                },
                {
                    "user_id": "Kaiya Mudge",
                    "user_href": "/profile/Kaiya-Mudge-2"
                },
                {
                    "user_id": "Tamara Lee",
                    "user_href": "/profile/Tamara-Lee-124"
                },
                {
                    "user_id": "Josh R",
                    "user_href": "/profile/Josh-R-105"
                },
                {
                    "user_id": "Theodor Baltatzis",
                    "user_href": "/profile/Theodor-Baltatzis"
                },
                {
                    "user_id": "John Collins",
                    "user_href": "/profile/John-Collins-242"
                },
                {
                    "user_id": "Colin Yao",
                    "user_href": "/profile/Colin-Yao-7"
                },
                {
                    "user_id": "Lucas Lu",
                    "user_href": "/profile/Lucas-Lu-29"
                },
                {
                    "user_id": "Thomas P. Buehner",
                    "user_href": "/profile/Thomas-P-Buehner"
                }
            ]
        }
    ]
}