{
    "title": "How to write a position paper - Quora",
    "tags": [
        "Paper",
        "Writing Advice"
    ],
    "response": [
        {
            "author_info": {
                "name": "Nionica Starc",
                "href": "/profile/Nionica-Starc"
            },
            "answer_text": "How do I write a Position Paper? Writing a stellar position paper can be a difficult task for many students. You need to conduct thorough research and choose an argument that you will defend. If you are struggling to write a stellar position paper, the blog will surely help you. Go Through this link.  I am going to discuss the following points: What is the position paper? It’s Definition.Characteristics of a position paperCorrect Position paper formatHow to write a Position paper outline?5 winning Position paper topic examplesNow let us get into the details of writing a winning position paper. A Position paper is a written piece that presents an arguable statement about a particular topic. It must demonstrate why you believe your stand is valid and worth listening to. A position paper takes part in the larger debate on the issue. You need to state and support your opinion. While writing a position paper, it is mandatory to choose a side on a particular topic. You need to build up a case to defend your position or opinion. It is mandatory to use facts, statistics, and evidence to convince your readers that your position is the best among all. ",
            "date": "Answered February 4, 2020",
            "views": "129",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Claire Bryant",
                "href": "/profile/Claire-Bryant-3"
            },
            "answer_text": "How to Write a Position Paper The purpose of a position paper is to generate support on an issue. It describes a position on an issue and the rational for that position. The position paper is based on facts that provide a solid foundation for your argument. In the position paper you should: • Use evidence to support your position, such as statistical evidence or dates and events. • Validate your position with authoritative references or primary source quotations. • Examine the strengths and weaknesses of your position. • Evaluate possible solutions and suggest courses of action. Choose an issue where there is a clear division of opinion and which is arguable with facts and inductive reasoning. You may choose an issue on which you have already formed an opinion. However, in writing about this issue you must examine your opinion of the issue critically. Prior to writing your position paper, define and limit your issue carefully. Social issues are complex with multiple solutions. Narrow the topic of your position paper to something that is manageable. Research your issue thoroughly, consulting experts and obtaining primary documents. Consider feasibility, cost-effectiveness and political/social climate when evaluating possible solutions and courses of action. The following structure is typical of a position paper: • An introduction • Identification of the issue • Statement of the position • The body • Background information • Supporting evidence or facts • A discussion of both sides of the issue • A conclusion • Suggested courses of action • Possible solutions The introduction should clearly identify the issue and state the author’s position. It should be written in a way that catches the reader’s attention. The body of the position paper may contain several paragraphs. Each paragraph should present an idea or main concept that clarifies a portion of the position statement and is supported by evidence or facts. Evidence can be primary source quotations, statistical data, interviews with experts, and indisputable dates or events. Evidence should lead, through inductive reasoning, to the main concept or idea presented in the paragraph. The body may begin with some background information and should incorporate a discussion of both sides of the issue. The conclusion should summarize the main concepts and ideas and reinforce, without repeating, the introduction or body of the paper. It could include suggested courses of action and possible solutions. In case, you need some help you can contact Supreme essay service. Those guys are real professionals in what they do. So you can give them a try. Good luck! ",
            "date": "Answered September 21, 2016",
            "views": "14",
            "upvotes": " View 6 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Jackie Padilla",
                    "user_href": "/profile/Jackie-Padilla-35"
                },
                {
                    "user_id": "Avyakt Jaiswal",
                    "user_href": "/profile/Avyakt-Jaiswal"
                },
                {
                    "user_id": "Asher Villanueva Manangan",
                    "user_href": "/profile/Asher-Villanueva-Manangan"
                },
                {
                    "user_id": "Trishja Sunga",
                    "user_href": "/profile/Trishja-Sunga"
                },
                {
                    "user_id": "Kelvin Addo",
                    "user_href": "/profile/Kelvin-Addo-1"
                },
                {
                    "user_id": "Jessica Larson",
                    "user_href": "/profile/Jessica-Larson-18"
                }
            ]
        }
    ]
}