{
    "title": "How does one write a book that has a lot of characters? - Quora",
    "tags": [
        "Book Writing",
        "Creative Writing",
        "Writing Advice",
        "Writing"
    ],
    "response": [
        {
            "author_info": {
                "name": "Pat Bertram",
                "href": "/profile/Pat-Bertram-1"
            },
            "answer_text": "If it’s your first book, my suggestion is not to use a lot of characters. It takes skill to create a huge cast of characters readers can identify with, and even then, readers find it difficult to follow the stories of so many different characters. If you must have a lot of characters, the best thing for a novice writer to do is to keep the book to a single point of view — to follow the story from inside the head of a single character (the point of view character). That way, each subsequent character is somehow connected to the point of view character, because obviously, the point of view character cannot know what he or she doesn’t know first hand. It is very easy when you have a lot of characters to make mistakes — changing eye or hair color, for example — so be sure to make note of your characters’ physical and psychological descriptions and refer to it often. Write down the alphabet, and put each character’s name next to its letter (Anne next to A, for example) so that you can keep track of their names and make sure each begins with a different letter. If you run out of alphabet, you have way too many characters. When possible, try to combine the roles of minor characters. If you have a delivery person in one chapter and someone out walking in another chapter, try to combine them into the same person. That gives readers less characters to have to remember, and it makes the story more tightly interwoven. Most of all, make sure every single character, whether the point of view character, the major players or the minor characters are all intrinsic to the story. If any character can be eliminated without affecting the outcome of the story or the development of the main character, get rid of them. Everything in a book should serve a purpose. Or better yet, two purposes. ",
            "date": "Answered January 17, 2019",
            "views": "323",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Vishal Muktewar",
                    "user_href": "/profile/Vishal-Muktewar-1"
                },
                {
                    "user_id": "Claire Trims",
                    "user_href": "/profile/Claire-Trims"
                },
                {
                    "user_id": "Lily Temmer",
                    "user_href": "/profile/Lily-Temmer"
                },
                {
                    "user_id": "Rob Brown",
                    "user_href": "/profile/Rob-Brown-263"
                }
            ]
        },
        {
            "author_info": {
                "name": "Lily Temmer",
                "href": "/profile/Lily-Temmer"
            },
            "answer_text": "Keep a chart, something like a family tree, where you can diagram the characters, their relationships to each other, and their primary characteristics. Get some very, large stiff drawing paper from the art store big enough to contain all the characters. If you are visual and this system appeals to you, then you can try diagramming each chapter or scene on separate sheets, so that you can plot your story arc out and see how the characters play into it. This way you can keep track of everything without getting confused, confusing the reader, or getting repetitive. I used to think American readers couldn’t handle huge casts of characters, judging from the way they complain about 19th century Russian novels, but they seem perfectly fine with Game of Thrones, so there you go. ",
            "date": "Answered January 18, 2019",
            "views": "160",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Claire Trims",
                    "user_href": "/profile/Claire-Trims"
                }
            ]
        }
    ]
}