{
    "title": "How did you find your thesis topic idea? - Quora",
    "tags": [
        "Thesis Writing Help",
        "Thesis Topics",
        "Theses and Dissertations"
    ],
    "response": [
        {
            "author_info": {
                "name": "Yunlok Lee",
                "href": "/profile/Yunlok-Lee"
            },
            "answer_text": "Question: How did you find your thesis topic idea? Answer: For me, I found it through the process of running a business. This related to the approach of delivery high quality service to gain a competitive advantage, which fascinated me. I had a deep desire to run my business as professionally in service delivery as possible so that I can be competitive in the market, given the high quality product I had already offered. So, to find out more on the area, I embarked on further studies, and ultimately doing academic research thus they became the topic/s to research for my Masters and PhD theses. Others may find it through the professional work they do. They may be working in the industries or educational institutions. Yet others may find it through their research supervisor who happens to be doing research in an area and attempts to interest students wanting to do research to work on a suggested research topic. For example, an academic researcher may have successfully competed for research funds offered by an industry. Part of the funds may be used to offer scholarships to would-be research students at the university. Thus, in such cases research topics have been made available to the students. No searching for the topic is needed. If you are not in this situation, you may have to do a great deal of searching, which is not easy. One way to find an area of possible research is to think of an area that interest you and you do not know much about it. This interest, however, does not just come from no where. It may have come from your previous study or from work. Then, ask some questions as to whether the area in which you are interested be of much value to business, industry, and society. If so how and in what way? Can you do an academic research program in this area at university? Have you make enquiries. Can your apply to do research in this? Have you done more reading in the area to explore the contribution you research can make to literature, to practitioners in the industry and so on? Have you spoken with someone in a university such as a researcher, who is somewhat an authority or at least has a research interest in the area and is also doing research in the area? If so, can the person supervise you for a research thesis? If so, have you got the academic requirements to be admitted into the university to do your research? So, here you are actively searching for the possibility on which to do research in the area, with the aim of gaining knowledge and research skills to make a career out of it. Admittedly, the last option is difficult for younger and less experienced students who may not have been in the work force or have little contact in tertiary institutions, to do a research program with research topics they have some interest. ",
            "date": "Answered November 20, 2019",
            "views": "229",
            "upvotes": " View 2 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Megawati",
                    "user_href": "/profile/Megawati-4"
                },
                {
                    "user_id": "Adi Primanda Ginting",
                    "user_href": "/profile/Adi-Primanda-Ginting"
                }
            ]
        },
        {
            "author_info": {
                "name": "Mark Stinson",
                "href": "/profile/Mark-Stinson-15"
            },
            "answer_text": "How did you find your thesis topic idea? (A2A - thanks for asking) I’ll caution that this is what happened in my case, but worked only because of the cooperation of a couple of professors. In the second semester of my master’s program I was dithering about a topic for my paper for that course. The professor buttonholed me after class and told me that they wanted a topic now. I gave them a topic that had been raised a week or two earlier, but was decidedly tangential to the thrust of the course and they told me that was acceptable. It might also explain why I consider comparative politics and IR to be among my weaker fields: I spent my research time on a tangent. I researched and wrote a paper on that topic, but personally thought it was a decently written piece of fluff that didn’t really answer most of the more important questions. The next semester in a different seminar, the professor wanted a paper topic. The first paper was still bugging me, so I put that topic up again with the caution that I had already done a paper on it but was not satisfied with it, and wanted to take a different and more theoretical approach to the problem. The topic was pretty much in line with the subject of that course, so they agreed, I wrote it, and was still dissatisfied with it. I honestly had more questions than answers by the time I got done and that really bugged me. Next semester, different seminar, saw a third iteration which tried to bring the first two papers together using wholly different data. It was head and shoulders better than the first two, but still left unanswered questions. So when it came time to do my prospectus and thesis, that’s what I chose with the idea that being freed from the “no more than 30 pages” constraint might allow me to chase those unanswered questions. Spoiler warning: it did, but raised new questions in different areas and I’m still chasing some of them. ",
            "date": "Answered December 23, 2019",
            "views": "101",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Charles Greene",
                    "user_href": "/profile/Charles-Greene-21"
                }
            ]
        }
    ]
}