{
    "title": "How does one politely say to someone 'Did you do this yet?' on an email? - Quora",
    "tags": [
        "Email, Texting, and Voicemail Etiquette",
        "Manners and Etiquette",
        "Social Advice"
    ],
    "response": [
        {
            "author_info": {
                "name": "Marlena Greene",
                "href": "/profile/Marlena-Greene"
            },
            "answer_text": "Just be polite and ask if they had got around to it yet. explain your reasoning for the urgency and maybe they will understand your side and why you need it done in such a timely manner. Don’t be blunt like hey did you do this that sounds like you have an attitude . For example be like hey Larry it’s Marlena I know you’re busy just like myself but your opinion and feedback is really important to me and I would love to include in my report which is due (x amount of days or by certain date) And I would really appreciate if you got the spare time if you could take the chance to get that done for me.I really appreciate you taking the time out of your schedule, and have a great day! ",
            "date": "Answered March 4, 2020",
            "views": "107",
            "upvotes": " View 5 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Palak Thaker",
                    "user_href": "/profile/Palak-Thaker-4"
                },
                {
                    "user_id": "Vladimir Yermolenko",
                    "user_href": "/profile/Vladimir-Yermolenko-1"
                },
                {
                    "user_id": "Angela Benett",
                    "user_href": "/profile/Angela-Benett-2"
                },
                {
                    "user_id": "Jesim Onyx",
                    "user_href": "/profile/Jesim-Onyx"
                },
                {
                    "user_id": "Jaspal Singh",
                    "user_href": "/profile/Jaspal-Singh-120"
                }
            ]
        },
        {
            "author_info": {
                "name": "Candice DeRiso (Beckmann)",
                "href": "/profile/Candice-DeRiso-Beckmann"
            },
            "answer_text": "First of all, is an email really the appropriate communication channel for this? If you are a manager trying to work with a subordinate, there are many other ways to communicate that may be more effective - such as a recurring meeting where you check on the status of open tasks. Similar logic goes for working with a client. Create a system uofront for how you will manage to-dos and stick with it. Thoughtful honesty is so valuable. The reason you are asking about whether a task is done or not is because it has an impact on a shared goal with that other person. If you have no system in place already, it's probably time to set that up. ",
            "date": "Answered September 20, 2019",
            "views": "11",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Christopher Griffin",
                    "user_href": "/profile/Christopher-Griffin-20"
                }
            ]
        }
    ]
}