{
    "title": "How to write a sentence and paragraph - Quora",
    "tags": [
        "English Language Writing Advice",
        "English Grammar Writing Advice",
        "Writing Advice",
        "Grammar",
        "English Grammar"
    ],
    "response": [
        {
            "author_info": {
                "name": "Moreshwar Dalvi",
                "href": "/profile/Moreshwar-Dalvi"
            },
            "answer_text": "A good paragraph: Consists of one or more sentences. A paragraph can be long or short – there are no fixed rules about thisContains a single idea or topic – if you start a new topic, start a new paragraph.Contains a topic sentence which usually starts the paragraph (but not always). The rest of the paragraph tells the reader more about the topic, i.e. develops the idea by adding information, explanations, and/or examples.Builds on the previous paragraph and leads on to the next paragraph (if relevant).Is clear, logical and easy to understand. This means it is: - well organised with each sentence linked to what went before and leading to the next sentence/idea.- flows: you can achieve flow by organising your thoughts and using transitions. - starts on a new line, with an open line between paragraphs.There are three different kinds of paragraphs in an essay:  an introductory paragrapha number of body paragraphs, anda concluding paragraph.The one thing all good paragraphs have in common is a topic sentence. And the key to writing a good paragraph is to write a good topic sentence which  tells the reader what the paragraph's about (i.e. the main idea or topic)helps to answer the assignment question by referring either directly or indirectly to the question. This focusses the essay and keeps it on track.",
            "date": "Answered June 10, 2015",
            "views": "823",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Avadhoot Dongare",
                    "user_href": "/profile/Avadhoot-Dongare"
                }
            ]
        },
        {
            "author_info": {
                "name": "Kshitiz Sudhakar",
                "href": "/profile/Kshitiz-Sudhakar"
            },
            "answer_text": "A sentence is one or more complete thoughts or expressions. A paragraph is one or more sentences that relate any number of thoughts about a single subject or about an aspect of a subject.ANDA sentence starts with a capital letter and ends with a full stop (period). What I have written above (in bold)is a sentence. A paragraph consists of several sentences. Such as below:Your computer follows a list of instructions every time it starts up, performing tasks and starting programs. By removing unnecessary items from this list, your startup time can be improved. This is an advanced step, however, and a familiarity with startup items and related troubleshooting is recommended. ",
            "date": "Answered May 31, 2015",
            "views": "306",
            "upvotes": "0"
        }
    ]
}