{
    "title": "How are rhetorical definitions used? - Quora",
    "tags": [
        "Rhetorical Devices",
        "Rhetorical Questions",
        "Rhetoric",
        "Phrases",
        "Vocabulary of the English Language",
        "Linguistics",
        "Language",
        "Writing"
    ],
    "response": [
        {
            "author_info": {
                "name": "Michael Damian Brooke Baker",
                "href": "/profile/Michael-Damian-Brooke-Baker"
            },
            "answer_text": "First of all let’s start with the Rhetorical question. Often used when delivering speeches, the rhetorical question requires no answer. eg “Is this the sort of society in which we want our children to grow up?” Delivered from the speakers’ podium lines like this are very effective. Rhetoric however is not limited to this. Once taught as a subject in its own right - along with logic and grammar as the three ancient arts of discourse - it has slipped into a linguistic sub-division of English, and we continually come across various figures of speech described as a ‘rhetorical device’. By this I take it to mean an aide a persuasive device, or stylistic device which is a technique that an author or speaker uses to convey to the listener or reader a meaning with the goal of persuading them towards considering a topic from a perspective, using language designed to encourage or provoke an emotional display of a given perspective or action. Rhetorical devices evoke an emotional response in the audience through use of language, but that is not their primary purpose. Rather, by doing so, they seek to make a position or argument more compelling than it would otherwise be. Rhetorical devices that I have discovered include: (those I have emboldened I use quite often):- Alliteration, Assonance, Consonance, Cacophony, Onomatopoeia, Word repetition (Anadiplosis/Conduplicatio, Anaphora/ Epistrophe/Symploce/ Epianalepsis, Epizeuxis/Antanaclasis, Diacope; Antithesis/Antimetabole/ Chiasmus, Asyndeton/Polysyndeton, Prolepsis, Meiosis, Auxesis/Catacosmesis, Oxymoron, Zeugma; Amplification/Pleonasm, Antanagoge, Apophasis, Aporia, Derision, Enthymeme, Hyperbole, Hypophora, Innuendo, Metanoia, Procatalepsis, Understatement, Irony, Metaphor, Personification, Simile, Paraprosdokian, Hypallage, Hendiadys, Litotes. I’m sure there are more. I daresay I have included above some that perhaps aren’t rhetorical devices, but literary devices. All good fun! ",
            "date": "Answered August 28, 2020",
            "views": "21",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Indrajeet",
                    "user_href": "/profile/Indrajeet-32"
                }
            ]
        }
    ]
}