{
    "title": "How to write a letter of absence from a meeting - Quora",
    "tags": [
        "Writing Letters",
        "Letters (mail)",
        "Writing Advice"
    ],
    "response": [
        {
            "author_info": {
                "name": "Ragnar Brock",
                "href": "/profile/Ragnar-Brock"
            },
            "answer_text": "INSURA S.A.CHR Department700 La Marina StreetPhone 494 – 0372 Dear Sirs: Through this, I, Juan Carlos Diaz Soto, Director of the Finance Department of the Company INSURA SAC, with internal identification i1948274, want to communicate that I can not be present at the special meeting to be held on June 27th, 2019 The reason for my absence from the labor board is due to illness. Today I did some check-ups because I have trouble breathing. The doctor ordered me four days of medical rest since it resulted to be a lung problem which if not treated could get worse. To prove my justification I attach my medical certificate along with the order of rest and the prescription of drugs that will be using during this period. I wish you to understand me and understand that this is the fortuitous circumstance. If you decide to schedule such a meeting to a new date I would thank you to notify me Cordially, Juan Carlos Diaz SotoDepartment of FinanceINSURA S.A.C. ",
            "date": "Answered February 4, 2020",
            "views": "62",
            "upvotes": " View 2 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Veronica Builsah",
                    "user_href": "/profile/Veronica-Builsah"
                },
                {
                    "user_id": "Chinonso Maxwell",
                    "user_href": "/profile/Chinonso-Maxwell"
                }
            ]
        },
        {
            "author_info": {
                "name": "Bethany Reid",
                "href": "/profile/Bethany-Reid-4"
            },
            "answer_text": "An excuse, in my humble opinion, needs to be clear, direct, and honest. Sometimes you need only say that you won’t be there: “I am unable to attend the meeting this Wednesday.” You do not need to tell them why (my grandmother died—again; I’m going to the dentist; my azaleas will need watering). Not even if it’s true. And a vague excuse (“Something came up”) is just as bad. Of course something came up, or course you have somewhere else to be. Otherwise, you’d be at the meeting. Right? Don’t apologize unless you mean it. If your presence is essential, and you know that, then ask for what you want. Again, be clear. “I am unable to attend the meeting on Wednesday. Is it possible to reschedule? Thursday afternoon will work for me, or next Wednesday.” Saying “thank you” is good practice. ",
            "date": "Answered February 12, 2020",
            "views": "66",
            "upvotes": " Answer requested by Brendon Summer"
        }
    ]
}