{
    "title": "How to write a paragraph longer - Quora",
    "tags": [
        "Paragraphs",
        "Writing Advice",
        "How-to Question"
    ],
    "response": [
        {
            "author_info": {
                "name": "John Rodrigues",
                "href": "/profile/John-Rodrigues"
            },
            "answer_text": "Style is up to the author when it comes to formatting. The topic statement is often a good beginning, but the block of text could be the length of a chapter or a paper if it is all about the same subject. Appeal to Aristotle’s logic or syllogisms, for instance. Find other ways to state the premise along with its definitions and reasons. Then go through the proofs, or show that the contradiction is false. Along with other fallacies. maybe a dialectic. And then throw in the examples, demonstrations, consequences, categories, origins, expectations, and so on. No breaks needed since it is all the same train of thought. Which is another point if it is a stream of consciousness type. Books have been written which are a single sentence in fact so punctuation plays a role. Each sentence becomes like a summary which can be expanded in detail by clauses. Appeal to the sound more than the look.A sprint or first draft may be composed in such a manner to reach a certain length before editing. Like reading someone’s mind. The length is often a matter of pacing as well as any change in the elements. They want to lull the reader into it so that it takes full concentration. A blog that has each sentence on a new line still looks like a paragraph in the sense of long lyrics or rhetoric. The rhythm is more important than the pauses. They need not differentiate between description and dialogue. This is seen classically when they did not have the sense of scenes as much as sentiment. Like an incantation or prologue, or a thematic collection, including of questions. A description of the arc of a journey full of lots of ideas. Any of the above could be enlarged and still relevant or may want to delve into the psychological depths for suspense or other special effects. ",
            "date": "Answered August 7, 2018",
            "views": "305",
            "upvotes": " Answer requested by Dawood Mansour",
            "upvoters": [
                {
                    "user_id": "Abhay Pandey",
                    "user_href": "/profile/Abhay-Pandey-191"
                }
            ]
        },
        {
            "author_info": {
                "name": "Michael Wynne Sellars",
                "href": "/profile/Michael-Wynne-Sellars"
            },
            "answer_text": " PARAGRAPH DEVELOPMENT (Study this Paragraph Burger.) Most people want some conventional or traditional form of organization such as the paragraph. A paragraph is simply a chunk of information about one aspect (and only one) of your essay. The rule is discuss only one idea per paragraph. Paragraphs must also have coherence--that is one idea must logically follow another. In a typical paragraph arrangement, you should start with a topic sentence, which introduces the subject of that particular paragraph. Next, you will follow up with explanations, examples, evidence, illustrations, or personal/ professional testimony or some other proof for your topic sentence. This follow-up is part of what we call development. NOW. . .”Development” is the way to increase paragraph length. To develop a paragraph means offering readers a reasonably full discussion of the you wrote about in the topic sentence. Doing these things will ensure that your reader is not disappointed. You delivered what you promised. There is no prescribed length for a paragraph. Newspapers and magazines often print “one-sentence” paragraphs. Sometimes, such as in this answer, I shorten paragraphs to make for easier and quicker reading.   Hope this helps. ",
            "date": "Answered May 7, 2017",
            "views": "19",
            "upvotes": " View 1 Upvoter "
        }
    ]
}