{
    "title": "How to prepare best business plan for a startup - Quora",
    "tags": [
        "Startup Business Plan Advice",
        "Business Plans",
        "Entrepreneur Advice",
        "Entrepreneurship",
        "Startup Strategy"
    ],
    "response": [
        {
            "author_info": {
                "name": "Ambrose Philip",
                "href": "/profile/Ambrose-Philip-3"
            },
            "answer_text": "What a Potential Investor Wants To See In Your Business Plan You’ve have been able to build your business to the point of expansion, you’ve demonstrated some competence in the marketplace, and now you’re seeking your first round of funding. These are what you should consider first in your investor-ready business plan. You should also know that the angel investors or venture capitalists that you pitch your business with may not ever read your whole plan, trust me on that, but anyone who is interested in investing thousands or even millions of dollars in your business will want to do due diligence before they invest in your business venture. They’ll be especially interested in your strategic road map to profit, your business model, and a solid and fantastic financial plan. The best investor-ready business plan is a one page Business plan or a pitch deck. When writing a business plan for investors, focus on developing a one page business plan. A one page business plan is shorter and it’s easier to write than a complete business plan, especially if it’s your first time. Think of it as a way of giving your angel investor all the valuable information he wants to get about your company, its potential for success, and the areas where you may want to improve on in your strategic road map, and your business model, not forgetting your financial plan. Without hiding anything. Preparation and Homework. What an angel investor wants to see in your business plan is your solid financials and an impressive executive summary that suits their interest. They will ask you for whatever additional information they’re interested in. but your solid financial and executive summary is the most important. The key here is that by the time an investor says “yes” to the pitch meeting, you’ve already done all your homework on your one page Plan and you’re prepared for whatever investors want to know. For more on how to write your business Plan, click here Executive summary The executive summary you share the first time you reach out to an investor should be short one to two pages. It doesn’t include any unnecessary details, but it should support the financial forecast you’re also including. Make sure it covers: · Who you are—your name, your business name, your contact information · What you offer and the problem your business solves · Your target market · How much startup funding you’re seeking · The size or scale of your business · Any remaining critical details that investors definitely need to know A full financial forecast Your full financial forecast should include a projected profit and loss statement, a projected cash flow statement, and a projected balance sheet. The easiest and most accurate way to do this is to build the financials from the bottom up, starting with identifying your share of the market. First, figure out your TAM, SAM and SOM. That is, your total addressable market (TAM), then what percent of that market you are going to go after, or your segmented addressable market (SAM), and your realistic share of the market (SOM). Then ask: · What’s the average lifetime value of your customers? · How much is it going to cost you to get them (acquisition costs)? If you’re seeking investment, you’ll have to prove that you’ve had some initial traction, so as you build out your forecasts, use your actual to help model what you expect to see for the next few years. The elements of a one page, investor-ready business plan Before you send over your executive summary and financials, make sure you’ve already completed your full one page Plan. It will share some common topics with your executive summary, but it should go into more detail—and it should still be fairly brief. Your one page Plan and pitch deck should absolutely address each of these topics: · The problem or need that you’re solving for your customers · Your product or service—how you’re solving the problem · The target market size and demographics · Your sales channels · A basic marketing plan (the results of your market research) · Competitor analysis and your competitive advantage · Real financial projections including a full cash flow forecast · Key milestones in your business to date and a timeline of expected milestones to come · Key team members, business owners, and advisers championing your success For more on how to write your business Plan, The pitch presentation When your one page Plan is finished and your executive summary and financials are ready to send, prepare your pitch deck and presentation. Research your investors so you have a sense of who they’ve funded before and what they really want to get out of your presentation. Use storytelling to your advantage, but just like your one page Plan, your pitch should be brief. Your pitch will include many of the same elements as your one page Plan, but don’t just read your executive summary to investors when you have them in the room. Here’s a guide to pitching to help you get started. Practice your pitch with your family and friends so you get comfortable with the delivery. Ask them to ask you questions about things they’re not clear on so you can start to anticipate and prepare for the hardest questions investors will ask. When you’re ready to seek funding for your startup, resist the urge to send over a 200-page business plan to a potential investor. Keep in mind that investors get piles of pitches just like yours every day. Make it as easy as possible for them to digest who you are and the opportunity your business presents. Just make sure that when you get that call back, you have a strong financial plan, and a well-thought-out one page Plan in your back pocket, so you’re not scrambling. For more on how to write your one page business Plan or a complete business plan click here ",
            "date": "Answered December 24, 2019",
            "views": "372",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Nokukhanya Zimo",
                    "user_href": "/profile/Nokukhanya-Zimo-1"
                },
                {
                    "user_id": "Gyekye Asubonteng",
                    "user_href": "/profile/Gyekye-Asubonteng"
                }
            ]
        },
        {
            "author_info": {
                "name": "Mcgregor Love",
                "href": "/profile/Mcgregor-Love"
            },
            "answer_text": "one does not plan to fail - one fails to plan\" is always true, and never more so when developing a new business idea. The relatively simple act of putting your business idea into written words is the first, but most important step required for making your business plan a reality. Regardless of whether you are looking for investors, convincing your bank manager, or just seeking supporters, a thorough, well-researched business proposal will start you off on the right foot. 1. Preparing to Create Your Business Proposal Determine whether you have the time, energy, and resources required to implement your business idea. Implementing your business idea will be a long and time-consuming process. You should consider what financial resources, ie. cash, and credit, that you can access to implement your business idea. Next consider whether you will need to make the implementation of your business idea a full-time job, a part-time endeavor, or whether others can implement the plan on your behalf. 2. Research similar products and services. If you have a good business idea, your first step should be to research whether other products or services exist that are similar to your business idea. Don’t worry if you find similar business models, this could simply mean that there is a strong market that is worth entering. Furthermore, the presence of potential competitors can be used to identify the needs of consumers that are currently not being met by existing businesses. Research customer feedback on the services and products provided by identified potential competitors. Once the limitations of your competitors are identified you can structure your business proposal in a manner that offers solutions to these limitations in order to create a unique offering to the public.If you are unable to locate similar services and products, this may be a sign that your business idea will be a great success because it will fulfill the needs of an underserved market.However, the absence of a market for your business product or service could indicate the difficulty of successfully implementing the business idea underlying your proposal.3. Consider potential marketing strategies. Take the time to brainstorm how you would market your goods, products or services to the public. Consider the successful marketing companies of your potential competitors. Analyze the strengths and weaknesses of these campaigns in order to learn from the mistakes of others. If you can't figure out a potential marketing strategy that will be successful, the idea should be a no go. Review competitor advertisements and other marketing tools used by competitors to attract potential customers.Determine the key elements of each competitor's marketing approach - low cost, high quality, superior service, and so on.Considering the Financial Aspects of Your Business PlanResearch potential costs associated with implementing your business plan. How much do you expect to get paid, if at all, during the development stage and beyond? How much start-up capital will you need to kick it off. To figure this out, start with potential revenues, rather than costs. How many units will you sell at what price, based upon your market analysis? The price of a product is generally determined by the competitor's prices. Unless you have something special, you will not be able to charge more than competitors, most likely less. Once you project revenues and unit sales, develop your cost of goods based upon sales projections (variable costs) and administrative (fixed) costs. Project the full slate of financial statements. Contact vendors and other providers of relevant outputs in order to get price quotes on the goods and services required to implement your business plan.Estimate the costs related to hiring personnel, and purchasing the physical space and equipment required to implement your business idea.If you can't afford to pay yourself you will need to ask yourself if your business idea is worth pursuing. Remember, the business's money is not your money and failure to understand/consider this fact is how many business people end up in hot water.2. If applicable, consider business taxation and registration considerations. You may require some systems and processes to meet statutory obligations/legal requirements. Include business taxation and registration considerations in your business proposal in order to prevent unnecessary surprises.Check with your local or state business administration office in order to learn whether there any licenses, taxation, or other requirements that you must comply with in order to implement your business plan.Estimate the amount of profit you would need in order to recoup implementation costs. This is quite important since most businesses fail due to a lack of adequate funding. Once you have determined the cost of implementation, you should next determine how much profit you would need to make in order to recover all costs associated with implementing your business proposal. This will allow you to determine how much you should charge for your product or service and will allow you to begin to structure a timetable for when you will begin to recoup an actual profit. Use the total amount of estimated costs for implementation as the starting point for determining your profit forecast.Though the profits you make would ideally be greater than the costs of implementation, the reality is that most businesses fail before the first full year of operations. Thus breaking even over the first few years of operation would be a big success.A forecast for recouping implementation costs will strengthen your business proposal, especially when you are pursuing financing.Create a completed draft of your business proposal.A good business proposal should provide a succinct/detailed explanation of what your business idea is, your market research, potential marketing strategies, the cost of implementing the proposal, and a pricing strategy. Divide your business plan into the following separate section. An executive summary that concisely outlines your business plan. Communicate the ultimate purpose of your business proposal.Market analysis for the industry your proposal is geared towards. Provide reasons for why your business proposal should be successful given both unique and specific market considerations.Strategy and implementation plans for executing your business proposal.Financial plans and projections regarding the cost of implementing the business proposal, as well as possible profit projections if the business plan is a success.Consider your reader, and never assume they have relevant previous knowledge. Many good business ideas fail to gain support because the person reading the proposal didn't understand what they were reading. Explain everything in your proposal as if you were presenting it to someone with no previous knowledge in the field. Make sure your business proposal is purposefully presented. Useful graphs, illustrations of promotions, prototypes, etc., as well as a good, easy-to-read document layout, will all make a good impression and look more professional. Consider getting your proposal professionally bound, and always print in color if you have charts and diagrams. Be prepared to give verbal presentations in support of your proposal. Have the draft proposal independently reviewed. A fresh set of eyes will often pick up errors and omissions that a writer misses. Ask a business professional you trust to review your business plan for anything that they themselves would have included in the plan. After this review consider which suggestions such be integrated into your business proposal draft. Having a trusted business professional look at your business proposal draft could also lead to additional business mentoring/guidance and maybe even financial assistance for implementing your business plan.Kindly read the full details on our blog.",
            "date": "Answered October 29, 2020",
            "views": "22",
            "upvotes": "0"
        }
    ]
}