{
    "title": "How will I write a letter to my uncle telling him that I want to spend my holiday with him? - Quora",
    "tags": [],
    "response": [
        {
            "author_info": {
                "name": "Benny Njuguna",
                "href": "/profile/Benny-Njuguna-1"
            },
            "answer_text": "Here is an example: Dear Uncle/Dear Mr. John, Greetings from your nephew, John. I hope you're doing fine and your family too (if he has a family). We are breaking for holiday in a month's time. I would like to spend the holiday with you (or ‘your family'). Please, let me know if you are okay with it. I would love to spend it with you…(offer the reason(s) why). I'm looking forward to your reply, uncle. Thanks. John  I think you can get some ideas from the above example on how to write the letter. It should be short and clear. Remember, you should write in handwritten form if you're sending post. It sounds natural and writing from the heart. If it's by email, you'll have to depend on your smartphone, tablet or computer. If sending by post, remember to include your address followed by the date below it. On the right side below the date, write Dear Sir followed by a comma. Start with greetings below the salutation. Wish him good health including his family (if he has). In the next paragraph, state your reason for writing the letter. Let him know what you're doing now since there is an indication you're breaking for holiday in a few weeks' time. Let him know why you want to spend the holiday with him. Thank him and let him you know you're patiently waiting for his reply. End with your name. If you want you can put your title below your name 'Yout nephew.’ ",
            "date": "Answered July 15, 2019",
            "views": "24",
            "upvotes": " View 8 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Thapelo Martin",
                    "user_href": "/profile/Thapelo-Martin-1"
                },
                {
                    "user_id": "Bhavana Royal",
                    "user_href": "/profile/Bhavana-Royal-4"
                },
                {
                    "user_id": "Portipher Frimpong",
                    "user_href": "/profile/Portipher-Frimpong"
                },
                {
                    "user_id": "Mwanajuma Salim",
                    "user_href": "/profile/Mwanajuma-Salim"
                },
                {
                    "user_id": "Richmond Egenti",
                    "user_href": "/profile/Richmond-Egenti"
                },
                {
                    "user_id": "Iheanetu Priscillia",
                    "user_href": "/profile/Iheanetu-Priscillia"
                },
                {
                    "user_id": "Biswas Bansal",
                    "user_href": "/profile/Biswas-Bansal"
                },
                {
                    "user_id": "Nana Opoku",
                    "user_href": "/profile/Nana-Opoku-21"
                }
            ]
        },
        {
            "author_info": {
                "name": "Richard Lueger",
                "href": "/profile/Richard-Lueger"
            },
            "answer_text": "First of all, it’s not clear whether you want tips on ideas because you want to go to your uncle’s or you want tips on how to ask properly in English, perhaps as a classroom assignment. Second, your question should be ‘How should I write…?’ if you want advice, or perhaps ‘How would I write…?’ if it’s more speculative, advice on something you might do. ‘How will I write…?’ asks for a prediction about the future. Third, assuming that you want ideas and not advice on writing a requesting letter, there are so many variables that it’s impossible for me to suggest anything without more information. How old are you and how old is he? What’s the generation gap? How well do you know him? How well-off is he (how much money does he have)? Who else will be there? Do you want to spend your vacation camping with him, say, or at his house or apartment? Do you expect him to feed you for free? What’s your motivation? Is it him you want to see or do you just like where he lives as a vacation spot? Even if this is just a classroom exercise, you should answer all these questions before you start. It will help define the tone and style of the letter no matter what your goal. For example, if you’re both young and he’s only a few years older and you know him well, you can be direct, your tone can be chummy and your style can be slangy, e.g. “Hi, Unc, how’s it going? Wouldn’t it be cool if we hung out together this summer?” If he’s much older and you don’t know him well, you’d want to be more formal and indirect, perhaps starting out by referring to a common bond, then preparing for your request by explaining your motivation, e.g. “Dear Uncle Charlie, I’ve been thinking about how much fun I had when you used to come over for Christmas when I was little. I feel bad that we’ve lost touch over the years, and I was wondering if it might be possible for us to get together this summer…” You can’t get a much more polite requesting expression than ‘I was wondering if it might be possible.’ ",
            "date": "Answered May 28, 2019",
            "views": "141",
            "upvotes": " View 5 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Elizabeth Henderson",
                    "user_href": "/profile/Elizabeth-Henderson-40"
                },
                {
                    "user_id": "Mwanajuma Salim",
                    "user_href": "/profile/Mwanajuma-Salim"
                },
                {
                    "user_id": "Dot Gingell",
                    "user_href": "/profile/Dot-Gingell"
                },
                {
                    "user_id": "Iheanetu Priscillia",
                    "user_href": "/profile/Iheanetu-Priscillia"
                },
                {
                    "user_id": "Charliss Green",
                    "user_href": "/profile/Charliss-Green"
                }
            ]
        }
    ]
}