{
    "title": "How are prose and poetry similar? - Quora",
    "tags": [
        "Prose",
        "Writing Poetry",
        "Poems",
        "Poetry",
        "Literature"
    ],
    "response": [
        {
            "author_info": {
                "name": "Laveena Behl",
                "href": "/profile/Laveena-Behl"
            },
            "answer_text": "Prose and poetry and two different forms of writing. Prose is a form of writing without a metrical structure whereas poetry denotes sentences arranged in a metrical structure. However, in my opinion, there is an intrinsic rhythm to any form of writing (not rhyming, which is created through similar sounds) which can be found in both poetry and prose. In present scenario, genres such as slam poetry have given rise to blank verse, sometimes disjointed to a point where it actually seems like prose; the recitation however differs in both cases: poetry, whenever recited, carries a beat, whereas the recitation of prose is an entirely different activity. In terms of usage of literary devices, both poetry and prose carry simile, metaphors, and techniques to build a literary imagery. I hope this helps :) ",
            "date": "Answered December 3, 2018",
            "views": "38",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Reinfred Addo Central",
                    "user_href": "/profile/Reinfred-Addo-Central"
                },
                {
                    "user_id": "Denise Estobz",
                    "user_href": "/profile/Denise-Estobz"
                },
                {
                    "user_id": "Arjun J Bhatnagar",
                    "user_href": "/profile/Arjun-J-Bhatnagar"
                },
                {
                    "user_id": "Aurindam Mukherjee",
                    "user_href": "/profile/Aurindam-Mukherjee-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Jerry Hicks",
                "href": "/profile/Jerry-Hicks-15"
            },
            "answer_text": "Prose and poetry are very different, but there are many sub-genres in both poetry and prose Poetry is everything from the highest high to the lowest low, from fun to run. Most of the time it is a display of wit and erudition, but sometimes, just a single person pouring his heart into a memoir. Prose is anything from an advertisement for a used tent to war correspondence to fine novels. Fiction prose is anything from flash fiction to multi-volume books covering decades of a family’s history. The main thing that separated poetry from prose is the time span. In general a poem is a flashback, much of the backstory is missing, and the time span for most poems is a few minutes at most. Many poems have no time span at all because the poet is writing about an inanimate object, like Ode to a Grecian Urn. On the other hand even flash fiction covers more than an hour of time, while O’Henry’s short stories occurred over the period of a weekend or so. It is said that poetry represents a poet talking to himself (or to his love). Prose literature takes the world as it’s stage and talks to a vast crowd. ",
            "date": "Updated May 27, 2018",
            "views": "51",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Dawn Fewkes",
                    "user_href": "/profile/Dawn-Fewkes"
                },
                {
                    "user_id": "Patricia Lynn",
                    "user_href": "/profile/Patricia-Lynn-14"
                }
            ]
        },
        {
            "author_info": {
                "name": "Richard Tedstone",
                "href": "/profile/Richard-Tedstone"
            },
            "answer_text": "Ahh, that IS such a good question! That answer by Ms Behal is a good answer. What you have to take on board is that words change their use over time. Not only that but appreciation/popularity is different. Over 100 years ‘poetry’ changes as much as music and old dichotomies are no longer so obvious or relevant. For over 2000 years poetry has been changing . . and all the time. Latin verse is not the same as some of ours: it doesn’t rhyme: it’s metrical. A lot of modern verse is not . . . . . BUT STILL we see it as a poem. Ms Behl ha defined the problem in a way: it’s that things change. An old Latin poem is not Wordsworth. Many years ago I found myself on the Scottish Arts Council’s list of Scottish poets: I DO NOT KNOW what a poem is!! BUT i recognise one when I see it. A poem is something in which the writer is using a common tool or a novel one (either will do) to make you understand. Prose is a a sort of NEWS (imaginary or not) : Poetry is a thing to itself. The reader has to discover if it works for him or her self. There are thousands of poems and thousands of answers. Categories are classifications for us. Prose or Poetry ? Both can make you understand, both put events/emotions/contradictions into ways that you haven’t realised before. Have I answered the question? They are both different ways of sharing happenings, thoughts and feelings. . . . . . I think I have said what I meant !!! ",
            "date": "Answered December 4, 2018",
            "views": "31",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Asif Iqbal",
                "href": "/profile/Asif-Iqbal-1106"
            },
            "answer_text": "I will quote my teacher and supervisor Dr. Ghani Rahman once he told me that the difference between poetry and prose is what the difference between simple walking and dancing. Lets elaborate it a little more. Poetry appeals to heart, emotions,feelings etc while prose to reason and intellect. Poetry has lines and stanzas etc while prose has sentences and paragraphs etc. The actual and original meaning of poetry is with the poet. All we assign meanings or interpretations to it is based on the readers experiences,feelings and knowledge. On the other hand, the meanings of prose are mostly actually transmitted by the writer. Poetry is easy to be memorized even long poems while prose is comparatively difficult to memorize. It seems needless to say that in the classical sense of the word,poetry is more literary in nature than the prose. Axi Mufti says that ours ( East) is poetry sublime while the westerns has got the sublime prose. From literature point of view,both are important on their own place and no one is superior or inferior to each other. Sorry I wrote the differences by mistake. ",
            "date": "Answered December 10, 2018",
            "views": "2",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Reinfred Addo Central",
                    "user_href": "/profile/Reinfred-Addo-Central"
                }
            ]
        },
        {
            "author_info": {
                "name": "Zahid Islam",
                "href": "/profile/Zahid-Islam-48"
            },
            "answer_text": "In my point of view, the language of prose is typically straightforward without much decoration. The language of poetry tends to be more expressive or decorated, with comparisons, rhyme, and rhythm contributing to a different sound and feel. They are both descriptive language. ",
            "date": "Answered October 26, 2020",
            "views": "95",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Samuel Williams",
                "href": "/profile/Samuel-Williams-97"
            },
            "answer_text": "Poetry and prose are both literature that seek to express a point. ... Poetry uses line breaks for various reasons—to follow a formatted rhythm or to emphasize an idea. Lines can run extremely long or be as short as one word or letter. Ideas are contained in sentences that are arranged into paragraphs. ",
            "date": "Answered March 19, 2018",
            "views": "28",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Ali Baba",
                    "user_href": "/profile/Ali-Baba-815"
                }
            ]
        }
    ]
}