{
    "title": "How to continue writing, when I have writer's block - Quora",
    "tags": [
        "Writer's Block",
        "Novel Writing",
        "Creative Writing",
        "Novels",
        "Writing Advice"
    ],
    "response": [
        {
            "author_info": {
                "name": "Jim Murison",
                "href": "/profile/Jim-Murison"
            },
            "answer_text": "I am rolling about laughing here, not because of your predicament, but how I remember myself at that age. I doubt very much if I could have concentrated long enough to even write a few chapters at that age. So good for you, I would say stick at it, but of course you are stuck, aren't you? You haven't actually pin pointed the problem here, all you have done is screamed out for help. A little more information would be helpful. Where are you in the novel, chapter one, nine, twenty? What has happened to cause you to grind to a halt? With so little information, it is hard to give you any hard and fast advice. Personally I have only suffered from it once, although technically, it wasn't writers block. While writing my first novel, I had roughly outlined my book. I had a beginning, middle and end. Unfortunately, as I progressed through the novel, the characters decided they were having none of it. I became stuck, I didn't know what to do. If I carried on writing in the same manner, the book was going to take a huge swing away from my original plot line. To try and get it back onto that plot line, would have meant going back and finding the point where it began to diverge and rewrite it. For a couple of months I swithered on what to do. Eventually I just carried on writing. It meant going back to the beginning once I had finished, and rewriting the entire first half of the book. That may seem quite daunting a task to you, but it was by far the best option. These days I don't bother outlining anything, and I never set my plot in stone. I keep it in a fluid state somewhere in my mind. That way, if the characters begin behaving badly again, I can simply go with it and see where they take me. However, that is my experience of writers block, and most likely has no bearing on what you are going through. Most sixteen year-olds that I know are still at school. They are dealing with exams, hormones, falling in and out of love for the first time. Fighting with their parents and siblings, the onset of acne and a thousand other trials and tribulations that all teenagers go through. Any and all, are more than enough to put you off writing. Don’t sweat it. Stress is the killer of creativity. So go out, have a day with friends, have a laugh, give yourself a little break, relax a little. Before you know it, your mind will beginning to fill up with the next couple of chapters. I wish you all the best for the future. ",
            "date": "Answered September 17, 2018",
            "views": "204",
            "upvotes": " View 5 Upvoters",
            "upvoters": [
                {
                    "user_id": "Ashton Hennessy",
                    "user_href": "/profile/Ashton-Hennessy"
                },
                {
                    "user_id": "Sapphire Mahmood",
                    "user_href": "/profile/Sapphire-Mahmood"
                },
                {
                    "user_id": "Omaa Nwadike",
                    "user_href": "/profile/Omaa-Nwadike"
                },
                {
                    "user_id": "Achyut Mishra",
                    "user_href": "/profile/Achyut-Mishra-5"
                },
                {
                    "user_id": "Sarah S",
                    "user_href": "/profile/Sarah-S-252"
                }
            ]
        },
        {
            "author_info": {
                "name": "Deborah Ross",
                "href": "/profile/Deborah-Ross-6"
            },
            "answer_text": "As a young writer, you’re probably grappling with learning many different literary skills at once. One is how to write a story, any length story. Another is how to determine the best length for a story idea. When I started selling professionally, over 30 years ago, the conventional wisdom was to begin with short stories and master craft issues at what was presumed a more manageable length, then go on to novels. (And this is what I did.) Since then I’ve met (and become friends as well as colleagues with) writers whose natural story length is long. Novels. Trilogies. Series. After years of writing at a pro level, most of then can write short as well, but it would have been a bad choice to begin with. Most, however, are just the opposite. So one possibility is that you’re attempting a novel before you have all the necessary literary tools. You may have a solid beginning idea but not the skill to develop it into enough substance to sustain 100K words, so you’re running out of steam, as it were. Perhaps you don’t know where the story is going and have written yourself into a dead alley, but don’t yet have the critical eye to see where you tied yourself into knots. Another possibility, as I indicated above, is that a novel isn’t your natural story length. You may be trying to stretch a short story-sized idea over 500 pages. Or you may have insufficient twists and turns and whatever nifty stuff lights you up about writing so that all the fun has gone out of it. Whatever you do, though, don’t give up. I can’t tell you how many of us who’ve gone on to successful careers writing novels have trunks of unfinished novels. If yours isn’t a source of joy, set it aside. Or steal the juicy bits and weave them together with new! improved! sparkly! bits. Try writing short or short-short. Try poetry. Write journal entries. Blog. Keep at it — and notice when you hit your stride. In other words, go where the fun is. The fun and the heartbreak and the adrenaline. That’s what will sustain you page after page, novel after novel, for an entire career. ",
            "date": "Answered September 17, 2018",
            "views": "162",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Giovanna",
                    "user_href": "/profile/Giovanna-61"
                },
                {
                    "user_id": "Marva Dasef",
                    "user_href": "/profile/Marva-Dasef"
                }
            ]
        }
    ]
}