{
    "title": "How to write an ecommerce description - Quora",
    "tags": [
        "Job Descriptions",
        "E-Commerce Companies"
    ],
    "response": [
        {
            "author_info": {
                "name": "Nathan Amery",
                "href": "/profile/Nathan-Amery"
            },
            "answer_text": "This is very product-dependent, but I would always write it with the intent and needs of the user in mind, as well as using the description as a place to instil trust and the company's brand into the user. Overall, descriptions should be: -Correctly written (Grammar, spelling) -Easy to read (Fleisch score, good sentence structure, audience-appropriate words) -Well structured (Headings, sub-headings paragraphs, diagrams, bullets, etc.) -Keep a user on the page. -Unique (Zero or minimal boiler-plate text, different descriptions for different products, definitely not using the manufacturer's description) Showing your knowledge of the product.  For a technical product, this might be ensuring the accuracy of what you're saying and using terms that show to those 'in the know' that you are also 'in the know'. For a fashion product, it might be describing outfits that this product goes with, or occasions it could be worn. Keeping a consistent tone of voice Your site should have a tone of voice and this should be used in your descriptions. If you have a fairly light-hearted colloquial style everywhere else, but a dry manufacturer's description on  each product people won't respond well to this. Talk to your users in the way they want to be spoken to. A different description than everyone else Uniqueness is important for SEO, but also for trust. Users will shop around and seeing the same manufacturer's text on 10 sites does nothing to help them decide on where to purchase other than price. Make your description unique and useful and you will stand out. Use of  formatting Splitting the description into sections makes it less daunting as well as allowing users to skip to the bit they want. People shop on different criteria, make it simple for them to see whether your product matches that criteria. Make the titles useful (don't fill them with 'SEO keywords') and match the titles to each section accurately. A long wall of text suggests 'lots of useless information'; a set of sub-headed sections suggests 'Useful, easy to read information'. An example of section headings for a water-bottle might be: Leak-proof design, Taste & Odour Free Lining, Sports Cap.  Each section would go more depth into the benefits of those features, allowing customers for whom a particular one was most important, to jump straight to that bit. For a product that isn't sold so much on features (like a fashion accessory), you could have something like: Designed By <designer>, Celebrity Wearers, Outfit Ideas Use of straightforward words Avoid fluff, filler words and overuse of superlatives. \"This gorgeous necklace in a trifecta of  the most vibrant colours will compliment a plethora of the highest class of outfits perfectly\". Using words like this doesn't make you sound clever, it makes you sound fake and makes it difficult to read. Remember that people are after information.  Use words that get your point across without having to reach for the Thesaurus. Imagine you were speaking to this person in a store - people would find you odd if you spoke that way. Think about Intent This is the number one tip. Intent is king. What does the person that lands on this page want to read? It doesn't have to be obvious intent such as 'they want information about the product'; it could be intent they aren't consciously aware of too - 'they want to trust the website they're on', or 'they want to be convinced that this item fulfils their needs'. For some products it could include stories of how the product came to be designed, for others it could be as simple as a few lines of features and benefits.  For example, take an outdoor jacket. The audience is likely either a gear-head who wants to know how waterproof it is, how strong it is, the technical details of it's construction; or someone into the outdoors who just wants to cut through the hype and get something that works well. You need to identify which products appeal to each audience and tailor your description. Some descriptions you might explain what things mean, others you might assume a level of knowledge. Remember, this isn't a sales pitch, in the traditional sense. Don't write your description like a script for a sales rep \"This is the perfect jacket for your needs, it offers benefit x, benefit y, and comes in three great colours\". This is a different situation - you don't know what that exact user's needs are. This is why it's important to make your description well-laid out and easy to read as well as interesting and useful.  Finally, never assume your audience is stupid. Don't think they won't notice a poorly written description, a load of filler text with no substance, or that you use the same manufacturer descriptions as everyone else. ",
            "date": "Answered April 3, 2016",
            "views": "322",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Miljana Mitic",
                    "user_href": "/profile/Miljana-Mitic"
                }
            ]
        },
        {
            "author_info": {
                "name": "Namrata Dhaliwal",
                "href": "/profile/Namrata-Dhaliwal"
            },
            "answer_text": "In the word of online shopping there is no salesperson to assist the customers .So can one promote the products and convince the customers??? I hope the following four points will help you build a attractive and useful product description- 1)Target audience - if you are selling toys then you need to understand that your target audience is going to be parents/grandparents and and you need to convince them that the product is safe to use,mention all the warning labels etc.Connect to audience through words. 2)Gather product features and its benefits-Entice the customers by listing down the benefits of products in the product description.Convert your features into benefits. Benefits of your products will be your competitive advantage.Let your product speak about all the problems it can solve and wonders that it can do for the people who are going use the same product. 3)Concise and complete product description It is the age of mobile commerce and mostly people prefer to buy from mobile .So we need to keep our product description concise .Make sure you have listed all the important information about product in bullet points .Keep the sentences short as it will be easy to read for all the customers. 4)Use keywords to keep your product description optimized -to show your visibility over search make sure you use the keywords in product title and description.But don't overuse the keywords as your brand can lose credibility. Use keywords around brand,product variant,feature. I hope it helps!!! ",
            "date": "Answered April 19, 2016",
            "views": "154",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Avneet Singh Brar",
                    "user_href": "/profile/Avneet-Singh-Brar"
                }
            ]
        }
    ]
}