{
    "title": "How to write a clear objective - Quora",
    "tags": [
        "Objectivity",
        "Writing Advice"
    ],
    "response": [
        {
            "author_info": {
                "name": "Lacey White",
                "href": "/profile/Lacey-White-36"
            },
            "answer_text": "You make it as brief and direct as possible. This may be hard if your overall objective is general, but you have to work on being concise. For example, if I was doing a lesson plan on the origins of the First World War I would state that, “after the lesson students will be able to list three actions that lead to war. They will be able to list which countries were on the Axes side and which ones were on the Allied side.” Now, of course, the causes of World War 1 are hopelessly complex in reality, but I am stating MY objectives for MY lesson plan on this subject. If you are proposing a project then you must make a clear and recognizable reason this project needs to be done, how long it will take to implement your plan, and how you can gauge its success. (People like three facts) Keep it simple even if the reality is that things are very complex. Do NOT bog your objectives down in details. Leave that for the body of your proposal. ",
            "date": "Answered October 22, 2019",
            "views": "38",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Joseph Siegel",
                    "user_href": "/profile/Joseph-Siegel-5"
                }
            ]
        },
        {
            "author_info": {
                "name": "Therese Down",
                "href": "/profile/Therese-Down"
            },
            "answer_text": "Defining what an Objective is, as opposed to, for example, an Aim, is the first step, I think. An Objective is a concise, achievable target that can be reasonably attained in a relatively short period, on the way to realising a longer term Aim. If you want to learn to ride a horse, that’s your Aim. The first Objective of lesson 1 might be to learn how to mount, and hold the reins correctly, maintaining correct leg and foot positions in the stirrup, at walking pace. If I were running a training programme, or delivering a teaching module, my eventual Aim might be to equip participants/students with certain knowledge and skills to become proficient in something or meet the assessment objectives for a module, whether examined or assessed by assignment. However, my Aim will only be achieved by a succession of sequential Objectives. If it’s a one day training course, then each part of the day will be designed to ‘hit’ an Objective on the way to Aim achievement. If it’s a term-long module of teaching, each lesson must have its own Objective, designed to reduce the gap between where the students are and where they need to be. (This is known as ‘Formative’ teaching or ‘Assessment for Learning’.) eg: Aim: To ensure all students are prepared to write a successful hour-long essay on Hamlet, meeting the exam board’s level 3 assessment objectives, within six weeks. Lesson 1: Objective: to achieve student understanding of Hamlet’s genre as an early 17th century Revenge Tragedy Methodology: What do they already know about Hamlet?What is a Tragedy?: Ask students what they think - use contemporary examples to illustrate main criteria.Introduce the Classic Aristotelian model - with terminologyIntroduce the Senecan Revenge model and ask students to identify then discuss differences/similaritiesLesson 20: Objective : To assess individual attainment under trial examination conditions, and against all 4 Assessment Objectives, in response to the essay question: To what extent is Hamlet a typical Revenge Tragedy protagonist? Discuss with close reference to Shakespeare’s use of language and dramatic devices. ",
            "date": "Answered October 23, 2019",
            "views": "22",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Sarah Pell",
                    "user_href": "/profile/Sarah-Pell-14"
                }
            ]
        }
    ]
}