{
    "title": "How to apologize but not say sorry - Quora",
    "tags": [
        "Manners and Etiquette"
    ],
    "response": [
        {
            "author_info": {
                "name": "Heidi Paul",
                "href": "/profile/Heidi-Paul-3"
            },
            "answer_text": "From what I understand, you can easily apologize without ever saying sorry or even being really sorry or truly repenting, or even without being truly convinced you need to say the words.. Or that it's YOU who needs to.. or ever convinced that ABSOLUTELY you have done wrong or also contributed to a bad situation. Sorry is an emotion but not necessarily a heart conviction… and exactly why sorry could remain. perfectly meaningless, especially if then there is no evidence of it having meant anything more than a cursory acknowledgment of YOUR ID THEIR inconvenience, Whilst not really admitting to anything needing repentance or change from the sorry-sayer.. And coukd understandably interpreted as being cold or dismissively truvislising. . In the same light, I can FEEL sympathy about many things, but still have no emotional connection with that concept at all, (just words) or I may WELL even BE truly so sad that I may SAY sorry but never truly ifdentufy myself personally as would i if I had empathy and then it's biggest relative, compassion. When we go BEYOND merely SAYING sorry and are sincerely heart convicted (sore for our sins”) and so truly repent, that there will be sincerity and good fruit and a change of heart. ",
            "date": "Answered June 15, 2020",
            "views": "118",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Tav Eikei",
                "href": "/profile/Tav-Eikei"
            },
            "answer_text": "By doing better, by not repeating the same mistakes, by learning from your mistakes. You don’t have to say sorry at all, in fact don’t say it, it means little if you remain unchanging for the better. The best atonement is to be a better person, be better than you were before. ",
            "date": "Answered June 15, 2020",
            "views": "386",
            "upvotes": " View 7 Upvoters",
            "upvoters": [
                {
                    "user_id": "Robert Zurga",
                    "user_href": "/profile/Robert-Zurga"
                },
                {
                    "user_id": "Nichole Manuel",
                    "user_href": "/profile/Nichole-Manuel-2"
                },
                {
                    "user_id": "Liberty Sis",
                    "user_href": "/profile/Liberty-Sis"
                },
                {
                    "user_id": "Jeff Honebrink",
                    "user_href": "/profile/Jeff-Honebrink"
                },
                {
                    "user_id": "Ellie Styles",
                    "user_href": "/profile/Ellie-Styles-3"
                },
                {
                    "user_id": "Jack Tan",
                    "user_href": "/profile/Jack-Tan-285"
                },
                {
                    "user_id": "Ayah Dgdhdhd",
                    "user_href": "/profile/Ayah-Dgdhdhd"
                }
            ]
        }
    ]
}