{
    "title": "How to write a letter to the principal of college, informing about withdrawing from a course in the college - Quora",
    "tags": [
        "Lastest Fomat Writing Letter",
        "School Principals",
        "College Dropouts",
        "Writing Letters"
    ],
    "response": [
        {
            "author_info": {
                "name": "David Prem Govada",
                "href": "/profile/David-Prem-Govada"
            },
            "answer_text": "It is academically and professionally correct to keep your university informed of any change of plans as it reflects your conduct in an institution and having stated that let us touch upon your immediate requirement. You could start with a format like that of all letters to academia. Dear Mr. Ms. Dr. (last name) Thank him/ her for giving you the opportunity to have attended such a wonderful institution. Now state the reason you opted for the respective course in this institution in the first place and follow it up with the reason for wanting to change your preference of the course at this point in time in not more than 8–10 lines. Keep out negative opinions and feedback. Leave on a positive note. In fact, a bit of sadness for leaving the present college/ university will actually work for your benefit. Here you can mention your present course and present college/ university you have joined. Thank once more and sign off. Remember: You will always be remembered as a part of this college/ university so leaving on good terms is beneficial to you in the long run. Dear Mr. Brown I want to convey to you my gratitude for giving me the honor of being a part of this erstwhile institution. I had opted for a course in English Literature at the time of beginning my studies here as I got carried away by the glamour attached to literature however I have since realized that my calling was in MCA hence I would like to opt out of this course. Though I have attended classes for less than a year, I reiterate, I have not taken any examinations and would like to inform you that all my dues have been paid in full and the same has been acknowledged by the college/ university. I would also like you to know that I have already enrolled in XYZ university for a course in MCA. I leave this wonderful college with a fond and heavy heart. Though I leave this place without any certification I carry with me the fond memories of a lovely college/ university. I will always cherish the time I spent here. Thank you Your student xyz. ",
            "date": "Answered April 11, 2017",
            "views": "161",
            "upvotes": " View 6 Upvoters",
            "upvoters": [
                {
                    "user_id": "Kim Shakeer-Chin",
                    "user_href": "/profile/Kim-Shakeer-Chin"
                },
                {
                    "user_id": "Pramod Kachewar",
                    "user_href": "/profile/Pramod-Kachewar-3"
                },
                {
                    "user_id": "R Sangit",
                    "user_href": "/profile/R-Sangit"
                },
                {
                    "user_id": "Sristi Varma",
                    "user_href": "/profile/Sristi-Varma"
                },
                {
                    "user_id": "George Best",
                    "user_href": "/profile/George-Best-30"
                },
                {
                    "user_id": "Vaping monk",
                    "user_href": "/profile/Vaping-monk"
                }
            ]
        },
        {
            "author_info": {
                "name": "Dave Stafford",
                "href": "/profile/Dave-Stafford-5"
            },
            "answer_text": "First, this should be a formal letter addressed to the appropriate person by name and title. If you wish to use a subject line, then: REF: Withdrawal from Course 101 (example) After the saluation, I would express regret for having to withdraw from the course. If you can think of something good to say about the course, the professor, and the value offered, then do so. It is not necessary to go into detail about why you are withdrawing beyond the statement of regret. Your closing would be along the lines of “\"appreciation for their consideration or the consideration shown.” Sincerely or Yours Truly. Should be personally signed within a signature block. For maximum impact, send via Certified Mail Return Receipt. If by email (and I do not recommend), use same general format. Do all you can to avoid burning bridges; a nice letter expressing regrets and thanks for a valuable learning experience will pay off. GOOD LUCK! ",
            "date": "Answered April 11, 2017",
            "views": "77",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Ashwini Chakrasali",
                    "user_href": "/profile/Ashwini-Chakrasali"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/Anas-Tassia"
                },
                {
                    "user_id": "Vaping monk",
                    "user_href": "/profile/Vaping-monk"
                }
            ]
        }
    ]
}