{
    "title": "How hard is it to become a technical writer? - Quora",
    "tags": [
        "Technical Writers",
        "Technical Writing"
    ],
    "response": [
        {
            "author_info": {
                "name": "Ugur Akinci",
                "href": "/profile/Ugur-Akinci"
            },
            "answer_text": " Technical writing is like guitar playing — it’s easy to start doing both but hard to do them well. Obvious prerequisites: You have to like writing.You have to enjoy explaining things to the others.You have to like learning how systems, complicated things and gadgets work.Not so obvious factors that create a great technical writer: You have to be a team player since technical writing is best done in a team environment. Even if you are a lone writer, you’ll find yourself interacting with a lot of people to get your tech document done appropriately.You have to have a horse-sense of what is important and what is not. In a technical document it’s crucial to include information only on what is important (i.e., The Problem) and nothing else since people are very busy and time is money. You have to develop the ability to go to the core of an issue and focus on that without getting lost in side paths.You have to be a very organized person and develop a good system to keep your files and documents where you can reach them easily. Perhaps you can’t now foresee this, but as a writer you’ll end up having hundreds or even thousands of files, with different versions and revisions of each file, and soon you’ll be looking at a document jungle if you haven’t planned your file system appropriate, ahead of time. If you have a good filing system your work will be a lot more productive, efficient, and without any unnecessary navigation pains.You have to keep learning new writing and publishing technologies. Creating a PDF document is not enough anymore in today’s market. You should be ready how to generate help files, do context-sensitive and structural authoring, writing for mobile platforms, adding illustrations to your documents, and having enough web and Internet skills to post your deliverables on different outlets. There is no stopping to learning in technical writing. When you stop, you slide back in your market value. It’s a competitive “contact sport” so to speak that pays well.It’s easy to become a tech writer. If you can write a shopping list, you can write a technical document. But to take it from there, and to become a great Information Provider takes a little bit of work, wits, and the desire to keep up with the techno wave. For free writing tips visit © Technical Communication Center, LLC (Image courtesy of Jamie Fenn at unsplash dot com) ",
            "date": "Answered January 30, 2019",
            "views": "23",
            "upvotes": " View 6 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Kim Sydow Campbell",
                    "user_href": "/profile/Kim-Sydow-Campbell-1"
                },
                {
                    "user_id": "Depak Mandal",
                    "user_href": "/profile/Depak-Mandal-3"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/PJ-422"
                },
                {
                    "user_id": "Jessica Kohner",
                    "user_href": "/profile/Jessica-Kohner"
                },
                {
                    "user_id": "Shashank Agarwal",
                    "user_href": "/profile/Shashank-Agarwal-80"
                },
                {
                    "user_id": "Mel Berman",
                    "user_href": "/profile/Mel-Berman-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Ann Green",
                "href": "/profile/Ann-Green-67"
            },
            "answer_text": "Let’s have a look what skills a technical writer needs to get this job: Writing skillsThe first and foremost, technical writers are supposed to excel at writing itself. The main criteria of good software documentation is the clarity of text. This can be achieved only by someone who knows how to write, how to put the most difficult ideas in simple words. Ability to Work with Technical Writing ToolsTechnology keeps moving forward. Nowadays, everything is about efficiency, teamwork, and being agile. The number of companies using software for documentation authoring is going through the roof. No wonder - technical writing tools are designed specially for technical writing, they offer very task-specific functionality alongside with just being a user-friendly text editor. Research and exploration skillsThese skill may concern any tech writer, but, it, probably, affects outsourcers the most. Working in an outsourcing company means that you have to deal with a variety of client companies you have never heard of and are unaware of their products. Writing software documentation under such circumstances is a tough call. Only after hours of thorough research you can gather enough information on the given field to start with the writing process. Being SystematicSoftware documentation is a system. Some user guides can get so big and complex and stuffed with help articles that it is hard to believe that it is a system. Well, maybe, it isn’t anymore. And, that's bad. First of all, poorly structured documentation ruins user experience as it fails to fulfill its main function - provide people with easily attainable data. Secondly, documentation writers suffer, as well. When there’s no system it is really hard to maintain the user guide further. TeamworkA technical documentation team is part of a bigger mechanism. They must be able to communicate well with other departments. And it’s not a completed list. So, as you see, a technical writer should have a great set of skills. If you build this set, you will definitely get a technical writing job. ",
            "date": "Answered February 7, 2019",
            "views": "807",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Chetan Shroff",
                    "user_href": "/profile/Chetan-Shroff-12"
                }
            ]
        }
    ]
}