{
    "title": "How to avoid using the first person in a report when directly referring to work and experiences I have had - Quora",
    "tags": [
        "Résumés and CVs",
        "Writing"
    ],
    "response": [
        {
            "author_info": {
                "name": "Michaele Vestal",
                "href": "/profile/Michaele-Vestal"
            },
            "answer_text": "Concerning the use of first person in a resume, it all depends on where you use it! I always recommend that a Summary (especially instead of an Objective) be included as part of a resume. This would be the only section in which first person would be appropriate. It wouldn’t really even be necessary in any other section. Your Summary is describing you as a person as well as potential employee. If you are an Accountant for instance your Summary might begin with “I have always loved numbers. I was a ‘Mathlete’ in school competing in math contests. ……………… That is the only time that you would have occasion to use “I”. For the Employment section of your resume the format should be- Company name and location and employment dates Job Title then objective of the position “Hired to review…………… then bulleted accomplishments “Streamlined the process to…………………. None of the rest of a resume needs you to identify yourself as the person performing what you describe, that is a given. ",
            "date": "Answered October 14, 2019",
            "views": "13",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Tracy Quinn McLennan",
                "href": "/profile/Tracy-Quinn-McLennan"
            },
            "answer_text": "What kind of report is it? Why wouldn’t you be able to use first person? ",
            "date": "Answered October 14, 2019",
            "views": "11",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Antoinette Lourens",
                "href": "/profile/Antoinette-Lourens"
            },
            "answer_text": "Write from a third persons perspective. ",
            "date": "Answered October 14, 2019",
            "views": "5",
            "upvotes": "0"
        }
    ]
}