{
    "title": "How to become a good online content writer - Quora",
    "tags": [
        "How-to Become Question",
        "Creative Writing",
        "Writers and Authors",
        "How-to Question"
    ],
    "response": [
        {
            "author_info": {
                "name": "Jinal Panchal",
                "href": "/profile/Jinal-Panchal-15"
            },
            "answer_text": "Every single word matters.With that from a style guide, punctuation marks, lower and upper cases, capitalization, phrases, quotation marks, text format, paragraphs, margins, abbreviations, dialogues, grammar every single thing that you come up with while writing are important for an effective content. If you do not have a prior writing experience then you must read, read a lot of content on different topics which will give you the outlook on how exactly sentence are formed to intrigued the reader.How every word makes sense in one sentence and what impression that sentence want to leave on reader’s mind.Read a lot of books, create a thinking process ,or unique story telling way and ability to come up with a relevant instance(It helps you a lot while writing on a complicated explanatory topic like bitcoins, cryptology, etc which are difficult for reader to understand unless they are put into normal words).Sometimes its all about how comfortably you translates a complex or technical ideas into plain language that readers can easily understand. Take a online creative writing course or just go through the articles giving feedback that teaches you a lot how to cut down the crap short and be “On Point” while writing. Your content should give a sense of how thoughtful a content writer is; as you have to write while targeting the audience including the goal of the project. Apart from that you must have a good vocabulary (if you don’t have , you can always learn it), command over a language, deep understanding of the project , project goals. A strong googling skill will get you a deep insight about the topic, keen observation technique and adapting a topic would be a great help.The most important is how you convey your that deep knowledge by putting in to the words, writing and conveying styles does matter. And if you are an Engineer than please avoid plagarism. :p Welcome to the world Of Words. Happy writing. :) ",
            "date": "Answered February 5, 2018",
            "views": "605",
            "upvotes": " View 9 Upvoters",
            "upvoters": [
                {
                    "user_id": "Ravi Chaudhary",
                    "user_href": "/profile/Ravi-Chaudhary-549"
                },
                {
                    "user_id": "Srinithi Raj",
                    "user_href": "/profile/Srinithi-Raj-1"
                },
                {
                    "user_id": "Jyothi Puvvada",
                    "user_href": "/profile/Jyothi-Puvvada-7"
                },
                {
                    "user_id": "Dennis Bayeng",
                    "user_href": "/profile/Dennis-Bayeng"
                },
                {
                    "user_id": "Krishna Suryakanth",
                    "user_href": "/profile/Krishna-Suryakanth"
                },
                {
                    "user_id": "Snehal K",
                    "user_href": "/profile/Snehal-K-14"
                },
                {
                    "user_id": "Sahil Panchal",
                    "user_href": "/profile/Sahil-Panchal-1"
                },
                {
                    "user_id": "Harsh Panchal",
                    "user_href": "/profile/Harsh-Panchal-137"
                },
                {
                    "user_id": "Rajat Talesra",
                    "user_href": "/profile/Rajat-Talesra-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Heather Ennis",
                "href": "/profile/Heather-Ennis-1"
            },
            "answer_text": "1) Write. A lot. Then write some more.2) When you start to write, keep the following in mind:A) Who you are writing for. Think about your target audience and how they will understand your work.B) What the main idea is. No matter what you write, whether it is a story, a business proposal, a speech, personal correspondence, an op-ed article, a review, report, essay, or anything else, you should be able to summarize the content in no more than 2 to 3 sentences.3) Edit your work when you are done, not as you go. Editing should be done in stages.A) First edit for content. You will probably redact about 20% of your writing. You will find you have things that may be interesting but are not relevant. Don't discard them. Create an \"idea morgue\"; it can be organized any way you choose, but I highly recommend you note the date and where you did not wind up using it.B) Edit for flow. Read what you have written aloud. It is easier to find errors of grammar if you hear it. Make sure you are using correct terminology. This is the time to make subtle adjustments in vocabulary. If you find yourself using certain words or phrases repeatedly, think of other ways you can say the same thing.C) Edit for structure. Have a beginning, a middle, and an end. Avoid unusually long paragraphs. Ideally, you will want to have 7 to 11 sentences per paragraph. It's not a hard and fast rule, but one that works if you are just getting started as a writer.D) Edit for spelling. Here is a surprising but simple way to find spelling errors: read what you have written in reverse. Don't just rely on a spellcheck program. I used to tutor adults for their GEDs, and one of my students wrote an essay about the Second Amendment to the Constitution of the United States. The entire essay was filled with the phrase \"the right to bare arms\". Spellcheck doesn't tell you if you have the wrong word, as long as it is spelled correctly and is used properly within the sentence.4) Write about what you know. Write about what you don't know, but want to. Write about your passions. Write about your opinions. Write about things and people that have influenced you. Write about your family and friends. Describe things and places around you. Write about an inanimate object as if it were a living thing. Just write. ",
            "date": "Answered August 20, 2014",
            "views": "12",
            "upvotes": " View 10 Upvoters",
            "upvoters": [
                {
                    "user_id": "David Parsons",
                    "user_href": "/profile/David-Parsons-82"
                },
                {
                    "user_id": "Roopa Narayan",
                    "user_href": "/profile/Roopa-Narayan-2"
                },
                {
                    "user_id": "Joy Daiquiri",
                    "user_href": "/profile/Joy-Daiquiri"
                },
                {
                    "user_id": "Dennis Bayeng",
                    "user_href": "/profile/Dennis-Bayeng"
                },
                {
                    "user_id": "Aysha Muhammed",
                    "user_href": "/profile/Aysha-Muhammed-5"
                },
                {
                    "user_id": "Jamie",
                    "user_href": "/profile/Jamie-2037"
                },
                {
                    "user_id": "Vipul Singh Thakur",
                    "user_href": "/profile/Vipul-Singh-Thakur-7"
                },
                {
                    "user_id": "Asif Tariq",
                    "user_href": "/profile/Asif-Tariq-1"
                },
                {
                    "user_id": "Vijay Vihar Bandari",
                    "user_href": "/profile/Vijay-Vihar-Bandari"
                },
                {
                    "user_id": "Danielle Meinert",
                    "user_href": "/profile/Danielle-Meinert"
                }
            ]
        }
    ]
}