{
    "title": "How to stay motivated while writing a book? I mean, I love the ideas that I have, but sometimes it feels like I am forcing myself to write - Quora",
    "tags": [
        "Self Motivation",
        "Creative Writing",
        "Writing Advice"
    ],
    "response": [
        {
            "author_info": {
                "name": "Justin Streight",
                "href": "/profile/Justin-Streight-1"
            },
            "answer_text": "First off, congrats on writing a book. It’s hard, really hard, and most people give up part-way through. As for forcing yourself, well, I actually believe that’s natural. I’m going to do now what I always do in these situations and defer to far better writers. Stephen King also had difficulty forcing himself writing “Carrie.” In his book “On Writing” he said he learned a valuable lesson from the experience: Sometimes you have to go on when you don’t feel like it, and sometimes you’re doing good work when it feels like all you’re managing is to shovel s**t from a sitting position. I know, it’s touching. Especially when you consider that “Carrie” launched his career. If that quote hasn’t given you enough motivation, I have seen other writers try a few things to keep themselves grinding along. 1. Shutting the Door Once again, Mr. King recommends making sure that you keep the distractions out when you write. This means shutting the door, literally and figuratively. Give yourself time to be alone with the work with nothing more than some background music and water (coffee is also acceptable). This is tough, I know. You have a job, obligations. It’s really difficult to cut yourself off from the world. One way to avoid the world is to wake up before it does. I know, that’s terrible too. And a lot of people dive into writing with the specific goal of not waking up early. But, no one will bother you at 5 am in a closed laundry room. And for a bonus, many creative minds, and Google, believe that the morning is better for creative thinking. 2. Writer Groups Sometimes, writer groups are all about perfecting craft and story. But, many are just dedicated to keeping writers writing. Judging from the ones I’ve attended, these groups consist mainly of retired people, writing memoirs, who enjoy socializing and talking more than the writing itself. They may not be great beta readers and there’s often a rule against negative criticism (no matter how useful it is), but even overly kind feedback can give you a reason to finish the next chapter. If you don’t want to do it in-person, there’s also the Internet. There are Reddit pages full of people looking to exchange work and give feedback. One comic writer I know made free web-comics, and then got picked up by a publisher. She had developed her skills while getting constant reactions from Internet audiences. Once she had to work for someone else, without being able to post online, she became very depressed - and she felt very, very forced when writing - all because of the loneliness. 3. Let Go of the Pressure Sometimes, you feel like you need to come up with the perfect line, right then and there. That’s not always realistic. Sometimes you have to write badly. I’m going to take something from another great writer. This time, David Mamet: You gotta stand being bad if you wanna be a writer. I actually didn’t learn this idea from Mamet or take his Master Class. I learned it from the first editor I ever worked with. He insisted that the first thing I send him on a project was always a “s**tty rough draft” or SRD. We used abbreviations because time is money, or TIM. The idea was to take the pressure off, and let me get into the material with the time I had and do my best, knowing it’d be bad. He knew if the pressure was on, I’d try to please. And if I tried to please, I’d spend too much time, get stuck, and miss my deadline. That was bad, and to make matters worse, I’d probably still write badly. So, make a SRD. Take a new Word document if you don’t want to ruin your manuscript and go nuts. Brainstorm, experiment. Something good will come, or it won’t. But you’ll get closer to figuring it all out. _______________________________________ The most important thing is to keep going, even if it’s hard. Most writers have deadlines. Sometimes the deadlines come from bosses. That’s easy. Sometimes they have to come from yourself, because if you don’t work at it constantly, your ideas will grow old, and so will you, and you’ll move on. Don’t let that happen. BUT If you do go a day without meeting your writing goals, and you feel a bit stuck. Maybe you went off and watched TV and fell asleep. Don’t let it get you down. To steal from another great writer, George R.R. Martin, on writing everyday: On good days I look up and it’s dark outside and the whole day has gone by and I don’t know where it’s gone. But there’s bad days, too. Where I struggle and sweat and a half hour creeps by and I’ve written three words. And half a day creeps by and I’ve written a sentence and a half and then I quit for the day and play computer games. You know, sometimes you eat the bear and sometimes the bear eats you. ",
            "date": "Answered September 23, 2017",
            "views": "403",
            "upvotes": " View 9 Upvoters",
            "upvoters": [
                {
                    "user_id": "Sheri Fresonke Harper",
                    "user_href": "/profile/Sheri-Fresonke-Harper"
                },
                {
                    "user_id": "Rowan Lupus",
                    "user_href": "/profile/Rowan-Lupus"
                },
                {
                    "user_id": "Qanita Hussain",
                    "user_href": "/profile/Qanita-Hussain"
                },
                {
                    "user_id": "Mostafa Samy",
                    "user_href": "/profile/Mostafa-Samy-58"
                },
                {
                    "user_id": "Rodney Hanes",
                    "user_href": "/profile/Rodney-Hanes-2"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/Richard-Lowe-Jr"
                },
                {
                    "user_id": "Tina Torrest",
                    "user_href": "/profile/Tina-Torrest"
                },
                {
                    "user_id": "Alexander Fortier",
                    "user_href": "/profile/Alexander-Fortier"
                },
                {
                    "user_id": "Eriska Winayanti",
                    "user_href": "/profile/Eriska-Winayanti"
                }
            ]
        },
        {
            "author_info": {
                "name": "Shewanda Pugh",
                "href": "/profile/Shewanda-Pugh-1"
            },
            "answer_text": "Consider your sources for inspiration. Consider adding to them in the hopes of stimulating excitement about your story. Realize that every moment of your life is a chance for insporation. Be open to just that. More practically, I like to create and listen to radio stations on Pandora that remind me of characters, scenes, or themes. When the music plays, I let the characters take over. Some of my best ideas have come from a snippet of music. ",
            "date": "Answered September 20, 2017",
            "views": "73",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Callum Sutherland",
                    "user_href": "/profile/Callum-Sutherland-3"
                }
            ]
        }
    ]
}