{
    "title": "How to write a research paper on your own - Quora",
    "tags": [
        "Research Paper Writing",
        "Academic Research Papers",
        "Academic Papers",
        "Academic Research",
        "Scientific Research",
        "Research",
        "Writing Advice"
    ],
    "response": [
        {
            "author_info": {
                "name": "Balwant Acharya",
                "href": "/profile/Balwant-Acharya"
            },
            "answer_text": "Download ugc carelist and select journal after that download instructions to author than download copyright form after that arrange your paper according to journal format ex- abstract, introduction, objective, materials method, result, conclusion, conflit, reference etc. Than sign copyright for and affiliates than submit your manuscript (research paper) to editor email address or journal website than wait for acknowledgement and revision of your manuscript, after paper will accept and publish in research journal. ",
            "date": "Answered October 2, 2019",
            "views": "44",
            "upvotes": " Answer requested by Pavan"
        },
        {
            "author_info": {
                "name": "Dugesh Karley",
                "href": "/profile/Dugesh-Karley"
            },
            "answer_text": "This is one of the most important questions asked by researchers or I should say the early stage of the researcher's life. I have given answered many times for the same or similar questions so don’t want to write the same thing again. I think that lin can help you. Dugesh Karley (डुगेश कार्ले)'s answer to What is your suggestion on writing my first conceptual paper in my PhD, when I have not started empirical work? What normally would PhD students do in their first paper during their first year? Hope this will help you. Keep reading & keep smiling Dugesh Karley (डुगेश कार्ले) ",
            "date": "Answered October 2, 2019",
            "views": "162",
            "upvotes": " Answer requested by Pavan"
        }
    ]
}