{
    "title": "How to create super high-quality content that actually stands out - Quora",
    "tags": [
        "Quality Content",
        "Content Strategy"
    ],
    "response": [
        {
            "author_info": {
                "name": "Julian Canlas",
                "href": "/profile/Julian-Canlas-6"
            },
            "answer_text": " All right, when answering your question, it’ll be on the assumption that by standing out, you mean creating great content that gets clicks, subscribers and conversions. And if that’s the case, here are some tips to create seriously great content. Have an angle Value isn’t enough. Your readers need to understand the value you’re giving upon initial glance. In writing, this serves as an initial hook to actually get your readers interested. This is my first tip, because it is actually the hardest to execute. It’s hard to pinpoint what your potential audience will actually be interested in. But you desperately need an angle to cling on to encourage them in clicking on your article. Create value Of course, once you’ve figured out the angle that you want to take, make sure to actually impress your audience by providing them with insightful information they didn’t know about. This is what turns readers into subscribers, what builds trust and gives you a loyal following. Develop a personality Now, of course, you have an angle and you’re giving value. It’s now time to delve into storytelling and to make your personality shine. Simply put, when your article reads like a college thesis, no one’s going to read that. In order to be compelling and successful, you really can’t have the personality of a piece of bread. Plus, writing blandly is an affront to your actual personality! Add enticing media This coincides with 3, in that it brings flavor to your content. Images are much skimmable and easier to consume than words, so when you can distill essential information into a pretty visual, then that’s where the moneymaker lies. If you want, you can even add your face or brand identity to the visuals to really hone in on your personality. Do SEO Every great content answers a particular set of questions. This is inevitable. Answering questions brings value, and if you have enough personality, these people will decide to follow you. But a scalable way to do this is to think about search engine optimization, which is a marketing approach to using search engines like Google to get new customers. There’s a truckload of guides on basic SEO so I won’t go into detail, but a good starting point are website ebooks: https://moz.com/beginners-guide-to-seo This one is a detailed ebook that describes the ins and outs of basic SEO with a tiny bit of history in it. https://www.searchenginejournal.com/seo-guide/ This one is massiveeee, with over 18 chapters overall. SEJ is also a very reputed publication for all things SEO and quite legit. They study and track SEO to the point that they have Google's Search team on new Tweet notifications. I also have an SEO blog that I'm just starting out but it's a bit tactical, because I want to make sure that I'm posting things that are of value: https://embarque.io/blog I do think that basic SEO is valuable, but there's enough great articles on the subject matter. Measure, analyze and iterate Of course, creating great content is like building a product. Over time, as more people read what you have to say, you get an intuition of what people like. This is the final step to making sure that you find your angle and succeed in creating great content, data analysis. Analytics is your friend. Make sure that you measure various data points to figure out what type of content converts and what does not. The data should lead to where you want to be, but for that to happen you need humility and to cut off things that are not working. Hope these pointers are useful! ",
            "date": "Answered May 10, 2020",
            "views": "96",
            "upvotes": " View 2 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Noah Logman",
                    "user_href": "/profile/Noah-Logman-1"
                },
                {
                    "user_id": "Julian Canlas",
                    "user_href": "/profile/Julian-Canlas-3"
                }
            ]
        },
        {
            "author_info": {
                "name": "Jon Davis",
                "href": "/profile/Jon-Davis-338"
            },
            "answer_text": "Find what works. Improve it. 😁 Seriously though, look at what people are liking (Facebook, videos, blogs). Use that and make your own version - own stories, lessons, words etc ",
            "date": "Answered May 9, 2020",
            "views": "46",
            "upvotes": " View 6 Upvoters",
            "upvoters": [
                {
                    "user_id": "Noah Logman",
                    "user_href": "/profile/Noah-Logman-1"
                },
                {
                    "user_id": "Samuel Rogerson",
                    "user_href": "/profile/Samuel-Rogerson"
                },
                {
                    "user_id": "Avery Smith",
                    "user_href": "/profile/Avery-Smith-155"
                },
                {
                    "user_id": "Logan Norton",
                    "user_href": "/profile/Logan-Norton-11"
                },
                {
                    "user_id": "Tim Hitch",
                    "user_href": "/profile/Tim-Hitch"
                },
                {
                    "user_id": "Layla Morata",
                    "user_href": "/profile/Layla-Morata"
                }
            ]
        }
    ]
}