{
    "title": "How does technology affect student writing? - Quora",
    "tags": [
        "Educational Technology",
        "Creative Writing",
        "Writing Advice",
        "Students",
        "Writing",
        "Higher Education",
        "Technology"
    ],
    "response": [
        {
            "author_info": {
                "name": "Vijaykumar Chavda",
                "href": "/profile/Vijaykumar-Chavda-2"
            },
            "answer_text": "Information technologies have a major impact on our daily lives. From business and communication to leisure time activities, electronic devices, and online services; these all influence the way we think, and the way we behave. Students are by no means an exception here.  (Source of an Image - Google) How Does Technology Affect Student Writing? Pros and Cons As a matter of fact, young people are prone to embracing IT gadgets faster than their parents, so we are now witnessing a genuine revolution in the field of education. Technology is influencing almost every aspect of learning, but it probably makes the biggest impact on student writing. A report reveals that almost 50 percent of students aged 12 to 18 say they receive more writing assignments tasks than they can complete within the specified deadline. In such circumstances, it’s not surprising to see so many children writing assignments with the help of online platforms and apps. And of course, we are not speaking about academic essay writing where authors spend almost all their time, to write their best essays, writing to improve their talent... But what’s the effect of these tools? How does technology affect student writing? Keep reading to find out as we are going to explain the pros and cons of this phenomenon. Pros of Using Technology in Writing Online tools have so many beneficial effects on student writing, so let’s check them out here: Written communication flourishes. With all those interaction platforms available online, we can definitely conclude that written communication is flourishing. Almost every social media has its own messaging app, while the Internet is flooded with apps such as Viber, Skype, and WhatsApp. This gives students the opportunity to communicate freely and more frequently than before. Technology complements teachers. The sad reality of our education system is that most teachers have to work with large groups of pupils. This prevents professors from dedicating enough time to each student individually and makes the learning process more difficult. However, technology has the power to complement teachers, and help students to solve academic tasks on their own. For instance, mobile apps like Duolingo make language studies much more interesting, and available 24/7. This type of learning is interactive and gamified, which is the best way to encourage students to practice their writing skills. Improves research skills. The internet has, by far, the biggest resource of academic materials. Mark Walberg, a content creator at assignment writing UK, says online sources help students to improve research skills, and learn how to find the information they need: “We don’t have to go further than Wikipedia, but there are so many online libraries and learning resources a student can quickly discover while browsing the net.” Encourages creativity. The Internet does not only improve research skills. On the contrary, it also influences students’ creativity. How come? Well, the concept is simple: kids get to figure out new stuff online, see how other people think about certain topics and get inspiration for their own projects. That way, young authors can get better, and write more creative papers and assignments. Speeds up revisions. Editing and proofreading papers is not an easy task, particularly when students have a lot of other things to learn. In this case, proofreading tools enable super-speedy revisions. Some of the most popular solutions in this area include services such as grademiners reviews, dissertation writing service, research paper writing, Grammarly or Hemingway App. Each one of these platforms is capable of checking textual documents, identifying mistakes, and making corrections in a matter of minutes. Kids earn better grades. This benefit of using technology in writing is definitely a favorite among kids, so we absolutely have to mention it. As students keep getting better and more proficient as writers, they also start getting better grades. It’s a great side effect to online writing tools that make everyone happy: teachers, students, and their parents. Technology saves time. \"When kids have too many tasks to do, they hate wasting time on things like style revisions or paper editing. In such circumstances, platforms with top essay writing services like Australian Essay Writing, and Best Assignment Help, come in very handy,\" says Jessica Birdy, the main expert in essay writing. \"They make the writing process much faster, and save a lot of precious time students can use to learn other things.\" Inspire collaboration. Communication and writing platforms are genuine collaboration boosters. Using these tools, students can complete group projects, and learn what it means to work in teams. This is not only a benefit writing-wise, but it's also an opportunity for kids to acquire additional skills. For instance, they can understand the importance of supporting colleagues, develop empathy, and improve soft skills like interpersonal communication. Attention and thoughtfulness. Online content creation is often public, so students have to measure every word and be careful not to write something inappropriate. For this reason, a lot of kids become attentive and more thoughtful. They start paying attention to details and improve their writing skills in general. Cons of Using Technology in Writing Technology also has a few downsides if students don’t know how to use it properly. Without further ado, let’s see the cons of this phenomenon. Kids focus on short forms. While technology encourages kids to write more frequently, the fact remains that they also tend to use shorter formats. Modern students are all about text messaging and quick turnaround, which often reduces the quality of their academic writing in general. When it comes to longer forms, a lot of students are now struggling to write concise, and well-planned content. This could easily turn out to be a burden for children in the later stages of education. Students rely on digital tools way too much. Another issue is that students gradually become tech addicts. We’ve noticed so many kids, who couldn’t even think of a concept, begin writing without the use of writing platforms. It’s not a good trend because children need to learn how to act independently and develop their own writing skills single-handedly. But as technology keeps evolving, it’s hard to imagine anyone abandoning online tools, and relying on his/her own mental strength exclusively. Text becomes too informal. The internet develops a brand new slang that most kids are ready to embrace immediately. There is an endless list of Internet terms, phrases, and expressions that are completely inappropriate for traditional studies. You’ve probably heard of some examples, but we will mention a few frequently used words here: New words like a troll, bump, lurker, meme, facepalm, totes, pwned, etc. Acronyms like LOL, OMG, IMO, AMA, IDK, IRL, and many more. Shorter attention span. In the world where information is accessible almost instantly, it is difficult to inspire kids to concentrate. The shrinking attention span has become an important subject in academic circles because students don’t feel like engaging and delving deeper into the subject. This also means that it’s getting harder to exercise writing with pupils, and teaching them how to create meaningful content. Plagiarism. This problem goes hand in hand with the previous one. Some students simply don’t want to write unique papers, because they can simply copy and paste the content they found online. According to education analysts at rushmyessay, plagiarism has become a serious issue: “Teachers have to use plagiarism checkers, but that’s not a guarantee that every cheater will get caught. It’s not possible to eliminate this problem completely, but we must work with our students and let them know that this practice is just wrong.” Automation. Some teachers are afraid that kids might even lose creativity because online tools automate everything. Writing platforms advise children to use only one specific style of writing, which is never a good thing for students who feel like elevating their writing proficiency. For more information browse this site: vocal. media/education/how-does-technology-affect-student-writing-pros-and-cons I hope it will help you. :) ",
            "date": "Answered January 2, 2020",
            "views": "157",
            "upvotes": " View 3 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Donovan Minckler",
                    "user_href": "/profile/Donovan-Minckler"
                },
                {
                    "user_id": "Rita Mitze",
                    "user_href": "/profile/Rita-Mitze"
                },
                {
                    "user_id": "Ben Wills",
                    "user_href": "/profile/Ben-Wills-35"
                }
            ]
        },
        {
            "author_info": {
                "name": "Dani Alexis",
                "href": "/profile/Dani-Alexis-2"
            },
            "answer_text": "One of the biggest effects I’ve seen is what I call “word substitution.” It occurs when a student uses a word that is a correctly-spelled English word, but is not the word they intended to use in context. This particular mistake did occur before spellcheck became widespread. It was relatively rare, however. When it happened, it typically involved words that were close to one another in both spelling and meaning, like “effect” and “affect,” or in idioms whose meaning was ambiguous enough to encompass both spellings, like “toe the line” versus “tow the line.” Post-spellcheck, however, it has exploded as students assume that if spellcheck didn’t flag a word, it must be the correct word. My all-time favorite is “defiantly” in place of “definitely,” as in “I am defiantly going to take biochemistry next fall.” My all-time least favorite is the time I won an essay contest in undergrad, and every single instance of the word “from” in my original essay got changed to “form” when someone at the student newspaper office retyped it into the paper’s template. (Did you know the founder of the university was “form” upstate New York? I didn’t, until I saw my essay in the student newspaper!). ",
            "date": "Answered January 2, 2020",
            "views": "190",
            "upvotes": " Answer requested by Bonita Carter"
        }
    ]
}