{
    "title": "How to write a documentary script - Quora",
    "tags": [
        "Documentaries",
        "Screenwriting",
        "Writing Advice",
        "Writing"
    ],
    "response": [
        {
            "author_info": {
                "name": "Michael Uhila",
                "href": "/profile/Michael-Uhila"
            },
            "answer_text": "Start with the basics. What is your documentary about? You might want to have questions because a documentary is not like a narrative. You want things to be as is. You want to capture the moment and people as they are. Your writing is more about investigation and less about plot. If you're doing a documentary on restraining orders. You might want to write down all the possibilities you can think of. You might want to brain storm with other writers. How do you want it to begin might be your style. How do you want it to end might be your style too. It all depends on you. ",
            "date": "Answered October 28, 2015",
            "views": "378",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Namaji Srinivasan",
                    "user_href": "/profile/Namaji-Srinivasan"
                }
            ]
        },
        {
            "author_info": {
                "name": "Brady Abbott",
                "href": "/profile/Brady-Abbott"
            },
            "answer_text": "You don't really. You just create a shot list of the imagery you would like to capture, and the people you would like to interview. The questions you would like to ask. Often documentaries start out by the filmmaker wanting to explore a topic, and then afterward the focus of the documentary may change completely as they discover more, but all that gets figured out in the video editing room as you try to construct a narrative from all that footage. The content will sort of tell you what it wants to be. And you have to remain malleable for that. ",
            "date": "Answered August 12, 2017",
            "views": "334",
            "upvotes": " View 2 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Inder Singh Bariya",
                    "user_href": "/profile/Inder-Singh-Bariya"
                },
                {
                    "user_id": "Orunx Fox Egbonimali",
                    "user_href": "/profile/Orunx-Fox-Egbonimali"
                }
            ]
        }
    ]
}