{
    "title": "How long does it take to write 1,000,000 words? - Quora",
    "tags": [],
    "response": [
        {
            "author_info": {
                "name": "Kyle Phoenix",
                "href": "/profile/Kyle-Phoenix-1"
            },
            "answer_text": "Not that long, I do average about 10,000,000 a year. A book is roughly 100,000 words, I generally write about 20-40 a year. My tastes was about one week for one. I dip in and out adding scenes etc pretty much everyday to multiple projects. A Special Report is about 30,000 words. I generally do 10-50 a year, about a week to complete and publish. A White Paper Brief is about 10,000 words, which can be done in one sitting in a few hours. An article is generally about 2500 words. A blog post 500-1000 words. Also I do about 50 - 100 pages, 10,000 - 20,000 words of technical writing, manuals, operational stuff, planning, development, curriculum, a week. A slow year maybe 1 million words takes a month (10,000 words a see to places like Quora, Facebook, newsletters, tv scripts). A good year maybe two weeks. I generally do longhand first so I get legal pads and notebooks of 50-70 pages because I have the best idea of the page count when typed. 50 pages is 18-25 typed pages, 70 comes out to 25-30. Dialogue takes up space but often doesn't massively increase word count. I know, idiosyncratic but I publish and edit so I have to be conscious of the cost of words to paper to margins to costs to profit. Page count word be Anna Karenina, or War and Peace or Infinite Jest for 1 million but 3-4 hours a day could get you there with practice in a solid month, 90 hours, lets call it 100 hours. ",
            "date": "Answered September 3, 2017",
            "views": "36",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Guillaume Hauteluce",
                    "user_href": "/profile/Guillaume-Hauteluce"
                }
            ]
        },
        {
            "author_info": {
                "name": "Jacksonville Michelle",
                "href": "/profile/Jacksonville-Michelle"
            },
            "answer_text": "Well, it certainly depends on your schedule. How many minutes/hours are you able to commit to in a day? Also, the type of content you have to write plays a factor, as well as thinking to typing speed, other life priorities, you get the point. In the past (almost) year of writing my science fiction book I have written about a third of a million words. I am a student, work part-time, and for me it would take me a total of 3 years if I were to go at this pace of going about 1 thousands words a day and a (generally) 1 or two day break a week. I hope to one day surpass Marienbad My Love at 17.5 million words in terms of word count. So I have to up my game. However, if you were able to do 3 thousand words a day every day for a year (minus 1 day of rest every week), then you would have just passed the 1 million mark by the end of the 1 year time frame. Of course, if you had all the time in the world, plus no other priorities, plus an outstanding work ethic, and no distractions, then it would not be too bold to assume you could knock a million words (assuming you are writing an original fiction) in a 3 to 5 months. ",
            "date": "Answered October 20, 2019",
            "views": "613",
            "upvotes": "0"
        }
    ]
}