{
    "title": "How to write a good essay on any topic - Quora",
    "tags": [
        "Essay Writing Help",
        "Essays",
        "Writing Advice"
    ],
    "response": [
        {
            "author_info": {
                "name": "Costel Contun",
                "href": "/profile/Costel-Contun"
            },
            "answer_text": "For me, essays are all about being creative. All you need is a statement on a certain topic and then to support it with legit arguments. My favorite thing is to form a question out of the topic and answer it negatively. This way, I’m teasing my readers, and if I manage to actually support this argument, it always makes a great essay. For example, let’s take this topic “The way to dress for success.” Think of it as a question - “Does success depends on the way you dress?” and then answer that question with a big “NO, it doesn’t!” I’m pretty sure there are plenty of successful people that don’t really dress properly. If you are into music, you can check out Mac DeMarco - the guy looks like a hobo, and he loves it when the flight crew, for instance, redirects him to the second class and he complacently waves his VIP pass card in their faces. You don't necessarily need to believe in what you are writing! You just need to find the right arguments that support your weird statement. My advice - get as weird as possible and research how to support your unusual thesis! ",
            "date": "Answered February 27, 2018",
            "views": "13",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Ayesha Ali",
                    "user_href": "/profile/Ayesha-Ali-585"
                }
            ]
        },
        {
            "author_info": {
                "name": "Rohit Tandekar",
                "href": "/profile/Rohit-Tandekar"
            },
            "answer_text": "By following two simple rules Use the Ws - Whenever a topic is given, ask What, Why, Who, When, Where and How. Answering these questions about the topic, about every word or phrase in it will lead to multiple answers. What seemed like a narrow topic to write on, suddenly has multiple possibilities.PESTEL analysis- This is the second easiest thing to do when you have to write about anything. PESTEL stands for Political, Economical, Social, Technological, Environmental and Legal. Whenever a topic is presented to you, try to analyse it from these perspectives. It helps when the topic is broad and technical.Hope this helps! ",
            "date": "Answered February 27, 2018",
            "views": "35",
            "upvotes": " View 20 Upvoters",
            "upvoters": [
                {
                    "user_id": "All ROUND",
                    "user_href": "/profile/All-ROUND-8"
                },
                {
                    "user_id": "Ayesha Ali",
                    "user_href": "/profile/Ayesha-Ali-585"
                },
                {
                    "user_id": "Rekha Pathak",
                    "user_href": "/profile/Rekha-Pathak-48"
                },
                {
                    "user_id": "Jason Cronan",
                    "user_href": "/profile/Jason-Cronan"
                },
                {
                    "user_id": "Jaspreet Singh Gill",
                    "user_href": "/profile/Jaspreet-Singh-Gill-5"
                },
                {
                    "user_id": "Renu Gupta",
                    "user_href": "/profile/Renu-Gupta-101"
                },
                {
                    "user_id": "Prakash Singh",
                    "user_href": "/profile/Prakash-Singh-220"
                },
                {
                    "user_id": "Minisha Selvan",
                    "user_href": "/profile/Minisha-Selvan"
                },
                {
                    "user_id": "Umesh Kumar",
                    "user_href": "/profile/Umesh-Kumar-713"
                },
                {
                    "user_id": "Parul Malhotra",
                    "user_href": "/profile/Parul-Malhotra-41"
                }
            ]
        }
    ]
}