{
    "title": "How to improve my report writing - Quora",
    "tags": [
        "Report Writing",
        "Improvements",
        "Writing Advice"
    ],
    "response": [
        {
            "author_info": {
                "name": "Ben Higashi",
                "href": "/profile/Ben-Higashi"
            },
            "answer_text": "Jim's answer is fantastic already, so I'll try to address things he didn't already cover. You specifically mentioned tenses, so let's see if I can help with that. Choosing the correct tense can be difficult, mostly due to the often inconsistent rules words follow when switching to other tenses. Let's see if we can divide this into some comprehensive steps: Confirm what tense you need. Generally speaking, you're going to want to be consistent in what tense you are using throughout the entire report. Imagine if a book began telling a story in the past tense and then switched to the present tense. It would be jarring and difficult to follow, so pick one and stick with it.Write out the whole report, keeping the tense you've chosen in mind. In other words, just do what you've been doing. If you're ever unsure that you've chosen the correct word to match the tense you're using, take your best guess and just keep moving. Keeping your writing flowing is most important at this phase, and dwelling too long on a single word can interrupt your workflow and cause you to lose your train of thought.Proofread, and check all your verbs. This is the hard part, but reading out loud can clue you in to which verbs are incorrect. Admittedly there are quite a few verbs with unusual tenses, or similar sounding ones that can make things more difficult. A couple quick guidelines to past tense verbs, since I suspect those are the one's you'll be working with most frequently:-ed endings are incredibly common. Try adding ed to the end of the verb and see what it sounds like. If it ends in a vowel, note that the vowel might change and you may have to look up the spelling if you're unsure. eg. walk and walked, jump and jumped, try and tried (notice the vowel change on this one).Irregular past tense verbs. Some verbs flat out change when they go into the past tense, most commonly by changing a vowel sound. eg. sing and sang, run and ran, swim and swam. If you're at all unfamiliar with these sorts of verbs, here is an excellent list you can refer to: Past Tense Irregular Verbs ListThe best overarching suggestion I can give you to improve your writing is to read a lot. This is a very commonly given piece of advice, and for good reason. You need to familiarize yourself with good writing so you know what good writing sounds like. Earlier, I mentioned reading your work out loud; this becomes even more effective when you can recognize when something just \"doesn't sound right\". This doesn't come naturally to everyone, but it is a skill that can be learned. To this day this is the technique I use to make sure my grammar is correct. If a phrase sounds wrong, I say it out loud to myself, then through experience I can determine what the issue is and what the required fix is. This is all very rudimentary, there's much more to good writing such as sentence structure, word choice, etc. But if you start here, you'll be able to work your way towards more advanced writing techniques. Seriously though, I can't emphasize this enough. Read. Read work similar to your own. Read books. Read magazine articles. The only thing I don't suggest reading is online news stories, as I tend to find these have an abundance of typos and poor grammatical choices. ",
            "date": "Answered December 3, 2014",
            "views": "25",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Swapno Munasib",
                    "user_href": "/profile/Swapno-Munasib-1"
                },
                {
                    "user_id": "Paul Gordon",
                    "user_href": "/profile/Paul-Gordon-169"
                },
                {
                    "user_id": "Tam Bozic",
                    "user_href": "/profile/Tam-Bozic"
                },
                {
                    "user_id": "Vandy Khamsay",
                    "user_href": "/profile/Vandy-Khamsay"
                }
            ]
        },
        {
            "author_info": {
                "name": "Rob Ashton",
                "href": "/profile/Rob-Ashton-1"
            },
            "answer_text": "Great contributions here. I totally agree about focusing on the audience first. Ask yourself : What do they know already?How important to them is the document you're writing?How interested are they in it?Question 3. is particularly important and one that most people forget:  if they're not interested, you need to find a way to make them interested. There are ways to make statistics interesting. Many news stories are based on statistics. One way is to find the story in the statistics and tell that. Also, try to avoid leading with the dry number itself. Instead, generalise slightly. For example:Almost half (48.7 %) of the people we asked thought this was very important. This represents a huge increase on last year, when less than a quarter (23.2 %) did. This is just a quick example. There's a lot more on this here: Make communicating numbers as simple as 1, 2, 3 Don't worry that you find writing hard work. Most people do – they just don't admit it. As a native speaker, you already know most of the grammar you need, for example. In fact, grammar is rarely the primary issue with native speakers, other than that a lack of confidence in it often produces crippling writer's block. Ben's suggestion to read a lot is an excellent one. Don't just read the reports of your peers but newspapers, books, blogs, adverts – anything really. If, as you say, you find reading hard work, then that might be because you're reading the wrong things. (And I'd be more likely to blame the writer than you, for not drawing you in and making what they've written interesting enough.) Read stuff that you want to read. It shouldn't be a chore.  I wouldn't even council against reading blogs. Sure, the grammar won't always be perfect. But it sounds like it's more important that you read a lot than seek out stuff that is grammatically pure (whatever that is – English has been evolving ever since we started stringing the most basis of sentences together). Besides, something can be grammatically flawless yet as dull as ditchwater. ",
            "date": "Answered August 3, 2015",
            "views": "11",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Rita Mukherjee",
                    "user_href": "/profile/Rita-Mukherjee-17"
                },
                {
                    "user_id": "Tam Bozic",
                    "user_href": "/profile/Tam-Bozic"
                }
            ]
        }
    ]
}