{
    "title": "How to improve reading newspaper skills - Quora",
    "tags": [
        "Reading Skills",
        "Newspapers",
        "Skills",
        "Reading"
    ],
    "response": [
        {
            "author_info": {
                "name": "Basil Varghese",
                "href": "/profile/Basil-Varghese-29"
            },
            "answer_text": "I will explain this by some steps,just some simple steps Assume that we are reading an important section of the newspaper,ok let's say editor's 'EDITORIAL' 1)Read the headline(Caption)clearly and understand what the author is expressing 2)The first paragraph is the important portion in a newspaper,from which you would understand the content of the news (so try to understand this clearly) 3) Subsequent paragraph's elaborate/Narrate the whole incident/story…so don't think of reading it out,rather Skim out the important words.this would make you understanding clear 4)Read the conclusion part(last para) and conclude the reading 5)Now try to read the News from back to front (Optional) this would help you to understand the concept moreover,makes you an expert in reading all important news AS FAST AS POSSIBLE…… Thank you for reading, moreover don't forget to upvote… ",
            "date": "Answered February 12, 2018",
            "views": "239",
            "upvotes": " View 5 Upvoters ",
            "upvoters": [
                {
                    "user_id": "DeJuan Spencer",
                    "user_href": "/profile/DeJuan-Spencer"
                },
                {
                    "user_id": "Sandeep Kaur",
                    "user_href": "/profile/Sandeep-Kaur-628"
                },
                {
                    "user_id": "Dathatrayan Deleep",
                    "user_href": "/profile/Dathatrayan-Deleep"
                },
                {
                    "user_id": "Tony Joseph",
                    "user_href": "/profile/Tony-Joseph-149"
                },
                {
                    "user_id": "Avijit Bhattacharjee",
                    "user_href": "/profile/Avijit-Bhattacharjee"
                }
            ]
        },
        {
            "author_info": {
                "name": "Aarushi Goel",
                "href": "/profile/Aarushi-Goel-16"
            },
            "answer_text": "Reading newspapers could be a task for a few people.Not all are fond of it and majorly look for Delhi times like pages and that is it. But no worries here is how you can develop the art of reading newspaper. First, chose a newspaper that you are comfortable with in regards with the language. It will enhance your understanding of the news and will increase your interest. Secondly, start with a small part. Make it a habit by adding 10–15 min of going through the headlines and then choosing one of the news articles that interests you for a complete reading. Do not give up. Thirdly, After a week start increasing the time allotted for reading newspaper. And start reading more articles or news that are inter-related to each other for eg. work done in education sectors or Elections etc. This will increase not only your knowledge but the inter- related articles will add interest in same way the stories does. Discussions with friend and family might increase your interest and develop an urge to know more. Week after week increase the time period and you will notice developing this art of reading newspaper. Just consider it something essential and do not skip the routine. These efforts will surely pay and within a month you would start feeling the positive change in yourself in regards with the newspaper. ",
            "date": "Answered June 7, 2018",
            "views": "146",
            "upvotes": "0"
        }
    ]
}