{
    "title": "How should you email professors to ask them to let you volunteer for an undergraduate CS research position in their lab? - Quora",
    "tags": [
        "College and University Faculty",
        "Research"
    ],
    "response": [
        {
            "author_info": {
                "name": "Zen Faulkes",
                "href": "/profile/Zen-Faulkes"
            },
            "answer_text": "I recommend against volunteering for anything in academia. By volunteering, you undercut people with less money who have to do something that earns them money. Your time and skills are valuable and you should expect to be compensated in some way. Similarly, professors should not accept volunteers for those reasons. See: Zen Faulkes's answer to Should I tell a professor I can do summer research for him for free? For more: Zen Faulkes's answer to How do I email a professor from a university asking if I can do a certain research at their university? Zen Faulkes's answer to What should I write in an email to a supervisor to ask him if I can gain a PhD position? ",
            "date": "Answered July 18, 2017",
            "views": "12",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Karan Singh",
                    "user_href": "/profile/Karan-Singh-1301"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/Khamaar"
                }
            ]
        },
        {
            "author_info": {
                "name": "Shane Ryoo",
                "href": "/profile/Shane-Ryoo"
            },
            "answer_text": "Don’t email professors unless it’s okay that they never see your email. And if that’s the case, why bother? Professors get more email than just about anyone and I always went to see them in person.For the specifics in the details, working with a professor is probably not going to happen with a GPA under 3.0: those students don’t have a strong grasp of the material and almost never attend graduate school. I’ve never seen a case personally, and even a GPA under 3.7 was rare for me. One’s time is better spent making sure one understands course material.",
            "date": "Answered July 18, 2017",
            "views": "11",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Kashish Jagga",
                    "user_href": "/profile/Kashish-Jagga"
                },
                {
                    "user_id": "Jessica Su",
                    "user_href": "/profile/Jessica-Su"
                },
                {
                    "user_id": "David Friedman",
                    "user_href": "/profile/David-Friedman-1"
                }
            ]
        }
    ]
}