{
    "title": "How to write a screenplay at 17 - Quora",
    "tags": [],
    "response": [
        {
            "author_info": {
                "name": "Brady Westwater",
                "href": "/profile/Brady-Westwater"
            },
            "answer_text": "I wrote my first screenplay at the age of 17 and it was good enough my agent always used it as my writing sample since I wouldn't allow him to sell it. And the secret of my success was easy. It was an intensely personal story about a major change that had just happened in my life. A change I was still struggling to understand and when I decided to write a Western, I knew my new best friend was likely an inspiration for the lead. (I covered this in an earlier post today) But what I didn't yet understand was that every character and every plot incident was subconsciously based on other real people and real events, though not in easily understandable ways. So for your first script, I would not be worried about locations and I would recommend having it take place in an environment you are familiar with. I would then think about what was the happiest day in your life and what was the saddest day in your life. Now is a good time to try and figure out who you are and how you got that way. And also think about who wish you were more like and what you have regretted doing - or not doing -. and what you are proud of and what you are ashamed of. Now that doesn't mean that is what the script should be about, but at least it gives you some emotions and feelings when you start to write your story. And the more raw material you can mine out of your own life, the easier writing with be for you. ",
            "date": "Answered January 21, 2017",
            "views": "324",
            "upvotes": " View 6 Upvoters",
            "upvoters": [
                {
                    "user_id": "Matthew Prince",
                    "user_href": "/profile/Matthew-Prince-6"
                },
                {
                    "user_id": "B.B. Gold",
                    "user_href": "/profile/B-B-Gold"
                },
                {
                    "user_id": "Reid Butler",
                    "user_href": "/profile/Reid-Butler-3"
                },
                {
                    "user_id": "Aditya J Bidanooru",
                    "user_href": "/profile/Aditya-J-Bidanooru"
                },
                {
                    "user_id": "Brent Paxton",
                    "user_href": "/profile/Brent-Paxton"
                },
                {
                    "user_id": "Narek Margaryan",
                    "user_href": "/profile/Narek-Margaryan-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "S. Grant",
                "href": "/profile/S-Grant"
            },
            "answer_text": "Just sit down and start writing, you can look up templates or you can make a very easy one for you and your actors / crew to follow … What if you started with minimalist dialogue first then you could describe what's happening as opposed to focusing on dialogue . You can start with short films five minutes in length … play with the medium, do not let it play with you- or better yet do. Haha ",
            "date": "Answered January 24, 2017",
            "views": "86",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Letta Morake",
                    "user_href": "/profile/Letta-Morake"
                }
            ]
        }
    ]
}