{
    "title": "How to mail a letter - Quora",
    "tags": [
        "U.S. Postal Service",
        "Mail"
    ],
    "response": [
        {
            "author_info": {
                "name": "Andrew Daviel",
                "href": "/profile/Andrew-Daviel"
            },
            "answer_text": "The procedure varies slightly by country. Here (Canada), the details are online at canadapost.ca. You are supposed to use a rectangular envelope of a certain size - not too small, not too large, not too thick, and not square. You aren’t supposed to have significant enclosures. There should be a stamp of the correct value (“permanent” stamps are OK, for a letter under 30g) in the top right corner, and the correct postal address written in a machine-readable font in the middle (hand printing now works, I think), with the correct postcode. All that is so that the letter will go through the automated sorting machines correctly without being damaged, and be routed to the correct address. If you don’t do it properly, the letter will usually be delivered but may take longer with manual processing. Having done that, you can just drop it in an official mailbox (red, here). Standard letters are not trackable here. You can pay extra for a registered letter which will be trackable, but you must take that to a post office. For a package within Canada, you can pay online and print a label, to create a trackable package you can just drop in a mailbox. Similar services are probably offered in other countries. ",
            "date": "Answered August 17, 2016",
            "views": "456",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "John Lloyd",
                    "user_href": "/profile/John-Lloyd-43"
                }
            ]
        },
        {
            "author_info": {
                "name": "Thomas Rush",
                "href": "/profile/Thomas-Rush-3"
            },
            "answer_text": "Andrew has it almost all right for Canada and the US. There is no tracking for standard letters. If you want to track that you have mailed it and when it is delivered (possibly with signature by a specific individual) use certified mail, and not registered mail. Registered mail is designed for things that are of great value or not easily replaced (and costs a bunch because how it is tracked from person to person through the system). Certified mail is designed to provide proof of mailing and proof of delivery, and may optionally be insured, but is typically used for standard business documents: tax forms, legal notices, etc. Certified mail costs a few dollars, depending on whether you want a proof of receipt and signature by addressee only. In the US at least, there is also a “Proof of Mailing” that shows that you sent a letter on a particular day to a particular address, but it provides no tracking past that. This is the least expensive option. To get any of these optional services, you need to show up at a post office location during business hours (non-USPS facilities such as The UPS Store may be able to process Certified mail; I don’t know and suggest you call first) and work with a clerk to make sure you are correctly filling out the right forms for what you need to do. ",
            "date": "Answered August 17, 2016",
            "views": "457",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Emily Ash",
                    "user_href": "/profile/Emily-Ash-3"
                },
                {
                    "user_id": "Diane Trochelman Busch",
                    "user_href": "/profile/Diane-Trochelman-Busch"
                },
                {
                    "user_id": "John Lloyd",
                    "user_href": "/profile/John-Lloyd-43"
                }
            ]
        }
    ]
}