{
    "title": "How do romantic relationships develop? - Quora",
    "tags": [
        "Romantic Relationships",
        "Love and Relationship Advice",
        "Romance (love)",
        "Dating and Relationship Advice",
        "Love Life Advice",
        "Love",
        "Relationship Advice",
        "Dating Advice"
    ],
    "response": [
        {
            "author_info": {
                "name": "Eric Erickson",
                "href": "/profile/Eric-Erickson-27"
            },
            "answer_text": "How do romantic relationships develop? Hopefully, they develop slowly, for it requires the passage of time for True Love to develop and grow into its full potential, even among soul mates. When we meet someone who is right for us they present us with a “whole package”, just as we do for them. By this I mean that one’s soul mate has just the right mix of physical and psychological qualities that we are seeking both consciously and unconsciously. When we meet such a person we are initially attracted to them by Romantic Attraction, however, in this case there is also “something more” going on which is above and beyond our other dating experiences. This “special something” is the beginning of the higher bond of True Love. As I indicated above, Real, True Love takes some time to grow and mature even among soul mates. However, there is always something completely new and special about such a relationship that differentiates it from all of one’s previous experiences. So far I’ve been describing how a relationship should develop; now let’s talk about the course they usually take. When two psychologically healthy people get together who do not possess enough Positive Commonality* to allow them to mutually move beyond the stage in which their respective ego defenses hold all others at bay their relationship or marriage is destined to be a mediocre one. Such a couple’s initial attraction will be confined to Romantic Attraction alone which will last long enough for them to begin an emotional bond. But such a bond will be limited to Apparent Love which, as you may recall, is transacted almost entirely between the ego defenses of the couple. Apparent Love is frequently accompanied by powerful emotions and it often hurts like hell when it is lost simply because one’s ego is so wrapped up in it. *Positive Commonality refers to partners holding both “positive” interests and “negative” traits in common (something soul mates do naturally). Actually, it is more important to long term togetherness that a couple hold the “negatives” in common than it is that they share more “positive” interests; after all, we all like to have fun, whereas, “negative” opinions, behaviors and prejudices, when not commonly held, might have been easier to overlook at first than they may be as time passes. Since Apparent Love is based on each partner’s idealized self-images, exaggerated expectations and petty desires it is usually shallow, vain and brittle, however, it is an emotional bond and the pain associated with its loss can be severe because one’s ego identity is so completely wrapped up in it. This loss of ego centered pettiness accounts for the bitterness found in so many divorces. Sadly, Apparent Love is the only “love” many people will ever know simply because they never took the time to discover what went into making a great relationship and then seeking out someone who was right for them, rather than settling on someone who would only bring them misery. Now you know a little about how romantic relationships, both good and mediocre, develop. Judging from the amount of failed relationships in today’s world, and their attendant misery, few people possess this information and it would seem than many do not wish to know such things, which is truly a pity. Note: I apologize for the amount of time it took me to answer your question. My feeble excuse is that I took a ten day vacation and, as a consequence, I fell way behind in my answers. Best of Luck, Eric ",
            "date": "Updated March 5, 2018",
            "views": "144",
            "upvotes": " View 30 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Kimberly Adams",
                    "user_href": "/profile/Kimberly-Adams-262"
                },
                {
                    "user_id": "Myla Chatoy",
                    "user_href": "/profile/Myla-Chatoy"
                },
                {
                    "user_id": "Ronda Gail Stoller Wunsch",
                    "user_href": "/profile/Ronda-Gail-Stoller-Wunsch"
                },
                {
                    "user_id": "Domagoj Bilandžija",
                    "user_href": "/profile/Domagoj-Bilandžija"
                },
                {
                    "user_id": "BHIMA SAHOO",
                    "user_href": "/profile/BHIMA-SAHOO-2"
                },
                {
                    "user_id": "Toroe Fields",
                    "user_href": "/profile/Toroe-Fields"
                },
                {
                    "user_id": "Al Mutiri",
                    "user_href": "/profile/Al-Mutiri"
                },
                {
                    "user_id": "Kiara Angeles",
                    "user_href": "/profile/Kiara-Angeles"
                },
                {
                    "user_id": "Kevin Mikhail Estandarte",
                    "user_href": "/profile/Kevin-Mikhail-Estandarte"
                },
                {
                    "user_id": "Claudia Pom",
                    "user_href": "/profile/Claudia-Pom"
                }
            ]
        },
        {
            "author_info": {
                "name": "Sam Kaplan",
                "href": "/profile/Sam-Kaplan-1"
            },
            "answer_text": "First, stop overthinking. If you have any friends at all, this is no different. If you do not have any friends, that is a separate but related problem you should address first. Second, be yourself, your best self. You will not be able to hide who you are very long so do not start a friendship of any kind based on a masquerade. Be clean, wear clean clothes, be yourself.Third, start looking around at the people around you. Are any of them attractive? Are any of them someone you would like to get to know better? If not, you need to go someplace where you might find someone like that. Go where people who share your interests, whatever they may be, are likely to be found, either in a real space or a virtual space.Fourth, invite someone for coffee—unless you are a practicing Mormon. The virtue of coffee is not only that we are filled with coffee shops, but unlike most dates, it provides an opportunity to get to know one another better. And, engage in active listening—your job is to find out who the person is behind the public mask, and that takes time and trust, and it will require active listening on your part—google it, if you are not familiar with that term.Fifth, if the person you are with is someone you would like to spend time with—tell them that—that you would like to get to know him/her better. And watch for the reaction. You will see in the face whether that it something that brightens or concerns. Remember: the goal is not to “start a romantic relationship” but to find someone whose company is so enjoyable to you and who feels the same so that not being romantically involved is unthinkable. ",
            "date": "Answered August 12, 2016",
            "views": "46",
            "upvotes": " View 19 Upvoters",
            "upvoters": [
                {
                    "user_id": "Tiffanius Smily",
                    "user_href": "/profile/Tiffanius-Smily"
                },
                {
                    "user_id": "Ronda Gail Stoller Wunsch",
                    "user_href": "/profile/Ronda-Gail-Stoller-Wunsch"
                },
                {
                    "user_id": "MANAVJEET HANS",
                    "user_href": "/profile/MANAVJEET-HANS"
                },
                {
                    "user_id": "AlliKay",
                    "user_href": "/profile/AlliKay"
                },
                {
                    "user_id": "Eliezer Mishulovin",
                    "user_href": "/profile/Eliezer-Mishulovin"
                },
                {
                    "user_id": "Alinzmen",
                    "user_href": "/profile/Alinzmen"
                },
                {
                    "user_id": "Kiara Angeles",
                    "user_href": "/profile/Kiara-Angeles"
                },
                {
                    "user_id": "James Iwata",
                    "user_href": "/profile/James-Iwata"
                },
                {
                    "user_id": "Kevin Mikhail Estandarte",
                    "user_href": "/profile/Kevin-Mikhail-Estandarte"
                },
                {
                    "user_id": "Georgina Denis",
                    "user_href": "/profile/Georgina-Denis-1"
                }
            ]
        }
    ]
}