{
    "title": "How much does a good ghostwriter charge? - Quora",
    "tags": [
        "Ghostwriting",
        "Writers and Authors"
    ],
    "response": [
        {
            "author_info": {
                "name": "Jake Mcspirit",
                "href": "/profile/Jake-Mcspirit"
            },
            "answer_text": "There are a number of factors at play here: Ghostwriting means that the person gets no referral work out of his/her contribution. This needs to be reflected in the price. A successful writer needs to be actively marketing themselves regularly to ensure a steady flow of work, ghostwriting does not alleviate this pressure. In fact, it adds to it.Your workload sounds intensive and big. It's a large time-investment for nothing but what you pay in return. They'll lose significant marketing hours in all likelihood.They won't be able to juggle any other large projects while they work with you. This may mean missed opportunities for them. A good ghostwriter knows this.So, when all is said and done, there's no set rate for a good ghostwriter. They'll likely tell you a price, because they know what your project is costing them elsewhere. Personally, considering it's fiction, I'd be asking for a set rate per either: PageChapterProjectThis is because I'm a writer that values client satisfaction. If I wanted to milk you for money, I'd set a per-word rate and add in fluffy words here and there. Worth noting. To give an accurate estimation of what I'd likely charge, I'd have to know the size you had in mind per novella. But, for a rough idea, I'd probably hazard a guess at every 10,000 words costing somewhere in the ball park of $1000-2000. Depending on the intensity of the pieces. I consider my rates fairly low compared to my mentors and peers too, so don't be too shocked if they quote you more than that. But that's for a good ghostwriter.  If you want an okay one that may produce what you need without needing to hire another 2-3 editors to fix the initial and each other's mistakes, head to a content mill! In all honesty, I can see a project like that being significantly cheaper for an initial write on a content mill. But the quality is rarely ever worth it, in my experience. (When I wrote for content mills -- not for long may I add -- I wrote subpar quality writing. Not because I wanted to, but because I was busting my ass.  Taking on projects at that low of pay for the sheer volume they asked for? Giving too quality work just wasn't possible. Things were rushed for me to get by.) Hope this helps! ",
            "date": "Answered January 4, 2016",
            "views": "27",
            "upvotes": " View 8 Upvoters",
            "upvoters": [
                {
                    "user_id": "Zarine Arya",
                    "user_href": "/profile/Zarine-Arya"
                },
                {
                    "user_id": "Wriety Sheep",
                    "user_href": "/profile/Wriety-Sheep"
                },
                {
                    "user_id": "Sharon Turnoy",
                    "user_href": "/profile/Sharon-Turnoy"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/QUEENIE-38"
                },
                {
                    "user_id": "Pamela May",
                    "user_href": "/profile/Pamela-May"
                },
                {
                    "user_id": "Chaundra Sierra-Carmona",
                    "user_href": "/profile/Chaundra-Sierra-Carmona"
                },
                {
                    "user_id": "Sahra Luke",
                    "user_href": "/profile/Sahra-Luke"
                },
                {
                    "user_id": "Sarang Sarage",
                    "user_href": "/profile/Sarang-Sarage"
                }
            ]
        },
        {
            "author_info": {
                "name": "Wayne Allen Sallee",
                "href": "/profile/Wayne-Allen-Sallee"
            },
            "answer_text": "It is good that you asked the question here and didn't talk to a big publishing house in NYC that has an address that is really a PO Box. They'll take $10,000 from you and then pay the ghostwriter $2500. That seems to be the going rate. This is for a novel, which is usually 400 pages. Ghost writers will get paid for every 100 pages completed. I understand you want to write novellas, you can assume that three novellas might constitute the length of a book. I  can't agree with what Jake McSpirit said more. Ghostwriting is not a side job. It is a paid job and must be treated as such. There will be people that will tell you they are involved in many projects and have deadlines with CAT FANCY and SLATE and MYSTERY SCENE. Some might. Others might be handing you BS, they are writers, but aren't necessarily juggling plates. Once you correspond with a few, you'll probably know who's telling you what. The other thing is, when I ghostwrote three novels, the novels were already completed. I wasn't given pages with a vague outline. The Author knew that I could change the story to make it more vivid, correct obvious errors (if someone starts a fire in a new office building, a smoke alarm should go off), stay in touch with the Author regularly by email or by phone, and if the Author wants additional changes, the ghostwriter should be paid an additional fee. Professional writers aren't checking Craigslist for high-paying gigs. If someone offers an amount, that's not how it works. The ghostwriter dictates the price, and that is not to say that something couldn't be worked out. In all honesty, if you want a ghostwriter to write your romance novellas, well...why wouldn't they just write them, put his or her name on them, and then have his or her agent sell them? YOU have to write them, at least in part. The character names, the location, the basic plot. The more a ghostwriter has to actually DO, the more he or she will CHARGE.  If someone tells you otherwise, then they are not a professional ghostwriter. Thanks for the A2A. Good luck. ",
            "date": "Answered January 4, 2016",
            "views": "2",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Fluffy Baboon",
                    "user_href": "/profile/Fluffy-Baboon"
                },
                {
                    "user_id": "Zarine Arya",
                    "user_href": "/profile/Zarine-Arya"
                },
                {
                    "user_id": "Sharon Turnoy",
                    "user_href": "/profile/Sharon-Turnoy"
                },
                {
                    "user_id": "Sahra Luke",
                    "user_href": "/profile/Sahra-Luke"
                }
            ]
        }
    ]
}