{
    "title": "How to build a convincing fictional world - Quora",
    "tags": [
        "Fiction Writing",
        "Fiction",
        "Creative Writing",
        "Literature"
    ],
    "response": [
        {
            "author_info": {
                "name": "Xingtian Yi",
                "href": "/profile/Xingtian-Yi"
            },
            "answer_text": "When worldbuilding, there are many ways and everyone will end up doing it a bit differently. Different people will want to focus on different things, arrive at different outcomes and use different means to get to outcomes, but there are a few things that can make a fictional (fantasy) world convincing. Realistic and interesting cultures and ethnicities When worldbuilding for a fantasy world you want to have realistic cultures and interesting cultures. There have already been thousands of “Medieval Europe but with dragons” fantasy worlds, and they can be interesting, but they are commonly just caricatures of Medieval Europe, mixed with some magic and dragons. This generally makes no sense. If there are dragons, why are there still knights and why is military technology similar to that of medieval Europe when much of medieval European technology would be useless against a dragon? If there are dragons, then castles would provide little defence or strategic importance when your opponent has a dragon.  (If you hold yourself in a castle to fight a dragon, then you might as well hide from a hungry cannibal in an oven). When looking at making cultures, you can make them in a few ways. Firstly, you can start with a few big themes and ideas. For example, maybe you want the setting to be like medieval Europe and for the culture to be similar to that of medieval Europe, but you also want there to be dragons and magic. Then maybe you include some magic that makes castles impervious or easier to defend against dragon fire. And maybe you can make dragons a large aspect of the culture, maybe people worship dragons or being able to hunt and slay a dragon is seen as a massive honour and maybe even as a coming of age ritual? Basically, you have a brief outline of what you want the culture to be like, then you can work with it in the setting. Or maybe, for ultimate realism, you base the culture off the setting. Maybe, using a setting with dragons as an example, you want a way for humans to exist in the same world as a super apex predator. Then to make it realistic, humans might live near water where they could recover from or negate the effects of dragon fire and maybe they live in semi-nomadic societies which move according to dragon migration schedules. Both of these formulas, basing the culture off a few big ideas or building the culture from the bottom up, based on the surroundings and environment, can be interesting ways to create realistic cultures. This answer shows step by step how I designed the clothing style for a culture in one of my worldbuilding projects. It went into as much detail as possible and I showed each step, it might be helpful to read. Xingtian Yi's answer to How do you decide the types of clothes a culture wears in a fantasy setting? Society and social hierarchies When creating a realistic fantasy world, the societies in it should have social hierarchies. Traditionally, in most societies, one group of people has always had some kind of higher standing over others. In India there were caste systems, in many cultures men had a higher standing than women, in most large countries, certain ethnic, racial or religious groups have a higher standing than others (cough cough the US). When designing a country in a fantasy world, it is important to have some sort of hierarchy in it, in order to make it more realistic. This also brings me to the next point… Diversity and differences In the real world people can be very distinct, even in a single country. Using the US as an example, someone from Seattle is going to be very different from a person in Florida. Or in China, someone from Beijing is going to be very different to a person from Hainan. Especially in large countries, people in different regions, even if they are part of the same ethnic group, will be fairly different. This is even more noticeable when they are from different ethnic groups. Look at Russia, the Russians are different to the Tuvans when it comes to culture, religion language and even race. When you are designing a fantasy world, it is a good touch to make the people in a country district from each other. Some people will be more traditionalist and orthodox, some people will embrace new trends and defy tradition, people will be parts of different subcultures and social groups. If you are designing a large empire or large fantasy country, it is more realistic if it is controlling over some distinct ethnic groups. This is especially important and prevalent near border regions. Maybe border regions were conquered by an expanding empire, in which case they may be very ethnically distinct to the rest of the empire. But even if they aren’t conquered, border regions will have more trade and cross-cultural interaction. A real world example of this is the border between France and Germany. In France there is a city called Strasbourg. This name is fairly unique when it comes to Romance languages, infact, the name Strasbourg comes from Germanic languages. The same thing happens in the German city of Cologne. The origin of the name Cologne came from the latin word Colonia. The same exists for people groups in border regions. In Ukraine, the areas closer to the Russian border have more ethnic Russians,  This is due to migration, immigration, forced migration and centuries of mingling, war and occupation. So take this into account when designing countries and borders in your fantasy world, have the culture, dialect/accent and even the people group be different near the border regions. Countries and how they are structured It is also useful to think about how countries are organized. Is there a feudal system like in medieval Europe? Or is there a centralized system of governance? Or maybe the world is just filled with hunter gatherer tribes? When outlining the system of governance and the way society is run in your fantasy world, or in the kingdoms/countries in it, you should think about why they would have this type of system. Feudal systems largely rose out of a lack of ability for easy communication. For the entire country, of say, England, to be solely governed by one person in one city, back in the Middle Ages, would have been impossible. Communication took a long time and was less reliable. It would be easier for a local lord to give orders than for a far away king to do them. It would make communication easier and thus, make governing easier. So if your fantasy world has magic which allows for easy communication, it might not have a feudal system. Much like culture, base your societal structure and system of governance off of the world which it is set in and base it off the history of the region and the world. For example, Westeros in GOT was split into 7 “kingdoms” and 2 other separate entities.  The kingdom’s of Westeros, plus Dorne and the Riverlands, were really more of Feudal Fiefdoms than kingdoms. But there was a reason for it. Back in the early days, before the Targaryens took over, Westeros was split into many different countries with different cultures and ethnicities. When the Targaryens took over and unified Westeros, they struck deals with many of the kings to allow them to keep the position of a lord. Thus, the country was separated into the semi-autonomous ‘kingdoms’. This makes sense based on the history of Westeros which makes it convincing. Economics and politics How does the politics in your world work, how do your economic systems work? If a city is large and rich, why? Does it lie on an important trade route or have some tactical advantage? The same goes for a country or an empire. How does it expand? Are the neighbouring regions falling apart? Is the empire in control of important resources? Did it rise and expand because of wise political moves and decisions? Power within a country will also be determined partially by economics. The lords with power probably have that power because they control massive amounts of resources or have some political leverage. Using Game of Thrones as an example, the Lannisters are rich and powerful because they have rich gold and mineral mines. The Reach is by far the richest kingdom as it has lots of fertile farmland which exports crops and the Tyrells are the richest house in the reach because they are at the top of the social ladder, they receive vassalage and tax money. When designing the countries in your fantasy world, think about where the power lies and why. (This section is very interconnected with society and social hierarchies section). How countries interact and expand The way that countries interact will determine quite a bit in your fantasy world and it is built off everything else. If two similarly powered countries both have resources the other wants, they will be friendly, trying not to disrupt trade, until they can get the upper hand. If a small country has resources a big, powerful country needs or vice versa, then the large country might try to annex, control or even puppet the smaller country, to get control and access to the resources. Maybe two expanding empires are brought into conflict as they want to expand into the same regions. If two countries need to defend against an expanding empire, they might work together and make a political marriage to create an alliance. My point is, foreign relations are important to create a sense of realism in a fantasy world. Also foreign relations are complex and it is useful to understand the reasons behind them in order to create a realistic and convincing world. Have/make realistic settings and geography Maybe your characters are on a journey, and they are walking through the grasslands when suddenly the flat expanse is blocked by steep mountains. Well, that’s not generally how mountains work. The area between grasslands and mountains, or any kind of biome/ecosystem, will be some kind of transition area. Forests won't immediately stop and make way for desert, or at least generally won't (there are examples of this but it’s largely because of things like climate change and deforestation). Between forest and desert, the forests will generally thin out and become more like grasslands, and keep thinning out until there aren’t any more and the land will become grainier and sandier until there aren’t any trees and there isn’t much more grass. Biomes change gradually (most of the time) with transition areas between them.  Nice try Minecraft but that’s not how it works. When designing ecosystems and biomes in your fantasy world, make sure that you include slow transitions. Conclusion So, those were some important things to keep in mind when you design (world build) a fictional world. It isn’t foolproof and there is always room to make mistakes, but focusing on and trying to make these aspects of your world realistic and detailed will be useful in creating immersive, convincing and realistic fictional worlds. ",
            "date": "Answered August 28, 2020",
            "views": "12",
            "upvotes": " View 29 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Zeru Apod",
                    "user_href": "/profile/Zeru-Apod"
                },
                {
                    "user_id": "Allen Smith",
                    "user_href": "/profile/Allen-Smith-695"
                },
                {
                    "user_id": "Luna Marich",
                    "user_href": "/profile/Luna-Marich"
                },
                {
                    "user_id": "Gabriel Evans",
                    "user_href": "/profile/Gabriel-Evans-57"
                },
                {
                    "user_id": "Trevor Smith",
                    "user_href": "/profile/Trevor-Smith-410"
                },
                {
                    "user_id": "David Rupp",
                    "user_href": "/profile/David-Rupp"
                },
                {
                    "user_id": "Gary Papa",
                    "user_href": "/profile/Gary-Papa"
                },
                {
                    "user_id": "Timothy Soderman",
                    "user_href": "/profile/Timothy-Soderman"
                },
                {
                    "user_id": "Wagner Jose Gertrudes",
                    "user_href": "/profile/Wagner-Jose-Gertrudes"
                },
                {
                    "user_id": "Mayukh Khasnobis",
                    "user_href": "/profile/Mayukh-Khasnobis"
                }
            ]
        },
        {
            "author_info": {
                "name": "Richard Jones",
                "href": "/profile/Richard-Jones-138"
            },
            "answer_text": "First, I’ll state the following to avoid accusations of self-plagiarism: I have answered similar questions before and will inevitably be recycling a few points. Here they are: Do you have any tips in regards to creating a very detailed fantasy world? Mainly including magic, myths, laws, government, etc. Can you create a fantasy race for every single civilization on Earth (e.g., orcs-Mongols)? Is it alright to have ancient armies of different times existing together side by side (for example, Templar Knights existing alongside Spartans) in a fantasy setting with each army granted with a magical ability? Is there a limit to world building? I’m assuming you want a fantasy world rather than just a fiction setting in the real world. Here are some tips. Geography As stated before, some wargamers use this to create a detailed world: Another method is that used by Neville Dickinson when he chose to set up a continent of his own. With the typical craftiness that has won him so many battles, Neville proceeded to collect a number of holiday brochures of such places as the Isle of Man, Northern Ireland, Jersey, Guernsey, Luxembourg, and Corsica, and used the outlines of these to form various countries of his continent. by grouping them together, and filling in little independent duchies to take up blank spaces between them, he soon had the outlines of all his countries drawn in on his map. Similarly, rivers were taken from local Ordnance Survey maps, while the coast-lines of such countries as Norway and Sweden were utilised to give his sea-coast. This sort of thing is within the scope of anyone- and can be fun to do as well. Thank you, Tony Bath. He also gave this method for terrain, working on the assumption that you’re a gamer using a hex map:  Having made your outline map, you now need to add terrain to it.. There are various ways of filling in the required details… One method is to throw two dice for each hexagon; a score of 2 gives Hills and Woods, 3 Hills, 4 Woods, 5 Open Country, 7 Hills, 8 Open Country, 9 Open Country, 10 Hills, 11 Woods, 12 Hills and Woods. Should a double be thrown (i.e two 3s, 2 4s etc) toss again, and if a second double is thrown then the hexagon is extreme of its kind- for example, Hills would become Mountains and Woods, Thick Forest. Of course, Bath points out that not everything can be random as you must be realistic. Therefore, make a mountain chain look the part, and make sure rivers & lakes fit geographical rules. Bath also has tips for settlements, population, and roads. Please note that he’s doing this with an ancient-medieval world in mind and that he himself points out that later periods will need slightly different rules. His rules say that you should throw a die. On open terrain, 4+ gives a settlement, hilly or wooded 5+, and mountainous or forested 6. You’ll need to use judgement for this to achieve a balanced and realistic population, but here’s the next step: 6 City, 5 Town, 4 Village, 3 Hamlet, 2 Castle, 1 Farm. Further, what is the average population? This requires a lot of dice based on whether you want cities to average several hundred thousand, or less than a hundred thousand: The answer will decide how many dice you throw for each location; the more dice, the more people. Six dice will give you pretty large populations; one dice will give pretty small. Average it out to suit yourself. Having decided on the number of dice, throw that number for each habitation, multiply by 5 for a farm or castle, ten for a hamlet, one hundred for a village, one thousand for a town, ten thousand for a city. Thus a score of say 15 would give a population of 75 for a farm or castle, 150 for a hamlet, 1500 for a village, 15000 for a town, 150000 for a city. After you name everything (do what you like), then add roads, bridges, and fords. In later times, you may also add railways. This affects travel, so have main and lesser roads. I’m not going to go into actual wargaming rules, but Bath gives this guide for movement for infantry, which could account for a large force. One person on their own may move at a different speed: On a First Class Road, infantry move 4 hexes per week, and then subtract one as it gets worse (2nd Class, Country, Desert or Mountain). He also suggests that American Civil War trains move 3 times faster than cavalry when taking into account loading & unloading, breakdowns, and the relative infancy of railways. At their fastest, cavalry move 6 hexes, so an 1860 train moves 18 hexes per week. Religion For my own fantasy work, I’ve been considering the religion of the Greek mathematician Pythagoras:  Yes, this was the same person who popularised Pythagoras’ Theorem. Whatever you do, remember these: Religion makes great excuses for everything, such as holy warsReligion can help & hinder government.In medieval Europe, Church members (e.g monks, nuns, and priests) tended to be more educated than most people and so received some intellectually demanding tasks like record keeping and accounting.One of Bath’s players, Ed Smith, set up an entire framework of bishops, priests, and missionaries for use as an illicit communications network.Economics Bath used the currency ‘crown’ as he wanted a wargame with a simple monetary system rather than having to keep track of exchange rates on top of the other paperwork. Overall, the gold crown was worth 100 silver crowns, which was 100 bronze crowns. This is what terrain may produce: Cultivated ground (produces crops- basics for food & clothing) 1000 gold crowns per annumRiver banks (water supply supports farming, and also has fishing and hunting) 1200 gold crowns per annumCoast lines (a lot of fishing) 600 gold crowns per annumPlain (wheat, cattle, horses) 800 gold crowns per annumForest & woods (the thickness affects the value of hunting, which could be large or small animals) 500 gold crowns per annumHills (hunting and sheep but poor crops) 600 gold crowns per annumMountains (some hunting, low food resources, possible mineral sources) 400 gold crowns per annumYou also have mines. The terrain also affects what the people are like, so areas notable for horses (e.g plains) could train faster, while hunters and people from the hills make excellent light infantry (can navigate difficult terrain better). Also, in ancient-medieval worlds, factories are often near their sources of raw materials, which could affect what your characters have. Attracting skilled workers will be important. Water Again, Bath’s tips focus on simulating conflict. Generally, early ancient ships are tied to the coastline as they were difficult to live in, Carthaginian-era ships were not tied to the coast, most ancient-medieval warfare centred around boarding (though they used other weapons like ramming and fire), and that oar-powered galleys remained in use all the way into the 16th century. (By the way, while some cultures used slaves to row, many Greek states did not and the rowers were perfectly free soldiers). Also, if there is a storm, lessons shown from the Punic Wars and the decline of the Minoans suggest that staying at sea is safer than being near a lee shore due to the possibility of being driven onto rocks. I should also point out that according to sources from the National Maritime Museum, Greenwich, most sailors in Nelson’s time were generally healthy, eating fruit and being in peak condition, and most of them were not dragged off the street at random. Also, discipline was not a problem- even mutineers protesting at poor wages still accepted floggings from mutineer warrant officers. Conclusion That’s my tips for geography and society. I’ve restricted this as I’ve already written about cultures, myths, government types, and laws. I hope this helps, whether you are designing a novel series or a game. ",
            "date": "Answered September 9, 2018",
            "views": "13",
            "upvotes": " View 4 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Ryan Monahan",
                    "user_href": "/profile/Ryan-Monahan-14"
                },
                {
                    "user_id": "Ronald Rodríguez",
                    "user_href": "/profile/Ronald-Rodríguez-2-1"
                },
                {
                    "user_id": "Juan Suarez",
                    "user_href": "/profile/Juan-Suarez-143"
                },
                {
                    "user_id": "Camila Grace",
                    "user_href": "/profile/Camila-Grace"
                }
            ]
        }
    ]
}