{
    "title": "How to write an introduction for an essay on gun control - Quora",
    "tags": [
        "Essay Writing",
        "Gun Control in the United States of America",
        "Essays"
    ],
    "response": [
        {
            "author_info": {
                "name": "Peter Moss",
                "href": "/profile/Peter-Moss-37"
            },
            "answer_text": "It depends on what you want to represent in more ways than one. Gun control represents oppression and has been used for that purpose extensively. In the last century governments disarmed citizens and murdered 262 million. There is an argument by gun control organisations that gun control somehow also represents citizen safety. Gun control have built a complete mythology around this ideology that gun control offers citizens safety. It is difficult to comprehend for two reasons. Removing guns from the victims of crime (citizens) can hardly make them safer. Guns do not and cannot control people making them do anything or cause crime in any way as gun control claims. Without a causal reason gun control is blanket arbitrary and capricious in oppression of citizens on any pretext that can be found. More often than not based on fear rather than any sound reason. Gun controls research is huge and extensive in the quest to find valid evidence of a gun control success. The mechanism, fraud, lies, selection, omission and manipulation of data, methods and substitutions is a revelation on its own. Some researchers are legendary in the fraudulent nature of their work. Dr Arthur Kellmann then of the CDC was referred to as the Teflon doctor as gun control regurgitated his fraudulent work (43 times more likely) so many times from the ashes of complete annihilation of any value it had. More recently the CDC commissioned an evaluation of its own own work in an effort to remove the congressional restriction on producing gun control propaganda. It failed to show any of the extensive research and laws had any success. Insufficient evidence found from every gun control publication and law to show a single success. Gun control now represents this restriction of the CDC producing propaganda as hampering valid research. To gun control propaganda is valid research. Possibly your choice is simply fact or fiction. ",
            "date": "Answered May 16, 2018",
            "views": "13",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Derek Hak",
                "href": "/profile/Derek-Hak"
            },
            "answer_text": "Generally an introduction is the buildup to a thesis, where you outline your paper. Depending on your views on gun control, you'd likely want to build with statements supporting your claim. As you get to the thesis, address the other argument, and then go into your reasons that you'll later expand on in the essay. As a person who doesn't care for gun control, I would write an introduction like such, “Gun control is one of the many divisive issues in the United States, controversially embedded in the Constitution, and it isn't the right solution to our problems. While America does indeed have leading amounts of gun-related violence, these incidents are still a very low volume to the US population, gun control tends to address things that aren't issues in the first place, and gun control is commonly a very emotional topix from either side, making it an ineffective argument.” I would then go into the claim I listed and the reasons in the following paragraphs. ",
            "date": "Answered March 6, 2017",
            "views": "31",
            "upvotes": " View 9 Upvoters",
            "upvoters": [
                {
                    "user_id": "John Wahlquist",
                    "user_href": "/profile/John-Wahlquist-1"
                },
                {
                    "user_id": "Eyob Berhe",
                    "user_href": "/profile/Eyob-Berhe"
                },
                {
                    "user_id": "Cade Riddle",
                    "user_href": "/profile/Cade-Riddle"
                },
                {
                    "user_id": "Mary Nelson",
                    "user_href": "/profile/Mary-Nelson-4"
                },
                {
                    "user_id": "Sam Wiegand",
                    "user_href": "/profile/Sam-Wiegand-1"
                },
                {
                    "user_id": "Herb Martin",
                    "user_href": "/profile/Herb-Martin"
                },
                {
                    "user_id": "Dallas Herrmann",
                    "user_href": "/profile/Dallas-Herrmann"
                },
                {
                    "user_id": "Matthew Cantrell",
                    "user_href": "/profile/Matthew-Cantrell"
                },
                {
                    "user_id": "Philip Peterson",
                    "user_href": "/profile/Philip-Peterson-8"
                }
            ]
        }
    ]
}