{
    "title": "How to write a screenplay - Quora",
    "tags": [
        "Creating Writing Advice",
        "Screenwriting",
        "Creative Writing",
        "Movie Production",
        "Hollywood",
        "Writing Advice",
        "Bollywood",
        "How-to Question"
    ],
    "response": [
        {
            "author_info": {
                "name": "Sean Hood",
                "href": "/profile/Sean-Hood"
            },
            "answer_text": "That's a big question, so I'll have to do a lot of referencing of other Quora answers. Here are the steps you should take:  Read Great Screenplays. You wouldn't try to write a novel without reading one first. You wouldn't try to design a building without checking out some architectural blueprints. So, start by reading some classics in the screenwriting craft. See: Which screenplays should aspiring screenwriters read?Learn Screenplay Techniques from books and blogs. A lot of very successful screenwriters have had a lot to say about the craft. See:What are the best books, blogs, and online references for screenwriting or script-writing?Gather ideas. See The Bucket: http://genrehacks.blogspot.com/2008/12/bucket.htmlImagine your \"story.\" Don't start your screenplay until you have a clear idea of what a \"story\" is in general, and what your story is in particular. See: What is the best theory of story structure for screenwriting, and why?Get Screenplay software. See: What is the best software for scriptwriting?Do an outline. In junior high, your English teacher taught you never to start writing without a plan. See: Do you have to have a beat sheet for your script?Write a first draft.  Commit to about 15 pages a week, and start typing. See: On average, how long does it take to write a movie script?Get Feedback. Whether you get feedback in a class, a workshop, a writers group, or from fellow filmmakers, feedback is essential in this collaborative art. See: If I am the \"auteur\" how can other people's feedback on my film or script be important?Rewrite. The first draft wasn’t perfect? The first draft is too long, too convoluted, and too confusing? That’s okay; so was the first draft for Chinatown, widely considered one of the best scripts ever written. Use all the feedback and notes you gathered in step 8, make a new outline, and start rewriting. A wise writer once said, \"All writing is rewriting.\"Go to step eight. Repeat until the movie premiers or the script is abandoned.You may also want to look at:  What are some basic tips for writing a screenplay for the first time? What advice would you give to someone pursuing a career as a screenwriter? My brother is exploring a career in screenwriting. What advice would you give him? What books and resources should he read? How should he go about breaking into the industry? How can Quora be used for writing a screenplay? How do I sell a screenplay?Lastly, I have two bits of advice.   Enjoy the process. Screenwriting can be a lot of fun. Don't let unrealistic expectations, perfectionism, or writers' block kill the joy.Don't expect it to be easy. Playing the trumpet, throwing a curve ball, or rebuilding a car engine, all take time and practice. Malcolm Gladwell suggested that mastery of any skill requires about 10,000 hours of concentrated and focused effort. Screenwriting is no different.",
            "date": "Updated June 16, 2011",
            "views": "52",
            "upvotes": " View 67 Upvoters",
            "upvoters": [
                {
                    "user_id": "Ashish",
                    "user_href": "/profile/Ashish-1848"
                },
                {
                    "user_id": "Lamarr Lewis",
                    "user_href": "/profile/Lamarr-Lewis"
                },
                {
                    "user_id": "Oxana Kamberri",
                    "user_href": "/profile/Oxana-Kamberri"
                },
                {
                    "user_id": "Joseph Nelson",
                    "user_href": "/profile/Joseph-Nelson-23"
                },
                {
                    "user_id": "Shivam Gupta",
                    "user_href": "/profile/Shivam-Gupta-1466"
                },
                {
                    "user_id": "Kiran Narendan",
                    "user_href": "/profile/Kiran-Narendan"
                },
                {
                    "user_id": "Angel Torres",
                    "user_href": "/profile/Angel-Torres-253"
                },
                {
                    "user_id": "Nandakishor M",
                    "user_href": "/profile/Nandakishor-M-2"
                },
                {
                    "user_id": "Partiban Achari",
                    "user_href": "/profile/Partiban-Achari-2"
                },
                {
                    "user_id": "Shankar Pandalai",
                    "user_href": "/profile/Shankar-Pandalai"
                }
            ]
        },
        {
            "author_info": {
                "name": "Matt Burwood",
                "href": "/profile/Matt-Burwood"
            },
            "answer_text": "It's all about self discipline. The advice which has helped me the most is learning to separate writing into 2 stages -   Generating a 'bucket' of ideas.Analysing them and actually doing the writing.Also recognising that anxiety inhibits creativity, so trying to keep yourself relaxed. The Wrong Way to Write What most people start off by doing is sitting there staring at a blank page, trying to do all of the above at once (probably without having done enough or any research). Naturally they will struggle to think of anything to write, which makes them more and more frustrated and anxious, which inhibits creativity. It's a vicious cycle. The Right Way Creative ideas will flow best when you're relaxed and not analysing. When you're generating ideas don't think about how they fit into the story, or even whether they're good. If you're starting to get stuck, set yourself little mini-tasks to solve the problem you're stuck with. For example - \"think of 20 possible main characters for my story\" or \"think of 20 possibilities why my character might want to rob this bank\". Write down any idea no matter how bad or silly you may think it is... analysing will stop the flow of ideas. Once you have your ideas, then sit there and analyse how good or relevant to the story they are. Finally try writing them into the story. I've been to the BBC and met some of their writers - this is how they do it. Research is also very important 9 times out of 10 if you're struggling for things to write it's because your 'bucket' of ideas is empty. They say that you should know the world of your characters inside out. Whatever type of story you're writing - research it as much as humanly possible. I've actually met writers who think that doing research is 'cheating' and that they don't want to just copy from real life. I can't even begin to explain how ludicrous this is - don't be like them, they'll never be good writers if they maintain that attitude! Research as much as you can and take inspiration from any source. If you're writing about a bank robbery, visit banks for inspiration, observe how people behave (maybe not such a great example to use - don't get arrested, unless of course you want to research that...) try to read about as many real life bank robberies as you can. First hand research is always best, there's nothing like actually experiencing something yourself so always try to experience something or meet people who have been through it, where possible. If you're writing a fantasy, find real life similarities to your work to take inspiration from. When you've done this then writing will be so much easier - when you're sat there wondering what would happen when your bank robber gets arrested, you'll just be able to think \"well this happened to that guy, and this happened to the other one, which of those would be cool for my story?\" instead of \"oh my god what shall I write\". The most important thing though is to recognise when your getting frustrated, and to just stop and try another approach. Read over your ideas and research, or go back to the drawing board and generate some more ideas using the techniques I described. Edit: Another good tip is instead of thinking, \"what should this character do next?\", actually picture yourself as that character - imagine, if you were in the scenario what would you be thinking and feeling, what would you do next? People starting out tend to do the former rather than latter, it's a subtle difference but it helps you to connect with characters and create solid motivations for them. Edit 2: I remembered where the bucket analogy came from, which was another answer on Quora, by Sean Hood. What is the most important tool in the screenwriter's toolkit? It's a fantastic answer well worth a read! ",
            "date": "Updated May 26, 2015",
            "views": "870",
            "upvotes": " View 56 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Guy",
                    "user_href": "/profile/Guy-312"
                },
                {
                    "user_id": "Janine Collins",
                    "user_href": "/profile/Janine-Collins"
                },
                {
                    "user_id": "Luis Fernando Rojas Gonzalez",
                    "user_href": "/profile/Luis-Fernando-Rojas-Gonzalez"
                },
                {
                    "user_id": "Kago Motlhabane",
                    "user_href": "/profile/Kago-Motlhabane"
                },
                {
                    "user_id": "Jonathan Fenile de Castro",
                    "user_href": "/profile/Jonathan-Fenile-de-Castro"
                },
                {
                    "user_id": "Robert Dixon",
                    "user_href": "/profile/Robert-Dixon-1"
                },
                {
                    "user_id": "Peter Choi",
                    "user_href": "/profile/Peter-Choi-1"
                },
                {
                    "user_id": "Susan Smith",
                    "user_href": "/profile/Susan-Smith-1"
                },
                {
                    "user_id": "Stanislav Kholodny",
                    "user_href": "/profile/Stanislav-Kholodny"
                },
                {
                    "user_id": "Janine Sugawara",
                    "user_href": "/profile/Janine-Sugawara-1"
                }
            ]
        }
    ]
}