{
    "title": "How to write articles on Quora - Quora",
    "tags": [
        "Article Writing",
        "Writing"
    ],
    "response": [
        {
            "author_info": {
                "name": "Champong Sutsaart",
                "href": "/profile/Champong-Sutsaart"
            },
            "answer_text": " Asking The Question Begin by asking a question. Make sure it's clear, grammatically correct and specific. You'll also need to make sure that your question is unique. Otherwise you'll get no responses, get redirected to a similar question, have the question removed or moved to a different thread. Make sure the question is categorized correctly. This way followers of certain topics will be able to see it in their Quora feed. Once you publish your question, you'll have an opportunity to invite Quorans to provide answers. At this point, you'll need to sort through suggested users and invite only the ones that fit this criteria: - Have many responses in the category your question resides in - Good response rate - Cost - are they free to ask or will it cost you credits Most of the time I'll quickly scroll through the suggested list and only invite a handful of Quorans based on my criteria above. A better way to seek help from experts is to actually invite them on a one by one basis. If you know who the experts are, look them up by name: If you can't find experts, head over to the categories that your question is listed in and look up active users, especially those who have many upvotes. For my sample question, I went into the SEO, PPC and Copywriting categories. I was able to identify experts within each category and invited all of them to answer my question. My invites went out to a total of 50 people. Just two days later, I received 10 responses. Take a look: How to Identify Keywords with Purchase Intent What To Do With The Responses Besides learning from the experts, share what you've learned with your networks or post the question and answers to your blog via the 'Share' link. Another way to use responses is to inform and help you craft your next epic blog post. This is crowdsourced content that you can use in your own writing. Take a look at my previous blog post on how I used Quora answers to create a full blog post. Show Respect And Give Credit Before you start posting your questions and soliciting answers, you need to follow some rules. Remember, respondents are providing you with free content - so respect the time and effort someone is giving to help you. As mentioned earlier, use the answers to help inform your blog post content. Don't claim them as your own. Give credit or link to the original source. Use the answers to craft a compelling story. Conclusion Writing a blog post may seem like a daunting task, but it doesn't have to be. There's no shortage of online idea generators, forums and research tools to help you come up with ideas and content. In Search, Social Media or Forums, all you have to do is ask a question. ",
            "date": "Answered October 23, 2020",
            "views": "76",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Lorena Fabiana",
                    "user_href": "/profile/Lorena-Fabiana"
                }
            ]
        },
        {
            "author_info": {
                "name": "Robert Charles Lee",
                "href": "/profile/Robert-Charles-Lee"
            },
            "answer_text": "You get to write three main things on Quora:— Answers to questions — and this is the prime purpose of being on Quora, which is a question-and-answer (Q&A) site.Comments — either to answers or to the question (underneath the question details). Go easy on the comments because this is a Q&A site, not a kind of chat forum or Facebook-like thing where people comment on practically everything.Blog posts — if you have set one up here. This presumably is what you mean by ‘articles.’",
            "date": "Answered April 1, 2017",
            "views": "25",
            "upvotes": " View 11 Upvoters",
            "upvoters": [
                {
                    "user_id": "Abhi V",
                    "user_href": "/profile/Abhi-V-51"
                },
                {
                    "user_id": "Belle Ofalda",
                    "user_href": "/profile/Belle-Ofalda-1"
                },
                {
                    "user_id": "Sacred Crafts",
                    "user_href": "/profile/Sacred-Crafts"
                },
                {
                    "user_id": "Jonathan Gzz",
                    "user_href": "/profile/Jonathan-Gzz-1"
                },
                {
                    "user_id": "Pankaj Kumar",
                    "user_href": "/profile/Pankaj-Kumar-412-1"
                },
                {
                    "user_id": "Angel Halsey",
                    "user_href": "/profile/Angel-Halsey"
                },
                {
                    "user_id": "Kayenat Patil",
                    "user_href": "/profile/Kayenat-Patil-1"
                },
                {
                    "user_id": "Karen Carmichael",
                    "user_href": "/profile/Karen-Carmichael-7"
                },
                {
                    "user_id": "Aman Tesfalem",
                    "user_href": "/profile/Aman-Tesfalem"
                },
                {
                    "user_id": "Nisaar Y. Nadiadwala",
                    "user_href": "/profile/Nisaar-Y-Nadiadwala"
                }
            ]
        }
    ]
}