{
    "title": "How do Japanese describe the nuclear attack in history books? - Quora",
    "tags": [
        "Nuclear Attack",
        "Hiroshima, Japan",
        "Historical Japan",
        "Atomic Bombings of Hiroshima and Nagasaki (August 1945)",
        "Japanese Ethnicity and People",
        "Culture of Japan",
        "Books"
    ],
    "response": [
        {
            "author_info": {
                "name": "Brandon Lee",
                "href": "/profile/Brandon-Lee-178"
            },
            "answer_text": "Japan, being the only country to suffer from nuclear attack, is one of the most adamant proponents of nuclear disarmament. They portray the attacks as another reason against war. Since World War 2, they have obviously used the US as an ally, and as a source of economic stimulus via trade, access to markets, and other resources. In fact, a Stanford study found that far from being nationalistic, Japanese textbooks seem the least likely to stir patriotic passions. They do not celebrate war, they do not stress the importance of the military, and they tell no tales of battlefield heroism. Instead they offer a rather dry chronology of events without much interpretive narrative. They also offer a message that wars in Asia are a problem caused by Japanese imperial expansion (something viewed as ‘traditional’ or ‘barbaric’ in a way?). They look at their reckless, jingoist leaders of the past with disgust, and believe themselves as victims of the war caused by those leaders. Of course, this ‘revisionism’ has led some to correct what is seen as a ‘masochistic’ view of modern Japan. And I’ve heard rumors that Japanese textbooks avoid speaking about the horrific moments of war? This is completely not true. Many textbooks mention the infamous Rape of Nanjing in 1937 by Japanese troops, and the use of comfort women. Thousands of students visit the Hiroshima memorial, and view the results. Of course, there are so many different opinions that exist within the students, their families, teachers, etc. But the general consensus, I would believe, is that the war was terrible. On the other hand, I know Japanese has been slowly becoming a little more aggressive in their relationship with the Asia region and with the United States. Japan has slowly been creeping towards Dokdo Island (territory of South Korea) which is a vital strategic point that is culturally and militarily important (read more here: Liancourt Rocks dispute - Wikipedia). In return of losing the war the Japanese political establishment has also allowed American forces to be stationed in Okinawa indefinitely. While this benefits most of Japan, Okinawa has had to surrender the best 20% of its land and has received the least of the benefits of Japan's growth. The Okinawans have thus been the most vocal opponents of the American military presence. There are a number of points that are also important between their relationships but this is a basic underlying answer that tried to reach most of the points of your very complex question. ",
            "date": "Answered November 20, 2016",
            "views": "55",
            "upvotes": " View 72 Upvoters",
            "upvoters": [
                {
                    "user_id": "Tak Furuya",
                    "user_href": "/profile/Tak-Furuya"
                },
                {
                    "user_id": "Samuel Felton",
                    "user_href": "/profile/Samuel-Felton-1"
                },
                {
                    "user_id": "Louie Petersen",
                    "user_href": "/profile/Louie-Petersen"
                },
                {
                    "user_id": "Allen Sheldon",
                    "user_href": "/profile/Allen-Sheldon"
                },
                {
                    "user_id": "Muhd Nazhan",
                    "user_href": "/profile/Muhd-Nazhan"
                },
                {
                    "user_id": "Azahar",
                    "user_href": "/profile/Azahar-1"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/Dv-Dv-13"
                },
                {
                    "user_id": "Pavel Savchuk",
                    "user_href": "/profile/Pavel-Savchuk-1"
                },
                {
                    "user_id": "Kelly Liu",
                    "user_href": "/profile/Kelly-Liu-145"
                },
                {
                    "user_id": "Brendan Chase",
                    "user_href": "/profile/Brendan-Chase-2"
                }
            ]
        },
        {
            "author_info": {
                "name": "P Sizan",
                "href": "/profile/P-Sizan"
            },
            "answer_text": "According this comment on Reddit how it was Japanese describe and taught about the attack. https://www.reddit.com/r/history/comments/3fvjs1/how_is_the_hiroshima_atomic_bomb_taught_in_your/ctsfshr/ Her grandparents witnessed the bomb from two different locations just outside the city as children. She has told me about how they were taught about the bomb in her school in Hiroshima. It seems they have special classes all about the bomb. She says they learn technically how it works, all about the effects of radiation, and about its development. She says they are taught about the decision making process behind the decision to drop it. She says they are taught in great detail about the physical and psychological effects of being directly affected by it. They are also taught about the aftermath of the bomb with regards to rebuilding the city. It sounded very different from the lesson taught to me in U.S. schools — that the bomb was a \"necessary evil\" that was going to cost less lives than the supposed only alternative of an invasion of the Japanese main islands. The Peace Memorial Park in Hiroshima is visited by the young students. They can see the A-bomb Dome from their equivalent of Central Park. In other words, there are constant reminders of this tragedy that put their city on the map. My wife told me that these special classes on the A-bomb are only taught in Hirishima and Nagasaki and are not part of the national curriculum in Japan in general. How it is described in America Source : https://www.reddit.com/r/history/comments/3fvjs1/how_is_the_hiroshima_atomic_bomb_taught_in_your/ctsawx9/ I am from America, but I feel I can contribute because I am a high school history teacher. When I was in school, it was simply stated that we dropped two bombs, thus ending the war. When in college the focus around the bomb was an emphasis on the pacific theater. Very much an idea of, \"they won't quit so we must use the bomb, it will save many American and Japanese lives to do so.\" Last year when I taught U.S history to Juniors, we took the latter approach. We looked at casualties of each island, projected casualties, and discussed why the bomb was so effective. It is a more \"matter of fact\" that it was used and not a real dwelling point. However, the bomb is the heart and center of the Cold War section. ",
            "date": "Updated December 2, 2016",
            "views": "727",
            "upvotes": " View 15 Upvoters",
            "upvoters": [
                {
                    "user_id": "Allen Sheldon",
                    "user_href": "/profile/Allen-Sheldon"
                },
                {
                    "user_id": "Toni Lichtenstein Bogolub",
                    "user_href": "/profile/Toni-Lichtenstein-Bogolub"
                },
                {
                    "user_id": "Boyko Todorov",
                    "user_href": "/profile/Boyko-Todorov"
                },
                {
                    "user_id": "Mithil Kamble",
                    "user_href": "/profile/Mithil-Kamble"
                },
                {
                    "user_id": "Alexander Barnes",
                    "user_href": "/profile/Alexander-Barnes-4"
                },
                {
                    "user_id": "Abhishek R",
                    "user_href": "/profile/Abhishek-R-93"
                },
                {
                    "user_id": "John Walton",
                    "user_href": "/profile/John-Walton-50"
                },
                {
                    "user_id": "Kendrick Eustaquio",
                    "user_href": "/profile/Kendrick-Eustaquio"
                },
                {
                    "user_id": "Jeremy Glenesk",
                    "user_href": "/profile/Jeremy-Glenesk"
                },
                {
                    "user_id": "Enrique Perez Jaimes",
                    "user_href": "/profile/Enrique-Perez-Jaimes"
                }
            ]
        }
    ]
}