{
    "title": "How to write a spy novel - Quora",
    "tags": [
        "Spy Novels",
        "Novel Writing"
    ],
    "response": [
        {
            "author_info": {
                "name": "Vinoth Kumar",
                "href": "/profile/Vinoth-Kumar-302"
            },
            "answer_text": "I have provided this answer to similar questions. So here it goes: 1. Select a theme. Is the spy going to save someone, prevent something from happening, destroy something evil or execute something as a mission? Or is it going to be a mixed flavor? 2. Prepare the plot and the sub-plots. You don't have to get into the details but prepare the rough sketch of events and emotions which you want the reader to experience. Its actually like the sub-chapters & chapters in a novel. This gives you a simple blue print of your story line.  3. Identify the story characters and give them a name and personality according to the nature of the plot. Also select the places and environment suitable to each of the plots and sub-plots. 4. Narrate the episode of each plot according to the events with suitable genres like drama, thriller, action, romance using the characters. Use proper language in such a way that the story can stretch the reader's imagination. 5. After sketching each plot, read the story and check if it is interesting enough to stir emotions in the mind of the reader. Make necessary modifications and finish it till the end. 6. Ask your friends and maybe other critics to read your novel and provide feedback. Based on the impact you can decide whether to go further for editing and publishing. ",
            "date": "Answered June 10, 2014",
            "views": "3",
            "upvotes": " View 6 Upvoters",
            "upvoters": [
                {
                    "user_id": "Harshita Rathod",
                    "user_href": "/profile/Harshita-Rathod-17"
                },
                {
                    "user_id": "Anne King",
                    "user_href": "/profile/Anne-King-102"
                },
                {
                    "user_id": "Abigayle Morgan",
                    "user_href": "/profile/Abigayle-Morgan"
                },
                {
                    "user_id": "Diane Sanders",
                    "user_href": "/profile/Diane-Sanders-27"
                },
                {
                    "user_id": "Jonathan Gibbons",
                    "user_href": "/profile/Jonathan-Gibbons-6"
                },
                {
                    "user_id": "Eleni Datsika",
                    "user_href": "/profile/Eleni-Datsika"
                }
            ]
        }
    ]
}