{
    "title": "How to write a leave application due to sickness, and can't attend the exam - Quora",
    "tags": [
        "Leave Application",
        "Sick Leave",
        "Leave of Absence",
        "Illness"
    ],
    "response": [
        {
            "author_info": {
                "name": "Vishal Tamang",
                "href": "/profile/Vishal-Tamang-7"
            },
            "answer_text": "To the principal of (give here school/college name) ( Give here your residential address) Sub: Application for leave due to sickness Date:Give particular day date Respected sir/ madam, With due respect and humble submission i would like to state that i couldn't be able to attend in my regular classes because I have been suffering from sickness from some days before and doctor has advised me to take some rest..so,i couldn't be able to present or stand in my exams .. So,it's my honour request to you to please grant me leave for the absence of these long days.. I would be very thankful to you if you understand my position and grant me leave for the absence of these days.. Thank you, Your obedient student Name: Standard: Roll no.: Guardian sign: ",
            "date": "Answered September 20, 2018",
            "views": "4194",
            "upvotes": " View 128 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Gauri Awasthi",
                    "user_href": "/profile/Gauri-Awasthi-21"
                },
                {
                    "user_id": "German Turke",
                    "user_href": "/profile/German-Turke"
                },
                {
                    "user_id": "Steve Mwangi",
                    "user_href": "/profile/Steve-Mwangi-31"
                },
                {
                    "user_id": "Laxmi M Saroj",
                    "user_href": "/profile/Laxmi-M-Saroj"
                },
                {
                    "user_id": "Reema Sharma",
                    "user_href": "/profile/Reema-Sharma-72"
                },
                {
                    "user_id": "Bittoo Khare",
                    "user_href": "/profile/Bittoo-Khare"
                },
                {
                    "user_id": "Faria Ashraf",
                    "user_href": "/profile/Faria-Ashraf-4"
                },
                {
                    "user_id": "Boss Boss",
                    "user_href": "/profile/Boss-Boss-264"
                },
                {
                    "user_id": "Akshit Jain",
                    "user_href": "/profile/Akshit-Jain-307"
                },
                {
                    "user_id": "Jyoti Mishra",
                    "user_href": "/profile/Jyoti-Mishra-1061"
                }
            ]
        },
        {
            "author_info": {
                "name": "Janine Rinker",
                "href": "/profile/Janine-Rinker"
            },
            "answer_text": "It depends on where you are and what illness you have. Always be polite, and write the note as soon as possible. I will write some notes from imaginary students in different situations: Dear Professor L, I have recently been diagnosed with a concussion after a car accident. I will not be able to take the exam for clinical calculations as scheduled. I expect to be recovered enough by (specify date) to take the exam. Attached find a doctor’s note explaining the situation. Yours, Anny Student This student took the exam, but had an assistant read the questions and write the answers, since you are not supposed to read and write a lot after a concussion. Dear Dr. So and So, Please excuse me from yesterday’s class and allow me to reschedule the exam I missed. I was very ill with a high fever and (vague description of symptoms). Can I stop by your office hours and reschedule the exam? Yours, Another Student This student was allowed to take the exam the next week. Some professors/teachers are okay with you taking a late exam, others are not. Mainly the reason is whether they use the same exam for all students, or have a computer generated one that is different for all students. If you know your teacher is not very forgiving on late exams, try to find a solution before you miss the exam. ",
            "date": "Answered October 25, 2018",
            "views": "1321",
            "upvotes": " View 15 Upvoters",
            "upvoters": [
                {
                    "user_id": "Eman Rasheed",
                    "user_href": "/profile/Eman-Rasheed-4"
                },
                {
                    "user_id": "Chanchla Kumari",
                    "user_href": "/profile/Chanchla-Kumari-5"
                },
                {
                    "user_id": "Varduking Mehta",
                    "user_href": "/profile/Varduking-Mehta"
                },
                {
                    "user_id": "Hareesha Pv",
                    "user_href": "/profile/Hareesha-Pv"
                },
                {
                    "user_id": "Mir Shafiya",
                    "user_href": "/profile/Mir-Shafiya"
                },
                {
                    "user_id": "Sriparna Mondal",
                    "user_href": "/profile/Sriparna-Mondal-5"
                },
                {
                    "user_id": "Avninder Rangi",
                    "user_href": "/profile/Avninder-Rangi"
                },
                {
                    "user_id": "Manju Gautam",
                    "user_href": "/profile/Manju-Gautam-47"
                },
                {
                    "user_id": "JN Laskar",
                    "user_href": "/profile/JN-Laskar"
                },
                {
                    "user_id": "Tanzin Tanzina",
                    "user_href": "/profile/Tanzin-Tanzina"
                }
            ]
        }
    ]
}