{
    "title": "How to get toned - Quora",
    "tags": [
        "Healthy Workouts",
        "Health and Exercise",
        "Weight Loss and Fitness",
        "Working Out",
        "Exercise",
        "Fitness"
    ],
    "response": [
        {
            "author_info": {
                "name": "Debasish Panda",
                "href": "/profile/Debasish-Panda-34"
            },
            "answer_text": "Be active every day to prime your body for toning. You'll need to get in basic shape before you can start really toning your muscles. If you move directly into intense exercise, you're much more likely to get overwhelmed and quit or even injure yourself. Start building your endurance by getting off the couch and being active in your everyday life.Take the stairs when you have the choice. Stand instead of sit while you use the computer or study. Walk to places that are a mile or less from your location, instead of taking the car. Go for a relaxing walk or jog instead of watching TV. There are lots of ways to get active in your everyday life without even exercising.2.Start with basic exercises to build your endurance. Begin toning your muscles by doing some basic exercises. These will increase your endurance and help get you in better shape, so that you can move on to really sculpting your body with more targeted exercise.Try jogging, riding a bike, or going swimming. Most of these cost very little or are free and you can do them on your own, without expensive gym memberships or equipment.These basic exercises should take up about three hours of your day, everyday, for the first week or two3 Do \"monkey arms\". \"Monkey arms\" is a great exercise for your arms and upper body. Do this exercise by putting a weight in each of your hands. Start by holding the weight at your armpit with your elbows out. Then, swing your arms out to straighten them, keeping them up and level with your shoulders. Swing the weight back to your armpits and repeat. If you don't own weights, you can cheat and use cans of food or other lightly heavy objects.Pair this with a squat or lunge to make it a full body workout4 Do a pike roll-out. After the first week or so of exercising frequently, you can start doing exercises which are a bit more strenuous. This exercise requires an exercise ball but it is a good full body workout. Start in a push-up position but instead of having your feet on the ground, let your shins rest on top of the ball instead. Pull your hips up, so that your butt goes up into the air, rolling the ball down your leg as you go until your toes are resting on the ball. Then, roll back down so that the ball moves slowly up your body to reach your hips. Your body should be kept in a straight line, legs up in the air, so that your create an upside-down \"V\" shape in profile. Exercise balls are pretty cheap but you can cheat a bit and just buy a big rubber ball from a toy store, which are often sold for $10 or less.5.Do burpees. Burpees look complex but they're actually easy once you get used to the motions and they're one of the best full body workouts that you can do. Start in a standing position, feet apart. Put your hands down on the ground in front of your feet, jump your legs back so that you go into a push-up position, and do a push-up. Now, jump your feet back, then lift your hands above your head and jump straight up as high as you can. Repeat for at least 10 minutes. You can skip either the push-up or the jump, but both really add to the effectiveness of the exercise, so it is not recommended.6.Do squats. Squats work your core muscles and your legs, and can even work your arms if you lift small weights while you do them. A squat is done by standing with your feet about a shoulder's width apart and then crouching down, as if you're sitting in an invisible chair. Keep your back straight in order to do this exercise correctly.If you're new to squats, using a chair or table to balance can make it much easier.",
            "date": "Answered April 1, 2018",
            "views": "11",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Bhupesh Yadav",
                    "user_href": "/profile/Bhupesh-Yadav-37"
                },
                {
                    "user_id": "Durga Prasad",
                    "user_href": "/profile/Durga-Prasad-1765"
                }
            ]
        },
        {
            "author_info": {
                "name": "Rishabh Shrivastava",
                "href": "/profile/Rishabh-Shrivastava-69"
            },
            "answer_text": "3 Rules for a Toned Body (Men and Women)  If you are looking to Build a Physique that makes you look not just in Clothes but also when you strip them off, here are 3 Rules to get a Toned and Aesthetic Physique 1. Train 3-4 Times a Week with Weights - yes Weight Training is what will build Muscle and Muscle is what will make your body look Toned. Introduce weight training 3-4 times a week, focussing mostly on compound movements like Squats, Deadlifts, Bench Presses, Overhead Presses. Do 3-4 sets of Each and 8-12 reps in each set for Muscle Growth. 2. Portion Control - The 2nd Most important aspects of Nutrition. Start using Portion Control to your advantage. Keep a Fixed Eating Plate and divide it in 3 sections. You will eat all your Meals in that same food plate. 1/2 of that Plate will be filled with Lean Protein Sources like Chicken Breast, Egg Whites, Fish, Tofu, etc, 1/4 with Complex Carbs like Brown Rice, Chapattis, Quinoa, Brown Bread, Sweet Potatoes, etc And the remaining with healthy fats like Almonds and nuts, Flaxseeds, etc. And yes, no cheat meals until you reach your goal 3. Cardio - The last thing that will help you lose that fat to reveal the Toned Physique is Cardio. Nothing too extreme just 30 mins of Empty Stomach Cardio first thing in the morning every single day is what you need at the moment Stop being lazy now and get your ass to lift some heavy ass weights and get a physique you've always wanted Cheers! Check out my profile at Rishabh Shrivastava ",
            "date": "Updated May 22, 2020",
            "views": "24",
            "upvotes": " View 6 Upvoters",
            "upvoters": [
                {
                    "user_id": "Kristen Langhorne",
                    "user_href": "/profile/Kristen-Langhorne"
                },
                {
                    "user_id": "Kayla Abid",
                    "user_href": "/profile/Kayla-Abid"
                },
                {
                    "user_id": "Satvik Chandrakar",
                    "user_href": "/profile/Satvik-Chandrakar"
                },
                {
                    "user_id": "Vikas Rao",
                    "user_href": "/profile/Vikas-Rao-45"
                },
                {
                    "user_id": "Siddharth Singh",
                    "user_href": "/profile/Siddharth-Singh-1087"
                },
                {
                    "user_id": "Akshay Kumar",
                    "user_href": "/profile/Akshay-Kumar-10"
                }
            ]
        }
    ]
}