{
    "title": "How is creative writing good? - Quora",
    "tags": [
        "Learning About Creative Writing",
        "Creating Writing Advice",
        "Creative Writing",
        "Writing Advice"
    ],
    "response": [
        {
            "author_info": {
                "name": "Rahul D'Silva",
                "href": "/profile/Rahul-DSilva"
            },
            "answer_text": "This is like asking how is food good…or how is soil good. Or how is art good. Anything is neither good nor bad, it’s how we use it. What is good creative writing?Something that sets off a fire in your brain. Makes you view the world or yourself differently. How is creative writing good for society or individuals?It inspires new ideas, and gets us to look at the world in a different light. It can describe history and daily life in ways that technical books or journalism sometimes can’t. It’s enjoyable, like looking at art or traveling. It helps make us smarter. Reading creative writing gives us new ideas, allows us to appreciate emotions and stories. And sometimes inspires us to write our own stories. ",
            "date": "Answered May 19, 2016",
            "views": "349",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Stan Loz",
                    "user_href": "/profile/Stan-Loz"
                },
                {
                    "user_id": "Deidre Hansen",
                    "user_href": "/profile/Deidre-Hansen"
                }
            ]
        },
        {
            "author_info": {
                "name": "Alan Chapman",
                "href": "/profile/Alan-Chapman-10"
            },
            "answer_text": "I use creative writing as a foil to temporary stalls in mathematics and programming. Over time, typing speed increases, and finger work can match flow of ideas. The driving power here is faith in self and in experience. Lose the reason for writing, and pressure will come off the the technical problems across the table. I write in a circuit of areas. Comedy-probably the hardest; adventure, scary, crime and war. None of my work is intended for examination by a publisher, therefore I can write whatever I want. When I am in full flow, the odd spelling mistake or bad choice of words is ignored-if I am in the mood to improve the writing, I can always go back. Throughout my time in programming and math, the BOUNCE-that is moving to the other side of the bench to write, when in technical stall, has never failed to lift the barrier to progress. My mind shifted to alternative purpose, and allowed the area dealing with math to free up and provide clues to next move! warm regards Alan ",
            "date": "Answered August 12, 2016",
            "views": "315",
            "upvotes": "0"
        }
    ]
}