{
    "title": "How do people write such long posts on Quora? How can I improve my writing skills? - Quora",
    "tags": [
        "Writing Skills",
        "Posts (Quora feature)",
        "Self-Help Writing",
        "Using Quora",
        "Writing Advice",
        "Writing",
        "Self-Improvement"
    ],
    "response": [
        {
            "author_info": {
                "name": "Karen Marie Shelton",
                "href": "/profile/Karen-Marie-Shelton"
            },
            "answer_text": "tl;dr Not only do I write long posts on Quora, if you read some of the comments I receive, people criticize me for the length of my answers. How do I write such long posts? I started writing for newsletters, year books and bulletins in the last two years of grade school. I continued to write in high school and for local newspapers. I always had editors who would help me and advise me to try and do a better job of writing. I still think my writing needs to improve, but sometimes I dash off answers too fast or when I’m on the go and get a little sloppy (thank you Greg Burns and Karen Carmichael for keeping me on track).I received my first payment for writing a monthly astrology column for teens in my 20s. This was after years of writing for a variety of outlets without pay. Getting paid to write was such a great accomplishment.My first job out of college where I took creative and business writing classes, I was hired to be a systems analyst where I also did coding (Fortran, SPSS, SAS and related). I had to write a dizzying array of design, requirements and specification documents. I also wrote user training and technical documents, on-line help files, marketing and sales materials.One of my jobs in the software industry involved only writing technical responses to Request For Proposals (RFP). It was a lot of writing and extremely long documents. Some of the responses due to the lists of technical and business requirements which had to be provided were over 1,000 pages long.You name it and I’ve probably written it including business plans and a dizzying array of business documents including proposals for funding for my companies.When I started Hairboutique, the first ever consumer focused hair and beauty website on the Internet, I wrote the vast majority of the articles, blogs and weekly newsletters. From there I worked for a multiple of hair publications and wrote articles.Eventually I was hired by a New York publisher as an editor for all of their hair magazines. For the past 20 years I’ve been paid to write and edit for 3–5 hair publications per month (long hair, short hair, bridal hair, prom hair, updos, hair galleries and special booklets on hair).I started writing on Quora in 2012. I guess my challenge should be to write less since some people do criticize the length of my posts. On Quora I try to only answer questions on topics I have deep expertise (hair, beauty, skin, astrology, metaphysics or similar).I read constantly. When I can arrange it, I try to read one book per day in a wide range of business, hair, beauty or metaphysical topics. Reading triggers a need (at least in me) to write.I know some people prefer very short answers. Some prefer longer. In my case, I personally prefer long answers and when I don’t give as much information as I possibly can, I feel that I am short changing the person who asked the question. I would like to think that people who don’t like long answers, would just avoid reading mine. I also try to organize them so they can be easily skimmed to pick out relevant pieces of information and not have to read the entire piece. One of the the things which frustrates me tremendously in current times is how much blatant misinformation is published by people who don’t do proper research or who take urban myths as gospel. There Is An Excuse Of Misinformation I see so much wrong information being provided, especially with regard to hair, beauty and astrology, that I feel I have to provide as much correct information as possible to try and give people who want the real facts, those options. Yes, I have also been attacked here on Quora for not having proper credentials to back up the detailed information. Besides a Bachelors from the University of Missouri, a Masters from St. Louis University and post graduate work towards a doctorate from St. Louis University, I have attended ongoing and regular classes at a wide range of university in the computer and business fields. When I started my Hairboutique business, because I wanted to make sure I provided proper information, I attended Paul Mitchell cosmetology school and a Madame C. Walker natural hair styling school to learn braiding and black hair styling. I have spent over 25+ years directly involved in the hair industry in a variety of roles. I Am Still Learning And Taking Classes I am still learning everything I can about hair and recently took an advanced course on hair extensions. Even currently I am enrolled in a one year professionals writers program and have taken hundreds of hours of training in astrology and metaphysics. Yes, my answers are long. Look at this one. At this point in time in my life, after spending the vast majority of my energy in some type of writing related project, my choices are to stop writing or wish that people who are annoyed by my long answers, just stop reading them. A Long Answer On How I Write Long Answers That is a very long answer to how I write long answers on Quora and why I do so. I have a lot of experience and knowledge crammed into my brain and want to share as much as I can. A special thank you to all who help me here on Quora with kind and thoughtful suggested edits. Sometimes my brain and fingers go too fast to catch all my oopsies. Best wishes to all. ",
            "date": "Answered August 18, 2020",
            "views": "233",
            "upvotes": " View 25 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Stephanie Johnson",
                    "user_href": "/profile/Stephanie-Johnson-144"
                },
                {
                    "user_id": "Jimmy Gant",
                    "user_href": "/profile/Jimmy-Gant"
                },
                {
                    "user_id": "Rebecca Baldwin",
                    "user_href": "/profile/Rebecca-Baldwin-8"
                },
                {
                    "user_id": "Ramya Annadurai",
                    "user_href": "/profile/Ramya-Annadurai-3"
                },
                {
                    "user_id": "Charles Jameson",
                    "user_href": "/profile/Charles-Jameson-3"
                },
                {
                    "user_id": "David Evans",
                    "user_href": "/profile/David-Evans-29"
                },
                {
                    "user_id": "Robert Thornton",
                    "user_href": "/profile/Robert-Thornton-2"
                },
                {
                    "user_id": "Leon Brennan",
                    "user_href": "/profile/Leon-Brennan-2"
                },
                {
                    "user_id": "Cat Wilson",
                    "user_href": "/profile/Cat-Wilson-7"
                },
                {
                    "user_id": "Amanda Ce",
                    "user_href": "/profile/Amanda-Ce-2"
                }
            ]
        },
        {
            "author_info": {
                "name": "Bhagwati Gauni",
                "href": "/profile/Bhagwati-Gauni"
            },
            "answer_text": "Writing long posts need the in depth knowledge of the required subject. Alohg with that one should have some practical knowledge too. For writing long posts you need to have good writing skill by which the reader can understand it in detail and get satisfactory solutions for their questions. Write in such a way that you are telling your experience to someone. Start writing small paragraphs as I do on Quora and keep reading various answers. So you get the real knowledge about that. Thank you. ",
            "date": "Answered June 9, 2020",
            "views": "24",
            "upvotes": "0"
        }
    ]
}