{
    "title": "How did the Beatles write their songs? - Quora",
    "tags": [
        "Songwriting",
        "The Beatles (band)"
    ],
    "response": [
        {
            "author_info": {
                "name": "Don Stuart",
                "href": "/profile/Don-Stuart-6"
            },
            "answer_text": "John wrote based on chords mostly, then made vowel and consonant sounds and random phrases that sounded like they fit and honed the lyrics from that. It got him into trouble sometimes — “He come on flat-top, he come movin’ up slowly” from Come Together was a semi-obscure Chuck Berry lyric that John had free-associated. John also used a technique where he lifted phrases from newspapers and arranged them into lyrics. A Day in the Life (…I read the news today oh boy) and For the Benefit of Mr. Kite (lyrics are from a poster) are two examples. During their Dylan-influenced stage (65–66) John worked harder on his lyrics. Tomorrow Never Knows was a one-chord song that’s chiefly lyrical, nearly spoken word. Norwegian Wood is thought to be a Dylanesque folk tune, but it’s really more like Bert Jansch, a brilliant English folk tunesmith of the era. You’ve Got to Hide Your Love Away is a straight-shot of Bob, and John’s said as much. Post-Dylan, John wrote more songs based on his poetry. Whenever you hear odd vocal phrasing in a Lennon song, that’s him jamming his words into the time signature. Or just changing the signature briefly to fit in the words. John didn’t care much about songwriting “rules.” During Fab-stage Beatles John was just rewriting rock-n-roll and r&b tunes about girls and love and such, co-writing a lot of that stuff with McCartney. Those guys really kicked ass at copying Buddy Holly, Chuck Berry, Brill Building, Leiber-Stoller and Motown songwriting. Paul had an ear for melodies and chords. Sometimes it was a melody and then he found chords to go with it and created lyrics — and often not a whole song, just fragments. When Lennon/McCartney were composing Paul would say something like “Oh, I have this little bit that might work for a middle 8 or a bridge” and they would stick it in. When Paul needed some special sauce, John could compose something good on the spot, which always irked/impressed McCartney. Here’s a melody example. Paul was really into Brian Wilson’s Pet Sounds album around the time of Sgt. Pepper’s. The melody to She’s Leaving Home follows patterns similar to a Pet Sounds song, jumping up and down the scale. He started with that, then found the words and producer George Martin helped him find the chords and a string arrangement. Martin did a lot of this kind of stuff for The Beatles. Other times, especially when Paul was working with outside music conventions, he would compose the chord progression and then make up lyrics and melodies. Some examples include Lady Madonna (a piano rag) or Ob-la-di Ob-la-da (silly attempt at ska). Paul had the chords to Michelle and Yesterday a long time before those songs had the lyrics we know. To summarize: John and Paul didn’t write songs from lyrics that often — a big exception is Imagine, which was based on a poem by Yoko that John put to music. It’s ironic that maybe his best-loved song was inspired by someone so many Beatle fans wrongfully hated. John was a 50’s Eddie Cochran-type chord banger, howler and crooner who sometimes added a guitar hook, and had a knack for the turn of a phrase from being a smartass all his life. He also had a flair for absurdism that dovetailed nicely with the psychedelic era. Paul was a versatile songwriter who could write from melody, chords or riffs, then looked for lyrics to fit the music. He’s one of those people who mostly hears melodies in his head and tries to piece music/lyrics into them. McCartney’s bass playing is famous for contrapuntal melody. John was a “no-filter” sort of person who could compose very fast and creatively and took his gift for granted. Paul was a craftsman who had to work at songwriting and was very, very good at creating PaulVersions of virtually any genre of music. You can see how combining these two types would make a potent songwriting team. A Berklee College of Music professor breaks down Lennon’s songwriting in detail in the book below. You can learn a lot about the art/craft from it. The Songs of John Lennon: The Beatle Years: John Stevens, John Lennon: 0073999495041: Amazon.com: Books ",
            "date": "Updated May 27, 2020",
            "views": "217",
            "upvotes": " View 91 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Ernie Black",
                    "user_href": "/profile/Ernie-Black-3"
                },
                {
                    "user_id": "Rafi Alba",
                    "user_href": "/profile/Rafi-Alba"
                },
                {
                    "user_id": "Dan Carroll",
                    "user_href": "/profile/Dan-Carroll-109"
                },
                {
                    "user_id": "Andy Roper",
                    "user_href": "/profile/Andy-Roper-6"
                },
                {
                    "user_id": "Alberto García Balsalobre",
                    "user_href": "/profile/Alberto-García-Balsalobre"
                },
                {
                    "user_id": "Oscar Hernandez",
                    "user_href": "/profile/Oscar-Hernandez-465"
                },
                {
                    "user_id": "Sam Jolly",
                    "user_href": "/profile/Sam-Jolly-11"
                },
                {
                    "user_id": "Robert Bell",
                    "user_href": "/profile/Robert-Bell-46"
                },
                {
                    "user_id": "Daniel Allen",
                    "user_href": "/profile/Daniel-Allen-46"
                },
                {
                    "user_id": "Stephen Brownlow",
                    "user_href": "/profile/Stephen-Brownlow"
                }
            ]
        },
        {
            "author_info": {
                "name": "Ely Matawaran",
                "href": "/profile/Ely-Matawaran"
            },
            "answer_text": " Sir Paul McCartney revealed to BBC how he and John Lennon wrote songs: “There's a million ways to write but the way I always used to write songs with John would be across from each other. “Either in a hotel bedroom on the twin beds, with an acoustic guitar and we're just looking at each other. “He'd make up something, I'd make up something and we'd just spin off each other. “The nice thing for me is seeing John there, him being right handed, me being left handed, it felt to me like I was looking in a mirror. “Now, I don't try and escape it. I just know there's no way I can find someone who's going to write better stuff with me than those I wrote with John.” And more recently, last month, on July 26, 2018, Sir Paul revealed to Jarvis Cocker in a Facebook live interview, a test that John and he used to determine if they had good songs. He said they didn't even write or record the songs they composed at night: “John and me would frequently forget songs we came up with at night, but those ideas would always come back in the morning. “We had to write songs you could remember. “If we can't remember it, how can we expect other people to?” Obviously, this songwriting test worked: millions of people remember the songs John Lennon and Paul McCartney did decide to actually write down and record.  While George Harrison was the solo guy when it came to songwriting. While Paul and John had each other to work with - which was more of a competition than a collaboration as they would alway try to outdo each other, according to record producer George Martin, George Harrison had to write on his own. George, who felt he had to write songs in order to be really part of the Beatles, wrote his first song in a hotel in Bournemouth, England, in the summer of '63. He wrote in his book 'I, Me, Mine' (1980): “I was sick in bed - maybe that's why it turned out to be 'Don't Bother Me' “I don't think it's a particularly good song, it might not even be a song at all but at least it showed me that all I needed to do was to keep on writing and then eventually I would write something good.” He continued to write on his own and eventually did write “something” good. Thank you. ",
            "date": "Updated May 7, 2020",
            "views": "659",
            "upvotes": " View 326 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Ann Lynn Fairchild",
                    "user_href": "/profile/Ann-Lynn-Fairchild"
                },
                {
                    "user_id": "Mert Güneşer",
                    "user_href": "/profile/Mert-Güneşer"
                },
                {
                    "user_id": "Tom Murphy",
                    "user_href": "/profile/Tom-Murphy-537"
                },
                {
                    "user_id": "Lorenzo Cherchi",
                    "user_href": "/profile/Lorenzo-Cherchi"
                },
                {
                    "user_id": "Andy Roper",
                    "user_href": "/profile/Andy-Roper-6"
                },
                {
                    "user_id": "Kenneth Cowtowne",
                    "user_href": "/profile/Kenneth-Cowtowne"
                },
                {
                    "user_id": "Carolyn Elizabeth",
                    "user_href": "/profile/Carolyn-Elizabeth-2"
                },
                {
                    "user_id": "Alberto Marquez",
                    "user_href": "/profile/Alberto-Marquez-4"
                },
                {
                    "user_id": "Michael Keilhofer",
                    "user_href": "/profile/Michael-Keilhofer-1"
                },
                {
                    "user_id": "Oscar Hernandez",
                    "user_href": "/profile/Oscar-Hernandez-465"
                }
            ]
        }
    ]
}