{
    "title": "How does a TelePrompTer work? - Quora",
    "tags": [
        "Teleprompters",
        "2012 U.S. Elections",
        "Public Speaking",
        "Barack Obama (politician)",
        "Television"
    ],
    "response": [
        {
            "author_info": {
                "name": "Keerthi Vasan",
                "href": "/profile/Keerthi-Vasan-6"
            },
            "answer_text": "The principle underlying is a one-way mirror!! What is a one-way mirror? A one-way mirror, one-way glass, two-way mirror or two-way glass is a mirror that is partially reflective and partially transparent. When one side of the mirror is brightly lit and the other is dark, it allows viewing from the darkened side but not vice versa. How does it work? A one-way mirror has a reflective coating applied in a very thin, sparse layer -- so thin that it's called a half-silvered surface. The name half-silvered comes from the fact that the reflective molecules coat the glass so sparsely that only about half the molecules needed to make the glass an opaque mirror are applied. At the molecular level, there are reflective molecules speckled all over the glass in an even film but only half of the glass is covered. The half-silvered surface will reflect about half the light that strikes its surface, while letting the other half go straight through. Okay, moving along.   The news reporter uses what is called a teleprompter ( you might be knowing this ). But what you might not be knowing is that the teleprompter uses theHere is one in action:    (Schematic representation: (1) Video camera; (2) Shroud; (3) Video monitor; (4) Clear glass or beam splitter; (5) Image from subject; (6) Image from video monitor)Here's how it works: The screen is in front of, and usually below, the lens of a professional video camera, and the words on the screen are reflected to the eyes of the presenter using a sheet of clear one way glass or a specially prepared beam splitter. Light from the performer passes through the front side of the glass into the lens, while a shroud surrounding the lens and the back side of the glass prevents unwanted light from entering the lens.Because the speaker does not need to look down to consult written notes, he appears to have memorized the speech or to be speaking spontaneously. CHEEKY ! Here are some teleprompter ipad apps : Teleprompter Apps For The iPad: iPad/iPhone Apps AppGuide ",
            "date": "Answered March 6, 2015",
            "views": "35",
            "upvotes": " View 4 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Jaiprakash Parwal",
                    "user_href": "/profile/Jaiprakash-Parwal"
                },
                {
                    "user_id": "Rob James",
                    "user_href": "/profile/Rob-James-179"
                },
                {
                    "user_id": "Kannan Rajan",
                    "user_href": "/profile/Kannan-Rajan-5"
                },
                {
                    "user_id": "Tristan Fernandes",
                    "user_href": "/profile/Tristan-Fernandes"
                }
            ]
        },
        {
            "author_info": {
                "name": "Jay Robertson",
                "href": "/profile/Jay-Robertson-3"
            },
            "answer_text": "In the olden days of TV news (1955 or so), the teleprompter was actually a big roll of paper and a mechanism to spool it slowly from a feed roll to a take-up roll.  A special typewriter wrote large characters, maybe 1 or 1.5 inches tall, onto the paper beforehand.  The mechanism was hung under the lens of the \"main\" camera so the news reader could seem to be looking at the audience.  A stage hand with a speed control sat off to the side where he could see the paper and hear the news reader, and his job was to roll the paper at just the right rate to keep the new text a little more than half way up the viewing area.  When computers arrived in the studio, that all changed. ",
            "date": "Answered November 15, 2014",
            "views": "17",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Rob James",
                    "user_href": "/profile/Rob-James-179"
                }
            ]
        }
    ]
}