{
    "title": "How many blog posts should one have on their new blog before it goes live? - Quora",
    "tags": [
        "Bloggers",
        "Blogs"
    ],
    "response": [
        {
            "author_info": {
                "name": "Henrik de Gyor",
                "href": "/profile/Henrik-de-Gyor"
            },
            "answer_text": "Several. Starting with 5 to 10 blog posts is a good start. Give your audience a taste of your content and at the same time, it will show you are commited to delivering on your part of creating good content that the audience wants. If you only had one blog post, what is there for the audience to chew on? When is the next one? Give them a reason to care about your content and keep their attention…with more blog posts. It is not about length though. Longer blog posts do not equal better posts. Write more than what you go live with so you can have a regular cadence for your blog post releases (weekly/biweekly?). If you can’t write 10 blog posts/articles, you should question why you are starting a blog. There should be plenty of things to unpack/write about for your audience. After a few years (yes, that’s right… don’t expect overnight success nor millions of views within a few months), you will find out what is more popular and what is less popular. Write for what you want want to talk about the blog topics too. ",
            "date": "Answered June 12, 2017",
            "views": "436",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Divya Agarwal",
                    "user_href": "/profile/Divya-Agarwal-345"
                }
            ]
        },
        {
            "author_info": {
                "name": "Melanie Tamble",
                "href": "/profile/Melanie-Tamble"
            },
            "answer_text": "If your first post is highly relevant for your target audience, you can start to promote your blog with the very first blog post. Better to have one brilliant post, than to fill your blog with 5–10 mediocre articles, before you start promoting. Blog promotion takes time and needs a consitstent approach. The earlier you start, the earlier you will see results. Take a thorough look at your first post and think of something you can use to encourage your readers to subscribe to your blog or newsletter. Something to give your readers as takeway to remember your blog as valuable resource for your topic, f. e. a checklist, a whitepaper. Encourage your readers to subscribe to your blog, share and like your post, to make your post go viral. And promote your very first blog post on social media. Cross-promote and re-share your post with different visuals and comments to engage more potential readers and extent the lifespan or your post. Cross-promote your post in relevant communities and look out for influencers to discuss and link to your topic. Take a look at my 7 step guide and checklist for writing perfect blog posts and check if you have thought of everything to make your first blog post stand out to help you promote your blog. ",
            "date": "Answered April 24, 2018",
            "views": "257",
            "upvotes": "0"
        }
    ]
}