{
    "title": "How to write a good title - Quora",
    "tags": [
        "Specific Jobs and Careers",
        "Titles",
        "Book Writing",
        "Literature",
        "Writing"
    ],
    "response": [
        {
            "author_info": {
                "name": "Murphy Barrett",
                "href": "/profile/Murphy-Barrett"
            },
            "answer_text": "I have this same problem. And as far as I can tell, the only way to get better is a combination of practice, and ask people for advice after reading your story. I tend to name stories about halfway through writing or later, and my working titles are very boring. My current story is Johnathan Carter, named for the main character. Usually when I finally get a name for the story, it may be inspired by a theme in the story, or some particular imagery, or just something random inspired by the story. Frankly they’re often more descriptive than anything, though sometimes you have to understand how my mind works to make the connection. Here are some titles of my Nadya stories, and where the names come from. Matchstick-named for the poem about The Little Matchstick Girl by Hans Christian Anderson, which featured prominently in the story.Chute-About a paratrooper whose parachute fails, and instead of crashing into the ground he transforms himself into a raven.Den’konfety- “Candy Day”, what Nadya calls Halloween.Stranger in a Strange Land- A title borrowed from my favorite author, Robert Heinlein, about Nadya trying to adjust to living in the US, and is an apt description of her experience.Blue- Because the color featured heavily in the story.Of Wolf and Man- Title borrowed from the Metallica song, about Nadya coming out as a werewolf to her best friend, and the fallout from that.For the most part I don’t think they’re terribly clever, but then they don’t really have to be. I like titles that are descriptive at least to myself. I’ve also had a few titles changed due to suggestions from beta-readers. Or I’ve even just given them stories to read without titles and asked for their suggestions. If you think about it though, most titles for famous stories aren’t exceptionally clever either. The Hobbit was about a hobbit.  Original question-I love to write but I suck at writing titles. Where can I learn how to write a good title? ",
            "date": "Answered May 19, 2019",
            "views": "26",
            "upvotes": " View 38 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Sarthak Dang",
                    "user_href": "/profile/Sarthak-Dang-3"
                },
                {
                    "user_id": "Thomas Wan",
                    "user_href": "/profile/Thomas-Wan-12"
                },
                {
                    "user_id": "William Li",
                    "user_href": "/profile/William-Li-325"
                },
                {
                    "user_id": "Clifford Heseltine",
                    "user_href": "/profile/Clifford-Heseltine"
                },
                {
                    "user_id": "Ben Clark",
                    "user_href": "/profile/Ben-Clark-291"
                },
                {
                    "user_id": "Helen Waltz",
                    "user_href": "/profile/Helen-Waltz"
                },
                {
                    "user_id": "David Gauder-Lerer",
                    "user_href": "/profile/David-Gauder-Lerer"
                },
                {
                    "user_id": "Federico Calcagnotto",
                    "user_href": "/profile/Federico-Calcagnotto"
                },
                {
                    "user_id": "Aj Terno",
                    "user_href": "/profile/Aj-Terno-1"
                },
                {
                    "user_id": "Lyle Husk",
                    "user_href": "/profile/Lyle-Husk"
                }
            ]
        },
        {
            "author_info": {
                "name": "Mario Ashley",
                "href": "/profile/Mario-Ashley-1"
            },
            "answer_text": "I think your looking at this all wrong. Let me offer another idea. I suggest starting with the article first. This is the “meat and potatoes” of the content.From there you will have a better idea of the tone your article takes when its done. Many times I have started an article with an idea in mind and by the time I finished it morphed into a completely different subject and feel altogether. 2. Write down three title idea that automatically come to mind. Don’t overthink this. I call this “paralysis by analysis”. The more you think about it the harder it will be to come up with title ideas. 3. Pick your best title and post! Let the market decide if it was a great title and moreso article. From there you can begin to refine your craft given the feedback/engagment of your articles. Remember article titles mean nothing if the actual article is crap. Hope that helps! -Mario www.marioashley.com ",
            "date": "Answered July 27, 2017",
            "views": "317",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Lewis Crabb",
                    "user_href": "/profile/Lewis-Crabb-2"
                },
                {
                    "user_id": "Aalekh Prajapati",
                    "user_href": "/profile/Aalekh-Prajapati"
                }
            ]
        }
    ]
}