{
    "title": "How to become a better writer when it comes to the first chapter - Quora",
    "tags": [
        "Writers and Authors",
        "Writing Advice",
        "Writing",
        "Self-Improvement"
    ],
    "response": [
        {
            "author_info": {
                "name": "Walter D. Petrovic",
                "href": "/profile/Walter-D-Petrovic-1"
            },
            "answer_text": "You are having issues probably because you do not plan your entire book. It is not enough to call up your preferred word processor and sit down at a blank screen and believe you will complete a superior book without much trouble. But if you do this have you noticed how you struggle to keep a coherent plot and have your characters not behave wonky when you place them into a situation? Remember the basics of writing anything: Beginning, Middle and End. This is not just something to consider as a story format, but should also be considered for every single chapter within your book. Each chapter is usually seen as open-ended because another related chapter follows the previous one. The end of a book can also be open-ended provided you specifically write it with intent to a sequel. However, skill can have you effectively “end” the book but still be able to resurrect some aspect of the story. This is usually easy if you have a primary character, such as James Bond, who can be the key to carry you into other stories. When considering too much information, I have seen stories where characters are described a little, at-a-time, throughout an entire story. You, therefore, do not need to pack every single detail into a single chapter with a description that can get tiresome if not done with some considerable literary skill. Not many are Dostoevsky who can skillfully keep readers’ interest over three pages of mud being described. With a precise plan of your story, you will know every minute detail which you will cover. With such an approach, you will be able to know exactly how long your story will be, how many chapters it will take to cover the story, and even how many words you will need to use within each chapter. Before you even write one word towards your story, you should already know if your book will be 50,000 or 500,000 words in length. After the fun of the design then you must chore with the actual craft of writing. Here, again, if you know what you will be covering in each chapter, you can take a little extra time in trying to create literature by making each sentence you write as intriguing as you are able. Also, with a full and real plan of the story, you are not hog-tied to where to begin writing. You may write the last chapter first, or begin somewhere in the middle of the story. You just have to be careful that you do not offer a brand new trait that you never described in a character, in the last chapter. You are able, however, to cover description of a person, place or thing, over the first few chapters. ",
            "date": "Answered February 5, 2019",
            "views": "122",
            "upvotes": " Answer requested by Wynter Grahm"
        },
        {
            "author_info": {
                "name": "Valerie Douglas",
                "href": "/profile/Valerie-Douglas-11"
            },
            "answer_text": "You’re thinking too much! Relax. Nothing’s wrong. For new writers the 1st chapter of the first draft is almost always like that, it turns into an information dump. But you need to know that information - that’s when you learn about the characters, their lives, their environment. As you write the rest of the book, seed or filter it into other chapters. Fix it in the second draft, starting with the action, the catalyst for the story. A good beta reader and editor will catch anything you repeat too often - that’s what all They’re for. You’re learning the story and how to write it, so relax and just enjoy the process. ",
            "date": "Answered October 13, 2019",
            "views": "17",
            "upvotes": "0"
        }
    ]
}