{
    "title": "How is a literary work different from other works? - Quora",
    "tags": [],
    "response": [
        {
            "author_info": {
                "name": "Rivka Willick",
                "href": "/profile/Rivka-Willick"
            },
            "answer_text": "I consider literary work content that is created individually with the “author” writing directly onto paper or a screen. The content can then be rewritten by the author and corrected and edited (not the same thing) by others. Once the content is developed it can also be told or read out loud. Storytelling or oral composition is created by telling over something verbally usually with others listening and reacting. After a oral content is created and developed it can be preformed, recorded, or written down. In the case of folk tales, fairy tales or urban legends the stories are told and retold by many until they might be written down. This delineation applies to many forms. Literary Poetry is written but many is best appreciated when read out loud. Beat poetry is orally created but can be found in written volumes. Drama is conventionally literary but improvisation is also used (especially with comedy) ",
            "date": "Answered August 6, 2018",
            "views": "76",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Tom Treweek",
                "href": "/profile/Tom-Treweek"
            },
            "answer_text": "I assume you're talking about the genre of literary fiction as compared to the rest of fiction, often labeled genre fiction. As the labels suggest, genre fiction is more concerned with its given genre. They tend to be more plot-driven and use the common tropes of the genre as a kind of common, collective language (i.e. not having to establish that dungeons have booby traps or zombies eat brains). Meanwhile, literary fiction tends to focus more on character development, elevated language and/or new forms of storytelling. That isn't to say books must be exclusively literary or genre. Look at works like Danielewski's House of Leaves or Lethem's Motherless Brooklyn, which lean heavily toward literary style but incorporate strong horror and crime fiction elements, respectively. In the end, the important question isn't whether a book is literary or genre fiction. The more important questions are whether or not you enjoyed reading it, how it stretched your thinking in any way, and if it helped make you a better reader. ",
            "date": "Answered August 5, 2018",
            "views": "145",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Trevor Coote",
                    "user_href": "/profile/Trevor-Coote"
                }
            ]
        }
    ]
}