{
    "title": "How to approach writing the new SAT essay - Quora",
    "tags": [
        "Standardized Tests",
        "Essays",
        "SAT (Scholastic Assessment Test)"
    ],
    "response": [
        {
            "author_info": {
                "name": "Johnny Albert",
                "href": "/profile/Johnny-Albert"
            },
            "answer_text": "I recently took the SAT in June, and the new SAT essay wasn’t all the hype I initially thought it to be. The prompt is akin to any other prompt; preparing for the new SAT essay is literally the same thing as composing any ideal essay. However, this is the SAT, and it’s much more crucial compared to any essays you’re assigned in school. The SAT has time constraints. Keep this in mind. With that being said, you need to practice writing in essay in an hour. Keep on doing that and have a family member, friend, or even a seasoned professional, such as an English teacher, check it. That would be a good start. Attempt to gradually lower the set amount of time, depending on your specific pace in writing. Every week, try to find an interesting prompt, preferably something that revolves around current events. You can initate this process by looking at prompts you’re fascinated by, and then going on to prompts you’re not so particularly interested in. This way, you challenge yourself and essentially make yourself more pliable as time progresses, as you will be able to write any prompt, such as your personal statement for college, as long as you execute the aformentioned direction. In middle school and high school, you were most likely taught to assimilate all your thoughts on the same page, and you would jot ideas down in an outline, usually. As I previously mentioned, the SAT gives you limited time, so an outline won’t work on the actual SAT. On the day or days you intend to take the SAT, dismiss the obsolete idea of arranging ideas to put in a physical outline, as that is predominantly intended to aid people who are learning the rudimentary fundamentals of any essay, or just writing in general. You’re at the point where you should be able to swiftly think about how you want to formulate any essay. If you have been doing that with any other essay you wrote back then, do it now, but better. Begin with a mental outline as this will help you write more efficiently and rapidly, which is necessary for pivotal tests such as the SAT. I wish you the best of luck on the SAT! ",
            "date": "Answered July 8, 2017",
            "views": "13",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Jonelle Bolton",
                    "user_href": "/profile/Jonelle-Bolton"
                }
            ]
        },
        {
            "author_info": {
                "name": "Jatin Bhandari",
                "href": "/profile/Jatin-Bhandari-7"
            },
            "answer_text": "You need to be ultra-focused when taking this section as it requires you to think analytically and creatively together. Needless to say, having no SAT Essay score while applying to undergrad schools will be considered better than having a low SAT Essay score. So, take some time and decide if you want to take the SAT Essay or not. So, what can we do about it? Well, we can aim to get a perfect 8-8-8 on the essay. When you aim for perfection, the result will always be good, unless you obsess over it because I’m pretty sure that becomes a mental health risk. Anyway, moving forward we will take a look at different strategies that can help an SAT test-taker to hopefully score a perfect 8-8-8 score on their essay. Clarity of thought and language Essays anywhere are used to test the skill of the writer to get a point across. There might be addition values to the SAT essay like, evaluating the analytical skills of the writer, but the most important part while writing always is to get your point across. If the reader cannot understand what the writer wants to say, it defeats the purpose of the written piece. Similarly, your essay on the SAT is measured on how well you can put your thoughts into words. The more precise and clear your tone of the essay and sentence structure is, the better your score will be. Consistency and organization of thought So, your language and tone are very crisp and clear in the beginning. You trail off a little in the middle, but you get back to the crisp and clear language with the last paragraphs again. You’re still getting a 5. You can’t do exceptionally well in some parts of the essay and then go downhill in the others. This will definitely chip away at your score. You need to maintain the same clear tone throughout the essay to get an 8-8-8 score. You should also focus on the narration of the essay. Digressing from your points or explaining previously mentioned points at random places in your essay will also be a bad idea. Before you start writing, prepare a point-wise summary of how you want your essay to go. A flow in the narration will definitely move you further towards the perfect score. Vocabulary No one wants you to learn advanced English words to use while writing your SAT Essay. Affective writing is always writing that is simple to understand. This doesn’t mean that if you have good words in your arsenal you should keep them in there. The main reason for this point is to encourage you to use variations. Do not stick to a single word and then keep repeating it throughout the essay. Use synonyms or words that have similar connotations. Length of the essay The Official SAT Study Guide (March 2016 & Beyond) published by the College Board made two things very clear. 1. An essay must have an opening and concluding paragraph. 2. Shorter essays will be graded low. The college board says, that if an essay is only a few paragraphs long, let’s say three, it won’t be enough for the graders to understand and grade your writing style. If you use one paragraph to open the essay, another to conclude it, that means you would only have one paragraph to actually provide examples and explain them. Thus, your essay will be marked considering the lack of context in regards to your examples. Also, a long essay that goes on about something that has no relevance to the question at hand will also be scored on the lower side of the score range. Once you’re done with your essay, always revisit it with fresh eyes to eliminate any grammatical errors and improve the sentence structure wherever necessary. Something that is crucial with aiming for a high SAT Essay score is your dedication to the cause. Practicing for this section like any other section on the SAT is a must. If you can find someone to grade your essay based on the scoring techniques of the College Board, don’t let that person go. Getting your essay graded by an unbiased examiner will provide you a look into your week spots and will give you enough time to go over and improve the same. Getting an 8-8-8 score on your SAT Essay isn’t a necessity, but aiming for the start never hurt anybody. ",
            "date": "Answered July 3, 2019",
            "views": "130",
            "upvotes": "0"
        }
    ]
}