{
    "title": "How to write a letter anonymously to a woman who I know her husband is cheating on her - Quora",
    "tags": [
        "Coping with Infidelity and Adultery",
        "Infidelity and Adultery",
        "Relationship Advice"
    ],
    "response": [
        {
            "author_info": {
                "name": "Carlo La Porta",
                "href": "/profile/Carlo-La-Porta-1"
            },
            "answer_text": "It is none of your business. Stay out of it. For all you know they may have an agreement, and may not want to be told. You don’t know why he is cheating : is he just being a bad person, or is she a major pain the neck at home and he needs to get out, but can’t because of the kids or something…I don’t know and you don’t know either, even if you are a close friend of hers and she tells you all, your are only hearing her side of the story. But lets say you really do know, and he is really being a “bad person” in spite of her doing everything she can to keep him, and her really being the perfect wife and in this case victim. You tell her… then what? They divorce, the kids are hurt, the family is broken… What have you achieved really? What if, it was just a fling… what if it would have finished soon anyway, and things might have gone back to normal with a reasonably “normal” family life…which would have been better than a divorce for all involved… There are too many “what if’s”, and unknown factors that mean you can throw a big rock in their pool, and splash the shit about, but you have no idea who it will splash (kids? other family members etc), or how it will splash (will they argue and divorce, will she shoot him? will he shoot her?…), and more importantly you have no ability to foresee or impact a better future for the family as a whole, as a result of your action. ie you can destroy (something that is weak allready I admit) but if all you are leaving is a smoldering heap of ashes where nobody has gained, what was the point? Righteousness is not a virtue. It is a religious concept which has been misused to abuse others in a way the religions say they don’t intend it to be. (May he who has not sinned through the first stone) ",
            "date": "Answered October 12, 2017",
            "views": "53",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Kathy S",
                    "user_href": "/profile/Kathy-S-6"
                },
                {
                    "user_id": "Susan Jackson",
                    "user_href": "/profile/Susan-Jackson-85"
                }
            ]
        },
        {
            "author_info": {
                "name": "Aaron M. Hopkins",
                "href": "/profile/Aaron-M-Hopkins"
            },
            "answer_text": "So many unknowns here - Do they have an agreement between them concerning having an affair? Some people have those arrangements, y’know - and some have a ‘do it if you need to, but I don’t want to know about it’ deal going on. Their relationship, their concern, not yours. What if this is one-time indiscretion and the husband regrets it and wants to preserve his marriage after his mistake? Maybe he’s already confessed it, and they’re working through it, but aren’t sharing it with anyone because it’s embarrassing and ultimately a private matter. It’s not unknown for couples to have this kind of thing happen and work on the problem and go on to have a very successful marriage. Why is it your concern, in the final analysis? You aren’t part of the marriage, so what exactly is you stake in this, really? Are you going to help after the initial reveal - help her move, figure out her new financial situation, take her kids into account if there are any, counsel her into perhaps pursuing a healthier relationship in the future? Just how much of this are you willing to take responsibility for besides disrupting their relationship to satisfy your personal sense of morality? In the end, they have to work out their problems, and you have no idea of the repercussions that could come from this. So as much as it may make you grind your teeth down to nubs, I’d stay out of it and offer support afterwards. If he’s going to cheat and even leave her, then it’ll happen without your interference. ",
            "date": "Answered October 9, 2017",
            "views": "52",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Susan Jackson",
                    "user_href": "/profile/Susan-Jackson-85"
                },
                {
                    "user_id": "Pablo Halpern",
                    "user_href": "/profile/Pablo-Halpern"
                }
            ]
        }
    ]
}