{
    "title": "How to write a perfect personal statement in only 250 words - Quora",
    "tags": [
        "Personal Statements",
        "Writing Advice"
    ],
    "response": [
        {
            "author_info": {
                "name": "Nancy Murdoch",
                "href": "/profile/Nancy-Murdoch-4"
            },
            "answer_text": "I wrote my first personal statement for a Canada Council Arts grant more than 25 years ago. Since that time I have written many personal statements, each time tweaking it for a specific purpose. As I gained more life experiences and developed new skills I edited or rewrote it completely. About 10 years ago I apprenticed with a published author who helped me refine my writing even more, forcing me to cut 500 words out of a 750 word paper. My first suggestion is to be ruthless when editing. Reword the sentences and cut out every word that does not move your idea forward. I agree it’s difficult to condense all your ideals, values, beliefs, achievements and life experiences in half a page of writing, but it can be done. It will give you excellent practice for condensing any other writing you do, whether it’s resume writing, speech writing, reports, storytelling, articles for a blog or copy for your website. Since your question does not specify who or what you are writing your personal statement for, I’m answering in a general way that covers a wider range of usages. I find that the best way to write a perfect personal statement is to get REALLY clear on who I am, what I do, why I do it, how it benefits someone else and why I’m qualified. When you are very clear on those 5 points, you will require fewer words to express your thoughts. It usually takes more time and lots of rewrites to keep honing it down to the bare essence, but the final result is cleaner, shorter and more concise. It will make people remember you because you took them to the heart of the concept you are trying to convey. Unfortunately people don’t have time read our autobiographies, nor do they want to, so pick one theme for your statement and stay focused. Think of yourself as a business and your personal statement as your mission statement. Yes, they are a little different but it’s basically similar with minor variances. This is applicable to any personal statement you need to write, whether it’s on an application to get into college, to have your work accepted in an art show, used on the About Me page of your website, or for a job application. The core principles are the same, but you need to tweak it for your particular application. I recommend you write a personal mission statement in one sentence, then expand upon that in the body of your writing by telling your story and giving real life examples to support your main theme. In the example below I wrote a one sentence personal business ‘pitch’. I didn’t include it in my personal statement but it allowed me to get clear on what I do, why I’m doing it and the value I’m bringing to others. Once I got clear, I could then expand upon my ‘story’ and add pertinent details. “I help grandparents find purpose, value, and a deeper sense of belonging by turning their life experiences and fond memories into audio legacies for their grandchildren in a way that is fun for them, and entertaining for their loved ones.” Questions to consider: What do you do?What do you stand for?Why do you do it?Who do you do it for?What problem do you solve for the person reading your statement?How does what you do benefit others? How is someone’s life going to be better because of what you have to offer?What makes you stand out from the rest?I invite you to read my Personal Statement. You may also be interested in a FREE, short online course I created called Write Your Life Stories Quick Start Kit. It’s focused on helping people get started writing their life stories, but it crosses writing genres and will help you get started, narrow your focus, write a catchy first sentence and find a theme for your personal statement. It’s absolutely free, and you could learn some great tips from it. Hope this helps, Nancy nancymurdoch.com ",
            "date": "Answered May 16, 2017",
            "views": "48",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Asiger Erupe",
                    "user_href": "/profile/Asiger-Erupe"
                },
                {
                    "user_id": "Jes",
                    "user_href": "/profile/Jes-41"
                },
                {
                    "user_id": "Shane Lai",
                    "user_href": "/profile/Shane-Lai-6"
                }
            ]
        },
        {
            "author_info": {
                "name": "Lucas Briggs",
                "href": "/profile/Lucas-Briggs-4"
            },
            "answer_text": "Hello! A personal statement for scholarship 250 words is difficult to write but still it is not impossible. If you are a newbie in this circle, then you are going to have some hard time writing but do not give up. If you adhere to the rules, you will complete a perfect statement on time.  What you have to put in your statement are the most vital things about your career choice, your motivation, meaning that you should argument why you have chosen this very sphere. Tell about the experience you had(if you had it will be a huge advantage). Tell about your future, whom do you want to be and what are your targets. The information should be extremely laconic precise.Do not poor to much water, you do not have space for that.Also, you should not forget about the style and special rules for writing.Wish you luck!:) ",
            "date": "Updated January 2, 2018",
            "views": "21",
            "upvotes": "0"
        }
    ]
}