{
    "title": "How hard is it to be a journalist? - Quora",
    "tags": [
        "Journalists",
        "Journalism",
        "Jobs and Careers"
    ],
    "response": [
        {
            "author_info": {
                "name": "Pavel Adamek",
                "href": "/profile/Pavel-Adamek-1"
            },
            "answer_text": "There are not that many professions that you have to actually love in order to do them. Journalists love their job, which is why the adjective \"hard\" is not an issue for them. If you are asking from the perspective of a person who wishes to be(come) a journalist, well, you have to be smart, you have to be able to work with fact and information and know where to find it, and you have to be a people's person. Oh, and you must have some writing skills, which develop over time. So yes, these skills may be hard for some people... Of course, even longtime journalists have a hard time doing what needs to be done. You do not work from-to. A major event may happen two minutes after you finish all your work for the day, when you are two steps from the elevator. You never know. So yes, this may be hard. But everyone knows it before they become a journalist. On the other hand, you meet the most interesting people and witness the most amazing of events. It is a very rewarding job.    ",
            "date": "Answered April 21, 2016",
            "views": "69",
            "upvotes": " View 16 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Ananya Chaudhuri",
                    "user_href": "/profile/Ananya-Chaudhuri-11"
                },
                {
                    "user_id": "Sara Spagnoletto",
                    "user_href": "/profile/Sara-Spagnoletto"
                },
                {
                    "user_id": "Dusty McGarry",
                    "user_href": "/profile/Dusty-McGarry"
                },
                {
                    "user_id": "Paul King",
                    "user_href": "/profile/Paul-King-253"
                },
                {
                    "user_id": "Amy Collins",
                    "user_href": "/profile/Amy-Collins-300"
                },
                {
                    "user_id": "Janet Ybarra",
                    "user_href": "/profile/Janet-Ybarra"
                },
                {
                    "user_id": "Tom Barry",
                    "user_href": "/profile/Tom-Barry-72"
                },
                {
                    "user_id": "Debashish Mukerji",
                    "user_href": "/profile/Debashish-Mukerji"
                },
                {
                    "user_id": "Khadijah W",
                    "user_href": "/profile/Khadijah-W"
                },
                {
                    "user_id": "Jock Ellis",
                    "user_href": "/profile/Jock-Ellis"
                }
            ]
        },
        {
            "author_info": {
                "name": "Tanya Bagchi",
                "href": "/profile/Tanya-Bagchi-1"
            },
            "answer_text": "Working hard is the mantra of any profession. As for journalism is concerned, a degree can only give you a sketchy idea of what journalism is and some of the technical areas of journalism. However, a person can become a journalist if he or she has a nose of news. Most importantly, one must get it clear which genre he or she is interested in - print or audio-visual. You must be clear that a journalist needs to keep him or her updated with all information available. Exhaustive reading of newspapers, watching news channels are must. This actually enables a prospective journalist to imbibe the language used in news reporting. In addition to this, reading books be it any thing - fiction, non-fiction, classics would help to improve vocabulary. Literal meaning of both the words stand as - Reporter who reports, and a Journalist is someone who is attached with the field of journalism. It is also important to keep on improving the sources of news and work accordingly. Reporting regular news does not help you to stand out in the industry. It is the special news, analytical stories, bylines and breaking stories which make a Reporter a Journalist. A reporter must aim to ensure that he he or she is recognised by the special stories done. It is just important that you must strive to do something special, write differently, present it first - breaking the news first. This is what I have gathered from my experience of journalism for past 15 years with some of the leading dailies here in Kolkata, West Bengal, India. ",
            "date": "Answered April 15, 2020",
            "views": "1",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Ahiabuike Covenant",
                    "user_href": "/profile/Ahiabuike-Covenant"
                },
                {
                    "user_id": "Ananya Chaudhuri",
                    "user_href": "/profile/Ananya-Chaudhuri-11"
                }
            ]
        }
    ]
}