{
    "title": "How to feel when someone types 'smh' - Quora",
    "tags": [
        "Understanding Emotions",
        "Human Behavior"
    ],
    "response": [
        {
            "author_info": {
                "name": "Leslie Crawford",
                "href": "/profile/Leslie-Crawford-1"
            },
            "answer_text": "I dislike it, compared to using actual words. I think we’re becoming over-reliant on these abbreviations. I understand using them in chat online rather than typing out a long phrase. However, I completely abhor people using “u” for “you” and other such abbreviations. You’re saving yourself TWO letters. What really upsets me is that these abbreviations are carrying over into our other written words. We use these in our emails and I’ve seen them in letters and school papers as well. What’s more unfortunate than ANY of these things is that it’s now seeping over into spoken word. I’ve heard LOL and OMG spoken out loud more times than I care to recall and several other things like this are coming out more and more often. I guess I’m just a fan of proper English. *smh* *grin* ",
            "date": "Answered July 7, 2017",
            "views": "23",
            "upvotes": " View 5 Upvoters",
            "upvoters": [
                {
                    "user_id": "Virginie Lemarchand",
                    "user_href": "/profile/Virginie-Lemarchand"
                },
                {
                    "user_id": "Adrian Azran",
                    "user_href": "/profile/Adrian-Azran"
                },
                {
                    "user_id": "N.A. Naj",
                    "user_href": "/profile/N-A-Naj"
                },
                {
                    "user_id": "Ahmad Zulizham Mohd Sham",
                    "user_href": "/profile/Ahmad-Zulizham-Mohd-Sham"
                },
                {
                    "user_id": "Mel Smith",
                    "user_href": "/profile/Mel-Smith-44"
                }
            ]
        },
        {
            "author_info": {
                "name": "Richard P. Morrall",
                "href": "/profile/Richard-P-Morrall"
            },
            "answer_text": "I thought, “Something new I have to look up, and I am on the tablet so it will mean a bunch of key strokes and when I get back to Quora, the question will probably be gone.” Still, I did, and now I know that if I click on the question, I can save time by reading the comment! SMH. I like it. I wish Facebook had a SMH response button. It fits my response quite often. It is not mean. I will probably not use it because I never use any of these as I never think to do so when I am typing. I read them fine; I just never use them. Reading and writing must be in different parts of the mind. ",
            "date": "Answered July 8, 2017",
            "views": "16",
            "upvotes": " View 4 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Greg Burns",
                    "user_href": "/profile/Greg-Burns-5"
                },
                {
                    "user_id": "Martha Lancaster",
                    "user_href": "/profile/Martha-Lancaster"
                },
                {
                    "user_id": "Dave Garfield",
                    "user_href": "/profile/Dave-Garfield"
                },
                {
                    "user_id": "Robert Thornton",
                    "user_href": "/profile/Robert-Thornton-2"
                }
            ]
        }
    ]
}