{
    "title": "How to build a career in technical writing - Quora",
    "tags": [
        "Jobs and Careers in Writing",
        "Technical Writing",
        "Career Choice Advice",
        "Career Choices",
        "Writing",
        "Jobs and Careers"
    ],
    "response": [
        {
            "author_info": {
                "name": "Ugur Akinci",
                "href": "/profile/Ugur-Akinci"
            },
            "answer_text": "You can get a job as a technical writer in one the three ways: Work on your own as a freelancer.Work for a job agency or staffing agency as an independent contractor.Work on the payroll as a part- or full-time writer of a company/corporation.Each has its advantages and disadvantages. For example, let me summarize the positive and negative points of working on your own as a freelance technical writer. FOR FREELANCE EMPLOYMENT: You write your own check. No upper limit to how much you can earn (in theory).You set your own working hours, work place, and style of work.You get to know interesting people and work on a variety of changing projects.You can leverage your written work easily into learning and training modules, books, podcasts, webinars, etc.AGAINST FREELANCE EMPLOYMENT: Need to market yourself constantly.Need to keep meticulous tax records.Need to pay for your own taxes, medical insurance, and other professional fees.The minute you stop writing, your income also stops. Like when you are sick, or when it’s an official holiday, you don’t get paid for occasions like that.Or let’s look at regular payroll employment: FOR PAYROLL EMPLOYMENT: Guarantee of incomeNo need to market your servicesNo need to find the next clientMedical coverageDental and vision coveragePaid vacationsPaid training and travelPension Plan (if any, since most companies are phasing out of pension plans)401K PlanAGAINST PAYROLL EMPLOYMENT: Daily commuteNeed to put in 40 hours a week (for full-time positions)Working under a manager in an officeNeed to play the “office politics” and get along well with othersInability to select projectsNeed to comply with HR rulesNeed to use corporate guidelines and templates“Glass ceiling” to incomeThe work can become stale and uninteresting over timeSo it all depends on the kind of life you are trying to lead, your values (what is most important for you in life), what kind of a personality you have, and other factors like that. If you visit my web site Technical Communication Center and search for keywords “job” and “employment” you’ll see that I’ve written a lot about this topic to help my fellow technical writers, all freely available. Good luck to you! ",
            "date": "Answered April 30, 2017",
            "views": "14",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Sow Myth",
                    "user_href": "/profile/Sow-Myth"
                },
                {
                    "user_id": "Kate Greer",
                    "user_href": "/profile/Kate-Greer-11"
                },
                {
                    "user_id": "Milena Alexandrova",
                    "user_href": "/profile/Milena-Alexandrova"
                },
                {
                    "user_id": "Tugce Kasikci",
                    "user_href": "/profile/Tugce-Kasikci"
                }
            ]
        },
        {
            "author_info": {
                "name": "Sean Leary",
                "href": "/profile/Sean-Leary-1"
            },
            "answer_text": "I am not a technical writer, but this is what I have observed: Get yourself a copy of a corporate style guide. They tend to be pretty similar. Read and internalize the entire doc. Learn Word, Framemaker, and DITA.  You won't believe how skillful an experienced tech writer is with those tools. Apply for jobs at all of the Fortune 500 companies, not just the top tier tech companies.  Glassdoor.com is your friend, you will find many tech writing positions for a mix of large and small companies, at least if you check in the tech cities like San Jose.Be advised that I think tech writing may be under siege as a profession. Companies seem to be doing much more with much fewer resources.Tech writing is a cost center, not a profit center. When management makes cuts, they tend to look to the cost centers first.With a CS degree, unless you really love writing (and who doesn't?) you will probably find software development to be more rewarding. In a professional shop you will get lots of opportunities to write documents of various types (design specs, functional specs, etc).Here are a few links to help you get started:Online Proofreader  The Punctuation Guide English Grammar & Composition: Tips, Terms, Examples Grammar Bytes!DITA Version 1.2 SpecificationDITA Quick reference guide introduction  Good luck! ",
            "date": "Answered November 5, 2015",
            "views": "761",
            "upvotes": "0"
        }
    ]
}