{
    "title": "How to write a modern fantasy novel? What are the elements I need to add for modern fantasy - Quora",
    "tags": [
        "Fantasy (genre)",
        "Novels"
    ],
    "response": [
        {
            "author_info": {
                "name": "Ken Hughes",
                "href": "/profile/Ken-Hughes-10"
            },
            "answer_text": "I’d say it’s less about adding the modern world to Tolkienian fantasy—it’s either adding fantasy to a modern setting and its storyline, or starting with a concept that already combines the two. Like any writing, the less sure you are what to write about, the less likely you’re ready to write anything yet. Most suggestions here say to start by reading heavily, and that’s as much to find a style or idea that speaks to you as to see how it fits together. Some contemporary fantasies have been strictly ordinary coming-of-age stories, except that the protagonist is dealing with being a witch; some have been murder mysteries where the detective is secretly a demon (the detective, not just the killer; that would be horror). And those are the simpler models; there are many more that aren’t as based on any other kind of story. Mainly, writing a modern fantasy needs good storytelling overall. Whatever parts of the modern world you use, use them to make the effect you want. Archeologists digging at an ancient site could capture a real scholar’s sense of wonder, or the locals’ fear at having their town overrun by city folks—and you play that off the strangeness of what they unleash. A detective trying to police the wizard underground and the secret labs they work for should have a sense of how secrets and industrial spying works in the city. And like any fantasy, the magic and monsters need to be designed to fit the story—the more unique and exciting the better—and handled clearly enough that they don’t contradict themselves. And most of all, the characters and their trials have to connect with the reader. It’s a story. You can read how fantasy works with a modern setting, but most of all they have to make it work as a story. ",
            "date": "Answered May 11, 2018",
            "views": "399",
            "upvotes": " Answer requested by King Hall",
            "upvoters": [
                {
                    "user_id": "Ilana Halupovich",
                    "user_href": "/profile/Ilana-Halupovich"
                }
            ]
        },
        {
            "author_info": {
                "name": "Kenneth Schwab",
                "href": "/profile/Kenneth-Schwab"
            },
            "answer_text": "As with anything writing-related, you have to read within your genre to understand what works and what doesn’t. My recommendation? Read the Dresden Files. It’s about a modern-day wizard who helps the police solve crimes that were committed using magic. It’s got potions, faeries, vampires, a mystical land of foul creatures, rites, rituals, spells, magic symbols, a White Council of grumpy old wizards enforcing magical rules, an air spirit living in a skull, and much, much more. Another place to look would be Hellboy, both the comics and the movies. Those are classic examples of modern urban fantasy. ",
            "date": "Answered May 3, 2018",
            "views": "266",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Ilana Halupovich",
                    "user_href": "/profile/Ilana-Halupovich"
                }
            ]
        },
        {
            "author_info": {
                "name": "Tina Kane",
                "href": "/profile/Tina-Kane-5"
            },
            "answer_text": "You really need to immerse yourself in the novels of this genre before you start writing in it. It’s a complex genre that has too many intricacies to list. I would suggest reading, Dresden Files by Jim Butcher, The Mercy Thompson series by Patrica Briggs, The Jane Yellowrock Series by Faith Hunter and go from there. Even Twlight has some elements that could be useful, if you’re willing to deal with the story as a whole. As any writer will tell you, the best thing you can do is read. Good Luck! ",
            "date": "Answered May 4, 2018",
            "views": "156",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Bennett W. Nelson",
                    "user_href": "/profile/Bennett-W-Nelson"
                },
                {
                    "user_id": "Jonathan Keiler",
                    "user_href": "/profile/Jonathan-Keiler-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Ilana Halupovich",
                "href": "/profile/Ilana-Halupovich"
            },
            "answer_text": "Check out Charles de Lint Dreams Underfoot (Newford, #1) This is a collection of stories. All of them happen in the fictional city of Newford. All could take place at your doorstep. Or could they? ",
            "date": "Answered May 5, 2018",
            "views": "214",
            "upvotes": " View 2 Upvoters"
        }
    ]
}