{
    "title": "How to write about yourself without using 'I' constantly - Quora",
    "tags": [
        "Morphology (grammar)",
        "English Writing",
        "English Literature",
        "Words",
        "Literature",
        "Vocabulary of the English Language",
        "How-to Question",
        "Grammar",
        "English Grammar",
        "Writing"
    ],
    "response": [
        {
            "author_info": {
                "name": "Christopher Sudlik",
                "href": "/profile/Christopher-Sudlik"
            },
            "answer_text": "People are not interested in you, or me, or anybody. They are interested in themselves and what you have done for others. When you use \"I\", you are talking about how you percieve yourself and what you do for yourself, which is not useful to somebody who isn't interested in you. You need to talk about what you have done on the world using the voice of how you impact others, the world, and how they impact you, and when you have to, use \"I\", but if you find yourself using it frequently, realize you are boring the self obsessed person reading it for being yourself self obsessed. I would advise against the passive voice. It is dull, dreary, and makes you sound like a robot. A lot of linguistic rules are designed around trying to make language idiot-proof, but the fact is, you can't. You have to see what is happening and know what you want to do and how you want to explain it. You can't just follow a template in language, it won't get you any further than a job in retail or call centers. ",
            "date": "Answered June 25, 2015",
            "views": "155",
            "upvotes": " View 12 Upvoters",
            "upvoters": [
                {
                    "user_id": "Ashley Clifford",
                    "user_href": "/profile/Ashley-Clifford-6"
                },
                {
                    "user_id": "Colby Smith",
                    "user_href": "/profile/Colby-Smith-7"
                },
                {
                    "user_id": "Chandan Sinha",
                    "user_href": "/profile/Chandan-Sinha-8"
                },
                {
                    "user_id": "Sarah Sim",
                    "user_href": "/profile/Sarah-Sim-30"
                },
                {
                    "user_id": "Drake Pearson",
                    "user_href": "/profile/Drake-Pearson-4"
                },
                {
                    "user_id": "Jawaid Akhter",
                    "user_href": "/profile/Jawaid-Akhter-6"
                },
                {
                    "user_id": "Diana Patterson",
                    "user_href": "/profile/Diana-Patterson"
                },
                {
                    "user_id": "Thara Ravishanker",
                    "user_href": "/profile/Thara-Ravishanker"
                },
                {
                    "user_id": "Crina Pundichi",
                    "user_href": "/profile/Crina-Pundichi-1"
                },
                {
                    "user_id": "Richard Brockbank",
                    "user_href": "/profile/Richard-Brockbank"
                }
            ]
        },
        {
            "author_info": {
                "name": "Robert Ball",
                "href": "/profile/Robert-Ball-36"
            },
            "answer_text": "What does write about yourself mean? Are you talking about literally describing yourself? Physically? Avoiding I might be pretty hard there. You could adopt the third person (he was tall; etc) but using that device can be awkward and can arguably be as annoying as overusing I.Are you talking about communicating your observations? In that case, you can just state your observations as fact (it was cold and bleak; the wind cut through exposed skin like a knife); since it’s implicit that they’re your observations, using I is unnecessary. Another technique might be to talk about yourself by focusing on describing other people and how they affect you. Bottom-line, though: if you’re talking about yourself, you are going to have to use I at some points. The goal (other than to avoid talking about yourself too much) is just to avoid using it when there’s any reasonable way to do so. ",
            "date": "Answered November 17, 2017",
            "views": "71",
            "upvotes": " View 2 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Paul Shkroba",
                    "user_href": "/profile/Paul-Shkroba-3"
                },
                {
                    "user_id": "Alex Beale",
                    "user_href": "/profile/Alex-Beale-4"
                }
            ]
        }
    ]
}