{
    "title": "How to improve my answer writing for the GS paper - Quora",
    "tags": [
        "Academic Papers",
        "Union Public Service Commission of India"
    ],
    "response": [
        {
            "author_info": {
                "name": "K V Lakshmi Janardhan",
                "href": "/profile/K-V-Lakshmi-Janardhan"
            },
            "answer_text": "Hello Senthil first of all all the best for your preparation. I would like to say that the preparation must be very much attentive that even you visit any wedding or any big shop you must learn something from it like tax on the product or how wedding is managed and so on. Now coming to your point that improving writing skills is the very most important task all aspirants to do, because it is the one which decides and differentiate you from others. The UPSC mains examination requires effective content with less length. Length is not important but content matters much. You need to read the THE HINDU paper editorials and see the way of structuring the editorial and the way he/she using the vocabulary. You must be in that way and using heavy vocabulary is also not good. If you write any answer it must be understood by even 8th class student. You must concentrate on the NCERT books information and how he briefly an effectively gives you the information and in such a way you must. Approach towards answer must be different that it must be practical and you must not be in -ve for government. Point wise answering also makes you good towards evaluator and even it makes you to feel not to be confused. The main important point you must keep in mind is that answering withing the space he given is must and so you must have a habit of making a effective gist of any answer. Follow the magazines like Yojana and Kurukshetra and also Frontline and mainly THE HINDU paper. These will give you the brief and effective writing skills. Once watch online videos to listen them because listening will be clear and so you will be understood correctly. Hope you got the answer if not you can ask me I will give clarity on which you have asked. Thank you. ",
            "date": "Answered December 24, 2017",
            "views": "564",
            "upvotes": " Answer requested by Senthil Kumar"
        }
    ]
}