{
    "title": "How to start SEO freelancing - Quora",
    "tags": [
        "Freelancers",
        "Freelancing",
        "Startups"
    ],
    "response": [
        {
            "author_info": {
                "name": "Renuka Akter",
                "href": "/profile/Renuka-Akter"
            },
            "answer_text": "Search engine optimization is not an innate thing for everyone. To help websites evolve better in terms of search engine positioning, many choose to hire SEO experts or agencies that do this work.  Even if some people start to take care of SEO tasks by themselves thanks to all the tutorials on the internet, there is always a moment when they will need help to refine their SEO strategy. This further implies the importance of SEO professionals in the lives of website owners. Now that brings us to the relevance of embarking on a career as an SEO freelancer. If you have in-depth knowledge of SEO and have always wanted to be an SEO professional, it's worth considering freelancing in this field. I even bet you may have even thought about it, at least once. I will guide you in this article on a method to get there. I'm going to share my professional experience, my tips and how I managed after a few difficult months. Here are some essential points that you will have to manage and that you must master as a Freelance SEO consultant : Establish specificationsImprove On-Page SEOImprove Off-Page SEOProject follow-upAnd many customer management. If you are not comfortable with that, freelance status is not for you. A freelance SEO career can represent a rewarding experience in terms of human and professional experience. It is a great opportunity to take charge of your career and have professional success, working according to your own rules. You don't become a freelance SEO consultant with a little reading and because you have a book at home. To become a good SEO, you have to have good knowledge, test, make mistakes, start again and learn from all these steps. Do not start either without having already completed a project, whether personal, that of a friend or professional. Inventiveness remains a key value of this work. It will lead you to take tests which will have the merit of training you. So how do you start a freelance career as an SEO expert? The first point, the administrative procedures Yep, yes, I can already see you coming, the Freelance who wants to do everything at the Black, collect the tickets and go to work at the Maldives. But no, first, you must declare your activity. I recommend self-employment. This status will allow you to exercise within an annual turnover limit. To do this, nothing simpler. The process is simplified and you will quickly receive all the documents you will need. From an accounting perspective, I recommend using the Shine app. It allows you to create a professional bank account and indicates what you have to set aside to pay your taxes, etc. Very convenient! Measure your SEO expertise capabilities Now that you are part of the \"auto-entrepreneur\", it will be a question of estimating if you are able to exercise the profession of SEO freelance expert. If you choose to offer your SEO services as a freelance, you must be equipped with everything related to SEO. First, you must assess your skill level, if you are able to offer functional services (successful pro project, test project, etc.). You must be able to manage the referencing of all types of websites, regardless of the webmasters who have visited and regardless of the platform or CMS used. You then need to make sure that you have the appropriate resources, tools and software that would be needed to meet the SEO needs of your customers. I'm talking about powerful tools and to you. I see many freelancers asking, \"It's easy to have a cracked version of XXXXXX. \"Or,\" Who could share, and subscription with me? \" Imagine you are a delivery man. Would you share your delivery vehicle with all the delivery people in town? Worse yet, would you steal your delivery vehicle, your work tool? I hope not. Going freelance also means investing in yourself, your skills and tools. Most of the time, the cost is reimbursed after one or two clients. There are hundreds of SEO tools on the Internet, software, free online tools, tools with a subscription, ... You will find guides on which one to choose everywhere. All the tools are interesting, you can very well manage with free tools. Everything is well mastered and that they meet your needs.  Create a website and list your services Before establishing yourself as an independent SEO professional, you will need a website to market your skills and services. Having a website ensures your credibility. What could be better than a well-optimized and perfect SEO site to convince your client that you are the right person for him? This website can also be the basis for your tests. Want to test a new strategy? Nothing better than doing it on your own website. Again, the list of your services should be clear on what SEO services you offer. This will save you time by avoiding requests that do not fit your skills. Are you comfortable with technical referencing? So propose it, but if you are not sure of completely mastering an area, do tests on personal projects before proposing the service. Finding your first customers: freelance portals Once you are a self-entrepreneur, you have your website well optimized and your tools are in the start-up blocks, you are missing only the customers. Unless the referencing of your site already brings you, customers, you will have to go-to platforms to get your first customers. Here are some platforms that I use and that allow me, after having correctly informed my profile, to obtain customers. On some of them, it is the customers who approach you directly. No need to make 100 proposals per day to people who have a budget of 20 euros to position themselves on large requests. You will be able to get project proposals, which you can accept or not. I advise you first Malt which, for me, is the number 1 platform for serious projects. Here are others: UpworkFiverr Make an important watch on various networks In order to be able to have the latest good information as a freelance SEO professional, you are required to work as a professional. You have to adapt every day to this job. You need to be up to date with the latest SEO techniques, with the latest algorithm updates. Finally, what could be better than a professional who knows the latest news in the field to reassure his client? My advice is, therefore, to follow the communities on Twitter and Slack mainly. On Twitter, some profiles are must-have to follow: Olivier AndrieuPaul SanchesLaurent Bourrelly….. for Slack, there are different communities depending on your location. Just ask on Twitter to receive an invitation to join the SEO slack in your region! Last important element of the day before: SEO or SEA blogsSurely you must know them, but I give them to you because a booster bite never hurts! AbundanceWebRank InfoMiss SEO GirlBlog Semrush…Freelance SEO rate: first services? This is the hardest part for Freelance SEO for me. Am I over budgeting? Or on the contrary, are my prices too low? Difficult to navigate at the start. I know him, I've been there. The key is to do it based on your experience and the results you have already achieved. You will find many studies on the Internet on the pricing of SEO freelance consultant. Once you've gone through them, get your hourly rate, estimate how long the job will take you. Make proposals to your customers, see what emerges in general. Monthly pricing? In One-Shot? Everything will depend on the project, the client, how you work. After having completed several projects, you will have an easier time making your quotes and defending yourself on your prices. Too high a price and the customer will run away, too low a price and the customer will wonder. Do not fall into the spiral of the small price. If you are aware of your capabilities, of the results you can get, price them accordingly. In which case you will quickly find yourself with a lot of work and too little income. Manage your Freelance work pace  If you are a Freelance, you must surely work from home. The exciting thing at first, it can quickly be a trap for you. Create yourself every morning, every 2 days, a list of the things you have to do: • Prospecting clients • Site Audit • Client appointment • Creation of articles •…. You have to find your own velocity of work, but above all, you have to keep it. My advice is to stay well organized so as not to get lost among all your clients, urgent tasks or not. You can create a different table on Trello with your different tasks, urgent or not, for each client. Include WordPress credentials, important information, payment deadlines. You will have at a glance all the information concerning your client and what you have to do. Always stay cautious and attentive The job of SEO SEO is complex. There are so many areas to manage, knowledge and techniques to apply in projects that we can quickly forget some elements. Even after several projects, once you have your automatisms, always ask yourself the basic questions: \"Is the project not in no-index\", \"did I fill in my meta-titles and meta -desc? »,… All these little fears are what will make all of your projects perfect. We must not ignore them. Make yourself a checklist of basic essentials to put in place on a website! Your first projects are the most important Starting out on your freelance SEO expert career, you won't always be able to catch the biggest fish. But in order to develop yourself, all the \"small\" accumulated projects will allow you to get a lot of experience, feedback on your work, on your methods and especially to get recommendations. These assessments are very important in building your credibility as a reliable freelancer. You can start getting involved in small projects and, as you finish them, you can ask the customer for feedback and criticism. Feedback will be helpful in improving the quality of your work, while feedback will help you get more projects done. If you have no project, no reference to present to your customers or even no project that demonstrates your skills, make yourself a personal site, for a friend, position it on not too competitive requests and you can then present it to your clients. Imagine a tattoo artist who performs their first tattoo on you without first practising on the pigskin. Would you trust him? Train yourself. Everyday Once you have started the first few months of your freelance career, you will gain a lot of professional experience. However, as all of your working time will be devoted to carrying out projects for your clients, you may miss new skills or new technical knowledge.  In addition to monitoring as described above, I strongly recommend that you follow the conferences/podcast and other elements around SEO. The SEO community shares and you have to know how to catch and use all this knowledge in your projects. Many podcasts/training are broadcast on Twitter, YouTube, on all subjects of SEO. Plan to attend a conference from time to time, even if it is not directly relevant to your field. It will provide additional skills and it can give you ideas of techniques to apply to your customers. Regarding the events, here too, we are served! SeoCamp, NDDCamp, SEO fairs, etc. There is something for all tastes, all periods, and all regions. You will find professionals ready to share their techniques, their knowledge and their friendship! ",
            "date": "Answered July 10, 2020",
            "views": "15",
            "upvotes": " View 15 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Prem Sardana",
                    "user_href": "/profile/Prem-Sardana-1"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/Syed-Hafeez-Ahmad"
                },
                {
                    "user_id": "Ashad Islam",
                    "user_href": "/profile/Ashad-Islam-1-1"
                },
                {
                    "user_id": "Vicky Kosambiya",
                    "user_href": "/profile/Vicky-Kosambiya"
                },
                {
                    "user_id": "Shanu Kumar",
                    "user_href": "/profile/Shanu-Kumar-460"
                },
                {
                    "user_id": "Prafful Bhati",
                    "user_href": "/profile/Prafful-Bhati-1"
                },
                {
                    "user_id": "S.h. Polash",
                    "user_href": "/profile/S-h-Polash"
                },
                {
                    "user_id": "Mahmoud Rashidi",
                    "user_href": "/profile/Mahmoud-Rashidi-1"
                },
                {
                    "user_id": "Maria Theresa Lumbao",
                    "user_href": "/profile/Maria-Theresa-Lumbao"
                },
                {
                    "user_id": "Md Abdul Hassan",
                    "user_href": "/profile/Md-Abdul-Hassan-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Ken Larson",
                "href": "/profile/Ken-Larson-2"
            },
            "answer_text": "1. Do not promise what you cannot deliver 2. Do not overextend your resources and get a reputation for poor performance. 3. Do not tell the customer what he or she wants to hear. Tell them what they need to know. They will respect you for it. 4. Network constantly on professional sites such as Linked In. Hit the \"Answers\" feature and accumulate an \"Expert\" rating from your peers in your field. 5. Blog like there is no tomorrow. A blog is quite different than a web site. Provide good, solid information free of charge and use blog searches for synergistic businesses to team with. Teaming is an absolute necessity these days. 6. Be prepared to provide information, samples and valuable service gratis as a marketing tool. Introduce yourself and then immediately engage the client with your presentation tools available to bring your expertise to whatever topic they are interested in. Let them take you where they want to go with their concerns and their needs. Apply your presentation tools and expertise dynamically on the fly in a sincere manner to those concerns and needs and you will be in demand for follow up business. 7. Quote and bill what the client can afford and grow with him (in content and resources). 8. Be dedicated to working yourself out of a job with a specific customer and having your client take over by training him. He will remember you and recommend you to 10 others. 9. Remember growth is a function of persistence and foresight. Know where your market is headed and get their first - then write and speak about your success indirectly by helping others. Demonstrate humility and a satisfaction in helping others succeed. They will find ways to give you credit. There are ways of tooting your horn without making peoples' lights go out. 10. Word of mouth advertising from pleased clients is a sure ticket to success. ",
            "date": "Answered December 24, 2016",
            "views": "965",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Gert Mellak",
                    "user_href": "/profile/Gert-Mellak-1"
                },
                {
                    "user_id": "Arun Kumar",
                    "user_href": "/profile/Arun-Kumar-74"
                },
                {
                    "user_id": "Prateek Vishwakarma",
                    "user_href": "/profile/Prateek-Vishwakarma-11"
                },
                {
                    "user_id": "Suraj Neoopane",
                    "user_href": "/profile/Suraj-Neoopane"
                }
            ]
        }
    ]
}