{
    "title": "How would you write a dialogue between a mother and her daughter about her hostel? - Quora",
    "tags": [
        "Dialogue",
        "Daughters",
        "Mothers"
    ],
    "response": [
        {
            "author_info": {
                "name": "Dhanushanth",
                "href": "/profile/Dhanushanth"
            },
            "answer_text": "This is a widely “clinical” question if you know what I mean. You have not mentioned a setting for instance or if the relationship is stereotypical so I’d take a shot at this as a function of my personal favorite bizarre sketch. int. home for those hopeless-loo. day (like it matters.) PARVATI 78, stands at the doorway of a nasty loo that smells like, shit, with grime all around its floor, no to mention the- PARVATI {pointing to a little pit in the floor for REVATI} Look at this mess! It’s a squatting pan for heaven’s sake! Revati peers into this “pit” and cups her face. She is a 35ish model with an air of bitch about her. She is eating a pack of weird-looking potato chips -that we assume Parvati had given her to munch on, but that’s not the best part. PARVATI Like that’s gon do any good! Do you think it’s ever possible to hide from a purgatory like this when you need to take a poo!??? REVATI This is the best place we could find you in ’ere and it’s only when you poo??! Not when you eat or sleep? PARVATI Curse my father for marrying again. To think that I have to call YOu mother? What is wrong with the world today? REVATI Curse ME(!) for marrying your 70ish father. PARVATI You don’t even know how old he is! You only wanted his money!!! Now get me out of here by jove! REVATI Fine! {Walking out} But don’t forget your false teeth! They had fallen into the commode. The half-blind ageing daughter sticks her hand into the toilet with an air of disgust, gropes around the unflushed brownish-red feces- PARVATI By Jove! {smiles} Found it! REVATI Oh god please don’t tell me you- And yes, Parvati shakes it in the air rapidly, apparently to rub away the ungodly sludge clean, and sticks it in her mouth. PARVATI {Adjusting her jaws} What? REVATI {Stifling a retch} Nothing. Revati Retches. Retches again, and vomits weird looking chips that are actually wriggly worms around half-digested potato. Version:0.9 StartHTML:0000000257 EndHTML:0000003317 StartFragment:0000000293 EndFragment:0000003281 SourceURL:https://www.google.lk/search?q=infest+papa+roach+youtube&oq=infest+papa+roach+youtube&aqs=chrome..69i57j0.10423j0j7&sourceid=chrome&ie=UTF-8  ",
            "date": "Updated December 14, 2019",
            "views": "15",
            "upvotes": "0"
        }
    ]
}