{
    "title": "How to know when an illustration is good enough to publish in a novel - Quora",
    "tags": [
        "Illustration",
        "Book Writing",
        "Fantasy (genre)",
        "Book Publishing",
        "Drawings",
        "Publishing",
        "Novels",
        "How-to Question"
    ],
    "response": [
        {
            "author_info": {
                "name": "Chris Lockwood",
                "href": "/profile/Chris-Lockwood-4"
            },
            "answer_text": "Don't. Unless you’re creating a graphic novel or a children’s book, don’t do it. I’m a professional illustrator and I love to read. I will even admit that I sometimes buy novels based on their cover art. But rarely has there been any examples of artwork in or on a book that was as good as the way I imagined it when I read it. Typically, when a publisher agrees to print a book, they will make the decision on which illustrator they use for the cover. They have experience to know what kinds of covers sell books. And since they are footing the bill for the printing and distribution, I’d let them do it, unless you’re a famous writer and your name alone will sell books. I’d make exceptions for something that’s important to the plot, like a map or a rune, or any other graphic that would be difficult to describe accurately. But I’ve read thousands of books in my lifetime, and I remember bad illustrations when they distract from the quality of the writing, and I rarely remember any of the good ones, since they were rarely needed. If your writing is really good, you’ve already described your character well enough for someone to visualize her in their head. No illustration you do will be as good as that picture. This is often why many people hate movie adaptations of books they loved. And unless you’re a graphic novelist, chances are your drawing isn’t as good as your writing. And looking at your drawing, I would critique it as being unfinished at best, a little stiff and somewhat derivative. If you think it’s important to the story, research illustrators you like and hire one to do the illustration based on past work they have done. ",
            "date": "Answered June 6, 2016",
            "views": "318",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Juan Pablo Forero",
                "href": "/profile/Juan-Pablo-Forero"
            },
            "answer_text": "It's really difficult to say when you have a finish product, that feeling that is just enough. How to know? You should try to go a little bit farther, I mean, you have to take the risk to ruin the work so you know next time how much to do. The problem with this approach is that you can ruin a good job but you have to take that risk to advance. Another way is to leave the work to rest for a few days, just as you would with a text (I’m a plastic artist and writer as you are, so I understand your position). Then comeback and see how you feel with the work, that's what I do with what I do, and I can feel if it's enough or not. Another thing you can do is to check with someone you trust and that knows about art or at least that enjoy it. My wife and my mother are my hardest critics, they are extremely honest and my mother painted for more than 20 years, and my wife really knows about art and used to draw very well. Now about your work. It's very good but in order to know more, I would have to see a finished work, with color would be nice or at least completely finished, this one, as you say, feels like a sketch and that's because you feel the lines are not well defined. It could be a finished work if you clean the lines and make it feel better outlined. Again, it's a good work, just need some work in the details. ",
            "date": "Answered June 5, 2016",
            "views": "283",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Natalia Popova",
                    "user_href": "/profile/Natalia-Popova"
                }
            ]
        }
    ]
}