{
    "title": "How to get good recommendation letters for graduate school - Quora",
    "tags": [
        "Graduate School Admissions Recommendation Letters",
        "Recommendation Letters",
        "Graduate School Admissions"
    ],
    "response": [
        {
            "author_info": {
                "name": "Sasha Zarins",
                "href": "/profile/Sasha-Zarins"
            },
            "answer_text": "Given that you didn't provide much information about your relationship with your letter writers I'm going to answer as if you are like many students. Many students don't have much of a relationship with very many professors and tend to ask professors of classes they did well in. The more information you can give them upfront as early as possible will improve your chances of getting a good letter. Create a folder (can be electronic or paper) that includes your statement of purpose (and responses to any other essay questions for the application), transcript, resume/CV, and writing samples (or assignments samples) from the class(es) you took with the professor. Also make sure to include all information about the programs and scholarships you are applying to. If they require hard copies to be sent in provide stamped and addresses envelopes for all letters, also include a reference sheet with due dates & links to the program and/or online submission form. If you are worried about bothering them with reminders, set up the expectation from the beginning. When you give them the packet of information say something like “As long as it is okay with you, I will email you two weeks before each due date and the day before each due date to remind you of the upcoming deadline and to make sure you don't need any more information from me.” Then make sure to actually do what you said! In terms of the number of applications, 9 is not unreasonable at all so professors will expect it and won't be surprised by it. If possible give them all the necessary information 6–8 weeks before the first deadline. Many professors require at least 2–4 weeks so the extra time is helpful for them. ",
            "date": "Answered February 23, 2017",
            "views": "11",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Brian Kang",
                    "user_href": "/profile/Brian-Kang-76"
                },
                {
                    "user_id": "Carly Gunnett",
                    "user_href": "/profile/Carly-Gunnett"
                },
                {
                    "user_id": "Yiyu Xu",
                    "user_href": "/profile/Yiyu-Xu"
                }
            ]
        },
        {
            "author_info": {
                "name": "Lalitha Rajagopal (லலிதா ராஜகோபால்)/(లలిత రాజాగోపాల్)",
                "href": "/profile/Lalitha-Rajagopal-லலிதா-ராஜகோபால்-లలిత-రాజాగోపాల్"
            },
            "answer_text": "Yea… Lets be honest here….the word “good” is subjective…. Not all professors could place you in their memory and hence that might cost our recommendation letter. I too lost contact with my ex professors who taught me. I have a habit of taking picture with my professors as it serves as a good platform to remember me. And I also have another habit of emailing them during my degree course regarding my assignments and receiving their feedback. In case, if they forget you, the email and your past academic certificates along with two or three research projects you have dealt with could be used to recall and assess your ability to come up with a decent recommendation letter. That is for those who have lost touch with professors.For some professors, they will expect you to come up with a write up and they would edit your letter if they remember you. For those, whom I am keeping in touch, I make sure they are kept in touch via handphone (some via whatsapp or viber) and Facebook (which I think its an excellent platform to maintain contact with)! Another platform, thanks to another PhD friend in Sydney, he recommended me “Researchgate”. Its an excellent place to connect with your ex professors (provided they are registered as well) and keep track or remember your past research (hopefully). I was fortunate to get recommendation letters from National University of Singapore and The Australian National University as they remembered me :) ",
            "date": "Answered February 15, 2017",
            "views": "917",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Ashok Rajendran",
                    "user_href": "/profile/Ashok-Rajendran-12"
                }
            ]
        }
    ]
}