{
    "title": "How to write a letter to the editor of an English daily drawing the attention of the authorities concerned to the scarcity of water supply in your area - Quora",
    "tags": [
        "Water Scarcity",
        "Water Supply",
        "Scarcity (economics)",
        "Writing Letters",
        "Writing Advice",
        "Writing"
    ],
    "response": [
        {
            "author_info": {
                "name": "Chandrika Dey",
                "href": "/profile/Chandrika-Dey-3"
            },
            "answer_text": "Thank you for this question It's like you are asking me to pen down the letter for me. I will write the body part rest salutations and address should be added by you. Coming back to your question Municipality Xyz area is facing water scarcity problem for a long time. Numerous complaints have been made so far resulting in no response. In this crisis situation where we are unable to step out of the house and avoid unnecessary contact you are adding water issues to our worry. How will you maintain hygiene without water? Try to understand the severity and take actions immediately. Hope I am able to solve your query ",
            "date": "Answered June 21, 2020",
            "views": "162",
            "upvotes": " Answer requested by Pranay Brahma"
        },
        {
            "author_info": {
                "name": "Konduru Sarma",
                "href": "/profile/Konduru-Sarma"
            },
            "answer_text": "Take their address from the news paper or website, write a letter addressed to the editor and post it either registered post or cetrificate of post. There is no guarantee either it will be read or published. Letters to the editor are not meant to bring it to the attention of the govt, it is only for the public to read. News papers have zero authority over the govt and are riddled with politics themselves. Instead of that, if you have any evidence or witness, go to court with a PIL. ",
            "date": "Answered June 17, 2020",
            "views": "50",
            "upvotes": " Answer requested by Pranay Brahma"
        }
    ]
}