{
    "title": "I am not sure about becoming a writer or not. I am feeling doubtful about this. Is writing right for me? Is writing hard? Should I become a writer? What should I do about this? - Quora",
    "tags": [
        "Creative Writing",
        "Writers and Authors",
        "Writing Advice",
        "Writing",
        "Career Advice"
    ],
    "response": [
        {
            "author_info": {
                "name": "Lukasz Laniecki",
                "href": "/profile/Lukasz-Laniecki"
            },
            "answer_text": "Start writing and you will see. Starting is always a thousand times better than pondering / debating your options / choices. If you are only pondering / debating your options / choices you only learn the basics about certain professions. You don’t know what it is like to be this or that, do certain things day in day out. Which means you can’t really tell whether it is for you or not. You can only guess. And you know how it is with guessing. You will be right sometimes, and sometimes you won’t. Why? Because you are not a prophet. You don’t need to be a hired writer or have a book deal or be a paid freelance writer to start. You only need time and a tool. Start and see for yourself. How the hell should we know if writing is for you? We’re not you. Is writing hard? For some it’s hard, for some it isn’t. ",
            "date": "Answered February 19, 2020",
            "views": "81",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Jim Grossmann",
                "href": "/profile/Jim-Grossmann"
            },
            "answer_text": "Original Question: I am not sure about becoming a writer or not. I am feeling doubtful about this. Is writing right for me? Is writing hard? Should I become a writer? What should I do about this? one: How much do you read? According to mega-author Stephen King, “if you don’t have time to read, you don’t have time to write.” two: Can you write in your target genre for at least one hour every day? Week after week, month after month, year after year? If you can’t, then being a writer is not right for you. three: Writing publishable work is hard, and calls for a lot of revision. four: Most writers, like most actors, don’t make a living from their writing. ",
            "date": "Answered February 18, 2020",
            "views": "39",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Valorie Lennox",
                    "user_href": "/profile/Valorie-Lennox"
                }
            ]
        }
    ]
}