{
    "title": "I am looking for a content writer. How can I find one? - Quora",
    "tags": [
        "Content Writing",
        "Content Marketing",
        "Writers and Authors",
        "Writing Advice",
        "Writing"
    ],
    "response": [
        {
            "author_info": {
                "name": "Michael Leonhard",
                "href": "/profile/Michael-Leonhard-3"
            },
            "answer_text": "If you’re having trouble creating quality content for your website, you’re not alone; 60% of businesses struggle to produce enough content, and 65% have trouble with content quality. Outsourcing can be a great solution to this problem, so long as you can find a qualified writer capable of producing the kind of content you need. When looking for writers, you can either find them directly yourself, or go through a marketplace. Direct Hiring There are several ways to look for freelancers directly. The most popular pathways include: Job boards like Freelance Writing and ProBloggerFreelancing platforms like Upwork and FiverrWriter referrals and recommendationsGoogle searches for writer portfoliosUnfortunately, working with freelancers directly can make you feel like a one-person HR department. You’ll have to juggle responsibilities like sifting through writer resumes and negotiating pay on top of communicating project expectations and reviewing drafts. Writer Marketplaces If you want someone else to handle the logistics of finding a writer, consider going through a marketplace. Content marketplaces field writer applications, check credentials, monitor quality, and match writers with projects based on their skill sets and writing styles. While there are dozens of options, it’s best to go with a reputable marketplace. Some of the better-known options include Compose.ly, Scripted, and Contently. Affordable Content Writing Services & Platform | Hire Content Writers | Compose.ly, in particular, has professional content writers with niche expertise in a wide variety of fields, including finance, fashion, technology, entertainment, and more. In addition, Affordable Content Writing Services & Platform | Hire Content Writers | Compose.ly offers: The same high-quality work you would expect from in-house writers or agency talent at a lower costComprehensive account and project management servicesAutomated writer paymentsAn intuitive software platform with in-app messaging and direct writer communicationIn-house editingA 100% satisfaction guaranteeDisclaimer: I work at Affordable Content Writing Services & Platform | Hire Content Writers | Compose.ly. ",
            "date": "Answered July 29, 2019",
            "views": "973",
            "upvotes": " View 8 Upvoters",
            "upvoters": [
                {
                    "user_id": "Stephen Akins",
                    "user_href": "/profile/Stephen-Akins-11"
                },
                {
                    "user_id": "Jono Chow",
                    "user_href": "/profile/Jono-Chow"
                },
                {
                    "user_id": "Corey Miller",
                    "user_href": "/profile/Corey-Miller-185"
                },
                {
                    "user_id": "Melisa Vargas",
                    "user_href": "/profile/Melisa-Vargas-4"
                },
                {
                    "user_id": "Linda Wade",
                    "user_href": "/profile/Linda-Wade-50"
                },
                {
                    "user_id": "Ed Huang",
                    "user_href": "/profile/Ed-Huang-1"
                },
                {
                    "user_id": "Alejandro Angel",
                    "user_href": "/profile/Alejandro-Angel-8"
                },
                {
                    "user_id": "Joyce Chou",
                    "user_href": "/profile/Joyce-Chou-2"
                }
            ]
        },
        {
            "author_info": {
                "name": "Jose Angelo Gallegos",
                "href": "/profile/Jose-Angelo-Gallegos"
            },
            "answer_text": "1. CopyHackers  Pros: this is a niche site run by mega-blog CopyBlogger so you can be sure that all the content writers that respond to your listing will be well-versed in the content writing world. Even better, the tool takes you through a quiz and matches you with the most relevant and appropriate writer on file. Cons: the pool of content writers available here may well be of high quality, but it might not be as big as the pool of writers on the other listings sites. 2. Upwork  Pros: there are literally thousands of content writers on Upwork. The platform lets you invite writers to apply for your job, or lets them come to you. You can also filter your preferences for the kind of writer you want and the level of expertise you require. It’s really easy to pay through Upwork because everything goes into Escrow, keeping the money safe for you and your freelancer. Cons: there are literally thousands of content writers on Upwork. This can make it difficult to narrow your options down, and you’ll often get tons of responses from content writers that haven’t read your listing in detail or don’t have the skills and expertise you require. 3. Fiverr  Pros: you can find decent content writers on Fiverr for relatively cheap prices, but you have to do some digging around. There are loads of people to choose from and you can filter your search to find the very best. Cons: the quality of writers on Fiverr can vary. Just remember: you get what you pay for. 4. ProBlogger  Pros: this is a job site specifically geared towards content writing opportunities (and even more specifically, blog post writing projects). You’ll find thousands of writers here who are actively looking for blogging jobs, and there are tons of high-quality, experienced content writers among the crowds. Cons: because this is one of the most well-known sites for content writers to find work, you might find yourself with hundreds and hundreds of applications which, let’s face it, can be overwhelming. Step 3b: Reach Out to Relevant Writers Posting a listing on a designated content writing website isn’t the only way you can find the best writer for the job. If you have a specific project in mind that requires a certain kind of talent, you can use Google and social media to find the right writer and actively reach out to them rather than waiting for them to come to you.  For example, if you’re looking for an experienced social media marketing writing, just search for “experience social media marketing writer for hire” in Google. Alternatively, you can search for “social media marketing writer” in the search bar on Twitter or LinkedIn and click the “People” tab to filter your results.  Once you’ve found a writer you want to reach out to, you can send them a simple email asking them whether they have any availability to work on your content. Keep it short and to the point (these writers are busy!): Read Full Post: Everything You Need to Know Before You Hire a Content Writer ",
            "date": "Updated February 20, 2020",
            "views": "24",
            "upvotes": " View 7 Upvoters ",
            "upvoters": [
                {
                    "user_id": "H Pm",
                    "user_href": "/profile/H-Pm"
                },
                {
                    "user_id": "Angelo Cortes",
                    "user_href": "/profile/Angelo-Cortes-8"
                },
                {
                    "user_id": "Esraa Kasem",
                    "user_href": "/profile/Esraa-Kasem-1"
                },
                {
                    "user_id": "Scott Lynch",
                    "user_href": "/profile/Scott-Lynch-93"
                },
                {
                    "user_id": "Kolade Fakunle",
                    "user_href": "/profile/Kolade-Fakunle"
                },
                {
                    "user_id": "Prathibha",
                    "user_href": "/profile/Prathibha-34"
                },
                {
                    "user_id": "Anja Skrba",
                    "user_href": "/profile/Anja-Skrba"
                }
            ]
        }
    ]
}