{
    "title": "I am 17 years old and want to write a novel. Am I too young to do so? - Quora",
    "tags": [
        "17 (age)",
        "Novel Writing",
        "Creative Writing",
        "Novels",
        "Writers and Authors",
        "Writing Advice",
        "Writing",
        "Teenagers and Teenage Years",
        "Life Advice"
    ],
    "response": [
        {
            "author_info": {
                "name": "Michael Kennedy",
                "href": "/profile/Michael-Kennedy-280"
            },
            "answer_text": "I have a friend who I met on a writing forum years ago who was exactly that age when she finished her first novel. It didn’t get published.* Neither did her second or third. None of them were worthy of publication, either. Her fourth did, though. and if it hadn’t been for those first three, and the lessons she learned by writing them, getting countless rejections and everything else involved in the process, that novel wouldn’t exist. The chronological age part of your question isn’t the important part—beyond the fact that by doing so you’d give yourself more experience earlier than someone like me. What matters is the emotional maturity you bring to the party in terms of being able to honestly evaluate criticism and use it as an opportunity to grow and improve, the ability to withstand the dismal odds of getting a first book published cold querying agents, no matter how good, etc. I’m also not saying a 17-year-old couldn’t write something publishable. The publishing industry is just such a confusing morass of crap, nobody’s going to have a very easy time breaking in—especially the first time they try writing a book. The average “first time author” has written two prior books. By “written” I mean completed, edited the crap out of, had other people comment on, revised and edited, rewritten, done the same thing again, and seen only failure as a result. That’s how they figure out how to get to the third book, by experiencing years of toil and tears and frustration and seeing nothing from it but learning every lesson they can from all of it. So, GO FOR IT. Keep up on your homework and everything else in your life, don’t expect having written a novel to somehow change anything about your life, learn everything you can from the most horrible parts of the process, and understand that if you can become someone who does something in that medium it’s probably going to be a long, hard haul. *By “published” I mean she got an agent who subbed the book to publishing houses and one of them picked it up and paid her money for it. ",
            "date": "Answered January 14, 2020",
            "views": "306",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Ana Damyanova",
                "href": "/profile/Ana-Damyanova-2"
            },
            "answer_text": "You’re never ‘too’ anything to do what you want, but what you do has to be 100% You to be good. That’s where most people would face a difficulty writing a novel at 17, because it’s normally a time when you lose yourself to find yourself and don’t really know what you stand for or who you are, so you’re trying to hit the right amount of ‘how people say it’s done’, ‘what’s successful right now’, ‘what I like’, ‘what results I wanna get out of it’ and lastly, ‘what story do I feel the need to share with the world’. As a person who’s been writing ever since I was 8 years old and is publishing works and books on the regular, I’d say my way of dealing with this obstacle was to take a look at everything I could call mine - the 12,14,17 years of experience I had, the neighborhood I grew up in, the things that moved me and explore them more and more closely until I started discovering a whole bunch of new dimensions to what I thought was just ‘unworthy and boring’ compared to the stories and lives of people and novels that have already achieved success. And considering you’re 17 now, I’m pretty sure your empathy and your way of seeing the world have even more depth than those of someone who was 17, say, 10 years ago because new generations are always even better than the previous ones. I think you can absolutely write a novel, as long as you own your experience, thoughts, feelings and decide to confidently share them with people. Good luck. ",
            "date": "Answered January 10, 2020",
            "views": "144",
            "upvotes": "0"
        }
    ]
}