{
    "title": "I am having trouble writing. Every time I try to write something, I keep losing focus on what I am writing about. How do I handle this writer's block? - Quora",
    "tags": [
        "Writer's Block",
        "Writers and Authors",
        "Writing Advice",
        "Writing"
    ],
    "response": [
        {
            "author_info": {
                "name": "Ron Heacock",
                "href": "/profile/Ron-Heacock"
            },
            "answer_text": "Writer’s block means different things in different contexts. It has become a simplicity on the near side of complexity I’m afraid. I avoid the term - it’s too easy and it’s too final. BLOCK. STOP. FINISHED. DEAD. BULLSHIT Rather than diagnose your problem with a simplistic name, I suggest you ask yourself some questions about your working habits and about the content of your novel. I have found that in order for me to do authentic work, the real work as it were, I had to develop a greater honesty about myself. Writing is a portal to your issues. And if you are not aware of what they are it is a guarantee that some other reader will see it. Best to know your own demons. With that said, what you are writing about can definitely effect your ability to write. So look there. Are you being truthful? Or are you letting shame (or what you imagine others might think of you) interfere with telling your story? Shame and fear of being found out can drive the most important parts of your work into the shadows. And most “normal people” (READ: non-writers) relegate a good deal of their unhappy experiences to the dark room of denial. Another context to seek clarity in is your personal censor. We are always judging ourselves. (It is doubly helpful to understand who in your life may be the voice of judgement - sometimes that brings true life changing clarity) and often we are motivated by these judgements whether we recognize them or not. So becoming aware of the voices and addressing their concerns can shed a lot of light on the process. Sometimes you just have to tell them to STFU. Note the metaphors I am using: Clarity, Light, Shadows, Dark Room… Do you see a trend here? What is keeping you from writing? Maybe it is the truth - either your avoidance of it, or maybe your subconscious self clamoring for you to stop ignoring it. Either way, the “block” is not a wall. It is a window, climb through it by recognizing why it plagues you. Once you identify your demons you take away their power. That is when you can illustrate them in your writing. Which is why writing brings them to the surface - It is the condition and the cure. I’d say that you are doing good work if this sort of stuff is happening. Now you must have the courage and persistence to go into the center of the feeling. Then again, you might just have a bad case of infectious writer’s block - in which case, apply calamine lotion and stay in quarantine until it passes. You wouldn’t want to infect anyone else. Oh yeah, take two of the blue pills and call me in the morning. ",
            "date": "Answered May 20, 2018",
            "views": "403",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Darynda Jones",
                    "user_href": "/profile/Darynda-Jones"
                }
            ]
        },
        {
            "author_info": {
                "name": "Denis Martindale",
                "href": "/profile/Denis-Martindale"
            },
            "answer_text": "How do you handle writer’s block!? How do you handle writer’s block!? You grab it by the throat gently and you talk to it and suddenly… : THE DAY I BLOCKED WRITER’S BLOCK! : The writer’s block was back again. As a frustrated writer I looked at it, as it sat in my chair, as if it owned the place. ‘Get out of my chair!’ I ordered. ‘Nope! I ain’t moving. I like this chair… it’s your favourite. Well, now it’s mine…’ Then, as a writer, I began to think of a solution… ‘You do realise that I’m just a nobody in the grand scheme of things? Well, why not find a famous writer instead? Why not sit in his chair? He’s probably richer and can afford a really fancy chair. Real leather, not fake leather and one with wide arm rests, too. Flat ones you could put a cup of coffee on. Room for a few remote controls as well. Doesn’t that make you feel somewhat like a loser missing out on the really comfortable chairs out there? Why bother me? I’m just learning to write. I’m no challenge at all.’ Then the writer’s block looked up, a bit startled to think it could be much better off somewhere else. Perhaps Hawaii or Australia. Forget the coffee, how about champagne!? The smell of a new leather chair… Sunshine filling the room. Perhaps with the upbeat fragrance of roses from well-placed vases… and a famous writer to drive round the bend… Then it smiled with growing evil intentions… and all at once, it disappeared! It was GORN! And guess what… it NEVER came back! : Denis Martindale April 2018. : Denis Martindale Poems : ",
            "date": "Answered April 27, 2018",
            "views": "173",
            "upvotes": " Answer requested by Gwen Wood"
        }
    ]
}