{
    "title": "I am wanting to buy a car without a title but the seller won’t offer a bill of sale so I can get a bonded title. Can I make a bill of sale using someone else’s name? - Quora",
    "tags": [
        "Car Titles",
        "Car Buying Advice",
        "Titles",
        "Car and Automobile Advice",
        "Used Cars",
        "Car Buying",
        "Cars and Automobiles"
    ],
    "response": [
        {
            "author_info": {
                "name": "Les Hildenbrandt",
                "href": "/profile/Les-Hildenbrandt"
            },
            "answer_text": "I have recieved several bonded titles. I don't think a bill of sale was ever required. From the state's perspective, the seller never owned the car, so a bill of sale would have no meaning. You will need to locate the “owner of record\". This is the last person who had a title to the car. You will be getting the VIN verified by the police. Then you will take that VIN to the DMV and find out who the last person who had a title to the car. You will need to attempt to contact them. Usually this is done by registered letter. If the letter can't be delivered you are done. Bring the undeliverable letter with you when you go to get your bonded title. If the letter is delivered and the last titled owner is willing to get a replacement title for you then you get a normal non bonded title. If the owner accepts the letter and wants his car back, you are screwed. If the owner accepts the letter but won't communicate with you, just write statement showing what steps you took to contact the owner. Now the whole point of a bonded title is if after the DMV issues you a title, the previous owner comes forward and wants the car, the bond can be redeemed. You get to keep the car, and the prior owner gets the cash from the bond. These steps are relevant in Colorado. I suspect most states are similar. ",
            "date": "Answered November 19, 2019",
            "views": "131",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Glen McMillian",
                "href": "/profile/Glen-McMillian-2"
            },
            "answer_text": "You can if you don’t get caught. The odds are pretty good that you WILL be caught, sooner or later, because the world of car registrations and titles and inspections is a highly computerized world these days. And when you get caught, you will be charged with a felony, which will cost you dearly in money for lawyers, fines and jail time. ",
            "date": "Answered October 30, 2019",
            "views": "66",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Venkatesha Harileela",
                    "user_href": "/profile/Venkatesha-Harileela"
                },
                {
                    "user_id": "Mary Miller",
                    "user_href": "/profile/Mary-Miller-22"
                }
            ]
        }
    ]
}