{
    "title": "I feel like I'm losing my writing motivation. Is that even possible? - Quora",
    "tags": [
        "Self Motivation",
        "Writing Advice",
        "Writing",
        "Life Advice"
    ],
    "response": [
        {
            "author_info": {
                "name": "Nilanjan Paul",
                "href": "/profile/Nilanjan-Paul-11"
            },
            "answer_text": "Yup! That indeed is possible, and almost every writer suffer this, and for most of the times it's inevitable. You see our mind will get distracted at one point or other, because it is made in that way. but even so we can counter it. Most probably, you have developed THE WRITERS BLOCK and you need to get rid of it, because I know it is consuming your time and energy. So. one very simple way of conquering it over is to write what comes to your mind (utmost rubbishes and stupidity, accepted at this point) Keep writing and don't worry for even grammatical mistakes or missed plot lines. You can change all that later. Right now, you just need to WRITE. That's it! So Keep Writing And Keep Dreaming! ",
            "date": "Answered February 12, 2017",
            "views": "196",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Lev Isakovich",
                    "user_href": "/profile/Lev-Isakovich"
                }
            ]
        },
        {
            "author_info": {
                "name": "Khushi Agrawal.",
                "href": "/profile/Khushi-Agrawal-17"
            },
            "answer_text": "Yes, that happens to a lot of people. Even happened with me once. I just got so hooked to the social media that I barely read any novel/wrote. But then, I suddenly realized it and started writing little by little. Soon, I discovered that I'm just where I left off with writing and it's not like your skills degrade or wear off or anything . Only thing , you have to be slow and patient to start off, and then it'll all be great. Happy writing! ",
            "date": "Answered July 12, 2016",
            "views": "126",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Lavi Sundar",
                    "user_href": "/profile/Lavi-Sundar"
                }
            ]
        }
    ]
}