{
    "title": "I like to write song lyrics. Can I sell them online? - Quora",
    "tags": [
        "Songwriting",
        "Online Selling",
        "Buying and Selling",
        "Song Lyrics",
        "Songs",
        "E-Commerce",
        "Music"
    ],
    "response": [
        {
            "author_info": {
                "name": "Frank Elliott",
                "href": "/profile/Frank-Elliott-5"
            },
            "answer_text": "This appears to me to be a very naïve question. If your lyrics have real merit (a reasonable prerequisite for any buyer), I'd suggest setting them or having a collaborator set them to music first. It's far easier to sell finished songs online. You may want to check into performance rights societies... in the U.S., ASCAP, BMI, and SESAC can give you guidance in many aspects of both the songwriting and publishing aspects. In other countries there are other orgs. Selling texts (words only) involves what are called literary agents, and ever since the rise of the Internet, those agents capable of buying texts for publication have gotten even harder to meet! FYI, performance/performing rights societies mainly work with complete songs, but if you network through the one you sign up with, you may find one or more musical collaborator(s). The Internet is still a largely wild sales frontier. If you structure your offered lyrics in one or more especially-well-designed pages, maybe sales will occur, and not to in any way discourage you, selling lyrics alone (which are one form of poetry more or less) seems like a tough sell to me. But like most songwriters I write words and music. Still there have been plenty of great lyricists who didn't write music. You could easily search for them to learn how they built careers. However, given the inherent anonymity of the web in its present state (IPv4), your proposal reads to me like a recipe for disappointment or perhaps much  worse. Most intellectual property thieves don't think twice about ripping off a writer! Every songwriter is different, but some begin their process with text (words) and others begin with music (notes or sound arranged in musical fashion). My advice is to not put full lyrics out there to enable thievery... likewise most inexperienced authors and inventors are actually overly afraid of disclosing their works (which in the case of new inventors is often unrealistic, too, because few inexperienced inventors actually do patent searches before concluding their invention is new)... so my suggestion is to publish brief excerpts to interest the buyer(s), not complete sets of lyrics, and if I were in your shoes, my preference would be to first locate a writing partner who can set your lyrics to music, then find a publisher to get traction on your songs AFTER you produce DEMOs. Believe it or not, some of the better famous singers don't read/write music, they use the writer's demos to learn songs before making their own versions. Some singers, not all. For the preceding reason, trying to \"get lyrics to XYZ famous singer\" (like Britney Spears or your favorite male pop star) is typically futile. That's because they have the entire extant literature to choose from and those are finished songs, plus their management team probably has tons of unreleased material that's been carefully pitched to them. So the usual process is get into a place (like songwriting workshops in Nashville, NY or LA) and network, then or even before that, go to a good school and refine your writing. Unless you've immersed yourself in writing for years, finding any traction for \"unsolicited material\" even if it's great is typically a total non-starter. You may even want to seek out artists whose stuff you like and might be compatible with your writing but you've determined that they never or rarely write the songs they perform/record. The trend in the 2000s is singer-songwriters who can both write words and music and do killer performances do good people want to buy the songs or pay good money to see them live. Madonna, Carrie Underwood and Taylor Swift write pretty much all of their own songs. But Ariana Grande and some other great singers rarely do, so believe that the singers who rarely/never write songs are usually inundated with more material than they could ever use. Meaning they're not surfing the 'net asking, \"Where can I find good lyrics?\" On a grander scale, you could write a libretto (the book of a play [story] that includes song lyrics) for a \"musical\" or \"opera\" and see about getting a sponsor to hire or partner up with a composer and/or arranger and as that progresses eventually work with a producer to make the whole enterprise real (it may seem too hard, but it's been done many times and if you're driven...), or if you're not interested in collaborations, you could always learn how to compose music yourself. With more than just a collection of lyrics you might find it easier to get others \"on your side.\" Good luck!  ",
            "date": "Updated March 26, 2016",
            "views": "375",
            "upvotes": " View 28 Upvoters",
            "upvoters": [
                {
                    "user_id": "Dawn Marr Fisher",
                    "user_href": "/profile/Dawn-Marr-Fisher"
                },
                {
                    "user_id": "Glitz Glory",
                    "user_href": "/profile/Glitz-Glory-1"
                },
                {
                    "user_id": "Bei 贝里扬流星",
                    "user_href": "/profile/Bei-贝里扬流星"
                },
                {
                    "user_id": "Netta Morris",
                    "user_href": "/profile/Netta-Morris"
                },
                {
                    "user_id": "Vitthal Jadhav",
                    "user_href": "/profile/Vitthal-Jadhav-66"
                },
                {
                    "user_id": "Audrey Jasokie",
                    "user_href": "/profile/Audrey-Jasokie"
                },
                {
                    "user_id": "Kim Boze",
                    "user_href": "/profile/Kim-Boze"
                },
                {
                    "user_id": "Charles P. Hobbs",
                    "user_href": "/profile/Charles-P-Hobbs"
                },
                {
                    "user_id": "Destiny Pivonka",
                    "user_href": "/profile/Destiny-Pivonka"
                },
                {
                    "user_id": "Peio Lemaître",
                    "user_href": "/profile/Peio-Lemaître"
                }
            ]
        },
        {
            "author_info": {
                "name": "Brad Linton",
                "href": "/profile/Brad-Linton-2"
            },
            "answer_text": "Probably not. Nobody wants your lyrics. If you’re trying to sell them, you would have to post them, right? “Baby, baby. You’re my girl, baby. You’re my baby girl, baby.” Anyone interested in your lyrics will grab them. And unless you paid for copyright protection, your chance of making one thin dime are thinner than the one thin dime you’re never going to see. Your best bet is to write exclusively for an existing artist, copyright your work, and starve anyway. You’re better off driving a forklift for a living. Seriously. I’ve written well over 200 songs. Lyrics, music, arrangements, and recordings. 17 of them were pretty good. None of them made me any money. Of course, that’s just my experience. You might just make it big selling your lyrics online. Good luck! ",
            "date": "Answered May 3, 2018",
            "views": "361",
            "upvotes": " View 29 Upvoters",
            "upvoters": [
                {
                    "user_id": "Bei 贝里扬流星",
                    "user_href": "/profile/Bei-贝里扬流星"
                },
                {
                    "user_id": "Stephen White",
                    "user_href": "/profile/Stephen-White-17"
                },
                {
                    "user_id": "Rachel DellaRatta",
                    "user_href": "/profile/Rachel-DellaRatta"
                },
                {
                    "user_id": "Emmett Roch",
                    "user_href": "/profile/Emmett-Roch"
                },
                {
                    "user_id": "Mackenzie Delisle",
                    "user_href": "/profile/Mackenzie-Delisle-1"
                },
                {
                    "user_id": "Kriti Dixit",
                    "user_href": "/profile/Kriti-Dixit-16"
                },
                {
                    "user_id": "Mike Aguirre",
                    "user_href": "/profile/Mike-Aguirre-14"
                },
                {
                    "user_id": "SK Sharma",
                    "user_href": "/profile/SK-Sharma-133"
                },
                {
                    "user_id": "Lanena Bennett",
                    "user_href": "/profile/Lanena-Bennett-1"
                },
                {
                    "user_id": "Saroz Xrma",
                    "user_href": "/profile/Saroz-Xrma"
                }
            ]
        }
    ]
}