{
    "title": "I love death metal and want to write songs but I had an arm amputated after a car accident and can't play any instruments so how can I write songs without an expensive computer program? - Quora",
    "tags": [
        "Death Metal (music)",
        "Music Suggestions",
        "Music Composition",
        "Writing Advice",
        "Songs",
        "Writing",
        "Music"
    ],
    "response": [
        {
            "author_info": {
                "name": "Nina Mason",
                "href": "/profile/Nina-Mason-2"
            },
            "answer_text": "My sympathies on your arm. Writing for you will not be impossible by any means (Beethoven did it when he was deaf, for god's sake), but it will be more difficult. This is how I would suggest going about it. I would suggest, first, that you get a good ear for the musical scale. My understanding of death metal (which is admittedly limited) is that the words will be less important to the overall listening experience than the music itself--you might look them up if you want to yell along, but except to the very attuned ear they're going to sound like gibberish on a casual listen-through. Knowing the difference between a C-scale and a B-flat minor isn't just for classical musicians; in fact, if I recall correctly at least one of the members of Metallica is classically trained, and I know Alice Cooper broke into hard rock because his work as a classical musician wasn't going well. These musicians used their classical training to great effect in popular music. So you've committed yourself, learned to reognize your scales, and studied your genre (what's done a lot? What's never done? What do you hear some artists do that just doesn't sound like good death metal to you?), you'll need to pick up some friends with similar goals. Your writing, without a computer, will have to be a collaborative effort if you don't want to use a computer to compose. You will write notation (i.e., sheet music), which your friend who plays your demo instrument can then play back. You make edits based on what you have heard, and together you compose the music.  Finally, I would note that there is a difference between composing and playing, as well; Mozart's music sounds different to us than it did to him, because he wrote for the fortepiano and the instrument we now use, the pianoforte (or, commonly, just plain old \"piano\"), has more keys and a deeper body that creates a different sound. What sounds bad to you on the computer may sound badass when played live by a skilled musician. Don't be afraid to try it. ",
            "date": "Answered November 6, 2015",
            "views": "250",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Guillermo René Ramírez Bonilla",
                    "user_href": "/profile/Guillermo-René-Ramírez-Bonilla"
                },
                {
                    "user_id": "Mari Adkins",
                    "user_href": "/profile/Mari-Adkins"
                }
            ]
        },
        {
            "author_info": {
                "name": "Ralph Danford",
                "href": "/profile/Ralph-Danford"
            },
            "answer_text": "You can try singing the parts, as you still have your voice and it is a good instrument to use when improvising. You can use a piano to make sure you have the right notes in mind. Develop your ability to hear the music in your head if you don't have that already. Consider a music pad (the kind with lots of buttons that play loops) for improvising. You only have one hand now, but you can still press a button to listen to a loop. I think this could be a great help for you when improvising. Pre-load some loops using a midi editor on the computer, I suppose. And then once you have them loaded you would just press the button and listen to how the loops sound with each other. That could give you some ideas. Definitely collaborate with like-minded musicians and get them to help you perform your songs. Maybe you could become a vocalist if you train your voice from now on. That way you could be writing songs and touring with your band. Good luck. ",
            "date": "Answered November 6, 2015",
            "views": "113",
            "upvotes": "0"
        }
    ]
}