{
    "title": "I signed a contract with a webnovel publishing company and I want to repackage that novel into another book to self publish. Is it possible if I just change some parts like the title and some of the content? - Quora",
    "tags": [
        "Webnovels",
        "Self-Publishing",
        "Book Publishing",
        "Publishing",
        "Novels",
        "Books"
    ],
    "response": [
        {
            "author_info": {
                "name": "David Lascelles",
                "href": "/profile/David-Lascelles"
            },
            "answer_text": "Other answers have covered the basics of this - you are bound by the contract. If on viewing that contract now you see that you have signed away more than you thought you had, consider it lessons learned and make sure it does not happen again in the future. You are not alone. Many have been taken in by ‘publishers’ who are actually vanity presses or even out and out scams and even those with legit publishers have at least one tale of a dodgy contract they noped out of or even signed at had to abide to. Writers are not trained contract lawyers. Well, apart from the ones who are (or married them), I know a couple of authors who are or were lawyers in their day jobs. Contracts are complex things. So it is inevitable there will be issues. For my first publication, I was collaborating with a group to publish a series of novellas as an anthology. We got a contract offer and most were in favour of signing it until one of the authors, whose day job was a commissioning editor for another publisher, pointed out some dodgy clauses she did not like (they were basically asking for a lot more rights than they actually needed and not paying more for them). She recommended asking them to change this and walk if not done. They refused, we walked. If she hadn’t been there with her expert knowledge, we’d have signed. If you read through your contract with this company you will (or should) find a section on publishing rights. This should detail what rights they have from you for this work split by type (paperback, ebook, audio, and may include TV/film and similar) and region (worldwide is more common now with ebooks but may also be North America/Europe/Asia etc.) In theory they should only have ebook rights but if they are dodgy they may have nabbed more. The contract should also include a set of criteria under which the rights default back to you. This can be a period of time (X years, can even be months - one contract I signed specifically only gave the publisher 6 months) or it can be a number of months after last printing or it can be something else. After this criteria has been fulfilled, you are legally allowed to contact them to request your rights back and they either need to comply or offer you another contract as a counter offer which you are free to ignore. So, if you look at the contract and see that this criteria has been fulfilled, then this is easy for you - send an email asking for your rights back. If they reply in the positive then you are good to go - republish your book however you feel. If the period is not expired yet, wait for it to do so before sending the email. If they say no, they are in breach of contract and you are within your rights to lawyer up and will very likely win any case you bring. So long as you have copies of all correspondence etc. and these back up your side of the story. If there is no criteria for the rights returning to you (not even ‘a held in perpetuity thing’) then this is also a time for lawyering up because that to me indicates whoever wrote the contract either had no idea what they were doing or was trying to pull a fast one and a lawyer is needed to advise on next steps for that. Possibly challenging it on the grounds it was not a legal contract, but this is a lot less certain a path and it may be easier just to let it go and cut your losses and write the next book, which will be better because you have learned from the first one, and take it down more legit avenues of publication. This also applies if there are criteria for the rights defaulting to you but ones that are impossible to pull off. If it says something like ‘they hold the rights for all time’ then I suspect you are screwed. You can try to lawyer up but I suspect they will tell you the contract is what it is and they have to go on what is written. I’d also be careful if they are referring to copyright, which is different to publishing rights. A publishing contract should never really be including copyright unless you are paid for it. It basically means you are unable to call yourself the creator of this piece of work any more - you have given that right to them - so you cannot use it again unless you pay them for the privilege. By ‘repackage some bits’ I assume this means the content of that story is relevant to the one you want to self publish. As in a sequel or at least set in the same continuity/universe? If so, and you can’t get your rights for book one back, there is another option. The term ‘repackage’ implies taking direct copy of the text. This you cannot do if the publishig rights are currently owned by someone else. Even doing the old ‘change a couple of bits’ thing does not mitigate it as out and out plagiarism. However, you can use the same ideas and you can have events in the new story refer to ones in the old one. You can have flashbacks where characters think about it, you can include a quick preface where you give a ‘story so far’ (not the best writing technique but sometimes unavoidable), you can even completely rewrite the same events just in completely new prose. It has to be very different prose but the events can be the same. Hell, if the first book is one that can still make you money from sales (i.e. you didn’t sell it for a one off single payment), you can mention in your foreword that it exists and where readers can find it and boost sales of that too. But first step is to look at that contract in detail, maybe get a lawyer to help you review it, and work out what you can do and be ready for the very real possibility it may be a lost cause and focus on book 2. ",
            "date": "Answered July 20, 2020",
            "views": "23",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Chandrasekar Kshirja",
                    "user_href": "/profile/Chandrasekar-Kshirja-1"
                },
                {
                    "user_id": "Mike Van Horn",
                    "user_href": "/profile/Mike-Van-Horn"
                },
                {
                    "user_id": "Helen Basis",
                    "user_href": "/profile/Helen-Basis"
                },
                {
                    "user_id": "Raymond van Over",
                    "user_href": "/profile/Raymond-van-Over"
                }
            ]
        },
        {
            "author_info": {
                "name": "Charlie Aylett",
                "href": "/profile/Charlie-Aylett"
            },
            "answer_text": "Check over your contract carefully and find out exactly what rights they have purchased. Without knowing these terms, no one here can answer your question exactly. As others have said, you might be under contract for quite some time or permanently (depending on how predatory this company are). I’m not quite sure what you mean by ‘repackage it into another book’. Do you mean you wish to rewrite parts of it and self-publish an updated version? Or maybe incorporate the original into a larger work? If yes to the former, you won’t be able to use the original nor the updated version in your own self-published book if the original is still under contract for exclusive first rights. If non-exclusive, then maybe, but you need to check the details of what you signed up for. If you mean the latter scenario, you cannot use the original in a larger work if it is under exclusive first rights, but that doesn’t mean you can’t use it to your advantage. Novel series are more popular than they used to be. If you have more story to tell, and as long as your publishing contract does NOT lay claim to any future related works (again, check the paperwork), there’s no reason you can’t write the next part of the saga and self-publish it. It’s often the case that a first self-published novel or an unknown author seeds the market by making it available for either free or inexpensively. The idea, especially in a series, is that readers will get a taste for the author’s style and go on to spend money on later books in the series (or other stand-alones). In a series, those later books can actually serve to market the first or early books in a series, bumping up revenue years after the original launch date. Your next book could bump the sales of your original book, which I’m assuming will benefit you regardless of who published it. Assuming your original will be available on a permanent basis through your publisher, you can also still use it to seed the market for your next book through the marketing they do and through your own. Early books are about getting your name out there, so don’t sweat it too much if you are not at liberty for the time being to do what you wish with your first one. Focus on getting more work out there and building your readership. Overnight successes usually take about 10–20 years of hard work. ",
            "date": "Answered October 17, 2020",
            "views": "168",
            "upvotes": "0"
        }
    ]
}