{
    "title": "I think faster than I write. This causes my handwriting to be sloppy, What should I do? - Quora",
    "tags": [
        "Graphology",
        "Penmanship",
        "Handwriting"
    ],
    "response": [
        {
            "author_info": {
                "name": "Deborah Ross",
                "href": "/profile/Deborah-Ross-6"
            },
            "answer_text": "All of us think and speak faster than we can write, and when we are thinking and writing, guess what we’re concentrating on? One strategy is to learn a little shorthand or condensed writing (1 strtg s 2 lrn a ltl srthd) — we tend to abbreviate, anyway, so it’s not a big stretch to condense it further. Or you could learn formal shorthand. It’s not taught much anymore, but before dictation machines, a good stenographer could take shorthand as fast as most people could speak. Or find another way of noting just the highlights/important points in your thoughts, not complete sentences. (note high points) and go back and fill in the formal grammar later. Hope these help! ",
            "date": "Answered May 10, 2017",
            "views": "44",
            "upvotes": " View 3 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Óscar Alejandro Montiel Mejía",
                    "user_href": "/profile/Óscar-Alejandro-Montiel-Mejía"
                },
                {
                    "user_id": "Joshua Aderanti",
                    "user_href": "/profile/Joshua-Aderanti"
                },
                {
                    "user_id": "Aidee Udoh",
                    "user_href": "/profile/Aidee-Udoh"
                }
            ]
        },
        {
            "author_info": {
                "name": "Hanish Vinod Tejwani",
                "href": "/profile/Hanish-Vinod-Tejwani"
            },
            "answer_text": "Hello Adit, As you mentioned that when you copy write, you write it in a neat way and when you write what you think it makes your handwriting wierd. This simply means that when you are copy writing you copy its pattern, slants and many of the technical specifications. It means that you need a support from the other sources to get your things done and there's nothing wrong in it. When you write on your own your handwriting becomes distorted. It means when you try to do things at your own will, in your own way it doesn't go well and you land up in a mess. My suggestion would be : be more focused on what you need to write, think twice and write it in a proper neat way.. You will consciously reprogram your subconscious mind. As the time goes you will get a tidy handwriting with a good speed. Wish you All the Best! God bless you. ",
            "date": "Answered August 2, 2016",
            "views": "44",
            "upvotes": " View 7 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Óscar Alejandro Montiel Mejía",
                    "user_href": "/profile/Óscar-Alejandro-Montiel-Mejía"
                },
                {
                    "user_id": "Disha Ahuja",
                    "user_href": "/profile/Disha-Ahuja-4"
                },
                {
                    "user_id": "Dr Harshitha Jain",
                    "user_href": "/profile/Dr-Harshitha-Jain"
                },
                {
                    "user_id": "Rajat Mishra",
                    "user_href": "/profile/Rajat-Mishra-43"
                },
                {
                    "user_id": "Ashoke Bagchi",
                    "user_href": "/profile/Ashoke-Bagchi-1"
                },
                {
                    "user_id": "Gurpreet Kaur Khalsa",
                    "user_href": "/profile/Gurpreet-Kaur-Khalsa"
                },
                {
                    "user_id": "Suvanssh Mahajan",
                    "user_href": "/profile/Suvanssh-Mahajan"
                }
            ]
        }
    ]
}