{
    "title": "I want to become a writer but I don't write much. What now? - Quora",
    "tags": [
        "Creative Writing",
        "Writers and Authors",
        "Writing Advice",
        "Writing",
        "Career Advice"
    ],
    "response": [
        {
            "author_info": {
                "name": "Amy Olson",
                "href": "/profile/Amy-Olson-109"
            },
            "answer_text": "Get a freaking notepad and a pen and start writing, Humpty Dumpty! You aren't gonna achieve squat if you don't get on with it! The only way to become a writer is to write. No excuses. If you really want it, you gotta be willing to put in the effort. If the effort proves too much, then you didn't want it enough. Don't follow your dreams…lead them! Not all your books are gonna get published, just write them for the sake of writing. Write answers here on Quora, start a journal, get familiar with a pencil, (or a keyboard,) if you don't practice and get comfortable with your own way of writing, you'll end up feeling unhappy with your work. It will sound stiff, uncomfortable and forced, like the dramatic scripts I wrote when I was 8. I'm not gonna lie…writing is hard. I gave up so many times because I didn't think I was good enough, even famous authors still doubt themselves, but writing is undoubtedly one of the most beautiful, and noble arts in the world. Sharing the gift of storytelling with just a few people is such an incredible thing to be able to do. Don’t give up. Also, it's very useful to learn new skills when it comes to writing, so don't be shy about taking courses and workshops to help you write. Websites like Open University offer free courses on pretty much anything. I'm doing a course there about creative writing right now which is very cool. (I'm learning to improve my character development.) :) Just keep writing. All the time. Doesn't matter if it sucks…you can't learn a new language without speaking it first, which means sounding like a fool for a while, but it's worth it. ;) (Edit: Wow! I made it to the digest! Yay!) ",
            "date": "Updated January 9, 2019",
            "views": "24",
            "upvotes": " View 80 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Mae Ann Dela Rosa",
                    "user_href": "/profile/Mae-Ann-Dela-Rosa-1"
                },
                {
                    "user_id": "Lara Anisere",
                    "user_href": "/profile/Lara-Anisere-1"
                },
                {
                    "user_id": "Chirla Akhila",
                    "user_href": "/profile/Chirla-Akhila-2"
                },
                {
                    "user_id": "Damini Chavan",
                    "user_href": "/profile/Damini-Chavan-2"
                },
                {
                    "user_id": "Salma Siddiq",
                    "user_href": "/profile/Salma-Siddiq-2"
                },
                {
                    "user_id": "Sangraam Patwardhan",
                    "user_href": "/profile/Sangraam-Patwardhan"
                },
                {
                    "user_id": "Hector Pojomovsky",
                    "user_href": "/profile/Hector-Pojomovsky"
                },
                {
                    "user_id": "Sebagabo Lysa",
                    "user_href": "/profile/Sebagabo-Lysa"
                },
                {
                    "user_id": "Kika Love",
                    "user_href": "/profile/Kika-Love-2"
                },
                {
                    "user_id": "Elena Markin",
                    "user_href": "/profile/Elena-Markin"
                }
            ]
        },
        {
            "author_info": {
                "name": "Sophie Nicholson",
                "href": "/profile/Sophie-Nicholson-29"
            },
            "answer_text": "I was once at a keynote given by an author who said that the only difference between someone who is a writer and someone who is not a writer is that the person who is a writer, writes! So here’s what you have to do to “become a writer:” WRITE Pick up a pen or a pencil and a piece of paper. Open up a google doc. Get out a stone tablet, or the notes app on your phone and literally just write things. But what do I write about? Most likely, if you want to be a writer, you have some ideas. But a basic principle is that you should write what you know. Sometimes, that’s the most interesting. For creative writing, working seemingly mundane parts of your life into your writing makes it more realistic, but also more interesting for people with different experiences. Margaret Peterson Haddix, author of Among The Hidden grew up on a farm in an area that was being developed around her, so that’s where she set the book. What she didn’t realize was how interesting that would be for other people to read. For her, it was just life. For me, and other readers, it was interesting to read about the struggles of that setting (the neighbors complained about the smell of the pigs, the kids didn’t have a forest to play in, etc.) If creative writing isn’t your thing, writing what you know is still the way to go. Write a book about your favorite science, or about an interesting philosophy concept or whatever else you know a lot about. But literally the second you start writing something, you are a writer. ",
            "date": "Answered January 2, 2019",
            "views": "403",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Amz Prep",
                    "user_href": "/profile/Amz-Prep"
                },
                {
                    "user_id": "Sarena Harford Lamb",
                    "user_href": "/profile/Sarena-Harford-Lamb"
                }
            ]
        }
    ]
}