{
    "title": "I want to write stories that are wholesome and fun, but everything I write keeps coming out dark and brooding. How can I change this, or should I? - Quora",
    "tags": [
        "Creating Writing Advice",
        "Creative Writing",
        "Writing Advice",
        "Writing"
    ],
    "response": [
        {
            "author_info": {
                "name": "Marshall E. Gass",
                "href": "/profile/Marshall-E-Gass"
            },
            "answer_text": "Thanks for the question. You begin to offload all those dark and brooding stories first. Make a master plan where they sit in a great big novel. Once you get past this stage you should have no more dark and brooding stories to tell. In the next stage, you counter-balance those grim stories with a flash of light. Keep doing this until you create the perfect balance of rich endearing stories and at the same time, you create a lifeline to a compelling finish. In this process, you would have created what makes for interesting reading. The counterbalance keeps the reader transfixed on the eventual outcome. Reward the reader with a brilliant flash of goodness. Watch the best movies. Almost all of them have a grim, distressing line of thought running as the under-current. The protagonist wins, in the end, and the audience goes home rewarded for the price of the ticket. Voila, here you have it. A simple formula. Keep writing in the balancing stuff until you get it out on paper. Really half the writer is already in you. You just need to find the other uplifting half. Good luck. ",
            "date": "Answered December 17, 2019",
            "views": "519",
            "upvotes": " View 5 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Fumetsu Gacha",
                    "user_href": "/profile/Fumetsu-Gacha"
                },
                {
                    "user_id": "Jonathan Chiu",
                    "user_href": "/profile/Jonathan-Chiu-27"
                },
                {
                    "user_id": "Charu Pandey",
                    "user_href": "/profile/Charu-Pandey-4"
                },
                {
                    "user_id": "Matthew Moore",
                    "user_href": "/profile/Matthew-Moore-225"
                },
                {
                    "user_id": "G. Kaneeshiya Valantaine",
                    "user_href": "/profile/G-Kaneeshiya-Valantaine"
                }
            ]
        },
        {
            "author_info": {
                "name": "Shirley Larson",
                "href": "/profile/Shirley-Larson-1"
            },
            "answer_text": "I think the real question is: Do you enjoy reading what you write?  I know a very famous romance author who once said at a conference, I write so the publisher will put it in a book that I can read.  If you enjoy reading your writing, others will, too.  I don't think you should limit yourself by what you \"think\" you should write.  Just complete a work, short story, novel, whatever, find some beta readers, readers who will read your book as a friend, and see what they think. ",
            "date": "Answered November 24, 2015",
            "views": "173",
            "upvotes": "0"
        }
    ]
}