{
    "title": "I want a career in music but I don't have much experience vocally & not much when I write songs because I can't think of any good lyrics of any kind. I'm afraid that I'm going to fail before I even begin. Can you help me? - Quora",
    "tags": [
        "Music (artist/writer)",
        "Songwriting",
        "Song Lyrics",
        "Music Industry",
        "Songs",
        "Music",
        "Life Advice",
        "Career Advice"
    ],
    "response": [
        {
            "author_info": {
                "name": "Stephanie Jackson",
                "href": "/profile/Stephanie-Jackson-340"
            },
            "answer_text": "Well I’m not an expert but it looks like in this day and age it’s really easy to get popular for something simple. There’s so much available now with technology, you have YouTube, apps to create music digitally so you never have to even buy or learn an instrument, and the internet where everything is shared and seen easily. I would recommend doing your best of course, it’s easy to stand out by doing that since there is so much cheap content around. Writing music isn’t something you can control, it’s something that just happens. You learn when it happens and then you sort of learn how to create it and prepare for it. It’s basically learning what inspires you and being aware of when you are in that mood. Like when I go out for walks sometimes I have tons of inspiration, I get poems and speeches or little phrases in my head and I write them down in my phone notes while I’m walking. Sometimes you get the whole thing (that’s amazing!) and sometimes just the beginning of something. That’s how all the great songwriters work, they know they can’t control it. It flows through them randomly, they just make themselves aware of this and ready for it. I’ve also noticed certain people I admire, certain songs and movies and other entertainment always inspires me. So when I find myself watching or listening to something or someone I really enjoy, I pay even closer attention and then get ready to write afterwards. I also recommend watching/listening to interviews of great artists and hearing them explain their process. Michael Jackson said he would sometimes even feel guilty for putting his name on music because it would just come to him from the Heavens. He knew he didn’t create it, God did. He was just the vessel it flowed through. Sometimes you feel in flow and it’s great and other times you feel totally out of flow. Don’t let the out of flow times discourage you. Everyone experiences them. The key is filling your life with things that inspire you and cutting out everything negative. Be aware of what you put into your mind and how it affects you. This could even be a person you need to limit your time with. Notice the things that instantly change your mood around for the better, like your favorite song, and keep it on hand to get you out of a funk. Another great technique that artists use is speaking out loud to yourself. You have to hear it to know how it really sounds and this also stimulates your brain for more ideas. It really helps to have a friend with the same vision as you to write along with. All the most successful people don’t do it alone no matter what they say. Even Madonna who is known for “doing it all herself” had friends that helped her in the beginning and all along the way and still to this day. What she really did was find people with her similar interests and vision and utilized them to help her achieve what she wanted. She wanted to learn how to write music so she met a guy she liked and he taught her how to write music, how to play guitar and drums and he had the equipment to do this. Madonna knows how to utilize people and what they have to offer, their knowledge and their gifts to better herself and learn from them. People love helping others and having an opportunity to use their knowledge and gifts to help people. So look for people you can learn from. Watching your favorite artists is also very good. Every successful business and piece of art has a message behind it. This is what you believe in. Find out who you are, what you care about and what you relentlessly believe in. Notice what kind of art, people and entertainment you like and why. As yourself what you love about it and what things you don’t like and why. This will help you form your vision for your creative processes like songwriting. Cover your favorite songs if you still don’t feel confident in your own writing. A lot of great artists do this. It’s a great way to begin. Make a YouTube channel of you singing your favorite songs or just playing the simple chords on your guitar if that’s all you can do. Start somewhere. Also notice the type of fashion you like and try to dress that way. Musical artists always have distinct fashion. Figure out what yours is, it can be wild or simple as long as it’s true to you. For improving your vocals I would say take voice lessons. Don’t be discouraged because you can improve. Try to imitate your favorite singers, a lot of people teach themselves this way too. Just keep practicing and you will get better. It’s best to take lessons though so you know what you’re doing. Make a YouTube channel and upload one video a week of you singing your favorite song. Make sure you have good lighting and sound and we can see your face. Wear something noticeable if you can. Write a funny viral sounding title like “singing Man in the Mirror in front of a mirror”. Make it interesting. ",
            "date": "Answered November 8, 2019",
            "views": "55",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Zachary Oechsner",
                    "user_href": "/profile/Zachary-Oechsner"
                }
            ]
        },
        {
            "author_info": {
                "name": "John Storey",
                "href": "/profile/John-Storey"
            },
            "answer_text": "I wonder why you want a career in music . . it’s a hard road these days. If you really do, I would recommend that you find someone else who shares your passion, preferably local so you can easily work regularly together, and start practising. Songs are not always literally written, they often come about through improvisation, that is, singing the first thing that comes into your head. What you do need to do, though, is suspend your inhibitions: don’t be afraid to make a fool of yourself, just do it. Once you find you are crapeating something worthwhile (and you will), get some Asia gear and start recording yourselves, in, say, GarageBand. You will have a lot of fun, and before you know it you will have a catalogue of songs. Go for it! ",
            "date": "Answered November 12, 2019",
            "views": "42",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Saif Ali",
                    "user_href": "/profile/Saif-Ali-138"
                }
            ]
        }
    ]
}