{
    "title": "I want to be a content writer. How should I start? - Quora",
    "tags": [
        "Content Writing",
        "How-to Become Question",
        "Writers and Authors",
        "Writing Advice",
        "Writing"
    ],
    "response": [
        {
            "author_info": {
                "name": "Leigh Clayborne",
                "href": "/profile/Leigh-Clayborne"
            },
            "answer_text": "Here are the 14 steps you need to create great content. Identify your target audience. Who are you creating content for? What do they want? what are their challenges? You’ll build the content around them,Next, look at the content objectives. What do you want this content to do for you? Should it help you increase search engine traffic? Do you want people to take a certain action? Are you trying to increase brand awareness, social proof or engagement?If you’re creating content for someone else or SEO isn’t important to you, skip 4 and 5.You’ll need to do some keyword research so you can build content around primary and secondary keywords.You also need to do a competitor analysis. Look at the top 10 websites who are targeting the same keyword. find out the length of the content, what words their targeting, and the overall quality of the pieces. If you want to outrank them, you have to create something better than theirs. As your own website rank goes up, you’ll be a contender on the first page.If you don’t already have a topic, you’ll need to develop one. Choose a topic that your target audience is looking for. It should generally be helpful and/or help a person meet specific goals.Invest some time in creating the perfect title. It’s the first and sometimes the only thing a person sees. If it’s not an attention-grabber, they won’t see how great your content is. Your title shouldn’t be an afterthought.Start the content off with a hook. You have about 3 seconds to get someone lured in.Realize that the vast majority of people scan content for what they’re looking for. They don’t read it top to bottom. Make the content very scannable with ample left-aligned, short, descriptive headings. When you finish creating content, read your headings straight down the line. They should align with the title and tell a progressive story about whatever you’re talking about.Use a lot of white space. Write in short paragraphs. They’re easier to read on mobile devices.Edit. Seek out and destroy awkward phrasing. Tighten up your prose where you can. But it should still be conversational and easy to read. Be selective.Use Hemmingway App to check your readability score. It will highlight long confusing sentences in red. Those usually aren’t good for web reading. Shoot for a 5th to 6th-grade reading level. If you’re writing for experts in the subject you’re writing, then 8th or 9th grade isn’t bad. But try to get it down if you can.Use Grammarly to check for mistakes. I proofread manually and use Grammarly. It’s very hard to proofread your own work. But realize that neither Grammarly nor Hemmingway should be the final word. Sometimes they get it wrong. As a writer, you need to take good suggestions and leave the bad.Create some amazing social media headlines and metas using best practices. These will help make the content more visible to your target audience.If you find this answer helpful, please upvote it and share with someone who might find it useful. For more like it, don’t forget to scroll over my image and follow. You’ll also find this article very helpful. How to Start a Successful Blog in 9 Steps  ",
            "date": "Updated October 8, 2020",
            "views": "35",
            "upvotes": " View 13 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Sneha Pradhan",
                    "user_href": "/profile/Sneha-Pradhan-95"
                },
                {
                    "user_id": "Moyinoluwa Olawoye",
                    "user_href": "/profile/Moyinoluwa-Olawoye"
                },
                {
                    "user_id": "Nabil Shahid",
                    "user_href": "/profile/Nabil-Shahid-4"
                },
                {
                    "user_id": "Meenal Joshi",
                    "user_href": "/profile/Meenal-Joshi-9"
                },
                {
                    "user_id": "Neha Soni",
                    "user_href": "/profile/Neha-Soni-731"
                },
                {
                    "user_id": "Aditi Saptarishy",
                    "user_href": "/profile/Aditi-Saptarishy-1"
                },
                {
                    "user_id": "DeejayTeeno Darlington",
                    "user_href": "/profile/DeejayTeeno-Darlington"
                },
                {
                    "user_id": "Durgesh Nandini",
                    "user_href": "/profile/Durgesh-Nandini-14"
                },
                {
                    "user_id": "Alan Sherin",
                    "user_href": "/profile/Alan-Sherin-1"
                },
                {
                    "user_id": "Lyndon Nelson-Allen",
                    "user_href": "/profile/Lyndon-Nelson-Allen"
                }
            ]
        },
        {
            "author_info": {
                "name": "Neil Patel",
                "href": "/profile/Neil-Patel"
            },
            "answer_text": "Content is king, right? If you believe this to be true (and you should), you understand the importance of creating high-quality content that converts. But how does one create amazing content? There are certain situations where traditional marketing is effective, but this isn’t nearly as powerful as it was in the past. In today’s digital era, it’s all about content marketing. Once you have content, you need to effectively push it out on social media expanding social networks to grow your captive target audience. Not only does content marketing cost less than traditional marketing, but 80% of B2B marketers have a strategy in place to attract their target audience. If you don’t make a concerted effort to implement a sound content marketing strategy, you will continue to spend more money than you have to, while also slipping further behind the search engine competition. You may have a great content strategy, meaning you know who your target audience is. From there, you need to implement a \"creating great content strategy.\" But, what if you don’t have the experience, knowledge or time to create high quality content that converts? This isn’t an excuse to give up and go back to your old ways. It’s time to turn your attention to the tools and services that can boost your content creation efforts, despite your shortcomings.  5 Content Creation Tools 1. Evernote In an overall sense, Evernote is a powerful tool used by entrepreneurs, for a number of reasons. For the sake of this article, we’re going to examine how it is used to create better content. Evernote makes it simple to keep track of all of your ideas. From blog post titles to outlines, if it’s floating around your mind, then this service can come to the rescue. Once you create a note, it’s accessible from now until the end of time (as long as you don’t delete it, of course). From a content creation perspective, here’s why you should be using Evernote: Create posts in Evernote and then transfer them to your content management system, when the time comes.Take notes related to future blog posts. This is preferable to recording your thoughts on paper, because paper is more likely to go missing.Share your thoughts with others to develop great content. Maybe you want to share a blog post idea with one of your writers. Or, maybe you need to share a draft with an editor. Evernote makes this simple.Through a variety of tools and unique features, Evernote will forever change the way that you create content.  2. Portent’s Content Idea Generator It’s called writer’s block and it’s a serious problem that can stop you dead in your tracks. Even worse, some people run into this before they ever reach the first sentence. If you struggle to create blog post titles, this tool will change your writing strategy forever. Getting started is as simple as entering your keyword. For example, “content writing.” Upon running a search, you are presented with this:  Best yet, if you don’t like the first suggestion, you can continue to hit the “generate” button. Sticking with this example, other suggestions include: Why Content Marketing is the Best Thing Since Sliced Bread13 Ways Content Marketing Can Make You Rich20 Movies with Unbelievable Scenes About Content MarketingYou get the point. Portent’s Content Idea Generator guarantees that you will never run out of unique, actionable titles to fit your content strategy. Not every suggestion will make sense, but there is no shortage and even an apparently odd suggestion can inspire you. This tool is great in helping you create great content. 3. Hemingway Editor This is a nifty tool that pushes the quality of your writing to the next level. In addition to identifying problem areas, it also categorizes each one so that you know how to fix them. Here is an example that shows a variety of errors.  The color coding shows you the mistakes, with each one outlined on the right sidebar:  Get into the habit of using the Hemingway Editor to review all of your blog posts. Not only does it help you repair content, but it also trains you to avoid the same mistakes in the future. This allows you to save time down the road being more efficient in creating great content. This frees up time to focus on various social networks strategies. 4. Infogr.am With visual content marketing continuing to rise, it’s time to rely on the services of Infogram and related tools. Approximately 50% of marketers say that photography is essential to their marketing strategy. Furthermore, content with relevant images attract 94% more views than content with none. With the help of Infogram, you don’t need to be a professional designer to create eye-popping online charts and infographics. There is also no reason to spend thousands of dollars hiring a professional. Here is the tool’s tagline: “Create and publish beautiful visualizations of your data. Interactive, responsive and engaging.” Making a chart is a simple three step process: Choose a template.Visualize your data by adding charts, images, maps, videos and more.Publish and share through one-click share buttons or a simple embed code.Here is an example of a chart, created by Bleacher Report, using the Infogram tool:  Every aspect of the image was personally customized by the client, including the title, colors and chart data. Also, pay close attention to the bottom left corner, as this is where the social network “share” button is located. With this, readers have the ability to quickly share your chart with their audience, thus driving traffic and helping you generate backlinks to your blog post. Every content marketer eventually understands that backlinks to your blog post is the currency of the search engine. Content with high quality, data-driven images will keep visitors on your site longer. Infogram makes it simple to create visualizations of your data, all in a fast and affordable environment. 5. ilys Using Portent’s Content Idea Generator, you will never again run into issues generating unique titles. But, that doesn’t do you any good once it’s time to create the actual content. If writer’s block continues to hinder your progress of creating great content, a tool like ilys can be useful. First, it asks you how many words you want to write. Since 2,000+ words gives you the best chance of a page one ranking, this is a good place to start. From there, the tool gives you little choice but to work towards your goal. It is not until you reach your goal that you are permitted to edit the text. Since there is nothing else that you can do, you are encouraged to just keep writing. There is no editing, for now. There is no deleting, for now. There is plenty of time for that once you reach your word count goal. I suggest that you experiment with this tool for many reasons, including the fact that it will train your mind to write more consistently and efficiently in the future. By tracking your progress over time, you can examine where you are succeeding and failing. Consistency is key, when creating content and blogging in general. You can use ilys to improve in this area, thus putting writer’s block behind you once and for all. You can now focus on creating great content for your target audience.  7 Content Creation Services 1. Upwork When Elance and oDesk joined forces, the end result was the most powerful freelancing platform in the world. With $1 billion in annual billings, Upwork is used by freelancers and companies looking to connect with one another. It's a business, not social network. As a company seeking content creation professionals, there are many benefits to Upwork. It's the number one freelancing platform, meaning that you have access to thousands of writers.Writers of all pay ranges, make it simple to find someone who fits your budget.You have the ability to communicate and work within the Upwork system, thus removing risk from the hiring process.With so many writers to choose from, the best thing that you can do is to start by searching those with the highest rating.  A 100% job success doesn’t guarantee the person is right for you, but it’s a good start. There are writers on Upwork who are true professionals with high ratings and samples to back them up. There are also those who may fall short of your quality standards. While comparing writers, pay close attention to their work history, feedback and test results. This will give you a clear idea of what the person offers and whether or not they should be considered. 2. Contently Have you had trouble finding freelancers in the past? Are you concerned about making another bad decision? Contently takes all of the guesswork out of the process, as this company is based, primarily, on one word: quality. If you are seeking high quality content from only the best writers, Contently is the platform for you. Professional tip: if you already have writers in place but require editing assistance, Contently can also help with that. Some of the many reasons to choose Contently include: You are seeking pre-qualified writers who have already proven their ability. Contently does all of the legwork for you.You are interested in a platform that provides a collaborative environment for submitting, reviewing and editing work.You are willing to pay top dollar for premium content.With more than 55,000 creative professionals, including writers, waiting to connect with you, it’s possible to find the best talent at the right price, all without jumping through a lot of hoops. Contently has carved out a niche based on quality. When it comes to content creation, there is nothing more important than that.  3. WriterAccess If ease of service is as important to you as quality, Writer Access is a service to learn more about. In addition to access to thousands of writers, the Writer Access platform provides analytics data and only requires you to pay if you are 100% satisfied with the service. This risk-free environment allows you to confidently rely on Writer Access for all your content creation needs. On your search to find the perfect writer, you are presented with this screen:  With so many options, you can quickly narrow your focus. For example, you may only be interested in the highest quality bloggers in a certain zip code. Writer Access allows you to easily enter this search criteria. Other reasons to use Writer Access include: Access to writers who have been tested by the service.If you require content now, not later.If you want to learn more about a writer, such as his or her bio and industry experience, before hiring.When you want to experiment with different price levels, as writers charge anywhere from $.02 to $1 per word.Writer Access has a solid reputation, with the company serving thousands of clients and working with over 10,000 writers. With a spot on the Inc. 5000 list, Writer Access is anything but a fly-by-night operation. 4. Problogger Job Board Many of the top freelance writers in the world spend their time combing the Problogger Job Board. There are many reasons for this, including the fact that a variety of companies and individual bloggers post high quality jobs here. The Problogger Job Board puts your ad in front of thousands of writers, all for a small fee of $50 for 30 days. Through the first couple weeks of April 2016, almost 50 jobs have been posted on the site. Here are some tips for finding the best freelancers through this method: Create a clear and descriptive title.Share all of the necessary information in the job description, including the exact responsibilities.Don’t be afraid to request detailed information, such as a resume, past samples and pay rate requirements.Here is an example of a well crafted job post:  It's straightforward and it requests all of the necessary information that the company needs to make a hiring decision. I particularly enjoy the “How to apply” section. For example, the part that says “we are NOT looking for part-time writers,\" makes it clear that the hiring party is only interested in full-time writers, thus weeding out everyone else. Sure, you have to pay to use the Problogger Job Board, but you won’t be disappointed with the number or quality of the responses. 5. Content Boxed I personally know of many companies that get into the habit of outsourcing content production, just to slip at some point in the future. They are on board with the idea, but soon go back to their old ways. Content Boxed is a service that protects against this. Here is how it works. Get started by choosing from one of three packages. The two most affordable include:  While there is another option for $675 that includes 10 posts per month, one of these two packages is the best place to start. Once you subscribe, Content Boxed will provide you with the appropriate number of posts on a monthly basis. You can “set it and forget it,” meaning that you will always have the fresh content that you need for your blog ready to share in social networks. The subscription model is just one of the many benefits. Another one worth noting is that each post is a minimum of 1,000 words. This ensures that you never get stuck with short, meaningless posts that provide no value to your readers while hindering your search engine rankings. If you like the idea of receiving high quality, affordable blog posts on a schedule, Content Boxed can be your savior. 6. Freelancer Here is what Freelancer has to say about its service: Millions of small businesses use Freelancer to turn their ideas into reality. The service is not solely for connecting companies with writers, but it is a big part of the Freelancer platform. Here are a couple of statistics that show the power of Freelancer: 18,816,901 registered users8,735,981 total jobs postedWith the Freelancer platform, you gain access to a large workforce of writers. As with other, similar services, some writers will suit your needs, while others will not. The first step is providing information about your job:  From here, you have the opportunity to set a budget and choose from optional services, such as “featured” or “urgent.” Freelancer often takes a back seat to other similar services, including Upwork, but the company has worked hard to change its reputation to one that connects quality freelancers with companies and individuals. 7. Guru The writing category on Guru is robust, to say the least. There are more than 150,000 jobs in the general writing category alone. This means one thing: companies know they can use the service to find quality writers. Not only is it free to post a job, but the thing I like best about Guru is its ease of use. Getting started is a simple process, as creating a job post is as easy as providing these details: Choose the type of work you need to be done, such as “blog post creation.”Provide in-depth details on the project.Choose a category.Add keywords.Set a budget.Set a deadline.Post the job.Since quality is important, here is a suggestion: take advantage of the option to receive better quotes.  Guru shares many similarities with Upwork and Freelancer, but is able to stand out due to its ease of use and convenience. Conclusion The ability to create actionable content is a big component to achieving content marketing success. Even if you don’t have the skills right now, the tools and services above can come to your rescue. As we’ve explored in this post, assistance is available. Your job is to implement the tools and services that fill any voids in your personal content creation process. If you want to be among the 42% of B2B marketers who say they’re effective at content marketing, you may need one or more of these tools and services on your side. What are your thoughts on these tools and services? Do you have experience with any of these? Would you recommend any others? ",
            "date": "Updated April 5, 2017",
            "views": "109",
            "upvotes": " View 55 Upvoters ",
            "upvoters": [
                {
                    "user_id": "H.F",
                    "user_href": "/profile/H-F-79"
                },
                {
                    "user_id": "Fahad Rohan",
                    "user_href": "/profile/Fahad-Rohan"
                },
                {
                    "user_id": "Writers Axis",
                    "user_href": "/profile/Writers-Axis"
                },
                {
                    "user_id": "Moyinoluwa Olawoye",
                    "user_href": "/profile/Moyinoluwa-Olawoye"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/Qila-Fairy"
                },
                {
                    "user_id": "Himanshu Patil",
                    "user_href": "/profile/Himanshu-Patil-40"
                },
                {
                    "user_id": "Haari Vignesh",
                    "user_href": "/profile/Haari-Vignesh"
                },
                {
                    "user_id": "DeejayTeeno Darlington",
                    "user_href": "/profile/DeejayTeeno-Darlington"
                },
                {
                    "user_id": "Rohitashva Singhvi",
                    "user_href": "/profile/Rohitashva-Singhvi"
                },
                {
                    "user_id": "Anand Patil",
                    "user_href": "/profile/Anand-Patil-209"
                }
            ]
        }
    ]
}