{
    "title": "I want to write song lyrics. I don't know how to start, and I need inspiration. What are some methods I could use to start songwriting? - Quora",
    "tags": [
        "Music Suggestions",
        "Song Lyrics",
        "Writing Advice",
        "Songs",
        "Writing",
        "Music"
    ],
    "response": [
        {
            "author_info": {
                "name": "Scott Gardiner",
                "href": "/profile/Scott-Gardiner"
            },
            "answer_text": "I write lyrics.  They aren't great but they are getting better.  I also write blog posts which aren't great but are also improving.  Here are a few tips that I can give you. 1.  Study the lyrics of lyricists that you admire.  There is no better way to learn how to write lyrics that reading the lyrics of those that you admire.  That goes for novels, short stories, and blog posts as well.  My current favourites are Bob Dylan, John Darnielle of the Mountain Goats, and Andy Hull.  Your favourites will probably vary, but it doesn't matter.  2.  When an idea comes to you, write it down.  I can be walking along and have an idea pop into my head and I either write it down or record it on my phone.  It can be an idea for a song, a line that pops into your head, or whatever.  The more ideas that you have down, the better. 3.  Just write!  It doesn't matter if what you write totally sucks.  Much of it probably will.  Most of what I write sucks, but I keep doing it.  I was wrong when I said above that the best way to learn is to study the lyrics of those that you admire.  The best way to learn is to just do it.  Practice, practice, practice.  You'll get better. 4.  Revise.  Never stop trying to make what you have written better.  Go back a day later, a week later, a month later, and see what you can improve. Change a line here, a word there, a verse here, a chorus there.  Keep revising, and keep improving what you have written. Just the thoughts of a mediocre but improving writer. ",
            "date": "Answered April 11, 2015",
            "views": "56",
            "upvotes": " View 9 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Diana Smith",
                    "user_href": "/profile/Diana-Smith-17"
                },
                {
                    "user_id": "Michael Keilhofer",
                    "user_href": "/profile/Michael-Keilhofer-1"
                },
                {
                    "user_id": "Catherine Coderre Porras",
                    "user_href": "/profile/Catherine-Coderre-Porras"
                },
                {
                    "user_id": "Annie C Kuster",
                    "user_href": "/profile/Annie-C-Kuster"
                },
                {
                    "user_id": "Tristan Christensen",
                    "user_href": "/profile/Tristan-Christensen"
                },
                {
                    "user_id": "Angelica De",
                    "user_href": "/profile/Angelica-De"
                },
                {
                    "user_id": "Taylor Lee",
                    "user_href": "/profile/Taylor-Lee-339"
                },
                {
                    "user_id": "Dutta Binayak",
                    "user_href": "/profile/Dutta-Binayak"
                },
                {
                    "user_id": "Ross Tomita",
                    "user_href": "/profile/Ross-Tomita"
                }
            ]
        },
        {
            "author_info": {
                "name": "Neha Palanivelu",
                "href": "/profile/Neha-Palanivelu"
            },
            "answer_text": "You can write a song about literally anything. It doesn't necessarily have to be about love and heartbreak. Find something that you're passionate about or something that interests you. When I write a song, I try to write it like a story. It doesn't have to have a proper rhyme or order. Set a timer (60 sec or something) and write down every single thing that comes to your mind. Bear in mind, it doesn't have to make sense. Note down the gibberish details too. Trust me, it can surprise you. And when you've decided on a topic, write down words/phrases related to the topic. At least 20 words. If you've gone through a breakup, then it's so much easier (This is when you're struggling to write during the first few days). Write down details about your relationship. Something like, their favourite colour, their favourite thing about you, what you miss about them etc. Now, arrange the sentences in an order that it gives you a good rhyme and flow. And coming to inspiration, don't take things for granted. At all. Make a big deal out of everything. It could be about someone you see everyday at the cafe. It could be about your dog that died. It could be about your girlfriend/boyfriend who lives far away from you. Analyse every single situation deeply. And try to make something out of it. And the best thing is be honest to yourself. Try to make yourself vulnerable. It’s not easy, I know, but tell yourself, “It's okay, nobody going to read this, it's okay to make yourself look weak.” I think that honest lyrics have more meaning and they feel more real. So try to write about your personal experiences. ",
            "date": "Answered December 31, 2019",
            "views": "895",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Diana Smith",
                    "user_href": "/profile/Diana-Smith-17"
                },
                {
                    "user_id": "Saurav Pattnaik",
                    "user_href": "/profile/Saurav-Pattnaik-8"
                }
            ]
        }
    ]
}