{
    "title": "I want to become a writer. Which platform should I start with? - Quora",
    "tags": [
        "Creating Writing Advice",
        "Career Advice and Entrepreneurship",
        "Entrepreneur Career Advice",
        "Creative Writing",
        "Writers and Authors",
        "Entrepreneur Advice",
        "Writing Advice",
        "Writing",
        "Entrepreneurship",
        "Career Advice"
    ],
    "response": [
        {
            "author_info": {
                "name": "Jody Lebel",
                "href": "/profile/Jody-Lebel"
            },
            "answer_text": "I'm  going  to  give  you  my  stock  answer that  I  give  everyone  who  asks  me  this  question. Most  people  will  tell  you  to  just  start  writing, and  keep  writing, but  I  don't  agree.  I'm  going  to  tell  you  why,  give  you  some  good  advice on  how  to  learn  the  craft,  and  give  you  a  place  to  send  in  some  of  your  work  when  you're  ready. It's  not  enough  to  just  write  every  day  if  you  don't  know  what  you're doing.  That  just  means  days  and  weeks  and  months of  useless  writing. It's  like  not  knowing  how  to  knit  so  you  just  keep  making  loops  with  the  yarn.  You  can't  get  better,  you  can't  turn  that  into  a  scarf  ...  you have  the  desire, but  you  don't  know  how.   In  order  to  write  stories  that  people  want  to  read  you  will  need  to  understand  how  to  put  one  together. There  is  a  definite  pattern and  rhythm  to  it.  And  there  are  certain  expectations from  the  editors and  publishing  houses as  to  how  your  story  is  laid  out.  You  will  need  a  good  imagination,  one  that  can  look  at  a  situation and  picture  all  sorts  of  different  scenarios. You  need  to  be  able  to  ask  'what  if'  and  come  up  with  twists  and  lines  that  are  new  and  fresh. You  will  need  to  be  able  to  research  things. For  example  I  wrote  a  story  set  in  Iran  where  there  was  a  wedding.  I  had  to  research  how  the  wedding would  take  place, the  food,  the  customs,  common Iranian  names,  clothing, etc.  in  order  to  write  an  interesting yet  correct  story.  Take  classes in  writing;  grammar and  punctuation  (very  important...  lots  of  self  published  books  are  swimming in  glaring  errors and  typos),  character building,  dialogue,  plotting, pacing,  point  of  view  (POV), inner  and  outer  conflicts,  subplots, scenes  and  sequels, genres,  story  boards, twists,  chapter  hooks, suspense,  killer  opening lines,  and  satisfying endings.  If  you're going  to  write  sci-fi  you  will  need  to  take  classes  in  world  building. Each  genre  of  book  has  its  own  set  of  expectations  from  the  reader that  you  will  need  to  fulfill.  For  example  a  murder  mystery must  have  clues  for  the  reader  to  try  and  solve.  A  romance  needs  a  happen ever  after  ending, known  to  writers as  an  HEA.  A  thriller needs  fast  pacing and  danger.  Where  to  find  these  classes? Local  community  colleges often  offer  writing classes.  My  local  library  has  classes  seasonally. Best  of  all  there  are  hundreds  of  classes  you  can  take  on-line.  They run  about  $25-$35 each  and  range  from  2  to  4  weeks.  Google on-line  writing  classes and  you  will  get  lots  of  sites. There  are  sites  that  offer  expensive  classes, so  be  careful. I’d  recommend  starting with  a  few  less  expensive ones  to  see  if  you  really  like  writing  and  want  to  continue.  IMO  it  is  not  necessary to  have  a  degree  or  to  take  an  expensive course  to  write  well.  Try  SavvyAuthors.  They have  classes  year  round.  You  can  join  their  site  for  free  and  get  a  discount on  their  classes.  Read  a  lot.  Get  a  feel  for  how  a  story  is  told;  how  it  starts,  how  it  progresses through  the  story  to  a  satisfying  end.  See  how  your  favorite author  keeps  you  interested.  I  don't  know  your  age,  but  when  you  can  join  some  writing  groups, even  ones  online. Oftentimes  these  groups offer  lectures  and  classes  in  writing.  They  share  their  work  and  critique  each  other.  Writing is  an  art,  but  it's  a  learned art.  It  is  very  satisfying to  see  your  name  on  a  story. It's  doubly  satisfying to  hear  people talk  well  about  your  work.  It's  even  nicer  to  receive  a  check  :). Write  short  stories  (800  -  1500  words).  The  more  you  write,  the  better  you  will  become. You  will  make  new  writer mistakes,  we  all  did.  But  that's  how  you  learn. I  say  start  with  short  stories  because they  are,  well  short,  and  don't  take  years  to  complete  like  a  novel  does.  You  can  share  your  stories with  others  and  get  feedback. Take  the  feedback and  use  what  you  feel  is  constructive for  you  and  ignore  the  others.  Some  people  don't  give  good  feedback,  or  there  is  a  motive behind  their  negative comments.  You  have  to  learn  which  ones  to  take  and  learn  from  and  which  ones  to  disregard. And  when  you  are  reading and  critiquing  other's stories,  be  kind,  give  good  feedback,  and  find  something positive  to  say  to  them.  It's  hard  to  hear  harsh  things about  your  writing. It's  tough  love.  But  it  works  when  you  get  it  and  understand  why  the  comment was  made  and  you  go  and  make  your  piece  better  because of  it.  Submitting to  contests  is  another  way  to  get  good  feedback because  the  judges are  usually  editors and  agents  who  have  their  finger  on  the  pulse  of  good  writing  that  sells.   Once  you  feel  you  have  written a  great  short  story,  be  brave  and  submit  it  to  a  magazine  that  publishes  fiction in  the  genre  you  wrote. Don't  worry  about  rejections.  They  will  come.  Oftentimes  it's  not  because your  story  is  not  good,  it's  because the  story  doesn't fit  their  needs. They  are  running a  business  after  all,  and  they  pick  the  stories that  they  feel  will  best  entertain  their  readers.  All  authors  get  rejections.  It's  part  of  the  'hunt'.  Here’s  a  place  to  start  submitting. Check  out  their  guidelines  carefully. FLASH  FICTION ONLINEhttp://flashfictiononline.com/main/submission-guidelines/We  publish  stories from  500  to  1,000  words  in  length. They’re  very  short, but  they  are  still  stories. That  means  the  best  ones  have  strong, interesting  characters,  plots, and  (to  some  extent,  at  least)  settings. We’re  not  that  concerned  about  genre.  Many  of  us  have  a  fondness  for  science  fiction and  fantasy,  but  we  also  like  literary fiction;  and  in  any  case,  great  flash  stories  aren’t always  easily  classified. If  you  wrote  it,  and  you  love  it,  then  submit  it.  No  erotica, porn,  graphic  sex,  or  violence. Pays  $60  per  story.  Buys  reprints  at  two  cents/word. ",
            "date": "Answered May 9, 2016",
            "views": "13",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Learner",
                    "user_href": "/profile/Learner-209"
                },
                {
                    "user_id": "Lee McNeill",
                    "user_href": "/profile/Lee-McNeill-4"
                },
                {
                    "user_id": "Robert Otor",
                    "user_href": "/profile/Robert-Otor"
                },
                {
                    "user_id": "Tracy Tedesco",
                    "user_href": "/profile/Tracy-Tedesco-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Arnie Benn",
                "href": "/profile/Arnie-Benn"
            },
            "answer_text": "Your question is somewhat unclear. If you mean how to start on the writing process itself, there is no one platform better than another. The point is to organize your thoughts, structure what you want to say, and then write it in long form. Whether you use index cards, Pages, or Word is immaterial. I even use email to send myself thoughts as I have them, all using the same subject heading so I can later search and find them all in my email app. I believe in making a simple and clear outline of the idea flow through the book. Bullet points. Clarify those concepts into chapters, and then add detail and brainstorming to each chapter. When the ideas and email notes have mounted up, you can transfer them to your word processor document, adding each idea into its appropriate chapter. The rest becomes about cleaning up the text, editing, and getting meaningful editing input from a reliable and substantive person/source. You do not want to publish a book containing errors and typos. What most people OVERLOOK is that fact that the marketing of the book must inform the way you write and package the content. You must think about what will attract your reader’s eye to first pick up/click on and then buy your book BEFORE you write it. So whatever concept you are developing, it is highly recommended to think of and have made a great cover design, and to carefully craft the title and cover text in order to best sell and convey the essence of what you want to get across. Spend some time looking at Amazon best-sellers in the category in which you will be writing. Think of your book as a catchy brand whose title and cover should not only be attention-grabbing but also simple and memorable. It may seem counter-intuitive to think about this marketing and branding stuff before the book is even done, but it will make all the difference when you eventually try marketing it. ",
            "date": "Answered July 11, 2017",
            "views": "291",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Dustin Taylor",
                    "user_href": "/profile/Dustin-Taylor-86"
                },
                {
                    "user_id": "David Topers",
                    "user_href": "/profile/David-Topers"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/KP-522"
                }
            ]
        }
    ]
}