{
    "title": "I want to write fiction. Where do I start? - Quora",
    "tags": [
        "Fiction Writing",
        "Fiction",
        "Writing Advice",
        "Writing"
    ],
    "response": [
        {
            "author_info": {
                "name": "Dennise Morris",
                "href": "/profile/Dennise-Morris"
            },
            "answer_text": "1. Begin with tension Time and time once more you’ll hear fiction writers and instructors tell you to begin with action. this can be blemished recommendation. Why? What smart is that the action if it isn’t grounded in context that’s necessary to the story or attracts you to the most character? It’s higher to begin with tension, sort of a character falling short on obtaining one thing he wants—can’t save the lifetime of a beloved, can’t beat a rival during a race, etc. 2. Know what your characters’ desires are Interesting stories come back from characters who need one thing. Romeo and Juliet need one another. Harry Potter desires to beat Draco Malfoy and Slytherin in Quidditch. Hannah Baker desires the those who junction rectifier her to commit suicide know how they hurt her. Writing a fiction book needs that you just have compelling characters, and characters who have strong desires and needs are the foremost compelling kind there are. 3. Finish every chapter on a cliff Ok, you don’t got to finish every chapter on an actual cliff, however you are doing have to be compelled to leave them with unreciprocated queries. This doesn’t mean you can’t answer queries throughout the book, it simply means that you would like to make new ones as you go on. Be inventive. Fiction is constructed on the curiosity of readers. If you don’t spark their curiosity, what incentive do they need to begin following one? 4. Give your characters obstacles The obstacles are often as troublesome as you would like. However the key here is that they need to be able to overcome the obstacle notwithstanding what it is—drug addiction, in love with an individual who’s on the antagonist’s side, etc. Fictional writing is strongest once characters face robust odds and still come back through within the finish. 5. Understand your audience Are you writing a fantasy novel? a criminal offense novel? Fiction genres are totally different and are told in several ways that, thus audiences of every have totally different expectations that you just have to be compelled to cowl. as an example, if you’re writing crime fiction, you've got to reveal what happened early and pay the novel finding the crime. If you’re writing a adventure story, your story is dedicated to characters making an attempt to prevent no matter it's from happening. ",
            "date": "Answered October 11, 2016",
            "views": "310",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Jay Indora",
                    "user_href": "/profile/Jay-Indora"
                }
            ]
        },
        {
            "author_info": {
                "name": "Donna Fernstrom",
                "href": "/profile/Donna-Fernstrom"
            },
            "answer_text": "The most important thing you can possibly take to heart at this stage, is that every single writer writes a little differently. There’s no one ‘formula’ for writing which is ‘correct.’ Some writers are ‘plotters’ who create an outline, and carefully compose each character, each plot detail, and how everything will come together, before they start writing. Some writers are ‘pantsters’ who start with just an idea, or just a character, and simply begin writing and let the story come out as it will (writing by the seat of their pants). And examples of both are on the bestseller lists; as well as every possible variation in between. What will certainly help you, and I dare say is actually essential, is that you must be a reader, first. Read, read, read - read in your genre (the type of fiction you’re interested in - such as science fiction, fantasy, historical, etc) , and some outside of it. Reading packs your mind full of tropes, phrases, a natural understanding of literary grammar and spelling, a natural feel for how story arcs flow, and what makes a story successful. Of course, if you want to write fiction, chances are you’re already an avid reader. Next, you need to be sure you have the basics down. You can acquire that by taking a creative writing class, and reading some books on writing. Just be sure to keep in mind that every individual writer has their own method (and most of them will tell you that it is ‘how to write,’ rather than ‘how I write,’ lol). The third ingredient is drive. You have to really want to do it, and have the self-discipline to follow through. You have to enjoy the process of writing, and enjoy the process of revising what you wrote, too. It’s a lot of work; and there are a lot of writers. Lots of competition. You’re more likely to win the lotto than you are to become the next Stephen King or J.K. Rowling. So, if you don’t love it… don’t bother. You’re not likely to get rich at it. Or even make a living (don’t quit your day job until the ink on the contract’s dry). And by far the most difficult thing for most people to do, when they want to become a writer; START WRITING. Today. ",
            "date": "Answered May 27, 2016",
            "views": "16",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "R Patra",
                    "user_href": "/profile/R-Patra-1"
                },
                {
                    "user_id": "Monika Agrawal",
                    "user_href": "/profile/Monika-Agrawal-49"
                }
            ]
        }
    ]
}