{
    "title": "I want to write a novel. Where should I start? Do you have any tips? - Quora",
    "tags": [
        "Novel Writing",
        "Creative Writing",
        "Novels",
        "Writing Advice",
        "Writing"
    ],
    "response": [
        {
            "author_info": {
                "name": "Marianne Joyce",
                "href": "/profile/Marianne-Joyce-2"
            },
            "answer_text": "If you are interested in writing genre fiction, you need to decide what genre appeals to you -- romance, mystery, suspense, thriller, science fiction, western, and so on. Each of these has sub-categories, so you will need to narrow down your particular sub-category. Once you have decided on your category, go out and get five recently published novels in that category and read them. Bookstores tend to group novels by category, so you should be able to figure this out. After you have read all five, you will need to do some analysis. This should give you ideas on how that category works in terms of tone, types of characters, settings, plot devices, level of detail, how POV is managed, what types of conflicts are used to propel the plot. By this time, you should be having a few ideas for your own novel, so start thinking about your central character and get a firm idea of where she is at the beginning, what main things happen to her in the course of the story, and how she changes at the end. You may want to write biographies of your main characters so you know them pretty well. Now you are ready to write a \"beat sheet\" that sets out each scene. You need to tell the story in scenes. You should have about 70-80 scenes to make a novel, but this is pretty flexible. In any case, you will need quite a few. Virginia Woolf described this stage of novel writing as \"scenes form.\" Ideas for scenes should begin to occur to you, and they may group into sequences. Once you have your beat sheet of scenes and sequences, you can start writing. You don't have to start with the first scene. Start with a scene you feel comfortable with. See how it goes. This is just one way. There are many others. Hemingway said, \"Anyone can write a novel in first person,\" and I found that comfortable for my first few novels. Keep in mind that this applies only to genre fiction. If you want to write literary fiction, only God can help you. ",
            "date": "Answered April 28, 2018",
            "views": "335",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Sheri Fresonke Harper",
                    "user_href": "/profile/Sheri-Fresonke-Harper"
                },
                {
                    "user_id": "Sushree Sangeeta",
                    "user_href": "/profile/Sushree-Sangeeta-23"
                },
                {
                    "user_id": "Coreen Pendergraff",
                    "user_href": "/profile/Coreen-Pendergraff"
                }
            ]
        }
    ]
}