{
    "title": "I want to write an essay for IIChe competition. Give me an idea of format in which it should be written so that it will have more impact on examiner? - Quora",
    "tags": [
        "Indian Institute of Chemical Engineers, BIT Mesra Chapter",
        "Essay Writing Help",
        "Essays",
        "Writing Advice",
        "Writing"
    ],
    "response": [
        {
            "author_info": {
                "name": "Markendeya Yeddanapudi",
                "href": "/profile/Markendeya-Yeddanapudi"
            },
            "answer_text": "A University for perception by Smell There was a time, when breathing and the resulting smelling was actually communication,perception,interaction,action,understanding,memory...,everything in one single activity—breathing. It was living. Even today the main mode of communication is the body language which it appears accounts for more than 67 per cent of the total communication. In fact there are many that say that the remaining 33 per cent communication attributed to words is actually the damage which the words cause to the real communication. To make for the fundamental deficiency of words in the communication, we have been resorting to definitions, scopes, qualifying the definition and scope---bending backwards to communicate and ultimately trying to reduce everything into a mathematical equation. But the best communication is to just sit silently and feeling positively. The result is always the glow of understanding which cannot be put in words. In yoga, Pranayama is recognized as the best method of getting good health in body and mind. In personal relations, it is 100% positive feeling that gives the 100% happy glow of positive perception. Unfortunately by boxing the student’s mind continuously with verbal definitions and drilling by words and actually bludgeoning them to memorize the words, the very faculty of natural communication, is getting damaged severely. The advent of Modi is a boon to us. We can start the Universities of Yoga and Holistic approaches, faculties of perception and understanding by the Smell Communication and also recognizing that mother Earth is Bhoodevi and not some dead lifeless lump. Let us recognize the fundamental fact that nature communicates to us by smells and winds and breezes. YM ",
            "date": "Answered July 7, 2016",
            "views": "164",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Terry E. Cohen",
                "href": "/profile/Terry-E-Cohen-1"
            },
            "answer_text": "I am not familiar with this essay competition for chemical engineers. Find out as much as you can about its expectations and requirements from the organization itself or someone in the field, especially someone who may be a member of IIChE. Faculty who teach chemical engineering at a university might be a good resource. Some competitions publish past years of winning entries. If IIChE does, read them and analyze why they won - how did they present their topics, assertions, evidence and conclusions. ",
            "date": "Answered July 8, 2016",
            "views": "89",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Sugam Arora",
                    "user_href": "/profile/Sugam-Arora-4"
                }
            ]
        }
    ]
}