{
    "title": "I was asked to write a storyline about myself but I don't know where to start. How should I write? - Quora",
    "tags": [
        "Storyline",
        "Writing Advice",
        "Writing"
    ],
    "response": [
        {
            "author_info": {
                "name": "Martin Reyto",
                "href": "/profile/Martin-Reyto"
            },
            "answer_text": "Find a quiet, private place for just you and your computer. Go in there with a big mug of your favourite beverage. Sit down in front of the computer. Turn it on, and launch your favourite writing tool. Take a moment to organize your thoughts, and then type. Start at the beginning of your story and keep writing until you reach the end, one sentence and paragraph at a time. Imagine you’re telling the story to someone sitting in front of you When you’re done, take a break for a day. Then go back to it and start to revise. Keep the earlier version on each pass, so you can back out a change if you decide to. Three or four passes ought to put it in the shape you want. That’s really all there is to it. But if you’ve already figured that out and still don’t know how to start, it’s because you don’t have your story in hand yet. If you have no idea what the story is going to be, that’s obviously task number one. Go back over the memory of a dramatic event in your life, recall your feelings, and think about which of your personality traits it evoked, or possibly instilled. You may have a sort of idea about what the story is going to be, but it’s still so vague that you don’t know where it starts, where it ends, what goes in the middle, and even in what order. (The usual and most straightforward order is chronological. I suggest you stay with that until you’re more experienced. But if the story doesn’t work that way, you’ll have no choice but to jump in at the deep end.) This is brainwork usually done up front. Go for long walks in quiet places to work it out. You don’t need to have every detail worked out, in fact it’s better if you don’t, but you have to be confident that when you’re writing, you’ll always know what happens next and a reasonably good idea of how it’s going to end. Remember, no rules about this are engraved in stone. You have 100% creative control, and the above are merely suggestions you might find helpful. Some writers jump in with nothing but the beginning of the story in mind, and then sail away into uncharted waters until, at some point, the end hoves into view (whatever it might be). It’s an exciting, but risky way to work. You could dead-end on the story at pretty much any point, realize it can’t resolve and there’s nowhere to go. Then you end up with something like Kafka’s The Castle. Kafka died while he was writing the first draft, so that’s a pretty good excuse for abandoning it. It just stops and ends in mid-air. But he and posterity lucked out on this one, because it works. It’s hard to imagine a more appropriate and satisfying way to end that particular story. It’s totally in keeping with the rest of it, the sense that there is no end, no resolution. It goes on and on and on until someone hits the gong at some arbitrary place, and then it doesn’t. So you see, there’s no end of ways to go about it. ",
            "date": "Answered July 11, 2016",
            "views": "310",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Musa Ali",
                    "user_href": "/profile/Musa-Ali-8"
                },
                {
                    "user_id": "Hang",
                    "user_href": "/profile/Hang-4"
                },
                {
                    "user_id": "Shashidhara Subramanyam",
                    "user_href": "/profile/Shashidhara-Subramanyam"
                },
                {
                    "user_id": "Maida A",
                    "user_href": "/profile/Maida-A-3"
                }
            ]
        },
        {
            "author_info": {
                "name": "Anne-Marie Yerks",
                "href": "/profile/Anne-Marie-Yerks"
            },
            "answer_text": "Where have you risen? When did you fall? Focus on the life moments that caused a change in your path. Who broke your heart? Tell us about that person. Who took you someplace you didn’t want to go? That would be a good story. When was your most golden time? How did it end? The ups and downs of life make good reading material. The easy times only provide contrast. ",
            "date": "Answered July 11, 2016",
            "views": "211",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "John Basil",
                    "user_href": "/profile/John-Basil"
                }
            ]
        }
    ]
}