{
    "title": "I'm not in Japan and not a pro in manga yet, but still I want to be a mangaka. What should I do in order to get a book published? - Quora",
    "tags": [
        "Book Publishing",
        "Publishing",
        "Manga",
        "Japan",
        "Books"
    ],
    "response": [
        {
            "author_info": {
                "name": "Saurabh Mittal",
                "href": "/profile/Saurabh-Mittal-93"
            },
            "answer_text": "Manga is a cultural phenomenon, not just a style of comics. So technically, to become a Mangaka you would need to learn Japanese (like they were written originally), adopt the style and most importantly know and understand Japanese socio-cultural nuances. But with the popularity of Manga today, you can still create your own comics in the Manga style and get them published. You may not be considered a Mangaka in the traditional sens, but you would be acknowledged as an artist expressing your art in a way that you love - That’s the most important part, right? Once you’ve illustrated your Manga, you can get it published at ‘Pblishing.com’. We publish all kinds of book - all you need is just 150 pre-orders. ‘Pblishing.com’ handles everything from cover design to distribution. So go ahead and make your dream come true. ",
            "date": "Answered July 3, 2017",
            "views": "262",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Aneeka",
                    "user_href": "/profile/Aneeka-6"
                }
            ]
        },
        {
            "author_info": {
                "name": "Ari Abyss",
                "href": "/profile/Ari-Abyss"
            },
            "answer_text": "Well it'll be hard as there isn't many English Mangaka's. You can be a comic book artist but to be a mangaka it is way more difficult. So, you would need to learn Japanese which in itself can take years. Then you have to learn how to draw manga that others will appreciate. Like maybe make some doujinshi’s or do Comissions. Even then, you most likely will never get into the big manga industries and if you do you're not going to be paid well. Especially if you’re not from America. If you check some of my other posts I talk about how people in Japan’s industry dislike foreigners due to a tradition sort of thing. I recommend sticking to your countries comics since you have more of a chance of being successful. So yeah. Good luck, hope I helped. ",
            "date": "Answered July 5, 2017",
            "views": "132",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Aneeka",
                    "user_href": "/profile/Aneeka-6"
                }
            ]
        }
    ]
}