{
    "title": "I'm 16 and want to start reading the classics. Where should I start? - Quora",
    "tags": [
        "Classic Books and Major Works",
        "Classics",
        "Reading Advice",
        "Advice About Books",
        "Literature",
        "Reading",
        "Book Recommendations",
        "Teenagers and Teenage Years",
        "Books"
    ],
    "response": [
        {
            "author_info": {
                "name": "Lawrence Watt-Evans",
                "href": "/profile/Lawrence-Watt-Evans"
            },
            "answer_text": "“The classics” can mean different things, depending on the situation. “The classics of literature” are not the same as “classical literature,” for example. Back in the 19th century there was general agreement on what “the classics” were, but that hasn’t been true for a hundred years now. But let’s start with a few books that were considered essential parts of a decent education until recent times: The King James Bible — you don’t need to read all of it, as there are some really dull stretches that no one really cares about, but you should read Genesis, Exodus, the Song of Solomon, and the Gospels (Matthew, Mark, Luke, and John). This isn’t for religious reasons, but because for five hundred years it was taken for granted that everyone in the West was familiar with these, and references to them are all through our literature and civilization. Shakespeare — you don’t need to read all thirty-seven plays, but you should have a passing familiarity with “Macbeth,” “Hamlet,” “Romeo and Juliet,” “Othello,” “The Merchant of Venice,” and at least one or two of the histories. Since they’re plays, watching a good production can substitute for reading them. (And some of the comedies are still really funny even now, centuries later — my favorite is “A Midsummer Night’s Dream,” but not everyone agrees.) Gulliver’s Travels, by Jonathan Swift. The Pilgrim’s Progress, by John Bunyan. Skipping back to the real classics, you should read Homer’s Iliad and Odyssey in a good translation. (I’m assuming you can’t read classical Greek.) Be aware that many translations, especially older ones, tend to clean up the stories a bit, playing down the homosexuality, the sexism, and the fact that the Greek culture at the time was based on slavery — slaves are often called “servants” and the like rather than admit how politically incorrect the heroic Greeks were. And rather than go on with an extensive list, let’s stop there for a moment and consider what I’ve suggested so far. These are all old, and the writing is old-fashioned. If you aren’t comfortable with it, you may not get very far with these. Especially if you’ve never read any older books, diving right into these may be too much. So let me instead suggest some ways to ease into it. The Adventures of Tom Sawyer, by Mark Twain, is an easy place to start on 19th-century literature, and leads naturally into its sequel, The Adventures of Huckleberry Finn. The thing is, Huckleberry Finn is a much more serious novel than its predecessor. Get through that and you’re on a decent footing to continue. You’ll have had a chance to get comfortable with the writing style of the time. (Feel free to ignore the other Tom Sawyer sequels; Twain only wrote those for the money, and they’re not very good.) So far, these are all classics of western literature; you might also want to look at Journey to the West, one of the most important and beloved stories in Chinese literature. The Tale of Genji is a starting point for Japanese literature (and is the only one I’ve mentioned so far written by a woman). The Thousand Nights and a Night, a.k.a. The Arabian Nights (even though the story-telling is based in central Asia, not Arabia), is essential for secular Islamic literature; the trick is finding a good translation, as most aren’t very faithful to the originals. I’d like to point at classics from African or native American cultures, but alas, I don’t know those myself. Anyway, there are some suggestions. ",
            "date": "Answered October 20, 2020",
            "views": "866",
            "upvotes": " View 15 Upvoters",
            "upvoters": [
                {
                    "user_id": "Howard Brazee",
                    "user_href": "/profile/Howard-Brazee"
                },
                {
                    "user_id": "Matthew Gordon",
                    "user_href": "/profile/Matthew-Gordon-7"
                },
                {
                    "user_id": "Joanne Vendshus",
                    "user_href": "/profile/Joanne-Vendshus"
                },
                {
                    "user_id": "KoKo M",
                    "user_href": "/profile/KoKo-M-8"
                },
                {
                    "user_id": "Margaret Carter",
                    "user_href": "/profile/Margaret-Carter-2"
                },
                {
                    "user_id": "Steven P Robinson",
                    "user_href": "/profile/Steven-P-Robinson"
                },
                {
                    "user_id": "Deborah Newbury",
                    "user_href": "/profile/Deborah-Newbury"
                },
                {
                    "user_id": "Archit Joshi",
                    "user_href": "/profile/Archit-Joshi-6"
                },
                {
                    "user_id": "Mercedes R. Lackey",
                    "user_href": "/profile/Mercedes-R-Lackey"
                },
                {
                    "user_id": "George Warner",
                    "user_href": "/profile/George-Warner-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Sing Lim",
                "href": "/profile/Sing-Lim-5"
            },
            "answer_text": "Depends on where you would like to start, and what you enjoy. If you like romance classics, I’d suggest you start with Pride and Prejudice or any other Jane Austen novel. For other books around that time period and about regular life, I’d also suggest Little Women. If you’d like more paranormal romance of the 19th century, check out Wuthering Heights or Jane Eyre. If you want to start with American classics that have child protagonists, you should probably read The Adventures of Huckleberry Finn. However, if you want an English setting, go with Oliver Twist or The Prince and the Pauper. If you’re looking for Shakespeare classics, for the most simplest, start with Romeo and Juliet or even better Twelfth Night. Horror short stories never go wrong with Edgar Allan Poe. You might like “William Wilson”, “Morella”, or “The Fall of the House of Usher”. More gothic horror would be Frankenstein (The Modern Prometheus), Dracula (You would be surprised by how many people don’t read this), and The Picture of Dorian Gray. Some really good adventure or something related to that would be The Count of Monte Cristo, Don Quixote, and The Lord of the Rings. Dystopian science fiction would be: 1984, Fahrenheit 451, Brave New World, etc. If just science fiction in general, check out Jules Verne. He wrote 20,00 Leagues Under the Sea, Journey to the Center of the Earth, and Around the World in Eighty Days. Classical (We’re talking Greek and Roman) would be The Iliad, The Odyssey, The Metamorphoses (It’s a mix of myth and history, very heavy), and possibly The Aeneid. Books about fictional revolutions: A Tale of Two Cities or, if you want to really discover Victor Hugo, try Les Misérables (If you’re looking for a lighter read, make sure to look for the abridged edition, or just wait until later). Some Chinese works: Journey to the West, The Art of War, Analects, etc. I hoped this helped. ",
            "date": "Answered October 20, 2020",
            "views": "56",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "KoKo M",
                    "user_href": "/profile/KoKo-M-8"
                },
                {
                    "user_id": "Mahi Mengistu",
                    "user_href": "/profile/Mahi-Mengistu"
                },
                {
                    "user_id": "Bruce Wren",
                    "user_href": "/profile/Bruce-Wren-5"
                },
                {
                    "user_id": "Tiff Dawson",
                    "user_href": "/profile/Tiff-Dawson"
                }
            ]
        }
    ]
}