{
    "title": "I'm a beginner writer, is writing 500 words a day a good goal with which to start? - Quora",
    "tags": [
        "English Writing",
        "Creative Writing",
        "Writers and Authors",
        "Writing Advice",
        "Writing"
    ],
    "response": [
        {
            "author_info": {
                "name": "Kate Cosette",
                "href": "/profile/Kate-Cosette"
            },
            "answer_text": "I think that’s a good goal! You can also try setting a twenty or thirty minute timer and writing for that amount of time. I always found that writing to a timer works best for me than trying to aim for a certain word count, but it depends on what works for you. If you have trouble coming up with ideas, try going online to find writing prompts to get you started. Also, the way that I normally write just for practicing, I just start writing the first thing that comes to mind. It’s called “intuitive” writing, or “writing into the darkness.” Don’t let yourself think twice about it as you write. Don’t go back and edit until you’re done. If its in the middle of a conversation that you start writing, and you don’t know how those characters got there or why, don’t worry! Just keep writing. It’ll really wake up the innate writer inside you. Trust it and ignore your inner critic. Because that way of writing sometimes leaves your story a little jumbled or confused, you can alternate writing that way and this: come up with a goal to pursue. Like, get popular girl in school to go to prom with [character]. Or get to airport on time or something. That way, you can write how those characters achieve those specific goals. It can be any goal. Doing it that way will just get you to practice writing to a goal, and having a specific direction in mind to go. It will also keep you on track, especially when writing stories, because when you’re in the middle of a novel, it’s so easy to forget what the whole point of the story is, haha. If the goal of the character in your story was to get someone to go to prom with them and you have them fighting crime in Spain, then something doesn’t quite click haha. But practicing writing both ways, without thinking about pretty much anything and just writing, as well as having a clear goal or idea in mind, are super important. They are equally important. Lots of people might push outlines or won’t push outlines, but honestly they are both just as vital. Hopefully this helps, and I’m glad you started writing! Writing is awesome. :) ",
            "date": "Answered May 22, 2017",
            "views": "497",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Manik Babbar",
                    "user_href": "/profile/Manik-Babbar"
                },
                {
                    "user_id": "Pat Sonti",
                    "user_href": "/profile/Pat-Sonti"
                },
                {
                    "user_id": "Bert Emery",
                    "user_href": "/profile/Bert-Emery"
                },
                {
                    "user_id": "Avi Sam",
                    "user_href": "/profile/Avi-Sam"
                }
            ]
        },
        {
            "author_info": {
                "name": "Brad Chisholm",
                "href": "/profile/Brad-Chisholm"
            },
            "answer_text": "That is not how you learn to write. It may be how you learn to write crap, but it’s not how you learn to write anything you will take pride in. You do need to commit time to writing. Carry a notebook around. Jot down fragments of conversations, observations, sketches, thoughts. Describe a pretty girl, a car wreck, whatever.Either read or write something each day. Chandler said you don’t have to write, but you can’t garden, wash the dog or reload your gun. Soon enough you’ll get bored and write something.There’s a really stupid saying that you should write what you know. That will last you about 5 minutes because most people don’t know jack (I will say that reading or listening to a true expert is wonderful, whatever the subject). But for our purposes, write about what you care about. Passionately. It can be sea turtles or getting the waitress at the shake shop to go out with you.Don’t read junk except for the specific purpose of genre research. Read the giants. People taller than you for a start.Don’t get caught up in too many ‘creative writing’ courses - yes you need to learn structure, but don’t get your voice strangled before you even find it. Stay away from Dead Cats. NOTE: Screenwriting is a different story, I’m talking about novels and stories. You do need a copy of Strunk & White’s Elements of Style. Memorize it. Don’t worry, it’s thin.Read Hemingway’s memoir, A Moveable Feast, it’s a wonderful tutorial on many things.Finally, the actual writing. Just write like you are sitting in a bar with a good friend telling him a story. Avoid situations that might get you in trouble until you are more experience. For example in my new YA novel (Dash, 2018) EDIT: Dash & Laila Aug 20, 2020 Black Rose Writing - decided on a main setting (Morocco) the time frame (about 2–3 months) and structure (linear). It is deliberately not a thousand year saga with time travel and other dimensions. Keep the structure simple until you are more experienced.Don’t even think about writing a novel until you written at least a dozen short stories.Once you start a novel, and this is critical, DON’T BACK UP. You have to move forward until you have a draft. 60–80k is the commercial length. THEN you go back and edit and re-write it. Most people NEVER get this far.Back up your files on more than one thumb drive. Obvious right? Eat fibre. Be kind to puppies. Help seniors reach the high up packages in the grocery store. Good luck.",
            "date": "Updated July 26, 2020",
            "views": "855",
            "upvotes": " View 8 Upvoters",
            "upvoters": [
                {
                    "user_id": "Madalina Cocos",
                    "user_href": "/profile/Madalina-Cocos"
                },
                {
                    "user_id": "Manik Babbar",
                    "user_href": "/profile/Manik-Babbar"
                },
                {
                    "user_id": "Manisha Sadana",
                    "user_href": "/profile/Manisha-Sadana"
                },
                {
                    "user_id": "Chris Medina",
                    "user_href": "/profile/Chris-Medina-7"
                },
                {
                    "user_id": "Pat Sonti",
                    "user_href": "/profile/Pat-Sonti"
                },
                {
                    "user_id": "David Kittrell",
                    "user_href": "/profile/David-Kittrell"
                },
                {
                    "user_id": "Chen Jason",
                    "user_href": "/profile/Chen-Jason-15"
                },
                {
                    "user_id": "Michelle Hozey",
                    "user_href": "/profile/Michelle-Hozey"
                }
            ]
        }
    ]
}