{
    "title": "I'm writing a novel and need some help with knowledge about WW2 and positions in the Nazi regime. Could someone who is knowledgeable in this help give me some context? - Quora",
    "tags": [
        "Novel Writing",
        "Nazism",
        "Nazi Germany",
        "Creative Writing",
        "Novels",
        "World War II",
        "Writing Advice",
        "Military History and Wars ",
        "Writing",
        "Books"
    ],
    "response": [
        {
            "author_info": {
                "name": "T. Stephen Cornelius",
                "href": "/profile/T-Stephen-Cornelius"
            },
            "answer_text": "Do your own grinding and depth of reading and hours watching and interviewing and taking careful detailed notes and watching official documentary films or videos… Library archives and official organization archives can be access all over the internet! It takes a lot of personal grit and homework discipline time to from outline stage, to character research and development, the narrative style consistency… to write a novel and have it be a respected and published (even self-published) novelist work… It’s not for others to write it for you, they can’t, it’s you telling narrative and style, not theirs… but they might be willing to review it when you have something solid to review and not just a pile of notes… or do or direct some of your writing with you if paid for their time and energy… Many novelist will hire active, passionate researchers (like me) to build you a knowledge file of verifiable facts to assists you in assembling the story line for a fiction drama or chronology as a non-fiction work… get you the details of authenticity to weave into the story… If paid an advance and then by the incremental billings for hourly research time/… like a lawyer to help you make your case of a novel or agreed fixed fee for specific assignments you set befitting your needs and wants. - you’ll get it all back when the novel gets ranked on the best seller list or from a publisher advance - or maybe never if you’re self-publishing and self publishing it through a vendor like Amazon or whomever. Have you researched what it typically takes to write a novel size book? It’s not a brief essay or a short-story element about some aspect of WWII, right! You could read novels by famed authors regarding WWII for insights (do not plagiarize their work)… is your novel a fact or fiction work??? ",
            "date": "Answered October 31, 2018",
            "views": "60",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Bill Howard",
                "href": "/profile/Bill-Howard-10"
            },
            "answer_text": "This is going to be a self-published book, I bet. Part of writing a novel is doing work called research. Once the author has done that, and assuming he or she has friends and professional colleagues, the author turns to them and others for input on overall style. The author turns to experts on, say, how the German high command interacted with each other. The author should already know what the various ranks are. The author also buys or borrows lots of books to do more of this research thing. You as the author are supposed to get it mostly right and then an expert may help you as a friend or for a fee to fine-tune the final bit of expert knowledge. ",
            "date": "Answered October 30, 2018",
            "views": "149",
            "upvotes": "0"
        }
    ]
}