{
    "title": "I'm writing a superhero universe and need help with one of the protagonists. She's a female, 16-year-old, with super-speed, any ideas? - Quora",
    "tags": [
        "Comic Book Superheroes",
        "Superhero and Comic Book Movies",
        "Comic Books",
        "Superheroes",
        "Writing Advice"
    ],
    "response": [
        {
            "author_info": {
                "name": "Mike Schneider",
                "href": "/profile/Mike-Schneider-30"
            },
            "answer_text": "Consider the consequences. Is she rapidly aging because she burns through cells faster? ..or is her aging decelerated due to her increased speed and special relativity? Does it alter her perception of time making her impatient and pron to boredom? How does she deal with that boredom? Does she have to consume a massive amount of calories like the Flash? If so, maybe people assume she’s bulimic since she’s a young girl who ( from the outside perspective ) is binge eating without gaining any weight. How can she afford to eat/ her parents afford to feed her? Do drugs/ booze hit her faster or burn out of her system immediately? Do she heal quickly? If so, when it that a bad thing ( ex bones fusing before they’re set so they need to be rebroken to set them correctly ). Does her heart beat fast? Could she bleed out before the blood oxidizes and clots? Do bacteria reproduce in her system at an excellerated rate to the point that she goes from well to deathbed in minutes? Do viruses mutate in response to her cells meaning any sickness she gets becomes a fast-acting plague that ravages the people around her? Does she phase through things uncontrollably? Do her shoes melt/ clothes catch fire? What about make-up? Does her hair grow super fast? Does she have horrible body odor? Is her libido out of control? If so, is she melting condoms and/ or burning dicks off friction? Does she get pregnant and carry the baby to term in minutes? What are we going to do with all these insta-babies? Does she need to sleep extra to catch up? Or does she have such rapid sleep cycle that she’s awake but for a few seconds every day? What does she do with that extra time? Is being awake driving her mad? Is her thinking super fast too? Does she act on instinct before thinking only to create massive collateral damage? Is she prone to missing details? Does her memory seem poor because to her something you said a minute ago feels like years? Is she unable to look at screen because of the puttering refresh rate? How would a teen survive in the present day without tv, movies, computers, etc? Does she give off static electricity which zaps people and fries electronics? So on and so forth. ",
            "date": "Answered July 9, 2016",
            "views": "135",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Isabel Travis",
                    "user_href": "/profile/Isabel-Travis-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Graham Ready",
                "href": "/profile/Graham-Ready"
            },
            "answer_text": "Not sure what kind of ideas you’re asking for, so I decided to think about ideas for a few major categories. Let’s break them down, shall we? Name Ideas: Honestly, since I don’t have a personality/backstory to go off of, I’m not sure how much I can help here. As such, most of these suggestions are just synonyms for words like speed and fast, or things associated with running. Still, though, maybe you’ll find some use for these(maybe give one of these names to a corny supervillian ;)) DartSwiftFleetMarathonWhirlwindPersonality: For this one, I think it might serve to go against the grain a bit. When you think of a speedy character, you generally think of someone who’s chipper, excitable, and wise cracking, right? At least, that’s what I think when I see such a character. As such, I’d suggest making her personality a stark contrast to that. She’s a teenager, after all, and I can tell you from personal experience that, in some ways, it kinda sucks, what with hormones and your parents “not understanding you” and all that, even more so when you’re a girl and have to deal with periods and, in some cases, guys staring at your breasts whenever you walk down the hall. As such, make her sarcastic, kind of defensive, and very hot tempered and rebellious, while still being a good person at heart. Backstory: For her backstory, I’m not going to go into some kind of super long and detailed explanation about how she is the way she is, what her life is like, how she got the powers, etc.: that’s your job. What I will do is give you some ideas on how to start and how to proceed given the fact that she is a teenager having to deal with being a superhero on top of typical teenager stuff, while also addressing some of Matthew Rowe’s points. For how she gets the powers, while being born with them would be a nice twist to the typical teenage superhero formula, I feel like suddenly having them thrust upon her would be far more dramatic and allow for more character development as she tries to get used to them. As for whether or not she likes them, I’d refrain from making it that black and white. Make her like being able to do certain things more easily, but have her dislike other things, such as the stress of being a superhero. Speaking of which, I’d go against her choosing to be a superhero at first. Most of the time, superheroes decide to become superheroes because of a traumatic event or a strong sense of justice or something else that certainly doesn’t justify running around in spandex. For this character, make it more like she’s caught in a bad situation as a result of some criminal’s plans and thus is forced to defeat them and just so happen to save people’s lives in doing so. From there, she should keep doing it because she enjoys it, not because of some sense of selflessness. No, no, it’s only after something happens to the people she cares about that she realizes she has to be a hero for the sake of others. I think that would be a neat spin on the whole teen superhero thing, and definitely set her apart from other superheroes, where apparently these incredibly gifted and skilled individuals need to have their guardians die before they get off their asses and do some good with those abilities. *Cough* Anyway. I think having the world be familiar with superheroes in a fictional sense, but still be unprepared to deal with their presence in real life, offers a lot more depth than superheroes just being a normal thing. Again, it’s an interesting idea, but I think it should be rare so she can have the whole isolation aspect of being a superhero. After all, to quote Syndrome, “When everyone’s super, no one will be.” Also, have her downplay the secret identity thing a bit. I mean, she’ll still adopt a superhero name and not tell most people who she is, but I think she should be a little less responsible about it than she should be, given that she’ll be making a lot of powerful enemies. Finally, word of advice: if there’s a clever speed based pun you can make during her origin story, don’t make it. Examples include: Putting her on the track team, making her idols track stars or sprinters, or anything of the sort. That kind of stuff is bland, unoriginal, and just plain unnecessary. Let the reader go, “Huh, neat,” when she gets her powers instead of, “Oh, but, of course. However would I have guessed that?” One thing I would add as an element to her backstory is this: she jogs whenever she needs to clear her head. Trust me. There’s all sorts of directions you can go with this. Still, though, don’t make it obvious that she’ll get speed based powers. Speaking of which… Powers: Here’s the cool bit. I know you probably already have some cool powers in mind with her super speed, but I’d like to add a few more abilities for your consideration. Improved reaction time and reflexes: Make her brain able to process information incredibly fast, a la the Flash. It would make for some interesting situations with a teen superhero, such as seeing something going wrong in the area during a class.Improved healing factor: Have her cells repair injuries at a rapid rate, to the point where normally fatal wounds cause damage, but don’t kill her.Super speed in all aspects: Not quite sure how this would work, but it would be cool if she could go incredibly fast in scenarios other than running. For example, if she’s swimming, she’d be able to go almost as fast as if she were running. I feel like that would add a bit more depth to the whole “super speed” thing.Anyway, hope these helped or at least helped you come up with a few better ideas of your own. ;) ",
            "date": "Answered July 9, 2016",
            "views": "450",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Akram Issa",
                    "user_href": "/profile/Akram-Issa"
                },
                {
                    "user_id": "Keniel Arroyo",
                    "user_href": "/profile/Keniel-Arroyo"
                }
            ]
        }
    ]
}