{
    "title": "I'm writing a superhero novel. How should I write the fight scenes? - Quora",
    "tags": [
        "Novel Writing",
        "Creative Writing",
        "Novels",
        "Writing Advice",
        "Writing"
    ],
    "response": [
        {
            "author_info": {
                "name": "Murphy Barrett",
                "href": "/profile/Murphy-Barrett"
            },
            "answer_text": "Firstly, never write a fight scene just to have a fight scene. Like sex scenes, fight scenes should always advance the plot. Whatever plot point you want to advance will inform how you write the fight scene. What are you trying to say with this fight? Also, a fight scene should never ever read like a technical manual. Parts of it may, but not the whole scene. And then, only when skill is actually relevant to the plot. If, for example, the hero has been training, and you want to show that he has greater technical mastery of the fight, show his opponent using basic techniques while he uses advanced. I’ve been writing a lot of sword fights recently, so that will be my example. Ivan sneered at Artyom as they both assumed a high guard, and threw an overhand cut. Artyom parried quickly, reflexively. Ivan cut from the other side, and Artyom again parried. They moved, back and forth, until, realizing he wasn’t dead yet, Artyom began to remember his training. He started to think, to act instead of react. Ivan kept throwing overhand cuts. Artyom could use this. With the next cut, Artyom threw his hands up, and parried high, with his point towards Ivan’s face. In his pleasure at his success, he nearly missed the moment to thrust, but thrust he did. Ivan, surprised, leapt backwards, slapping Artyom’s blade aside. Artyom did not fight the blow, but turned the deflection into a mulinet and cut at Ivan’s head. Ivan parried, and cut against Artyom. Artyom dodged to the side, throwing a crooked cut at Ivan’s hands. Ivan stared in shock at his pinky finger, lying on the ground, while the rest of his hand was about his sword grip. Wasting no time gawking himself, Artyom pressed in, keeping his blade against Ivan’s to close the line, and pressed his point against Ivan’s throat. Ivan glared at Artyom, but said the required words. “I yield.” Or perhaps you want to show how the hero or villain totally dominates. A blow by blow account won’t serve here. Rather, show how no matter what one does, the other counters and advances. Once again, Ivan and Artyom dueled. Ivan’s wrath still smoldered, flaring hotter anytime he was called “Nine Fingers”. He’d been preparing, studying Artyom fight. The two men closed, and Ivan cut at Artyom. Artyom parried, but Ivan simply mutated the cut into a thrust. He cut and thrust at Artyom relentlessly, driving him around the ring, never letting him gain his balance. Artyom parried desperately and tried to counter, but Ivan pressed without yielding, never giving up the initiative. Ivan’s tip finally slipped past Artyom’s guard, and he jerked his head back, barely turning a head-cleaving hew into a gash across his face. In shock and pain, he stumbled out of the ring, losing the fight. Here, the description is far less technical, because the blow by blow simply isn’t important to what the scene is telling you. Then, you can convey entirely different feelings with a fight as well. Artyom offered a sword salute with mock seriousness. Irina returned it, sloppily, grinning. They circled, in high guard. Artyom spoke first, cutting lazily at her. Irina parried sharply, frowned, and thrust at him, pulling off-line at the last moment to slap his cheek with the flat. Startled, Artyom stepped back, sword held out to keep her at bay. She slapped his blade aside and thrust. Artyom parried and tried to counter-thrust, only for the two of them to meet face to face, arms and swords high, each surprised. Artom reacted first, using hands and sword grip to pry Irina’s sword from her hands. She let it go and grabbed him about the shoulders and drove her knee up. Artyom twisted just in time, taking the blow to his thigh. It was surprisingly gentle. He grabbed her hands, and with main strength, spun her abound and pinned her against his chest. She struggled in vain, but could not best the larger man in a grapple. Undeterred, she pressed her butt against him and wiggled suggestively, while bending her head back to look up at him and offer him an excellent view. Smirking at the obvious ploy, Artyom bent his head forward and licked her forehead. She squealed and thrashed. He let her hands slip loose, and she turned herself around to face him, his arms still about her. She reached up and cupped his chin in her hands… Here, the scene is clearly not about the fight at all. This time, the blow by blow description shows that Artyom and Irina are not fighting, but flirting. The point of fight scenes shouldn’t be the fight. The fight should move the story along, should tell you something other than “there was a fight”. Now, as to how you describe the fight itself, the technical aspects, study the type of fight you want to describe. Watch training videos, read manuals, and learn how that type of fight actually takes place, be it a duel with longswords or a multi-battalion battle. If you’re dealing with super-powers, still do your research, and postulate how the super-powers will alter the real-world battle. But always remember, the fight should serve the story, not an atavistic desire for gratuitous violence.  For more, read Quill and Ink Original question-I'm writing a superhero novel. How should I write the fight scenes? ",
            "date": "Updated May 9, 2019",
            "views": "24",
            "upvotes": " View 23 Upvoters",
            "upvoters": [
                {
                    "user_id": "Charles Dandy",
                    "user_href": "/profile/Charles-Dandy-2"
                },
                {
                    "user_id": "Ben Coco",
                    "user_href": "/profile/Ben-Coco-3"
                },
                {
                    "user_id": "Savannah DeLong",
                    "user_href": "/profile/Savannah-DeLong-1"
                },
                {
                    "user_id": "Zegeta Smith",
                    "user_href": "/profile/Zegeta-Smith"
                },
                {
                    "user_id": "Derek Eberhardt",
                    "user_href": "/profile/Derek-Eberhardt"
                },
                {
                    "user_id": "Terry Drinkwater",
                    "user_href": "/profile/Terry-Drinkwater"
                },
                {
                    "user_id": "Chris Moore",
                    "user_href": "/profile/Chris-Moore-288"
                },
                {
                    "user_id": "Joseph Rose",
                    "user_href": "/profile/Joseph-Rose-33"
                },
                {
                    "user_id": "Matthew Ciccone",
                    "user_href": "/profile/Matthew-Ciccone-2"
                },
                {
                    "user_id": "Rajesh Kamble",
                    "user_href": "/profile/Rajesh-Kamble-40"
                }
            ]
        },
        {
            "author_info": {
                "name": "Charles Dandy",
                "href": "/profile/Charles-Dandy-2"
            },
            "answer_text": "My area of expertise. First off, never get repetitive. Batman and the Joker circled each other preparing to fight. Joker slashed at Batman with his knife, which Batman parried with his bracers. Joker growled and slashed again, only to be met with the same result. Joker slashed from the other side this time, which Batman blocked again. Notice how a lot was written, and yet nothing actually happened? That was due to a repetitive choreography. Try something like this. Batman and the Joker circled each other, preparing to fight. Joker slashed at Batman, who deflected the attack with his bracer, then, seeing the Joker was stunned, took his chance and rammed the clown prince of crime into a wall, then elbowing Joker, who growled and responded by stabbing the Dark Knight, then kicking him away and drawing a gun. Doesn't that sound better? A similar amount was written, and yet a lot more happened. Next, be detailed. Don’t ever, ever write something like this. Goku punched Superman. It hurt. This is far better. Goku threw a left hook at Superman, catching him in the chin, breaking the skin. the kyptonian grunted in pain, which quickly faded to a dull throb. Hopefully this Is helpful. ",
            "date": "Answered October 27, 2019",
            "views": "640",
            "upvotes": " View 7 Upvoters",
            "upvoters": [
                {
                    "user_id": "Thomas S Dennis",
                    "user_href": "/profile/Thomas-S-Dennis"
                },
                {
                    "user_id": "Shana Chen",
                    "user_href": "/profile/Shana-Chen-3"
                },
                {
                    "user_id": "Nabilah Binte Ahmad",
                    "user_href": "/profile/Nabilah-Binte-Ahmad"
                },
                {
                    "user_id": "Elijah Burleson",
                    "user_href": "/profile/Elijah-Burleson-3"
                },
                {
                    "user_id": "Luke Dai",
                    "user_href": "/profile/Luke-Dai-1"
                },
                {
                    "user_id": "Darrell Blank",
                    "user_href": "/profile/Darrell-Blank"
                },
                {
                    "user_id": "John Jr Kitchings",
                    "user_href": "/profile/John-Jr-Kitchings"
                }
            ]
        }
    ]
}