{
    "title": "I'm looking to publish a novel for the first time. What is the best way to go about publishing as a first-timer? - Quora",
    "tags": [
        "Digital Publishing",
        "Book Publishing",
        "Publishing"
    ],
    "response": [
        {
            "author_info": {
                "name": "Owen Linderholm",
                "href": "/profile/Owen-Linderholm"
            },
            "answer_text": "That depends on what your goals are. Anyone can publish an ebook very easily via Amazon or via Smashwords. There are tools to help you and it can be done at almost no cost. That's publishing in one sense.  At the other end of the scale there is getting a publishing deal from a major New York Publisher. That is VERY hard to do unless you are already a celebrity and they can guarantee sales based off your name alone. Even great books get turned down all the time. Harry Potter was rejected about 40 times before it was accepted. The Chronicles of Thomas Covenant was rejected over 150 times before it was accepted, including two rejections by the same publisher that eventually took it. Both became big bestsellers. And there are a host of options in between. Smaller publishers are perhaps very slightly more likely to take on a new author than major publishers. And you can self publish properly (get an ISBN, arrange for print on demand etc.) But unless you say more about what you are trying to do it is hard to recommend a strategy. [Adding more now question has more] Editing it yourself is sensible but not enough. You NEED someone else to edit it. Seriously. Even if just to proofread it.  From the sound of things you should go ahead and look at Ebooks from independent authors and publishers and at the kdp kindle publishing programs on Amazon and do one or both AFTER you have a third party edit the book. Then just go for it. Look up Hugh Howie and his writing about self publishing and do a couple of searches on the best way to publish o novel for kindle. Then try it. You have nothing to lose. Just the act of publishing under your name provides basic copyright protection.  Go for it.  ",
            "date": "Updated February 10, 2016",
            "views": "252",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Esther Schindler",
                    "user_href": "/profile/Esther-Schindler"
                },
                {
                    "user_id": "Dustin Hardman",
                    "user_href": "/profile/Dustin-Hardman"
                }
            ]
        },
        {
            "author_info": {
                "name": "Lori Ryan",
                "href": "/profile/Lori-Ryan-5"
            },
            "answer_text": "Hi! First, find some beta readers to read and give you honest feedback. Friends, people in a critique group, people who read the genre. The more, the better.  Next pay for editing. If you can afford it, have a content or developmental edit, copy or line, and proofing (600-800 total). If you can only do bare minimum, use beta readers and pay for a proofer (100-200).  Pay for a cover designer and formatter.  You can find references for editors, formatters, and cover artists on the yahoo list called  Selfpublish. Great list to join and scour the archives.  Selfpublish it on Amazon, Barnes and Noble, iBooks, Kobo, and Draft to Digital. I skip smash words and google play.  Then, start writing the next book.  If you can write a series of books that are linked by common characters, do so. Readers like them and it will increase sales.  I'm a hybrid author. I selfpublished first then published with a publisher and still have my selfpubbed works and am actively growing that side of things. I wouldn't have it any other way. Selfpublishing is a fantastic experience. Just be sure to have your work read and edited as much as you can and listen to the feedback. Read blogs on selfpubbing.  Join the list on selfpubbing. Listen to the people who have put their knowledge out there. There's a lot of it and it's good info!  ",
            "date": "Answered January 29, 2016",
            "views": "253",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Erin Wetzel",
                    "user_href": "/profile/Erin-Wetzel-5"
                },
                {
                    "user_id": "Bill Raymond",
                    "user_href": "/profile/Bill-Raymond-4"
                },
                {
                    "user_id": "Dustin Hardman",
                    "user_href": "/profile/Dustin-Hardman"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/LvR"
                }
            ]
        }
    ]
}