{
    "title": "I've written a screenplay, can I send it to some of you in the film industry? - Quora",
    "tags": [
        "Breaking into Hollywood",
        "Independent Film Production",
        "Movie Advice",
        "Independent Film",
        "Screenwriting",
        "Movie Production",
        "Hollywood",
        "Movie Business and Industry",
        "Movies"
    ],
    "response": [
        {
            "author_info": {
                "name": "Dave Stevens",
                "href": "/profile/Dave-Stevens-7"
            },
            "answer_text": "No. In fact, that's the best way to get your screenplay stolen. Even if you've copyrighted it, very little has to be changed in order to get around it.  What you do is you get an agent. This is done by contacting agencies and convincing them that representing you will make them money. Do NOT send your screenplay to agencies. They will not read it. They will send it back unopened.  You write them a letter detailing what type of scripts (you didn't write just one script, right?) you have written and giving a one or two sentence summary of each. Ideally, these will be from a diverse set of genres and story types. If you pique someone's interest, they may ask to see your scripts. NOW, you may send them. If they like what you have done, they may offer to represent you. Now you're in business. This is how professional, full-time screenwriters work.  The alternative is to shop your script around to indie filmmakers. This can also work out, but requires a lot more luck and you shouldn't expect to be able to quit your day job anytime soon. Oh and no matter what you do, for the love of whatever you hold to be holy, make sure your script is properly formatted and bound. ",
            "date": "Answered March 10, 2016",
            "views": "712",
            "upvotes": " View 9 Upvoters",
            "upvoters": [
                {
                    "user_id": "Jason Charles Dean",
                    "user_href": "/profile/Jason-Charles-Dean"
                }
            ]
        },
        {
            "author_info": {
                "name": "Ruty Ru",
                "href": "/profile/Ruty-Ru"
            },
            "answer_text": "I'm going to disagree with Dan here.  No one wants to steal your script. Well, maybe not \"no one\" but anyone that could do anything with it likely has a ton of stuff they are already working on. That is one of the great myths of Hollywood. News flash, what you wrote (especially if it's your first) is likely so terrible that you won't be able to get people to read far enough to find the unique million dollar idea (if it in fact has one). Even more likely, there's already ten to a hundred scripts floating around with that same idea. Why are you the one to make it better? Because you're writing is that good...well, should be.  I'm not trying to be a jerk, I'm just giving you a realistic view of the community. There are only so many stories (39 I think) and while you might have some high concept idea that breaks one of these stories into newish ground, it's unlikely that anyone can steal it because your voice should be so evident and honed that they can't do much with it.   Further, no one script is gonna be the key. You'll need to churn them out constantly to 1) be worth salt to an agency 2) make any real money 3) stay relevant 4) be any good.  That said, I'll read ten pages. That's basically the best you can hope for from anyone. If it blows them away, they might request more. If you think you're script is balls out amazing, submit to the BlackList.   It's $50.00.  ",
            "date": "Answered March 10, 2016",
            "views": "393",
            "upvotes": " View 4 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Rizwan Dexter",
                    "user_href": "/profile/Rizwan-Dexter"
                },
                {
                    "user_id": "Robert Brown",
                    "user_href": "/profile/Robert-Brown-51"
                },
                {
                    "user_id": "Michael Pachidamrong",
                    "user_href": "/profile/Michael-Pachidamrong"
                },
                {
                    "user_id": "Siddharth Tandon",
                    "user_href": "/profile/Siddharth-Tandon-5"
                },
                {
                    "user_id": "Akshay Bharadwaj",
                    "user_href": "/profile/Akshay-Bharadwaj-7"
                },
                {
                    "user_id": "Arnav Chakraborty",
                    "user_href": "/profile/Arnav-Chakraborty-2"
                },
                {
                    "user_id": "Gary Elmer",
                    "user_href": "/profile/Gary-Elmer"
                },
                {
                    "user_id": "Sundeep Bhagwath",
                    "user_href": "/profile/Sundeep-Bhagwath"
                },
                {
                    "user_id": "Lidya Natasya",
                    "user_href": "/profile/Lidya-Natasya-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Shane Snoke",
                "href": "/profile/Shane-Snoke"
            },
            "answer_text": "Nope, you can't send it to me. Sorry! For the record, I never accept unsolicited submissions. Dave and Ruty have the explanation pretty nailed-down. I'll second that it's highly unlikely anyone is actually going to steal your screenplay, but almost everyone will send it back unopened and unread.  In addition to their answers, you might want to check out this post, \"How to Get Your Script Read\" for more advice. Good luck! ",
            "date": "Answered March 10, 2016",
            "views": "163",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Frank Amsden",
                    "user_href": "/profile/Frank-Amsden-1"
                },
                {
                    "user_id": "Arnav Chakraborty",
                    "user_href": "/profile/Arnav-Chakraborty-2"
                },
                {
                    "user_id": "Ethan Brehm",
                    "user_href": "/profile/Ethan-Brehm"
                },
                {
                    "user_id": "Dave Stevens",
                    "user_href": "/profile/Dave-Stevens-7"
                }
            ]
        }
    ]
}