{
    "title": "If I don't have any hobbies, what should I write in my resume? - Quora",
    "tags": [
        "Hobbies",
        "Résumé and CV writing",
        "Résumés and CVs",
        "Writing Advice",
        "Writing",
        "Career Advice"
    ],
    "response": [
        {
            "author_info": {
                "name": "Emily Brunson",
                "href": "/profile/Emily-Brunson-10"
            },
            "answer_text": "Obviously, your best hope to land a job is a resume with years of relevant, extensive experience. So what do you do when you don’t have that? Maybe you’re just out of school, or you are trying to change careers – it might be trickier, but with our Resume writing tips you can still create an impressive entry-level resume. 1. Keep it short A resume should be a maximum of two pages, but this looks silly when you don’t have enough to fill it! Keep things brief and easy to scan on one page only, so your best achievements quickly stand out to those reading. 2. Keep it simple Unfortunately there is no ‘one true way’ to write a resume. Some hiring managers are horrified by colored paper, some will throw out a CV with an oxford comma – and some will throw out those without! Using an objective or not is up for debate – we lean towards no. 3. Include transferable skills Before you start thinking how to write a first resume, make a list of anything work-related you can think of. Maybe you helped to run a club, or built an exciting project in a class, or did bookkeeping for a family business. This helps in two ways: you’ll feel better about what you’ve done, and you’ll think of all the transferable skills you might have learnt! Accounts, time management, public speaking, computer skills, and organization are all important soft skills that you can highlight to potential employers. A resume writing service can help you make the most of your limited experience. 4. Be realistic If you’re changing careers, you can’t expect to jump straight into the same level you were at, and likewise, just starting out you won’t be landing any senior titles. Don’t treat any job as beneath you, you might be surprised, and even entry level positions can have lots of room for vertical or lateral advancement within a company. 5. But don’t be discouraged! Seeing a 10-point list of requirements can discourage new job seekers, but for many points, these are wish lists rather than firm requirements. Don’t be discouraged from applying if you are missing 2-3 points off the list! Writing a great cover letter, or using a professional cover letter writing service is the best way to stand out from the crowd and convince an employer you can learn the skills they need quickly. 6. Always keep learning Just because you lack experience now, doesn’t mean you will be this way for long! You should always be looking forways to improve yur resume or CV. Volunteering, personal projects, internships, and courses are all great ways to get new skills and add connections to your network. A positive attitude and a drive to learn are your most valuable assets, with and without experience. So, keep improving your resume! ",
            "date": "Answered October 30, 2019",
            "views": "2",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "George Stephen",
                    "user_href": "/profile/George-Stephen-18"
                },
                {
                    "user_id": "Emma Milner",
                    "user_href": "/profile/Emma-Milner-24"
                },
                {
                    "user_id": "Pooja Chavan",
                    "user_href": "/profile/Pooja-Chavan-223"
                },
                {
                    "user_id": "William Henry",
                    "user_href": "/profile/William-Henry-191"
                }
            ]
        },
        {
            "author_info": {
                "name": "Kavir Kaycee",
                "href": "/profile/Kavir-Kaycee"
            },
            "answer_text": "Thanks for the A2A, If you don’t have any hobbies (which is highly unlikely), then it is better not to mention any on your resume at the moment. Use this opportunity to cultivate meaningful hobbies that enrich your life (and not just your resume) There are three facets to hobbies that make it appealing to the employer: 1. Uniqueness If you add an interest that 90% of the population have for e.g. Watching TV, Listening to music – that’s not going to count for much. But if they include things like stamp collecting, horseback riding, etc then it becomes unique. 2. Difficulty Things are that more difficult to do, are more appreciated. For e.g. running marathons, playing musical instruments, etc. 3. Specifics Even if your interests coincides with something fairly common, you can add specifics to it to make it truly yours. For e.g. Instead of just mentioning that you like reading books, you can mention the genre e.g. magical realism, the authors that you like reading e.g. Isaac Asimov, etc to make it more specific. Hope this helps. Feel free to visit our website MakeMyResume for Professional Resume Writing Services or send us an email at hello@makemyresume.co.in for further assistance by our team of experts. ",
            "date": "Answered July 16, 2018",
            "views": "3",
            "upvotes": " Answer requested by Arsh Khan"
        }
    ]
}