{
    "title": "If I have a story idea, should I start writing immediately? - Quora",
    "tags": [
        "Creating Writing Advice",
        "Creative Writing",
        "Writing Advice",
        "Writing"
    ],
    "response": [
        {
            "author_info": {
                "name": "Sheri Fresonke Harper",
                "href": "/profile/Sheri-Fresonke-Harper"
            },
            "answer_text": "It depends on what your idea is about, what you want to do with it, what you are doing, and how you want to handle it. If it's just a phrase or image,      - Put it into a file      - put it in a special directory--I sort them by poetry, nonfiction, fiction, articles, and by chapbook, story collection, and by title of the piece. Often, if I'm working on something else, my ideas for a novel go into the outline for later use. If you're working, send email to yourself about it, or on break, put it in a file. Note: depending on your job rules, writing an idea down at work may make it the property of the company you work for; it's best to know your labor agreement well. If it's a novel idea, and you're not prepared to write it completely, you might write bits of it, but since I've been hacked so many times, I keep them in my head. If it's a short story, I'll wait for a week available. If it's a flash or poem idea, I write what I can, then edit it when I have time. Edits for me slow down everything and so sometimes I just have to do nothing but edit. ",
            "date": "Answered December 2, 2015",
            "views": "411",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Irwin Klien",
                    "user_href": "/profile/Irwin-Klien"
                },
                {
                    "user_id": "Psyria Leo",
                    "user_href": "/profile/Psyria-Leo"
                },
                {
                    "user_id": "Rui Padraig Phillips",
                    "user_href": "/profile/Rui-Padraig-Phillips"
                },
                {
                    "user_id": "Bennett W. Nelson",
                    "user_href": "/profile/Bennett-W-Nelson"
                }
            ]
        },
        {
            "author_info": {
                "name": "Jan Miller",
                "href": "/profile/Jan-Miller-16"
            },
            "answer_text": "If you are able to sit down and write when the muse hits you, by all means do it. Unfortunately, the muse is rascal and loves to show up at the damnest times. My own particular muse likes to ambush me while I'm cutting the grass, taking a shower or driving my car down the highway.  For that reason, one of the greatest investments a writer can make is a little pocket notebook; the kind you can pick-up at the dollar store. If you prefer hi-tech modes, use the voice note app on your smartphone. Get down as much of the inspiration as you can, whether it is a story line or just a great heading. Keep an ideas folder in the cloud via Evernote, OneNote, or Google Drive so you can access during your regularly scheduled writing time.  This approach works for stories, poetry, and even song lyrics. One such lyric idea popped into my head after an argument with my wife. I jotted it down and kept it in my physical folder. Three years later while trying to flesh out a new song, that argument idea turned out to work perfectly as the new song's refrain. So save every gift the muse brings you. ",
            "date": "Answered December 3, 2015",
            "views": "98",
            "upvotes": "0"
        }
    ]
}