{
    "title": "If my vehicle was towed from private property without the owner’s consent by the police department, who should I file a complaint with? - Quora",
    "tags": [
        "Private Property",
        "Towing",
        "Complaints",
        "Police Procedures",
        "Police and Law Enforcement",
        "Legal Issues and Law in Everyday Life"
    ],
    "response": [
        {
            "author_info": {
                "name": "Szandor Zoellner",
                "href": "/profile/Szandor-Zoellner"
            },
            "answer_text": "In most states, police can tow vehicles from private property for several reasons: The vehicle is deemed hazardous. If there is leaking fuel, oil, radiator fluid, etc, the city can deem it a safety hazard and can remove it from private property without permission or notice.If the vehicle is “abandoned” and deemed an eyesore or other public nuisance, it can be removed from private property without permission, but in these cases, written notice is usually required.If the vehicle is or is suspected to be part of a crime, a crime scene, involved in a crime, is evidence, etc, it can be towed by police from private property without permission or notice.If a vehicle is on someone else’s private property, and the vehicle is parked there without permission, that property owner has the right to tow it away or have it towed away without permission or notice to the vehicle owner.Police cannot tow the vehicle from private property to assist in any civil repossession process. Repos are not their job. They can stand by during a repo but should not otherwise participate. State laws, and even local laws, may vary. ",
            "date": "Answered October 21, 2020",
            "views": "70",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Rick Morrisey",
                    "user_href": "/profile/Rick-Morrisey"
                },
                {
                    "user_id": "Michael Lawson",
                    "user_href": "/profile/Michael-Lawson-28"
                },
                {
                    "user_id": "Phillip Kidd",
                    "user_href": "/profile/Phillip-Kidd-12"
                }
            ]
        },
        {
            "author_info": {
                "name": "Jennifer Ellis",
                "href": "/profile/Jennifer-Ellis"
            },
            "answer_text": "I don’t know. It really depends on why it was towed and what the local and state laws are on towing. Since the police towed it, I would guess if there is a complaint to be made, you would start with them. Most police have some sort of form you can fill out that is either a civilian review or a police review. They also normally have a form you can fill out for items damaged by the police in order to file a claim for funds for whatever your damage might be. This would, I imagine, include paying you back for an improper towing. Assuming you paid something to get your car back. Of course, you need to make sure that the towing was improper in the first place. And we cannot tell you whether it was. ",
            "date": "Answered October 22, 2020",
            "views": "219",
            "upvotes": " View 5 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Nick Sagliano Jr",
                    "user_href": "/profile/Nick-Sagliano-Jr"
                },
                {
                    "user_id": "Benedek Kovacs",
                    "user_href": "/profile/Benedek-Kovacs"
                },
                {
                    "user_id": "Ann Wells",
                    "user_href": "/profile/Ann-Wells"
                },
                {
                    "user_id": "Hildegunn Urdahl",
                    "user_href": "/profile/Hildegunn-Urdahl"
                },
                {
                    "user_id": "Melissa Hoy",
                    "user_href": "/profile/Melissa-Hoy-2"
                }
            ]
        }
    ]
}