{
    "title": "If you use the first person point of view in writing academic papers, is it still considered academic? - Quora",
    "tags": [
        "Academic Papers Writing",
        "Academic Writing",
        "Academia",
        "Academic Papers"
    ],
    "response": [
        {
            "author_info": {
                "name": "Will Jones",
                "href": "/profile/Will-Jones-246"
            },
            "answer_text": "Yes, although like with everything in academic writing, we’ll need to caveat with “it depends.” If you start reading science papers, you’ll notice many are actually written in first person plural, as in “we followed method X to generate the culture…” “We find that…” Across most disciplines, authors frequently intersperse first-person point of view to convey to the reader that the argument is, in fact, their own thinking rather than disembodied knowledge. On the other hand, you’d probably find it verging on impossible to write certain types of papers in entirely first-person point of view without beginning to sound like memoir, or some other sort of genre. As with most rules, this impression that one must avoid first person in academic writing probably begins in school with well-intentioned guidance to avoid the first person either to sound “more professional” or to discourage students from lapsing into unfounded opinion and generalities. And as with most things you discover later about writing, the reality is that stylistic choice comes down to accepted disciplinary convention and preference more than most anything else. ",
            "date": "Answered June 19, 2018",
            "views": "10",
            "upvotes": " View 6 Upvoters",
            "upvoters": [
                {
                    "user_id": "Iyyen Syed",
                    "user_href": "/profile/Iyyen-Syed"
                },
                {
                    "user_id": "Jamaica C. Bayarcal",
                    "user_href": "/profile/Jamaica-C-Bayarcal"
                },
                {
                    "user_id": "Amie Joy Sedeño",
                    "user_href": "/profile/Amie-Joy-Sedeño"
                },
                {
                    "user_id": "Hayati Saral Sala",
                    "user_href": "/profile/Hayati-Saral-Sala"
                },
                {
                    "user_id": "Grace Bueza",
                    "user_href": "/profile/Grace-Bueza"
                },
                {
                    "user_id": "James Lacey",
                    "user_href": "/profile/James-Lacey"
                }
            ]
        },
        {
            "author_info": {
                "name": "Ken Eckert",
                "href": "/profile/Ken-Eckert"
            },
            "answer_text": "If you used it constantly the writing would feel jarringly egotistical, but there’s nothing wrong with using first person occasionally in an academic paper. The danger is that it feels so good you might be tempted to continue writing about yourself and forget about the topic—or the pronoun information may become redundant. Ten sentences beginning with I believe that, I think that, I feel that is a waste of words—we know these are your thoughts and that your cat did not write the paper. My experience is that Europeans, especially the French, use first person a lot, and Americans rarely. I average once or twice a paper for emphasis (Canadians always compromise in the middle). That’s enough. ",
            "date": "Answered June 21, 2017",
            "views": "69",
            "upvotes": " View 11 Upvoters",
            "upvoters": [
                {
                    "user_id": "Larf Lariosa",
                    "user_href": "/profile/Larf-Lariosa"
                },
                {
                    "user_id": "Jeffrey Valeros",
                    "user_href": "/profile/Jeffrey-Valeros"
                },
                {
                    "user_id": "Jazmine Deveza",
                    "user_href": "/profile/Jazmine-Deveza"
                },
                {
                    "user_id": "Zeth Gutierrez",
                    "user_href": "/profile/Zeth-Gutierrez"
                },
                {
                    "user_id": "Edison Cabuena",
                    "user_href": "/profile/Edison-Cabuena"
                },
                {
                    "user_id": "Jonathan Orr-Stav",
                    "user_href": "/profile/Jonathan-Orr-Stav"
                },
                {
                    "user_id": "John Henry Villa",
                    "user_href": "/profile/John-Henry-Villa"
                },
                {
                    "user_id": "Marco-Luis Salcedo Tovar",
                    "user_href": "/profile/Marco-Luis-Salcedo-Tovar"
                },
                {
                    "user_id": "Jordan Forth",
                    "user_href": "/profile/Jordan-Forth-4"
                },
                {
                    "user_id": "Brett Williams",
                    "user_href": "/profile/Brett-Williams"
                }
            ]
        }
    ]
}