{
    "title": "If you write a book strictly speaking facts only from memory, without quoting anyone, do you have to include sources to avoid breaking copyright law? - Quora",
    "tags": [
        "Copyright",
        "Book Writing",
        "Intellectual Property Law",
        "Copyright Infringement",
        "Copyright Law",
        "Publishing",
        "Writing Advice",
        "Writing",
        "Legal Issues and Law in Everyday Life"
    ],
    "response": [
        {
            "author_info": {
                "name": "Travis Casey",
                "href": "/profile/Travis-Casey-4"
            },
            "answer_text": "No. Indeed, you never have to include sources to avoid breaking copyright law. Including sources is how you avoid committing plagiarism, which, while frequently confused with copyright infringement, is not the same thing. Plagiarism is claiming credit for the work of others, or allowing it to appear that you did work done by someone else, by not properly crediting the people who actually did the work. Copyright infringement is copying or creating derivative works based on copyrighted works without permission. For example, if you pay someone to write a paper for you and turn it in to a class you’re taking with your name on it, that’s plagiarism, because you’re taking credit for work someone else did. It is not, however, copyright infringement, because you have the permission of the person who actually wrote the paper. If I start selling electronic copies of one of Stephen King’s novels without permission, but keep his name on it as the author, that isn’t plagiarism, but it is copyright infringement. ",
            "date": "Answered October 15, 2020",
            "views": "61",
            "upvotes": " View 4 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Thomas P. Buehner",
                    "user_href": "/profile/Thomas-P-Buehner"
                },
                {
                    "user_id": "William D. Richards",
                    "user_href": "/profile/William-D-Richards"
                },
                {
                    "user_id": "Jeremy Menefee",
                    "user_href": "/profile/Jeremy-Menefee"
                },
                {
                    "user_id": "David Mullich",
                    "user_href": "/profile/David-Mullich"
                }
            ]
        },
        {
            "author_info": {
                "name": "Jonathan Elder",
                "href": "/profile/Jonathan-Elder"
            },
            "answer_text": "Including sources or not including sources is irrelevant to copyright. If you have the right to use the work you do not have to include sources unless your licence from them says you must include them. If you do not have the rights to use the content, giving the source will not get you out of a copyright claim. If you did actually write the whole thing yourself without copying anything, there can be no copyright claim. It’s highly unlikely your memory is good enough to accurately reproduce someone elses work in big enough chunks to attract any possible copyright claim against you. ",
            "date": "Answered October 15, 2020",
            "views": "52",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Dalton Simmerman",
                    "user_href": "/profile/Dalton-Simmerman-1"
                },
                {
                    "user_id": "David Mullich",
                    "user_href": "/profile/David-Mullich"
                },
                {
                    "user_id": "Dora Brudigam",
                    "user_href": "/profile/Dora-Brudigam"
                }
            ]
        }
    ]
}