{
    "title": "If you were to write a letter to your future self, what would it say? - Quora",
    "tags": [
        "Future Self"
    ],
    "response": [
        {
            "author_info": {
                "name": "Mais Sabbagh",
                "href": "/profile/Mais-Sabbagh-1"
            },
            "answer_text": "Dear Mais, Ew oldie. Hehe you have grey hair. HEHE. I really hope that made you cringe and not laugh. I hope you're less lame now. I hope you've fixed the iron deficiency! I mean it's been 30 years so I swear to God if you still haven't, just don't even finish reading this; I'm disappointed. But that's not why I'm writing this. I found out something today. Something I want you to remember for a very long, long, long time. If we live that long, that is. You're never gonna escape. Who you really are down there- who we are, deep below the surface. You're never gonna escape her. You're never gonna get away with being happy, because she's always gonna come back to bite you where it hurts most. The monster in your mind will not leave her home. We can't really evict her, it's sad. She pays the rent and like- I'll stop. But for real. She's never gonna go. Just learn to deal with the noise she makes and the nonsense she spews out.  But I want you to remember something. From time to time, you're going to get hurt. Sometimes even by those you love the most. And from time to time, you're gonna collapse and wish you weren't the egg in the ovary that was chosen to be fertilised. From time to time, you're gonna wish you're not you. You're gonna wish you're not, us. And although that never will stop happening, and although the amount of tears you're going to shed dwelling on the person that you are is overwhelming, I want you to remember something about her. She has her flaws. Can't even count them all. She's stupid, she's annoying, she's quite boring, she's a handful to deal with and she's loud and she talks too much and she's fairly clingy and yeah, she makes terrible decisions. But I want you to know that when she loves, she loves with every ounce of heart and is the most loyal bitch you've ever met. And just as she's loyal to those she loves, she's loyal to those who don't necessarily love her back. She's loyal to you. Mais, I don’t know who you're gonna be when you read this. But I know that no matter the mix of attributes that form you later in life, you are always going to be loyal. Because I am loyal. And I'll be there for you. I will always be there for you. Even if you do hate me. Even if you push me way and shove me to the ground. I will always be right there to catch you when you fall. Not because I love you. But because you might need me. And I won't be the one to let you down. I was never the type to do that.  I hope that when you read this you know more about us and why we're here. I hope you're fulfilling something. I hope you're still doing what we promised we'd do. You better be, bitch. I didn't stress us out for nothing grr. RaWr. In all seriousness though, I hope by then, you love me. But even if you don't, I'll still always be there with you. Because maybe, just maybe, I am the monster in your mind. Maybe this is all my fault. But I've never left a mess I caused not fixed.  I'll be there for you. Don't cry, ew. I was just saying. This is why I don't tell you nice things hmph. <3 ",
            "date": "Answered June 10, 2019",
            "views": "66",
            "upvotes": " View 44 Upvoters",
            "upvoters": [
                {
                    "user_id": "Emily Hulme",
                    "user_href": "/profile/Emily-Hulme-6"
                },
                {
                    "user_id": "Dinesh Ravichandran",
                    "user_href": "/profile/Dinesh-Ravichandran"
                },
                {
                    "user_id": "Heiwana Hanabi",
                    "user_href": "/profile/Heiwana-Hanabi"
                },
                {
                    "user_id": "Aditi Nagpure",
                    "user_href": "/profile/Aditi-Nagpure-1"
                },
                {
                    "user_id": "Michelle W",
                    "user_href": "/profile/Michelle-W-247"
                },
                {
                    "user_id": "Rochelle Dafoe",
                    "user_href": "/profile/Rochelle-Dafoe"
                },
                {
                    "user_id": "Ishan Choudhury",
                    "user_href": "/profile/Ishan-Choudhury-4"
                },
                {
                    "user_id": "Alexis Cedargren",
                    "user_href": "/profile/Alexis-Cedargren"
                },
                {
                    "user_id": "Ivan Yeh",
                    "user_href": "/profile/Ivan-Yeh-7"
                },
                {
                    "user_id": "Oswald Wong",
                    "user_href": "/profile/Oswald-Wong-3"
                }
            ]
        },
        {
            "author_info": {
                "name": "Simran Patel",
                "href": "/profile/Simran-Patel-96"
            },
            "answer_text": "First of all my dear future self, you are really really really stupid at heart. Just because of some people you have changed so much. That you will not be able to recognize this old self of yours. But please don’t forget about the people who have cared for you and loved you. Always stay humble even though the circumstances might not let you. Don’t argue with dumb people because the only thing that it can do is waste your time and raise your blood pressure. Listen to people who argue with you, without firing back. Because no matter how much you try to convince them they will still stay the arrogant people that they are. The small things in life do really matter. Try to make a lot of memories because you know that once you are done you will miss those moments. And then you will cry over the moments that you won’t get back. Stop regretting things because the only thing that you are good at is regretting, stop doing that. This is what I mean when I say that you are stupid. You think about things that are not even relevant anymore. Things that are out of your control, you spend hours and hours thinking about things like that and cry over useless things and people. Stop worrying about life so much because one day you will become an old lady and realize that you didn’t do anything fun in life and then regret again. And then raise your blood pressure even higher. You are already a little to mature for your age as others say but try to live your life like an innocent child. You are a mess Simran a total mess. And you will always be this mess that no one will understand not even yourself. But remember one thing, always love the people that you love, try to be better than yesterday, hold onto those small precious little memories, and stop crying over the smallest thing (oops that was more than just one thing). Enjoy life to the fullest Lots of love, Simran Patel ",
            "date": "Answered March 8, 2019",
            "views": "22",
            "upvotes": " View 7 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Marycris Salvan",
                    "user_href": "/profile/Marycris-Salvan"
                },
                {
                    "user_id": "Cheryl Walkerson",
                    "user_href": "/profile/Cheryl-Walkerson"
                },
                {
                    "user_id": "Anupam Kumar",
                    "user_href": "/profile/Anupam-Kumar-346"
                },
                {
                    "user_id": "Mudassir Ali",
                    "user_href": "/profile/Mudassir-Ali-60"
                },
                {
                    "user_id": "Vishal Kaul",
                    "user_href": "/profile/Vishal-Kaul-25"
                },
                {
                    "user_id": "Rajarshi Seth",
                    "user_href": "/profile/Rajarshi-Seth-1"
                },
                {
                    "user_id": "Khushboo",
                    "user_href": "/profile/Khushboo-172"
                }
            ]
        }
    ]
}