{
    "title": "If you had written the Harry Potter books, what would you have done differently to JK Rowling? - Quora",
    "tags": [
        "J.K. Rowling (author)",
        "Harry Potter (Wizarding World character)",
        "Characters of the Wizarding World",
        "Harry Potter (book series)",
        "Harry Potter (movie series)",
        "Harry Potter (creative franchise)",
        "Writers and Authors",
        "Writing",
        "Books"
    ],
    "response": [
        {
            "author_info": {
                "name": "Ilya Zhitomirskiy",
                "href": "/profile/Ilya-Zhitomirskiy-2"
            },
            "answer_text": "I would have changed Harry's home life. Either the Dursleys do something really bad to him once, and the authorities take Harry (and Dudley) away from them, or something happens where the Dursleys choose to give up Harry. What good guy can leave Harry in an abusive environment as Dumbledore did? Another change I would make would be to give Harry more friends earlier. For example, I could have Harry meet Luna in 2nd year when Harry was being ostracised over him being the “Heir of Slytherin”, have Neville show him support when Ron and Hermione are arguing in 3rd year, and have Ginny, as well as people Harry knows from other houses, stand up for Harry when he is “chosen” as the 4th champion of the Triwizard Tournament. Not all Slytherins are evil. We can see that with the Slytherin adults (Snape is a bastard, but he protects Harry on multiple occasions, Regulus betrays Voldemort once he realises how evil his “Master” is, Andromeda Tonks (Black) goes against her family's pureblood supremacist beliefs, and Horace Slughorn cultivates talented people and beings), but unfortunately Harry never encounters any nice Slytherins in his year or at Hogwarts. If there are a few good Slytherins who are not Malfoy cronies or Junior Death Eaters, then plot sequences such as the DA will be more effective. If the Ministry sees Umbridge mistreating purebloods, she will ride the rail out of Hogwarts faster than you can blink as soon as the Prophet hears about it. Finally, I may be a Harry/Hermione shipper, but I would not pre-determine the pairings of my main characters. I would have Harry and Ron be friends with multiple girls, figure out more about which female friends they like best, and then have events evolve naturally from a watershed event like Harry being chosen for the Tri-Wizard Tournament, or the Yule Ball. I would also have whatever relationship ends up happening grow over the course of multiple dates, so that critics can't say that my ships emerged out of nowhere. If Harry/Hermione does happen, it would have evolved organically from previous events, not because Author Says So. ",
            "date": "Answered September 7, 2020",
            "views": "91",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Tharun Kumar",
                    "user_href": "/profile/Tharun-Kumar-16"
                }
            ]
        },
        {
            "author_info": {
                "name": "Benjamin Johnson",
                "href": "/profile/Benjamin-Johnson-11"
            },
            "answer_text": "Harry/Hermione would be canon. I would spend more time exploring the political system of the wizarding world, as well as how wizarding culture has been affected by the Statute of Secrecy, a little more exploration of other countries besides Britain, and how an economy functions with magic. I would probably also have to at least slightly harden the magic system, just to make things a bit consistent. I would have made Albus Dumbledore a real character, i.e given him reasons for doing or not doing certain things. He would only be the headmaster, not anything else, and I would dial back all the hero worship. Yeah, sure, he defeated Grindelwald, but that was decades ago and he failed to defeat Voldemort, so his shine is wearing off. Voldemort would actually be as smart as he is supposed to be. Hogwarts would merely be the equivalent of Eton; there are less prestigious schools that only go up to OWL level that are basically trade schools. The wizarding population of Britain would be a minimum of 30,000. Dial back the Dursley's a bit so they aren't completely over the top. Instead of time travel, I would have Sirius get exonerated only for Wormtail to escape on the way to Azkaban. Harry would only have to spend two weeks each summer at the Dursley's and the rest of the summer with Sirius. Harry and Co. would eventually master silent casting and Harry would find someone else to teach him Occlumency. Pensieves are only as reliable as their source. Snape's Worst Memory would be before the Werewolf Incident, not after, and would better show that Snape basically had it coming. No Deathly Hallows or last minute wandlore retcons. ",
            "date": "Answered September 6, 2020",
            "views": "170",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Ilya Zhitomirskiy",
                    "user_href": "/profile/Ilya-Zhitomirskiy-2"
                },
                {
                    "user_id": "Erwin Krzyżyk",
                    "user_href": "/profile/Erwin-Krzyżyk"
                }
            ]
        }
    ]
}