{
    "title": "If you are against premarital sex, what are you reasons? - Quora",
    "tags": [
        "Premarital Sex",
        "Sexuality and Relationships",
        "Sex Advice",
        "Sexuality",
        "Adult Dating and Relationships",
        "Sex"
    ],
    "response": [
        {
            "author_info": {
                "name": "Dan Holliday",
                "href": "/profile/Dan-Holliday"
            },
            "answer_text": "Marriage as we know it was invented just sometime within the last few thousand years. Even the Roman or Chinese forms of matrimony wouldn’t be so alien from us today (though the “ownership” bits would be uncomfortable**). Still, it was an invention (more of an evolution of less formal bonding) that occurred within written history though its specific foundation may be lost in time. So are you asking me if I’m opposed to humans having sex outside marriage? Because humans having sex outside marriage is the status quo for now and all of human history. My dad and I have evolved to the point where we are basically two teenage boys talking about sex all day. It’s the best and he’s a hilarious dude … who lost his virginity at 13. I lost mine at 14. My grandfather —a passionate catholic— lost his to a hooker at 17 before he shipped out with the Marine Corps (what could possibly be more Marine than that). I’m sure he needed a penicillin injection too a week later. People have sex outside marriage. They always have. Being for it or against it is the stupidest, prudish, Quixotic nonsense I’ve ever seen. I do agree that parents should teach their kids WHOLLISTICALLY about sex. Teach the importance of holding off until you’re ready. Teach the importance of being ready when you’re ready. Teaching the full mechanics. And doing it over and over again on a weekly basis. But no matter what, me being for or against premarital sex is as stupid as being for or against gravity.  **A daughter in Rome’s first fealty was to her father, for life. A woman may be married to a man but the father’s acutoritas, having risen in his community, may be told by that father to divorce her husband and marry someone else to bind two families. ",
            "date": "Answered October 15, 2020",
            "views": "579",
            "upvotes": " View 37 Upvoters",
            "upvoters": [
                {
                    "user_id": "Lor Anders",
                    "user_href": "/profile/Lor-Anders"
                },
                {
                    "user_id": "Camilo Muller",
                    "user_href": "/profile/Camilo-Muller"
                },
                {
                    "user_id": "Nia Wohl",
                    "user_href": "/profile/Nia-Wohl"
                },
                {
                    "user_id": "Marieanne Blount",
                    "user_href": "/profile/Marieanne-Blount"
                },
                {
                    "user_id": "Yui Lee",
                    "user_href": "/profile/Yui-Lee-1"
                },
                {
                    "user_id": "Richard Enna",
                    "user_href": "/profile/Richard-Enna"
                },
                {
                    "user_id": "John McEwan",
                    "user_href": "/profile/John-McEwan-13"
                },
                {
                    "user_id": "Miguel Valdespino",
                    "user_href": "/profile/Miguel-Valdespino"
                },
                {
                    "user_id": "Mary Nelson",
                    "user_href": "/profile/Mary-Nelson-4"
                },
                {
                    "user_id": "Sylvia Gwen",
                    "user_href": "/profile/Sylvia-Gwen"
                }
            ]
        },
        {
            "author_info": {
                "name": "Rik Levesque",
                "href": "/profile/Rik-Levesque"
            },
            "answer_text": "The very fact that you ask this question with this wording reveals that you belong to a segment of the population that still views marriage as some sort of boundary line of significant importance. It isn't. Not biologically, scientifically, sociologically or in any other way other that religiously. I can’t think of a single instance of an atheist or agnostic seriously considering pre-marital. post marital or non-marital sex an issue of any importance. Sex is a biological reality, which for the sake of argument, your god included in his natural design of humans. All sexually reproducing animals have sex when their bodies tell them it’s time to couple. They’re “designed” that way. So why didn't god give humans a “sex-switch”? If religious imperatives dictate, as an expression of god’s will, that humans refrain from sex until after the wedding why did he not include a biological mechanism which would only induce us to feel desire once the “I do’s” have been pronounced? It’s always fascinating to me to consider the supposed dictates of deities that directly contradict that deity’s designs. Sex should be encouraged to be perceived as natural and normal, something to be practiced as desired between consenting adults if done responsibly and safely, and debating whether it should occur before, after or apart form arbitrary life events is no more rational than asking if we should encourage pre-marital driving, pre-marital horseback riding or the pre-marital wearing of non-virginal coloured clothing! ",
            "date": "Updated August 23, 2016",
            "views": "876",
            "upvotes": " View 7 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Al Crellel",
                    "user_href": "/profile/Al-Crellel"
                },
                {
                    "user_id": "John Bozzi",
                    "user_href": "/profile/John-Bozzi"
                },
                {
                    "user_id": "John Romero",
                    "user_href": "/profile/John-Romero-21"
                },
                {
                    "user_id": "Kaustav Ray",
                    "user_href": "/profile/Kaustav-Ray-10"
                },
                {
                    "user_id": "Gwen Sawchuk",
                    "user_href": "/profile/Gwen-Sawchuk"
                },
                {
                    "user_id": "Saurabh Vashisht",
                    "user_href": "/profile/Saurabh-Vashisht"
                },
                {
                    "user_id": "Miguel Valdespino",
                    "user_href": "/profile/Miguel-Valdespino"
                }
            ]
        }
    ]
}