{
    "title": "If you could be best friends with any fictional character, who would you choose? - Quora",
    "tags": [
        "Fictional Characters",
        "Hypothetical Scenarios"
    ],
    "response": [
        {
            "author_info": {
                "name": "Alex Jackson",
                "href": "/profile/Alex-Jackson-54"
            },
            "answer_text": "To protect me? Ra’s al Ghul.  Reasons: #1. Ra’s al Ghul is one of the greatest warriors on the planet, almost entirely unmatched in strategy and tactics (there’s always a bigger fish), etc. Even some of the greatest assassins like Deathstroke are given pause when his name is mentioned. And while the Joker may be Batman’s greatest nemesis, Ra’s is Batman’s greatest adversary. #2. He commands an army of warriors who will do what he says TO THE DEATH. If he so much as says “go get Alex an Oreo McFlurry from McDonalds and a triple baconator from Wendy’s”, they will go and do it even at the risk of their own lives. They will literally DIE following even the most mundane order if it becomes necessary. So of course those are the people I’d want protecting me. #3. A man like Ra’s al Ghul respects the desire to master oneself. So while I was under his protection, I would ask that he train me to fight and to think like him, so that one day I would not require protection and could be as free as possible in all situations. I would pour myself into the training, even facing death, because death would be facing me no matter what choice I made; death from whatever or whoever I was being protected from, a living death to be under constant guard and living in fear, or death from Ra’s al Ghul’s training methods. At least if I died in training, it would be on my own terms; fighting to be alive and free. And of course there would be a wealth of books to read, and without the pesky nuisance of the internet I would be free to really curl up in front of a fireplace and get lost in the pages (though not TOO lost, Ra’s would probably instruct his men to periodically attack me in order to train my awareness). I suppose I could have picked Batman to protect me, but he’s far too brooding and distant, and lacks the overwhelming forces to keep an individual safe from harm. ",
            "date": "Answered May 16, 2017",
            "views": "69",
            "upvotes": " View 35 Upvoters",
            "upvoters": [
                {
                    "user_id": "Helen Waltz",
                    "user_href": "/profile/Helen-Waltz"
                },
                {
                    "user_id": "Kyle Wilson",
                    "user_href": "/profile/Kyle-Wilson-36"
                },
                {
                    "user_id": "Sree Padmanabhan Vijayan (ശ്രീപദ്മനാഭൻ വിജയൻ)",
                    "user_href": "/profile/Sree-Padmanabhan-Vijayan-ശ്രീപദ്മനാഭൻ-വിജയൻ"
                },
                {
                    "user_id": "Mohammed Hakim",
                    "user_href": "/profile/Mohammed-Hakim-8"
                },
                {
                    "user_id": "George Verykoukis",
                    "user_href": "/profile/George-Verykoukis"
                },
                {
                    "user_id": "Manvi Chandel",
                    "user_href": "/profile/Manvi-Chandel"
                },
                {
                    "user_id": "Dakota Morgan",
                    "user_href": "/profile/Dakota-Morgan-10"
                },
                {
                    "user_id": "Kushal Agrawal",
                    "user_href": "/profile/Kushal-Agrawal-35"
                },
                {
                    "user_id": "Neeraja Sharma",
                    "user_href": "/profile/Neeraja-Sharma-1"
                },
                {
                    "user_id": "Mason Minden",
                    "user_href": "/profile/Mason-Minden-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Evan Poole",
                "href": "/profile/Evan-Poole"
            },
            "answer_text": "I have several I would like to be friends with… Part 1: John Wick AKA “Baba Yaga” AKA “The Boogeyman” (I know, shocking right lol!?).  Frank Castle AKA “The Punisher”.  Robert McCall AKA “The Equalizer”.  Dexter Morgan AKA “The Bay Harbor Butcher”.  The Expendables.  Need protection and/or need/want to wipe out a bunch of super scumbag criminals? Look no further. They’ll get the job done. Part 2: Goku.  I’d hang with this extremely famous and beloved goofball fighter, and main character of the entire Dragon Ball franchise anytime. Also, I would want to see who could eat the most and the fastest between me and him (yeah, I already know it’s going to be a severe loss on my part, but I’m going to give it a shot anyway lol!!!!). Bulma.  The other main character of the entire Dragon Ball franchise who teamed up with Goku, and kicked off the Dragon Ball adventure in the first place, and my anime crush, Bulma. I can learn all sorts of mathematic, scientific, engineering, and technological facts from her. Zeno.  Why not have the most powerful character in all of the Dragon Ball universes being your best friend? He can set up multi-universal martial arts tournaments. I’d just ask him nicely NOT to erase the fighters who lose, and their entire accompanying universes, completely out of existence. Part 3: Last, but not least, my very first fictional crush ever, Jessica Rabbit.  She’s extremely sexy, sassy, and smart. She can be my super best friend with benefits. For obvious reasons. ",
            "date": "Answered February 5, 2019",
            "views": "19",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Matt Cates",
                    "user_href": "/profile/M-Cates-3"
                },
                {
                    "user_id": "Helen Waltz",
                    "user_href": "/profile/Helen-Waltz"
                },
                {
                    "user_id": "Kong Thao",
                    "user_href": "/profile/Kong-Thao-11"
                },
                {
                    "user_id": "Darrell Blank",
                    "user_href": "/profile/Darrell-Blank"
                }
            ]
        }
    ]
}