{
    "title": "If you could bring any person back to life, who would it be and why? - Quora",
    "tags": [
        "Death and Dying",
        "Hypothetical Scenarios",
        "Life and Living",
        "Life Advice"
    ],
    "response": [
        {
            "author_info": {
                "name": "Krima Tanna",
                "href": "/profile/Krima-Tanna"
            },
            "answer_text": "There are many who I feel should come back for the betterment of nation mankind. I will be a little selfish and would love to bring back my childhood friend who left for her heavenly abode at a very young age. She was a care free, joyous soul who always made others smile and laugh. She was the ‘core’ of our group. She made the boring classes fun for us by her amazing sense of humor. She was the one who was truly an inspiration for all of us. She was my only friend from school who was in same city with me after we left school for our college but I never knew that journey would be so short. On 15th January 2010, she left us forever. She was a fighter but that day she couldn't fight anymore. Two days before this incident I got the message that she wasn't well and was admitted to hospital in our hometown. On 14th when I reached home, I decided to visit her but she got discharged the same day so, I postponed the visit and decided to meet her the next day. I never thought that I would meet her this way. She was always the happy go lucky kind of person. That was the first time I saw her so quite, pale and lifeless. I still have a guilt that even though we were in same city, I couldn't meet her when she needed me the most. I still remember the last message we received from her on 31st December 2009, stating that it was the last message from her. Silly us, we took it very casually and ignored it considering as it was her last message of 2009. May be she already knew what was coming. ‘3 Idiots’ was our last movie together during Christmas holidays in 2009 and the song “Jaane nahi denge tujhe” (We won't let you go) left us emotional and teary eyed. Now that song haunts me and brings back all the ifs and buts on how we could have been with her in her last days and may be encouraged her to fight a little more through our gestures. It has been 8 years but we are still coping up with the fact that she is no more. There are no get-togethers where we don't miss her. ",
            "date": "Updated January 18, 2018",
            "views": "53",
            "upvotes": " View 37 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Fredricka Louise Baker",
                    "user_href": "/profile/Fredricka-Louise-Baker"
                },
                {
                    "user_id": "Nove Lowry",
                    "user_href": "/profile/Nove-Lowry"
                },
                {
                    "user_id": "Darshan Chikka",
                    "user_href": "/profile/Darshan-Chikka-1"
                },
                {
                    "user_id": "Kartike Kampassi",
                    "user_href": "/profile/Kartike-Kampassi"
                },
                {
                    "user_id": "Sumitra Devi",
                    "user_href": "/profile/Sumitra-Devi-10"
                },
                {
                    "user_id": "Joyce Francis Decena",
                    "user_href": "/profile/Joyce-Francis-Decena"
                },
                {
                    "user_id": "Subasish Halder",
                    "user_href": "/profile/Subasish-Halder"
                },
                {
                    "user_id": "Manjunath Sangati",
                    "user_href": "/profile/Manjunath-Sangati"
                },
                {
                    "user_id": "Kaushal Mhatre",
                    "user_href": "/profile/Kaushal-Mhatre-1"
                },
                {
                    "user_id": "Anwesha Chakraborty",
                    "user_href": "/profile/Anwesha-Chakraborty-27"
                }
            ]
        },
        {
            "author_info": {
                "name": "Arsha Thapa",
                "href": "/profile/Arsha-Thapa-1"
            },
            "answer_text": "Thanks for the A2A Joshua Geenen I would bring my maternal grandma back. First of all, I loved her so much. And I couldn’t even tell her that I loved her. I did not know what it was like to lose someone. I wish I could have made her journey better. I wish I had spent more time with her. She was my favorite person in this entire world. She was forgetful, but one heck of a person. She scolded my mom even when she was 80+ years of age. She was open about how she loved me and my brother. Her blessings always included : be a great person. She loved kids and collected kids from around the neighborhood, brought them home, fed them and played with them. She looked after my dog so well. She loved animals. She would feed any dog or cow in the streets. There were times when she brought homeless people to our house to sleep for a day and the next day when they left, they would be so grateful. She never liked cooking, so she never cooked and she was honest. She liked cleaning. She did not care that she was above 80, she just cleaned like she was paid for it. She never encouraged hate. She never focused on all the bad they said about her. She visited them continuously even when they refused to look at her face. She always asked me to be kind, to be good to people. Later I came to know that she came from a really wealthy family, but she never bragged about it. But like I said, since she was forgetful, she had her times. Some days she’d end up sleeping in the streets and some days in the police station. The police officers told my mom that my grandma thanked them and complimented the service the whole time. Even when she was burned from her stomach to her toes (including her hands), she did not give up. Hospitals refused to take her in because she was over 80 years of age and they were sure she wouldn’t live. But guess what? Even then, she would get up and tell me that we should go home. Yes, just several days after the incident. She would just stand like nothing happened. She surprised the doctors by fighting it. She proved them wrong. Even in her last days, she did not give up. She was born vegetarian, but sadly did not die one. She silently cried when she found out my aunt had put the bone soup through the pipe in her mouth. She thought it was a deadly sin. She believed in God. She had faith and made sure I had faith as well. Her new skin came. We all were happy. I was shocked to see her will to live. We were sure she would live, but her death was inescapable. She died just like that. We later knew she had pneumonia. If not for the doctor’s fault, she would have been here with me today. The doctor did not do her tests properly. But guess she just knew. Her health was getting better, but she had stopped talking. She had been saying that she’d die soon for years. She left peacefully, just like that. She had a beautiful aura. The way she talked, she could melt just about anyone. But she was equally dangerous. My mom says she was scared of my grandma even when my grandma grew so old. The way she expressed her love for us, it makes me miss her so much. She had no hate for anyone. She would help anyone. She scolded everyone who was going on the wrong track. Even at 80, she stood straight. Even at 80, she did not have any disease get to her. Even at 80, she was healthier than me. Even at 80, she woke up sooner than everyone in the house. Even at 80, she pushed herself past her limits. Even at 80, she was still as kind to those who hated her existence. Even at 80, she cared for me more than anyone else. Even at 80, she believed in me. I wish she had more time. I wish I would have learned more from her. I guess, she was a lesson in my life. I did not know the importance of people until she left me. And if there’s an afterlife, I know she has the best one. When my mom decided to abort me, my grandma threatened my mom by saying that she’d leave the house and never see my mom’s face again. Perhaps, I can give some credit to her. When she left us, my mom did not cry. I asked my mom why she didn’t cry. My mom told me, “Who will look after everyone if I cry? She wanted me to be strong and look after everyone.” Perhaps, my mom wanted to send my grandma off knowing that everything was going to be fine. My mom put on a front, helped everyone else deal with it and remembered my grandma for the great person she was. I will become a great person, grandma. ",
            "date": "Answered July 8, 2018",
            "views": "21",
            "upvotes": " View 11 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Keenan Landry",
                    "user_href": "/profile/Keenan-Landry"
                },
                {
                    "user_id": "Tejasvi Chauhan",
                    "user_href": "/profile/Tejasvi-Chauhan-5"
                },
                {
                    "user_id": "Justin William",
                    "user_href": "/profile/Justin-William-3"
                },
                {
                    "user_id": "Dibyanjana Roy",
                    "user_href": "/profile/Dibyanjana-Roy"
                },
                {
                    "user_id": "Sanjay Tulachan",
                    "user_href": "/profile/Sanjay-Tulachan"
                },
                {
                    "user_id": "Prashant Shrestha",
                    "user_href": "/profile/Prashant-Shrestha-5"
                },
                {
                    "user_id": "Ramya Purvi",
                    "user_href": "/profile/Ramya-Purvi-1"
                },
                {
                    "user_id": "Sonakshi Khosla",
                    "user_href": "/profile/Sonakshi-Khosla-1"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/Ashley-1576"
                },
                {
                    "user_id": "Izzy Davila",
                    "user_href": "/profile/Izzy-Davila"
                }
            ]
        }
    ]
}