{
    "title": "In discuss both views and give your opinion essay type, should I write 5 paragraphs? - Quora",
    "tags": [
        "Writing Tips",
        "Essay Writing",
        "Paragraphs",
        "Essay Writing Help",
        "Essays",
        "Writing Advice"
    ],
    "response": [
        {
            "author_info": {
                "name": "Robin Turner",
                "href": "/profile/Robin-Turner-8"
            },
            "answer_text": "Write as many paragraphs as you need. The exact number will depend on how many ideas you have and how long your essay is going to be. A paragraph represents one idea, so in a short essay you might only have space for three ideas in the body, which, if you add an introduction and conclusion, will give you five paragraphs. But then you might have four different ideas, or two main sections, each of which has two subsidiary ideas, so you’d want six paragraphs in total. If the essay gets longer, you’ll definitely need to start planning in terms of sections and subsections rather than paragraphs. Nobody would ask how many paragraphs a dissertation or a journal article should have. Personally, I hate the idea of “essay types” and think any writing teacher who goes around telling students they have to have a certain number of paragraphs should really consider a new career. Why the 5-Paragraph Essay Should Die is my rant on this subject, in case anyone’s interested. ",
            "date": "Answered August 9, 2020",
            "views": "119",
            "upvotes": " Answer requested by Mohamed Mohsen"
        },
        {
            "author_info": {
                "name": "Matilda Prinsloo",
                "href": "/profile/Matilda-Prinsloo"
            },
            "answer_text": "In ‘discuss both views’ and ‘give your opinion’ essay type, should I write five paragraphs? I would say five paragraphs are the minimum for a short blog or short article. What you want to communicate in your essay will determine the number of paragraphs to use. Paragraphs gives structure to your writing. It helps the reader understand and grasp your intention easier. Enjoy writing! ",
            "date": "Answered August 9, 2020",
            "views": "16",
            "upvotes": " Answer requested by Mohamed Mohsen"
        }
    ]
}