{
    "title": "In Google Docs, how do you double space? - Quora",
    "tags": [
        "Google Docs",
        "Google Drive (product)",
        "Google Docs and Drive"
    ],
    "response": [
        {
            "author_info": {
                "name": "Vinod Kumar",
                "href": "/profile/Vinod-Kumar-2063"
            },
            "answer_text": " Navigate to the Google Docs URL in your web browser. If you have enabled cookies and have registered for a Google account, then you should automatically be logged in to Google Docs. Otherwise, click the Sign In link (in the top right hand corner) and enter your Google credentials.After login, a summary of your Google documents is shown.Either click a text document to edit from the list of Google docs (line spacing is only supported in the word processor version of Google Docs, for obvious reasons) or click Create New and choose document from the dropdown menu. Whichever option you select, the document editor is displayed, ready for you to start producing or editing existing content.Select the area of text you want to change to double-spaced. Normally, this would be the entire document, in which case, press CTRL and A. However, you can apply double-spacing to single paragraphs by left-clicking and dragging the pointer over the area to be selected. Click Format and choose Line Spacing, or click the double-ended arrow icon at the end of the toolbar. There are four options available here: 1.0 (for single line spacing, 1.15 (this is the default line spacing), 1.5, or 2.0 (the line spacing that is popular with students, also called Double Spacing).You can also choose to automatically Add space before paragraph and Add space after paragraph, to make your document look a little bit cleaner and easier on the eye.",
            "date": "Answered January 22, 2016",
            "views": "128",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Abhay Zambare",
                "href": "/profile/Abhay-Zambare"
            },
            "answer_text": "If you are writing an essay or a thesis or a research article and want tapply double space lines then follow the steps 1. First, Open the Google Doc 2. Then select all your text or you can just highlight the text or a paragraph that you want to double space. 3. Then Go to \"Format\" option in the Menu Option – Click on \"Line Spacing\". 4. Click on option \"Double\". Adding double space between the text lines allows your text to appear much clear and less crowded which makes text copy more readable. Most of the time double-spacing preferred however many also use 1.5 spacing. When the text is printed people can easily add comments in the extra spaces between the text lines and can easily give feedback. If you still have difficulty to understand watch this short video  ",
            "date": "Answered June 17, 2020",
            "views": "55",
            "upvotes": "0"
        }
    ]
}