{
    "title": "In Hinduism, is having premarital sex a sin? If yes, what are the punishments? - Quora",
    "tags": [
        "Premarital Sex",
        "Understanding Sin",
        "Sin",
        "Hinduism",
        "Sex"
    ],
    "response": [
        {
            "author_info": {
                "name": "Kartik Nemani",
                "href": "/profile/Kartik-Nemani"
            },
            "answer_text": "Before going into a detailed explanation about the question, I wish to clear a basic point which we, as a questioner(s) on Hinduism and its practices should understand. The religion called Hinduism (again a Misnomer-Thanks to the neo-Hindus) is basically outlined in two broad texts. Smritis and Srutis. In layman’s terms, Srutis were divine revelations passed on by the gods to the rishis and recorded in the form of Vedas. Smritis were social protocols which were proposed and implemented by reformers. These were flexible and were adapted according to the socio-cultural and economic setups. The smritis have evolved over time, written again and again and adjusted to mitigate with the current. The Manu-Smriti is a good example of smritis. Hinduism is an open book. Two persons reading it at the same time may end up with conclusions which are dimensionally opposite to each other. With such a large scope of diversity in interpretation, the religion left us with vivid and sometimes debatable answers to many questions. Pre-marital Sex is one of them. Desire or kama is never questioned in the scriptures. It is here, where the creation burgeons. Sex is not a Taboo in the dharma sutras as long as it is with a purpose of procreation and rebirth. On the contrary, sexual desire is considered as an important aspect of a grihastha. I tend to agree with adithya murali’s citation from the book “Dancing with Siva, Hinduism's Contemporary Catechism”. However, I question the examples that he cited to claim his theory. Shakuntala-Dushanta were tied under the Gandharva-Vivaaha tradition. it is considered as a legal tie of marriage in manu-smriti. Hence, their son Bharata, a kshatriya by birth was a legitimate prince. The question of adultaration never arises. Kunti-Surya/And all the 5 gods were tied under the Daiva-Vivaaha Tradition. Hence question never arises of kunti’s austerity. Shiva-Mohini was a cosmic progression which cannot be understood by mortal beings. The laws of brahmanda are never applicable. So, while being in-adept in stating whether premarital sex is a “SIN” or not, it is morally incorrect since the whole purpose of desire goes haywire in such cases. based on my very limited study of this vast ocean of knowledge, I can cite an example which can be debated upon: A maiden or virgin (Kanya) is married to a groom. The father performs Kanya-daana. The acceptance of wife by husband is called kanya-Grahanam. The fees paid by the groom to the father of the bride is called kanya-Shulkam. The virginity of the bride is not just a social or a moral imperative, it has a sacred, sublime and a spiritual reasoning associated with it. During a marriage, a bride is not offered just like that to the groom. The fore-fathers from the past 7 generations are invoked from the either side. In their presence, the bride is handed over to the Gods who inturn, hand her over to the groom after he promises to be karmically responsible for her well being till either one of them leaves for the astral plane. When such divinity is associated with just the tying of the mangala-sutra, the whole occasion of union of two beings is filled with a divine cosmic purpose that has to occur to fulfill a predestined event while the celestial is a witness to it. ",
            "date": "Updated December 8, 2017",
            "views": "599",
            "upvotes": " View 57 Upvoters",
            "upvoters": [
                {
                    "user_id": "Rupal Mishra",
                    "user_href": "/profile/Rupal-Mishra-25"
                },
                {
                    "user_id": "Tumpa Roy",
                    "user_href": "/profile/Tumpa-Roy"
                },
                {
                    "user_id": "Deveshi Sharma",
                    "user_href": "/profile/Deveshi-Sharma-2"
                },
                {
                    "user_id": "Komal Yadav",
                    "user_href": "/profile/Komal-Yadav-55"
                },
                {
                    "user_id": "Yami Rajan",
                    "user_href": "/profile/Yami-Rajan"
                },
                {
                    "user_id": "Jawwad Syed",
                    "user_href": "/profile/Jawwad-Syed-1"
                },
                {
                    "user_id": "Chirag Kothari",
                    "user_href": "/profile/Chirag-Kothari-102"
                },
                {
                    "user_id": "Dev Jai",
                    "user_href": "/profile/Dev-Jai-11"
                },
                {
                    "user_id": "Ganesh Srivastava",
                    "user_href": "/profile/Ganesh-Srivastava-6"
                },
                {
                    "user_id": "Nisha Dathak",
                    "user_href": "/profile/Nisha-Dathak"
                }
            ]
        },
        {
            "author_info": {
                "name": "Adi Suja",
                "href": "/profile/Adi-Suja"
            },
            "answer_text": "I am an adept in Hinduism and I have good friends who were born as hindus. I don't know a single verse in the hindu scriptures that say premarital sex is a sin. Emperor Bharata, Karna were born out of premarital sex so was Lord Ayyapan (Copulation of Lord Shiva and Lord Vishnu's female avatar Mohini). Having said that, it is the socio-cultural norm which is really respected, popular and considered in Hinduism. The other views kept in sidelines. Now my opinion: There is no such thing as sin in Hinduism, or in better words, 'sin' as described in other cultures is different from the 'sin' as described in Hinduism. We know very well that Hinduism is purely scientific long before others started accepting it. Now, what we mean by the term 'sin' is an act or doing that can bring about harm to the physical, mental or spiritual well-being of a person. I believe that pre-marital sex can cause some problems in the marital relations of the people who have it. To back my statement, here's an excerpt taken from the book Dancing with Siva, Hinduism's Contemporary Catechism by Satguru Sivaya Subramuniyaswami (1927-2001): \"\"When a virgin man and woman marry and share physical intimacy with each other, their union is very strong and their marriage stable. This is because their psychic nerve currents, or nadis, grow together and they form a one body and a one mind. Conversely, if the man or woman has had intercourse before the marriage, the emotional-psychic closeness of the marriage will suffer, and this in proportion to the extent of promiscuity. For a marriage to succeed, sexual intercourse must be preserved for husband and wife. Each should grow to understand the other's needs and take care to neither deny intercourse to the married partner nor make excessive demands. A healthy, unrepressed attitude should be kept regarding sexual matters. Boys and girls must be taught to value and protect their chastity as a sacred treasure, and to save the special gift of intimacy for their spouse. They should be taught the importance of loyalty in marriage and to avoid even the thought of adultery. The Vedas intone, \"Sweet be the glances we exchange, our faces showing true concord. Enshrine me in your heart and let one spirit dwell with us. \"Aum Namah Sivaya\" \". ",
            "date": "Updated October 14, 2014",
            "views": "102",
            "upvotes": " View 123 Upvoters",
            "upvoters": [
                {
                    "user_id": "Raviena Varmman",
                    "user_href": "/profile/Raviena-Varmman-1"
                },
                {
                    "user_id": "Pranav Ak",
                    "user_href": "/profile/Pranav-Ak-9"
                },
                {
                    "user_id": "Vinay Saroj",
                    "user_href": "/profile/Vinay-Saroj-1"
                },
                {
                    "user_id": "Bharat Poptani",
                    "user_href": "/profile/Bharat-Poptani"
                },
                {
                    "user_id": "Tumpa Roy",
                    "user_href": "/profile/Tumpa-Roy"
                },
                {
                    "user_id": "Eric Singh Sodhi",
                    "user_href": "/profile/Eric-Singh-Sodhi"
                },
                {
                    "user_id": "Game Studies",
                    "user_href": "/profile/Game-Studies-1"
                },
                {
                    "user_id": "Jawwad Syed",
                    "user_href": "/profile/Jawwad-Syed-1"
                },
                {
                    "user_id": "Chirag Kothari",
                    "user_href": "/profile/Chirag-Kothari-102"
                },
                {
                    "user_id": "Anand Kumar Sah",
                    "user_href": "/profile/Anand-Kumar-Sah-9"
                }
            ]
        }
    ]
}