{
    "title": "In The Scarlet Letter, why did Roger Chillingworth leave his inheritance to Pearl even though she is the daughter of Dimmesdale, whom Chillingworth supposedly despises? - Quora",
    "tags": [
        "Nathaniel Hawthorne",
        "The Scarlet Letter (1850 book)",
        "Literary Characters",
        "Literature of the United States of America",
        "Inheritance",
        "Novels",
        "Fictional Characters",
        "Literature",
        "Books"
    ],
    "response": [
        {
            "author_info": {
                "name": "Mari Bonomi",
                "href": "/profile/Mari-Bonomi"
            },
            "answer_text": "It’s been a couple of decades since I read Scarlet Letter… I used to give it to my student teachers to teach :) As I recall, however, Chillingworth essentially shrivels up and dies when Dimmesdale escapes his clutches by dying before he actually can confess— regardless of what he may or may not have displayed on his breast after the sermon— he calls himself a sinner but does *not* state the sin. What else is he to do with his filthy lucre, as it cannot buy him his revenge (Dimmesdale has “escaped me” he says!). If he does not leave it to Pearl, then the state can seize it— the government would get it all, as he has no other heirs. And legally, I think Pearl may be his heir since she was born in wedlock, even if not by him? I believe English common law of the time defined illegitmacy only as those children born out of wedlock. Perhaps it was simply Hawthorne tying up a loose end? :) ",
            "date": "Answered November 7, 2019",
            "views": "11",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Kimberly White",
                    "user_href": "/profile/Kimberly-White-222"
                }
            ]
        },
        {
            "author_info": {
                "name": "Avkrishna Rao",
                "href": "/profile/Avkrishna-Rao"
            },
            "answer_text": "Chillingworth is a doctor and finds out that Dimmesdale is father of Pearl. He acts in a strange way to show his contempt and jealousy. He try to persuade Dimesdale to convince his crime ad expose himself as the real father of Pearl and dies. Chillingworth’s only purpose of living appears to be punishing his rival. Being a doctor he forgets his moral duty of his profession and persuade Dimesdale to move towards death. He feels guilty after fulfilling his wish and to REDEEM himself of his sin of committing sin against the principles of a doctor and dies leaving his property to Pearl. ",
            "date": "Answered November 25, 2019",
            "views": "11",
            "upvotes": " Answer requested by Steven Shu"
        }
    ]
}