{
    "title": "Is 'writing a book' a good way to make money? - Quora",
    "tags": [
        "Book Writing",
        "Creative Writing",
        "Making Money Online",
        "Writing",
        "Wanting and Making Money",
        "Book Recommendations",
        "Books"
    ],
    "response": [
        {
            "author_info": {
                "name": "Yehia Abass",
                "href": "/profile/Yehia-Abass"
            },
            "answer_text": "read this experience : As a writer, I’m naturally curious about the publishing industry. Since we published that first book, I’ve talked with three other publishers and dozens of authors. I’ve learned a lot about publishing a book, including a few dirty little secrets. #1 Publishers Look for Audiences not Authors When publishers look for new authors, the number one thing they’re looking for is somebody with an audience. Publishers don’t dump a lot of money into marketing a book unless it’s already selling. Whether or not the book sells is dependent upon the author’s ability to sell it. If you want to get published but don’t have an audience, the best thing you can do is start blogging. It’ll build your audience and validate whether or not you’re a good writer. #2 Big Names Use Ghost Writers I used to struggle with the fact that most big-time authors don’t write their own books. It seems sleazy, but it’s not. Here’s why: People with big audiences don’t have a lot of time. One way to save time is to outsource the creation of your book. It’s not like Steve Jobs assembled iPhones, but that doesn’t take away from the fact that it was his product.Big-time authors aren’t necessarily good writers. They have influential ideas and can communicate those ideas as speakers, but they struggle to put those ideas in writing.Oftentimes, a ghost writer can write and communicate those ideas better than the author, which results in a higher-quality book. #3 Know How to Sell It Before You Write It Just like with any product, you need to know how to sell it before you create it. Thomas Edison: “I never perfected an invention that I did not think about in terms of the service it might give others… I find out what the world needs, then I proceed to invent.” Yet, most authors write about what they think is interesting and hope that other people find it interesting. Before you write a single word, figure out: Who you’re going to sell it to.Who the end user is (sometimes the buyer and reader are different).What price point you’re going to set it at.How you’re going to distribute it.What you’re going to do to promote it.The answers to these questions will help you write a book that people want to read. If it’s not marketable, it won’t sell. And if it doesn’t sell, what’s the point? #4 Amazon Best Seller Status is a Crock You ever notice how many people claim to be best-selling authors? Like, pretty much everyone who’s written a book, right? Doesn’t that seem fishy? You only need to sell about 300 books to become an Amazon Best-Seller. If all of those sales come on the same day, you’ll be bumped to the top of your sub-sub-sub-sub-category. In turn, your book is a best-seller for a few hours. Since people figured this out, they pre-sell their book on their site months before it’s launched. Then on launch day, they manually submit those orders to Amazon so it appears as though lots of people are buying it. Not all Amazon Best Sellers do this, but many of them do. When someone claims to be a best selling author, ask them how long they were at the top of the list. #5 Traditional Publishing is Dead A few weeks ago I pitched a book idea to Mark Victor Hansen, who has sold over 500 million books, and he replied with, “Publishing is dead.” For the first time in history, publishers need authors more than authors need publishers. That doesn’t mean publishers accept any dead-beat book off the street. It just means that if you’re a good writer, you have a better chance selling it yourself. Instead of taking 10% royalties from the traditional publishing route, self-publish your book through a service like CreateSpace and pay someone to put your book on Kindle and iBooks. #6 70% of Books Don’t Make a Profit According to Jenkins Group, a premier publishing firm, 70% of books don’t make a profit. When people joke about the cover designer making more than the author, it’s often the case. There are lots of upfront costs with creating a book. Some of ours where: Promotional copies. We printed and shipped 30, 100-page promotional copies to get blurbs.First running of print books. We bought 250 copies for our initial running.Shipping and materials. We fulfilled the first couple hundred orders ourselves. We didn’t get paid, however, until months later because the money had to run through the publisher.Traveling expenses. We were invited to Chicago to give a break-out session at the CEO National Conference and we paid our way.All told, we spent over $8 grand on our book. And, yes, we did make it into that 30%. #7 Nobody Gets Rich as an Author If a book sells 10,000 copies, it’s considered successful. The average royalty through a traditional publisher is 10%. So even if you sell 10,000 copies of $10 book, you’re only walking away with $10 grand. If it’s not profitable, why do so many people write books? Because being an author opens the door for other opportunities like speaking, training programs, and consulting. Plus, it makes your parents proud. Now is the Time If you’re an aspiring author, I want to encourage you to move forward with writing your book despite some of these stats. Working on that book with Nick was one of the most fulfilling projects I’ve ever been a part of. Start with a blog. Then write a book for your audience. Sell the book on your blog. If it’s good, you’ll find other ways to sell it. 7 Things I Learned from Publishing a Book - How To Make Money Online ",
            "date": "Answered February 23, 2017",
            "views": "69",
            "upvotes": " View 14 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Tshenolo Mokwena",
                    "user_href": "/profile/Tshenolo-Mokwena"
                },
                {
                    "user_id": "Huda Alzayed",
                    "user_href": "/profile/Huda-Alzayed"
                },
                {
                    "user_id": "Zahida Rizvi",
                    "user_href": "/profile/Zahida-Rizvi"
                },
                {
                    "user_id": "Hannibal Halicarsson",
                    "user_href": "/profile/Hannibal-Halicarsson"
                },
                {
                    "user_id": "Mariem Hajji",
                    "user_href": "/profile/Mariem-Hajji"
                },
                {
                    "user_id": "Taxi Hire",
                    "user_href": "/profile/Taxi-Hire-1"
                },
                {
                    "user_id": "Monica Topliceanu",
                    "user_href": "/profile/Monica-Topliceanu"
                },
                {
                    "user_id": "Taki Hasan",
                    "user_href": "/profile/Taki-Hasan-1"
                },
                {
                    "user_id": "Sameera Dhavala",
                    "user_href": "/profile/Sameera-Dhavala"
                },
                {
                    "user_id": "Dillon Brodzik",
                    "user_href": "/profile/Dillon-Brodzik"
                },
                {
                    "user_id": "Christina Pre",
                    "user_href": "/profile/Christina-Pre"
                },
                {
                    "user_id": "Sam Blogest",
                    "user_href": "/profile/Sam-Blogest"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/GARNI"
                },
                {
                    "user_id": "Veronika Ahapkina",
                    "user_href": "/profile/Veronika-Ahapkina"
                }
            ]
        },
        {
            "author_info": {
                "name": "Helmut Barz",
                "href": "/profile/Helmut-Barz"
            },
            "answer_text": "Good way to make money as in “make a living”? And writing just one book? Not, unless you hit the bestseller jackpot and even then you probably won’t get rich unless you write an ultra-bestseller and sell the film rights etc. All (but a very few, very lucky) writers I know who are able make a living writing, do so by a mix of different things: They write their books as well as articles or they write for other media, they work as journalists or have gone over to the dark side and work in advertising (like me), they do readings, they teach writing courses, they provide editing/proofreading or they rely on the kindness of not-so-strangers like their spouses for support. My story: I have written six book so far, five are published with a respectable amount of success in my market. And I am happy to report that just this month I finally reached the break even point, meaning I have made the money back I have invested in research, marketing etc. over the years. Still, my books are extremely valuable to me - as acquisition tools. I work as a freelance copywriter and whenever I meet a new customer I bring a copy of one of my novels along - as a gift, as a conversation piece and to show that I am creative and able to successfully finish even long-term projects. On top of that: Who doesn’t love a good mystery novel if it is free and signed by the author? This is to say: Writing a book may pay off in other and sometimes surprising ways than just in advances and royalties. If nothing else, it may give a you a very satisfying sense of accomplishment. And that’s worth something. ",
            "date": "Answered April 8, 2017",
            "views": "27",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Monica Topliceanu",
                    "user_href": "/profile/Monica-Topliceanu"
                }
            ]
        },
        {
            "author_info": {
                "name": "Michael Giobbe",
                "href": "/profile/Michael-Giobbe"
            },
            "answer_text": "This is a bit like asking, “Will buying stocks make me rich?” John Steinbeck spoke of writing books as “A line of work that makes horse-track betting look like steady income.” The range of possible answers to your question include “Yes, if you produce the RIGHT book,” “No, most books don’t sell worth a damn,” “There’s a whole new business model in self-publishing, audiobooks, and public speaking,” and “Yes—But the word you’re looking for is “BOOKS,” not “BOOK.” Learn to write. Learn what you are motivated to write, and what markets are out there for it. Learn to “Fail forward.” And learn to learn better and to write better. And to enjoy speaking in public. BTW, unless you ENJOY both learning for its own sake AND writing for its own sake, and perhaps also public speaking for its own sake, and are happy to pursue these things for maybe a decade or two, you’d really be better off just learning how to invest money. If you do enjoy these things, then in maybe another five, ten or twenty years you can retire financially independent. But again, if you enjoy these things, you may not want to. ",
            "date": "Answered March 25, 2020",
            "views": "664",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Shelby Burgess",
                    "user_href": "/profile/Shelby-Burgess-13"
                },
                {
                    "user_id": "Gary Chavez",
                    "user_href": "/profile/Gary-Chavez-14"
                }
            ]
        },
        {
            "author_info": {
                "name": "Will Edwards",
                "href": "/profile/Will-Edwards-23"
            },
            "answer_text": "Well, it certainly has been for me, but the reality is that for the many people who try to make money from their writing, the vast majority actually fail. This is not usually because of poor quality writing, but because of the other factors that contribute to success i.e. researching the market, packaging the offering and then marketing the book effectively. For those who are determined and committed, all of the necessary skills can be learned (see here for some useful tips). Unless you are extremely lucky, don’t expect to write a single book and start raking in the cash. In today’s climate, it takes a concerted effort, producing a series of books in a popular genre to gain traction. So - all in all - yes, it can be done by almost anyone, however, most people do not take the necessary time to hone their skills, or they cannot seem to summon up the necessary determination and persistence to make it a success. ",
            "date": "Answered August 10, 2020",
            "views": "227",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Marshall Glickman",
                "href": "/profile/Marshall-Glickman-1"
            },
            "answer_text": "With the exception of the rare bestseller, in general it is a terrible terrible way to make money (I’ve written two books, and been the publisher of hundreds—one still in print: Beyond the Breath: Extraordinary Mindfulness Through Whole-Body Vipassana Meditation: Marshall Glickman: 9781582900438: Amazon.com: Books). The only exception to that advice is if you have a service or product that you promote in some way with your book. So for example if you are a lawyer and want to build your reputation, writing a book about something you are an expert in can make sense as you may get a lucrative client/s from it. So in general, only write if you feel compelled to. ",
            "date": "Answered February 20, 2017",
            "views": "16",
            "upvotes": " View 5 Upvoters ",
            "upvoters": [
                {
                    "user_id": "JC Figueroa",
                    "user_href": "/profile/JC-Figueroa-1"
                },
                {
                    "user_id": "Barış Sönmez",
                    "user_href": "/profile/Barış-Sönmez-5"
                },
                {
                    "user_id": "Joseph Vasquez",
                    "user_href": "/profile/Joseph-Vasquez-4"
                },
                {
                    "user_id": "Austin Fernando",
                    "user_href": "/profile/Austin-Fernando-2"
                },
                {
                    "user_id": "Praveen Singhvi",
                    "user_href": "/profile/Praveen-Singhvi-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Dushka Zapata",
                "href": "/profile/Dushka-Zapata"
            },
            "answer_text": "Asking if writing a book is a good way to make money is like asking if you can get rich by buying a lottery ticket. It has definitely been done more than once, but the odds are not great and as such I recommend you write a book for reasons that are not financial. ",
            "date": "Answered April 8, 2017",
            "views": "66",
            "upvotes": " View 159 Upvoters",
            "upvoters": [
                {
                    "user_id": "Sheri Fresonke Harper",
                    "user_href": "/profile/Sheri-Fresonke-Harper"
                },
                {
                    "user_id": "Steve Batra",
                    "user_href": "/profile/Steve-Batra"
                },
                {
                    "user_id": "Healthm Zon",
                    "user_href": "/profile/Healthm-Zon"
                },
                {
                    "user_id": "RR TM",
                    "user_href": "/profile/RR-TM-1"
                },
                {
                    "user_id": "Padma Jose",
                    "user_href": "/profile/Padma-Jose"
                },
                {
                    "user_id": "Jimmy Yang",
                    "user_href": "/profile/Jimmy-Yang-56"
                },
                {
                    "user_id": "Atharva Nandanwar",
                    "user_href": "/profile/Atharva-Nandanwar"
                },
                {
                    "user_id": "Avery Massiah",
                    "user_href": "/profile/Avery-Massiah"
                },
                {
                    "user_id": "Manuel Fischer",
                    "user_href": "/profile/Manuel-Fischer-6"
                },
                {
                    "user_id": "Piotr Kucułyma",
                    "user_href": "/profile/Piotr-Kucułyma"
                },
                {
                    "user_id": "Liona Squires",
                    "user_href": "/profile/Liona-Squires"
                },
                {
                    "user_id": "Om Pandya",
                    "user_href": "/profile/Om-Pandya-3"
                },
                {
                    "user_id": "Resti Dwi Lestari II",
                    "user_href": "/profile/Resti-Dwi-Lestari-II"
                },
                {
                    "user_id": "Miftah Yassine",
                    "user_href": "/profile/Miftah-Yassine"
                },
                {
                    "user_id": "Sameer Choudhary",
                    "user_href": "/profile/Sameer-Choudhary-26"
                },
                {
                    "user_id": "Asher Reich",
                    "user_href": "/profile/Asher-Reich"
                },
                {
                    "user_id": "Jeya Shree",
                    "user_href": "/profile/Jeya-Shree-10"
                },
                {
                    "user_id": "Sai Srujan",
                    "user_href": "/profile/Sai-Srujan-7"
                },
                {
                    "user_id": "PetrosE",
                    "user_href": "/profile/PetrosE"
                },
                {
                    "user_id": "Sosonjr Ruben",
                    "user_href": "/profile/Sosonjr-Ruben"
                }
            ]
        },
        {
            "author_info": {
                "name": "Vishal A",
                "href": "/profile/Vishal-A-56"
            },
            "answer_text": "Writing a book is very difficult task. Because its not just enough to write a book, you also need to focus a other aspects like proofreading, editing, design a book cover, marketing a book so that it can gain more attention and eventually led to good sales. So what you can do is you can write a book as a full time writer or can write it in free times and when you finish writting it, you can get in touch with any of this publishing houses like BecomeShakespeare, pothi, authors solution and can get your book puished. They will charge you a amount for doing so but it will not be a huge amount and also considered that you will have returns for this investment, so you can consider writing a book and earn a good amount from it. ",
            "date": "Answered September 29, 2019",
            "views": "608",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Raja Pusapati",
                    "user_href": "/profile/Raja-Pusapati"
                }
            ]
        },
        {
            "author_info": {
                "name": "Natalie Lynch",
                "href": "/profile/Natalie-Lynch-40"
            },
            "answer_text": "I guess it could be if you're good enough and you work hard, but you shouldn't DO it for the money. You shouldn't spend every waking hour trying to come up with an entire story when you never have something to begin with. In the words of Sarah Beth Durst, \"Every book begins with a spark.\" If you never begin your writing career with a spark that forces every. Waking. Thought. To be your characters and whatever the heck they're up to, why begin? Of course, this mostly only pertains to fiction writers. ",
            "date": "Answered March 25, 2020",
            "views": "227",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Ray Beebe",
                "href": "/profile/Ray-Beebe"
            },
            "answer_text": "Yes, but the money flow is not great and certainly would not match the many hours of effort in the writing. My books are all essentially applied engineering. My first was based entirely on my experience and was chosen as the prescribed text for an off-campus postgraduate program subject. Little did I know that I would years later change careers to become an academic to update and teach that subject (I rolled the book content into the study materials). My later books are also based on experience but with added research (one was the greater part of my thesis). ",
            "date": "Answered October 20, 2018",
            "views": "892",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Sophie Coleman",
                    "user_href": "/profile/Sophie-Coleman-32"
                },
                {
                    "user_id": "Michael C. Fanning",
                    "user_href": "/profile/Michael-C-Fanning"
                },
                {
                    "user_id": "Barbara Robson",
                    "user_href": "/profile/Barbara-Robson-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Alarape Olusegun",
                "href": "/profile/Alarape-Olusegun"
            },
            "answer_text": "Yes.You can make money by writing books.There are millionaires and billionaires writers.Are you gifted in writing?Do you have what it takes to be a writer?Do you have a writer as your mentor?What do you have passion for? Nobody can. Complete writing a whole book because you will need the assistance of others.Eg.Proofreading.etc.The beginning may be hard but with passion you have for writing you will keep the ball rolling.Dont just write for writing sake but write what you are passionate for.For one to be a writer just take your pen and write. ",
            "date": "Answered February 20, 2020",
            "views": "258",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Morgan Smith",
                "href": "/profile/Morgan-Smith-907"
            },
            "answer_text": "Not at all. lol The common phrase for authors is “don’t quit your day job.” It also depends on your version of how much money. It costs a good bit of money to write a book with investments in writing books, writing classes/webinars, attending writers conferences, paying freelance editors, entering contest, etc. ",
            "date": "Answered September 9, 2019",
            "views": "248",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Barry McDonald",
                "href": "/profile/Barry-McDonald-3"
            },
            "answer_text": "If you sell enough, you could make a pretty penny. But your version of rich and mine might be two completely different levels. If you’re talking fiction, I’d write books in a series with a main character that readers will want to come back to again and again. If we’re talking non-fiction, I’d create courses, and coaching that I’d slot onto the book for even more income streams. You’ll make more money from that than you would from the sales of the book. ",
            "date": "Answered March 25, 2020",
            "views": "285",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Pylla Surya Prakash Reddy",
                    "user_href": "/profile/Pylla-Surya-Prakash-Reddy"
                }
            ]
        },
        {
            "author_info": {
                "name": "Javed Rezayee",
                "href": "/profile/Javed-Rezayee"
            },
            "answer_text": "Let’s start with no. After you have written a great book, and have done the following, let’s say maybe. Marketing with unceasing passionWriting another great book that will help sell your old bookDefine rich",
            "date": "Answered March 25, 2020",
            "views": "260",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Tanza Erlambang",
                    "user_href": "/profile/Tanza-Erlambang"
                }
            ]
        },
        {
            "author_info": {
                "name": "Christopher Lovegrove",
                "href": "/profile/Christopher-Lovegrove"
            },
            "answer_text": "Yes, just make up an outrageous conspiracy theory, include some supporting ‘evidence’ (anything that doesn't fit call fake news or a conspiracy by politicians/scientists/the media/the elite) and find a publisher willing to push it, then watch the money and the lecture tours stack up. Too cynical? ",
            "date": "Answered October 21, 2018",
            "views": "543",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Ivy Ives",
                    "user_href": "/profile/Ivy-Ives-1"
                },
                {
                    "user_id": "Raja Pusapati",
                    "user_href": "/profile/Raja-Pusapati"
                }
            ]
        },
        {
            "author_info": {
                "name": "Ben Oliveira",
                "href": "/profile/Ben-Oliveira"
            },
            "answer_text": "It depends on what you are writing about, your goals, language, public, marketing. Well, there are a lot of things you should consider thinking about it. ",
            "date": "Answered April 30, 2017",
            "views": "287",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Brian Hoffman",
                "href": "/profile/Brian-Hoffman-138"
            },
            "answer_text": "No. It is too difficult to write a good book. Even then the odds of getting traditionally publish is so small as to be almost nonexistent. Self published books will quickly disappear among all the others if you don’t vigorously promote it. If you want easy money, you are doomed to be disappointed. ",
            "date": "Answered June 23, 2020",
            "views": "166",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Jay Robert Baer",
                "href": "/profile/Jay-Robert-Baer"
            },
            "answer_text": "It can but that’s not usually the normal thing that happens when you write a book. Has to be a great book and it Hass to be so great the publisher gives you a fantastic deal. So here’s my advice educate yourself learn how to write and write the best book you can ",
            "date": "Answered March 25, 2020",
            "views": "139",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Sachin Kumbhar",
                "href": "/profile/सचिन-कुंभार-Sachin-Kumbhar"
            },
            "answer_text": "Writing a book is like Robbing a Bank. If you can pull it off gracefully, you’re rich But doing it once doesn’t mean you can do it again. One wrong step and you’re fucked! ",
            "date": "Answered April 14, 2017",
            "views": "565",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Mayukh Mukhopadhyay",
                    "user_href": "/profile/Mayukh-Mukhopadhyay-5"
                },
                {
                    "user_id": "Elbon Liyakiop",
                    "user_href": "/profile/Elbon-Liyakiop"
                },
                {
                    "user_id": "Ayush Bhandarkar",
                    "user_href": "/profile/Ayush-Bhandarkar-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Dennis S Espín",
                "href": "/profile/Dennis-S-Espín"
            },
            "answer_text": "Absolutely, now E-books are so popular, marketers use this to gain a market and show their expertise through the book. One of the most effective ways to do affiliate marketing and build your personal brand. ",
            "date": "Answered September 26, 2019",
            "views": "174",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "William D. Richards",
                "href": "/profile/William-D-Richards"
            },
            "answer_text": "Yes, just like having the winning lottery jackpot ticket. And the odds of writing a book that will make you rich are surprisingly similar to having the winning lottery jackpot ticket. ",
            "date": "Answered March 25, 2020",
            "views": "138",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Rahul Jain",
                "href": "/profile/Rahul-Jain-3432"
            },
            "answer_text": "Yes, You can but for that, you need to be a good writer. Once you complete your book choose an attractive and related(to book) cover and title. After all, this start with a small number of copies, for ex - 20. try to sell them on Amazon, Flipkart, and try facebook marketing to increase your sells. ",
            "date": "Answered October 21, 2018",
            "views": "348",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Carolyn Ann Aish",
                "href": "/profile/Carolyn-Ann-Aish"
            },
            "answer_text": "The only way to make a lot of money is to sell over a million copies of your book, even at $1 each for an ebook - wow, this would be great! Otherwise, become a best selling author with block-buster movies from your stories. ",
            "date": "Answered September 27, 2019",
            "views": "119",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Taiwo Abeeb",
                "href": "/profile/Taiwo-Abeeb-1"
            },
            "answer_text": "Yes, am a very good writer ",
            "date": "Answered October 20, 2018",
            "views": "98",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Karla Sterne",
                    "user_href": "/profile/Karla-Sterne"
                }
            ]
        },
        {
            "author_info": {
                "name": "Jamie Morrison",
                "href": "/profile/Jamie-Morrison-91"
            },
            "answer_text": "For those who want to make money online by selling ebook, Kindle Publishing is best place to start. If you want to try this method but you don't know where to start, you should check this information:  ",
            "date": "Answered November 14, 2019",
            "views": "230",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Srinivasan Sundar",
                "href": "/profile/Srinivasan-Sundar-4"
            },
            "answer_text": "WRITE A CHEQUE BOOK. ",
            "date": "Answered December 2, 2018",
            "views": "65",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "P Yesu Thasen",
                    "user_href": "/profile/P-Yesu-Thasen"
                }
            ]
        },
        {
            "author_info": {
                "name": "John Fyucha",
                "href": "/profile/John-Fyucha"
            },
            "answer_text": "Yeah you can write a book and make money from it. All you need is a mind blowing idea and with the help of modern day selling avenues such as Amazon you can make some good cash. You will also need patience because it won't happen overnight ",
            "date": "Answered October 22, 2018",
            "views": "221",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Christian Dymally",
                "href": "/profile/Christian-Dymally"
            },
            "answer_text": "It’s possible but not probable. Writing characters and stories people love can earn you lifelong readers, which can provide a steady source of income. ",
            "date": "Answered March 25, 2020",
            "views": "71",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Vandana Singh",
                "href": "/profile/Vandana-Singh-985"
            },
            "answer_text": "You can. But you need to find good publisher to publish your book. And you need to work a lot in the background to get the things done ",
            "date": "Answered October 22, 2018",
            "views": "47",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Masud Karim",
                "href": "/profile/Masud-Karim-23"
            },
            "answer_text": "yes ,you can earn money writing a book ",
            "date": "Answered April 13, 2017",
            "views": "151",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Neal Oliver",
                "href": "/profile/Neal-Oliver-3"
            },
            "answer_text": "yea if it will become a bestseller ",
            "date": "Answered February 20, 2017",
            "views": "87",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Max Fiestfiest",
                "href": "/profile/Max-Fiestfiest"
            },
            "answer_text": "Yes ",
            "date": "Answered October 21, 2018",
            "views": "37",
            "upvotes": "0"
        }
    ]
}