{
    "title": "Is 'importanter' a correct word? - Quora",
    "tags": [],
    "response": [
        {
            "author_info": {
                "name": "Samuel Muldoon",
                "href": "/profile/Samuel-Muldoon-3"
            },
            "answer_text": "NO, “importanter” is wrong. In English, half the time you write “more.” For example people write “more important,” not “importanter” The other half of the time, English writers write “er” at the end of the word. Which words follow which rule is arbitrary and is probably only learnable by wrote-memorization. —————————————————————————————————- new --> newer (NOT \"more new\") CORRECT EXAMPLE “Joe has two cars. The Camero is newER than the Nissan.” WRONG EXAMPLE “Joe has two cars. The Camero is more new than the Nissan.”  high --> higher (NOT \"more high\")  old --> \"older\" (NOT \"more old\"). RIGHT: “Your uncle Aditya's is 15 years older than me. I am worried about his health.\" WRONG: “Your uncle Aditya's is 15 years more old than me. I m worried about his health.\"  great -- greater (NOT “more great”)  big --> bigger (NOT \"more big\") WRONG: \"Joe is more big than Fred.\" RIGHT: \"Joe is bigger than Fred.\"  small -- smaller large --> larger young --> younger  long --> longer (NOT \"more long\") little --> littler lower earlier  real --> \"more real\" (NOT \"realer\") e.g. \"The special effects in movies these days seem more real than they did 40 years ago.\"  social \"more social\" (NOT \"socialer\") e.g. \"Pihu is more social than her brother Sai\"  economic --> \"more economic.\" (\"economicer\" is NOT a word) e.g. \"cooking at home is more economic than eating out at restraunts\"  possible --> \"more possible\" (\"possibler\" is NOT a word) e.g. \"it is far more possible to get into college if you apply to many schools, instead of just one.\"  Militant --> \"more militant\" (\"militanter\" is NOT a word). e.g. \"The United States is more militant in nature than Canada\"  Traditional --> \"more traditional\" (\"traditionaler\" is NOT a word) e.g. \"a main-course far more traditional for Thanksgiving than steak, is roast turkey\" ",
            "date": "Updated December 20, 2019",
            "views": "18",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Edward Sherry",
                    "user_href": "/profile/Edward-Sherry"
                }
            ]
        },
        {
            "author_info": {
                "name": "Veronica Curlette",
                "href": "/profile/Veronica-Curlette"
            },
            "answer_text": "No, it isn’t. Even though, in English, you can usually ‘invent’ any word you want to , you have to follow the rules. You probably want to create a comparative adjective, so you need to follow the rules for adding suffixes to a word. Your word is ‘important’ is an adjective. To make a comparative adjective you can add the suffix ‘-er’. However you can only add this suffix to words that have one or two syllables. tall - tall+er = taller happy - happy + er = happier (There is an extra rule here that says change the ‘y’ into an ‘i’ before adding -er.) For words that are more than 2 syllable you don’t add a suffix. Instead you put the word ‘more’ before the adjective. important - more + important = more important Compare these examples: George is taller than Marcus. Marcus is happier than George. Food is more important than shelter. If you want to make the comparison in the opposite way, you can use the word ’less’… Shelter is less important than food. and the phrase ‘not as + adj. + as’ … George is not as happy as Marcus. On a side note you might want these other rules for making comparative adjectives: If the adjective’s last three letters follow the pattern c-v-c (that is consonant-vowel-consonant), you should double the final consonant. ex.: big c-v-c = bigger thin cvc = thinner This is only a spelling convention and does not affect the pronunciation. Here are the only irregular adjectives, (only 3!)- good-better/ bad-worse/far-farther or further I hope that was your question ;-) ",
            "date": "Updated April 26, 2019",
            "views": "187",
            "upvotes": " View 16 Upvoters",
            "upvoters": [
                {
                    "user_id": "Warren Wingrove",
                    "user_href": "/profile/Warren-Wingrove"
                },
                {
                    "user_id": "Christine Foo",
                    "user_href": "/profile/Christine-Foo-10"
                },
                {
                    "user_id": "Siddharth Koti",
                    "user_href": "/profile/Siddharth-Koti"
                },
                {
                    "user_id": "Cecilia Andersson",
                    "user_href": "/profile/Cecilia-Andersson-11"
                },
                {
                    "user_id": "Vardhini Muthu",
                    "user_href": "/profile/Vardhini-Muthu"
                },
                {
                    "user_id": "Kendell Bobo",
                    "user_href": "/profile/Kendell-Bobo"
                },
                {
                    "user_id": "Igor Vidic",
                    "user_href": "/profile/Igor-Vidic-3"
                },
                {
                    "user_id": "Kiran R",
                    "user_href": "/profile/Kiran-R-11"
                },
                {
                    "user_id": "Gale Bel",
                    "user_href": "/profile/Gale-Bel"
                },
                {
                    "user_id": "George Themistocleous",
                    "user_href": "/profile/George-Themistocleous-2"
                }
            ]
        }
    ]
}