{
    "title": "Is 'the suspension of disbelief' essential to knowledge? - Quora",
    "tags": [
        "Suspension of Disbelief"
    ],
    "response": [
        {
            "author_info": {
                "name": "Eric Lund",
                "href": "/profile/Eric-Lund-15"
            },
            "answer_text": "The phrase “suspension of disbelief” is intended for use in books, plays, movies etc. where a person will enjoy the experience more if they suspend the fact that they know the story to be fiction and temporarily believe it to be true. The fact that this suspension is temporary is very important. We don’t have to spend our whole lives believing that Black Beauty, Oliver Twist, Huckleberry Finn et al really did exist, we just have to believe it temporarily, whilst we are reading the story. It’s important that we know it’s not real, but that we ‘suspend’ that knowledge for a short period of time. This is why people cry when Bambi’s mother dies in the film. We do know that she’s not real in life, but for a temporary period we have suspended our disbelief and we’re accepting that she is real in the story. For this reason, I’m going to suggest that suspension of disbelief, though not essential to knowledge (by which I’m assuming you mean “gaining knowledge” - knowledge itself doesn’t need belief - it’s a concept) is a useful tool. Here’s why. You’ve probably heard of ‘confirmation bias’, meaning that if you already believe something and someone says that they’ve done some research that ‘proves’ this as true, you’re more likely to accept the research without looking at it very closely, because it agrees with what you already think. If the same research ‘proved’ it not to be true, you’d be more likely to look at the claims closer and try to pick holes in them. You may also have heard people talking about the way social media works in confirming your biases: if social media thinks you like trains then it will give you more links about trains that it thinks you might be interested in; if social media thinks you’re a single, heterosexual man then it will give you links to sites where you can meet or maybe look at pictures of attractive women and you have to spend hours blocking these sites; if social media thinks you have a left-wing politic then it will give you lots of links about left-wing ‘news’ and no links to right-wing sites. It’s this last one that is the problem. In order to confirm that you are on the right lines with your views on the world it’s essential that you don’t just think “I agree with these left-wing sites” but also that you think “… and I disagree with these right-wing sites” [or vice versa]. You need to see the counter-argument to be sure there is nothing that makes you look at the situation differently. Social media is charged with suppressing the middle ground. Writing this large, I feel that it’s the same with ‘knowledge’. As an example, someone tells you that climate change is man-made. Do you just say “yes, you’ve presented a good case there and I agree with you: climate change is man made” or do you say “You’ve made a good case, but before I make a decision I need to hear the other side of the argument”? Personally I always do the latter. I am minded by my existing view of the world to agree that climate change is man-made but I worry about confirmation bias. Just because it would fit with my existing beliefs doesn’t necessarily make it true. So I suspend my existing beliefs and listen to the other side of the argument. Having heard both sides and weighed them evenly on an empirical scale, I then make a decision as to which side is right. This is the way Debating Societies have worked for centuries: one (or two) person(s) puts a case, and another one (or two) puts the counter argument. People in the room listen to both sides evenly - suspending their existing beliefs - and then vote on which side put the best case. I disbelieve the argument that climate change is not man-made. I suspend that disbelief and listen to both sides. I weigh the two sides against each other and decide that on this occasion I agree with my first assessment. The difference is that now I also know that I disagree with the other side of the argument and that makes my opinion much more substantial and I feel a lot happier with it. Had I weighed the two arguments together and changed my mind, then I would never have done that without suspending my disbelief of their argument. Had I heard both sides and been unable to decide then I would have known that I needed to do more research. Whichever way it goes, I am better off for the suspension of my disbelief. Conclusion: the phrase was not meant for this situation, but it can certainly be used to describe one of the best ways of adding to the sum of human knowledge. So the answer is “yes”. ",
            "date": "Answered December 27, 2017",
            "views": "17",
            "upvotes": " View 5 Upvoters ",
            "upvoters": [
                {
                    "user_id": "C.S. Friedman",
                    "user_href": "/profile/C-S-Friedman"
                },
                {
                    "user_id": "Allan Croll",
                    "user_href": "/profile/Allan-Croll"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/Ashbrak"
                },
                {
                    "user_id": "Maria Malyan",
                    "user_href": "/profile/Maria-Malyan"
                },
                {
                    "user_id": "Emily Downey",
                    "user_href": "/profile/Emily-Downey-11"
                }
            ]
        },
        {
            "author_info": {
                "name": "Min Khin Kyaw",
                "href": "/profile/Min-Khin-Kyaw"
            },
            "answer_text": "Knowledge is the information you can recall when in need that you have learned or absorbed it earlier. Knowledge is knowledge if you can use it or apply it when you need it. Belief and disbelief are about critical thinking with which you try to filter out bad information, useless information so that you rather have good knowledge, and useful knowledge. Nonetheless, one may know all and also know which is right and which is wrong. Conscience is knowing what’s right as right and what’s wrong as wrong. This is also wisdom. Merely having knowledge is incomplete to be a good intellectual because it only makes one to be a bookish, not in a negative way though. Belief and disbelief are not essential or not in existence in one’s mind if one knows the truths. One doesn’t have to believe the truths as the truths. Belief factor is not a part of one’s knowledge. For example, one knows the sun rises in the east. One doesn’t have to believe it. Belief is not a part of this knowledge. One just knows, one doesn’t believe or disbelieve. Everyone knows fire is hot. If someone comes and say, touch this fire, it’s very cold. Then it becomes a factor of belief or disbelief . Nobody is silly enough to believe certain fire is cold while it is burning on something. The knowledge is fire is hot. Knowing the truth means one has commonsense. ",
            "date": "Answered September 8, 2017",
            "views": "2",
            "upvotes": " Answer requested by Jordi Putra Widjaja",
            "upvoters": [
                {
                    "user_id": "Daniel Lipko",
                    "user_href": "/profile/Daniel-Lipko-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Jason Denton",
                "href": "/profile/Jason-Denton-2"
            },
            "answer_text": "No, suspension of disbelief is for fake knowledge that you temporarily need to accept, like the plot of a film expecting you to believe that this specific set of circumstances happened to this particular person and they had the exact backstory and skills to handle it. Suspension of disbelief would cause you to believe things that were nonsense, as long as you weren't given information that was too ridiculous. You might be thinking of suspension of belief, or scepticism. A healthy scepticism is not essential to knowledge; you could be the most gullible person in the world and you'd gain at least some knowledge that was accurate. However, it's definitely helpful to maintain a healthy scepticism to make sure that you properly vet information that comes your way and don't get fooled by faulty logic or lies. Thanks for the A2A! ",
            "date": "Answered September 16, 2017",
            "views": "29",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Xiaoyue Li",
                    "user_href": "/profile/Xiaoyue-Li-9"
                },
                {
                    "user_id": "Jared Busby",
                    "user_href": "/profile/Jared-Busby-1"
                },
                {
                    "user_id": "James Rosten",
                    "user_href": "/profile/James-Rosten"
                }
            ]
        },
        {
            "author_info": {
                "name": "Dennis Winn Elenburg",
                "href": "/profile/Dennis-Winn-Elenburg"
            },
            "answer_text": "Thanks for the A2A, Jordi. A balance between belief and skepticism is required for obtaining knowledge. You cannot completely avoid your own biases. You can try, but it is hard. On one side, if you hold to your current beliefs too tightly or (on the other side) become completely skeptical to the point you’re not open minded about new ideas, you fall in the bar ditch on both sides of the path to true knowledge. Back in 2005, I discovered that most disagreements are not honest. I blogged about that here: Are Disagreements Honest? I think what is more important than belief or disbelief is radical honesty. If you can find someone who disagrees with you and move through that disagreement honestly, you’re pretty much assured that you’ll learn something and increase the knowledge of both people. ",
            "date": "Updated November 20, 2017",
            "views": "64",
            "upvotes": " View 3 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Perry Pennington",
                    "user_href": "/profile/Perry-Pennington"
                },
                {
                    "user_id": "Bob Colwell",
                    "user_href": "/profile/Bob-Colwell"
                }
            ]
        },
        {
            "author_info": {
                "name": "Michel Paul",
                "href": "/profile/Michel-Paul-1"
            },
            "answer_text": "The phrase suspension of disbelief was coined by Coleridge regarding the experience of drama or works of fiction. He called it ‘poetic faith’. As for knowledge, it is often the suspension of belief that is more important. The natural tendency is to look for verification of our beliefs and to either dismiss or explain away falsification, which often happens in religion and politics, but the intellectual courage to look for evidence that our beliefs might be false is what allows science to happen. ",
            "date": "Answered September 7, 2017",
            "views": "23",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Yaren Yeniay",
                    "user_href": "/profile/Yaren-Yeniay"
                },
                {
                    "user_id": "Joe Velikovsky",
                    "user_href": "/profile/Joe-Velikovsky"
                }
            ]
        },
        {
            "author_info": {
                "name": "Christophe Cop",
                "href": "/profile/Christophe-Cop"
            },
            "answer_text": "No. It’s something you do when you get into a story, movie or book. you go along, and are not skeptical about all the things that could not happen in real life. for knowledge, you need disbelief. ",
            "date": "Answered September 8, 2017",
            "views": "2",
            "upvotes": " View 2 Upvoters "
        },
        {
            "author_info": {
                "name": "Chineze Ndukwe",
                "href": "/profile/Chineze-Ndukwe"
            },
            "answer_text": "Suspension of disbelief Suspension of disbelief - Wikipedia ",
            "date": "Answered October 17, 2017",
            "views": "211",
            "upvotes": "0"
        }
    ]
}