{
    "title": "Is a mental health struggle an okay topic to write about for a college application essay? - Quora",
    "tags": [
        "College Application Essays",
        "Essay Writing Help",
        "Essays",
        "Writing Advice",
        "Writing"
    ],
    "response": [
        {
            "author_info": {
                "name": "Irina Kitova",
                "href": "/profile/Irina-Kitova-1"
            },
            "answer_text": "My advice would be not to write about it in your Common App main essay. I know it’s not a “politically correct” advice, but this is the reality of competitive college admissions - anything negative will be used against you. Maybe your application will be read by an understanding person who might even have had a similar personal or family experience - that could be one outcome. Or it could be read by somebody who cares more about the college bottom line than about giving you a chance for fair and unbiased evaluation. You never know, and colleges don’t have to explain their reasons if they reject you. If your depression negatively affected your grades and you need to explain a bad semester/year, write about it it the place at the end of the application that is usually reserved for some special circumstances. Admissions officers don’t want any drama, but they want to know what happened to your grades, and they want to be reassured that you have it under control and it won’t hold you back at college. (And if you don’t have it under control, then you have to make your health and general well-being your #1 priority and first to make sure your are ready for college. The college application process brings a lot of pressure, and starting college is always stressful and challenging, even for the most relaxed and easy-going students, so you need to be mentally and physically prepared to handle this stress.) I wrote Irina Kitova's answer to If I struggled with depression in high school, will I be able to let colleges know that it impacted my grades significantly when I apply? Please read all the answers to this question and think about what would be the best way for you to address this matter in your college application. Also, some other relevant threads: How personal should my college essay be? Is writing about my struggle with social anxiety disorder and about how I overcame it a good topic for my college application letter? If a strong student misses a whole semester of school because she began experiencing acute anxiety/depression, but then she returns and pulls herself back up, where and how is the best place to explain this on the college application? ",
            "date": "Updated September 27, 2016",
            "views": "27",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Sravya M",
                    "user_href": "/profile/Sravya-M-3"
                }
            ]
        },
        {
            "author_info": {
                "name": "Lessa Scherrer",
                "href": "/profile/Lessa-Scherrer"
            },
            "answer_text": "Thanks for the A2A, Olivia! Mental health is a huge part of life, and something that campus personnel should know about, but the essay is not necessarily the best place to disclose it. It can be done, but unless your story is how you overcame your depression, it’s going to send up red flags for admissions officers. Speaking frankly, suicide is an issue on college campuses. Late teens and early twenties is prime time for major mental health issue to appear, even in students with no prior history of mental illness. Students often feel like how they do in college is going to determine how the rest of their lives should go. If they hit a rough patch, they may lose hope. Couple that with the pressure to perform at highly-selective schools and many students choose to drop out permanently. We had about one suicide per year when I was at Northwestern, and those were only the ones I knew about personally—colleges are very careful to keep that information quiet both to protect their reputations and to prevent a spate of copycats. So knowingly bringing to the campus community a student who has already had mental health issues and may be at particular risk is something most admissions offices will avoid. I urge you to think about some other topic for your essay. As a fellow sufferer who first developed depression my junior year in college, I also urge you to consider taking a gap year to get your life under control and to make sure you’re healthy enough to leave your support system and create a new one. And I urge you, as your looking for and evaluating colleges, to look into their mental health supports: how easy is it to get your prescriptions filled (if any)? How long do you usually have to wait to be get an appointment in the mental health or other clinic? Is the mental health clinic separate from the medical clinic, such that being seen in the waiting room exposes your illness? All of these things contribute to your ability to manage your illness. You need to know the answers to these questions to help you make your choice. ",
            "date": "Answered September 22, 2016",
            "views": "23",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Leyla Kutluca",
                    "user_href": "/profile/Leyla-Kutluca"
                }
            ]
        }
    ]
}