{
    "title": "Is acting talent or skill? - Quora",
    "tags": [
        "Talent",
        "Acting"
    ],
    "response": [
        {
            "author_info": {
                "name": "John-Paul Wilson",
                "href": "/profile/John-Paul-Wilson"
            },
            "answer_text": "Oh, it’s a skill. I’m proof positive of that. In college I went from being a pretty lousy actor to a very good one. I was an introverted, nerdy kid who was majoring in math and physics, but I caught the acting bug and added an acting major. I was…not good. I had good instincts, and loved acting, but my body was woefully non-expressive and it took a lot of work to build up the skill. But, I had one advantage that the others lacked: I had been acting a much shorter time than they had, which meant that 1) my acting habits were largely formed under the tutelage of college-level instructors, and 2) I had an emotional out to not be as good. Number two was particularly important. I always took the attitude that I didn’t have to be the best, I had to learn the fastest. By the end of my college career, I could go toe to toe with anyone there. Did I become a professional actor? No. After college I moved to Seattle, which is a fairly big theater town but not really one that supports any professionals beyond a handful of people who cobble together an income from acting, voiceover gigs for computer games, and teaching jobs (with Seattle’s real estate recent real estate boom I wonder how many of those people are still able to make ends meat). Still, I was able to consistently get supporting or lead roles in community theater here, and believe me that’s far more competitive than one might think. Now, there is a kernal of truth to the idea that acting is about talent. Talent is basically the skills and proclivities one develops towards certain skills without realizing that one is doing it. Actors do have an incredibly wide variety of talent in this regard. Take twenty people who’ve never played the oboe and ask them to play, and you’ll have twenty abysmal performances. A year later, the few out of the twenty who had lots of music exposure in their youth might be a fair bit ahead of the others. But take twenty people who’ve never acted and tell them to act? You’ll probably get one who can give a decent performance and a couple who aren’t bad, along with the majority who can’t act much at all. Talent does seem to play a larger role in acting than in other realms. Personally, I’m convinced that’s because of the nature of acting: the skills of the actor are the skills of any human being, just better. Anyone can talk, but an actor has to be able to make his voice fit the part as well as work reliably and meet certain technical requirements (the most difficult is having volume and projection whilst also maintaining vocal nuance). Anyone can be expressive, but actors have to reliably so. Anyone can read words off a page, the actor has to make them into a coherent scene. This isn’t to say that the actor’s skills are worthless or not real, but they’re things that anyone can do to some degree without rigorous training. The training is needed to get to a very high skill level and high degree of reliability, but there are those lucky folks out there who are just naturally gifted actors…many more than you might find for other, more technical skills. Talent isn’t everything though, and remember what I said about those whose acting habits had been set too early? It’s not strictly always beneficial to be easily good at things. ",
            "date": "Answered September 21, 2018",
            "views": "848",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Robert Kabakoff",
                "href": "/profile/Robert-Kabakoff-1"
            },
            "answer_text": "Both. ",
            "date": "Answered October 15, 2019",
            "views": "94",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Shoaib Khan",
                    "user_href": "/profile/Shoaib-Khan-1298"
                }
            ]
        }
    ]
}