{
    "title": "Is adventure a good hobby to write in resume? - Quora",
    "tags": [
        "Adventures",
        "Hobbies",
        "Résumé and CV writing"
    ],
    "response": [
        {
            "author_info": {
                "name": "Pleas Andrew Honeywood",
                "href": "/profile/Pleas-Andrew-Honeywood"
            },
            "answer_text": "Pay close attention. I can’t believe nobody’s telling you this. There is no such thing as a good hobby for you to put on your resume. Every inch of your resume is valuable space. You have to use it to successfully convey the professional attributes that make you a good candidate. If your hobbies have no tangible value to your career search, they do no good on your resume besides giving you a nice, happy feeling that people give a damn. They don’t. If they ask about your hobbies in the interview, of course you should be honest about it. But unless your hobby is specifically job-related, you’re wasting space and time putting it anywhere on your resume. Instead, use that space to quantify what sets you apart. ",
            "date": "Answered December 14, 2017",
            "views": "23",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Geet R",
                "href": "/profile/Geet-R"
            },
            "answer_text": "Yes very much. You can put it in specifics as \"adventure sports\". If you have some achievments in adventure sports it will be a bonus. You should be able to justify in the interview that you are passionate about it, I mean it should not be something that you just did once in your lifetime. For interviews learn about - New adventure sports , Someone who is your idol in adventure sports, how does help you build your attitude or improve yourself ",
            "date": "Updated November 6, 2016",
            "views": "33",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Seem",
                    "user_href": "/profile/Seem"
                },
                {
                    "user_id": "Anup Patil",
                    "user_href": "/profile/Anup-Patil-38"
                }
            ]
        }
    ]
}