{
    "title": "Is a concluding sentence really necessary to end a paragraph? - Quora",
    "tags": [
        "Paragraphs",
        "Sentences (language)",
        "Grammar"
    ],
    "response": [
        {
            "author_info": {
                "name": "Evelyn Elwell Uyemura",
                "href": "/profile/Evelyn-Elwell-Uyemura"
            },
            "answer_text": "In actual practice, such as in a book or extended article, no, paragraphs do not generally end with a conclusion. They may gesture towards the following thought, or just end. But I instruct my students in their English-class research papers to end each paragraph with some sort of analysis or commentary because otherwise they just stitch together a lot of quotes and paraphrase and never say anything about what it all means. It helps keep them focused on the fact that they are supposed to be saying something about the topic, not just regurgitating. If your instructor tells you to end a paragraph with a bit of conclusion, or an opinion or analysis, just do it. Once you get better at writing, your words will flow from paragraph to paragraph without stopping to think of it so mechanically. It’s like learning to drive—they tell you lots of rules when you’re learning, and maybe skilled drivers don’t follow all the rules, but you’re not a skilled driver yet, so follow the instructions! (The image I use is a triple cheeseburger: The bread on top and bottom of the paragraph is you, your voice. The cheese is the lead-ins and connections between information, and the meat is the quotes or paraphrases from sources.) Eg: States with higher rates of gun ownership also have higher rates of suicide. According to…… quote, statistic….The blah blah Times reports that…. In addition, if we look at the rates of blah blah blah. Finally, it is also noted that, “quote quote quote.” We cannot say for sure if removing guns would decrease the rates of suicide, but the close correlation between gun ownership rates in places like Wyoming and Utah and the higher than average suicide rates there suggests that the knowledge that a gun is available might tip some fragile persons into making a rash decision. However, the same pattern is not evident in other high suicide countries such as South Korea or Japan. South Korea has one of the highest suicide rates in the world, followed closely by Japan, but guns are seldom used in suicides there. Based on a report by …..etc. etc. ",
            "date": "Answered November 17, 2019",
            "views": "194",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Jing Xuan Sun",
                    "user_href": "/profile/Jing-Xuan-Sun"
                },
                {
                    "user_id": "Kate Moore",
                    "user_href": "/profile/Kate-Moore-149"
                },
                {
                    "user_id": "Michele Thistle",
                    "user_href": "/profile/Michele-Thistle-2"
                },
                {
                    "user_id": "Andy Champlain",
                    "user_href": "/profile/Andy-Champlain"
                }
            ]
        },
        {
            "author_info": {
                "name": "Kate Moore",
                "href": "/profile/Kate-Moore-149"
            },
            "answer_text": "Yes, because to be fluent, the idea in the paragraph needs to come to some sort of end before one moves to the next paragraph. It may well have a different character than the concluding PARAGRAPH in an ESSAY, but one needs to stop one paragraph before moving/transitioning to the next, or one is just rambling. ",
            "date": "Answered November 18, 2019",
            "views": "48",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Jing Xuan Sun",
                    "user_href": "/profile/Jing-Xuan-Sun"
                }
            ]
        }
    ]
}