{
    "title": "Is article writing in a newspaper a profession? - Quora",
    "tags": [
        "Article Writing",
        "News Articles",
        "Journalists",
        "Newspapers",
        "Creative Writing",
        "Journalism",
        "Writing Advice",
        "Writing",
        "Jobs and Careers"
    ],
    "response": [
        {
            "author_info": {
                "name": "Bernard Mendoza",
                "href": "/profile/Bernard-Mendoza-5"
            },
            "answer_text": "Nowadays, occupations that were once considered trades are commonly regarded as professions. For some people, if you are paid a salary every month, you are a professional. If you receive your pay weekly, in a packet, you are definitely not. It begins to sound like a class “thing”, which it is. Salaried workers are professionals. The weekly paid are tradespeople. It is a typically British “fudge”. Tradesmen (yes, and tradeswomen) get their hands dirty. Professional people do not, unless maybe their posh fountain pens leak ink on their fingers. If all this sounds complicated, even messy, that’s because it is. The class structure in England (we may as well call it that) often defies logic, leave alone explanation. Being a professional does not make a working man a gentleman. Gentlemen don’t work, they have occupations - which may well be invisible to the naked eye. Journalists tend to fall between two stools - especially if the stools are located at the bar. On Grub Street, as it was once called, different criteria apply. If you have your own by-line in a respected journal, you’ll probably be treated as a professional, even if the gentry don’t really believe it. If, on the other hand, you work for a popular scandal sheet, you might as well just get pissed, because that’s all anyone expects of you. (Between the two of us, the other lot get just as pissed but they do it over glasses of a good red, Chateau Lafitte’s not a bad drop of splosh, and if you really know your way around, you could well escape getting stuck with the bill.) The Bill, by the way (note the upper case B), is common talk for the police, who are another lot that are never quite gentlemen, even if they do reach the ranks of the professionals. I did say it was complicated, didn’t I? Anyway, now you know - or don’t know - as much as I do. Or don’t. You really need to be born and raised here. It doesn’t help, but it does help you understand. Sometimes. ",
            "date": "Answered December 9, 2019",
            "views": "77",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Alpana Gupta",
                "href": "/profile/Alpana-Gupta-79"
            },
            "answer_text": "Yes, it is and a good one too. Once you build your reputation as a unique writer, people start recognising you by your work and talent. Writers can freelance and be hired permanently also. It depends on their niche. A few kinds of articles are frequent like politics, sports or share market. For this news, papers hire writers permanently and some other sort of content like lifestyle, festivals or health extra, they depend on freelancers. Writers who are interested can find jobs online or through agencies. ",
            "date": "Answered December 8, 2019",
            "views": "60",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Saatvik Agarwal",
                    "user_href": "/profile/Saatvik-Agarwal-2"
                },
                {
                    "user_id": "Donna Williams",
                    "user_href": "/profile/Donna-Williams-238"
                }
            ]
        }
    ]
}