{
    "title": "Is blogging still profitable? - Quora",
    "tags": [
        "Blog Monetization",
        "Accounting Metrics",
        "Blog Writing",
        "Blogging Platforms",
        "Bloggers",
        "Profitability",
        "Blogs",
        "Blogging",
        "Writing"
    ],
    "response": [
        {
            "author_info": {
                "name": "Joey Massenburg",
                "href": "/profile/Joey-Massenburg"
            },
            "answer_text": "Yes. It’s a long-term business model that’s not going away anytime soon. Also, it’s important to note that, when speaking about blogging and profitability, profitability comes from the industry and niche you are in. In other words, bloggers aren’t competing with all bloggers that have blogs on the internet. Bloggers are only competing with the bloggers in their particular niches. I’ll try to explain this in a way that makes sense. At the top level, there are industries like fashion, technology, health and fitness, dating and relationships, finance, pet care, toys, and so on. Within these industries, niches exist. A niche is a group of people that exist within a larger industry. These groups of people have problems or issues they want to solve — and are willing to pay for such a solution. Let’s say a marketer is in the health and fitness industry. Well, this marketer might specifically focus on “MEN WHO WANT TO LOSE WEIGHT.” Another marketer in the health and fitness industry might decide that she wants to focus on “WOMEN WHO WANT TO LOSE WEIGHT.” Do you see how you can have two bloggers can work in the same industry but work in two different niches? Each of these niches could be broken down even more. Blogs are written about niches. The niche a blogger is in determines all kinds of things — like what products he or she may sell. When people are first getting into this business, they look at competition as a bad thing — but it’s really not. The more profitable a niche and industry are, the more product there are to promote. The more products there are to promote, the more opportunities to make money. Think of it this way. In order to get your foot in the door of a profitable niche, all you need to do is to start off with ONE PRODUCT that people are looking for and find a set of keywords that’s not too competitive . With all of the profitable industries and niches out there, this is easy to do. All it takes is some research. Speaking of research, knowing how to conduct proper research is one of the first and most important steps to building a successful blog. It’s the foundation upon which everything else is built. It’s how you find your customers, what motivates them to buy, your keywords and all that jazz. If you’re interested in an internet marketing-training program AND community that teaches you all about how to become a successful blogger and provides you with a place to meet like-minded marketers that can help you out along the way, I recommend you check out Wealthy Affiliate. ",
            "date": "Answered April 7, 2019",
            "views": "140",
            "upvotes": " Answer requested by Quentin McNabb",
            "upvoters": [
                {
                    "user_id": "Kuntal Mukherjee",
                    "user_href": "/profile/Kuntal-Mukherjee-47"
                }
            ]
        },
        {
            "author_info": {
                "name": "Biswajit Ganguly",
                "href": "/profile/Biswajit-Ganguly-27"
            },
            "answer_text": "Blogging itself is not a business. But blogging can be used for money earning and business promotions. You can become an influencer to talk about different brands through your blogging platform. And the brands may pay you for that.You can have your own product or service that you may promote through your blog. That can help in user engagement and lead generation for business.",
            "date": "Answered June 23, 2019",
            "views": "29",
            "upvotes": " View 1 Upvoter"
        }
    ]
}