{
    "title": "Is discrimination against men real? Can you give any example of discrimination against males? - Quora",
    "tags": [
        "Male Experiences with Sexism",
        "Double Standards",
        "Men",
        "Sexism",
        "Discrimination"
    ],
    "response": [
        {
            "author_info": {
                "name": "Michael Bast",
                "href": "/profile/Michael-Bast"
            },
            "answer_text": "There's a ton of modern discrimination against men. 1st - is in most states if there's a domestic violence call, the man is accused of the crime and is taken into custody. I personally know a disabled military veteran who's wife verbally and physically abuses him at great lengths (I've seen a pan she bent hitting him over the head) and uses the threats of calling the cops to get her way. He's spent several nights in jail due to her calling the police or the neighbors as she screams and throws his belongings against their condo wall. Now he's got charges she uses that leverage to get her will, she's broken almost every nice piece of electronics they've owned, pushes things down the stairs to cause a racket, and threatens to call the cops almost weekly. He's had to run out of the house and leave before the police arrive without wearing any shoes, shirt, etc. Why he doesn't keep a go-bag with a hundred dollars or more, a change of clothes, and some other necessities in his trunk is beyond me. She's even kicked him in the back where he's got issues, accusing him of hurting her when she \"broke\" her toe when she kicked him barefoot. He sticks around hoping for change and has been verbally and physically abused so much he seems to accept it… I'd have run off long ago and would seek separation or divorce as there's no kids involved. Really she should be charged for wasting tax dollars and police resources for relationship manipulation purposes. I know another wife that screams and throws her purse or other objects against the wall, or even saw her do it to the neighbors door. What they must think is going on would lead them to call for a welfare check. She does this clearly to escalate the situation and get her way. He's had charges put on him too. Fortunately the local police have had to have flagged their addresses, but with all fair in love and war they never know if this is the time they'll confront a gun risking their chances of going home safely so they have to treat each call seriously. Some states haul both parties into custody, a much much fair approach but this is the exception not the rule. 2nd - Equal job opportunities, I'll likely get some comments, but when it comes to certain companies they hire females only, and males have had to concede the positions they had. Women have successfully sued employers with men in similar situations losing the legal battle. Over the last 100 years the opening of jobs to women has disrupted the job opportunities, basically cutting the available jobs to men by about 50% (women do outnumber men) and has created a social construct that work is tied to a mans identity, \"What's he do?\" is a very common question that defines his social status. 3rd - Child custody is an issue. I've known women who were a mess psychologically and chemically that got custody, healthcare, food, and money from both the state and from the father(s) of their children (alimony and/or child support) yet men aren't given the same rights, and have lengthy and expensive legal battles for custody. In some situations the male basically has to give up even partial visitation because the woman moves away, with visits of only a few weeks over the summer, or has had to drive hours to the place where the woman lives and visit while staying (and paying ) for a hotel. The man was not allowed to move equal distances without surrendering custody or fighting a lengthy legal battle proving the case of abuse or inadequate parenting, living conditions, etc. Social views of a \"stay at home dad\" is typically derogatory. There is definitely a stereotype that men should be contributing to the finances of the household, yet a man that makes enough to allow the woman to choose to work or not is viewed as a \"provider\" and praised, even more so if he can afford a nanny and housecleaning, etc. 4th- Similarly, the Law/Police/Imprison men on average more often and receive 63 percent longer prison sentences than women who commit comparable crimes. Reinforcing data accumulated from numerous other surveys on the subject, also found that women are twice as likely to avoid incarceration if convicted of a crime – which may explain why 90% of the prison population is male. Police will single out a men in an incidents that involve criminal matters when both sexes are present and arrest the man. A man who steps up and takes the fall and gets jail or prison time for a woman can be depicted as chivalrous and noble; inversely, a man who expected a woman to do the same thing, meanwhile, would seem dishonorable and cowardly.- The Sentencing Gap: Why are Men More Likely to Go to Prison? - 5th - Dress Codes, with men often having restrictions on what they can wear to work with limited choices. Same holds true to get into restaurants, bars, county clubs, etc. Men are often required to wear a suit, tie, and dress shoes to get into establishments, yet women can wear bright colors, open toe shoes, can pick the length of their hair with men being stuck with few options. Just look at conventional busines attire or formal occasions, men are restricted in what they wear with women having much more freedom and many more choices. 6th - More women graduate college today than men. We are at a point in history where men don't hold the upper hand in many aspects of life. It's expected the man will provide, and in executive and board positions often do, but this is changing. A stay at home dad is not viewed the same as a woman who stays home to raise kids. 7th - The \"Me Too Movement\" where men are accused of some past unwanted sexual contact. It's gotten so bad that men's careers and lives can be ruined by a female saying something happened years ago with no proof. How this would effect a woman is totally different, she'd be innocent until proven guilty and not the other way around. The accusing man would be castigated by the public and laughed at while its true that when the roles are reversed there's no pairity. ",
            "date": "Updated October 22, 2018",
            "views": "19",
            "upvotes": " View 53 Upvoters",
            "upvoters": [
                {
                    "user_id": "Danial Naseer",
                    "user_href": "/profile/Danial-Naseer"
                },
                {
                    "user_id": "Red Heart",
                    "user_href": "/profile/Red-Heart-58"
                },
                {
                    "user_id": "Arnav Sharma",
                    "user_href": "/profile/Arnav-Sharma-517"
                },
                {
                    "user_id": "Judah Ben Wheeler",
                    "user_href": "/profile/Judah-Ben-Wheeler"
                },
                {
                    "user_id": "Valiant Greco",
                    "user_href": "/profile/Valiant-Greco"
                },
                {
                    "user_id": "Lucius Salcedo",
                    "user_href": "/profile/Lucius-Salcedo"
                },
                {
                    "user_id": "Nathan Hedglin",
                    "user_href": "/profile/Nathan-Hedglin-1"
                },
                {
                    "user_id": "Nitish B",
                    "user_href": "/profile/Nitish-B-8"
                },
                {
                    "user_id": "Japhet Boakye",
                    "user_href": "/profile/Japhet-Boakye"
                },
                {
                    "user_id": "Carlos Fimbres",
                    "user_href": "/profile/Carlos-Fimbres-2"
                }
            ]
        },
        {
            "author_info": {
                "name": "Jonathan Roberts",
                "href": "/profile/Jonathan-Roberts-35"
            },
            "answer_text": "Imagine you saw this thread, but it was men talking about what they had done to their ex-girlfriends:      Now in this gender-flipped scenario, imagine that women who told their friends about this, or who contacted domestic violence support services about this were often not given sympathy, but rather were mocked for being weak, told that they had probably deserved it, and told that they were probably the abuser themselves. Imagine that there was a significant chance that they would be arrested themselves if they called the police, and they had a good chance of losing their home and children and having to financially support their abuser. Imagine they were excluded from support services because of their gender, and the only support they could have were anger management classes, which they had to pay for and faced severe consequences for failing to attend. Many IPV services listen to feminist “experts” and base their actions on the Duluth Model. Here’s what it has to say about women’s violence against men: When women use violence in an intimate relationship, the circumstances of that violence tend to differ from when men use violence. Men’s use of violence against women is learned and reinforced through many social, cultural and institutional experiences. Women’s use of violence does not have the same kind of societal support. Many women who do use violence against their male partners are being battered. Their violence is used primarily to respond to and resist the violence used against them. On the societal level, women’s violence against men has a trivial effect on men compared to the devastating effect of men’s violence against women. They aren’t experts at all. They are man-hating ideologues who are doing real harm, and it’s past time that we recognised that violence is not gendered. The women in this thread were not defending themselves, they were abusing their non-violent partners. They admit to this, and they are not sorry. They are willing to share this in a Facebook thread under their real names, because they don’t fear consequences. Imagine if a thread like this included a man who had stabbed his girlfriend in the vagina after she cheated, and “couldn’t finish because she started screaming like a little girl . She still has the scars to this day .” This is one of the ways that men are most clearly discriminated against in western society – even when unjustified non-reciprocal violence by women against men is shown in movies, in the news, in social media and elsewhere, it’s hard for people to accept that this is just as wrong as the reverse. In 2014, Zariah Jae Samson, a 25 year old woman in New Zealand, beat her “kind-hearted, helpful and selfless” boyfriend in someone else’s home for four hours. People walked past them as she was doing this, and didn’t stop her. In the end, she dragged him off to her own home and strangled him to death with a computer cable. In the morning, she sent her friend Cindy a text saying \"cleaning up mai mess\" and asking for petrol and cleaning products. Over four hours in a friend's kitchen, she tied his hands behind his back, stripped him and assaulted him with punches and kicks. She then marched him out of the flat and took him to the desolate state house where she lived with her pregnant sister. There she wrapped a computer cord around his neck and strangled him. Police found his body the next day wrapped in a red faux mink blanket under a double bed. … Samson-Witana (the woman’s sister) recorded a full evidential interview on the Sunday night, saying she disliked Protos because he stole her chocolate biscuits and, although she heard some thumping, she was not aware of what her sister was doing. … [The victim] went into the flat's tiny kitchen, to be accused of various things by an angry and paranoid Samson. Both had been using methamphetamine. Then the beating started, the thuds resounding through the flat. Tawha (a friend of the woman) said she heard \"bang, bang, bang, for about three to five minutes\". She went into the kitchen and saw blood on Protos' white top and on his hands. \"He was standing in front of the window. He like had a look on his face, like it was like a unsettled, like a kind of cry for help, but more, my help was, yeah nah, gone.\" Tawha told police she was appalled, thinking: \"F..... crazy b...., the f... . . . you f...... kidding me.\" Tawha returned to the living room and turned the television sound up. She took her children out on the balcony to play I Spy, so they wouldn't hear the noise from the beating, and told them to be quick in the toilet because the toilet was close to the kitchen. After a couple of hours she decided she had to get out and took the children to McDonald's for dinner. They ordered three chicken-nugget hunger busters and ate in the car park. … Back at Conference St, Kapea (another friend), who had stayed behind, thought Samson was behaving bizarrely. \"She thought he had wires on him so she made him take off all his clothes and was checking his mouth, turned his phones off, stuff like that,\" she told police. \"He was bleeding. I tried to see where it was coming from but it was just every where . . . When I went in, and she was just talking to him, asking him if he's a snitch, and rah, rah rah and she was pretty paranoid. And he was just like, what are you doing this to me for. Like she didn't even know herself, I don't think.\" With more banging coming from the kitchen, Kapea went in again to find Protos sitting on the floor, naked and wrapped in a blanket, and Samson \"just going nuts\". According to her interview she told Samson, \"You're not doing this here\". \"I think she wanted to f...... kill him.\" Samson said, \"it's over for him\" and drew her hand across her throat. Kapea reminded Samson she had children and told her to stop. Protos wasn't saying much. \"It's like he'd been cracked in the head and he was a bit dazed,\" she told police. \"Then when I was like nah, f... off. That's way over the top bro . . . I was thinking f.... F.... She was real crazy in the head.\" … According to an interview recorded on June 4, 2014, Bachop (the woman’s father) claimed he found Samson in a bad way but denied he saw Protos in the kitchen. \"I don't take notice of people I don't like. It's easier for me,\" he said. \"She was talking in riddles, she wasn't right, thinking about ringing mental health.\" But Bachop didn't stay. \"I got pissed off and as I do when I get pissed off, I walk away.\" Kapea saw it differently. \"He came into the kitchen, just looked at him and Zariah, had a little talk and then he left. I think she wanted him to help her move him or something like that. Like he didn't want any, I don't think he wanted anything to do with it.\" How murder went to manslaughter in brutal death Imagine you hear this story, roles reversed. A guy is beating his naked girlfriend in a home where there are other adults and children present. She’s clearly got some kind of concussion, and she’s not fighting back. She doesn’t even seem to understand what’s going on. The guy is clearly paranoid and is accusing her of things that she didn’t do. Multiple people walk past, but nobody makes any real attempt to stop him. In the end he dresses her, drags her home and strangles her to death. Despite all of this, he is only found guilty of manslaughter and sentenced to six years and three months' jail, with a non-parole period of three years and three months – which is the period he’s already been on remand in jail. What would this say about the normalisation of gendered violence within society? In February 2016, James Prout was killed after a sustained campaign of domestic violence by a wheelchair-bound man and three women, including his girlfriend. In addition to physical beatings, he was forced to have sex with a dog, his testicle was cut off and he was forced to eat it. Despite posting pictures of his injuries and emaciated body online months earlier, nobody raised the alarm. He was found on wasteland six weeks after his death.  (Ann Kelly Corbett was his girlfriend, and one of the perpetrators) The tragic story of murder victim Jimmy Prout Imagine this had been a woman abused by a gang of three men and a woman. In this gender-reversed scenario, the woman received a stricter sentence than the boyfriend, despite the fact that she was in a wheelchair and she isn’t the one pushing the victim around in CCTV photos, or ransacking his bank account:  This story is more like the Brock Turner case – the perpetrator is described in terms of their potential and the way that prison could harm their life. This time though, the perpetrator wasn’t jailed at all:  Aspiring heart surgeon Lavinia Woodward punched and stabbed her Cambridge PhD boyfriend during an alcohol-and-drug-fuelled row at Christ Church College. The court previously heard she had wounded him a few times with a knife, punched him in the face and also threw a laptop, a jam jar and a glass at him in her university's halls of residence. Woodward was handed a 10-month suspended prison sentence. Judge who spared student jail for stabbing Cambridge boyfriend investigated Like Turner, she isn’t even happy to submit to the slap on her wrist: The presiding judge in the original case reportedly told Woodward that a custodial sentence could damage her career prospects and was therefore too severe. The judge’s remarks led to accusations of leniency and tabloid headlines including “Too clever for prison”. They also provoked a debate about social and racial inequalities in the judicial system. Woodward – who lives in Milan with her mother – has now applied to the court of appeal to review her sentence, which was delivered at Oxford crown court in September this year. The stabbing occurred on 30 September 2016 when Woodward’s partner, a University of Cambridge student whom she met on Tinder, visited her in Oxford. He infuriated Woodward after contacting her mother with his concerns about her drinking. She became “extremely angry” and began throwing objects at him before stabbing him in the leg. Oxford student appeals against suspended sentence for stabbing boyfriend Again, this was an unprovoked attack on a non-violent intimate partner, which was not taken seriously enough. Generally speaking, women who perpetrate violence on men are handed every excuse: they were provoked. They were probably defending themselves. It wasn’t as serious or the same thing as violence against women. He should have defended himself or gotten out. If he did defend himself, then he was the primary aggressor. A man made her do it. It was a lapse in judgement. She is a victim of violence from a former relationship. He didn’t react in the right way. This isn’t just the reaction from people in general; it’s also written into laws that say that people’s height and weight should be taken into consideration when determining the predominant aggressor, or that IPV laws should be called names like the Violence Against Women Act, and awareness campaigns should almost or completely focus on violence by men against women. Even if the organisations and government bodies claim to be neutral despite their claims that IPV is basically just violence against women, does anyone actually believe them? Here’s an example of what this equality and neutrality means: a screening tool used by the UK police only on men who contact them to report that they are victims:  Feminists use the statistics gained from this to suggest that men are more likely to lie about abuse, while telling us that women hardly ever make false accusations. Even if she is proven to have made false statements about abuse or have acted in very odd ways that don’t suggest victimhood, we should use the trauma-informed approach to explain why this is misleading. We shouldn’t prosecute false accusations, because this might stop ‘real victims’ from coming forward. False accusations are a form of abuse, and people who are falsely accused are real victims. It’s like swatting – we can take the threats that merit armed police responses seriously while also considering the possibility that this response can be used as violence by proxy. The result of gendered approaches to victims of violence can be seen in a US study, which references several others that reinforce it. Remember, the men in this table are probably listed as liars somewhere in a feminist statistic, and used to justify a continued exclusion of men from support, or bias against them:  The fact that men often don’t receive support or are discriminated against does not mean that male victims don’t exist. It doesn’t mean that it doesn’t matter. It certainly doesn’t mean that violence is gendered. It just means that society’s willingness to ignore victims and perpetrators of violence is gendered. ",
            "date": "Answered January 29, 2018",
            "views": "596",
            "upvotes": " View 4.5K Upvoters ",
            "upvoters": [
                {
                    "user_id": "Danial Naseer",
                    "user_href": "/profile/Danial-Naseer"
                },
                {
                    "user_id": "Apoorv",
                    "user_href": "/profile/Apoorv-86"
                },
                {
                    "user_id": "Arnav Sharma",
                    "user_href": "/profile/Arnav-Sharma-517"
                },
                {
                    "user_id": "Tyler Mcewan",
                    "user_href": "/profile/Tyler-Mcewan"
                },
                {
                    "user_id": "Amelia Riley",
                    "user_href": "/profile/Amelia-Riley-18"
                },
                {
                    "user_id": "Abishek Kannappan",
                    "user_href": "/profile/Abishek-Kannappan-2"
                },
                {
                    "user_id": "Grant Boothe",
                    "user_href": "/profile/Grant-Boothe"
                },
                {
                    "user_id": "Marvin Ruelas",
                    "user_href": "/profile/Marvin-Ruelas"
                },
                {
                    "user_id": "Caleb J. Cackowski",
                    "user_href": "/profile/Caleb-J-Cackowski"
                },
                {
                    "user_id": "Lucius Salcedo",
                    "user_href": "/profile/Lucius-Salcedo"
                }
            ]
        }
    ]
}