{
    "title": "Is freedom of speech in the Declaration of Independence? - Quora",
    "tags": [
        "Declaration of Independence of the United States",
        "Freedom of Speech",
        "Freedom",
        "Human Rights"
    ],
    "response": [
        {
            "author_info": {
                "name": "Timothy Miller",
                "href": "/profile/Timothy-Miller-368"
            },
            "answer_text": "Unenemerated yes, here's my challenge for you all today. Get yourself a copy of our Declaration of Independence and get a copy of your state constitution or a PA constitution. Set them side by side and as you read down thru the bill of rights or inherent rights section. Some states will have a very similar section 1 and some will be a little different but they all will have some that are the same if not in text then certainly in spirt or intent. Now go down each inherent right of mankind and see if you can match-up any language, rights or founding spirit from the Declaration of Independence into your state Constitution. Count em up and let me know what ya come up with and whattcha think. ",
            "date": "Answered May 25, 2020",
            "views": "25",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Roy Earl",
                "href": "/profile/Roy-Earl-1"
            },
            "answer_text": "Try the first amendment to the Constitution. It is still there, at least on paper. Some of us still believe in it...but then some of us still believe in a world where governors, mayors, and other elected officials follow the rule of law and do not act like tin pot dictators. ",
            "date": "Answered May 21, 2020",
            "views": "76",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Gil Chavez",
                    "user_href": "/profile/Gil-Chavez-1"
                },
                {
                    "user_id": "Dave Kristof",
                    "user_href": "/profile/Dave-Kristof"
                },
                {
                    "user_id": "Anthony Cummins",
                    "user_href": "/profile/Anthony-Cummins-13"
                },
                {
                    "user_id": "John McQuiston",
                    "user_href": "/profile/John-McQuiston-1"
                }
            ]
        }
    ]
}