{
    "title": "Is gun control policies a good argumentative essay topic? - Quora",
    "tags": [
        "Gun Control Laws",
        "Essays"
    ],
    "response": [
        {
            "author_info": {
                "name": "Chris McKinney",
                "href": "/profile/Chris-McKinney-27"
            },
            "answer_text": "Yes. It has been beaten to death, there are a TON of sources against gun control and one source with many faces (Bloomberg) for anything supporting gun control. One fun thing is to follow the funding from one Bloomberg source quoting another to support their arguments. Scientifically it is as valid as my wife and I talking to our 19 year old about college plans this semester. . . . I say, “what I am saying is right, your mother is really smart and she says ___________” and my wife saying “what I say is right, your father has lots of experience and says __________” when in fact we have already talked about it and have exactly the same opinion so we are really just using the illusion it is two people with educated opinions. .. when in fact it is a married couple with a unified opinion, same bed, same finances. VPC, Million Moms (all 250 of them, lol) Mayors against. . .. all the same bed, same finances, using each other to validate Bloomberg’s agenda. Be aware that if you go into debate supporting gun control that is likely to be exposed and exploited. When you get called out on some fact and they say “without quoting a Bloomberg biased source”, you’ll be standing there with “well I think ‘cause, um, uh.. . . ya know”. The flip side is when the other side whines about the ebil NRA forbidding research by the CDC . . . you can pull out facts. The NRA can’t forbid anything. The CDC was paid by gun control orgs to produce results supporting gun control. They spent tax payer money doing non-science and produced the results they were paid to publish. That isn’t science. When scientists get caught publishing biased results for profit, their funding gets cut. Incidentally, the funding didn’t go away, it got reallocated to Traumatic Brain Injury research. Violent crime has been trending down, concealed carry has been trending up. If you overlay those to graphs it brings up a question. Correlation does not equal causation. . . . sure. So look into and explore the various causes for those trends and let your audience connect the dots. Don’t be like “look, these curves must be related, so fact” rather “here is the ebb and flow of gun control” “Here is the ebb of violent crime” . . .. “here is the ebb and flow of concealed carry and gun ownership in general” so what social causes and effects can be responsible for the facts we see? Gun control? Nope, if you’ll refer to this graph here, you see that during the 1994 Assault Weapons Ban .. . . . “ So, if you only have to argue one side and you get to pick the side, go for it. If you have to argue both sides you will only lose the gun control debate opposing it, if you have confirmation bias and do a half heart-ed no real effort attempt. If you have to support gun control, you will only win if the person you are opposing also supports gun control and so does a lame, half heart-ed job, ignoring facts. So .. . if I had to argue both sides and win, I wouldn’t touch the topic with a ten foot pole. Against anyone competently discussing facts and science, gun control is as doomed as “virgin sacrifice to get good crops” it was an idea that seemed good to some people, back in the past before science. ",
            "date": "Answered August 15, 2020",
            "views": "98",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Scott Booth",
                    "user_href": "/profile/Scott-Booth-50"
                },
                {
                    "user_id": "Robert Harvey",
                    "user_href": "/profile/Robert-Harvey-41"
                }
            ]
        },
        {
            "author_info": {
                "name": "Matthew Bates",
                "href": "/profile/Matthew-Bates-27"
            },
            "answer_text": "English teacher here. There’s an important part of persuasive (argumentative) essay writing that students forget: your teacher has probably heard it all before. They aren’t grading you on whether or not you convince them to change their minds; they’re grading you on your writing skills. At least, they should be. With that in mind, if your goal is simply to get a good grade, then pick the topic that’s easiest to write about even if… and this is very critical… even if you, personally, disagree with it. It’s not about convincing the teacher of anything other than the fact that you can write a persuasive essay. I’ve had students who were passionate about something, and picked that thing for their essay topic, but that thing was so niche that they struggled to find resources to support their topic. The students who pick the topic that’s been done a million times before usually have the easiest time. There’s a time and place for being passionate about something. While trying to get a good grade on a persuasive essay may not be that time or place. ",
            "date": "Answered August 15, 2020",
            "views": "94",
            "upvotes": " View 583 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Hyunjun Bae",
                    "user_href": "/profile/Hyunjun-Bae-1"
                },
                {
                    "user_id": "Austin Schlusemeyer",
                    "user_href": "/profile/Austin-Schlusemeyer"
                },
                {
                    "user_id": "Harold Aurand",
                    "user_href": "/profile/Harold-Aurand"
                },
                {
                    "user_id": "Katya Yurkovskaya",
                    "user_href": "/profile/Katya-Yurkovskaya"
                },
                {
                    "user_id": "Jacob Faul",
                    "user_href": "/profile/Jacob-Faul"
                },
                {
                    "user_id": "Dustin Rausch",
                    "user_href": "/profile/Dustin-Rausch"
                },
                {
                    "user_id": "Olivia Yang",
                    "user_href": "/profile/Olivia-Yang-47"
                },
                {
                    "user_id": "Wando Titus",
                    "user_href": "/profile/Wando-Titus"
                },
                {
                    "user_id": "Jack Brooks",
                    "user_href": "/profile/Jack-Brooks-3"
                },
                {
                    "user_id": "Joseph Brusgard",
                    "user_href": "/profile/Joseph-Brusgard"
                }
            ]
        }
    ]
}