{
    "title": "Is Grammarly safe? Is there a risk that by using it I might get accused of plagiarising my own work? Does Grammarly store the text? - Quora",
    "tags": [
        "Grammarly (company)",
        "Grammar"
    ],
    "response": [
        {
            "author_info": {
                "name": "Anilla Watson",
                "href": "/profile/Anilla-Watson"
            },
            "answer_text": "Grammarly As you may know, Grammarly is a Grammar Checking and Correction Tool. In any case, it is more than that. This tool additionally checks spelling, plagiarism. This tool is the most mainstream Grammar checking tool. It has around 7 Million Daily Users as of September 2017, and the Grammarly Chrome expansion is downloaded 10 Million times. Pros Real time Grammar checking: All things considered, that is the fundamental advantage of utilizing Grammarly. It gives continuous Grammar Checking, so it naturally recognizes diverse Grammar and Spelling botches while you are composing and it is really speedy. Accuracy: Grammarly Cheaker is highly accurate, and dissimilar to different tools, it doesn’t commit a ton of errors. Sometimes it may neglect to understand your style and elevate to put a comma where you would prefer not to. However, aside from that it works extraordinary and is highly accurate. Compatibility: Another in addition to utilizing Grammarly free is that it is good with a large portion of the devices and sites. You can utilize it by downloading the desktop application accessible for the two Windows and Mac. Or on the other hand, you can download the Chrome extension. It is additionally accessible for mobile devices. Easy to use: It has a clean User Interface and is anything but difficult to utilize. And you can become accustomed to it rapidly. Not at all like some different applications like Photoshop, you do not need to be a master to utilize. You can become used to it in just a day or two. Cons Not Compatible with Google Docs So this is the one noteworthy con that is normal to both the free and the premium version. It is not compatible with Google Docs, so those of you who mostly use Google Docs this tool isn’t for you so you may need to search for alternatives. Be that as it may, in the event that you don’t use Google Docs, at that point it’s not even a con for you can purchase the premium version without hesitating. Limited Free Version Indeed, that is the con for individuals searching for a free Grammar Checking Tool. Its free version is limited and doesn’t give every one of the features which the premium one does. Yet at the same time, it is superior to anything the free versions of different tools like Ginger. I have personally used Ginger’s free version, and I can let you know guys that Grammarly has a superior Free Version. Too Much Ads This con is again limited to the free version. Grammarly cost aggressively displays ads. They need you to spend the cash and purchase the premium version. Be that as it may, too numerous ads and unnecessary emails may bother you. Is it safe to use? All things considered, this is a question most of the users ask. The base of their Algorithm is on user information through machine learning (AI). It checks Grammar in the cloud because its AI needs constant refreshing and consumes a great deal of processing power. The manner in which they use this information makes them the fastest developing Grammar Checking tool. It is in the interest of Grammarly to secure your information, and they are attempting to do it too because the tool would not have any desire to lose their reputation and benefit. And yet, they don’t promise it. How to Safely Use Grammarly? So you can use Grammarly safely by following up on the accompanying security precautions:Try not to use the tool for typing passwords or any personal information.Try not to type in the content of interest to law enforcement",
            "date": "Answered April 6, 2020",
            "views": "2",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Linda Halton",
                "href": "/profile/Linda-Halton"
            },
            "answer_text": "Grammarly is NOT safe to use. They store your data permanently. There have been numerous vulnerable Grammarly bugs reported in the past. Some of my friends in the medical space cannot use Grammarly because of its lack of data privacy and security (aka it’s not HIPAA compliant).  If you are looking for a HIPAA compliant spelling and grammar corrector, then I recommend checking out Perfect Tense. Their website is www.perfecttense.com. They have couple of different solutions like an API and a Javascript library that lets you add spelling and grammar correction to your website or app. I found their HIPAA compliance page here: www.perfecttense.com/hipaa  ",
            "date": "Answered February 28, 2019",
            "views": "74",
            "upvotes": " View 11 Upvoters",
            "upvoters": [
                {
                    "user_id": "Stella Penn",
                    "user_href": "/profile/Stella-Penn-1"
                },
                {
                    "user_id": "Russell Westbrook",
                    "user_href": "/profile/Russell-Westbrook-37"
                },
                {
                    "user_id": "Aaron Puckett",
                    "user_href": "/profile/Aaron-Puckett"
                },
                {
                    "user_id": "Kenneth Viscuso",
                    "user_href": "/profile/Kenneth-Viscuso"
                },
                {
                    "user_id": "Siavash",
                    "user_href": "/profile/Siavash-9"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/Shepherd-32"
                },
                {
                    "user_id": "Dana Stasieluk",
                    "user_href": "/profile/Dana-Stasieluk"
                },
                {
                    "user_id": "Brittany Bousquet",
                    "user_href": "/profile/Brittany-Bousquet-5"
                },
                {
                    "user_id": "Lillian Carver",
                    "user_href": "/profile/Lillian-Carver-3"
                },
                {
                    "user_id": "Matthew Elvey",
                    "user_href": "/profile/Matthew-Elvey"
                }
            ]
        }
    ]
}