{
    "title": "Is HP instant ink a good deal? - Quora",
    "tags": [
        "HP Instant Ink",
        "HP Printer Ink Cartridges"
    ],
    "response": [
        {
            "author_info": {
                "name": "Bob Headrick",
                "href": "/profile/Bob-Headrick"
            },
            "answer_text": "HP Instant Ink can be an excellent deal, or a complete waste of money, depending on what and how often you print. The Instant Ink subscription provides a set number of pages per month (currently plans are available at 15, 50, 100, 300 or 700 pages per month). The 15 page/month plan is free, the others range from $2.99 per month for the 50 page/month plan to $19.99 for the 700 page /month plan. Unused pages can be rolled over up to one month’s carryover (except the free plan does not allow carryover). There are some important things to keep in mind: This is a subscription service. You pay for the plan monthly. If you do not use the pages they are carried over to the next month, but only one month’s carryover is allowed. If you do not print at all you will still pay the monthly fee. You can change the plan or cancel it depending on your needs. Note- if you change the plan you lose any current rollover pages.Cartridges are supplied as needed. The printer will need to be connected to the internet so it can communicate with the Instant Ink servers. The cartridges will be automatically shipped as needed. The program aims to keep you with enough ink for two months of subscription printing. For example, if you have the 100 page/month plan new ink would be shipped as your remaining ink approached 200 pages.Instant Ink cartridges are shipped as part of the subscription. There is not a separate charge for the cartridges. A not-well-understood side effect of this is that the cartridges are the property of HP and must be returned if you cancel the program. (If you or HP cancel the subscription the cartridges will stop working in the printer and will need to be replaced with retail cartridges. This is often not understood by users.A page is one side of a page with any ink printed on it. If you are printing addresses on envelopes or low density black and white pages Instant Ink is probably not the best choice for you. For typical printing the savings is about 50% compared to buying retail cartridges. If you are printing full page photo’s the savings are much greater.Read the terms before you sign up, see HP® Official Site - Sign up here for information. ",
            "date": "Answered May 28, 2019",
            "views": "28",
            "upvotes": " View 2 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Azaiah Johnson",
                    "user_href": "/profile/Azaiah-Johnson"
                },
                {
                    "user_id": "Mark Millard",
                    "user_href": "/profile/Mark-Millard"
                }
            ]
        },
        {
            "author_info": {
                "name": "James Boettcher",
                "href": "/profile/James-Boettcher"
            },
            "answer_text": "If you don't print a lot of pages a month, and are not willing to take a chance on 3rd party refills, then the program might work for you. You can read the details here: HP Instant Ink - What Is HP Instant Ink? Read the fine print… Know what you are getting into. Inkjets can have problems with plugged printheads, especially if you almost never print, and the weather is hot. Some ink cartridges have the printhead as part of the cartridge, others have a separate printhead. Replacing the printhead on those printers can be expensive. There are special cleaning kits or cartridges, and tutorials on YouTube about cleaning and unclogging printheads. In my experience this works about half the time. If you print a lot of color, your best bet might be to invest in a lower priced color laser instead. Several clients of mine with a large volume of color output have switched to leasing a high volume laser multifunction network printer, and paying a per copy fee for supplies and maintenance. It's all about page count, and cost per page. So you need to factor in ink/toner costs, maintenance, and printer replacement, and the trouble and mess of dealing with the printer. For these clients the bottom line is better with a lease plan. For a low volume office or home user, a different solution might be better. In my office, almost all the printing can be done on a black and white laser. I use an HP, and 3rd party toner (from a local trusted supplier). Sure color might be nice, but you often don't need it. When I occasionally need high quality color prints, I just take the job to Kinko's or Staples. That works for me. If you like to print your own cards, or do a lot of custom printing, or other art, then saving a few nickles on each page may not be important to you. If you have regular usage, and the pages per month is fairly low, then having HP monitor your page count, and send cartridges as needed might work for you. ",
            "date": "Answered May 17, 2018",
            "views": "1",
            "upvotes": " Answer requested by Isaac Jessop and Cornelius Butler"
        }
    ]
}