{
    "title": "Is it really important to learn story writing before actually converting your idea into story? - Quora",
    "tags": [
        "Creating Writing Advice",
        "Creative Writing"
    ],
    "response": [
        {
            "author_info": {
                "name": "Aravind KR",
                "href": "/profile/Aravind-KR-7"
            },
            "answer_text": "No, Not necessary at all. We daydream a lot about our idea and how we will be doing it. We know every bolt and nut of our idea and have the confidence to bring it out. Storytelling is just another way to bring your idea out. People choose storytelling because there are many story readers. When there is a proper receiving end, you can work on anything, only if you want your idea to be reached to many. If I was you, I would do: Write/Print the thoughts of the idea in the paper or document. Have special sides for these mains: WHAT, HOW, WHY, WHEN, WHO (ALL), WHICH. What is my idea, what is all about?How will I achieve it, is it easy, or difficult.Why this idea. Is there any necessary to do it?When will I start and complete it?Who are my team members? Am I alone?Which technology or which platform I’ve chosen.After all, this, Imagine you are called up for a TED talk, how will you converse your idea to your audience. The way you talk to people, the interjections used, the emotions in it is your story. Write the same way in another document, that becomes your idea in a story way. You don’t need to know the storytelling for all this unless you have a passion for this. Thanks for A2A. Hope this helped. ",
            "date": "Answered October 21, 2018",
            "views": "128",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Vibhu Garg",
                    "user_href": "/profile/Vibhu-Garg-3"
                },
                {
                    "user_id": "Ashwan Kumar",
                    "user_href": "/profile/Ashwan-Kumar-11"
                },
                {
                    "user_id": "Dr.Jitendra Sharma",
                    "user_href": "/profile/Dr-Jitendra-Sharma"
                }
            ]
        },
        {
            "author_info": {
                "name": "Aditti Ghosh",
                "href": "/profile/Aditti-Ghosh"
            },
            "answer_text": "Learning acquires different forms. I will give you my perspective. Do you remember someone narrating a story to you when you were a child? Or do you notice how people describe any event or incident? What is common in both? If observed well, the one thing that makes a narration interesting is how immaculate one is with expressing . Expressions add life to a story. It keeps you glued. And that's the aim of the storyteller! While, a verbal articulation is much easier, where you know how to modulate your tone, use bodily gestures, play with expressions, and more importantly the way you punctuate, the same is needed to be displayed through words while writing a story. The written words must resonate in the ears of the reader so the brain can decipher it in the form of images, therefore making story writing a tad bit difficult. So, how do you learn to write a story? To me, it's nothing but reading that paves the way to a satisfactory narration with the right things at the right places. The more you read, the easier it gets to pen down the nuances of what we call a beautiful written story. Reading has magical effects. It unclogs the brain. You become more adept in describing the intricacies with ease. Gradually you begin to see your ideas flowing in black and white. Thank you for the A2A. ",
            "date": "Answered October 22, 2018",
            "views": "322",
            "upvotes": " View 7 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Aalekh Prajapati",
                    "user_href": "/profile/Aalekh-Prajapati"
                },
                {
                    "user_id": "Devika Krishnan",
                    "user_href": "/profile/Devika-Krishnan-27"
                },
                {
                    "user_id": "Raman Verma",
                    "user_href": "/profile/Raman-Verma-178"
                },
                {
                    "user_id": "Veer Pratap",
                    "user_href": "/profile/Veer-Pratap-56"
                },
                {
                    "user_id": "Vaidehi Deshmukh",
                    "user_href": "/profile/Vaidehi-Deshmukh-13"
                },
                {
                    "user_id": "Rahul Batra",
                    "user_href": "/profile/Rahul-Batra-118"
                },
                {
                    "user_id": "Jaspal Rana",
                    "user_href": "/profile/Jaspal-Rana"
                }
            ]
        }
    ]
}