{
    "title": "Is it true to put my opinion in introduction when I take the IELTS writing task 2? - Quora",
    "tags": [
        "IELTS Writing Task 2 (essay)",
        "IELTS Preparation"
    ],
    "response": [
        {
            "author_info": {
                "name": "IELTS Focus",
                "href": "/profile/IELTS-Focus"
            },
            "answer_text": "The short answer is Yes. If the question asks for an opinion then you should state it in the thesis statement in the introduction, the body paragraphs and rephrase it in the conclusion, especially if it is an opinion essay. Some essay questions do not ask for an opinion or may only ask for suggestions such as in a problem solution essay: ‘what solutions can you suggest to tackle the issue’ For more information on giving an opinion, see this blog post below: When should I write an opinion in an IELTS essay? For Thesis statements, here is a useful lesson: How to write a Thesis statement in IELTS essays. IELTS writing task 2 Some IELTS teachers give different advice and say don’t write an opinion until the conclusion or don’t write a thesis statement, but the marking criteria for Band 7 Task Response says: ‘presents a clear position throughout the response\u2028‘ The examiner needs to see your position from the start. Hope it helpsRay ieltsfocus.com ",
            "date": "Answered October 12, 2018",
            "views": "959",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Mudheffer Ameen",
                    "user_href": "/profile/Mudheffer-Ameen"
                }
            ]
        },
        {
            "author_info": {
                "name": "Robyn Angela",
                "href": "/profile/Robyn-Angela"
            },
            "answer_text": "If it’s an opinion essay, then you really must include your opinion in the introduction (paragraph 1). This is because your entire essay body will be supporting that opinion. If the reader doesn’t know your opinion from the start, how can they follow the logic of your supporting paragraphs? For Both Sides + Opinion, I teach (as many do) to keep your opinion OUT of the intro and the body paragraphs and to dedicate the final paragraph to your opinion instead. You want the examiner to know you can discuss, in a neutral way, the reasons that others believe in Side A/Side B. If the essay doesn't call for your opinion on a problem, it is best not to give it. Spend your time and effort answering the question called for. ",
            "date": "Answered April 27, 2018",
            "views": "16",
            "upvotes": " View 7 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Gareth Delph",
                    "user_href": "/profile/Gareth-Delph"
                },
                {
                    "user_id": "Sara Macleod",
                    "user_href": "/profile/Sara-Macleod-3"
                },
                {
                    "user_id": "Milad Gh",
                    "user_href": "/profile/Milad-Gh"
                },
                {
                    "user_id": "Mudheffer Ameen",
                    "user_href": "/profile/Mudheffer-Ameen"
                },
                {
                    "user_id": "Aoibheann Nic Gabhann",
                    "user_href": "/profile/Aoibheann-Nic-Gabhann"
                },
                {
                    "user_id": "Sam Lahij",
                    "user_href": "/profile/Sam-Lahij"
                },
                {
                    "user_id": "Vijay Raj",
                    "user_href": "/profile/Vijay-Raj-80"
                }
            ]
        }
    ]
}