{
    "title": "Is intentionally misspelling words in dialogue acceptable for characterization? - Quora",
    "tags": [
        "Characterization",
        "Spelling Errors",
        "Dialogue",
        "Spelling",
        "Literature",
        "Writing Advice",
        "Linguistics",
        "Writing"
    ],
    "response": [
        {
            "author_info": {
                "name": "Corwyn Berthier",
                "href": "/profile/Corwyn-Berthier"
            },
            "answer_text": "If you write a long work where the spelling is contorted to suggest dialect and regional patois, you are going to succeed in one thing: you will annoy the piss out of your reader. Dropping it in here and there is not a terrible thing. You can, for example, spell words the way a certain character pronounces them, but then explain in some fashion that the character speaks that way. Then just consider it tacit, unless the mispronunciation is crucial in some manner. Extended use of orthographic mangling to provide characterization is akin to having them wear funny hats so you can identify them. You might get away with it in a short story, but frankly, it’s just dumb, because you keep pounding the reader with something that was established with the first instance. The reader will start muttering to herself, “Yeah, yeah, enough already! I got it the first time!” ",
            "date": "Answered October 31, 2019",
            "views": "490",
            "upvotes": " View 6 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Michael Sebree",
                    "user_href": "/profile/Michael-Sebree-1"
                },
                {
                    "user_id": "Amy E. Brown",
                    "user_href": "/profile/Amy-E-Brown-1"
                },
                {
                    "user_id": "Teako Abik",
                    "user_href": "/profile/Teako-Abik"
                },
                {
                    "user_id": "Steven P Robinson",
                    "user_href": "/profile/Steven-P-Robinson"
                },
                {
                    "user_id": "Gerald Pierson",
                    "user_href": "/profile/Gerald-Pierson"
                },
                {
                    "user_id": "Ruth Sanders",
                    "user_href": "/profile/Ruth-Sanders-3"
                }
            ]
        },
        {
            "author_info": {
                "name": "James Johnson",
                "href": "/profile/James-Johnson-187"
            },
            "answer_text": "Only if your goal is to communicate mispronunciation. You would have to spell the word in the way in which you want your character to mispronounce it. For example, in my high school growing up, kids would commonly mispronounce the word “library” as ‘libary’. It’s a good way to characterize someone, but it’s also very heavy handed. Stop for a minute, and think about what you’re trying to communicate. Are you showing that this character has a learning disability? If so: How severe is it? Or is your character maybe just a little ignorant. Maybe your character just isn’t that smart, or well read. ",
            "date": "Answered October 26, 2019",
            "views": "47",
            "upvotes": "0"
        }
    ]
}