{
    "title": "Is it right to use 'look at' here: “Once we look at the words of Jesus and hear the testimonies of the Church, we'll be clear on it.'? - Quora",
    "tags": [
        "English Diction and Word Usage"
    ],
    "response": [
        {
            "author_info": {
                "name": "Angus Kirk",
                "href": "/profile/Angus-Kirk-1"
            },
            "answer_text": "In the context of reading something, most people would say, “reading the words” or “looking at the words” interchangeably. The latter is a euphemistic form of saying reading the words; it does not mean you are literally only look at the words and not reading them. However, depending on the whole context, it might be more appropriate to say, “Reading the words” of Jesus, as opposed to “Hearing the words.” The apostles heard the words; congregants in a church hear the words as they’re read by a lector. You, with your Bible, are reading the words. So, in short, “looking at” is usually OK, but your teachers may have another reason to say “reading,” beyond their own personal preferences. ",
            "date": "Answered May 18, 2017",
            "views": "61",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Lynch Hall",
                    "user_href": "/profile/Lynch-Hall-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Sharon Wolfgang",
                "href": "/profile/Sharon-Wolfgang"
            },
            "answer_text": "“Look at the words” is a shade different from “look at the books”, probably because if you’re literate you can’t look at a word without reading it. “Look at the books” could mean something along the lines of “see all those books on the shelves” with no suggestion that you’re actually going to read the books; “look at the words” implies that you’ll pick up at least a general idea of what the words say. Because of this difference in meaning, I’d say that your sample sentence is correct. ",
            "date": "Answered June 1, 2017",
            "views": "35",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Lynch Hall",
                    "user_href": "/profile/Lynch-Hall-1"
                }
            ]
        }
    ]
}