{
    "title": "Is it a good idea to write my college app essay about the positives of giving up? I studied ballet for 13 years and was at an elite, selective ballet school. After I quit I lost the center of my identity and had to reinvent who I am. - Quora",
    "tags": [
        "Essay Topics",
        "Essay Writing"
    ],
    "response": [
        {
            "author_info": {
                "name": "Olivia Deborah Lagutaris LaRosa",
                "href": "/profile/Olivia-Deborah-Lagutaris-LaRosa"
            },
            "answer_text": "I wrote and reviewed many college app essays. I tutored people in writing college app essays and got myself into a top-tier law school by writing my own essays. Then I read a few hundred law school app essays after graduating from law school. Don’t brag about your intelligence or the people you know. Be real, and be human. Be funny, if you can. The better you demonstrate deep qualities like insight and empathy, the more impressive your essay. Overcoming a challenge like yours is impressive. Be careful not to stress too much the exclusivity of your ballet school. Say it once. Perhaps mention the name of someone famous who went there, then move on. Ask us again when you have a draft! ",
            "date": "Answered January 26, 2018",
            "views": "250",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Jo Farrall",
                    "user_href": "/profile/Jo-Farrall"
                }
            ]
        },
        {
            "author_info": {
                "name": "Mike Thakar",
                "href": "/profile/Mike-Thakar"
            },
            "answer_text": "Certainly not; colleges do not want quitters, they want students who will graduate. I suspect you did not just “give up.” You quit for a reason; maybe not a very good reason or maybe for a very good reason. Either can be a very strong subject for your essay. If, in hindsight, your choice was poor, then you write about the lesson your learned from your mistake, and, how you have moved on. Craft your essay about how you now make decisions and point to how you reinvented yourself into a student who intends on getting a college education. If your reason for quitting still holds — financial/family/medical or realization a career in ballet is not for you — then craft your essay about how moving on has addressed that/those issues. ",
            "date": "Answered February 28, 2018",
            "views": "343",
            "upvotes": "0"
        }
    ]
}