{
    "title": "Is it best to 'willpower your way through' (writer's block), or to go do something else and then come back to your writing? - Quora",
    "tags": [
        "Writer's Block",
        "Writers and Authors",
        "Writing Advice"
    ],
    "response": [
        {
            "author_info": {
                "name": "Mercedes R. Lackey",
                "href": "/profile/Mercedes-R-Lackey"
            },
            "answer_text": "Neither. Go back to the point in your writing when you were writing freely, just before the “block.” Now ask yourself what you wrote after that that went wrong? Were you forcing the story down a path that is not implied from the previous prose, and makes no sense in light of what you’ve just written? Are you trying to force a character to do something out of character with no explanation? Are you just writing filler that brings nothing to the story? You’re doing something wrong at that point, and your subconscious is pointing that out by refusing to cooperate with your “plans,” if indeed you had any. Take a deep breath and ditch those plans. Ask yourself “What else could happen here?” You’ll know you’ve found the right answer when you find yourself writing freely again. ",
            "date": "Answered January 5, 2020",
            "views": "39",
            "upvotes": " View 443 Upvoters ",
            "upvoters": [
                {
                    "user_id": "R. Dugger",
                    "user_href": "/profile/R-Dugger"
                },
                {
                    "user_id": "Evgeni Bolotin",
                    "user_href": "/profile/Evgeni-Bolotin"
                },
                {
                    "user_id": "Julie Stibbs",
                    "user_href": "/profile/Julie-Stibbs"
                },
                {
                    "user_id": "Magnus Nilsson",
                    "user_href": "/profile/Magnus-Nilsson-55"
                },
                {
                    "user_id": "Judy Arnett",
                    "user_href": "/profile/Judy-Arnett"
                },
                {
                    "user_id": "Charles Monia",
                    "user_href": "/profile/Charles-Monia"
                },
                {
                    "user_id": "Robert Durtschi",
                    "user_href": "/profile/Robert-Durtschi"
                },
                {
                    "user_id": "Mikhael Bornstein",
                    "user_href": "/profile/Mikhael-Bornstein"
                },
                {
                    "user_id": "Hannah Ainsworth",
                    "user_href": "/profile/Hannah-Ainsworth-2"
                },
                {
                    "user_id": "Dakota Harlow",
                    "user_href": "/profile/Dakota-Harlow"
                }
            ]
        },
        {
            "author_info": {
                "name": "Glen Robinson",
                "href": "/profile/Glen-Robinson-1"
            },
            "answer_text": "Some authors believe the latter. They believe that writer’s block doesn’t really exist, that it’s just a matter of not believing in yourself. I believe that there are many reasons for writer’s block, and you first need to understand what is going on. Is it a matter of too many things going on in your life? Declutter your life before going on. Is it because you don’t understand the story? Take time to sort it out. Is it because you are stressed about something? Figure out what it is that is bothering you and work it out. One time I took a week off from work to write on my novel. The first day I sat down at my desk and had a bad case of writer’s block. I struggled for a couple of hours, and ended up going to the mall and watching two movies. Giving myself permission to lighten up was the right thing to do. The next day I wrote fourteen pages. Most importantly, you need to understand yourself as a writer. What works for you as motivation, and what is simply copping out? ",
            "date": "Answered January 11, 2020",
            "views": "226",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Shana Chen",
                    "user_href": "/profile/Shana-Chen-3"
                },
                {
                    "user_id": "Libby Norris",
                    "user_href": "/profile/Libby-Norris-7"
                }
            ]
        }
    ]
}