{
    "title": "Is it better to write by hand or type? - Quora",
    "tags": [
        "Handwriting",
        "Typing",
        "Writing Advice"
    ],
    "response": [
        {
            "author_info": {
                "name": "Stuart Smith",
                "href": "/profile/Stuart-Smith-257"
            },
            "answer_text": "The current science of creativity says that passing ideas through your hands kinetically - especially through a handwriting medium - allows more complex thought expression. On the other hand, voice typing technology is such that you can also “write”orally to great effect, then go back and clean up the work as you would any draft. Some people prefer to compose purely on the keyboard. What matters is that you put effort into all of these methods in order to discern for yourself your most productive system. Quantity doesn’t equal quality. Sometimes producing less, but more thoughtful work, is most important. Sometimes you need the large quantity of work a dictated draft can create. Trial and error, up to a point, is what’s needed, and a certain bull-headedness to use what works best for you. ",
            "date": "Answered October 8, 2019",
            "views": "75",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Mohammed Saiful Alam Siddiquee",
                    "user_href": "/profile/Mohammed-Saiful-Alam-Siddiquee"
                }
            ]
        },
        {
            "author_info": {
                "name": "Gail Snow",
                "href": "/profile/Gail-Snow-2"
            },
            "answer_text": "I suppose that is up to personal preference. You write very brief questions, so I will have to assume you are talking about creative writing, although, to some extent, what I will say next has bearing on note taking as well. I definitely prefer typing. Generally speaking, typing is neater than handwriting, so it’s easier to read. Most people can type much faster than they can write. Typing on a computerized device can be edited and expanded upon much more easily than the handwritten page. I know that some creative writing instructors suggest you write by hand, but in my opinion, they probably say that because that’s what they prefer. I hate writing by hand and can’t think as clearly as I can while typing on a computer screen. As far as personal correspondence is concerned, most people don’t write personal letters today, but when they do, it is more personal to write by hand. However, if your handwriting isn’t easy to read, my suggestion would be to use a font that looks like handwriting (cursive) and apologize for doing so. ",
            "date": "Answered October 8, 2019",
            "views": "77",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Mohammed Saiful Alam Siddiquee",
                    "user_href": "/profile/Mohammed-Saiful-Alam-Siddiquee"
                }
            ]
        }
    ]
}