{
    "title": "Is it okay to say a college is my first choice in an essay? - Quora",
    "tags": [
        "College Application Essays",
        "College Advice in the United States of America",
        "College Applications",
        "College and University Life Advice",
        "College and University Admissions Advice",
        "Colleges and Universities in the United States of America",
        "Essays",
        "The College and University Experience",
        "College and University Admissions"
    ],
    "response": [
        {
            "author_info": {
                "name": "Brooke Hanson",
                "href": "/profile/Brooke-Hanson-3"
            },
            "answer_text": "It’s fine to say a college is your first choice in an essay. But the best way to “say” this is with an early decision application. That action is more convincing than words. Have you checked the school’s aid policy? I realize that some families make more than the floor for receiving aid (i.e. let’s say you’re from NYC and your parents collectively make $135K — that may be top 15% in the country, but lower middle class by Manhattan standards, and not enough to pay for $50K/year at Stanford when they’re renting a Manhattan apartment and paying for your two older siblings to go to college), but at some schools the financial aid team will look at each case individually. If you can explain your financial situation, the school may be willing to work with you. And if you have to say “no thanks,” because you can’t afford it— that should not burn every bridge for all the other schools you’re applying to. You can also reach out the financial aid office at the school before you apply and ask them if they make exceptions in terms of aid given parental income, ask them what would qualify you for aid, etc. You get to determine what “affordable” means, and you can turn down an offer if you find the aid package isn’t affordable. At the same time if you’d rather not have the pressure of making an instant decision on affordability after admission (if you’re going to turn down an early decision offer, you have to do so quickly), and want to weigh both the size of the aid package from the college you speak of and other aid packages you get from regular decision schools, waiting may be the better option. You may want to ask yourself: How good are my chances of getting in to this school? Is it absolutely really where I want to go? Even if “I” want to go there, am I actually going to be making this decision in tandem with my parents and their financial ability to contribute? If you get in, will your parents be willing to contribute even though it will cost more than other options? Or will they be of the opinion that you should attend a state school or school that offers more aid? If the latter, that may influence your decision. I wouldn’t necessarily get into the specifics of “why this is my first choice but I didn’t apply early” — there are plenty of kids who just don’t get around to early decision. If you want to say it’s your dream school, that’s fine. ",
            "date": "Answered July 15, 2016",
            "views": "23",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Henry Sears",
                    "user_href": "/profile/Henry-Sears"
                },
                {
                    "user_id": "Memphis Chen",
                    "user_href": "/profile/Memphis-Chen-2"
                },
                {
                    "user_id": "PrabhaNshu SinGh ParMar",
                    "user_href": "/profile/PrabhaNshu-SinGh-ParMar"
                }
            ]
        },
        {
            "author_info": {
                "name": "Loretta B DeLoggio",
                "href": "/profile/Loretta-B-DeLoggio"
            },
            "answer_text": "If you look at my blogs, you'll notice that there's one called Your Academic Evidence. You're on trial and your application is your evidence. Now supposing you say that the school is your first choice. What evidence do you have to back that up? A statement made without corroborating evidence is called \"hearsay,\" and is inadmissible. So what are you going to back it up with? They don't want to hear about rank; they don't want to hear how you want to make all your friends jealous; they don't want to hear how cool this will make it to the people you might want to date. If you can't name three programs, professors, or organizations unique to that school, with actual details of why they make you want to go there, then you don't want to go there. For instance, when I chose to apply to Temple Law school, I was able to say that I wanted to study trial advocacy, and the man I'd seen interviewed on 60 Minutes was teaching at Temple. I was able to say that someone I knew from outside the law school on a personal basis was one of the trial advocacy instructors. And I was able to say I owned a house in Philadelphia and could bicycle to school and back. If you don’t have this kind of evidence to back it up, your statements aren’t credible. That doesn’t mean they’re lies; it just means there is no particular reason to believe them. ",
            "date": "Answered July 15, 2016",
            "views": "66",
            "upvotes": " View 18 Upvoters",
            "upvoters": [
                {
                    "user_id": "Jerrell Cockerham",
                    "user_href": "/profile/Jerrell-Cockerham"
                },
                {
                    "user_id": "Jeremy Bloch",
                    "user_href": "/profile/Jeremy-Bloch"
                },
                {
                    "user_id": "Zach Sekaran",
                    "user_href": "/profile/Zach-Sekaran"
                },
                {
                    "user_id": "Nuño Sempere",
                    "user_href": "/profile/Nuño-Sempere"
                },
                {
                    "user_id": "Allan Augustine",
                    "user_href": "/profile/Allan-Augustine"
                },
                {
                    "user_id": "Faizan Asim",
                    "user_href": "/profile/Faizan-Asim-1"
                },
                {
                    "user_id": "Alan Wu",
                    "user_href": "/profile/Alan-Wu-13"
                },
                {
                    "user_id": "Michael Sellars",
                    "user_href": "/profile/Michael-Sellars-3"
                },
                {
                    "user_id": "Rachel Tan",
                    "user_href": "/profile/Rachel-Tan-82"
                },
                {
                    "user_id": "Calvin Huang",
                    "user_href": "/profile/Calvin-Huang"
                },
                {
                    "user_id": "Brandon Cheng",
                    "user_href": "/profile/Brandon-Cheng-7"
                },
                {
                    "user_id": "Henry Williams",
                    "user_href": "/profile/Henry-Williams-72"
                },
                {
                    "user_id": "Jen Gronroos",
                    "user_href": "/profile/Jen-Gronroos"
                },
                {
                    "user_id": "Farhana Haider",
                    "user_href": "/profile/Farhana-Haider-1"
                },
                {
                    "user_id": "Anubhav Gupta",
                    "user_href": "/profile/Anubhav-Gupta-65"
                },
                {
                    "user_id": "Dylan Katz",
                    "user_href": "/profile/Dylan-Katz-1"
                },
                {
                    "user_id": "Alexandra Josephine Gulko-Hyman",
                    "user_href": "/profile/Alexandra-Josephine-Gulko-Hyman"
                },
                {
                    "user_id": "Scott Welch",
                    "user_href": "/profile/Scott-Welch"
                }
            ]
        },
        {
            "author_info": {
                "name": "Tom Stagliano",
                "href": "/profile/Tom-Stagliano"
            },
            "answer_text": "…my family can’t afford the full price of the college …. and I doubt we qualify for financial aid… Whoa!!!!!!!!! Two things: If you can Not afford the price of the college, then the college should be meeting your need, if it has early decisionThe only Valid reason to Not enroll in an Early Decision acceptance college, is if the college does Not meet your financial needs.Therefore, Apply Early Decision, and keep the essays “on topic” Easy. ",
            "date": "Answered July 15, 2016",
            "views": "142",
            "upvotes": " View 26 Upvoters",
            "upvoters": [
                {
                    "user_id": "Henry Sears",
                    "user_href": "/profile/Henry-Sears"
                },
                {
                    "user_id": "Sabeen Zahra",
                    "user_href": "/profile/Sabeen-Zahra"
                },
                {
                    "user_id": "Shilpa Bhandari",
                    "user_href": "/profile/Shilpa-Bhandari-2"
                },
                {
                    "user_id": "Syed Hasan",
                    "user_href": "/profile/Syed-Hasan-82"
                },
                {
                    "user_id": "Stefan Mulligan",
                    "user_href": "/profile/Stefan-Mulligan"
                },
                {
                    "user_id": "Brittany-Marie",
                    "user_href": "/profile/Brittany-Marie-37"
                },
                {
                    "user_id": "Alyssa Mona",
                    "user_href": "/profile/Alyssa-Mona"
                },
                {
                    "user_id": "Brendan Chase",
                    "user_href": "/profile/Brendan-Chase-2"
                },
                {
                    "user_id": "James Lacey",
                    "user_href": "/profile/James-Lacey"
                },
                {
                    "user_id": "Santino Beretta",
                    "user_href": "/profile/Santino-Beretta"
                },
                {
                    "user_id": "Yazeed Alnumay",
                    "user_href": "/profile/Yazeed-Alnumay"
                },
                {
                    "user_id": "Liam Brodie",
                    "user_href": "/profile/Liam-Brodie"
                },
                {
                    "user_id": "Alan Wu",
                    "user_href": "/profile/Alan-Wu-13"
                },
                {
                    "user_id": "Paul Cohen",
                    "user_href": "/profile/Paul-Cohen-31"
                },
                {
                    "user_id": "Rupert Hussey",
                    "user_href": "/profile/Rupert-Hussey"
                },
                {
                    "user_id": "Vaibhav Krishan",
                    "user_href": "/profile/Vaibhav-Krishan"
                },
                {
                    "user_id": "Heinrich Weipert",
                    "user_href": "/profile/Heinrich-Weipert"
                },
                {
                    "user_id": "Brendan Burkhart",
                    "user_href": "/profile/Brendan-Burkhart"
                },
                {
                    "user_id": "Shane Neary",
                    "user_href": "/profile/Shane-Neary"
                },
                {
                    "user_id": "Jake Januzelli",
                    "user_href": "/profile/Jake-Januzelli"
                },
                {
                    "user_id": "Enrico Pioppi",
                    "user_href": "/profile/Enrico-Pioppi"
                },
                {
                    "user_id": "Max Gray",
                    "user_href": "/profile/Max-Gray"
                },
                {
                    "user_id": "Pranav",
                    "user_href": "/profile/Pranav-15"
                },
                {
                    "user_id": "Shreyas Dutt",
                    "user_href": "/profile/Shreyas-Dutt-1"
                },
                {
                    "user_id": "Theo Saa",
                    "user_href": "/profile/Theo-Saa"
                },
                {
                    "user_id": "Ben Chu",
                    "user_href": "/profile/Ben-Chu-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "James Leland Harp",
                "href": "/profile/James-Leland-Harp"
            },
            "answer_text": "A2A. The fact that you are applying early decision already tell admissions that this is your first choice. As for you essays, I recommend Writing the Personal Statement, Examples of Statements, Personal Statement: Top 10 Rules and Pitfalls, and Advice from Undergraduate Admissions Officers. ",
            "date": "Answered July 15, 2016",
            "views": "839",
            "upvotes": "0"
        }
    ]
}