{
    "title": "Is it okay to use the first person in writing? - Quora",
    "tags": [
        "Writing Advice"
    ],
    "response": [
        {
            "author_info": {
                "name": "Lucienne La Luna",
                "href": "/profile/Lucienne-La-Luna"
            },
            "answer_text": "Is it okay to use the First Person in Writing? My obvious Answer to your Question would be one of why wouldn’t it be? At the risk of Answering a Question with a Question. However before I continue it is most necessary for you to Understand how the First Person principal of Writing works. To undertake a Story of this form you must therefore place Yourself in the position of your main Character. You literally must become that Character and fully connect with them as though they were an extension of your own Personality. Not all Writers maybe able to succeed in achieving what to some can be a very challenging form of Writing. Many prefer to Write in the Second or even the Third Person. To Personally undertake to Write a Fantasy Story in this form comes Naturally to me. I can easily form that Emotional Bond which I believe is required if one is to draw the Readers attention. The Emotional side is every part as important as the Characterisation of your Hero. Naturally you wish for Him or Her to be endowed with certain special Personal traits and other qualities which make up your Character. Many Writers whom struggle with their Emotional side find it near to impossible to take those same Emotions and imbue their Hero with them. By connecting with the Emotional aspect to your Characters Personality you’re making them more real in the eyes of the Reader. For Myself, this is the beauty, if you will of Writing in the First Person principal or form. Your literally imbuing your inner Strengths and Emotions into your Hero. You feel what they feel, and you Sense what they can Sense about the World in which they live; a World you’ve created from your own Imagination for them to exist within. Every part of this Fantasy World becomes real in the Reader’s eyes because your main Character has a Personality. Anybody can Write a Script for a Character Storyline but on a non Emotional level. I guess this is most probably why many Writers find it so difficult to Write in the Character of the First Person. Those same Emotions can often be quite difficult to control and to tame but ultimately are interconnected with your principal Fantasy or purely Fictional Hero. Every great Story needs a Hero! § WitchyWomanWriter § 🔳🔮🔳 August 2020  ",
            "date": "Answered August 20, 2020",
            "views": "645",
            "upvotes": " View 7 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Michael Keilhofer",
                    "user_href": "/profile/Michael-Keilhofer-1"
                },
                {
                    "user_id": "Hubert Okari",
                    "user_href": "/profile/Hubert-Okari"
                },
                {
                    "user_id": "David Gagara",
                    "user_href": "/profile/David-Gagara"
                },
                {
                    "user_id": "Leah Spence",
                    "user_href": "/profile/Leah-Spence-17"
                },
                {
                    "user_id": "Bob Zisk",
                    "user_href": "/profile/Bob-Zisk"
                },
                {
                    "user_id": "Diane Boyle Harder",
                    "user_href": "/profile/Diane-Boyle-Harder"
                },
                {
                    "user_id": "Rubicon X",
                    "user_href": "/profile/Rubicon-X"
                }
            ]
        },
        {
            "author_info": {
                "name": "Michael Davies",
                "href": "/profile/Michael-Davies-420"
            },
            "answer_text": "Many writers have done so with varying degrees of success. It has the advantage of letting the reader know exactly what is going on in the protagonist’s head and this can be quite dramatic and emotional. But it limits the writer to seeing and hearing ONLY what the protagonist sees and hears and this can be limiting. ",
            "date": "Answered August 20, 2020",
            "views": "27",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Donald McMiken",
                "href": "/profile/Donald-McMiken"
            },
            "answer_text": "Of course it’s OK to use first. But how come you didn’t know that? Have you read books? ",
            "date": "Answered August 20, 2020",
            "views": "15",
            "upvotes": "0"
        }
    ]
}