{
    "title": "Is it appropriate to say 'thank you for your time' in an e-mail? - Quora",
    "tags": [
        "Email, Texting, and Voicemail Etiquette",
        "Manners and Etiquette",
        "Email"
    ],
    "response": [
        {
            "author_info": {
                "name": "Shirley Haney",
                "href": "/profile/Shirley-Haney-7"
            },
            "answer_text": "The point is to say you don’t take them for granted and/or that even if they aren’t going to help you you are somehow glad they bother to read your email; two other points are “I know business etiquette” (for yourself) and oh I forget. I’m falling asleep. Well, there’s a line or possibly a wide swath of land, even, something in between thank you for time I simper but with restraint and the other place, where you just give up and slide into shameless, wild bribery, with balloons, strippers, glitter, and jello. This is America. You probably don’t need to thank someone for their time, unless you mean it ironically and are about to slit their throat. Try to find a way to say whatever it is you do mean with both style and clarity. And if you do, keep it to yourself and your intended. Or we’ll steal it, probably. ",
            "date": "Answered December 25, 2019",
            "views": "266",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Muneeb Shah",
                    "user_href": "/profile/Muneeb-Shah-22"
                },
                {
                    "user_id": "Crystal Tan",
                    "user_href": "/profile/Crystal-Tan-63"
                }
            ]
        },
        {
            "author_info": {
                "name": "Judy Dalton",
                "href": "/profile/Judy-Dalton-1"
            },
            "answer_text": "I think it is always appropriate to say thank you. At my age it was always done by personal letter but with time being as valuable as it is today, to expect someone to open a personal note...as well as depending that it was directed to the right person by busy mailroom workers, an email may be more polite in today's fast pace rush although it seems far less personal. A thank you for someone's time is, in my estimation, very necessary, yet shouldn't add a burden which would defeat the purpose. So consider the size of the office as to the better way, but do be sincere and as prompt as possible. I hope this doesn't appear that I'm only talking in circles! ",
            "date": "Answered October 17, 2017",
            "views": "592",
            "upvotes": " View 3 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Jaigobin Shivcharran",
                    "user_href": "/profile/Jaigobin-Shivcharran"
                },
                {
                    "user_id": "Sayira Diaz",
                    "user_href": "/profile/Sayira-Diaz"
                },
                {
                    "user_id": "Usama Sultan",
                    "user_href": "/profile/Usama-Sultan-5"
                }
            ]
        }
    ]
}