{
    "title": "Is it unfair to use essay writing service? - Quora",
    "tags": [],
    "response": [
        {
            "author_info": {
                "name": "Pamela Lea",
                "href": "/profile/Pamela-Lea-1"
            },
            "answer_text": "My gut reaction is to say YES. If the finished product is to be presented as your work, written by you, then this is certainly dishonest. And, though I am not sure where you are, at least in the US, you are likely to be caught. If you have written other material for this particular audience, they may well notice a style difference. Likewise, if you choose an essay writing service used by many, your professor, teacher, etc. may well see similarities between the style of writing in your paper and those of other students, past or present. But, I will give one very cautionary, maybe. When I worked in various colleges and universities, I would often have students attempting to apply for various graduate schools. Many of these applications asked them to answer in the form of an essay, various questions; Why they wanted to study medicine, law, dentistry, etc.? or What did they think they could contribute to the profession? Or whatever. I never wrote a single essay. I did, however, coach more than one student through the process of writing their essays especially in those situations where writing would be secondary to their chose area of study. This did, however, almost backfire on one student. Apparently one of his first term professors was on the admission committee and remembered the excellent essay that had accompanied his application. Early in my former student’s life as a dental student, he was drafted to assist this professor in wiring several articles for professional journals. It actually did great things for his career, but also put a bunch of work on an already busy schedule. ",
            "date": "Answered April 30, 2018",
            "views": "340",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Raj",
                    "user_href": "/profile/Raj-2879"
                },
                {
                    "user_id": "Nicole Allen",
                    "user_href": "/profile/Nicole-Allen-126"
                }
            ]
        },
        {
            "author_info": {
                "name": "Henry Jones",
                "href": "/profile/Henry-Jones-248"
            },
            "answer_text": "Yes, it is unfair. You should not use these services if you really want to become something in the future according to your career aspects. Taking help from these companies not only makes you a cheater but also shameful if caught by the college. The basic practice is to do the research on your own and try to write the best essay. You can take the reference over the web or take the consulting services but avoid using full essay writing. Nowadays, you can easily get the samples on the net regarding your topics. You can take the guidance of writing from there. Don’t be greedy to get the full marks by investing a few bucks to buy essays, scoreless but it should be honest. If you even buy an essay, then you will always be in the fear of getting caught. ",
            "date": "Answered December 23, 2019",
            "views": "72",
            "upvotes": "0"
        }
    ]
}