{
    "title": "Is ISKCON’s Bhagavad Gita exactly the same as the non-ISKCON original? - Quora",
    "tags": [
        "ISCKON",
        "Bhagavad Gita"
    ],
    "response": [
        {
            "author_info": {
                "name": "Vaishnava Charana Dasa",
                "href": "/profile/Vaishnava-Charana-Dasa"
            },
            "answer_text": "Hare Krishna, ISKCON'S version was published by Srila Prabhupada after writing an extensive commentary based on works of previous Acharyas coming in the succession of Brahma Madhva Gaudiya Vaishnav lineage. This is the lineage in which the Yuga avatar of Kaliyuga, Sri Krishna Chaitanya Mahaprabhu himself appears as a preacher of Krishna consciousness. The translation of Bhagavad-Gita from non ISKCON publishers do not focus on the Bhakti Yoga with special emphasis. They place all Yogas on an equal pedestal, and preach that any path or Yoga is good enough to achieve the goal of Supreme Consciousness. The speaker of Bhagavad-Gita ie Sri Krishna, Himself disagrees with this point. According to Lord Krishna, His personality is the highest truth (7.7, 15.18, 15.19). According to Lord Krishna, understanding His personality and achievement of His association is impossible without Surrender and Bhakti (7.14, 11.53, 11.54, 18.55) So Srila Prabhupada has written the commentary based on Lord Krishna's personal desire that He should be served and worshiped as a person, without any touch of impersonalism. When you see all commentators from this point of view (Krishna's personal desire), then Srila Prabhupada stands out as the only devotee commentator who has taken special care to incorporate Krishna's personal desire while writing the comments. Others don't care about Krishna's personal desire because they are not bhaktas. Again Krishna has said in 13.19 that only a devotee commentator can understand his Gita properly, and is therefore qualified to comment on his Gita and publish it for mass distribution. Hare Krishna Hare Krishna Krishna Krishna Hare Hare Hare Ram Hare Ram Ram Ram Hare Hare ",
            "date": "Answered June 11, 2020",
            "views": "282",
            "upvotes": " View 10 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Reena Menon",
                    "user_href": "/profile/Reena-Menon-6"
                },
                {
                    "user_id": "Narsupalli Yaswanth",
                    "user_href": "/profile/Narsupalli-Yaswanth"
                },
                {
                    "user_id": "Nitya Siddha Dasa",
                    "user_href": "/profile/Nitya-Siddha-Dasa"
                },
                {
                    "user_id": "Naresh Chanchlani",
                    "user_href": "/profile/Naresh-Chanchlani"
                },
                {
                    "user_id": "Avinash Nkumar",
                    "user_href": "/profile/Avinash-Nkumar"
                },
                {
                    "user_id": "Dhru Goswami",
                    "user_href": "/profile/Dhru-Goswami"
                },
                {
                    "user_id": "Kelangadi Krishnamurthy",
                    "user_href": "/profile/Kelangadi-Krishnamurthy"
                },
                {
                    "user_id": "Mahesh Singh",
                    "user_href": "/profile/Mahesh-Singh-850"
                },
                {
                    "user_id": "Preet Singh",
                    "user_href": "/profile/Preet-Singh-768"
                },
                {
                    "user_id": "Gaja Vasisht",
                    "user_href": "/profile/Gaja-Vasisht"
                }
            ]
        },
        {
            "author_info": {
                "name": "Mahadeva Sarma",
                "href": "/profile/Mahadeva-Sarma"
            },
            "answer_text": "I think I have expressed my understanding about ISKCON's Bhagavad Gita earlier too. Rightly in the book the first step is word-by-word meaning with the words arranged in a convenient prose order(called paraphrasing). Up to this point I think BG As It Is is just about OK. The trouble starts when Prabhupada starts giving what is called The Purport which is overly biased and अशास्त्रीय (ashAstrIya) to say the least. Giving BG an overdose of VaiShnavaite stress undermines its Vedanta Content on the one hand and above All - The Great Samanvaya Achieved about Vedism in general by Bhagavan Shri Krishna in contrast to -ism specific interpretations of the same by various Acharyas including Shankara. It is only when you look at BG as an -ism free document on Brahma Vidya that you begin to see the Unique Position of Bhagavan Shri KriShna. This is the same with Prabhupada/ISKCON's Srimad Bhagavatam too. The problem of Super-VaiShNavite bias becomes severe with a Scriptural text like SB which has copious Advaita Content. ",
            "date": "Answered June 11, 2020",
            "views": "24",
            "upvotes": " Answer requested by Narayana Rao"
        }
    ]
}