{
    "title": "Is it grammatically correct to ask 'How's you'? - Quora",
    "tags": [
        "English Language Writing Advice",
        "English Grammar Writing Advice",
        "Grammar",
        "English Grammar"
    ],
    "response": [
        {
            "author_info": {
                "name": "Paul Haynes",
                "href": "/profile/Paul-Haynes-17"
            },
            "answer_text": "Is \"How's you?\" grammatically correct? No, it is not. The correct version, as of the year 2019, is “How are you.” The reason for this is that the word “you” is always grammatically treated as if it were a plural, even though the word “you” in fact sometimes functions as plural and sometimes functions as singular. Many other languages have a unique second-person singular pronoun, different from the second-person plural pronoun, but NOT English, at least not in the year 2019. If you were to drop back a few centuries, you would find an English language in which the word “you” always implied more than one person. In those days, the singular version was “thou” or “thee,” with “thou” being used as a subject and “thee” being used as an object. (Compare this to the use of “I” and “me” in the first person.) In those long-ago days, the correct version would have been “How are you?” if addressing two or more people at once, but “How art thou?” if addressing only one person. But in the year 2019, almost any use of the word “thou” is comically archaic. The exception is in religious language, because the highly venerated King James Version of the Bible is old enough to make extensive use of the word “thou,” and prayers and other religious orations and writings often follow the lead of the KJV. ",
            "date": "Answered April 25, 2019",
            "views": "32",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Mohit Sehgal",
                "href": "/profile/Mohit-Sehgal-44"
            },
            "answer_text": "Since ‘is’ is a form of the verb ‘be’, so to quote the great Chandler Bing: “Could it be more wrong?” :D I'm so glad somebody put up this query! Many thanks ! ‘How’s you?’ is another one of pop culture’s grammatical evils! As a grammar coach, it infuriates me inside (albeit I maintain a calm countenance on the surface :p) to have myself enquired after in such fashion! ‘How’s you?’ is essentially the contraction for ‘How is you ?’ Stating the universally known here, that the pronoun ‘you’ never works with ‘is’, making the usage ‘How’s you?’ absolutely wrong and invalid ! Whatever happened to good old ‘How are you?’ that's been around for as long as can be remembered ? ‘You’ as a pronoun in English is always given plural treatment. Hence the combinations of you with forms of be in the present and past tense are as follows : Present tense : You + are Past tense : You + were The forms ‘is’ and ‘was’ find no usage in conjunction with ‘you’ in legitimate grammar except for literature and motion pictures where the characters are deliberately made to use the combination in their speech to establish their rural or uneducated background. ",
            "date": "Answered August 18, 2017",
            "views": "251",
            "upvotes": " View 86 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Ramesh Chandra Dash",
                    "user_href": "/profile/Ramesh-Chandra-Dash-9"
                },
                {
                    "user_id": "Just Want to Write",
                    "user_href": "/profile/Just-Want-to-Write"
                },
                {
                    "user_id": "Adam Kimutai Boit",
                    "user_href": "/profile/Adam-Kimutai-Boit"
                },
                {
                    "user_id": "Hemant Sikarwar",
                    "user_href": "/profile/Hemant-Sikarwar"
                },
                {
                    "user_id": "Rajat Kumar Mahayach",
                    "user_href": "/profile/Rajat-Kumar-Mahayach"
                },
                {
                    "user_id": "Diksha Arora",
                    "user_href": "/profile/Diksha-Arora-108"
                },
                {
                    "user_id": "Pranal Pradeep",
                    "user_href": "/profile/Pranal-Pradeep"
                },
                {
                    "user_id": "Akshay Prasad",
                    "user_href": "/profile/Akshay-Prasad-22"
                },
                {
                    "user_id": "Aditya Deo",
                    "user_href": "/profile/Aditya-Deo-19"
                },
                {
                    "user_id": "Priyanshu Kumari",
                    "user_href": "/profile/Priyanshu-Kumari"
                }
            ]
        }
    ]
}