{
    "title": "Is it rude if someone writes 'as we've discussed' in a work e-mail? - Quora",
    "tags": [
        "Manners and Etiquette",
        "Email"
    ],
    "response": [
        {
            "author_info": {
                "name": "Margaret Weiss",
                "href": "/profile/Margo-Weiss-1"
            },
            "answer_text": "You have a misconception about the way business works.Thankfully, it's not a lethal kind of misconception and can be easily corrected. With that, business as an entity exists in registrations and business activity.Financials are a part of it, the other part is official communications.If nothing is documented, then it's as good as never had happened, and you see where there could be a big problem with that.. right? So, you can treat the emails as a proof that business exists - and this is an important part of business functions.When you put things in writing, there is no ambiguity and there is no miscommunication, and things are in black-and-white, and no one has to rely on their (mostly unreliable) memory, and if there is a problem, it can be simply and easily resolved right away. By mentioning in your email that you've had a conversation, you accomplish the following: you remind the person when it happenedyou remind the person what you talked aboutyou explain how you understood things (you need to include, \"Please feel free to make corrections if anything is missing\" - giving a person a chance to fix any miscommunications/misunderstandings)you document an item vital to business functioningyou explain why it's importantyou list out any outcomes (more meetings, an action point, a responsibility taken, a deadline, etc) - if it's not met, anyone can go and see where it was left offyou have a proof that you were working on something in case you are asked about how you spend your timeThere are too many reasons to list the need to document things and put exact facts in writing.So, do continue to document and do it often.My reasons (above) are mostly optimistic and jovial, however there could be times when you need to prove that the conversation had taken place and if a bad decision goes south (while you had relied on someone else to make that decision), this will be your saving grace and exoneration. ",
            "date": "Answered June 17, 2015",
            "views": "503",
            "upvotes": " View 12 Upvoters",
            "upvoters": [
                {
                    "user_id": "Sylwia Palczowska",
                    "user_href": "/profile/Sylwia-Palczowska-1"
                },
                {
                    "user_id": "Nunthawut Chatuthai",
                    "user_href": "/profile/Nunthawut-Chatuthai"
                },
                {
                    "user_id": "Vipin Kumar",
                    "user_href": "/profile/Vipin-Kumar-487"
                },
                {
                    "user_id": "Aelita Morgenstern",
                    "user_href": "/profile/Aelita-Morgenstern"
                },
                {
                    "user_id": "Thashie Thash",
                    "user_href": "/profile/Thashie-Thash"
                },
                {
                    "user_id": "Kai Matalam",
                    "user_href": "/profile/Kai-Matalam"
                },
                {
                    "user_id": "Janet Hempkin",
                    "user_href": "/profile/Janet-Hempkin"
                },
                {
                    "user_id": "Beth Goldowitz",
                    "user_href": "/profile/Beth-Goldowitz"
                },
                {
                    "user_id": "Mark Harrison",
                    "user_href": "/profile/Mark-Harrison-2"
                },
                {
                    "user_id": "Frank Yuan",
                    "user_href": "/profile/Frank-Yuan-4"
                }
            ]
        },
        {
            "author_info": {
                "name": "Beth Goldowitz",
                "href": "/profile/Beth-Goldowitz"
            },
            "answer_text": "Depends on the context, as with most things. It could be seen as a simple reminder, clarifying a discussion so all parties know what was agreed on and what output is expected from them. It might be chiding, if it is a second or third request for a certain result that hasn’t been competed, especially if directed from a supervisor to an under performing employee. It could be a way of making a fellow employee look bad, if cc:’d to a supervisor. Workplace politics can be complicated, and documentation can be a many-sided form of communication, depending on who’s doing it and why. ",
            "date": "Answered February 17, 2017",
            "views": "173",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Lori Ditty",
                    "user_href": "/profile/Lori-Ditty"
                },
                {
                    "user_id": "Janet Hempkin",
                    "user_href": "/profile/Janet-Hempkin"
                },
                {
                    "user_id": "Jenny Rofe-Radcliffe",
                    "user_href": "/profile/Jenny-Rofe-Radcliffe"
                }
            ]
        }
    ]
}