{
    "title": "Is it true that US soldiers can't make video calls while in camp? - Quora",
    "tags": [
        "American Soldiers",
        "Video Calling",
        "Military Personnel"
    ],
    "response": [
        {
            "author_info": {
                "name": "William Johnston",
                "href": "/profile/William-Johnston-83"
            },
            "answer_text": "Let me give you a true story as to why deployed soldiers are not allowed to make cell phone calls of any type while deployed. Several years ago I was the Chief of Military Operations in South America, Central America, and the Caribbean region for the United States Army South (USARSO). As such, I and my predecessor so no problem allowing an exception to USARSO policy and allow deployed Reserve and National Guard personnel to have and use their cell phones while deployed on missions in our AO. Now, flash forward to a mission in Northern Equador. During the mission one of the HUMMV operators seeing a local indigenous woman and her children walking down the road and stopped to give them a lift. This in itself was against regulations. Failing to slow down to cross a local bridge the driver miscalculated the actual location of the bridge road way and hit his front right wheel in a gap in the bridge. This flipped the vehicle and threw the driver and his passengers into the middle of the bridge. Now comes the reason no cell phones are allowed. Instead of using his radio to call in the accident to his CO he called his buds back at base camp to come and get him. They came took some pictures on their cell phones to include the woman who had broken her arm in 2 places and was noticeable shaken by the accident. To make things worse, his buds sent the pictures, to include a nice video, home to their spouse’s. They also took the women and her child to the local clinic and paid her $20 for her trouble. As a result one spouse contacted their local news and paper with the story and pictures and video. These pictures were used that night on the local news. I was contacted the next day by the USARSO Chief of Staff to find out why I had not reported the accident as soon as I was notified of it. Apparently, the State Adjatant General, he is the Commander of the National Guard within his State, and he wanted to know about the accident reported on the news. Things went down hill from there. ",
            "date": "Answered February 17, 2018",
            "views": "699",
            "upvotes": " View 166 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Claudia Quiroz",
                    "user_href": "/profile/Claudia-Quiroz-18"
                },
                {
                    "user_id": "Zach Adamus",
                    "user_href": "/profile/Zach-Adamus"
                },
                {
                    "user_id": "Petra Brinkhoff",
                    "user_href": "/profile/Petra-Brinkhoff"
                },
                {
                    "user_id": "Judith Johnston",
                    "user_href": "/profile/Judith-Johnston-14"
                },
                {
                    "user_id": "Jennifer Pecci",
                    "user_href": "/profile/Jennifer-Pecci"
                },
                {
                    "user_id": "Lisa Johnson",
                    "user_href": "/profile/Lisa-Johnson-1053"
                },
                {
                    "user_id": "Melissa Friis",
                    "user_href": "/profile/Melissa-Friis"
                },
                {
                    "user_id": "Madeleynis Polanco",
                    "user_href": "/profile/Madeleynis-Polanco"
                },
                {
                    "user_id": "GEmma SHrebuh",
                    "user_href": "/profile/GEmma-SHrebuh"
                },
                {
                    "user_id": "Trang Le",
                    "user_href": "/profile/Trang-Le-56"
                }
            ]
        },
        {
            "author_info": {
                "name": "Greg King",
                "href": "/profile/Greg-King-28"
            },
            "answer_text": "no it is a scam so you dont hear his nigerian accent it is a scam it is a scam it is a scam scam scam scam scam ………………. Saying they are on a Peace Keeping Mission, looking for an honest woman, parents deceased, wife deceased, child being cared for by nanny or other guardian, profess their love almost immediately, refer to you as \"my love,\" \"my darling\" or any other affectionate term almost immediately, telling you they cannot wait to be with you, telling you they cannot talk on the phone or via webcam due to security reasons, or telling you they are sending you something (money, jewelry) through a diplomat. Finally, they claim to be a U.S. Army Soldier; however, their English and grammar do not match that of someone born and raised in the United States. Here are answers to some of the most common types of scams: 1. Soldiers and their loved ones are not charged money so that the Soldier can go on leave.2. No one is required to request leave on behalf of a Soldier.3. A general officer will not correspond with you on behalf of a Soldier planning to take leave.4. A general officer will not be a member of an internet dating site.5. Soldiers are not charged money or taxes to secure communications or leave.6. Soldiers do not need permission to get married.7. Soldiers do not have to pay for early retirement.8. Soldiers have medical insurance for themselves and their immediate family members (spouse and/or children), which pays for their medical costs when treated at health care facilities worldwide - family and friends do not need to pay their medical expenses.9. Military aircraft are not used to transport Privately Owned Vehicles.10. Army financial offices are not used to help Soldiers buy or sell items of any kind.11. Soldiers deployed to combat zones do not need to solicit money from the public to feed or house their troops.12. Deployed Soldiers do not find large sums of money and do not need your help to get that money out of the country.Where to go for help Report the theft to the Internet Crime Complaint Center (IC3) (FBI-NW3C Partnership). Online: http://www.ic3.gov/default.aspx Report the theft to the Federal Trade Commission. Your report helps law enforcement officials across the United States in their investigations. Online: http://www.ftc.gov/idtheft By phone: 1-877-ID-THEFT (438-4338) or TTY, 1-866-653-4261 By mail: Identity Theft Clearinghouse, Federal Trade Commission, Washington, DC 20580 Report the fraud to the Federal Trade Commission on Nigerian Scams. Email: spam@uce.gov. ",
            "date": "Answered June 5, 2018",
            "views": "128",
            "upvotes": " View 36 Upvoters",
            "upvoters": [
                {
                    "user_id": "Ericka Villaluz",
                    "user_href": "/profile/Ericka-Villaluz"
                },
                {
                    "user_id": "Kimberly Thompson",
                    "user_href": "/profile/Kimberly-Thompson-438"
                },
                {
                    "user_id": "Nneka Gill",
                    "user_href": "/profile/Nneka-Gill"
                },
                {
                    "user_id": "Marchel Lim",
                    "user_href": "/profile/Marchel-Lim"
                },
                {
                    "user_id": "Petra Brinkhoff",
                    "user_href": "/profile/Petra-Brinkhoff"
                },
                {
                    "user_id": "Danielle Michelle Rush",
                    "user_href": "/profile/Danielle-Michelle-Rush-2"
                },
                {
                    "user_id": "Julie Woodbridge",
                    "user_href": "/profile/Julie-Woodbridge-2"
                },
                {
                    "user_id": "Abegail Detablan",
                    "user_href": "/profile/Abegail-Detablan-1"
                },
                {
                    "user_id": "Osunam Pang",
                    "user_href": "/profile/Osunam-Pang"
                },
                {
                    "user_id": "Mara Isabela",
                    "user_href": "/profile/Mara-Isabela"
                }
            ]
        }
    ]
}