{
    "title": "Is it true that chartered accountancy is getting phased out? - Quora",
    "tags": [
        "Accountants",
        "Accounting"
    ],
    "response": [
        {
            "author_info": {
                "name": "Chetan Jain",
                "href": "/profile/Chetan-Jain-86"
            },
            "answer_text": "If you mean getting phased out as a profession than I would say “NO”. In fact the profession is getting more and more evolved along with the Indian Economy and assuming more larger and niche responsibilities. In fact Chartered Accountants have the exclusive right to certify the financial statements of any organisation in our country and it is one domain which has strict barriers to entry for any other profession. While Auditing and Certifying Financial Statements provides the profession exclusivity, at the same time Chartered Accountants also provide services like tax and business law litigation, financial consultancy etc. Chartered accountancy is the only course which provides us with the basic knowledge in a large variety of topics covered under the commerce stream right from finance to business and taxation laws. There are a plethora of areas from which a freshly qualified chartered accountant can choose to specialize himself. And being a correspondence course it can be pursued from anywhere in India with minimal cost. This is the reason why it is a sought after course in Tier 2 and Tier 3 cities. And I believe in the near future chartered accountants will find themselves more dominant in the corporate world because India is on a path to become a developed country and with that our compliance systems will become more stringent and presentation of financial statements will continuously evolve like the recent adoption of Ind As. Then there are other avenues also such as the capital Markets where a Chartered Accountant can be the best person to fundamentally analyse a company’s Balance sheet. In fact most of the big names in the Indian Stock market have Chartered Accountancy as their Qualifications. And from what I have witnessed in my immediate business environment chartered accountants are also encroaching in areas which were earlier considered to be the domain of lawyers like providing consultancy in matters of corporate laws and other allied business laws other than Taxation laws(because tax consultancy is already considered a specific domain for Chartered Accountants). Being from a Tier 2 City I had limited practical exposure during my articleship so the above answer is only in that context but I am pretty sure that in metros there are a lot more areas along with those above mentioned where a Chartered Accountant can Practice his Craft and skills. So for the near future at least Chartered Accountancy isn’t going to be phased out but it will definitely evolve. ",
            "date": "Answered August 7, 2018",
            "views": "23",
            "upvotes": " View 27 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Rumit Tanna",
                    "user_href": "/profile/Rumit-Tanna"
                },
                {
                    "user_id": "Vaishnavi P",
                    "user_href": "/profile/Vaishnavi-P-49"
                },
                {
                    "user_id": "Tanmay Dandekar",
                    "user_href": "/profile/Tanmay-Dandekar"
                },
                {
                    "user_id": "Srijita Sengupta",
                    "user_href": "/profile/Srijita-Sengupta-8"
                },
                {
                    "user_id": "Nitin Jain",
                    "user_href": "/profile/Nitin-Jain-293"
                },
                {
                    "user_id": "Akshay Kabra",
                    "user_href": "/profile/Akshay-Kabra-8"
                },
                {
                    "user_id": "Chirag Jain",
                    "user_href": "/profile/Chirag-Jain-371"
                },
                {
                    "user_id": "Natarajan Balasubramanian",
                    "user_href": "/profile/Natarajan-Balasubramanian-6"
                },
                {
                    "user_id": "Vaibhav Jain",
                    "user_href": "/profile/Vaibhav-Jain-1104"
                },
                {
                    "user_id": "Vishnu Vardhan",
                    "user_href": "/profile/Vishnu-Vardhan-1443"
                }
            ]
        },
        {
            "author_info": {
                "name": "Anurag Uppal",
                "href": "/profile/Anurag-Uppal-3"
            },
            "answer_text": "It is not correct if we say that CA profession is greatly getting phased out. Still analysing the requirement of economy there is a huge scope for CA professionals. As we know that there are many government and private companies that provide jobs with good package. The aspirants can become employed in a firm as an employee or can start their own private practice. There are many scopes or jobs for those students who are pursuing Chartered Accountant Course. The CA played an important role in the organisation and duties of CA like Auditing & Assurance, Tax Consultancy, Accounting Services, Accountants & Finance Outsourcing and Financial Reporting. Every registered firm or organisation under the Company Act, have a CA that manages various tasks like Finance Managers, Financial Controllers, Financial Advisers or Directors and audit their accounts. After becoming a CA, there are various job opportunities. Charter accountancy is a professional degree course which offers a lot of career options and opportunity with the best salary in hand. Below describes career options. The GST Service Provider is an emerging job after the implementation of the GST in India. The company or person having some taxation knowledge and even if he/she is not a CA can join this field. They can help millions of small companies, vendors, shops, and business establishments to make business registrations, upload an electronic invoice, file on a technology platform, and help them understand things and procedures related to GST. It’s a ground reality that though the GST has been rolled out but the majority of people are still not aware of the different segments of this taxation framework. Hence, in this commotion, where there is a lot of hue and cries about GST and its procedures a well knowledged GST Service Provider can be their rescue. Thus after implementation of GST CA profession is one of the most demanding profession in the market. It can’t be said chartered accountancy is phasing out at least for 8–10 years from now. ",
            "date": "Answered August 7, 2018",
            "views": "359",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Farzana Sayed",
                    "user_href": "/profile/Farzana-Sayed-18"
                }
            ]
        }
    ]
}