{
    "title": "Is it possible to thank someone without using the word 'thanks' written? - Quora",
    "tags": [
        "Thanking",
        "Gratitude"
    ],
    "response": [
        {
            "author_info": {
                "name": "Vinod Sehgal",
                "href": "/profile/Vinod-Sehgal-6"
            },
            "answer_text": "Using the word ‘thanks’ is a gross way to express your gratitude. Though it is difficult to replace ‘thanks’, but there are many subtle ways of telling someone that you are really grateful. You have to develop the art of communication which enables you to express the same emotion in different ways. Let’s take different ways of thanking people without using the word ‘thanks’. However if you use it along with these sentences, they becomes more emphatic. Example 1. Someone offers you a help. You can express your emotion by saying/writing : ‘That’s very kind of you’. Example 2. Someone helps you to solve your problem of math. You may express yourself by saying/writing : ‘It’s really nice of you to solve this problem for me’. Example 3. You’ve left your friend’s house after an enjoyable dinner party. You can express your ‘thanks’ by texting : ‘It’s been a wonderful evening’. Example 4. You, on behalf of your colleagues, have to express your gratefulness to a speaker X , who has given you a talk on Yoga. You can do it by saying or writing him later : ‘Mr X, we’d like to express our gratitude for a wonderful talk on Yoga’. Or ‘Mr X, we are grateful to you for your wonderful talk on Yoga’. It is not necessary that you should use only the gross words for a particular emotion. You need to have a subtle understanding of your emotion. Only then you’ll be able to use different and subtler ways to express the same emotion that suit the situation you are in and the people you are with. ",
            "date": "Answered March 30, 2018",
            "views": "19",
            "upvotes": " View 7 Upvoters",
            "upvoters": [
                {
                    "user_id": "Tushar Raj",
                    "user_href": "/profile/Tushar-Raj-36"
                },
                {
                    "user_id": "Kuldeep Singh",
                    "user_href": "/profile/Kuldeep-Singh-3211"
                },
                {
                    "user_id": "Vishav Vir Singh Ahlawat",
                    "user_href": "/profile/Vishav-Vir-Singh-Ahlawat"
                },
                {
                    "user_id": "Tamanna Singh",
                    "user_href": "/profile/Tamanna-Singh-27"
                },
                {
                    "user_id": "Aakash Sharma",
                    "user_href": "/profile/Aakash-Sharma-28"
                },
                {
                    "user_id": "Ashita Sharma",
                    "user_href": "/profile/Ashita-Sharma-8"
                },
                {
                    "user_id": "Dinesh Deshmukh",
                    "user_href": "/profile/Dinesh-Deshmukh-5"
                }
            ]
        },
        {
            "author_info": {
                "name": "Paul Zink",
                "href": "/profile/Paul-Zink"
            },
            "answer_text": "Of course it’s possible! There are many expressions and circumlocutions that say “thank you”, from “what you did was so wonderful” to “I really and truly appreciate the gift, and the kind thoughts that came with it”—etc. You just need to use your imagination and brush up on your English language skills. ",
            "date": "Answered March 26, 2018",
            "views": "365",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Judy Rofe",
                    "user_href": "/profile/Judy-Rofe"
                }
            ]
        },
        {
            "author_info": {
                "name": "Joseph McFaul",
                "href": "/profile/Joseph-McFaul"
            },
            "answer_text": "I’m very grateful for your attention to this answer. I appreciate it very much. ",
            "date": "Answered March 26, 2018",
            "views": "165",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Kriti Dixit",
                    "user_href": "/profile/Kriti-Dixit-16"
                }
            ]
        },
        {
            "author_info": {
                "name": "Ted Nuechterlein",
                "href": "/profile/Ted-Nuechterlein-2"
            },
            "answer_text": "My all time favorite is: “Thank you for thanking me for thinking of you”. There is no ‘thanks’ in that sentence! ",
            "date": "Answered March 26, 2018",
            "views": "182",
            "upvotes": "0"
        }
    ]
}