{
    "title": "Is it okay for a white author (me) to write a POC character? - Quora",
    "tags": [
        "Fictional Characters",
        "Writers and Authors",
        "Race and Ethnicity"
    ],
    "response": [
        {
            "author_info": {
                "name": "Joshua Millins",
                "href": "/profile/Joshua-Millins"
            },
            "answer_text": "Shouldn't be any issues if race isn't a predominant factor throughout the book. I've seen books where the authors obviously made race the sub lingual factor throughout the books an they're absolutely horrid pieces that I refuse to call a novels. Let alone name them! On a cynical note did you make them a poc for the sake of adding color to an overly white palette scheme. If so then your friend is actually correct, diversity just for the sake of it can be downright insulting depending on if it was a slap job or carefully thought out. Hell changing a Male character to female character can be harmful as well if done solely to be diverse so in that regard there's no difference in that situation. Because when creating characters write them as they deserve to be not to meet diversity. But it's not based off what you're chosen ethnicity is but on how you write there's to be. No doubt your friend means well (or is an sjw flunky). But if you only can write about your color, race and sexual orientation then novel writing is considerably impossible because most authors and writers make pocket characters. Now onto constructive words beyond assurances. Though you're correct that race/color isn't as important in a fantasy setting, But that's not true overall. Depending on how far out there you go on world building other ethnicities become almost mandatory because if everyone was white, western culture homogeneously then that world fails as a result. By adding diversity you not only add representation (provided it's not horrid sterotypes) but add depth into this new world you've designed. Nothing is duller than a homogeneous country/continent. Always be true to your characters nothing is worse than disingenuous characters. Amongst other concerns if they're poc in a predominately white area not used to seeing foreigners then we get into sticky areas that are also grey areas. Because people fantasy or real will point out a poc in areas they are rare. If its ports/ trade city then notice would likely be unremarkable. Culture and morality also come into play. Is the culture very isolationist and nationalistic or very open and accepting of new concepts. Those need to be factored in as well. ",
            "date": "Answered August 3, 2018",
            "views": "429",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Jasper A. Tugók",
                    "user_href": "/profile/Jasper-A-Tugók"
                },
                {
                    "user_id": "Andréa Billo",
                    "user_href": "/profile/Andréa-Billo"
                }
            ]
        },
        {
            "author_info": {
                "name": "Elena Piatti",
                "href": "/profile/Elena-Piatti"
            },
            "answer_text": "Is it okay? Sure. What you want to do, is be a good writer, and research so that you don’t come across as accidentally insulting or offer a poor depiction of your character without meaning it. But research is needed for many aspects of a book anyway, so what’s one more? ",
            "date": "Answered August 4, 2018",
            "views": "75",
            "upvotes": "0"
        }
    ]
}