{
    "title": "Is it okay for an author to ask for story ideas from people, then when those ideas are implemented, give credit? - Quora",
    "tags": [
        "Writers and Authors"
    ],
    "response": [
        {
            "author_info": {
                "name": "Rosemary E Williams",
                "href": "/profile/Rosemary-E-Williams"
            },
            "answer_text": "I write books and articles discussing various aspects of US law. My treatise is several volumes and I include strategies, sample pleadings and such that originated with colleagues. I always give attribution, and always ask for written permission to include it in my work with attribution. To me, it is a matter of courtesy, personal integrity and respect for the generosity of other practitioners. In the realm of both fiction and non-fiction works, it is customary for authors to credit the contributions of others. I once read an author who thanked a person for teaching aword fighting techniques. I think authors generally have an understanding of the importance of others’ contributions, including story ideas, characters and so on. In general, authors inderstand that writing is hard work and appreciate help, that all of us have teachers, mentors and contributors, and welcome the chance to say thank you. But always ask first. There can be reasons why a person would not want public acknowledgement, and it is not the author’s business why. Ask and proceed accordingly. ",
            "date": "Answered December 4, 2017",
            "views": "183",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Jasper Thomas",
                    "user_href": "/profile/Jasper-Thomas-13"
                }
            ]
        },
        {
            "author_info": {
                "name": "Scott Hughey",
                "href": "/profile/Scott-Hughey-1"
            },
            "answer_text": "The easiest part of writing is usually the story ideas. The hard part is turning an idea into a compelling story with conflict and believable characters, that makes the reader want to find out what happens next. I don't know that it's unethical to ask for ideas. It's certainly morally correct to acknowledge assistance. I just don't know how helpful going to others as you've suggested woukd actually be. I know of writers who actively discourage this type of “help.” ",
            "date": "Answered December 4, 2017",
            "views": "179",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Holly Root-Gutteridge",
                    "user_href": "/profile/Holly-Root-Gutteridge"
                },
                {
                    "user_id": "Nojus Mohan",
                    "user_href": "/profile/Nojus-Mohan"
                },
                {
                    "user_id": "Neha Tanwar",
                    "user_href": "/profile/Neha-Tanwar-11"
                }
            ]
        },
        {
            "author_info": {
                "name": "Deborah Ross",
                "href": "/profile/Deborah-Ross-6"
            },
            "answer_text": "Actually, this happens all the time. We recognize that we’re getting ideas and perspective from other people all the time. As authors, though, we put them together into original stories in unique ways. It’s isn’t okay to copy a story word for word, or situation for situation, and pass it off as original. That’s called plagiarism, aka cheating. ",
            "date": "Answered December 4, 2017",
            "views": "106",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Kamila Miller",
                    "user_href": "/profile/Kamila-Miller-2"
                },
                {
                    "user_id": "William Jackson",
                    "user_href": "/profile/William-Jackson-277"
                },
                {
                    "user_id": "Karen Williams",
                    "user_href": "/profile/Karen-Williams-19"
                },
                {
                    "user_id": "Marva Dasef",
                    "user_href": "/profile/Marva-Dasef"
                }
            ]
        },
        {
            "author_info": {
                "name": "Sarah Bowman",
                "href": "/profile/Sarah-Bowman-28"
            },
            "answer_text": "This is two questions. Is it okay for an author to ask for story ideas from people I think many authors get ideas from a variety of people. then when those ideas are implemented, give credit? I think you are asking: Should an author give credit to people whose ideas are used in the story? All I have to go by is the work of others. Many authors do. Look in the front or back of a book for either: author’s notes, oracknowledgementsI have learned a great deal about the lives and work of authors by reading those notes and acknowledgements. Not every novel has such a section but I always look for it. ",
            "date": "Answered December 4, 2017",
            "views": "117",
            "upvotes": " View 3 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Joseph M. Obyx",
                    "user_href": "/profile/Joseph-M-Obyx"
                },
                {
                    "user_id": "Eddy Alvarez",
                    "user_href": "/profile/Eddy-Alvarez-1"
                },
                {
                    "user_id": "Matthew Rivers",
                    "user_href": "/profile/Matthew-Rivers-5"
                }
            ]
        },
        {
            "author_info": {
                "name": "Judy Rofe",
                "href": "/profile/Judy-Rofe"
            },
            "answer_text": "You only give credit where it’s due. You don’t need to document in your manuscript or foreword or acknowledgements where the idea for your book came from. The idea was the base foundation. Whether you use it or not, is your choice. The meat of the story came from your imagination. You wrote the book. The credit, therefore goes to you. ",
            "date": "Answered January 8, 2018",
            "views": "45",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Joseph M. Obyx",
                    "user_href": "/profile/Joseph-M-Obyx"
                }
            ]
        },
        {
            "author_info": {
                "name": "Emilia Magdalene",
                "href": "/profile/Emilia-Magdalene"
            },
            "answer_text": "I think the more courteous way is to tell them first that you're planning to write something, and that you're trying to get ideas from them. Then ask if they're OK with acknowledging/mentioning that it is based from them. As some are fine with telling stories to one person but not comfortable with the thought that a lot of people would know that its from them. ",
            "date": "Answered December 5, 2017",
            "views": "24",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Dave Payton",
                "href": "/profile/Dave-Payton-1"
            },
            "answer_text": "Thanks for the A2A. This isn’t something I’d personally do, but I suppose a writer could, as long as you made clear the intent to use, and credited said individual with the idea, in the book. ",
            "date": "Answered December 4, 2017",
            "views": "64",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Fasoranti Damilola",
                    "user_href": "/profile/Fasoranti-Damilola"
                }
            ]
        }
    ]
}