{
    "title": "Is it necessary in formal letters to write subject? - Quora",
    "tags": [
        "Writing Letters",
        "Writing Advice"
    ],
    "response": [
        {
            "author_info": {
                "name": "Peter Green",
                "href": "/profile/Peter-Green-189"
            },
            "answer_text": "Is it necessary in formal letters to write subject? In one of the original Winnie the Pooh stories, Eeyore losses his tail and it is eventually found serving as a bell rope at Wol's place. Wol has a sign up instructing visitors to knock if an answer is required and to ring if an answer is not required — the point being that the bell rope is not connected to anything. Similarly, you can send a formal letter without a subject line if an answer is not required, because lack of a subject line certainly risks not having the letter connected to anything. You can, indeed, send a letter without a subject line, written on pilfered toilet paper, scribbled with a thumbnail dipped in tar, and m myriad other ways, and you might even achieve what you want. But why ring the bell when you want what knocking is more likely to obtain? The step that people often neglect to consider is that the person to whom you address a formal letter is almost always not the first person who reads it. That duty usually falls to a mail clerk or a secretary who doesn't have the time to read your letter. I don't have a correspondence secretary, and I am pastor of a quite small church. Sunday is a day when few Christian organisations or large businesses e-mail, yet I had 51 e-mails to one account and, I think, 12 to the other today (Sunday). I don't know what most of them were about because their subject line was either too lacking or excessively long. If I can't tell immediately what they are about, they risk never being seen. The same happens to mail clerks. They do the sorting, and deliver the mail to the right person or to the right in tray. If that person can't work out immediately where your letter goes, it might go into the under-desk file. Don't take unnecessary risks. ",
            "date": "Answered February 24, 2019",
            "views": "34",
            "upvotes": " View 5 Upvoters",
            "upvoters": [
                {
                    "user_id": "Reena Upadhyay",
                    "user_href": "/profile/Reena-Upadhyay-18"
                },
                {
                    "user_id": "Osama Malik",
                    "user_href": "/profile/Osama-Malik-36"
                },
                {
                    "user_id": "Rabiya Haramain",
                    "user_href": "/profile/Rabiya-Haramain"
                },
                {
                    "user_id": "David Deitsch",
                    "user_href": "/profile/David-Deitsch"
                },
                {
                    "user_id": "Anne Benzow",
                    "user_href": "/profile/Anne-Benzow"
                }
            ]
        },
        {
            "author_info": {
                "name": "Dave Stafford",
                "href": "/profile/Dave-Stafford-5"
            },
            "answer_text": "No, it is not necessary. This is optional; it will help get your letter read if you are writing to someone that gets a lot of mail. IF you do not use a subject line, then you’d best get to the point of the letter in the opening sentence/paragraph. if not, your letter may not receive proper attention for importance. Two examples: Complaint on RX350 Paint (subject line) ”I am writing to you, directly, about the ‘peeling and flaking’ problems with the recent repainting job done on my Lexus RX350 by your restoration department. This was done on a warranty claim on February 4, 2019, service order RX13579.” (Opening sentence/paragraph) Personally, I might just use both to reinforce the message. Hope this answers the question. ",
            "date": "Answered February 22, 2019",
            "views": "11",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Mgk Ram",
                "href": "/profile/Mgk-Ram"
            },
            "answer_text": "Yes It is always recommended to use the formal letters to write the subject. The person at the receiver end will first look for the subject. There by he can easily identity the content inside it all about what. Also it is recommended to write the subject in a readable font and it has to be easily readable size. By default if you are using a email application it will highlight the subject of the mail with bigger size font. Also it will have a default font. The subject speaks about the content of the main document. So one needs to be careful in writing the subject that relates with the content. Thank you. MGK ",
            "date": "Answered March 14, 2017",
            "views": "31",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Reena Upadhyay",
                    "user_href": "/profile/Reena-Upadhyay-18"
                },
                {
                    "user_id": "Misbah Mirza",
                    "user_href": "/profile/Misbah-Mirza"
                },
                {
                    "user_id": "Judy Weinsteiger",
                    "user_href": "/profile/Judy-Weinsteiger-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Achyut Soman",
                "href": "/profile/Achyut-Soman"
            },
            "answer_text": "It is. Formal letters are generally addressed to government officials, dignitaries etc. Being busy, they don’t have enough time to read lengthy letters. Such letters are to be very precise and to the point. Hence ‘subject’ is must. From the very subject they get to know about your grievances. But the subject has to be short and underlined so as to get noticed easily. ",
            "date": "Answered March 12, 2017",
            "views": "18",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Shashishekhar Sinha",
                "href": "/profile/Shashishekhar-Sinha"
            },
            "answer_text": "Absolutely. A formal letter has to be complete in all respects. The subject is an important component of the formal letter since it apprises the reader of the contents in the letter. The reader would proceed to read accordingly. Subject can, therefore, be treated as a preface of a book. In other words it gives an identity to the contents of the letter. Hence its importance. ",
            "date": "Answered March 11, 2017",
            "views": "23",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Theodore L Simone",
                "href": "/profile/Theodore-L-Simone"
            },
            "answer_text": "Formal letter is a form of writing a letter. It can be written in a structured format. The basic structure of formal letter is same whether you writing by hand or using computers. Formal letters, they includes the subject and the subject is what it is informs the reader. Formal letters or business letters both are same. There are two main types of business letter styles: block style and Administrative Management Style. Block style is the commonly used formal letter format. It has a salutation and closing, and is good for letters to businesses you are applying to or someone you have met before. AMS style is better for internal memos and situations where you have to be very direct. Formal letter includes; Address the concerned person, with her full address, and Write the present date, a Subject that should include the purpose of the letter, address the person with salutation, body of the letter, signing with your signature, name, designation, phone number. ",
            "date": "Answered March 8, 2017",
            "views": "51",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Reena Upadhyay",
                    "user_href": "/profile/Reena-Upadhyay-18"
                },
                {
                    "user_id": "Joby John",
                    "user_href": "/profile/Joby-John-78"
                }
            ]
        },
        {
            "author_info": {
                "name": "Hetvi Mehta",
                "href": "/profile/Hetvi-Mehta-7"
            },
            "answer_text": "Yes indeed it is.We often write former letters to people who are at higher posts and they have less time.A subject line in a formal letter explains matter in the shortest way possible and saves theirs time and ours.People who have less time find it a benefit to understand the matter by just reading the subject and taking action ",
            "date": "Answered March 9, 2017",
            "views": "605",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Justin J Cruz",
                "href": "/profile/Justin-J-Cruz"
            },
            "answer_text": "A subject line is not really necessary. You may want to use one, however, so that the reader immediately knows what your letter is about. A business or formal letter should be written in a tone that is slightly more formal than your everyday language. Avoid the following: slang or jargon; contractions such as I'm, can't, it's; and vague words such as good and nice. Be polite and respectful, even if you are complaining. ",
            "date": "Answered March 9, 2017",
            "views": "14",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Rishikesh Fulari",
                "href": "/profile/Rishikesh-Fulari-1"
            },
            "answer_text": "Formal letters are written mainly for professional cause and therefore unformal questions like “How are you?” or “Is everything allright” are unimportant and useless. When coming to professionalism, we need to be “To the point” and exact. It is therefore always convenient to write ‘subject’ in a formal letter. So that the receiver gets a quick summary of what exactly the purpose is behind sending the letter. ",
            "date": "Answered March 11, 2017",
            "views": "11",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Jawahar Prasad",
                "href": "/profile/Jawahar-Prasad"
            },
            "answer_text": "Yes, of course.Without writing subject, your letter will not be accepted officially, whether you are writing to water department or Police station or to multinational company or school also. It will be rejected. Without subject, there will be no clearance what the letter is explaining . ",
            "date": "Answered March 11, 2017",
            "views": "14",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Pushpal Tayal",
                "href": "/profile/Pushpal-Tayal"
            },
            "answer_text": "Definetly it is. Formal letters are to someone you do not know( mostly) . So , it becomes absolutely necessary to give an underlying idea about your purpose of writing ",
            "date": "Answered March 12, 2017",
            "views": "374",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Anusha Vsp",
                "href": "/profile/Anusha-Vsp"
            },
            "answer_text": "One word answer : ABSOLUTELY Subject was introduced in letters to make sure the right letters received the right attention. If you skip subject, be cool with the letter not being read. A subject lets you know the gist of the letter as a whole. ",
            "date": "Answered March 15, 2017",
            "views": "3",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Chandra Mouli",
                    "user_href": "/profile/Chandra-Mouli-420"
                }
            ]
        },
        {
            "author_info": {
                "name": "Jaya Nair",
                "href": "/profile/Jaya-Nair-27"
            },
            "answer_text": "Yes. It is very important to write subject in formal letters as it gives the reader(who might be a busy person) an idea about the reason you are writing the letter. Hope it helps. ",
            "date": "Answered March 12, 2017",
            "views": "130",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Sharayu Dange",
                "href": "/profile/Sharayu-Dange"
            },
            "answer_text": "Yes, it is necessary to write the subject in formal letters. These types of letters are written for high authorities and having a subject helps them determine just how important the contents are. ",
            "date": "Answered March 9, 2017",
            "views": "391",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Sai Laxman Morisetty",
                "href": "/profile/Sai-Laxman-Morisetty"
            },
            "answer_text": "For formal letters it is compulsory because if the reader has a habit of prioritizing his emails then it is very helpful for him by get to know what the mail is about ",
            "date": "Answered March 11, 2017",
            "views": "940",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Shyamlendu Arya",
                    "user_href": "/profile/Shyamlendu-Arya"
                }
            ]
        }
    ]
}