{
    "title": "Is it too risky to write about overcoming an eating disorder on a college application? - Quora",
    "tags": [
        "Eating Disorders",
        "Mental Illness",
        "Mental Health"
    ],
    "response": [
        {
            "author_info": {
                "name": "Sarah Moll",
                "href": "/profile/Sarah-Moll-3"
            },
            "answer_text": "I think you should exercise caution with that particular topic, just because baring yourself to the world (aka the admissions office) is a risky move. They want to know what makes you tick and the kind of person you are, in your own unique way. This isn’t going to sound good, but eating disorders are a generally negative experience and can be a difficult topic to spin into a great, in-depth essay. I would focus on a specific topic that has led to the growth of your character, and the journey of that growth. Try to focus on yourself and who you are, and how you ended up being the person you are today, in a narrative format, through a specifically focused topic. ",
            "date": "Answered May 7, 2018",
            "views": "11",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Sophia Mohamed",
                    "user_href": "/profile/Sophia-Mohamed-21"
                }
            ]
        },
        {
            "author_info": {
                "name": "Diana Can",
                "href": "/profile/Diana-Can"
            },
            "answer_text": "Doing so is only seen positively if what you write shows growth in character and maturity from what you experienced or are experiencing in terms of your eating disorder. Be aware of making the essay about how what you learned from your struggles will help you in the future. Don’t make it self-pitying and unoriginal. Don’t just narrate your story, give it meaning. Good luck! P.S. I wrote about my own eating disorder in a college application and was accepted, as well as awarded a scholarship (of course, they took my academic achievements in consideration, too). ",
            "date": "Answered May 8, 2018",
            "views": "960",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/NAZEERKHAN-NK"
                }
            ]
        }
    ]
}