{
    "title": "Is it possible to start a blog for free? - Quora",
    "tags": [
        "Blogs",
        "Blogging"
    ],
    "response": [
        {
            "author_info": {
                "name": "Shaunta Grimes",
                "href": "/profile/Shaunta-Grimes"
            },
            "answer_text": " I know the popular answer is Wordpress or Blogger, but I think if you’re not going to spend the money to actually own your domain, it’s better to start on social media. If I was just getting started as a blogger and had zero dollars to invest, I’d use Medium. It’s free, which is what you’re looking for. It’s also super easy. You don’t have to do any design. Just open an account and write your first post. Voila! You can easy connect on Medium with friends you follow on Facebook and Twitter, which gives you a head start in the audience department. It’s relatively easy to publish with a Medium publication, which puts you in front of a wider audience. Medium is designed to be super shareable, so even without much of an audience of your own, if you write well and write consistently, you’ll have a chance of having a post gain some traction. I had a post get more than 80,000 views on Medium when I had fewer than 100 followers. You can add a free account at MailChimp to manage your email list and another one at Upscribe to make free forms to put in your Medium posts, to collect email addresses. I think it’s way more important to own your email list than it is to own your blog. Here’s the strategy I’d use (it’s the one I actually do use): Open an account at both Medium and Quora.Use Quora to explore blog topics. Check for questions in areas that interest you, that have some upvotes and followers. If people are paying attention and showing interest in a question, they’ll pay attention when you write about it in a blog post.So, write about it in a blog post on Medium.Check out some Medium publications and submit your posts to them. Be patient and don’t give up if your first attempts aren’t successful. If you keep writing, eventually Medium publications will come to you and ask if they can publish your work.Write on Medium at least once a week. Three times a week is better.Answer a question a day on Quora. Crosspost your best answers to Medium.Add an Upscribe form to the bottom of every Medium post. Remember: building an email list of readers is your goal.Link to your Medium profile in your Quora profile.Email your list twice a month: once to share cool stuff you didn’t write and once to share cool stuff you did. This is a good starter plan for how to use your email list. You might eventually get to where you’re emailing more often. A weekly newsletter with links to your Medium posts isn’t a bad idea.When you’re ready to put a little money into your blogging, go with a blog where you own the domain. (So: yourblog(dot)com instead of yourblog(dot)wordpress or blogger(dot)com.)By this time, you’ll have a better idea of who your audience is and what you want to write. Copy some of your best Medium posts to your new blog.Keep writing. Consistency is king.Good luck! Love,Shaunta P.S. Want to be a Ninja Writer? Start with this free 31 day challenge. ",
            "date": "Answered March 18, 2017",
            "views": "35",
            "upvotes": " View 14 Upvoters",
            "upvoters": [
                {
                    "user_id": "Shraddha Gupta",
                    "user_href": "/profile/Shraddha-Gupta-374"
                },
                {
                    "user_id": "Akash Pundhir",
                    "user_href": "/profile/Akash-Pundhir-1"
                },
                {
                    "user_id": "Rubal Kaur Chhabda",
                    "user_href": "/profile/Rubal-Kaur-Chhabda"
                },
                {
                    "user_id": "Suchana Maity",
                    "user_href": "/profile/Suchana-Maity"
                },
                {
                    "user_id": "Yogesh Rao",
                    "user_href": "/profile/Yogesh-Rao-17"
                },
                {
                    "user_id": "Andy Cai",
                    "user_href": "/profile/Andy-Cai-30"
                },
                {
                    "user_id": "Ann O' Connell",
                    "user_href": "/profile/Ann-O-Connell-1"
                },
                {
                    "user_id": "Sathiya Soundraraman",
                    "user_href": "/profile/Sathiya-Soundraraman"
                },
                {
                    "user_id": "Julie Amidon-Conklin",
                    "user_href": "/profile/Julie-Amidon-Conklin"
                },
                {
                    "user_id": "Teresa Lee Tan",
                    "user_href": "/profile/Teresa-Lee-Tan"
                },
                {
                    "user_id": "Karen King",
                    "user_href": "/profile/Karen-King-10"
                },
                {
                    "user_id": "Nicole Bianchi",
                    "user_href": "/profile/Nicole-Bianchi-1"
                },
                {
                    "user_id": "Amy Crumpton",
                    "user_href": "/profile/Amy-Crumpton-2"
                },
                {
                    "user_id": "Shashwat Sinha",
                    "user_href": "/profile/Shashwat-Sinha-8"
                }
            ]
        },
        {
            "author_info": {
                "name": "Rajan Patel",
                "href": "/profile/Rajan-Patel-274"
            },
            "answer_text": "I Am Earning 1000–1500 $ per Month So I Am Able To Answer This Question. If You Want To Creat Free Blog Than Choose Blogger It Is Best Plateform For Blogers Step-by-step Guide to Creating a Free Blog on BlogSpot: To create your free BlogSpot blog site, head over to Blogger.com and login using your Google account. If you don’t have a Google (gmail) account, you can create one for free. For a first time user, you will see an option to use the identity from your Google Plus profile, or you can use your limited BlogSpot profile. I recommend using your Google Plus profile. Once you are logged in, click on “new blog” or click on this link to directly go there: Creat New Blog . Name your blog: The first thing you need to do is add a name and select your domain. I suggest you read “How To Select a Domain Name” for additional information. Avoid using your personal name as the domain name, and instead use some generic domain name that you can brand later with a custom domain. You can then select a blog template (you can change it anytime), and click on “Create Blog”.  Now your blog is created, but you are not done yet! There are a few settings that you need to set on your newly created BlogSpot blog to make it easy to use. You are now on the BlogSpot dashboard where you will see your blog’s backend. From here you can go to “Settings” and make changes to Improve Your Blog visibility. Here is a screenshot of what you should be seeing:  From here you can click on “Posts” > “New post” and start writing your very first blog post! But before you write your first post, I would recommend that you go to “Pages” and create at least one “About” page describing who you are and what your blog is about. Most importantly, you should change your blog’s template as the default one is generic and boring (in my opinion). that you can download and install on your blog. Alternatively, you can go to “Settings” > “Template” and change the template from there. On this page, you can also add a logo to the header of your BlogSpot blog, and add or remove various other features.  Once you have a few blog posts up and running, you can go to “Settings” > “Earnings” and enable Adsence for your blog. This will allow you to earn money from your free BlogSpot blog.  So your blog is almost ready and you can start writing posts. There are just a few more things I suggest you do. ",
            "date": "Answered March 25, 2020",
            "views": "1",
            "upvotes": " View 10 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Mahima Prajapat",
                    "user_href": "/profile/Mahima-Prajapat"
                },
                {
                    "user_id": "Aakriti Lakhanpal",
                    "user_href": "/profile/Aakriti-Lakhanpal-1"
                },
                {
                    "user_id": "David Van Wert",
                    "user_href": "/profile/David-Van-Wert-3"
                },
                {
                    "user_id": "Altaaf Khan",
                    "user_href": "/profile/Altaaf-Khan-18"
                },
                {
                    "user_id": "Aagam Shah",
                    "user_href": "/profile/Aagam-Shah-186"
                },
                {
                    "user_id": "Rithick",
                    "user_href": "/profile/Rithick-3"
                },
                {
                    "user_id": "Paul Gabriel",
                    "user_href": "/profile/Paul-Gabriel-85"
                },
                {
                    "user_id": "Sam Pawar",
                    "user_href": "/profile/Sam-Pawar-8"
                },
                {
                    "user_id": "Kiran Sindhwal",
                    "user_href": "/profile/Kiran-Sindhwal-1"
                },
                {
                    "user_id": "S. Shruti",
                    "user_href": "/profile/S-Shruti"
                }
            ]
        },
        {
            "author_info": {
                "name": "Michael Gorman",
                "href": "/profile/Michael-Gorman-12"
            },
            "answer_text": "If cost is the major consideration of your blogging project, then of course you have a lot of options these days. You have all of the free 3rd party public blogging sites, if you do a basic Google search: “Free blogging sites” you will discover these. Many famous and successful bloggers have started out in this way, plus of course you have a blogging area on your Quora account, you can set up your own blog and derive the SEO power of this site to be distributed. There are many options to write, and publish without needing to spend money on the WWW. But, as with most things, if you value the objectives of your blogging, you will obtain significantly better outcomes if you invest a little in good quality resources. Self hosted blogs are your own brand, and you can determine your own editorial policies! This whole area of the self-hosted, privately owned ‘blog’ is one that has the most power, because you are in fact building your own identity, your own presence. Back in the days of ‘analog’ publishing, it was enormously expensive and difficult to get your work, ideas, creations in front of a significant audience. Publishing was an exclusive, and highly regulated industry, because it has enormous influence over large numbers of people, the various markets for published content were served by distinctive and very powerful publishing ‘houses’, or organizations. With the WWW, or the internet as it is collectively known, we have the incredible opportunity of completely by-passing the legacy ‘gatekeepers’ of publishing. I don’t think this aspect of ‘blogging’ is fully appreciated by a lot of people. Essentially, the industry of publishing has been eclipsed, disrupted, challenged, replaced, all of these terms refer to the internet as being the global ‘middleman’ for private publishers. It is like a mind-set proposition, if we can adjust our perspective to fully appreciate the global publishing house of the WWW we can see many opportunities and occasions for presenting unique, and very high quality writing, discussions of science, results of independent research, political ideas, social movements, inventions, critiques of policy, and commentaries of many different types. For writers, professional people, researchers, journalists, philosophers, artists, authors, drama writers, political pundits, columnists, editors, observers, writers of fiction, the entire spectrum of human involvement, blogging offers you a means to build your own particular publication. Blogging is an absurdly ineffective word. What we mean when we start describing blogging is an enormously dynamic, creative and intellectually vibrant culture. Having the opportunity to produce your own content, and have it distributed very widely, and to targeted audiences is a miraculous advancement in the field of publishing. We just haven’t fully understood the scope of this opportunity yet. Or, I should say that the complete appreciation of the entire range of opportunities for publishers have not yet trickled down into the many nooks & crannies of society. It is clear that some people have fully grasped the occasion, and produce wonderful work. I see it as a part of my job, as an advocate, and champion of digital media to illuminate people about the potential they are missing out on, I develop high quality publications for talented, capable, involved people who seek to have their work presented and distributed. I guess I am a part of the new breed of publishing enablers. I provide the technical means, the support of this technology, the security and web ‘fire-power’, the practical means to produce and the creative support to promote, and syndicate. You have many different platforms, many different tools and frameworks with which to produce your content, and target a specific segment, your own audience. Nothing happens unless you begin, and once you begin it all becomes much clearer to you, you will wonder why you did not begin much sooner than you have. ",
            "date": "Updated April 24, 2019",
            "views": "22",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Mahima Prajapat",
                    "user_href": "/profile/Mahima-Prajapat"
                },
                {
                    "user_id": "Sam Pawar",
                    "user_href": "/profile/Sam-Pawar-8"
                },
                {
                    "user_id": "Norbu Lepcha",
                    "user_href": "/profile/Norbu-Lepcha-11"
                },
                {
                    "user_id": "Eileen Hernandez",
                    "user_href": "/profile/Eileen-Hernandez-23"
                }
            ]
        },
        {
            "author_info": {
                "name": "Kristiyan Uzunchev",
                "href": "/profile/Kristiyan-Uzunchev"
            },
            "answer_text": "Hello, So you want to start a blog. That’s great! Not only is blogging a great pastime, but with a blog you can express yourself in a unique way, help others with problems you’ve overcome, establish yourself as an expert, and even make money. If you’re new to blogging, I will give to you a fast, foolproof guide to starting a blog, without having to learn HTML or waste your time reading long, boring tutorials. In fact, over 9,500 people have already setup blogs using this guide written by Karen Evans! Here’s 5 easy steps how to start a blog: Add posts and pagesStart growing your blogChoose a blogging platformRegister a domain name and hostingDesign your blogThe goal is to help you get started the right way. I’ve found that many people make mistakes when starting a blog, sometimes resulting in them abandoning the project altogether. We don’t want that to happen. I’m going to walk you through the entire process of setting up your self-hosted blog, so you ‘get it right the first time. Step 1: Choose the right blogging platform (WordPress) Before you can even start worrying about how your blog will look like, you’ll need to choose your blogging platform.  There’s a lot to choose from. You are able to create a blog with many different blogging platforms, such as WordPress, Tumblr, Blogger and more… However, given that there are over 72 million active users using WordPress today, it’s clear which platform is the boss. Even my own blogs and sites are built with WordPress blogging platform. Here’s why: It’s FREE for everyone to use (including themes, layouts and add-ons that many other blogging platforms don’t provide).It’s super easy to set up.It’s secure; WordPress is always updating their software and keeping everything sound and secure, so there’s rarely a worry of having your blog come under hacking attacks. No wonder Facebook, NASA and even university blogs are using WordPress.It’s HIGHLY customizable. There are hundreds of free themes and plugins that add more functionality to your blog, from contact and subscribe boxes to plugins that improve blog performance and more.While the other blogging platforms are generally all pretty OK, nothing in my opinion has ever come close to matching the freedom and customization options that WordPress offers. So without a doubt, go with WordPress. Especially when you are just starting out. Why you shouldn’t create a blog on a free blogging platform Without a doubt, you need to self-host your WordPress blog. Think about it – what famous, successful blogger you know is using a free blogging website instead of their own domain name? It’s not just that – free blogging platforms have other problems too – including… You don’t control your content – the blogging platform does. They could shut you down any time, and for any reason.The web address of your blog will be long and hard to remember instead of a catchy, branded address you choose.You’re not allowed to advertise on most free blogging platforms, making it much harder to ever make money from blogging.All of these limitations apply to the WordPress.com: Create a website or blog blogs. What you really want is to self-host a WordPress blog – it’s the same software without all the limitations! If I were you, I’d start with a self-hosted blog on my own domain from day one. Setting up a blog like this is WAY easier and less expensive than you think. Finding a domain name and web hosting provider To set up a self-hosted blog on your own domain name, you’ll need two things: Domain name – This will be your personal blog address where people find you over and over again. For example Google’s Domain is Google. Your new blog domain name will be http://www.YourBlogName.com, except you’ll choose what’s going to be behind YourNewBlog. The cost of a domain name is usually $10/year, but if you follow this guide all the way, I’ll show you how to get one for much cheaper. Web hosting – This will be the home of your blog address and content that’s on the blog. Without web hosting, you’ll be unable to use your domain. Think of it as a computer hard drive that stores all your content on your blog (images, blog posts and so on). The cost of web hosting is usually somewhere between $2-5 per month. It’s less than an XL coffee at Starbucks, so it won’t break the bank. But it’s an important investment to your blog success. Where should I get my domain name and hosting? When it comes to hosting, there are only two things that matter. Page load speed – The average amount of time (in seconds) it takes your blog to load.Uptime – 99.9% isn’t enough (it’s 42 minutes of downtime per month). You should be aiming for 100%.There are hundreds of different web hosting providers. They all offer you a similar service (domain + hosting) with a similar price, but since I’ve dealt with and monitored many famous and recommended web hosting companies like Bluehost, iPage, Godaddy etc… I now only use and recommend www.HostGator.com for domain names and web hosting. Why? Nothing has ever come close to HostGator in terms of blog load speed and uptime (see below): HostGator has great performance, they are easy to use and it’s probably the best pick for beginners. However, you can always go with another web hosting as long as it’s fast, reliable and offers unlimited storage & bandwidth. This helps you to avoid problems later on. Step 2: Set up a Blog on your own domain name (self-hosted WordPress) At the end of this step (2), you will have a fully working self-hosted WordPress blog on your own domain name! Sounds promising, huh? If for some odd reason you don’t want to use HostGator, you can always choose another hosting provider. I can’t promise they’ll be that good, but the registration and the set up process should be some what similar. 1. Go to www.HostGator.com and then click “Start Your WordPress Blog”. 2. Pick a Domain name for your blog Already have a domain name?Just write it in the right box (I already own this domain) and keep moving to the next step by scrolling down a bit. How do I choose a good domain name? Choosing a bad domain name is one of the most common mistakes I see bloggers make. Be sure you choose a domain name that is… 1. Easy to Remember – Don’t choose a nonsense name, something tough to spell, or a long name full of dashes. 2. Unique and Descriptive – You want a name that reflects who you are and what you care about. Be creative and build an identity you’re excited about! 3. Trustworthy – Domain extensions like “.com”, “.org” or “.net” are the most popular, with “.com” being the one most people think of first. Try to avoid crazy extensions like “.rocks” or “.biz”, as these are less commonly used, tougher to remember and not as trusted. Type the domain name you want to use in the box, then click “next”. If the name is available, you’ll be able to claim it. If it’s not available, choose another one. If the name you want isn’t available, HostGator will show you some alternatives that are similar – or you can punch in a new name and try again. I’d suggest you to use something that ends with .com, .net or .org 3. Choose your blog hosting plan I recommend the “Hatchling” plan for now – you can always upgrade later if you decide you want more advanced features, but you get more than enough with the Hatchling. 4. Complete your registration Once you’ve chosen Hatchling plan and found a name you like that’s available, you’ll need to register it by putting in your contact and billing information. You’ll also have a chance to customize your package a bit. This is a chance to save some more money, so don’t skip it! Apply discount code “STARTBLOG” I would take a look at each of these additional services to see if you want any of them. I don’t believe they are necessary for you at this stage. 5. Log in to your new account and install WordPress blog It may take a few minutes for HostGator to register your account, so be patient. You should get a confirmation email when your account is ready. Once you’ve logged in to your control panel (all the information you need for that should be on your inbox) , it’s time to install WordPress. Thankfully, this takes just one click! Log-in to your Hostgator control panelAt the top click “Get Started With WordPress Today”If WordPress isn’t there for some reason, scroll down a little bit on the control panel and click on “Quick Install” under the Software & Services section. Look at the top of the page, in the left sidebar section for WordPress.Once clicked, you’ll be automatically transferred to http://Mojomarketplace.com – don’t panic, this is just a site that helps HostGator install platforms (like WordPress). You should immediately see a screen where you’re offered to “Install” or “Import” WordPress.Click “Install” to get to the next step. When you’re finished, “Install WordPress”. Once you’ve done that, you’ll see a loading bar at the top of your page that will eventually tell you that your WordPress blog has been installed and you’ll see your log-in credentials. 6. Log in in and check out your new blog Once the installation completes, you’ll get an email that shares your login information, including an “Admin URL”. (In case you missed that notification bar) To log in to your blog, click the admin URL. If you forget this URL, it’s simply http://www.yourblog.com/wp-admin (where “yourblog” is your domain name). Congratulations – you now know how to make a blog using WordPress. You’ve installed WordPress and set up your blog, all on your own! As you can see, it was really easy and straightforward. Step 3: Designing your blog In this section, I’ll show you some WordPress blog basics, including: Changing your blog’s designInstalling new plugins/featuresMaking your blog search engine friendlyIf you’ve set up your blog, you’re now ready to start using WordPress and customizing your blog. Remember: You can log in to your blog by going to http://www.yourblog.com/wp-admin/ and using the credentials you set up with HostGator or any other hosting company you used. Changing Your Blog’s Design (Themes & Layouts) WordPress blogging platform uses design templates called “Themes” to figure out how your site should look. Changing your blog’s layout and design is as simple as installing a new theme. There are over 2,000 professionally designed, fully-customizable and free themes to choose from – so you’ve got a lot of options. If you want to see premium themes and designs like the Genesis Framework, head over to Website Templates & Themes from ThemeForest Here’s how to find and install a theme you love: When you log in for the first time, you’ll see a dashboard or admin panel: Mouse-over the “Appearance” tab in the WordPress sidebar, then click on “Themes”. On the next screen, you’ll see several themes are already installed. If you don’t like those, click the “Add New” button at the top, or the great big “Add New” square to start searching for a theme. Now, you’ll see tabs where you’ll find featured, popular and brand new themes, as well as a “Feature Filter” and search bar. I really like the “Feature Filter” option, because you can choose themes in certain color schemes, select specific layouts and even choose themes with built-in advanced features. Just choose the options you want, then click “Apply Filters” on the left hand side. If you’re finding this challenging, just search by keyword – there’s no wrong way! When you’ve found a theme you like, click “Install”. You’re nearly done! Once the theme has been installed, all that’s left to do is click “Activate” on the next screen: Configuring your blog to be search engine friendly There are some things you’d need to do to make your blog more search engine friendly. Search engines do not like two things: 1. Ugly and clumsy URL-s In order to change your links to a more cleaner, click on the “Settings” -> “Permalinks” and use the following settings: 2. Spam comments – Unfortunately, lots of people want to leave automate spam comments on your blog. They do that for couple of reasons – to get people from your blog to their blog and to advertise their services/products. To avoid that, make sure you moderate your comments. Here’s how to do that: Go to “Settings” -> “Discussion” and tick those two options.  Step 4: Adding/Writing Blog Posts and Pages By now you should have fully working WordPress blog on your own domain name. You should also have a custom blog theme that fits with your blog’s topic. Congratulations – you’ve done a LOT and I’m proud that you’ve managed to get so far. In the LAST step, I’ll show you how to write your first blog post and share some tips for writing blog posts.In this section, I’ll show you… How to write a post inside WordPressHow to add images, links and format textSome quick tips and tricks for writing great contentUsing WordPress to Blog Adding a New Post To add a new blog post, click the “Posts” section on the left hand side-menu, then click on “Add New”. On the next screen, you’ll see something like this:  You can add the title to your blog post in the top field, and your content goes in the big text box below the title. You can save your draft or publish your content live by using the box menu on the far right of the page. You can even schedule the post to be published later – or make the post private so only friends can see it.  Once published, your new post can be found in the “All Posts” section of the “Posts” tab, so you can edit it any time. Let’s take a quick look at some things you can do to spruce up your post: Adding Images To add an image to your post, click the “Add Media” button right above the lower content field. Tip: Before you click “Add Media”, be sure you’ve left your cursor inside of your blog post where you want the image to show up. Otherwise, you’ll have to move it later on.  Next, click the “Upload Files” tab on the screen that pops up, then click “Select Files”. Once you’ve found the file, double click it and WordPress will upload it automatically. When the upload is finished, make sure the image you want is selected, then click the “Insert into post” button to add the image to the post you’re writing. Adding a Link Linking out to other websites is a great way to build relationships and share interesting content. To add a link, click on the icon in the toolbar that looks a bit like a chain link. On the pop-up, you’ll need to enter a few important bits of information.  URL is the web address of the link you want to share. Make sure you include “http://” before the “www.” address, or your link will be broken.“Link Text” is the text you want people to click on to get to your link. It might be “Click here”, or anything you choose.“Open link in a new window/tab” – it’s a smart idea to check this box. Otherwise, when someone clicks your link, they’ll leave your blog.If you want to link to an existing page, you can use the “Search” section to find a post or page you’ve already created and click it to add a link.Finally, click “Add Link”, and your link will be added where you left your cursor in the post you were writing. Adding Headers & Editing Text It’s a good idea to use headers and bolding to make your content easier to read and scan. Adding Headings To add a heading, click on the drop-down menu on the bottom left of the toolbar. Try to only use “Heading 1” once within your page (usually at the top), and use “Heading 2” or “Heading 3” for other sections in the copy, as this is better for search engines. Tip: You can also highlight the text you want to change in your blog post, THEN click on the dropdown menu and select the format you want the text to be in. Editing Fonts You can also bold, italicize, underline and even change the colour of your text in a click or two.  “B” is for bolding“I” is for italics“U” is to underline your text“A” will open a dropdown menu where you can select font colorAs you can see, this is all pretty simple for someone who has worked with Microsoft Word. Step 5: Start Growing Your Blog Now that you have set up your blog and know the basics, it’s time to make your blog successful. Many beginners struggle at that point, thus I’ve put together a handful of guides to get you going easier. How can I increase my Blogger SEO?How do I get to the next level in blogging?I hope you have been helpful!!! Good luck! ",
            "date": "Answered August 2, 2017",
            "views": "26",
            "upvotes": " View 5 Upvoters ",
            "upvoters": [
                {
                    "user_id": "David Van Wert",
                    "user_href": "/profile/David-Van-Wert-3"
                },
                {
                    "user_id": "Rahul Patil",
                    "user_href": "/profile/Rahul-Patil-926"
                },
                {
                    "user_id": "Ashwin Kotadia",
                    "user_href": "/profile/Ashwin-Kotadia"
                },
                {
                    "user_id": "Leo Smile",
                    "user_href": "/profile/Leo-Smile"
                },
                {
                    "user_id": "Amir Saleh Shehu",
                    "user_href": "/profile/Amir-Saleh-Shehu"
                }
            ]
        },
        {
            "author_info": {
                "name": "Roderick Holbrook",
                "href": "/profile/Roderick-Holbrook"
            },
            "answer_text": "Click here to get cheap and best SEO tools for make blog What is a blog anyway? In short, a blog is a type of website that focuses mainly on written content, also known as blog posts. In popular culture we most often hear about news blogs or celebrity blog sites, but as you’ll see in this guide, you can start a successful blog on just about any topic imaginable. Bloggers often write from a personal perspective that allows them to connect directly with their readers. In addition, most blogs also have a “comments” section where readers can correspond with the blogger. Interacting with your readers in the comments section helps to further the connection between the blogger and the reader. This direct connection to the reader is one of the main benefits of starting a blog. This connection allows you to interact and share ideas with other like-minded people. It also allows you to build trust with your readers. Having the trust and loyalty of your readers also opens up the door to making money from your blog, which is something I discuss later in this guide. Should you start a blog?  One of the misconceptions about starting a blog is that you need to be a great writer to be successful. Nothing could be further from the truth. People read blog sites to get a personal perspective on things, so most bloggers write in a very informal and conversational style. In addition, you don’t need to be an expert on your topic in order to have a successful blog. For example, readers of a cooking blog don’t want to read a textbook from a food scientist, they want to hear the experiences of someone who has actually cooked some real meals, mistakes and all. To be successful as a blogger there is really just one requirement: a passion for your topic. At its heart, blogging is about sharing your knowledge with the world. Choosing a topic that you are passionate about makes the process of starting a successful blog so much easier. Writing about more than one topic is totally fine too. As long as you are writing about things that you are genuinely interested in, your passion will shine through and keep your readers interested. So why would you go to the trouble of blogging? There are a few reasons: Make money from home. Blogging can be quite lucrative if done correctly. The top bloggers in the world obviously earn quite a bit, but even a part-time blogger can expect to make a nice profit if things are done correctly. The best part about it is that blogging is a form of passive income, since you can spend just a few hours a week writing a blog post and then continue to make money from it long after the blog post is written. I go into much more detail on how to blog for money later in this guide.Share your story. A blog allows you to have a voice and be heard. You can share your story with the entire world if you so choose. One of the most common ways blogs are used are as a diary where the blogger writes about their daily experiences so that friends, family, and others can all be a part of their lives.Recognition for yourself or your business. No, you probably won’t have paparazzi following you around because of your latest blog post. But a successful blog makes your idea into a reality, and can gain you a ton of recognition in your respective field. Many bloggers are known as experts just because of their blogs, and some have even gotten book and movie deals based on their blogs.Find a community. Blogging at its heart is interactive. You write a blog post and people comment on it. This is a great way to connect with people who are interested in the same things as you are. Blogging allows you to teach these people based on your experience, and it gives you the opportunity to learn from your readers as well.How to sign up for WordPress hosting at Bluehost For beginners, we recommend the cheap Basic plan because it packs plenty of power for your fledgling blog. Click the SELECT button to start the process:  On the next screen, enter the domain name you want to use for your blog in the new domain box and click Next. Remember – you get this for free:  On the final screen, you’ll need to enter basic account and billing details at the top:  As you scroll down, you’ll see a Package Information section at the bottom. Here, you can choose how many years of hosting service to purchase, as well as any add-ons that you want. While Bluehost will check some of these add-ons by default, you can safely de-select them:  ",
            "date": "Answered May 15, 2020",
            "views": "199",
            "upvotes": " View Sharers",
            "upvoters": [
                {
                    "user_id": "John Blue",
                    "user_href": "/profile/John-Blue-1"
                },
                {
                    "user_id": "Shaheryar Ehsan-i-Haque",
                    "user_href": "/profile/Shaheryar-Ehsan-i-Haque"
                },
                {
                    "user_id": "Bill Davis",
                    "user_href": "/profile/Bill-Davis-44"
                },
                {
                    "user_id": "Galamo Stella",
                    "user_href": "/profile/Galamo-Stella"
                },
                {
                    "user_id": "Chris Prakoso",
                    "user_href": "/profile/Chris-Prakoso"
                }
            ]
        },
        {
            "author_info": {
                "name": "Janice Person",
                "href": "/profile/Janice-Person"
            },
            "answer_text": "I read this as \"can someone start a blog for free?\" so if I made a wrong interpretation, please let me know.  There are lots of free platforms for bloggers to use -- wordpress.com and Google's blogspot are probably the most widely used in the U.S. Each of those platforms offer blogging services for free but as blogs grow, the services become limiting in my experience.  I found it was helpful to start on a free platform though as I could find out whether blogging really was a fit for me. Later I transferred to a wordpress hosted blog, which offers me a lot more options in running plugins, etc. Here's a post that will explain a bit more of my thinking on that http://janiceperson.com/personal-insight/rethinking-my-blog-hosting-strategy-charting-a-new-course/ ",
            "date": "Answered August 5, 2015",
            "views": "477",
            "upvotes": " View 5 Upvoters",
            "upvoters": [
                {
                    "user_id": "Namrata Hattalli",
                    "user_href": "/profile/Namrata-Hattalli"
                }
            ]
        },
        {
            "author_info": {
                "name": "Wp Hound",
                "href": "/profile/Wp-Hound"
            },
            "answer_text": "Do you want to start a blog?  All in all, would you say you are thinking about how to begin a blog? I’m so happy you’re here! I will likely disclose the essential strides to get off to a decent and effective blogging begin, no specialised experience required.1. Get Your Own Hosting Provider and domain name The initial step is to get yourself an area name and blog have. The space name is the manner by which individuals discover your blog and the host is the place the majority of your records are found on the web. I prescribe SiteGround to every single new blogger. It is the host I initially utilized when I began and they have all day, every day live support and in addition giving you free area name enlistment in the event that you buy for at least two years. SiteGround is as of now offering perusers a tremendous reduced rate on the 12-month starter arrange. 2. One Click Install for WordPress The next step is to install the blogging program that you will use to post, edit, upload images and so on. WordPress is the most popular blogging platform in the world. It is free once you have signed up with SiteGround and can be installed with one-click. 3. Move Ahead with WordPress Since you have begun your blog you’ll need to hop in front of the use of WordPress. This implies rapidly finding out about WordPress subjects, site improvement and how to compose astounding substance that pulls in supporters. Look at the post beneath for all the vital tips. 4. Growing Your Mailing List with MailChimp This is a reward venture for any individual who is not kidding about utilizing their blog to bring home the bacon. You have to grow a mailing list. A dynamic rundown of email endorsers will advance your post and will ideally bolster your items or whatever it is you do later on. I prescribe MailChimp to store your mailing list. You are done! Enjoy blogging… Do you want to start a blog? - WP Hound ",
            "date": "Answered October 12, 2017",
            "views": "755",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "E Kathleen O'Reilly",
                    "user_href": "/profile/E-Kathleen-OReilly"
                },
                {
                    "user_id": "Tomas Boyd",
                    "user_href": "/profile/Tomas-Boyd"
                },
                {
                    "user_id": "Jessica",
                    "user_href": "/profile/Jessica-1071"
                },
                {
                    "user_id": "Alan Barrett",
                    "user_href": "/profile/Alan-Barrett-24"
                },
                {
                    "user_id": "Kari Boyd",
                    "user_href": "/profile/Kari-Boyd-3"
                },
                {
                    "user_id": "Maria Sereda",
                    "user_href": "/profile/Maria-Sereda-1"
                },
                {
                    "user_id": "Martha Kelly",
                    "user_href": "/profile/Martha-Kelly-16"
                },
                {
                    "user_id": "Tom Webb",
                    "user_href": "/profile/Tom-Webb-76"
                },
                {
                    "user_id": "Levi Torres",
                    "user_href": "/profile/Levi-Torres-1"
                },
                {
                    "user_id": "Vivian Jachson",
                    "user_href": "/profile/Vivian-Jachson"
                },
                {
                    "user_id": "Joleen Jordan",
                    "user_href": "/profile/Joleen-Jordan"
                },
                {
                    "user_id": "Timothy Bryant",
                    "user_href": "/profile/Timothy-Bryant-30"
                },
                {
                    "user_id": "Jonell Atchison",
                    "user_href": "/profile/Jonell-Atchison"
                },
                {
                    "user_id": "Aditya Raka",
                    "user_href": "/profile/Aditya-Raka-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Mike Allton",
                "href": "/profile/Mike-Allton"
            },
            "answer_text": " There are lots of platforms you can use for free to start your blog, from WordPress and Blogger to Medium and LinkedIn. The first question you have to ask though is this: Why are you starting a blog? If it’s for fun, I recommend Medium as it’s easy to use and requires zero setup on your part. Just create an account and publish whenever you wish. If it’s for business, then you need to re-think how you’re about to proceed. Are you blogging to establish your authority? Are you hoping to promote your business? Or are you planning to monetize your blog content? If any or all of those things are true, you cannot proceed with a free blog. First, you do not own a free blog - it’s a free subscription somewhere that can be taken away from you at any time for any reason. If you’re just blogging for fun, there’s not much risk there. But if you’re working hard at creating content to build a business and suddenly it’s all gone, that should be a terrifying and paralyzing thought. Note: this is not dramatic hype designed to irrationally frighten you. Posterous, a free blogging site like Tumblr that was bought by Twitter and was the home of 4 million bloggers was ultimately shut down. At least those users had some notice and time to grab their content! Others whose accounts have been incorrectly flagged and suspended on various platforms aren’t as lucky. Second, a free blog designed to build authority or make money will perform extremely poorly. Because your audience can tell you’re using a free platform. Just ask yourself, when was the last time you bought something from a Tumblr blog post? The Best Way To Start A Professional Blog If you plan to use your blog for business purposes and want to set it up for success, there’s a process you’re going to need to follow. And it’s going to require a minimal investment on your part. You need to determine: Who Is Your Blog For?What Is Your Blogging Voice?What Platform & Host Will You Use?How Often Will You Blog?What Will You Blog About?How Will You Grow Your Audience?How Will You Monetize Your Blog?This is something that I’ve written about and taught about at length. I actually put together a primer to help you navigate these questions: How To Start A Blog: The Ultimate Guide. The point here is this: taking a few extra days or weeks now to think hard about what you want to accomplish and the best way to get there will save you tremendous amounts of time and energy in the future. Rather than waste time using a free platform that has no long-term potential, or writing about topics that are off the mark, you can make sure that your blog gets the best possible start from Day One. ",
            "date": "Answered December 6, 2017",
            "views": "494",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Edward Martinez",
                "href": "/profile/Edward-Martinez-212"
            },
            "answer_text": "Use Ahrefs to make a blog When I decided to start a blog back in 2008, I had no idea where it would take me. Over a decade later, I can honestly say that starting this blog was one of the BEST decisions I’ve ever made! Mind you, it’s been through a LOT of changes. I’ve had three URLs (a mistake that I learned from), at least 10 different designs/layouts, and updated topics and categories over the years. However, what’s remained constant is having a place to share what I’m best at—writing recipes and teaching online business—that attracts millions of visitors each year. When’s the best time to start a blog? NOW. Yes, now. Like, today. Even if you don’t have 100% clarity on what you want your blog to be or look like, that’s ok. It will constantly evolve, grow and change with you, and that’s a good thing. Here’s why now is the best time to start a blog: Google loves history: 70% of all web traffic comes from organic Google searches. Meaning, people land on a webpage from searching on Google (not from social media or another link). And, Google loves a good blog post with HISTORY. That means that the sooner you start blogging, the more time you’ll have to build that history. Imagine if you would have started your blog a year ago—or even six months ago! You’d have all that history under your belt.Your blog will grow and evolve with you: I can’t stress this enough—no one really has their blog 100% figured out from the beginning. So many people tell me they want to start a blog, but hold off because they aren’t totally sure what their niche is or how to blog. We all start that way! Once your blog is up and running you can make as many tweaks as you want. Let it grow and evolve with you. Clarity comes from ACTION, not just “thinking about doing it someday.”Once you have a blog and start to gain traffic, your options are endless: There are tons of ways to monetize a blog, either through selling your own products or courses, utilizing affiliate programs, allowing an ad network, or doing sponsored posts. But here’s what most people miss: get the blog up and running before you decide which of those you want to do! Getting your blog up and running is what will allow for the rest of those things to happen. Don’t put the cart before the horse. Start your blog now. Also, if you happen to already have an online course or business, that’s great. You can start blogging now to increase your organic reach. My online courses get thousands of free leads via organic Google searches landing on blog posts, and you can, too.Now that you’re ready to start a blog, you have two options: Do it yourself. It’s actually pretty easy, and I give you the exact steps below. I had no money when I started so I literally did it all myself. I just Googled each step or used the free tutorials on the provider’s website and made it happen.Outsource the technical piece of getting up and running. This has become so much easier over the last five or so years. If the tech stuff stresses you out, or you just can’t figure something out, you can hire someone inexpensively on Fiverr or Upwork to do it for you.Whichever you choose, here are 10 steps to get you started. I suggest doing one each day for 10 days if you need to squeeze this in on the side. Or, you can really get all of this done in a day if you sit down and binge through it. If you do it yourself, you should be able to start a blog for around $100 or less. You’ll have to pay for hosting (the big server that “hosts” your blog) and a few other elements, but in general, most things are free or very inexpensive to start a blog. Steps 1-9 here are all (mostly) one-time things. Sure, you’ll update your design over the years and may upgrade the technical aspect, but most of these are things you just have to do once. From there, you’ll just be on step 10 (the fun part!)—writing posts to update your blog. ",
            "date": "Answered May 15, 2020",
            "views": "116",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Matthew Stephen",
                "href": "/profile/Matthew-Stephen-13"
            },
            "answer_text": "You can start a free blog on several platforms. But most of them come with several limitations. However, you can still succeed blogging for free. I’ve seen countless people do that. And most of them did it using blogger.com. The popular FREE blogging platforms you can find around are: Tumblr Blogger.com - Create a unique and beautiful blog. It’s easy and free. WordPress.com: Create a free website or blog Free Website Builder | Create a Free Website | Wix.com Medium – Read, write and share stories that matter There are several other free blogging platforms. But I advise you to stick to either WordPress or Blogger. Most preferably, Blogger. I will explain why I prefer these two platforms and why you must too. There are basically four things you need to purchase when you start a blog HostingDomain namePremium themesISP Data Plans: I had to include data plans. It costs more than what some hosting providers charge.While you can avoid the others, Paying for data plans may be unavoidable. Also, depending on what you really mean by the word FREE. FREE to you may mean not paying for any of the things I’ve mentioned above. To another it may be a little different. For this guide, I will take it that you don’t want to pay for Hosting, themes and domain names. Domain name: Both WordPress and blogger provides you with a free blogname.wordpress.com and blogname.blogsopt.com respectively. So, you don’t really need to buy a domain name before you start publishing. Hosting: Your free blog is attached to any free platform you choose to blog on (subdomain). So, you don’t need to purchase hosting. Themes: All free platforms provide you with a wide range of free themes to choose from. So no need to purchase any theme. Depending on what you want to achieve from your Free blog, my WordPress vs Blogger review provides answers to all of your questions. I will go over a few important points here. Free WordPress Pros: Largest community of bloggers in the world.User-friendly dashboard.Beautiful free themes.Free blog setup and maintenance.Cons: You can’t use custom themes and pluginsBlog monetization limitations: AdSense as we all know, is the biggest contextual advertisement company in the World and the first option for most bloggers. However, you are not allowed to add AdSense codes to your blog.Upgrade is really expensive: When eventually, you decide to setup a custom domain on your free blog, use custom domain themes and pugins, you have to upgrade from the free plan. But it is quite expensive for anyone not earning much online.Blogger: You can learn everything there is to know about blogger in my Blogger review. I will still go on and highlight a few important points here. Pros: Owned by Google.Wider range of monetization options: AdSense and Blogger are both owned by Google. So to sign up with AdSense using your free blog is really easy. All you have to do is play your own part by developing your free blog properly and writing quality blog posts.Free custom upgrades: You can use custom themes and domain names without having to pay a dime to blogger.Custom themes are way cheaper compared to WordPress.SEO friendly: Even free blogspot blogs rank very high on Google. Provided you write quality articles that actually deserve to rank. By default, your free blog is automatically added to Google Search Console and sitemaps are generated, all for FREE.Cons: A smaller community of bloggers compared to WordPressDefault themes not so fancyLook of the dashboard not very appealing.From the above points, I have made it obvious that the best option for you if you are looking to make money blogging for FREE is blogger. But truth be told… There are several limitations that come with blogging for free. You get to abide by several rules and regulations, terms and conditions.Most free platforms do not permit promotion of affiliate products.You can easily get banned without any warnings if you violate any of their terms and conditions.On blogger, it is very easy to stay safe blogging for FREE though. My advise is, your FREE shouldn’t be so FREE. Upgrade your blogger blog to a custom domain. You don’t have to pay anything to Blogger to do so. Your Question is not very clear, though. you didn’t make it obvious what your blogging for FREE aims are - whether to get readers or to make money online. Whichever it is, I hope the answers provided to your question prove sufficient. ",
            "date": "Answered April 18, 2018",
            "views": "224",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Garry Crowder",
                "href": "/profile/Garry-Crowder-1"
            },
            "answer_text": "Pick a blogging platform. When I say “platform,” I mean the software you’ll use to run your blog. You’ve got lots of options: WordPress, Wix, Weebly, and Squarespace to name just a few. WordPress is your best option if you want to start a blog on a platform that… Is beginner-friendlyMakes blogging as easy as writing an emailAllows you to have your own “.com”Has no monthly fees (you only need a host and a domain name)Comes with 5,000+ themes to suit your style, andGives you the power to make money from your blog one day,Choose a host for your blog. Assuming you’ve chosen WordPress as your blogging platform (smart move!) your next step is to choose a web hosting service. Hosting explained in 10 seconds: Your blog is just a bunch of files. WordPress is the software you create them with. And hosting stores those files so they can be viewed through the web. TL;DR – Without hosting, nobody will be able to see your blog online. Decide on a domain name. A domain name is just the address people can find your blog at, like “www.yourblogname.com” I recommend you get the .com if you can, as it’s easiest for most people to remember, but it’s ok to get an ending like .net or .co if your first choice isn’t available. Set up WordPress (the easy way) Good news: now that you’re logged in WordPress is just sitting there, waiting for you! On the first screen you see, you’ll be asked to pick a theme. I recommend you skip this step by clicking the link below the pictures of themes, as I’ll be showing you how to explore more (and better) options later. If you DO choose a theme now, you can always change it later without any problem. Choose and customize your design Finally, the most fun part: it’s time to choose a design you are really excited about. In WordPress, they simply refer to designs as “Themes” – don’t let the language throw you. The good news: You have over 5,000 FREE options to choose from! The bad news: With so many options, you can spend HOURS going down the design rabbit hole. Start writing! The good news is that if you can use Microsoft Word, Pages, or Gmail, writing a blog post in WordPress is just as easy. After that, it is all about attracting people with quality content and using all available traffic tools to help you out create a community around your blog and hopefully grow even more. ",
            "date": "Answered August 30, 2018",
            "views": "93",
            "upvotes": " View 14 Upvoters",
            "upvoters": [
                {
                    "user_id": "Alis Smith",
                    "user_href": "/profile/Alis-Smith-3"
                },
                {
                    "user_id": "Abdul Hakim P",
                    "user_href": "/profile/Abdul-Hakim-P"
                },
                {
                    "user_id": "Shilpa Burman Roy",
                    "user_href": "/profile/Shilpa-Burman-Roy"
                },
                {
                    "user_id": "Joshua Griffin",
                    "user_href": "/profile/Joshua-Griffin-88"
                }
            ]
        },
        {
            "author_info": {
                "name": "Rajdeep Paul",
                "href": "/profile/Rajdeep-Paul-147"
            },
            "answer_text": "Yes, of course, You can start a blog for free anytime when you want just by your Email Id… Google Provides a Free Platform for blogging, and that is Blogger. com Many people start blogging from this platform, even I also start my first blog 5 years ago from this free platform. Today I am working with more than 20 websites but still, I have 4 websites in Blogger. And I am making a decent income from these 4 Blogs also. I just use some custom domains in these Blogs, which costs me Approx rupees 1000 per year per Domain. If you don't want to use a custom domain, then also you can create unlimited Blogs for free, You will get a Blogspot .com Domain with it for free. That means, Your website or blog name will be like yourname.blogspot.com. If you want to change your blog URL yourname.blogspot. com to yourname. com then you need to have a Custom Domain, otherwise, you don't need any custom domain, any hosting, or any other things. you can create unlimited blogs by your Email id for free.. For custom design, you can use free Blogger templates also, and for Email Marketing, you can use Feedburner Free email Subscription service also, its also a free service given by Google. So, at last, I can say You that it is possible to start a blog without investing a single rupee in 2020 also. ",
            "date": "Answered July 28, 2020",
            "views": "139",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Sujoy Mukherji",
                "href": "/profile/Sujoy-Mukherji-1"
            },
            "answer_text": "If you are just getting started with the idea of having your own blog and want to spend no initial investments, then you definitely should start off with Blogger.com To be honest, there are many blogging platforms which offer users the ability to create a free blog. I would not recommend any newbie blogger to start a blog with WordPress. I’m not saying that WordPress should not be considered as your first blogging platform. In fact, WordPress provides you with very cool themes which you can customize and plugins which you can install to run a fully professional running blog. Having a blog with Blogger is free and it does not have any limitations. I am dedicating this article to all newbie bloggers who are new to the world of blogging and would like to start understanding the basics of running a blog. What is Blogger? Blogger is a blogging platform powered by Google. It offers you the opportunity to start a free blog. Blogger formally known as Blogspot is a Google-centric blogging platform. You may wish to check out one of my previous articles about the 4 Powerful Steps to Building a 6 Figure Blog. To start a free blog with Blogger you really don’t need to be tech-savvy as you need very little technical knowledge. To tell you the truth, there are only two top reputed blogging platforms for this 2019 and they are Blogger.com and WordPress.com Why Blogger is Easy-to-Use? Unlike WordPress, where you are required to install different plugins and go through their complicated dashboard, Blogger does not need you to install anything. This the main reason Blogger has become a great alternative for any newbie blogger to start-off free and with no what so ever initial investments. Below the illustrated table, I have highlighted the Pros and Cons of using Blogger as your first free blogging platform – The Pros: Blogger is free of cost and you get a free subdomainThe blog is hosted by Google and you do not worry about anythingThe Blogger interface is very user friendly and you don’t need any basic technical knowledge of running a blogYou only need a Google account to set-up bloggerWith Blogger you can create a blog with no investment and can monetize it with Google AdSenseThe Cons: The Blogger subdomains do not look professional so you have to pay for a custom domainBlogger is not suitable for professional blogging as you do not have enough controlThe Blogger theme can only be customized to a limited extent. There is very little what can be done.Other email accounts can be used to create a blog on BloggerAs Blogger is a free platform you have to follow the terms and conditions. In case you violate any terms your account can be banned and shut down.Creating Your Free Blog with Blogger First, you would need to head over to Blogger.com and login using your Gmail account. To open a Gmail account is Free and you are not required to pay anything. Once you are logged in, click on “new blog”.  Creating Your First Free Blog with Blogger The next step in the process is to create a name for your blog. This will be the title of your blog. Note: You will be required to select an address for your blog to be hosted under the Blogger.com - Create a unique and beautiful blog. It’s easy and free. site URL.  Creating a Blogger address Note: Blogger requires you to comply with EU laws for posting a blog post in their platform. The EU laws require you to give European Union visitors information about cookies and data collected on your blog. In many cases, these laws require you to agree with their EU terms and conditions.  Blogger.com EU Compliance Agreement Terms & Conditions Once you have agreed with the EU Compliance Agreement, it’s time to create your first new post with Blogger. I started my blogging journey with Blogger.com - Create a unique and beautiful blog. It’s easy and free., and later I migrated to WordPress. I will be shortly coming up with a detailed WordPress Guide. My final thought here would be that Blogger is a platform for newbie bloggers which you can use to gain experience. If using the Blogger platform seems too basic for you and you want to take your blog to a professional level then you can always use WordPress. Hope this helps, ",
            "date": "Answered May 2, 2019",
            "views": "752",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Ami Jagajivan Charadava",
                    "user_href": "/profile/Ami-Jagajivan-Charadava"
                },
                {
                    "user_id": "Swarnim Bhardwaj",
                    "user_href": "/profile/Swarnim-Bhardwaj"
                }
            ]
        },
        {
            "author_info": {
                "name": "Tracy Karol",
                "href": "/profile/Tracy-Karol"
            },
            "answer_text": "Different host sites offer free blog hosting. For example, I have for years had a blog through Google’s blogger for absolutely free. It just has the blogger extension http://www.tracylkarol.blogger.com - I used to have one with WordPress but someone took my name and the .com when I let it expire. It was a paid blog. Now I’m trying to migrate everything back to WordPress paid with a Tracy Karol, Author site. But you can also use a free WordPress site with the WordPress extension in it - I have that as well, as a .com, it’s just not set up. Personally I think WordPress is the best blogging software, either free or paid, and if you start free you can always upgrade. Mine is minimal right now because I’m not tech savvy and the host isn’t offering all it said it would, so I need help from a designer once I can afford it. But as you get the hang of it, tagging and key words are really simple and it seems to rank higher than Blogger. Good luck! Be prepared to spend some time getting it set up. I do offer help with editing. And as I said, the free version is fine to start. Though if you expect a lot of traffic, I’d buy the eventual domain you want. It’s not expensive and well worth the trouble of losing it to someone unscrupulous later. I still can’t buy my name back. ",
            "date": "Answered June 4, 2019",
            "views": "73",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Pratik Butani",
                "href": "/profile/Pratik-Butani"
            },
            "answer_text": "You can post info and stories with Blogger. When you use Blogger, make sure you comply with the Blogger Content Policy and Terms of Service. Start using Blogger Make sure your browser uses cookies.Turn Javascript on.Sign in to Blogger.Create a Blogger profile or use your Google+ profile.Create a blog Sign in to Blogger.In the top left, next to \"New blog\" click the Down arrow .Click New blog.Enter a name for your blog.Choose a blog address, or URL.Choose a template.Click Create blog.Change the name of your blog Sign in to Blogger.In the left menu, click SettingsBasic.Next to \"Title,\" click Edit.Enter a new name for the blog.Click Save changes.See how your blog looks To view your blog, go to the top left and click View Blog. Change how your blog looks You can change the design of your blog. Decide who can see or edit your blog You can control who has access to your blog. Explore your blog You can use the left menu to: View your posts, pages, comments, and statistics.Manage earnings, campaigns, and more.Get Blogger updates To get feature announcements, advice, and other info, sign up for email updates: Sign in to Blogger.In the left menu, click SettingsUser settings.Under \"Email Notifications,\" next to \"Feature Announcements,\" choose \"Yes.\"In the top right, click Save settings.Feel free to ask if need any help. Must visit My Blog : Pratik Butani - AndroidButs Thank you. ",
            "date": "Answered June 12, 2017",
            "views": "331",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Jaro Benjulie",
                    "user_href": "/profile/Jaro-Benjulie"
                }
            ]
        },
        {
            "author_info": {
                "name": "Vinay Mundhe",
                "href": "/profile/Vinay-Mundhe"
            },
            "answer_text": "I will tell you exactly how to do it. Even if you have a very little money or not at all to spend on the blog, still you can start a blog and that too like a professional one. You just start a blog on blogger or wordpress. Blogger.com gives more freedom to build a blog or site as compared to wordpress.com without charging you for hosting. (You will thank me later).  So after creating the blog on blogger, you will have an address like this: example.blogspot.com and its fine. You can still create your blog template and layout like professionals and also can place the adsense ads on them and start earning. But if you want to remove .blogspot.com from you domain to make it sound more professional or trustworthy like a brand, then you will have to spend a small amount to buy a domain for your blog or site.  GoDaddy and Bluehost provide domains that costs around $10/yr. But you may get lucky to grab a deal at a low cost. I bought my domain Twenties Madness from GoDaddy at just $1.49 for the first year. After you bought the domain you will have to set it up for your blog. This is easy and you can see how to do that on this blogger help page. That’s it, no extra money needed. And I have created my blog exactly the same way as described above. ",
            "date": "Answered December 21, 2015",
            "views": "647",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Balamani Gandhinathan",
                    "user_href": "/profile/Balamani-Gandhinathan"
                },
                {
                    "user_id": "Chaithanya Varma",
                    "user_href": "/profile/Chaithanya-Varma"
                }
            ]
        },
        {
            "author_info": {
                "name": "Vertika Nigam",
                "href": "/profile/Vertika-Nigam"
            },
            "answer_text": " Having your own blog is the new “new”. If you love to write and do not find any suitable platform to do so, do not sit and repent. Start your own blog and use it to do something good. And, make money alongside. It’ll make you a better writer and will help you express yourself better. Now, the question is: What should be the first step towards creating your own blog? The obvious step you’ll take will be to go for a Google search and type: How to create your own blog: And, the long list of searches will confuse you completely, as they did to me some years back. Everything comes from practice and making mistakes. So, I, after making I-don’t-want-to-remember number of mistakes in the first step itself, have reached a situation where I can suggest you what to do and what not to do. . . Before even starting a blog of your own, the most important decisions that should be taken, that people generally ignore, are: The PURPOSE for having a personal blog (and not going for posting your thoughts on social media to get everyone’s cries)Theme of your blog (called the niche of your blog)With this clearer blog vision, you are partially ready to take a step ahead. Do not worry at all if you don’t know any, literally any, kind of coding knowledge, websites, blogging, software, plugins etc. I’ll make everything easy moving further so that you can also have a blog to display your writing skills. For that, stay hooked to this. Setting up a blog is a task of dedicated 30 minutes. Choose a blog platform If you’re alien to the blogging world, this must have been the first time that you’re hearing the word ‘WordPress’. Yes, I said, W-o-r-d-P-r-e-s-s. Remember this word, for your blogging life ahead. WordPress is a FREE and open source system where you can create your own free websites or blogs. Why do I recommend WordPress? You can get your website hand-coded but for some reasons like high input cost, time and risk of inefficiency and bugs, I’d recommend not to do that. Instead, go for WordPress and make use of the possibilities in front-end design, user-friendliness, cost-effectiveness and the fun part of playing with the plugins. WordPress is not only for small blogs, it has given brilliant websites like Vogue, Mercedes Benz, CNN, New York Times and so much more. Just pick up a design and start decorating your blog, in your own magical way. Other than these, you have following Free options to select from: Tumblr Tumblr will keep you engaged if you involve with the communities with your blog. Blogs at Tumblr are very interesting and super-easy to use. You can use different post styles to share images, videos and quotes, rather than the plain write-ups with had-to-be-followed designs. It is free but includes advertising, that you cannot escape. LinkedIn As well-known to everyone, LinkedIn is a professional website which helps connect people in similar professions, blogging is a new dimension that it provides. If you have a good following on LinkedIn and want to reach out to your customers to expand your business, you can choose this path confidently. This social networking site although allows you to build your own blog, it doesn’t allow everyone to access your content. I’d recommend this place only if you want blogging to affect your business and you don’t really care about the design part of it, because it doesn’t really offers any. Squarespace Squarespace provides the blog building service starting at $8, giving way to a lot of theme options by which you can get beautiful designs without even coding the special features. But, in case you love to code, this is also possible with this. It is a hosted service, not available for free. Medium Currently the neatest and simplest way to start blogging, Medium it is. It is natural to feel that the power of customizing the design of your personal blog and make it more attractive is not given at the hands of the writers. The only areas where the writer can work with the looks are the text, quotes, images and other media. With limitations, a Medium blog can still perform better than others because if it gets loads of recommendations, it can then gather a huge traffic by showing up on the Medium homepage. Isn’t that a great news? Contentful If you are a developer and also need a blog along with it, this will be fun for you. I’m saying this because this doesn’t have anything ready in the name of a blog. You can only create an API of your blog by using Contentful and the interface has to be coded by you, The Developer, to get your posts published from the cloud to the blog. All the tools are provided but the end result from Contentful will be a code representing your blog. The good thing is that you have complete power to give your blog your own design. If you want to learn the full method of how to create your own blog, read the full article here.[1] This was originally published on WitsAndWings[2]. Footnotes[1] How To Create Your OWN Blog – WitsandWings[2] WitsandWings – LifeStyle, Women Entrepreneurship & More",
            "date": "Answered February 24, 2017",
            "views": "25",
            "upvotes": " View 2 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Ramona Seder",
                    "user_href": "/profile/Ramona-Seder"
                }
            ]
        },
        {
            "author_info": {
                "name": "Debasish Ghosh",
                "href": "/profile/Debasish-Ghosh-294"
            },
            "answer_text": "How To Start A Professional Blog In 2019 With 0$ If you want your blog to be a pro, you need to write good content which people can appreciate, write your posts from a reader point of view, write your blog with easy words. The title of a blog post is the most important part, which all new bloggers don't pay attention. Make sure all your blog posts have a catchy title. If you want to rank on google then make sure your title of the blog post attracts peoples attention and they click it.  First, Let's Make A List of What We Need To Start A Blog In 2019 A Creative MindA free Hosting With 0 issuesA beautiful Pro ThemeA Seo Friendly Domain NamePro Bloggers TechniquesA Creative Mind (#1) So what's the big deal with a creative mind? well, let me remind you this is 2019, and you, of course, need to be a creative person in any niche you like, because of the competition. no ones like a copy pasted shit. and obviously, Google will not rank anyone with a stolen blog post.  I know everybody likes something and what can be a better topic then what you like. First, you need to know that you create your blog over one specific topic because Google gives priority to websites that based on a single topic. I mean if you are writing about tech then do not publish any blog post about entertainment. And I know that no one knows everything so, do some research on the internet about that topic and highlight their points, get ideas, but please do not think that about rewriting anybody's blog post, it will not help trust me. The most important fact is you need to satisfy your reader with the most relevant information. Trust yourself that if your competitor wrote a blog post highlighting 10 points, then you can do better, make that blog post 40 relevant points and destroy them. A free Hosting With 0 issues (#2)  Today I am talking about free stuff so I am being honest with you that it's not the best hosting but its certainly, not the worst. If you have money the go for the Bluehost. it's the best hosting in my opinion, but if you need a free hosting with 100% uptime it's blogger.com trust me. you will not get huge features like WordPress but you will have everything you required to start a Pro blog. Now I Am showing Step By Step process how to create a blog with google. Read more For Step By Step process A Beautiful Pro Theme (#3) we are in blogger so their ready-made themes are now kind of sucks and do not have a professional look. So you should start using custom blogger templates, there are lots of free custom bloggers templates out there but choose only responsive templets. I tried many templates in the past and I have a favorite template. and it looks like a pro-Wordpress theme. its called Helio  You can view this theme demo Here: Live Demo Now if you like this template, here is the good news, you can use this template for free. To download this template follow these steps A Seo Friendly Domain Name Finding a domain name is not so easy at all, because first if you have a name in your mind, and you check that domain name and you find out it's been taken. Also if it's not taken how do you know if its Seo friendly or not.  Think about a domain name that is relevant to your blog's topics and within 6-10 characters. Remind a smaller domain name with relevant keyword is a good SEO friendly domain name. And a good domain name sure helps to rank better in google. Pro Bloggers Techniques (#3 important) Amazing Content Ideas It does not matter that if you are a new blogger or old, one day you are going to out of ideas or out of topic, So what will you do that time? should you wait for new ideas to pop up? well, the answer is simple. If You don't publish blog posts continuously I mean if you wait like 20 or 30 days, Google will think that you are not serious about your blog. As a result, you will lose your ranking in google. So what to do now? Trending Topics Have you heard of google trends? if you don't, google gives us a free tool to see what topic is trending on Google. what you have to do now is go to google trends and first choose your country and search for the niche that your writing in your blog and see which blog posts are in the top, read that blog post and create a better version of that blog post. Always write a blog post from readers points of view. So every reader will like it. If you want to know the most important parts, read the full article. Read More ",
            "date": "Answered July 4, 2019",
            "views": "244",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Melissa Salinas",
                    "user_href": "/profile/Melissa-Salinas-27"
                },
                {
                    "user_id": "Rich Smith",
                    "user_href": "/profile/Rich-Smith-118"
                },
                {
                    "user_id": "Carlos Dagorret",
                    "user_href": "/profile/Carlos-Dagorret"
                }
            ]
        },
        {
            "author_info": {
                "name": "Bright Joe",
                "href": "/profile/Bright-Joe"
            },
            "answer_text": "Hi, I started blogging at the age of 12. I basically know nothing and I got started with Blogspot. I personally don't like Blogspot for because it's not that customization as WordPress. If you want to start blogging for free, you can.  There are many free domain extensions, most are blacklisted in Google and some search engines. But the domain .GA is a good one. You can register it for free at Freenom.com. And after that, you need to host your blog somewhere. I know some of the best free hosting companies providing enough space and bandwidth for you. That's the best to get started. Some of good free web-hosting services: Ultimate Free Host- Free Unlimited Hosting | Ultimatefreehost.InFree Hosting No Ads- FreeHostingNoAdsNZ Free Web Hosting- http://www.freewebhost.co.nz/ 000Webhost- https://000webhost.com You can use any one of them. But I used to use Free Unlimited Hosting | Ultimatefreehost.In which worked best for me. It's online 99.9% of the time and I face no server issues with it. I used it for about 8 months without any problems. And for domain, I prefer .GA for better ranking and for not being blacklisted in Google like the .TK domain is. You can also install WordPress within minutes at Free Unlimited Hosting | Ultimatefreehost.In with auto installer- Softaculous.  I hope it worked. Regards, Bright Joe (Copious Blogger - Turn Blogging Into Online Income)  I use Godaddy for Hosting and Domain! ;)  ",
            "date": "Answered December 21, 2015",
            "views": "674",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Jay Val",
                "href": "/profile/Jay-Val-14"
            },
            "answer_text": "Yes, it is possible to “blog for free”! We also have to beware that free, doesn’t always mean “easy”, nor is free always “the best” way to go about doing something. (check out this list of free blogging platforms below) There are plenty of places where you can blog for free without worrying about having to pay fees ever. Typically free platforms are simple to use, and look fairly simple as well. So you do lose some design functionality with a free blogging website… this is done because they want you to upgrade to a flashier “prettier” (read: paid) version at some point. If you don’t care if you have the latest, greatest, coolest looking website… a free blogging site might be a perfect match for you. Sign up for one and get your words out there! You can always transition to an upgraded version later if you outgrow your free platform. Top FREE Blogging Platforms List: 1. Tumblr - Sign up | Tumblr 2. Blogger - Blogger.com - Create a unique and beautiful blog. It’s easy and free. 3. Wordpress - Wordpress.com 4. Wix - wix.com 5. Weebly - weebly.com 6. Live Journal - Live Journal.com There are plenty of others as well, if you conduct a google search… keyword: free blogging platform Or if you want to discover the best blogging techniques, try clicking here! I hope this helps! -J ",
            "date": "Answered April 18, 2018",
            "views": "264",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Eileen Hernandez",
                    "user_href": "/profile/Eileen-Hernandez-23"
                }
            ]
        },
        {
            "author_info": {
                "name": "Shahraj",
                "href": "/profile/Shahraj"
            },
            "answer_text": "Yes, you can be a blogger for “Free of cost”. I'm a blogger. I motivate peoples on my blog and talk about reality around us. I will suggest you to start with blogger.com which is free of cost. I think google is parent company of blogger. It's easy to use it and free. There are other websites such as WordPress , Wix, weebly, etc. but blogger is best. Some people will suggest you for WordPress, which is really a good site but you have to pay for custom domain. So better start with blogger.com and earn some money then you can easily upgrade to WordPress site for better controls over your site. Let me tell you Three important points to keep on mind :- Create your unique content. Basically, if you copy the content from anywhere then google can easily detect you and will never show advertise on your blog.Never write something which hurt other people's feeling. It will not help you to grow much.Once you start blogging, then keep your post consistent, upload them regularly. Learn doing SEO. It's very helpful.",
            "date": "Updated April 22, 2018",
            "views": "157",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Cyrus Jackson",
                "href": "/profile/Cyrus-Jackson-8"
            },
            "answer_text": "While you can always start a blog on a free platform like Blogger and WordPressdotcom, you’ll definitely not go anywhere with your blog (talking from experience) because of the numerous restrictions and limitations that will frustrate all your efforts. You won’t look professional to readers and most of them won’t take you serious as they won’t see you as an expert in your niche. Nothing beats having the ability to run your blog according to your preference and owning your content: that’s what blogging is all about. And not doing all the work while the owner of the site reaps all the reward. That’s bullshit to me and inhumane. If you follow my recommendation, you’ll start your blog at a very low cost ($12 for the first year) and also get a free domain name of your choice plus access blogging tutorials that’ll definitely guide you to successful blogging. It’s laid out in this epic step by step tutorial on how to start a blog in less than 30 minutes. Before I started my blog on a self-hosted version, I wasted 1 years of my life blogging on Blogger without making any headway please learn from my mistake and don’t go down that road. All the best! ",
            "date": "Answered April 20, 2019",
            "views": "114",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Nikhil Tidke",
                    "user_href": "/profile/Nikhil-Tidke-3"
                }
            ]
        },
        {
            "author_info": {
                "name": "Kara Fox",
                "href": "/profile/Kara-Fox-8"
            },
            "answer_text": "Can you make your blog without spending any money? Absolutely. Can you make a successful, professional, money making blog without spending any money? Doubtful... First thing to decide is what you wish to achieve with your blog. Is it going to be a hobby or creative outlet? Then all the free sites mentioned are a great start. If, however, you are hoping to become a career blogger who earns your primary income from blogging, then you are going to need to spend some money. Your costs may include some or all of the following:- Domain Registration- Site hosting- Brand Trademark Application- Design costs for your brand identity- Professional theme- Email list subscription management service- Advanced site statistics and analytics- Social Media Advertising- Professional plugins- Tax on your income- Stock photo / image copyrights- Security software I feel like I'm forgetting some but I do know that there have been several - sometimes unexpected - expenses that have made me wince over the years.  I view every expense as part of putting money back in to \"the business\". Good luck with your blog! ",
            "date": "Answered September 6, 2015",
            "views": "554",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Tanmay Gajbhiye",
                "href": "/profile/Tanmay-Gajbhiye-5"
            },
            "answer_text": "First of all, cheers to what you want to accomplish. Here’s what should be your first priority if you want to start blogging. You should consume a lot of content. With zero-knowledge of anything, you can’t do anything. Information about your selected niche is a must. If you think you have enough knowledge about your niche, you are good to go. Let me list out some of the ways you can start blogging for free. You can use Google’s free blogging platform: Blogger.com - Create a unique and beautiful blog. It’s easy and free. But, you have to compromise with your web address. It comes with a default name. For example: …………….blogspot.comYou can use WordPress.com: Create a Free Website or Blog. (Best of all). But, the same with this, have to compromise with your web address.There are a lot of people who hire people to write content for their blog. Find them. (TechCrunch, Medium, HubPages, Write.as and many more). Made that easy for you.Above can be the easiest ways to start blogging. I’m saying it again. You should consume a ton of content always if you start your blogging carrier. Otherwise, there will be one point where you will have nothing to write and you will give up. Also, another major thing you will need is patience. Blogs take time to grow. I hope that helps! Thank you! ",
            "date": "Answered June 17, 2020",
            "views": "116",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Akshay Pathade",
                    "user_href": "/profile/Akshay-Pathade-2"
                }
            ]
        },
        {
            "author_info": {
                "name": "Parveender Lamba",
                "href": "/profile/Parveender-Lamba"
            },
            "answer_text": "The best way to start a blog is create a free blog on Blogger dot com or wordpress dot com. But if you are serious about blogging then you should not create a free blog, as Amys Vista said in her answer. and if you just want to start a blog and don’t want to earn from it, means you just want to create a blog only for writing then Medium dot com is best option because it’s easy to write and easy to read. If you want to start a serious blog then you can start it in less than $100 dollars. You can buy your own domain name in less than $15 and can buy web hosting to host your domain in less than $70 from any good reputation company online. Just search on the web “buy domain name” & “buy web hosting for blog” I hope you can afford $100 because your using Quora means you have enough resources (mobile, laptop and own internet connection) ",
            "date": "Answered November 11, 2017",
            "views": "346",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Worla Kwesi",
                "href": "/profile/Worla-Kwesi"
            },
            "answer_text": "Blogging isn’t free it’s effective, but costs a lot of $$$$ to become a pro. but don’t expect to create a great blog for free You can create a personal blog on WordPress.com for free. Professional Blogging comes with expenses,but if you are trying to make money from your blog, you will have to spend money to make that happen. A few things that you will end up spending money on: Web or graphic design servicesA Domain nameHostingEmail servicesSocial media scheduling servicesbut all these expenses are worth it . trust me on this,and remember to plan your budget. vast majority makes less than $3.50 per day according to Lifehacker Depends on what you prefer . I highly RECOMMEND PAYING THE $$$ . A high quality website = $$$ with a large audience OR .Normal/average= FREE with a smaller/NO audience thanks. hope i answered your question . ",
            "date": "Answered March 17, 2019",
            "views": "94",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Nishant",
                "href": "/profile/Nishant-591"
            },
            "answer_text": "First of all congratulations, you’re entering a new world of blogging. A good decision. One must write blogs not just to earn money but to share their own views and opinions to public. It helps to develop yourself, your thinking ability, writing ability, general knowledge, etc. There are many blogging sites which are free and provide many features like free themes etc. They are as follows → Wordpress - WordPress.com: Create a website or blog and Blog Tool, Publishing Platform, and CMS . This is most popular blogging site and probably have the most number of users worldwide. Blogger - Blogger.com - Create a unique and beautiful blog. It’s easy and free. It is also one of the most famous blogging sites. 3. Tumblr - Sign up | Tumblr  4. Weebly - Weebly is the easiest way to create a website, store or blog  5. Medium - Medium  These are the top blogging sites which offers to create account and write blogs for free. There are many more. Happy Blogging ",
            "date": "Answered January 18, 2017",
            "views": "635",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Marek Leramic",
                    "user_href": "/profile/Marek-Leramic"
                },
                {
                    "user_id": "Derrick Young",
                    "user_href": "/profile/Derrick-Young-52"
                }
            ]
        },
        {
            "author_info": {
                "name": "Cord LaFond",
                "href": "/profile/Cord-LaFond"
            },
            "answer_text": "FREE is over-rated. You always get what you pay for. You are either the customer or the commodity. Ask yourself two questions: What do I want a website to accomplish for me?Is that goal worthy of a small investment?A domain name is going to cost you the price of lunch once a year. Hosting will cost you the price of lunch once a month. The design will cost you the time to learn a little HTML & CSS & SEO. Alternatively, you c an pay someone who is experienced to do it right. If you are looking for monetary payback, this is not a DIY project. There are very many nuances which can only be learned by experience. If you are approaching it as a hobby and don’t expect much back, use a CMS like Wix or WordPress. ",
            "date": "Answered October 25, 2019",
            "views": "110",
            "upvotes": " View 2 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Judy Taylor",
                    "user_href": "/profile/Judy-Taylor-53"
                },
                {
                    "user_id": "Sathiya Soundraraman",
                    "user_href": "/profile/Sathiya-Soundraraman"
                },
                {
                    "user_id": "Ajith Choudary",
                    "user_href": "/profile/Ajith-Choudary"
                },
                {
                    "user_id": "Shakthi Pai Prasad",
                    "user_href": "/profile/Shakthi-Pai-Prasad"
                },
                {
                    "user_id": "Onoci Tsalc",
                    "user_href": "/profile/Onoci-Tsalc"
                },
                {
                    "user_id": "Tony Sheldon",
                    "user_href": "/profile/Tony-Sheldon-4"
                },
                {
                    "user_id": "Abhishek Rajak",
                    "user_href": "/profile/Abhishek-Rajak-2"
                },
                {
                    "user_id": "Abhi Abhi",
                    "user_href": "/profile/Abhi-Abhi-92"
                }
            ]
        },
        {
            "author_info": {
                "name": "Rahul Chatterjee",
                "href": "/profile/Rahul-Chatterjee-37"
            },
            "answer_text": " Before you start writing your first blog you can do few things which will keep you motivated in your journey of writing blogs with virtuous content for all your privileged readers. Get your Goal Think and understand your goal, it can be writing for a keyword, sharing a tutorial, doing a product review, making a sale, expressing your opinion on something, sharing news or can also be for mere pleasure. But it is important to do this exercise because it will keep your interest and also your readers.  Top the Topic Once you determine your goal your first hurdle of choosing your topic will be solved because ow you can choose a relevant topic at ease. Your challenge will be to do some research and bring out something new in your topic which will make yourself and your readers learn some new things. Trigger the Title The most important thing on any of your new post is a having an influential title. Having a worthy title will attract more readers to the post; a bad title will keep people from ever seeing the great post you wrote. Right Writing Now it is time to write, this is where you just let go of any sprints or how you want to say this or that, Just Write! You already know your topic, title and your goal. Now it is just about you getting what you want to say on paper or screen, say it with personality and be done. Imagine Images Now that you have your title and post done, you want to find an image that fits. Be imaginative here, but make sure the image still fits the post. Read and Edit It is always good to read your posts which will give you insights about your writing standards and will continuously evolve your writing skills. ",
            "date": "Answered February 6, 2016",
            "views": "18",
            "upvotes": " View 8 Upvoters",
            "upvoters": [
                {
                    "user_id": "Sk Royal Club",
                    "user_href": "/profile/Sk-Royal-Club"
                },
                {
                    "user_id": "Dexter Morgan",
                    "user_href": "/profile/Dexter-Morgan-155"
                },
                {
                    "user_id": "Rajat Sinha",
                    "user_href": "/profile/Rajat-Sinha-106"
                },
                {
                    "user_id": "Raman Raman",
                    "user_href": "/profile/Raman-Raman-125"
                },
                {
                    "user_id": "Krishna Yadav",
                    "user_href": "/profile/Krishna-Yadav-1508"
                }
            ]
        },
        {
            "author_info": {
                "name": "Atish Lolienkar",
                "href": "/profile/Atish-Lolienkar"
            },
            "answer_text": "Read this before Blogging should be linked with your passion. If you want to be a successful blogger, at first you need to discover what you are really good at. In my case, I like to talk about finance and real estate. If you meet me, I will end up talking to you about if for hours and hours without any break. You need to find a similar passion for yourself. Yes, blogging is definitely free. It’s not that you have to start a blog by spending thousands of rupees on domain name and hosting (if you are very serious about your blogging and you want to make a career out of it, then you definitely need to put money in blog, free stuff won’t work there) If you are like me who just wants to write for fun and share knowledge than Quora is the best platform. I have used various platforms like Medium, Blogger, WordPress, but I have finally settled on Quora. This platform has good organic reach and you don’t have to worry about running a social medial mage to keep your blog running. Also it had good statistic tools that will tell you which topics are getting more attention from the users. If you have a good reach, only then you can move towards creating your own blog or else spending money for a blog without any return on investment makes no sense. Thanks for the read. ",
            "date": "Answered September 13, 2020",
            "views": "30",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Ankit Wasankar",
                "href": "/profile/Ankit-Wasankar"
            },
            "answer_text": "Yes, it’s possible and it’s been really easy now. You can create a free blog and also earn money by showing ads on it (Free of cost)There are 3 things that are required to setup blog, you can setup all those things for free and start your blog: Hosting for a WordPress blog.Custom domain name for the blog.SSL certificate for https (It’s more trustworthy these days)To earn money from blog, you will need Google Adsense account.If you are really interested in creating your own blog and start earning money, I would recommend you to go through this YouTube video.  ",
            "date": "Answered May 13, 2019",
            "views": "196",
            "upvotes": " View 5 Upvoters",
            "upvoters": [
                {
                    "user_id": "Shreya Vinod",
                    "user_href": "/profile/Shreya-Vinod-7"
                },
                {
                    "user_id": "Ayan Dutta",
                    "user_href": "/profile/Ayan-Dutta-82"
                }
            ]
        },
        {
            "author_info": {
                "name": "Asif Khan",
                "href": "/profile/Asif-Khan-2848"
            },
            "answer_text": "So, you want to start a blog huh? Great idea! But…how the heck do you get started? There’s so much info out there on the web, and everyone’s telling you to do different things. Who do you listen to? Where’s the starting point? Damnit, maybe you should just forget it – it’s too confusing! Well, hold up. I used to be a blogging newbie too. I had the same problems. I started my blog (http://opendoor4all.com) way back in 2016, and I knew less than nothing about blogging. In fact it was only the week before I’d learnt what a blog was. Now I know a ton about them, and my blog’s doing pretty well – I receive more than 30,000 unique visitors per month which makes me consider myself someone you could listen to and learn from when it comes to building your own blog. I’m not some sort of Guru, but I certainly do know the basics. I promise it’ll be simple, relatively easy, and definitely easy to understand (no stupid jargon). Sound good? Awesome, let’s move on. Learn more. Read my article, How To Start a Blog in 2018 - Easy to Follow Guide for Beginners ",
            "date": "Answered June 7, 2018",
            "views": "73",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Erica Miller",
                "href": "/profile/Erica-Miller-81"
            },
            "answer_text": "The two most popular options are Blogger, which belongs to Google, and WordPress dot COM. But also take a look at the following free ones, some of them have paid plans too: Medium, BlogJob, BlogSome, Bukisa, Weebly, Webs, LiveJournal, OverBlog, SimpleSite, Triond, or Tumblr. Keep in mind because they are being hosted on blogging platforms, they all have some limitations, for example some don’t allow ads, while some place ads on your site, some do not offer the option of your very own domain name, etc. I suggest you google for free web hosts and free domain registrars, upload WordPres dor ORG’s software there, then you can monetize and you will have more freedom to make your blog 100% your own. ",
            "date": "Answered September 25, 2017",
            "views": "11",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Motsuthung Yanthan",
                "href": "/profile/Motsuthung-Yanthan"
            },
            "answer_text": "Hi. I started my own blog a few months back. Did a lot of research before I finally got to know about where to begin. Since I’m just a poor student who doesn’t have enough “net pocket money” to survive each month happily, my eyes were only scanning for the word “free” as I searched for a bloging platform. If you log in to your gmail account, you would see a list of google services in tiles at the top right of your homepage.There would be a “B” alphabet in the list as you scroll down. Just get there and you will start to unfold your new experiences step by step. It’s google’s blogspot. (Fundamental law: Don’t expect a lot from a free platform) ",
            "date": "Answered April 21, 2018",
            "views": "459",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Mohamed Kamel",
                    "user_href": "/profile/Mohamed-Kamel-9"
                }
            ]
        },
        {
            "author_info": {
                "name": "Muntazir Abbas",
                "href": "/profile/Muntazir-Abbas-8"
            },
            "answer_text": "This is the most crucial step where newbies stuck, means which platform to choose to start their blog. At this time I must give you a suggestion, you must have heard of WordPress. It’s massive. It is mostly used in the world, with unlimited plug-in and add-ons and have infinite number of free and premium theme, 22% of all website in over internet uses WordPress. Below chart will show you which platform is used how much. But if you don’t want to use WordPress, there are other alternative listed below. Blogger – the next best thing to WordPress. It is common known as BlogSpot blog.Tumblr – Half social network, half blog. Interesting and very simple to use.Though WordPress is bigger and better, I would suggest you to use this only. I have reasonable reasons to convince you. One click installation.Large number of theme and layouts.There is good support even they have support forum and provide solution to every query.Your blog will be insanely fast and perfect.Unlimited plugins to design your blog without being code master. Read Full Article : 7 Very Easy steps to start blogging ",
            "date": "Answered September 29, 2017",
            "views": "93",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Preshita Kudtarkar",
                "href": "/profile/Preshita-Kudtarkar"
            },
            "answer_text": "You can use Blogger to create a free blog. It’s google’s app for blogging. When you create a free blog the hosting and domain stays with blogger. So you website name will have blogspot in it. For example:- xyz.blogspot.com . If you in future decide to own the website you can buy the hosting and domain from blogger. But otherwise your blog will be completely free. You can also sign up foe Adsense if you have enough traffic for it. Their are tons of videos on Youtube as to have to start with blogging. Their is one more website you can checkout i.e Wordpress. This one will have wordpress i your web Continue Reading",
            "date": "Answered December 7, 2019",
            "views": "0",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Ankit Main",
                "href": "/profile/अंकित-माईण-Ankit-Main"
            },
            "answer_text": "Hey, As you know there are several free platforms allow you to create your own blog. Blogger, WordPress (.com), Wix, Medium, and even Quora, etc. are good platforms to start blogging or for casual blogging where your first preference is not money. If you want to earn a few bucks from your blog, then Blogger with custom domain is great choice (cost for domain name will be $1–20 in normal cases). If you are serious and want to make more money and control on your blog, then self-hosted website is absolutely nice move. I have used many free platforms and now own two self-hosted blogs too. To get free  Continue Reading",
            "date": "Answered February 15, 2017",
            "views": "0",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Johnny Copley",
                "href": "/profile/Johnny-Copley-3"
            },
            "answer_text": "My answer to this question is yes. Yes you can start blog for free. In fact any one who is an avid writer can start blogging for free. Various blog post sites are available on the internet like Blogger, LiveJournal, etc that allows you to post your blogs for the free on their site. There are many professional bloggers that start their blogging with Blogger as it gives quite good features as compared to other. Well, you will also get some templates in this. Choosing one decent template you can start your blog on it. It also gives the setting for the SEO. ",
            "date": "Answered February 14, 2020",
            "views": "17",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Kunal Chandiramani",
                "href": "/profile/Kunal-Chandiramani-3"
            },
            "answer_text": "there are. there are many. There are so many. In fact it's free and even doesn't require any kind of coding experience. As long as you are looking for an option for a blog the following ones are multipurpose and can be used for all kinds of blogs Check Blogger.com to get stared it's owned by google and would not dissapointed you You can also checkout WordPress.com which powers more then 20 percent of the web These are a free ones which are specifically designed for a particular industry in addition to favouring blogging as an addition asset like jewel to their users. (Blogging has become a very va Continue Reading",
            "date": "Answered October 9, 2017",
            "views": "0",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Randall E. Storms",
                "href": "/profile/Randall-E-Storms"
            },
            "answer_text": "My blog Free Web Hosting is hosted on free web hosting 000webhost .  000webhost offer three ways to set up website : 1. **Online Website Builder** All kinds of template you can choose , like music , book , ecommerce  2. **One-click Wordpress** Easy to use . 3. **Online FTP** Upload your website , Support Online Extracting zip and tar.gz file ,Change the directory and permission . It’s very fast . Remember extracting your website to root directory .  Then back to home , click “Manag database — New database ” to create a database . “id1086534” is generated by system .  Basic Website Setting Tutorial : -------- Continue Reading",
            "date": "Answered June 23, 2017",
            "views": "0",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Charan Earnrupee",
                "href": "/profile/Charan-Earnrupee"
            },
            "answer_text": "They are many web 2.0 websites are there to create a blog for free. But, one thing what purpose your are creating a blog for your personal use or to make money online with a blog. For personal i recommend free blogs like (blogspot, wordpress, weebly .. etc ), and if you are troubling to create, can find many good videos on youtube how to create a blog for free. Suppose your are planning for commercial purpose they i would suggest don't go for free services. Its waste of time and you can't make money. i started my first blog with a free hosting service after 3 days they just blocked my url and th Continue Reading",
            "date": "Answered February 21, 2017",
            "views": "0",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Ajeet Yadav",
                "href": "/profile/Ajeet-Yadav-594"
            },
            "answer_text": "Hey  Nice to see you. You r interested in starting your own blog. There is alot of platform available for doing blogging but you want to start in free then I will recommend you start making your blog with blogger. Com powered by google. Blogger is a blog-publishing service that allows multi-user blogs with time-stamped entries. It was developed by Pyra Labs, which was bought by Google in 2003. Generally, the blogs are hosted by Google at a subdomain of Blogger.com - Create a unique and beautiful blog. It’s easy and free.. You can also monetize your blog. So I think this answer will be beneficial f Continue Reading",
            "date": "Answered April 21, 2018",
            "views": "0",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Shivani Bhosale",
                "href": "/profile/Shivani-Bhosale-42"
            },
            "answer_text": "Now more than ever, the best free blogging sites like WordPress, Wix, Weebly, Tumblr, Ghost, Medium and more are all helping millions of new bloggers to build visually appealing websites without ever having to learn to code. I’d rather suggest starting writing roughly first if you are a newbie. Grammarly is a great tool to help you out to correct grammatical mistakes. Grammarly is free of cost tool but yes it has it’s premium i.e paid version too. Now getting back to the main point is you can start blogging of free blogging websites are there are many people who use these free platforms to boost Continue Reading",
            "date": "Answered January 7, 2020",
            "views": "0",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Victor Step",
                "href": "/profile/Victor-Step"
            },
            "answer_text": "You can simply got to WordPress.com: Create a website or blog and use their platform to get yourself a blog within a number of minutes. I have detailed video instructions on my page: How to Start a Blog and Why It's One of the Best Things That I Have Ever Done | G.E.D But I think that a completely free blog is only good to try out. In the long run, to get credibility, you will want to have your own hosting and own domain name (www.example.com). With the free wordpress hosting you only get to have a site with a domain name such as www.blablablabla.wordpress.com. You don’t want that wordpress wor Continue Reading",
            "date": "Answered March 18, 2017",
            "views": "0",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Ammar Jamali",
                "href": "/profile/Ammar-Jamali-5"
            },
            "answer_text": "To set up Free online blog you need to start with blogger or wordpress site to Publish freely on web. If you are using free service then it looks like:- http://yousitename.blogspot.com or yoursitename. WordPress.com and if you what your own domain then you have to purchase domain: I recommend that if you are beginner then you have to start with blogger. and if you have some knowledge in html & css then you start with wordpress too. Upvote if like my Answer Thank you. ",
            "date": "Answered February 8, 2020",
            "views": "20",
            "upvotes": " View 1 Upvoter"
        },
        {
            "author_info": {
                "name": "Paul Gabriel",
                "href": "/profile/Paul-Gabriel-85"
            },
            "answer_text": "There are various sites like Blogger who allowed you to start your own blog for free. Publishing some post will not sufficient to earn real money from it. At the same time, there are 5 primary steps you want to recognise for growing a blog quickly. If you're acquainted with those things, you could construct a weblog in 20 mins or less. Picking a nich Your weblog’s area of interest is the unique market (topic) you may be targeting. Choose a subject you're passionate about. Also, ensure your area of interest has sufficient hobby round it and that human beings look for subjects associated with your  Continue Reading",
            "date": "Answered July 31, 2020",
            "views": "0",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Tim Halloran",
                "href": "/profile/Tim-Halloran-9"
            },
            "answer_text": "You can blog for free on a blogging platform such as Hubpages.com. However, these kinds of platforms can limit your potential if you want to earn from your writing because: Google doesn’t recognise them and so you won’t rank your content on the free search enginesYou can’t link to many affiliate products which you could use to monetise your content.Ideally, spend a little and build a website which you own buy buying a domain name and getting a hosting. If you do this, you can link to any affiliate product you like, and you’ve more chance of getting a free listing on Google for your content. This Continue Reading",
            "date": "Answered April 23, 2019",
            "views": "0",
            "upvotes": "0"
        }
    ]
}