{
    "title": "Is it necessary to apologise when you've offended someone close to you even if you didn't mean to? - Quora",
    "tags": [
        "Manners and Etiquette",
        "Social Advice"
    ],
    "response": [
        {
            "author_info": {
                "name": "Tina Thrasher",
                "href": "/profile/Tina-Thrasher"
            },
            "answer_text": "I believe it is, if you intend to salvage the relationship. This happened with my little sister over the last few years. Even though i apoligized and asked what it was she refuses to forgive me or tell me specifics and her husband has told me i am Toxic and am poisoning their family. I am never around them. I only talked to her via text which she misinterpereted several times. I am not allowed to see my niece or nephew and even though she says my husband and daughter can see them she never presents opportunities for that to happen. Its very disturbing because of the bond we had no less than 5 or 6 years ago before she had children. Even if you apologize for whatever it is, don't count on a reconciliation. ",
            "date": "Answered February 3, 2018",
            "views": "22",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Phyl Bean",
                "href": "/profile/Phyl-Bean"
            },
            "answer_text": "Yes. An apology isn’t an admission of intentional wrongdoing. It’s an acknowledgement that something you did hurt someone. If you’re walking by the pool and you accidentally bump into someone, causing them to fall in, would you seriously think you need do nothing because it wasn’t intentional? If you were pushed into a pool by a stranger, whether or not it was accidental, I suspect you’d want an apology. In fact, not apologizing makes it look like you did it on purpose and are therefore not sorry. ",
            "date": "Answered February 3, 2018",
            "views": "19",
            "upvotes": " View 7 Upvoters",
            "upvoters": [
                {
                    "user_id": "Timothy Nguyen",
                    "user_href": "/profile/Timothy-Nguyen-22"
                },
                {
                    "user_id": "Salvador Hirth",
                    "user_href": "/profile/Salvador-Hirth"
                },
                {
                    "user_id": "Stacy Panter",
                    "user_href": "/profile/Stacy-Panter-1"
                },
                {
                    "user_id": "Jen Lyndle",
                    "user_href": "/profile/Jen-Lyndle"
                },
                {
                    "user_id": "Michaela Calvert",
                    "user_href": "/profile/Michaela-Calvert"
                },
                {
                    "user_id": "Louise Smith",
                    "user_href": "/profile/Louise-Smith-60"
                },
                {
                    "user_id": "Linda Chelmowski",
                    "user_href": "/profile/Linda-Chelmowski"
                }
            ]
        },
        {
            "author_info": {
                "name": "Yameli Diaz",
                "href": "/profile/Yameli-Diaz"
            },
            "answer_text": "If you feel guilty over whatever incident occurred, where you know for a fact that you hurt someones feelings, then my answer is yes. Sometimes an unnecessary apology can help strengthen a relationship because it validates the other person that you truly mean the apology even if you didn’t mean what ever was done. ",
            "date": "Answered February 7, 2018",
            "views": "512",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Barbara LeLievre",
                "href": "/profile/Barbara-LeLievre"
            },
            "answer_text": "Absolutely….the closer the person, the harder the hurt. I recently did something in a room full of people….and immediately realized I could have caused my friend a terrible embarrassment. It nearly ruined my evening, and I felt the anticipation which comes from knowing you owe this person an apology. Due to the nature of our event, it wasn't possible to do. But as soon as we connected the next day, I gave her the Three Sorries….this is what I did, I shouldn't have done this, I'll never do that to you again. She said she didn't know what I was talking about!!! I think she was being kind…. ",
            "date": "Answered February 3, 2018",
            "views": "14",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "LuAnn Mason",
                "href": "/profile/LuAnn-Mason"
            },
            "answer_text": "Yes. If you offended them on purpose, you’d be a total jerk. If you accidentally bump into a stranger you apologize, right? Even though you didn’t mean to do it. Why would you treat a stranger better than someone you’re close to and presumably care about? ",
            "date": "Answered February 3, 2018",
            "views": "364",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Ron Murphy",
                    "user_href": "/profile/Ron-Murphy-24"
                },
                {
                    "user_id": "Louise Smith",
                    "user_href": "/profile/Louise-Smith-60"
                },
                {
                    "user_id": "Linda Chelmowski",
                    "user_href": "/profile/Linda-Chelmowski"
                }
            ]
        },
        {
            "author_info": {
                "name": "Angie",
                "href": "/profile/Angie-295"
            },
            "answer_text": "Depends on how the relationship is between the two. If the offended one feel they want one you should apologize even if you didn’t mean to offend. Because every person should take responsibility for their actions but there’s always exceptions.. like would the offended apologize to you if it was the other way around, for example. ",
            "date": "Answered February 3, 2018",
            "views": "251",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "John Malinowski",
                "href": "/profile/John-Malinowski-11"
            },
            "answer_text": "The question is too generic. Just because you didn’t mean to doesn’t mean it wasn’t offensive. If you understand what you did to be offensive than you should absolutely apologize. If you feel that it wasn’t offensive you absolutely should not. ",
            "date": "Answered February 3, 2018",
            "views": "644",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Linda Chelmowski",
                    "user_href": "/profile/Linda-Chelmowski"
                }
            ]
        },
        {
            "author_info": {
                "name": "Zàm Êér Sãyēd",
                "href": "/profile/Zàm-Êér-Sãyēd"
            },
            "answer_text": "Yes definitely you have to apologise whenever you have offended anyone be that someone close to you or not…. Just like we say thank you,love you etc we should also learn to apologise by sayng sorry properly to the person offended by you…. Peace… ZAM….. ",
            "date": "Answered February 3, 2018",
            "views": "464",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Steve Ben",
                "href": "/profile/Steve-Ben-3"
            },
            "answer_text": "That is when you apologise. If you meant it t here is no reason too. But when you donot mean to offend that is when you do. ",
            "date": "Answered February 3, 2018",
            "views": "125",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Omar Fouad",
                    "user_href": "/profile/Omar-Fouad-5"
                },
                {
                    "user_id": "Vidhya Murali",
                    "user_href": "/profile/Vidhya-Murali-15"
                }
            ]
        }
    ]
}