{
    "title": "Is it child abuse for a 13 year old to harm a 7 year old? - Quora",
    "tags": [
        "7 (age)",
        "13 (age)",
        "Child Abuse",
        "Abuse",
        "Child Development",
        "Teenagers and Teenage Years",
        "Children"
    ],
    "response": [
        {
            "author_info": {
                "name": "Valerie Baptiste Ermineskin",
                "href": "/profile/Valerie-Baptiste-Ermineskin"
            },
            "answer_text": "The thirteen year old is bigger than the seven year old. What defense does a seven year old have? The seven year old will experience trauma from abuse from anyone bigger than her or him. It should not be tolerated in any way shape or form. You are supposed to be the protector. Protect the seven year old. If you do not, who will? Get help from professionals in your community. Harm to any child is not okay. There must be consequences to the thirteen year old. Not physical mental or emotional punishment of course. ",
            "date": "Answered August 26, 2020",
            "views": "213",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Noelle Thompson",
                    "user_href": "/profile/Noelle-Thompson-17"
                },
                {
                    "user_id": "Gray Beaupre",
                    "user_href": "/profile/Gray-Beaupre-1"
                },
                {
                    "user_id": "Edu Perez",
                    "user_href": "/profile/Edu-Perez-10"
                }
            ]
        },
        {
            "author_info": {
                "name": "Rino Rien",
                "href": "/profile/Rino-Rien"
            },
            "answer_text": "Hi, It depends on the recurrence of the harm as well as the household. Abuse is not something light to say, for it to be abuse it has to be more than sibling arguments. An abusive household can include a place where the parents allow one child to constantly hurt the other one, being it in which way it may be (we’re talking about unreasonable pain). If you have concerns you should speak with the adults in charge. If you are an adult in charge, you should regulate bickery when it becomes too much. Note that a certain amount of tension between the two can be healthy, however, it requires guidance in order to learn how to sort out these issues. Best of luck. ",
            "date": "Answered August 26, 2020",
            "views": "268",
            "upvotes": "0"
        }
    ]
}