{
    "title": "Is it worth it to update old blog posts? - Quora",
    "tags": [
        "Bloggers",
        "Blogs"
    ],
    "response": [
        {
            "author_info": {
                "name": "Ashley Romer",
                "href": "/profile/Ashley-Romer"
            },
            "answer_text": "Yes, definitely. It does depend on the post, some you may even want to fully delete. But I would be cautious to only delete when you think it is necessary especially when people may have linked to that post and it is helping your site. You should always make a habit of going back to your posts and improving them or revising old information. You can then change the date to show when it was last updated to keep it fresh. Sometimes it is better just to revise an older post to make it better than it is to create a new page on a similar topic. A longer in-depth post is can be better than 2 short posts on similar topics. Of course use best judgement as you have to think of the user experience. It a page is not valuable anymore, it gets no traffic and no one is linking to the page, you could choose to delete it as its not helping your site any longer. ",
            "date": "Answered May 1, 2020",
            "views": "59",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Rose Mwandishi",
                "href": "/profile/Rose-Mwandishi"
            },
            "answer_text": "Yes, I think updating old posts gives the posts a new life, also the search engines like it when you keep updating your old content, it shows that you constantly adding helpful information to your posts to help your audience. The only thing you should not touch is the permalink and the publish dates. you can of course mentioned within the posts the date you update, but the original publish date, leave it as it is. ",
            "date": "Answered May 1, 2020",
            "views": "54",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "David Alexander",
                    "user_href": "/profile/David-Alexander-14"
                }
            ]
        }
    ]
}