{
    "title": "Is it possible to write your own will? - Quora",
    "tags": [
        "Estate Planning",
        "Estate Law and Wills",
        "Legal Issues and Law in Everyday Life"
    ],
    "response": [
        {
            "author_info": {
                "name": "Jennifer Ellis",
                "href": "/profile/Jennifer-Ellis"
            },
            "answer_text": "Yes, you can write your own will. It really isn’t that hard to make your own enforceable will. Some states barely require anything at all, even some words jotted on a napkin at a bar can be effective in some jurisdictions. There are very few laws governing what you can and cannot do in a will. There is some key language, which will vary from state to state, that you might need to use to accomplish certain things. There are some laws as far as spouses that can impact whether your will is ok, since in most states a current spouse has an entitlement to a certain percentage of your property. The average person isn’t going to encounter too many laws they will run afoul of in their will. If you want to write your own will, the best thing to do is check on the requirements in your state for the will to be enforceable and to see if there are any quirky laws. That said, whether the will is the right one for you, for protecting your assets, for avoiding trouble after you pass, that is often the trick. This is the reason to use a lawyer, as much as anything. As well as to make sure you understand your obligation to your spouse (if you have one) and any specialized issues you might encounter. ",
            "date": "Answered February 28, 2017",
            "views": "47",
            "upvotes": " View 70 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Anne Penrose",
                    "user_href": "/profile/Anne-Penrose"
                },
                {
                    "user_id": "Merimar Ni Fiach",
                    "user_href": "/profile/Merimar-Ni-Fiach"
                },
                {
                    "user_id": "Constance Konamah",
                    "user_href": "/profile/Constance-Konamah"
                },
                {
                    "user_id": "Eldar Kersebaum",
                    "user_href": "/profile/Eldar-Kersebaum"
                },
                {
                    "user_id": "Sam Robison",
                    "user_href": "/profile/Sam-Robison"
                },
                {
                    "user_id": "Yan Vologzhanin",
                    "user_href": "/profile/Yan-Vologzhanin"
                },
                {
                    "user_id": "Edward Paras",
                    "user_href": "/profile/Edward-Paras"
                },
                {
                    "user_id": "Trish Hart Becker",
                    "user_href": "/profile/Trish-Hart-Becker"
                },
                {
                    "user_id": "Will Titus",
                    "user_href": "/profile/Will-Titus-1"
                },
                {
                    "user_id": "Jarrod Dharmaraj",
                    "user_href": "/profile/Jarrod-Dharmaraj"
                }
            ]
        },
        {
            "author_info": {
                "name": "Mitchells Solicitors",
                "href": "/profile/Mitchells-Solicitors"
            },
            "answer_text": "You can always write your own will. The problem with writing your own will is that it’s unlikely that you know and understand all the laws that govern wills and estates in your jurisdiction (unless you are a specialist in this area). So you might write a will you think sounds enforceable and legally binding, but the court may declare it invalid because you haven’t completed it in accordance with the law. There is usually a requirement that your will is signed and witnessed correctly, for example. We see so many homemade wills that aren’t witnessed in accordance with the law, making them invalid. You say you’ll just add to it, but do you know who must witness it each time you do this? Using your own language rather than legal language can create ambiguity about what you actually meant Plus, you need to make arrangements for minor children, consider tax issues and provide asset protection. A simple DIY will cannot cope with this level of complexity. Is Doing an Online Will Wise? | Contesting A Will (Brisbane) ",
            "date": "Answered February 28, 2017",
            "views": "155",
            "upvotes": " Answer requested by Ted Pennington"
        }
    ]
}