{
    "title": "Is it possible to read 300 pages in one day? - Quora",
    "tags": [
        "Reading"
    ],
    "response": [
        {
            "author_info": {
                "name": "Travis Casey",
                "href": "/profile/Travis-Casey-4"
            },
            "answer_text": "Certainly. When I was in high school and college, and had summers free, I sometimes read multiple books in one day. Looking online, an average paperback book has around 250 to 300 words per page. Taking the high end, that’s 90,000 words. If one spends ten hours reading, that’s a rate of only 150 words per minute. So… a story. My high school had a mandatory “reading improvement program” that some state senator had pushed for. In 10th grade, for one six-week period, each English class would go through it. They had machines you were supposed to use to measure and improve your reading speed. The machines were designed to use filmstrips, and to flash up a line of text at a time, at a settable rate. We were to read a story with it, then answer a set of questions about the story, and turn up the speed until we only got 50% of the questions right, and try to improve our speed from there. The highest speed setting was 500 words per minute. At that speed, I got 90 to 100% of the questions on each story right. Once, my family was about to go on vacation for a week. I had a book I was reading at the time, and I didn’t want to take it with me, since I knew I’d finish it the first day, and I’d rather have the packing space for a book I wasn’t already more than halfway through. Unfortunately, I didn’t realize that we were leaving the next day until around 9 PM… so I read the remainder of the book as fast as I could. After finishing, I got curious about how fast I was reading. Counting the words on a few sample pages, then using that to estimate, I got a bit over 2000 words per minute. I’m also old enough to remember 1200 and 2400 bps modems. With a 1200 bps modem, I could fairly easily keep up with the incoming text. 1200 bps / 8 bits per character x 60 seconds per minute / 6 characters per word gives about 1500 words per minute. Allow for the fact that the transmission probably doesn’t always reach ideal speed, and call it 1200 words per minute for a comfortable reading speed for me. 90,000 / 1200 = 75 minutes to read 300 pages. Of course, I’d have distractions at times, so call it 1.5 hours. One more anecdote. Once, when I was about to start a Dragonlance campaign, I decided to re-read the first Dragonlance trilogy the weekend before. I read all three books in one day. A quick search finds that that’s a total of around 429,000 words in one day. At 1200 wpm, that’s about six hours, which matches my memory. It took most of the day, but not all day. ",
            "date": "Answered July 25, 2020",
            "views": "201",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Usama Choudhry",
                    "user_href": "/profile/Usama-Choudhry-2"
                }
            ]
        },
        {
            "author_info": {
                "name": "Danilo Renzi",
                "href": "/profile/Danilo-Renzi"
            },
            "answer_text": "Is it possible to read 300 pages in one day? This depends on what you read and why. If you are reading for your pleasure, interest, culture or any other personal interest, then you might be interested to read from page 1 to the last page, including introductions, prefaces and forewords. If you don’t do this, you are reading for nothing, you are losing the very purpose of your reading. In this case, you obviously cannot read 300 pages in one day, unless you are an incredible speed reader, like Raymond in Rain Man movie. If you don’t have an extraordinary speed, you could still read the entire book, but it's going to be very wearing, very tiring and in the end you're not going to enjoy the reading, you will not assimilate the whole information. So, if you are reading for pleasure, the answer, at least in general, is: no, you can't read that fast if you don't want to ruin the enjoyment of your reading. Different is when you are reading for work. In this case, you don’t have to read from the first to the last word. You just browse until you find something that is interesting you, something that you need or something that you find useful for the purpose of your reading. In this case, yes, you can read the whole thing in one day. But you will slow down and fast up in function to the information you are looking for. If you are a technical reader, a programmer, a technician, an engineer and so on, you know what I'm talking about. ",
            "date": "Answered July 26, 2020",
            "views": "113",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Dennis Gin",
                    "user_href": "/profile/Dennis-Gin"
                }
            ]
        },
        {
            "author_info": {
                "name": "Anja M. Joris",
                "href": "/profile/Anja-M-Joris"
            },
            "answer_text": "Yes, it is. Kindle tells me that a book with 300 pages take about 5 hours and a bit That means that is the average reading time and sadly it means I have to divide it by two. It normally takes me half the time and that is quite accurate. I don't like it at all — because a good book ends really fast and than it is over and I have to look for a new book. I would love longer reads but I can not intentionally slow me down. A book with just 120 pages I consider … lets say most under one hour reading — a short story and I get really pissed when a lot of authors divide their books now in 10 little episodes instead of writing one or two real full stories with 400 or even more pages (esp. self published) ",
            "date": "Updated October 26, 2020",
            "views": "58",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Tracy Sanford Auerbach",
                "href": "/profile/Tracy-Sanford-Auerbach"
            },
            "answer_text": "Yes, but in my experience it takes many hours and a lot of commitment. I’m an author and an avid reader, who reads about 70 books a year. When I get sucked into the world of a book, I begin reading it obsessively, much like binging a Netflix series. I sometimes stay up until 2 or 3 in the morning reading (leading to the Unique ‘book hangover’). I wouldn’t recommend it as an everyday practice, but yes, it can be done. ",
            "date": "Answered July 26, 2020",
            "views": "229",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Dan Wofford",
                "href": "/profile/Dan-Wofford-1"
            },
            "answer_text": "Sure but an easier on the eyes method is Audible. I go through Audio books like candy on Halloween these days. I find the 3 Books a month “Gold” Membership during the Covid crisis to be a bit underwhelming and easily triple that. It is just a common practice for me to have a story going throughout the day. Just a thought if you are a slow reader but love a good book. ",
            "date": "Answered July 25, 2020",
            "views": "67",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Jakub Mařík",
                "href": "/profile/Jakub-Mařík-2"
            },
            "answer_text": "When book is interesting and person is used to read, then without bigger problem. I usually take such book when I am traveling from my home to Prague and back. It takes cca 3,5 hours to get there and back and more then once I finished whole book. The most pages I ever read during one day was probably second half of Towers of Midnight and whole A Memory of Light, when I was finishing Wheel of Time series for first time - approximately 1300 pages - but I have to admit I was so tired then I fell asleep like ten minutes after putting book down. ",
            "date": "Answered July 25, 2020",
            "views": "84",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Akash VM",
                "href": "/profile/Akash-VM-1"
            },
            "answer_text": "Yes. It is possible. You could read actually more than 300 pages. Reading 300 pages take 4 and half hours 350 pages is most of the novels and it takes 5 to 5 and half hours. ",
            "date": "Answered July 26, 2020",
            "views": "42",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Adelina Hamilton",
                "href": "/profile/Adelina-Hamilton"
            },
            "answer_text": "Absolutely! I've done that many times. However, if you don't like the book you're reading and you're forcing yourself to read it, it can be very hard to read that many pages in a day. ",
            "date": "Answered July 25, 2020",
            "views": "199",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Robert Čiček",
                    "user_href": "/profile/Robert-Čiček"
                }
            ]
        },
        {
            "author_info": {
                "name": "Elaine Goff",
                "href": "/profile/Elaine-Goff-1"
            },
            "answer_text": "Most people can read 300 pages in about 5 hours, so yes, if you have 5 hours free in your day you can absolutely read 300 pages in one day. ",
            "date": "Answered July 27, 2020",
            "views": "36",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Gerald Pierson",
                    "user_href": "/profile/Gerald-Pierson"
                }
            ]
        },
        {
            "author_info": {
                "name": "Dominik Brodrecht",
                "href": "/profile/Dominik-Brodrecht"
            },
            "answer_text": "If you put your mind to it, yes. Or if you love reading. It’s not as hard to accomplish as one might think. ",
            "date": "Answered July 25, 2020",
            "views": "138",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Robert Čiček",
                    "user_href": "/profile/Robert-Čiček"
                }
            ]
        }
    ]
}