{
    "title": "Is it illegal to buy essays? - Quora",
    "tags": [
        "Essay Writing Services",
        "College Application Essays",
        "Essay Writing Help",
        "Illegal and Illicit Activities",
        "Essays",
        "Writing Advice",
        "Photographs",
        "Writing",
        "Legal Issues and Law in Everyday Life"
    ],
    "response": [
        {
            "author_info": {
                "name": "Julia Jacklin",
                "href": "/profile/Julia-Jacklin-2"
            },
            "answer_text": "Colleges and universities could frown on the observe of scholars hiring writers to try to their work and essays, nevertheless altogether fairness, if they were to forbid this observe, they'd even have to search out some way to forbid students obtaining facilitate from real folks for his or her essays. Most students already do that. It is smart for a student to try to moreover as doable in their school assignment so that they earn the grades which will get them into higher places of learning. ",
            "date": "Answered March 22, 2019",
            "views": "217",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Jammal Marly",
                    "user_href": "/profile/Jammal-Marly"
                },
                {
                    "user_id": "Julia McManaman",
                    "user_href": "/profile/Julia-McManaman"
                }
            ]
        },
        {
            "author_info": {
                "name": "Aliyah Bricks",
                "href": "/profile/Aliyah-Bricks"
            },
            "answer_text": "Every one has different perception regarding these services, what I believe is if a person wants consultation from experts to present outclass essay before professor to earn good grades so what can students do. Instead of cheating or copying others content they take guidance from writing experts. Some people thinks that this is an illegal act but some agree with these service to some extent because students do not have much time to do research they have to do job to afford their education. It depends on you from which perspective you think. ",
            "date": "Answered October 24, 2019",
            "views": "154",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Aimee Hanson",
                    "user_href": "/profile/Aimee-Hanson-6"
                }
            ]
        }
    ]
}