{
    "title": "Is it okay to leave a splinter where it is if you can't remove it? - Quora",
    "tags": [
        "Splinters"
    ],
    "response": [
        {
            "author_info": {
                "name": "Milly Stuchinski",
                "href": "/profile/Milly-Stuchinski"
            },
            "answer_text": "Soak your foot, or whatever body part in very hot water, but don’t burn yourself, please! We used to use Epson Salts or salt. Soak for 20 minutes, and the optimum is to do it every 2 hours, or as often as you can. This will soften the skin, so the splinter can work its way to the surface. Keep it bandaged, and treated with antibiotic cream, like Neosporin. After about 3 days, it will get infected, which is the body’s way of bringing it to the surface. Then you can squeeze it out or pick it out with a sterilized sewing needle. We used to burn the needle with a candle until it was red hot, and then let it cool down. Sometimes the splinter goes deep, and you may have to dig down to get it out. If that is the case, squeeze out the fresh blood, put alcohol or peroxide on it, and rebandage it. Growing up with OLD hardwood floors, and going mostly barefoot, we were subject to getting splinters. We would get wood splinters, cactus splinters, thorns, and bee stings. This is how we treated them. There is only one time I had to see a doctor about a splinter. It was a pretty long splinter in my foot. If your nearby lymph glands swell, or you get a fever, you should see a doctor. We were poor, and couldn’t afford to see a doctor for a relatively small matter, like a splinter. Let me know if this works for you. I know I am going to get a lot of feedback about this answer! If you can afford it, go to a doctor. That is what everyone will say. ",
            "date": "Answered July 2, 2018",
            "views": "98",
            "upvotes": " View 9 Upvoters",
            "upvoters": [
                {
                    "user_id": "Jhon Blon",
                    "user_href": "/profile/Jhon-Blon"
                },
                {
                    "user_id": "Elizabeth Johnson",
                    "user_href": "/profile/Elizabeth-Johnson-470"
                },
                {
                    "user_id": "Gautam Chopra",
                    "user_href": "/profile/Gautam-Chopra-8"
                },
                {
                    "user_id": "Gimena De Sarriera",
                    "user_href": "/profile/Gimena-De-Sarriera"
                },
                {
                    "user_id": "B Singha",
                    "user_href": "/profile/B-Singha-1"
                },
                {
                    "user_id": "Bella Bella",
                    "user_href": "/profile/Bella-Bella-226"
                },
                {
                    "user_id": "Caroline Van Der Ryst",
                    "user_href": "/profile/Caroline-Van-Der-Ryst-1"
                },
                {
                    "user_id": "Erika Paige MacKenzie",
                    "user_href": "/profile/Erika-Paige-MacKenzie"
                },
                {
                    "user_id": "Sanyam Srivastava",
                    "user_href": "/profile/Sanyam-Srivastava-2"
                }
            ]
        },
        {
            "author_info": {
                "name": "Michael Callais",
                "href": "/profile/Michael-Callais"
            },
            "answer_text": "As long as it's not showing signs of infection, then you're golden. Your body will naturally expel most foreign objects on its own eventually. To speed that up, though, you can go to your local drug store and ask for some ichthammol  (pronounced ick-tha-mall in case you have to ask) ointment.  last year I was absentmindedly placing some things into a low cabinet at work and my finger skidded along the 2x4 frame and got a wood sliver about 1 cm wide, 1 mm thick, and two cm long jammed under my cuticle so far I couldn't see it no matter how far I dug. I ended up just thinking that maybe nothing ended up staying in there. It just kept getting more and more swollen. Anyways, I kept trying to dig it out, but the pain kept me from making progress (it was pretty far in and my finger was starting to get infected). Did some research, heard ichthammol helped, applied some twice daily and within 36 hours I tried gently pressing above the knuckle and the piece of wood shot out. I was amazed at how horrifyingly large it was. Went from the start of my cuticle to mid-way up the first knuckle. Thinking about it still sends shivers up my spine. Anyways, ichthammol is magical stuff and ever since I keep a tube in both my home and travel first aid kits. ",
            "date": "Answered September 11, 2015",
            "views": "338",
            "upvotes": " View 18 Upvoters",
            "upvoters": [
                {
                    "user_id": "Angelica Mendoza",
                    "user_href": "/profile/Angelica-Mendoza-206"
                },
                {
                    "user_id": "Gina Browse",
                    "user_href": "/profile/Gina-Browse"
                },
                {
                    "user_id": "Shoshi Shoshi",
                    "user_href": "/profile/Shoshi-Shoshi-2"
                },
                {
                    "user_id": "Rob Elegantor",
                    "user_href": "/profile/Rob-Elegantor"
                },
                {
                    "user_id": "Josephine De Vera",
                    "user_href": "/profile/Josephine-De-Vera-11"
                },
                {
                    "user_id": "Kalyan Raghava",
                    "user_href": "/profile/Kalyan-Raghava-7"
                },
                {
                    "user_id": "Samantha Lee",
                    "user_href": "/profile/Samantha-Lee-1103"
                },
                {
                    "user_id": "Lindsay Perz",
                    "user_href": "/profile/Lindsay-Perz"
                },
                {
                    "user_id": "Emma Tardani",
                    "user_href": "/profile/Emma-Tardani"
                },
                {
                    "user_id": "Chris White",
                    "user_href": "/profile/Chris-White-726"
                },
                {
                    "user_id": "Shujah Iqbal",
                    "user_href": "/profile/Shujah-Iqbal"
                },
                {
                    "user_id": "Brooke Burkett",
                    "user_href": "/profile/Brooke-Burkett-3"
                },
                {
                    "user_id": "Eve Grove",
                    "user_href": "/profile/Eve-Grove-1"
                },
                {
                    "user_id": "Nathan Kros",
                    "user_href": "/profile/Nathan-Kros-1"
                },
                {
                    "user_id": "Lucinda Marshall",
                    "user_href": "/profile/Lucinda-Marshall"
                },
                {
                    "user_id": "Chandu Byreddy",
                    "user_href": "/profile/Chandu-Byreddy"
                },
                {
                    "user_id": "Hannah Figueras",
                    "user_href": "/profile/Hannah-Figueras"
                },
                {
                    "user_id": "Janek Waza",
                    "user_href": "/profile/Janek-Waza"
                }
            ]
        },
        {
            "author_info": {
                "name": "Tony Ng",
                "href": "/profile/Tony-Ng-81"
            },
            "answer_text": "Depends on where it is - bear in mind, any foreign object (like common wood splinters) are likely not sterile, and may cause inflammation or infection, so generally it’s best to have it removed. If it’s a small splinter in areas like hand/feet, however, it usually works its way out within a week or two, so if no erythema (redness), swelling, pain, purulence (pus), you should be fine. If it’s in more sensitive areas, best to either remove it (using sterilised needles/tweezers) yourself if possible, if not, consult your local physician. ",
            "date": "Answered May 27, 2017",
            "views": "102",
            "upvotes": " Answer requested by Jackson Weiman",
            "upvoters": [
                {
                    "user_id": "Rob Elegantor",
                    "user_href": "/profile/Rob-Elegantor"
                },
                {
                    "user_id": "Spartan Mjolnir",
                    "user_href": "/profile/Spartan-Mjolnir"
                }
            ]
        },
        {
            "author_info": {
                "name": "John T Helman",
                "href": "/profile/John-T-Helman"
            },
            "answer_text": "Absolutely not under no circumstances it will invariably lead to an infection and it's possible it could find it's way into your bloodstream a great big No No .I've worked in timber mills . The University of timber splinter knowledge there's a good chance your body will expel it but it's not 100%definite it's simply not worth running the risk of letting the bastards stay there if for example you are diabetic there's a good chance it could lead to an infection a bad infection that could cost you the finger like I said you can leave it but you're a mug if you do ",
            "date": "Answered October 10, 2017",
            "views": "44",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Arnis Tarassu",
                "href": "/profile/Arnis-Tarassu"
            },
            "answer_text": "Yes. Human body is designed to get rid of foreign objects if they are not passive. Month ago I thought I got all out but after a week it was kinda warm and red. When I pressed it popped like a small zit and that piece of wood came out :)I also have a piece of glass in my heel. I did visit the doctor a week later and he said: too late. It is in a cocoon now. Within a week the iching will be gone and you will forget that. That was also true. I still have it. 4 years already. But I don't remember left or right foot :D ",
            "date": "Answered September 7, 2015",
            "views": "73",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Joey Bal",
                    "user_href": "/profile/Joey-Bal"
                }
            ]
        },
        {
            "author_info": {
                "name": "Ronald Houk",
                "href": "/profile/Ronald-Houk"
            },
            "answer_text": "I wouldn’t recommend it. Nobody will see it as a foreign object and it works create an infection ",
            "date": "Answered May 4, 2018",
            "views": "15",
            "upvotes": "0"
        }
    ]
}