{
    "title": "Is it possible to write a 10k word dissertation in 2 days? - Quora",
    "tags": [
        "PhD Thesis",
        "Theses and Dissertations",
        "Academic Research"
    ],
    "response": [
        {
            "author_info": {
                "name": "Gill Bullen",
                "href": "/profile/Gill-Bullen"
            },
            "answer_text": "Yes. I don't recommend it as an approach, but yes, it can be done. I know that, because I did it. Our submission deadline was a bit vague and woolly, which gave me no real incentive to get on with it. I knew what I wanted to say, and I'd got lots of notes, but that was as far as it had progressed. On this particular Friday, our little group was doing a field trip to Salisbury Cathedral. Everyone else was going together in the minibus, but I had arranged to meet someone in Winchester Cathedral the following day, so that he could show me the restoration work he had done on the choir stalls there, and therefore drove independently to Salisbury. As soon as I stepped into the Cathedral, one of our lecturers pounced on me. “Ah, Gill! How's your dissertation coming on?” Gulp. “Er, almost finished, Miss Glasscoe!” Well, almost started, anyway… “Oh, good. So I can have it first thing on Monday? Thank you!” Great, now what had I done? I went through the very interesting day at Salisbury, stayed overnight with relatives in Bournemouth, and drove to Winchester next morning. I got back to Exeter at about eight in the evening, stopping at a local fish and chip shop to buy a fast supper, and by 8:30 I had washed my hands and was ready to start work. I typed all night. I worked all day on Sunday, and almost all of Sunday night, stopping just briefly for about two hours’ sleep at one point, and finally completed it at about 7:30 on Monday morning. All done in 36 hours! I had a bath, cooked a good breakfast for myself, and by nine o'clock was up at the university, ready to hand my dissertation in. The Department was strangely quiet. There was no reply when I tapped on my lecturer’s door, and in fact there didn't seem to be anyone around. I met one of the Department porters. Had he seen her? “Miss Glasscoe?” he said, in rich Devon tones. “No, ma loverr, she won't be in till tomorrow!” !!! I could cheerfully have committed murder. To think that I could have had a whole extra 24 hours to finish it! And she undoubtedly knew on Friday that she wasn't going to be in on Monday — wretched woman… Still, it was done. It wasn't very good, but it was done. Yes, you can write up your dissertation in two days — but I don't recommend it! ",
            "date": "Answered August 12, 2020",
            "views": "34",
            "upvotes": " View 55 Upvoters",
            "upvoters": [
                {
                    "user_id": "Gene Mariani",
                    "user_href": "/profile/Gene-Mariani"
                },
                {
                    "user_id": "Soraya Atherton",
                    "user_href": "/profile/Soraya-Atherton"
                },
                {
                    "user_id": "Charlotte Grey",
                    "user_href": "/profile/Charlotte-Grey-9"
                },
                {
                    "user_id": "Andrea Marino",
                    "user_href": "/profile/Andrea-Marino-1"
                },
                {
                    "user_id": "Billy Boardman",
                    "user_href": "/profile/Billy-Boardman"
                },
                {
                    "user_id": "Avi Zeff",
                    "user_href": "/profile/Avi-Zeff-1"
                },
                {
                    "user_id": "John Fleming",
                    "user_href": "/profile/John-Fleming-40"
                },
                {
                    "user_id": "Kelsey L. Hayes",
                    "user_href": "/profile/Kelsey-L-Hayes"
                },
                {
                    "user_id": "Daniel Hungerford",
                    "user_href": "/profile/Daniel-Hungerford"
                },
                {
                    "user_id": "Judy Roro",
                    "user_href": "/profile/Judy-Roro"
                }
            ]
        }
    ]
}