{
    "title": "Is Internet Archive illegal? - Quora",
    "tags": [
        "Internet Archive",
        "Internet Law",
        "World Wide Web"
    ],
    "response": [
        {
            "author_info": {
                "name": "Paul Wilson",
                "href": "/profile/Paul-Wilson-82"
            },
            "answer_text": "Why would it be illegal? Although I guess you’re thinking about copyright infringement. There are, no doubt, sites that don’t want their content copied for posterity. I would imagine Disney would be one of those bearing in mind their harsh attitude to copyright protection. That being the case, I would be surprised if sites like that are ever copied. If the Archive makes a mistake and gets a request to remove copied data, I’m sure they’ll comply. It’s not worth their time or money fighting it. For sites that don’t want to be archived, the simplest solution is to edit their “robots.txt” file to exclude the archive crawler, or all crawlers if that’s their preference. The actual Internet Archive itself as an idea certainly isn’t illegal, at least not in any Western country. China would doubtless find it unacceptable because they appear to like reinventing history, and you can’t successfully do that if the past is available to everyone. Which suggests that authoritarian regimes in general won’t be in favour. Mind you, there appear to be politicians in a lot of countries who don’t like their past opinions or actions made public. ",
            "date": "Answered December 24, 2019",
            "views": "192",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Arun S Sharma",
                    "user_href": "/profile/Arun-S-Sharma"
                },
                {
                    "user_id": "Caleb Harrison",
                    "user_href": "/profile/Caleb-Harrison-19"
                },
                {
                    "user_id": "Ed Snavely",
                    "user_href": "/profile/Ed-Snavely"
                }
            ]
        },
        {
            "author_info": {
                "name": "Ashish Desai",
                "href": "/profile/Ashish-Desai-224"
            },
            "answer_text": "Copy Right…!!! Legal or Illegal…!!! Sir…Everything can be copied and skeptical people would always try to restrict it. Hence, don’t afraid…Don’t get scared…!!! LOL… Ha ha ha ha ha ha Enjoy LIFE… BE HAPPY… ",
            "date": "Answered December 24, 2019",
            "views": "25",
            "upvotes": "0"
        }
    ]
}