{
    "title": "Is it considered bad writing for an author to base a character after themselves? - Quora",
    "tags": [
        "Creative Writing",
        "Fictional Characters",
        "Writers and Authors",
        "Writing Advice"
    ],
    "response": [
        {
            "author_info": {
                "name": "Bianca White",
                "href": "/profile/Bianca-White-62"
            },
            "answer_text": "Not necessarily. It’s good to write what you know and to write from a perspective you understand. There’s a long history of great authors writing their own experiences or inserting themselves into their stories. That said, basing a character on yourself can go horribly wrong. When you base a character on yourself you obviously identify with them and care about them more. You want things to go well for them, you want them to survive, you don’t want them to look stupid or do anything unlikable. You want them to be strong, and smart, and lovable, because we all want to be those things. That’s where a character could start to slide into Mary-Sue territory and become all-wise, all-powerful, universally beloved, or just the center of the story who minimizes all other characters and details the plot. The problem occurs when the character isn’t just based on you, but you start treating them like they are you, or worse, the idealized you. Even memoirs can fall victim to the desire we all have to feel liked, or only let people see our best side, or to skip over things that are embarrassing or painful. Remember A Million Little Pieces? James Frey was found to have made up a considerable amount of his “memoir.” In a new forward to the book, he apologizes for having made himself seem \"tougher and more daring and more aggressive than in reality I was, or I am” and said \"People cope with adversity in many different ways, ways that are deeply personal… My mistake… is writing about the person I created in my mind to help me cope, and not the person who went through the experience.\" He also admitted he changed things to improve the literary flow or up the drama. I really loved Norman Rockwell’s My Adventures as an Illustrator: in his forward he explained that he always seeks the brighter side of things and consciously chose not to mention his wife’s struggle with alcoholism. Point being, it’s not easy to write about yourself, even in a fictionalized way, but it doesn’t make you a bad writer to try. Just don’t get too protective of your character. Kill your darlings… or at least make sure they serve the story instead of the other way around. ",
            "date": "Answered February 12, 2020",
            "views": "94",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Sindra Jenkins",
                    "user_href": "/profile/Sindra-Jenkins"
                }
            ]
        },
        {
            "author_info": {
                "name": "Brian Good",
                "href": "/profile/Brian-Good-6"
            },
            "answer_text": "Many celebrated works have been based on the author’s persona and point of view and experiences. (Conrad and Melville, for instance, wrote a lot about ship captains. Henry Miller and Jack Kerouac seem to have written mostly about themselves.) So it’s not necessarily bad writing per se to base a character on yourself. However, a lot of amateur writers are drawn to write about themselves or, worse yet, about idealized fantasy versions of themselves. (The put-down line is “He’s his own favorite character in fiction.”) So writing about yourself is not necessarily going to be bad writing, but a lot of bad writing is about the author. Ultimately you write whatever it’s possible for you to write, so if you can’t find anything to write about but yourself, it’s better to do so than it is not to write at all. A couple of hints: put yourself in as John, not Jesus; Ishmael, not Ahab; Nick, not Gatsby; Chief Broom, not MacMurphy. Put yourself in as the witness, the story teller. Put yourself in as the bad guy, not the good guy. A schlimazel, maybe a schlemiel. When your character banters with other people, always let your counterparty have the clever lines. ",
            "date": "Answered February 12, 2020",
            "views": "106",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Gabriella Esquivel",
                    "user_href": "/profile/Gabriella-Esquivel-7"
                }
            ]
        }
    ]
}