{
    "title": "Is paying someone to write an essay illegal? - Quora",
    "tags": [
        "Essays",
        "Writing Advice"
    ],
    "response": [
        {
            "author_info": {
                "name": "Harry Kriewaldt",
                "href": "/profile/Harry-Kriewaldt"
            },
            "answer_text": "Usually not in and of itself, no. You could ask me to write an essay about something if you wanted, and depending on the topic and the amount (and other factors), we may well come to an agreement. Nothing illegal in that regard. The issue, though, will be what you’d do with the essay afterwards. If you were to pass it off as your essay, that would be at least unethical in an educational environment. It may be sufficiently unethical that you’d get kicked out of that environment for your troubles, which wouldn’t be a good outcome for you at all. If you were to pass my essay off as your work in some other regard, you could run into other issues, too. But, for example, if you were to say to me “Could you write an essay to include in this book of essays about [topic] that we’re going to publish? We’ll pay you a bit for doing so”, there’s nothing at all wrong with that. ",
            "date": "Answered July 8, 2020",
            "views": "64",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Sarah Madden",
                    "user_href": "/profile/Sarah-Madden-11"
                }
            ]
        },
        {
            "author_info": {
                "name": "Stan Kihu",
                "href": "/profile/Stan-Kihu"
            },
            "answer_text": "My opinion. It's unethical but it is not illegal. At times you could be occupied with other higher valuable tasks then you have to outsource other tasks to someone who can do it. You might not have all the time for all of the tasks at hand Besides, while studying you do not enjoy all the units or topics assigned hence you may give it someone else to do it for you. Other students take courses that are complex to them. Finally, a student may face writer's block. He/she has nothing to write. What should they do? You'll have to pay someone to do it for you. ",
            "date": "Answered July 13, 2020",
            "views": "26",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Efrayim Bulka",
                    "user_href": "/profile/Efrayim-Bulka-1"
                }
            ]
        }
    ]
}