{
    "title": "Is poetry a lost art? - Quora",
    "tags": [
        "Writing Poetry",
        "Poets",
        "Poems",
        "Poetry",
        "Creative Writing"
    ],
    "response": [
        {
            "author_info": {
                "name": "C.J. Heck",
                "href": "/profile/C-J-Heck"
            },
            "answer_text": " The Role of a Poet To say what others cannot is truly a mark of greatness. But have all the noble poems been written by classical masters and the gifted poets of today?  Are there meaningful works still left to pen, not merely big words from swollen egos spilling their contents at the whim of a moment, nor with the simplistic meanderings of joy or grief or love? To answer the question, I say write on, dear poets. Don’t allow your words to decay unwritten in the brilliant minds of today where they'll lie barren and unread only to wither and crack and parch as clay in the desert. I do believe there are jewels left to be written. But if we must write, it should be for the future, for the common man who will gain most from words he cannot write. We have an obligation to write in a way that he may glean what he can from writings of poetic merit, not stumble through obscure words which are to him, like bird droppings on a splintered windowsill, left to die in obscurity gathering nothing but dust. If we must write, let us write for those who are unable, so the future might find our words alive and fertile, their tilled soil begun as thoughts and feelings first seeded in keen minds, then sown into black and white, rich and green and lush, to live on in future hearts and minds even as we crumble, ashes to ashes, and blow away, dust to dust. May we always write not to say what we can all say, but what many are unable to say -- not just for now, but for forever. [From the book, “Anatomy of a Poet”, by CJ Heck] ",
            "date": "Updated December 31, 2017",
            "views": "11",
            "upvotes": " View 16 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Ar.Sheera Betnag",
                    "user_href": "/profile/Ar-Sheera-Betnag"
                },
                {
                    "user_id": "Ravi",
                    "user_href": "/profile/Ravi-1267"
                },
                {
                    "user_id": "Edwin El-Mahassni",
                    "user_href": "/profile/Edwin-El-Mahassni"
                },
                {
                    "user_id": "Amy Will",
                    "user_href": "/profile/Amy-Will-26"
                },
                {
                    "user_id": "Pramodya Thilakarathna",
                    "user_href": "/profile/Pramodya-Thilakarathna"
                },
                {
                    "user_id": "James Mayes",
                    "user_href": "/profile/James-Mayes-14"
                },
                {
                    "user_id": "Jackson Angel",
                    "user_href": "/profile/Jackson-Angel"
                },
                {
                    "user_id": "Anold Jean Charles",
                    "user_href": "/profile/Anold-Jean-Charles"
                },
                {
                    "user_id": "Husnain Khalil",
                    "user_href": "/profile/Husnain-Khalil"
                },
                {
                    "user_id": "David Olden",
                    "user_href": "/profile/David-Olden"
                }
            ]
        },
        {
            "author_info": {
                "name": "Lee Ballentine",
                "href": "/profile/Lee-Ballentine"
            },
            "answer_text": "No, far from it. There are more poetry magazines and journals than ever before. There are more poetry programs in colleges and universities. There are more books of poetry being published than ever before. There are more awards. More poets and poetry-related happenings are in the news than ever before. Poetry is undergoing the greatest explosion and flowering worldwide in its history. This is the heyday of poetry. There is a sad corrollary to this. Poetry is also socially and politically more dangerous than ever before. More poets are in prison, or their works are being censored, or in extreme cases are facing the death penalty than ever before around the world. Saudi court shifts sentence on jailed poet: 800 lashes instead of death ",
            "date": "Answered June 30, 2016",
            "views": "484",
            "upvotes": " View 5 Upvoters",
            "upvoters": [
                {
                    "user_id": "Chang Liu",
                    "user_href": "/profile/Chang-Liu-362"
                },
                {
                    "user_id": "Vruta Gupte",
                    "user_href": "/profile/Vruta-Gupte"
                },
                {
                    "user_id": "Cindy Foster",
                    "user_href": "/profile/Cindy-Foster-11"
                },
                {
                    "user_id": "Jordan Howerton",
                    "user_href": "/profile/Jordan-Howerton-1"
                },
                {
                    "user_id": "Tindi Crosbie",
                    "user_href": "/profile/Tindi-Crosbie"
                }
            ]
        }
    ]
}