{
    "title": "Is reading 20 pages a day enough for a novel? - Quora",
    "tags": [
        "Novels",
        "Reading"
    ],
    "response": [
        {
            "author_info": {
                "name": "Sneha Jaiswal",
                "href": "/profile/Sneha-Jaiswal-56"
            },
            "answer_text": "Yes and No! It really depends on your drive. A true book lover with an awesome novel in hand cannot take her or his hands off the pages until they get to the end. Getting time to just read 20 pages a day can be sheer torture in that case. My friends and I have turned into zombies while reading exciting novels. No sleeping until we get to the end! Since I don't know why would you wonder such a thing, I will assume that you are either new to reading or don't have the time to read. In either case, if you actually are able to read at least 20 pages every day, then it's enough. But if you do have the time to read more, notch it up to 50 pages at least. 20 pages is good for textbooks, but novels, I think they need more love and time! ",
            "date": "Answered December 31, 2016",
            "views": "23",
            "upvotes": " View 5 Upvoters",
            "upvoters": [
                {
                    "user_id": "Jackie Chan",
                    "user_href": "/profile/Jackie-Chan-391"
                },
                {
                    "user_id": "Chandra Prabhat Jaiswal",
                    "user_href": "/profile/Chandra-Prabhat-Jaiswal"
                },
                {
                    "user_id": "Rishi Jalan",
                    "user_href": "/profile/Rishi-Jalan-5"
                },
                {
                    "user_id": "Debanjana Palit",
                    "user_href": "/profile/Debanjana-Palit"
                },
                {
                    "user_id": "Madhuri Dayalan",
                    "user_href": "/profile/Madhuri-Dayalan"
                }
            ]
        },
        {
            "author_info": {
                "name": "Timothy Ellis",
                "href": "/profile/Timothy-Ellis-4"
            },
            "answer_text": "So I gather from your question you hate reading. You also have no attention span at all. No, I’m not trying to insult you. 20 pages a day? That’s not reading. Its taking a microscope to the letters. I’m not the fastest reader around, but I average more than 20 pages an HOUR. I complete an average novel in less than 10 hours. In fact, only the longer ones take much more than 6 hours. If I start a novel anytime in the morning, it will be complete before I go to bed. To answer your question, NO! Now, if your question had been, ‘is it ok to read 20 pages a night before I go to bed, in order to slow my body down so I can sleep easier’ - then yes. But 20 pages a day? Why even bother? ",
            "date": "Answered December 31, 2016",
            "views": "15",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Mark Grinstein-Camacho",
                "href": "/profile/Mark-Grinstein-Camacho"
            },
            "answer_text": "Sure. At 20 pages a day, you'll get through a 300-page novel in 15 days, which is hardly more than 2 weeks. Each 20-page chunk will be enough to immerse you and further the plot, and you'll read fast enough that you won't forget the beginning before you get to the end. You can even read more slowly, if that fits with your schedule or attention span better. I've been known to chew over longer books for over a month. ",
            "date": "Answered December 31, 2016",
            "views": "799",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Kozette Feaster",
                    "user_href": "/profile/Kozette-Feaster-1"
                },
                {
                    "user_id": "Jane",
                    "user_href": "/profile/Jane-549"
                },
                {
                    "user_id": "Gramos Merovci",
                    "user_href": "/profile/Gramos-Merovci"
                }
            ]
        },
        {
            "author_info": {
                "name": "Hassan Hsd",
                "href": "/profile/Hassan-Hsd"
            },
            "answer_text": "Yes. We are not on a race. Read as much pages as you can, you are reading for yourself, don’t exhaust it. Not everyone has the ability to read a whole novel in one day or even three. You need to put a plan, ask yourself, how many pages I want to read in each day?. Your schedule will be your daily routine, and reading is a habit that gets better day after day, practice and you’ll find yourself reading 40–60 pages everyday or even 100 pages. Remember you read a novel in your free time, this time varies from one to another. Don’t compare yourself to others, and continue reading and you’ll improve this habit with days. ",
            "date": "Answered December 31, 2016",
            "views": "969",
            "upvotes": " View 6 Upvoters",
            "upvoters": [
                {
                    "user_id": "Kozette Feaster",
                    "user_href": "/profile/Kozette-Feaster-1"
                },
                {
                    "user_id": "Martie Kelley",
                    "user_href": "/profile/Martie-Kelley"
                },
                {
                    "user_id": "Aniket Sethi",
                    "user_href": "/profile/Aniket-Sethi-3"
                },
                {
                    "user_id": "Jane",
                    "user_href": "/profile/Jane-549"
                },
                {
                    "user_id": "Tasha Osborne",
                    "user_href": "/profile/Tasha-Osborne-2"
                },
                {
                    "user_id": "Gramos Merovci",
                    "user_href": "/profile/Gramos-Merovci"
                }
            ]
        },
        {
            "author_info": {
                "name": "Suman Verma",
                "href": "/profile/Suman-Verma-63"
            },
            "answer_text": "It depends on ur intrest over a book s ur understanding of it, if u really love that book that book s have curiosity of what will happen next then surely u can do it. Bcoz I have experienced it, I read the whole novel Gunavo ka Devata by Dharamveer bharti in a day, bcoz I was curious through out the novel that what happens next. So it depends upon the interest the book arouse in u or ur intrest over the book. ",
            "date": "Answered December 31, 2016",
            "views": "416",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Davida Chazan",
                "href": "/profile/Davida-Chazan"
            },
            "answer_text": "That depends on how quickly or slowly you read, as well as how much time you have for reading. ",
            "date": "Answered December 31, 2016",
            "views": "187",
            "upvotes": "0"
        }
    ]
}