{
    "title": "Is redundancy grammatically incorrect? - Quora",
    "tags": [
        "Redundancy",
        "Grammar",
        "English Grammar"
    ],
    "response": [
        {
            "author_info": {
                "name": "Jack Butler",
                "href": "/profile/Jack-Butler-66"
            },
            "answer_text": "No, it's not. Not grammatically. When it comes to style, on the other hand… well. No, it's not even incorrect there, either. There are certain things that using redundancy enables in your phrases that are very useful. In more formal writing, you want to eliminate every single little bit of redundant, repeated verbiage. In fictional works, getting rid of the crufty excess of redundant words can lend a particular tone or snappiness to the prose which makes the story easier to parse and digest. But! But. Effective use of redundancy can help to emphasize things. Like when a speechmaker repeats a point three times. The first time should be enough. The second time is more than enough. The third time drives it home. Or, on the other hand, redundancy might give a certain character to a passage. Especially when used judiciously. So even then, speaking stylistically, it's not incorrect, per se. Possibly less desirable. But it can serve a stylistic purpose. I do hope I wasn't overly redundant in this answer. (Who am I kidding. I hope I employed more redundancy than was good for my point.) ",
            "date": "Answered January 26, 2020",
            "views": "84",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Jean Rafenski Reynolds",
                "href": "/profile/Jean-Rafenski-Reynolds"
            },
            "answer_text": "Of course not. There’s a lot of redundancy in the English language. Take a look at this sentence: “He often uses his car to visit his brother.” This sentence is loaded with redundancy. It tells you three times that the subject is male (he, his, his). It tells your four times that the subject is singular (he, uses, his, his). The redundancy built into English is useful in noisy situations where you might not clearly hear the entire sentence. Often you’ll still get the meaning. ",
            "date": "Answered January 29, 2020",
            "views": "52",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Tijani Kehinde John",
                    "user_href": "/profile/Tijani-Kehinde-John"
                },
                {
                    "user_id": "Mohammed Saiful Alam Siddiquee",
                    "user_href": "/profile/Mohammed-Saiful-Alam-Siddiquee"
                }
            ]
        }
    ]
}