{
    "title": "Is the following a complete sentence, “The mayor.”? - Quora",
    "tags": [
        "English Sentences",
        "Grammar"
    ],
    "response": [
        {
            "author_info": {
                "name": "Barnaby Page",
                "href": "/profile/Barnaby-Page"
            },
            "answer_text": "Most people would say no, because at minimum, a sentence must either: • contain a subject and a verb, as in The mayor sneezed. • OR be a question, as in Why? • OR be a command, as in Stop! However, in practice, verbless statements like The mayor are frequently used as if they were sentences. But it is only meaningful if taken in context. For example, if I asked Who is more powerful, the police chief or the mayor? and you replied The mayor, that would be meaningful. Strictly speaking, to make a grammatically correct sentence you should say The mayor is more powerful. But in practice today, the statement The mayor would be acceptable in many kinds of writing - and certainly in spoken English. ",
            "date": "Answered November 28, 2017",
            "views": "438",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Ravi Reddy",
                    "user_href": "/profile/Ravi-Reddy-19"
                },
                {
                    "user_id": "Frank Dauenhauer",
                    "user_href": "/profile/Frank-Dauenhauer"
                },
                {
                    "user_id": "Chris Hough",
                    "user_href": "/profile/Chris-Hough-18"
                }
            ]
        },
        {
            "author_info": {
                "name": "Greg Hutchinson",
                "href": "/profile/Greg-Hutchinson-4"
            },
            "answer_text": "It all depends on context. By itself, out of context, “The mayor” isn’t a sentence. But in answer to the question, “Who has more power in this city than the chief of police?” a good answer might be “The mayor.” Back in the Dark Ages, and I suspect to this day, this would have been called an elliptical sentence. A fuller answer would be “The mayor does,” or “The mayor has more power in this city than the chief of police.” The last alternative shows you why an elliptical sentence would be used. Why repeat so much? The questioner knows what she/he asked. Actually, adding “does” makes it a full sentence and it’s less abrupt, so if you want to be more polite, “The mayor does” is a better answer. But in this context, just “The mayor” is also a true sentence. ",
            "date": "Answered November 28, 2017",
            "views": "305",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Tanja Subotić",
                    "user_href": "/profile/Tanja-Subotić"
                },
                {
                    "user_id": "Frank Dauenhauer",
                    "user_href": "/profile/Frank-Dauenhauer"
                },
                {
                    "user_id": "Chris Hough",
                    "user_href": "/profile/Chris-Hough-18"
                }
            ]
        },
        {
            "author_info": {
                "name": "Frank Dauenhauer",
                "href": "/profile/Frank-Dauenhauer"
            },
            "answer_text": "Is the following a complete sentence, “The mayor.”? As it stands, no, it is not a complete sentence, lacking a verb. However, if it is in answer to a previously stated question, such as “Who in this town has the authority to fire the police chief?” then it could be considered a sentence with the following added imagined words: “The mayor [has the authority].” ",
            "date": "Answered November 28, 2017",
            "views": "127",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Douglas Trickey",
                    "user_href": "/profile/Douglas-Trickey"
                },
                {
                    "user_id": "Aakanksha",
                    "user_href": "/profile/Aakanksha-14"
                }
            ]
        },
        {
            "author_info": {
                "name": "Wes Hancock",
                "href": "/profile/Wes-Hancock-1"
            },
            "answer_text": "It is a complete idea only when in response to a question which details the circumstances. This is in the same way that the reply to a question can be simply ‘Yes!’ The rest is understood by the framing of the question. So ‘yes’ could mean ‘That was the person I saw last Friday evening in the Square, wearing a chain of office and carrying an umbrella’, if that was the way that the question was put. ",
            "date": "Answered December 4, 2017",
            "views": "31",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Brent Smith",
                    "user_href": "/profile/Brent-Smith-103"
                }
            ]
        },
        {
            "author_info": {
                "name": "Lon Richardson",
                "href": "/profile/Lon-Richardson"
            },
            "answer_text": "\"The mayor\" is not a sentence, it is a fragment. To be a sentence, it must have a verb; the mayor must do something. ",
            "date": "Answered November 28, 2017",
            "views": "10",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Robert Ball",
                "href": "/profile/Robert-Ball-36"
            },
            "answer_text": "No ",
            "date": "Answered November 28, 2017",
            "views": "9",
            "upvotes": "0"
        }
    ]
}