{
    "title": "Is this the correct sentence? 'Your small contribution can change the life of many'? - Quora",
    "tags": [
        "English Language Writing Advice",
        "English Sentence Writing Advice",
        "English Grammar Writing Advice",
        "English Sentences",
        "Sentences (language)",
        "Writing Advice",
        "Grammar",
        "English Grammar"
    ],
    "response": [
        {
            "author_info": {
                "name": "Janet Ajogbe",
                "href": "/profile/Janet-Ajogbe"
            },
            "answer_text": "Is this a grammatically correct sentence? Almost. It should be: Your small contribution can change the lives of many.  It’s “lives”, not “life” because by “many”, you’re referring to more than one person (plural) and therefore more than one life. There are a few other ways you could express that sentence. Some examples: 1. Your small contribution is not small to many others’ lives. (Making a comparison - what is small to you is big to someone else) 2. Your small contribution can have a ripple effect on others’ lives. (A ripple on a lake starts small but eventually covers the whole body of water) 3. Your small contribution can change many people’s lives. Remember that you want to express something that touches people in an emotional and heartfelt way in this sentence. As such, the above examples are more effective. ",
            "date": "Answered June 26, 2020",
            "views": "14",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Paul Haynes",
                "href": "/profile/Paul-Haynes-17"
            },
            "answer_text": "Is this the correct sentence? \"Your small contribution can change the life of many\"? Normally it would be “the lives of many.” In your original sentence, “many” implies “many people.” That is a plural. Many people will have many lives, also plural. Use of “life” instead of “lives” might be acceptable, with a somewhat differwent meaning. “Life” would imply a very general idea of life experience, the same for everyone. “Lives” would identify people’s life experiences separately. People ordinarily do not share a singular life experience, except in a figurative sense. ",
            "date": "Answered June 11, 2020",
            "views": "53",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Mahnoor Nizami",
                    "user_href": "/profile/Mahnoor-Nizami-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Anthony Jones",
                "href": "/profile/Anthony-Jones-231"
            },
            "answer_text": "Yep. I hope this helps. ",
            "date": "Answered June 11, 2020",
            "views": "7",
            "upvotes": " Answer requested by Mahnoor Nizami"
        }
    ]
}