{
    "title": "Is technical writing a dying career? - Quora",
    "tags": [
        "Technical Writers",
        "Technical Writing"
    ],
    "response": [
        {
            "author_info": {
                "name": "Ugur Akinci",
                "href": "/profile/Ugur-Akinci"
            },
            "answer_text": "As long as people need to understand how something works, there will be technical writing. Sometimes I think whether one day robots with AI write all our tech documents but I honestly don’t think so because systems and gadgets don’t have a need for tech documents; people do. And how any AI system can understand what the humans need? That would be like an AI system understanding and responding to why I like marshmallows but not care that much about cupcakes. Having said that, I believe some tech documents can and will be automated in the future, obviating the need for a human writer. For example, I believe there will be AI systems that scan a software product from a to Z, test out what each control and link is doing, take appropriate screenshots and assemble them to come up with a static screen-by-screen documentation. That would be a document that reads like “if you click this, that happens.” That’s certainly a job that can be handled by “machines.” I believe even API documentation can be handled one day by AI systems since it’s all about programming objects, their methods and properties. The predictable stuff. However, there is also a purpose driven and best-practice-based writing in which you tell the user the best way to do something or how to solve typical issues while using the imperfect system. To do that kind of documentation properly you need to be aware of human expectations and shortcomings and “use cases” that will always require human cognition. It takes an error-maker to understand what the other error-maker is going through. And for that precise reason, since an “error” is a “malfunction” for an AI system but a characteristic of the average human workflow, we will always have technical writers speaking to their own kind and preemptively suggesting the “optimal” way (given specific limitations and risk factors in any specific project) to achieve a given goal. Lastly and related to the above, since all tech writing is geared towards achieving a certain end, only humans can decide what would be a SIGNIFICANT goal to achieve but not AI systems. That’s the kind of input that matters the most that would always require a human technical writer. ",
            "date": "Answered January 21, 2019",
            "views": "11",
            "upvotes": " View 7 Upvoters",
            "upvoters": [
                {
                    "user_id": "Lisa Palacios Fernandez",
                    "user_href": "/profile/Lisa-Palacios-Fernandez"
                },
                {
                    "user_id": "Audrey Cormier",
                    "user_href": "/profile/Audrey-Cormier"
                },
                {
                    "user_id": "Samonte Sarah",
                    "user_href": "/profile/Samonte-Sarah"
                },
                {
                    "user_id": "Saurabh Bansod",
                    "user_href": "/profile/Saurabh-Bansod-2"
                },
                {
                    "user_id": "Michael Meyer",
                    "user_href": "/profile/Michael-Meyer-349"
                },
                {
                    "user_id": "Craig Cardimon",
                    "user_href": "/profile/Craig-Cardimon-1"
                },
                {
                    "user_id": "The Brook",
                    "user_href": "/profile/The-Brook-5"
                }
            ]
        },
        {
            "author_info": {
                "name": "George Abraham",
                "href": "/profile/George-Abraham-19"
            },
            "answer_text": "Technical Writing or Technical Communication or Technical Documentation is much older than you think. Since you see Technical Writing through the IT prism, I will skip the kind of work done by Documentation Departments in Automobile/Aviation or other branches of Engineering. This field came into vogue with the boom in the IT sector and is naturally looking like a dying field since the entire IT sector is going through a major churn. Don’t you see the need for developers and testers reducing by the day? In the IT industry, the documents prepared by Developers and QA Engineers are internal documents that are demanded by the process but never fit to be shared or even required by the clients. They are moreover confidential in nature.In a competitive market where developers and testers are struggling with crazy deadlines, where will they have the time to prepare a proper user manual, online help or training video?The need for manuals depend on the software being documented. For example, an Enterprise software would require elaborate documentation whereas a Mobile App may not even require one.Technical Writing has evolved from simple documents written in MS Word to XML Authoring, Content Management Systems, Learning Management Systems, Training Videos, Analytics, etc.In short, Technical Writing is not a dying field, but an evolving one like software development, testing or any other field. If you do not evolve with changing times, you risk becoming redundant. ",
            "date": "Answered December 19, 2016",
            "views": "38",
            "upvotes": " View 18 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Lisa Palacios Fernandez",
                    "user_href": "/profile/Lisa-Palacios-Fernandez"
                },
                {
                    "user_id": "Sangita Sarmah",
                    "user_href": "/profile/Sangita-Sarmah"
                },
                {
                    "user_id": "Anne Shadows",
                    "user_href": "/profile/Anne-Shadows"
                },
                {
                    "user_id": "Priyanka Pradhan",
                    "user_href": "/profile/Priyanka-Pradhan-1"
                },
                {
                    "user_id": "Prathibha",
                    "user_href": "/profile/Prathibha-34"
                },
                {
                    "user_id": "Priti Gaikwad",
                    "user_href": "/profile/Priti-Gaikwad"
                },
                {
                    "user_id": "Mona Tregle-Jean",
                    "user_href": "/profile/Mona-Tregle-Jean"
                },
                {
                    "user_id": "Wei Wei",
                    "user_href": "/profile/Wei-Wei-56"
                },
                {
                    "user_id": "Gene Ryan Briones",
                    "user_href": "/profile/Gene-Ryan-Briones"
                },
                {
                    "user_id": "Jheelam Dutta Roy",
                    "user_href": "/profile/Jheelam-Dutta-Roy"
                },
                {
                    "user_id": "Vinayakrishna",
                    "user_href": "/profile/Vinayakrishna"
                },
                {
                    "user_id": "Arish Balaji",
                    "user_href": "/profile/Arish-Balaji"
                },
                {
                    "user_id": "Mohnish Bohra",
                    "user_href": "/profile/Mohnish-Bohra-1"
                },
                {
                    "user_id": "Mohammed Ismail",
                    "user_href": "/profile/Mohammed-Ismail-95"
                },
                {
                    "user_id": "Naveen Kumar",
                    "user_href": "/profile/Naveen-Kumar-965"
                },
                {
                    "user_id": "Shashank Venugopal Koppuravuri",
                    "user_href": "/profile/Shashank-Venugopal-Koppuravuri"
                },
                {
                    "user_id": "Gourav Dey Chaklader",
                    "user_href": "/profile/Gourav-Dey-Chaklader"
                },
                {
                    "user_id": "Vamshi",
                    "user_href": "/profile/Vamshi-193"
                }
            ]
        },
        {
            "author_info": {
                "name": "Ann Green",
                "href": "/profile/Ann-Green-67"
            },
            "answer_text": "Of course, not! Technical writing has a great future, for example, gamification. Not surprisingly, games are great for introducing new material. Our brain picks up on the game’s logic and manages to digest all the given information without much difficulty. Gamification not only introduces enhanced learning experience but also motivates users to keep going - keep learning and using the product. And, this easily fits with technical documentation. User manuals are not only about dealing with issues, they are also about getting acquainted with a product, and they are meant to simplify adoption. Also, 3D modeling sounds perfect for technical documentation of the future. Imagine how convenient it would be to have a 3D model of a product, fully interactive; you would be able to turn it around and get all the functionality-related info on the spot. While 3D is something we are accustomed to, VR/AR still feels new and exciting, probably, because the great potential of this technology has not been fully tapped into yet. For technical documentation, VR/AR could become a more convenient way of client interaction with 3D product models combined with learning the functionality. Users could spin the model, take it apart, find out what each part does, and that would be much easier than reading a manual. And, this actually brings us to gamification again. ",
            "date": "Answered December 11, 2018",
            "views": "970",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Prathibha",
                    "user_href": "/profile/Prathibha-34"
                },
                {
                    "user_id": "Ugur Akinci",
                    "user_href": "/profile/Ugur-Akinci"
                },
                {
                    "user_id": "Yuliia Dudareva",
                    "user_href": "/profile/Yuliia-Dudareva"
                },
                {
                    "user_id": "Kesi Parker",
                    "user_href": "/profile/Kesi-Parker-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Suyog Ketkar",
                "href": "/profile/Suyog-Ketkar"
            },
            "answer_text": "No, it isn’t. In fact, it is quite the opposite. Many organizations are only beginning to realize the true potential of technical writing. I see that going forward many roles and responsibilities will be levied on technical writers’ shoulders. This means more involvement into marketing, consulting, and HR and policy-making tasks, and all that in addition to the everyday tasks. This means more work, more scope, and (hopefully) more pay. The developers, QA, or consultants will still “document” things, but they will still have to be distilled to extract usable content. This is also slowly API documentation is becoming the talk amongst technical communicators. I can see from where your question has come. The advent of technologies like Google Glass (now the project is shut down, but still) or Microsoft HoloLens has made the use of technology more intuitive, and hence the reliance on the online/offline Help has reduced. But, forget lessen, that only adds to our work. We must now redefine our role to include tasks that involve improving the user experience. Of course, I — being in the profession — am bound to see only the positive side of things. But, by and large, this is how things will shape up our future. And, with us assuming more (wider) roles than ever, I think what Charles Dickens said in A Tale of Two Cities suits us: “It was the best of times, it was the worst of times…” That’s my point. ",
            "date": "Answered December 19, 2016",
            "views": "17",
            "upvotes": " View 4 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Wei Wei",
                    "user_href": "/profile/Wei-Wei-56"
                },
                {
                    "user_id": "Jheelam Dutta Roy",
                    "user_href": "/profile/Jheelam-Dutta-Roy"
                },
                {
                    "user_id": "Shashank Venugopal Koppuravuri",
                    "user_href": "/profile/Shashank-Venugopal-Koppuravuri"
                },
                {
                    "user_id": "Vaishali Bhanawat",
                    "user_href": "/profile/Vaishali-Bhanawat"
                }
            ]
        },
        {
            "author_info": {
                "name": "Sri Harsha Kiran Potluri",
                "href": "/profile/Sri-Harsha-Kiran-Potluri"
            },
            "answer_text": "Your decision to switch depends on several aspects. As such, I don’t think there is an immediate threat to this career. Note that this is a support group for many companies. Spending on support groups will reduce as a part of cost cutting measures. However, many product companies like Oracle, Qualcomm, CA etc have some strong writing teams. I don’t think there is anything to be feared about immediately. If your passion is for writing only, you may slowly build yourself to be a freelance writer and make sure you have enough work. Companies wise, you can start with a service based IT organization to gain experience and expertise in several areas or join a product based organization for long term employment. Good luck. ",
            "date": "Answered December 18, 2016",
            "views": "15",
            "upvotes": " View 2 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Abhishek Bhattacharjee",
                    "user_href": "/profile/Abhishek-Bhattacharjee-51"
                },
                {
                    "user_id": "Vamshi",
                    "user_href": "/profile/Vamshi-193"
                }
            ]
        },
        {
            "author_info": {
                "name": "Neeraj",
                "href": "/profile/Neeraj-29"
            },
            "answer_text": "In IT, I am not much confident on the future of technical writing. More over it is a job that does not have a value and no one cares about you. But in other fields like, automotive, aero, Electrical/hardware value of documentation is high and is needed. ",
            "date": "Answered January 5, 2017",
            "views": "483",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Zulfiqar Khan",
                    "user_href": "/profile/Zulfiqar-Khan-17"
                }
            ]
        }
    ]
}