{
    "title": "Is the sentence 'It's its.' grammatically correct? - Quora",
    "tags": [
        "Grammar"
    ],
    "response": [
        {
            "author_info": {
                "name": "Danny Black",
                "href": "/profile/Danny-Black-32"
            },
            "answer_text": "Well, sort of. I'm sorry, I know that's terribly vague, so I'll try to clarify a little bit. The sentence, “It’s its.” conveys the meaning, “it belongs to it,” albeit in a nonconventional way. While the sentence is technically grammatically correct, there's a few problems with it. First, let's break it down into its sections. “It's” is just a contraction for “it is,” so we'll look at it that way for simplicity: It is its. Here,“It” is a pronoun and the subject of the sentence, “is” is the verb of the sentence, and “its” is a possessive pronoun that the verb relates to the subject. Structurally sound. An example of a similarly structured sentence would be, “I'm yours.” The only difference is which personal pronoun is used. So, structurally, the sentence is grammatically correct. However, there are still a few issues with it. First, “its” is not generally used as a possessive pronoun in English, mainly because things we call “it” generally aren't considered to be owners. So while a book might be mine, yours, or his, it's probably not its. Another reason for this is that the pronoun “it” can cover such a wide range of objects, so it's often more practical to use a specific possessive. Instead of saying “the book is its,” where “it\" refers to a library, one might say, to avoid ambiguity, “the book is the library's.” Because of this, it's awkward to use “its” as a possessive pronoun, such as in your sentence. Note that this is not to be confused with the widespread use of “its” as a possessive determiner, which is totally normal usage. The odd times when it is okay to use “its” as a possessive pronoun happen when there are enough context clues to make it clear what is being said. Your example sentence has really no context clues. Another problem with your sentence is that because of the ambiguity of the word “it,” when it refers to a noun, it's important that the noun is clarified so there's not ambiguity in the meaning. Your sentence uses “it” twice, first as a subject personal pronoun, then as a possessive pronoun. With no promises referent in the sentence, it's assumed you're referring to something in a previous sentence. The problem is that both instances of “it” have the same referent. An example of another sentence like this would be “He’s his.” It's grammatically correct, yes, but it doesn't quite make sense. The implied meaning of your sentence is: [referent noun A] is [possessed by [referent noun A]]. This same idea can be expressed with much less ambiguity, and less awkward phrasing, with the sentence, “It belongs to itself.” Of course, if you just like the sound of “It’s its,” and don't care about how understandable it is, then yes, it is grammatically correct. And it makes a whole lot more sense than the (also grammatically correct) “Buffalo buffalo Buffalo buffalo buffalo buffalo Buffalo buffalo.” ",
            "date": "Updated December 5, 2017",
            "views": "138",
            "upvotes": " View 39 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Nimmalagadda Ramakrishna",
                    "user_href": "/profile/Nimmalagadda-Ramakrishna"
                },
                {
                    "user_id": "Jade Fung",
                    "user_href": "/profile/Jade-Fung-5"
                },
                {
                    "user_id": "Muhammad Yousuf",
                    "user_href": "/profile/Muhammad-Yousuf-350"
                },
                {
                    "user_id": "Ayush Verma",
                    "user_href": "/profile/Ayush-Verma-219"
                },
                {
                    "user_id": "Aileen Olsen Hampton",
                    "user_href": "/profile/Aileen-Olsen-Hampton"
                },
                {
                    "user_id": "Tammy Curtis",
                    "user_href": "/profile/Tammy-Curtis-2"
                },
                {
                    "user_id": "Kurt Barrett",
                    "user_href": "/profile/Kurt-Barrett-2"
                },
                {
                    "user_id": "Nihal Singh",
                    "user_href": "/profile/Nihal-Singh-188"
                },
                {
                    "user_id": "Steve Wooden",
                    "user_href": "/profile/Steve-Wooden"
                },
                {
                    "user_id": "Shylaja Vineed",
                    "user_href": "/profile/Shylaja-Vineed"
                },
                {
                    "user_id": "David Cahn",
                    "user_href": "/profile/David-Cahn-11"
                },
                {
                    "user_id": "Krithika",
                    "user_href": "/profile/Krithika-8"
                },
                {
                    "user_id": "Sherrill Oman",
                    "user_href": "/profile/Sherrill-Oman"
                },
                {
                    "user_id": "Ana Dex",
                    "user_href": "/profile/Ana-Dex"
                },
                {
                    "user_id": "Don Berrington",
                    "user_href": "/profile/Don-Berrington"
                },
                {
                    "user_id": "Pritha Das",
                    "user_href": "/profile/Pritha-Das-35"
                },
                {
                    "user_id": "Luke Proctor",
                    "user_href": "/profile/Luke-Proctor-1"
                },
                {
                    "user_id": "Barbara Mukapuli",
                    "user_href": "/profile/Barbara-Mukapuli"
                },
                {
                    "user_id": "Sabyasachi Sircar",
                    "user_href": "/profile/Sabyasachi-Sircar"
                },
                {
                    "user_id": "Radhika Trivedi",
                    "user_href": "/profile/Radhika-Trivedi-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Noorhan Mahroof",
                "href": "/profile/Noorhan-Mahroof-1"
            },
            "answer_text": "My answer is that it is grammatically correct. And that’s your answer. Now if “it” is gender neutral here, then that’s perfectly fine to use. If “it” has a gender, then it’s preferable to use the gender instead just for clarification. Then, there’s two ‘it’s. The first is indicating one object and the second one is indicating another. So essentially, object one is possessed/owned by object two. Overall the sentence makes sense and in casual/normal conversations it can be understood, but they may ask you to clarify what is the object that possesses the item. Examples: It’s its, can be replaced with “That ball is the dog’s”, but do keep in mind dogs also have genders, but animals can also be referred to as ‘it’. It’s its, could be replaced with, “That [tyre] is the truck’s [tyre].” ",
            "date": "Updated April 28, 2018",
            "views": "13",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Richard Bierman",
                    "user_href": "/profile/Richard-Bierman-4"
                },
                {
                    "user_id": "Elizabeth Henderson",
                    "user_href": "/profile/Elizabeth-Henderson-40"
                },
                {
                    "user_id": "Joe Llywelyn Griffith Blakesley",
                    "user_href": "/profile/Joe-Llywelyn-Griffith-Blakesley"
                }
            ]
        },
        {
            "author_info": {
                "name": "Donna Nagel",
                "href": "/profile/Donna-Nagel"
            },
            "answer_text": "Yes, it is. As a whole sentence, it’s its is just as correct as it’s yours, it’s ours, it’s hers, it’s his and it’s theirs, but it lacks the elegance of, for example, it’s his, and it would be more likely used as part of a sentence. As part of a sentence, the possessive its would be followed by whatever it is that belongs to it. For example: “Is that part of the car’s wheel lying on the road?” “Yes, it’s its hubcap.” ",
            "date": "Updated September 6, 2017",
            "views": "239",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Ashish Sharma",
                "href": "/profile/Ashish-Sharma-3039"
            },
            "answer_text": "It needs to have specific context in order to make it sound good. Btw there's nothing wrong in it; it just seems ambiguous. Example:1 A: Hey, I found a mistake in your writing. B: What's that about? A: In one of the paragraph you wrote-it's interior is awesome- which seems incorrect to me. B: I'm afraid you read it wrong. It's “its”. Example: 2 Max: Hey Sam! What's the last word of the paragraph? I can't see it properly. Sam: It's “its”. So, it's possible to have a sentence like this. You just need to have a right context to make it sound. ",
            "date": "Answered December 22, 2017",
            "views": "544",
            "upvotes": " View 7 Upvoters",
            "upvoters": [
                {
                    "user_id": "Pablo Rutherford",
                    "user_href": "/profile/Pablo-Rutherford-1"
                },
                {
                    "user_id": "Nihal Singh",
                    "user_href": "/profile/Nihal-Singh-188"
                },
                {
                    "user_id": "Zarine Arya",
                    "user_href": "/profile/Zarine-Arya"
                },
                {
                    "user_id": "Barbara Mukapuli",
                    "user_href": "/profile/Barbara-Mukapuli"
                },
                {
                    "user_id": "Sabyasachi Sircar",
                    "user_href": "/profile/Sabyasachi-Sircar"
                },
                {
                    "user_id": "Mangesh Kumar Bhardwaj",
                    "user_href": "/profile/Mangesh-Kumar-Bhardwaj"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/Mac-Shout"
                }
            ]
        },
        {
            "author_info": {
                "name": "Shawn Mulligan",
                "href": "/profile/Shawn-Mulligan-11"
            },
            "answer_text": "Grammatically, syntactically this sentence is correct, but it's value is more academic and fun than practical. All that's missing is context. If the preceding sentence was something like, ”Is that bone the dog’s?”, then ”it’s” refers to the bone and ”its” to the dog. And that works just fine. Now, I've never heard this construction used in conversation, or seen it in writing before — and doubt that I will again — but it’s fun, nonetheless. ",
            "date": "Answered September 2, 2018",
            "views": "236",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Sabyasachi Sircar",
                    "user_href": "/profile/Sabyasachi-Sircar"
                },
                {
                    "user_id": "Joe Martin",
                    "user_href": "/profile/Joe-Martin-268"
                }
            ]
        },
        {
            "author_info": {
                "name": "Sue Shanahan",
                "href": "/profile/Sue-Shanahan-2"
            },
            "answer_text": "Whose pen is that? It’s his. (pronoun).  It’s his pen.  (possessive adjective BUT same form) Whose book is that? It’s her.  This is incorrect. (possessive adjective).  You need to say “it’s hers”.  (different inflection and NOT the same form) I would say it is not grammatical actually as ‘its’ is a possessive adjective and not a possessive pronoun.  I can’t think of an example of ‘its’ replacing a whole noun phrase. In other words, you need a noun after ‘its’. ",
            "date": "Answered August 12, 2017",
            "views": "448",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Janice Seabolt",
                    "user_href": "/profile/Janice-Seabolt"
                },
                {
                    "user_id": "Jacqueline Deruso",
                    "user_href": "/profile/Jacqueline-Deruso"
                },
                {
                    "user_id": "Carmen Colley",
                    "user_href": "/profile/Carmen-Colley-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Anvitha Sekhar",
                "href": "/profile/Anvitha-Sekhar"
            },
            "answer_text": "You use an ' (apostrophe) to explain possession or belonging of something Sheena's pen Second usage of it is when your make short forms of words. Like It is= It's It has= It's I have= I've So because we are already using apostrophe (‘) in the above form, when it comes to possession of 2nd and 3rd person pronouns, we don't use an apostrophe (‘). Eg: My phone. It's dead. Its sensor is broken. Hope that helped ya :) ",
            "date": "Answered August 13, 2017",
            "views": "217",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Sabyasachi Sircar",
                    "user_href": "/profile/Sabyasachi-Sircar"
                }
            ]
        },
        {
            "author_info": {
                "name": "Demicci Deja Dior-Britt",
                "href": "/profile/Demicci-Deja-Dior-Britt"
            },
            "answer_text": "The written statement, “It's its.” points out each of the things referred to collectively as “its” being the possessions of the charector “it”. The complete phrase merely conveys each of the individual things as a collective being the focus of the topic as the answer pointedly. Very concisely stated and to the point. This is also truely a full sentence in the most vague form. I would reference a subject in this way if I were trying to conceal the identities of both the subject and there possessions. Not knowing whom or what was being discussed would leave anyone bewildered who was not aware of the identities of It nor it's its. ",
            "date": "Answered December 30, 2018",
            "views": "383",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Jim Davis",
                "href": "/profile/Jim-Davis-57"
            },
            "answer_text": "If it means something belongs to a thing you’d call an “it.” If you’re talking about a dog’s collar, for example, you could say, “It’s the dog’s,” or, substituting the pronoun, “It’s its collar,” or shortening it still further, “It’s its.” It sounds funny, but it is not ungrammatical. ",
            "date": "Answered August 12, 2017",
            "views": "187",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Barbara Mukapuli",
                    "user_href": "/profile/Barbara-Mukapuli"
                },
                {
                    "user_id": "Rajesh Gupta",
                    "user_href": "/profile/Rajesh-Gupta-1007"
                },
                {
                    "user_id": "Wallen James",
                    "user_href": "/profile/Wallen-James"
                },
                {
                    "user_id": "Adam Ooi Wei Min (黄为民)",
                    "user_href": "/profile/Adam-Ooi-Wei-Min-黄为民"
                }
            ]
        },
        {
            "author_info": {
                "name": "Kuldeep Singh",
                "href": "/profile/Kuldeep-Singh-602"
            },
            "answer_text": "We can say that words are placed correct grammatically. But Technically speaking it is not giving the sense. But to get the correct meaning of sentence you may need to add further detail. As “it's” is just a contraction of “it is” or “it has”. Whereas its represents the pronoun in its possessive form. Example: It's me = it is me. It's been a long time = it has been a long time. Its The car can't run without its wheels. The remote works with its device. It's its = sense of the sentence can't be understand in this form. ",
            "date": "Answered April 5, 2020",
            "views": "37",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Frank Dauenhauer",
                "href": "/profile/Frank-Dauenhauer"
            },
            "answer_text": "Is the sentence \"It's its.\" grammatically correct? Yes, you could make a case for it. “Does this thing belong to it?” “Yes, it’s its.” ",
            "date": "Answered August 14, 2017",
            "views": "432",
            "upvotes": " View 19 Upvoters",
            "upvoters": [
                {
                    "user_id": "Bruce McDonald",
                    "user_href": "/profile/Bruce-McDonald-1"
                },
                {
                    "user_id": "Elizabeth Henderson",
                    "user_href": "/profile/Elizabeth-Henderson-40"
                },
                {
                    "user_id": "Lee Lightfoot",
                    "user_href": "/profile/Lee-Lightfoot-4"
                },
                {
                    "user_id": "Adrian Stuehler",
                    "user_href": "/profile/Adrian-Stuehler"
                },
                {
                    "user_id": "Rhazes Harun",
                    "user_href": "/profile/Rhazes-Harun"
                },
                {
                    "user_id": "Thomas McCahill",
                    "user_href": "/profile/Thomas-McCahill"
                },
                {
                    "user_id": "Coly Moore",
                    "user_href": "/profile/Coly-Moore"
                },
                {
                    "user_id": "Abhijeet Joshi",
                    "user_href": "/profile/Abhijeet-Joshi-28"
                },
                {
                    "user_id": "Saransh Mahajan",
                    "user_href": "/profile/Saransh-Mahajan-2"
                },
                {
                    "user_id": "Shashwat Khanna",
                    "user_href": "/profile/Shashwat-Khanna-1"
                },
                {
                    "user_id": "John Mcdonagh",
                    "user_href": "/profile/John-Mcdonagh-4"
                },
                {
                    "user_id": "Timmy Shanti",
                    "user_href": "/profile/Timmy-Shanti-1"
                },
                {
                    "user_id": "Adam Glay",
                    "user_href": "/profile/Adam-Glay"
                },
                {
                    "user_id": "Dane Clarke",
                    "user_href": "/profile/Dane-Clarke-1"
                },
                {
                    "user_id": "Madhura",
                    "user_href": "/profile/Madhura-19"
                },
                {
                    "user_id": "Adam Ooi Wei Min (黄为民)",
                    "user_href": "/profile/Adam-Ooi-Wei-Min-黄为民"
                },
                {
                    "user_id": "SreeHari Karanam",
                    "user_href": "/profile/SreeHari-Karanam"
                },
                {
                    "user_id": "Mary Lynch",
                    "user_href": "/profile/Mary-Lynch-32"
                },
                {
                    "user_id": "Jack Munzal",
                    "user_href": "/profile/Jack-Munzal"
                }
            ]
        },
        {
            "author_info": {
                "name": "Paul Haynes",
                "href": "/profile/Paul-Haynes-17"
            },
            "answer_text": "Is the sentence \"It's its.\" grammatically correct? This sentence occupies a sort of twilight zone bounded by four categories: correct, incorrect, vague, and clumsy. I can see that this sentence could be correct, but I can only imagine one situation in which it would not be vague or clumsy, and that is as an answer to a question about grammar: Which is correct, “This book has a typographical error on it’s title page” or “This book has a typographical error on its title page”? It’s its. ",
            "date": "Answered April 25, 2019",
            "views": "84",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Daniel Glas",
                "href": "/profile/Daniel-Glas-1"
            },
            "answer_text": "Technically correct, as in “it’s hers” or “it’s ours”, but it’s not used, probably because it sounds repetitive and obscure (e.g. can be construed as “its its”). Also, “its” is a different case for “it’s its” and “it’s its thing”: the former is a possessive pronoun, and the latter is a possessive determiner. ",
            "date": "Answered August 14, 2017",
            "views": "106",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Derek Braithwaite",
                "href": "/profile/Derek-Braithwaite"
            },
            "answer_text": "The sentence is grammatically correct. It means: It is its. That is to say it is a quotation one might hear (or see written in text) when explanation is given about the often seen pitfall of many in English about the correct use of its as a possessive pronoun, whereas it’s is the contraction of it is. Confusion stems from the fact that in English the possessive case is normally formed by the addition of ‘s to most singular nouns. ",
            "date": "Answered August 13, 2017",
            "views": "403",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Sabyasachi Sircar",
                    "user_href": "/profile/Sabyasachi-Sircar"
                }
            ]
        },
        {
            "author_info": {
                "name": "Ted Pettit",
                "href": "/profile/Ted-Pettit-1"
            },
            "answer_text": "Yes, technically. You are saying “This thing belongs to that thing.” while referring to both things as “it”. I have actually heard people say this, usually followed by brief laughter as we realized that they backed themselves into a corner linguistically by using the lazy pronoun “it” repetitively. ",
            "date": "Answered August 12, 2017",
            "views": "141",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Elizabeth Henderson",
                    "user_href": "/profile/Elizabeth-Henderson-40"
                },
                {
                    "user_id": "Ashley Kleinvehn",
                    "user_href": "/profile/Ashley-Kleinvehn"
                },
                {
                    "user_id": "Predrag Maksimovich",
                    "user_href": "/profile/Predrag-Maksimovich"
                }
            ]
        },
        {
            "author_info": {
                "name": "Patricio Mena Vásconez",
                "href": "/profile/Patricio-Mena-Vásconez"
            },
            "answer_text": "Yes. It sounds weird and maybe not many people would say it, but it can be the answer to a question like “Is this toy your son’s or your dog’s?”. “It’s (short for it is) its” would mean that the toy is the dog’s. If the toys was the son’s, the answer would be “It’s his” (I personally refer to my dog as he or she, but for the question’s sake…). ",
            "date": "Answered August 14, 2017",
            "views": "184",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Lee Lightfoot",
                    "user_href": "/profile/Lee-Lightfoot-4"
                }
            ]
        },
        {
            "author_info": {
                "name": "Jasmine Cannon",
                "href": "/profile/Jasmine-Cannon-2"
            },
            "answer_text": "This is not a sentence, so your question makes no sense as it is. “It's” is a contraction of “It is\" (the apostrophe replaces the “i\" of the word “is\".) An example is “It's raining\". (= It is raining) “its” is used to indicate a possession of it. An example is “The cat has eaten its dinner\"= the cat has eaten the dinner belonging to it. ",
            "date": "Answered January 7, 2019",
            "views": "65",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Riju Bhatt",
                "href": "/profile/Riju-Bhatt-1"
            },
            "answer_text": "Consider a gender neutral object like a bag of chips. A conversation between two people is as follows: “ Is the raw form of chips more a part of the chips or the bag?”, asked the first. “It’s the latter’s belonging.”, said the second. “ How?”, asked the first. “It’s its.”, said the second, with emphasis to cover his own doubt. ",
            "date": "Answered August 15, 2017",
            "views": "177",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Adam Ooi Wei Min (黄为民)",
                    "user_href": "/profile/Adam-Ooi-Wei-Min-黄为民"
                }
            ]
        },
        {
            "author_info": {
                "name": "Sharon Kreitzer",
                "href": "/profile/Sharon-Kreitzer-1"
            },
            "answer_text": "The sentence should read as a question that asks: “ Which word is grammatically correct: its or it’s ?” Either it’s or its could be correct depending on the sentence in which the word is being used. Examples: The restaurant was given its unique name by the owner of the restaurant. It’s going to be a rainy day today! ",
            "date": "Answered August 12, 2017",
            "views": "54",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Neil Taylor",
                "href": "/profile/Neil-Taylor-28"
            },
            "answer_text": "Technically it's a valid construct like it's his or it's theirs but would be considered poor construction because it would be hard to determine what the second if is referring to. But it could be used where context made that obvious. Whose is this bolt”? Said teacher. “It's its “ I replied pointing to the piece of broken machinery. ",
            "date": "Answered January 2, 2019",
            "views": "20",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Drake Way",
                "href": "/profile/Drake-Way"
            },
            "answer_text": "Technically yes but to have meaning it would require context and there may be an issue of miscommunication if said context doesn't make clear which pronoun refers to what. ‘Which cat owns this bed?’ While pointing to the bigger fatter blacker cat ‘It's its.’ ",
            "date": "Answered August 12, 2017",
            "views": "80",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Sabyasachi Sircar",
                    "user_href": "/profile/Sabyasachi-Sircar"
                }
            ]
        },
        {
            "author_info": {
                "name": "Benjamin Pittman",
                "href": "/profile/Benjamin-Pittman"
            },
            "answer_text": "It is correct but awkward and therefore, not generally used without qualification. For example: We watched as the lion cub rolled around in the grass. My friend Sue was entranced. We also knew its mother had to be close by but hidden. Then the tall grass parted. ‘It’s its mother,’ Sue whispered. We watched as the lion cub rolled around in the grass. My friend Sue was entranced. We also knew its mother had to be close by but hidden. Then the tall grass parted. ‘It’s the mother,’ Sue whispered. ",
            "date": "Updated May 6, 2019",
            "views": "100",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Baljit Singh",
                "href": "/profile/Baljit-Singh-Baljit-Walia"
            },
            "answer_text": "No, its is a possessive determiner and must be followed by a noun. Note that a determiner is always followed by a noun. We say its tail and not tail of its. Also note that its is not a pronoun. (Ref. Secrets of Grammar, Amazon Kindle) ",
            "date": "Answered March 11, 2019",
            "views": "16",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Jamille Day",
                "href": "/profile/Jamille-Day"
            },
            "answer_text": "As part of a sentence, it is acceptable. I could imagine saying of a dog that keeps getting scammed after charging at cats, “It’s its own worst enemy”. (Although if I knew the sex of the animal, “She’s her own worst enemy “ just sounds better.) As a complete sentence, even if it’s grammatically correct, it’s very ugly. Imagine you see a dog playing with the ball. You say to the owner “Whose ball is that”. “It’s its” just sounds awful. “It’s his/hers” or “it’s the dog’s” all would be better alternatives ",
            "date": "Answered January 7, 2019",
            "views": "98",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Tom Broz",
                    "user_href": "/profile/Tom-Broz"
                }
            ]
        },
        {
            "author_info": {
                "name": "Carlos Simoes Simoes",
                "href": "/profile/Carlos-Simoes-Simoes"
            },
            "answer_text": "IT’S AND ITS—-BOTH OF THEM ARE GRAMMARLY CORRECT…LET’S TAKE SOME EXAMPLES…IT’S A GOOD IDEA…IT’S A GOOD DAY TODAY…IT’S A BAD WEATHER…IT IS GOOD TO LEARN ENGLISH…IT’S YOUR CAR NOT MINE…IT’S EXCELLENT TO BE HONEST…IT’S GOOD TO HAVE FRIENDS…… OTHER EXAMPLES..THIS UNIVERSITY AND ITS CANTEEN ARE GREAT….ALFÂNDEGA DA FÉ AND ITS PEOPLE ARE WAITING FOR YOU…NORTH KOREA AND ITS ARMY ARE VERY STRONG…I HOPE THIS KIND OF CLARIFICATION HAS BEEN USEFUL….CARLOS SIMÕEES ",
            "date": "Answered August 30, 2019",
            "views": "78",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Robert Edward Lewis",
                "href": "/profile/Robert-Edward-Lewis"
            },
            "answer_text": "Actually it is correct. Compare…. It’s mine. It’s ours. It’s his. It’s theirs. If there is something that belongs to me, it’s mine. If it belongs to us, it’s ours. to him, it’s his. to her, it’s hers. If something “ belongs” to an inanimate object , then it’s its. eg, the ability to determine whether or not my table is perfectly level is not mine. The ability belongs to the app on my cell phone, so it’s its ability. ",
            "date": "Answered August 12, 2017",
            "views": "206",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Elizabeth Henderson",
                    "user_href": "/profile/Elizabeth-Henderson-40"
                },
                {
                    "user_id": "Chris Hough",
                    "user_href": "/profile/Chris-Hough-18"
                },
                {
                    "user_id": "Ashley Kleinvehn",
                    "user_href": "/profile/Ashley-Kleinvehn"
                },
                {
                    "user_id": "Predrag Maksimovich",
                    "user_href": "/profile/Predrag-Maksimovich"
                }
            ]
        },
        {
            "author_info": {
                "name": "Akshaya SN",
                "href": "/profile/Akshaya-SN"
            },
            "answer_text": "Grammatically, yes. It means that it belongs to it (It is its). It - Third Person Singular pronoun. Its - Neutral possessive pronoun. Sounds weird, though! ",
            "date": "Updated December 4, 2017",
            "views": "240",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Sabyasachi Sircar",
                    "user_href": "/profile/Sabyasachi-Sircar"
                },
                {
                    "user_id": "Sarah Madden",
                    "user_href": "/profile/Sarah-Madden-11"
                },
                {
                    "user_id": "Raghi Pandit",
                    "user_href": "/profile/Raghi-Pandit"
                },
                {
                    "user_id": "Akanksha Das",
                    "user_href": "/profile/Akanksha-Das-11"
                }
            ]
        },
        {
            "author_info": {
                "name": "Charles Goodger",
                "href": "/profile/Charles-Goodger"
            },
            "answer_text": "It’s is short for “It is” as in “It is Tuesday today” while “its” without the apostrophe is the possessive pronoun for it - e.g. “London is a big city. Its parks are famous.” As for the sentence “It’s its”, that works grammatically when distinguishing between the two. E.g. Someone asks “Is it its or it’s?” You answer: “It’s its.” Hope that makes sense. ",
            "date": "Answered August 15, 2017",
            "views": "222",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Derek McNeil",
                "href": "/profile/Derek-McNeil-3"
            },
            "answer_text": "Technically yes, but it sounds awkward and probably should be worded differently to avoid confusion. “It’s its” or “It is its” means that ‘it’ belongs to ‘it’. The reason this is confusing is that it is unclear if the two instances of ‘it’ refer to the same thing or two separate things. Are you saying that one thing belongs to another thing or that one thing belongs to itself? ",
            "date": "Answered November 26, 2019",
            "views": "23",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Pat Cole",
                "href": "/profile/Pat-Cole-7"
            },
            "answer_text": "no. It’s is a contraction for it is OR it is the the possessive form of the pronoun it. It’s it > no s I suggest that you be more precise. Ambiguous writing is highly irritating. For example, It’s late.It’s red.This car is IT. I am buying it.the possibilities for revision are endless. ",
            "date": "Answered August 12, 2017",
            "views": "145",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Sabyasachi Sircar",
                    "user_href": "/profile/Sabyasachi-Sircar"
                }
            ]
        },
        {
            "author_info": {
                "name": "Shahid Khan",
                "href": "/profile/Shahid-Khan-1691"
            },
            "answer_text": "Your sentence is grammatically correct. It[ Subject] is[ Linking verb] Its[Possessive Pronoun]- It’s working as subject complement in your sentence. Here are some examples of possessive pronouns used in sentences: The goat is mine.The dog is yours.The ring is hers.The laptop is theirs.",
            "date": "Answered June 20, 2018",
            "views": "110",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Sabyasachi Sircar",
                    "user_href": "/profile/Sabyasachi-Sircar"
                }
            ]
        },
        {
            "author_info": {
                "name": "Steven Brownfield",
                "href": "/profile/Steven-Brownfield"
            },
            "answer_text": "Oddly enough, yes. In English, a complete sentence consists of a subject(main noun) and a predicate (main verb). In your sentence, the subject is “It” and the predicate is “is.” Since the word ““It’s” is a contraction of ““It is”, the sentence is complete. I might use the sentence thus: What is the correct possessive of ““it?” It’s its. ",
            "date": "Answered May 25, 2020",
            "views": "45",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Graham Trott",
                "href": "/profile/Graham-Trott-2"
            },
            "answer_text": "Yes, as an answer to the question: “Which is the possessive form; it’s or its?” Such sentences do no favours to comprehension and should be avoided. It reminds me of a request to a signwriter who got the word spacing wrong on a pub sign for the “Coach and Horses” pub”: Can you please adjust the spaces between Coach and and and and and Horses to be the same?” ",
            "date": "Answered October 25, 2020",
            "views": "12",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Elizabeth Henderson",
                "href": "/profile/Elizabeth-Henderson-40"
            },
            "answer_text": "It is grammatically correct, assuming that you mean, “It is possessed by [it]”, where the second “it” is, for example, a dog. “Whose food bowl is this? ““It’s the dog’s” - “It’s its”. However it may still sound awkward, or be confusing. ",
            "date": "Answered September 10, 2020",
            "views": "13",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Garth Sommerfeld",
                "href": "/profile/Garth-Sommerfeld"
            },
            "answer_text": "Although it is grammatically correct, it really is not soothing for the eyes, is it? A better option might be to say: “The answer is its.” It renders the sentence into something more comprehensible. ",
            "date": "Answered August 14, 2017",
            "views": "174",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Leslie Harrison",
                "href": "/profile/Leslie-Harrison-4"
            },
            "answer_text": "Sure. Why not? You have a subject (it) a linking verb (is) and an adjective (its). Compare That's mine. He's blue. Dad's old. This is a perfectly normal grammatical construction. ",
            "date": "Answered July 28, 2020",
            "views": "21",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Ahmed Jamal",
                "href": "/profile/Ahmed-Jamal-83"
            },
            "answer_text": "I think the object of the possessive pronoun ‘its' is missing here, finally making the sentence quite a little bit incomplete. ",
            "date": "Answered August 13, 2017",
            "views": "37",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Claire Dobie",
                "href": "/profile/Claire-Dobie"
            },
            "answer_text": "Your sentence is confusing but not entirely incorrect. “ It’s “ is a contracted form of “It is.” “Its” is the possessive. You are saying “It is its.” So the “its” refers to someone or some thing. It’s very unclear. ",
            "date": "Answered December 13, 2019",
            "views": "18",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Amiya R Mishra",
                "href": "/profile/Amiya-R-Mishra"
            },
            "answer_text": "While I tend to agree with most answers, I find the sentence bit odd as it lacks context. Early on i learned that a sentence should be grammatically correct and must also make SENSE. My teacher in high sclool asked to pick out the smarter of the two dogs:- A smart dog knows it's master. A smart dog knows its master. God bless. ",
            "date": "Answered July 5, 2018",
            "views": "160",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Sabyasachi Sircar",
                    "user_href": "/profile/Sabyasachi-Sircar"
                }
            ]
        },
        {
            "author_info": {
                "name": "Kerrie McNamara",
                "href": "/profile/Kerrie-McNamara-1"
            },
            "answer_text": "Yes, but I would put ‘its’ in quotation marks. You’re actually saying ‘It is ‘its’, so you have a verb, a subject and an object. ",
            "date": "Answered August 16, 2017",
            "views": "41",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Demicci Deja Dior-Britt",
                    "user_href": "/profile/Demicci-Deja-Dior-Britt"
                }
            ]
        },
        {
            "author_info": {
                "name": "Greg Honan",
                "href": "/profile/Greg-Honan-1"
            },
            "answer_text": "Danny is correct. The main message, in less words, is that a personal pronoun must be preceded by a subject. This is John. That is his car. OR, and this is where I disagree slightly with Danny - I believe its OK to use its as a possessive pronoun. As in “The horse ran up to its owner when she called out.” ",
            "date": "Answered July 31, 2020",
            "views": "5",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Robin Rubendunst",
                "href": "/profile/Robin-Rubendunst-1"
            },
            "answer_text": "Maybe not. Can something belong to another thing? ",
            "date": "Answered August 13, 2017",
            "views": "11",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Paul Bullen",
                "href": "/profile/Paul-Bullen-4"
            },
            "answer_text": "It is. ",
            "date": "Answered August 14, 2017",
            "views": "12",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Pat Jennings",
                "href": "/profile/Pat-Jennings-6"
            },
            "answer_text": "No. ",
            "date": "Answered August 16, 2017",
            "views": "10",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Alice Phillips",
                "href": "/profile/Alice-Phillips-18"
            },
            "answer_text": "no ",
            "date": "Answered August 13, 2017",
            "views": "36",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Joe De Livera",
                "href": "/profile/Joe-De-Livera"
            },
            "answer_text": "NI ",
            "date": "Answered August 16, 2017",
            "views": "52",
            "upvotes": "0"
        }
    ]
}