{
    "title": "Is the Golden Rule in Bible? - Quora",
    "tags": [
        "The Golden Rule",
        "The Bible",
        "Christianity"
    ],
    "response": [
        {
            "author_info": {
                "name": "Charles Weyandt",
                "href": "/profile/Charles-Weyandt"
            },
            "answer_text": "“The Golden Rule”, Do unto others as you would have them do unto you”, is taken as a quote from the Bible, or specifically from Jesus (per the Biblical account), both in Luke 6:31 and Matthew 7:12. The exact quote is from the Luke version, and, if the accounts are to believed, they happened at the same time (Sermon on the Mount), but in different contexts, yet with the same meaning. The Luke account is in references to how to treat enemies. The Matthew account, it is with asking and receiving, and how God treats your requests as a son. The Matthew account is interesting because it also says this statement “sums up the Law and the Prophets”, i.e. Old Testament. That is later referenced to the one of the two greatest commandments (Mark 12:29–31), “love your neighbor as yourself”, which is a step up from just action, as Jesus also stepped up other specific commandments. But these two statements are obviously very closely linked. But, about 500 years earlier (with less dated accuracy, but well believed), Confucius is quoted as saying “Do not impose on others what you do not wish for yourself”. That is subtly different from the Golden Rule. Not doing something you wouldn’t want done to you Is passive. “Don’t do this”. The Golden Rule is active: Do this, as if you were that person. But, the “Love your neighbor as yourself” didn’t originate with Jesus when he was walking around as a man. That is actually much older. Somewhere estimated around 1550 BC (1000+ years before Confucius), Moses is credited with recording God’s Word/Laws, starting with the 10 Commandments, but with a lot more. In Leviticus 19:18, he records “but love your neighbor as yourself”, in contrast to “don’t seek revenge or bear a grudge. To be thorough, There is an obscure Egyptian peasant story, estimated around 1800 BC (so possibly of Hebrew origin as well, if you believe the biblical account of 430 years in Egypt) that can be construed to be similar, but is worded a little more closely to the Confucius statement, or more of a lead by example (the text is very brief and has less detail of “language” about it). So, it is not in just in the Bible, it is from the Bible, directly as a quote, and likely a tenet of the Hebrew from much, much earlier. ",
            "date": "Answered March 12, 2020",
            "views": "27",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Michel Lankford",
                "href": "/profile/Michel-Lankford"
            },
            "answer_text": "The phrase, the \"Golden Rule,\" in and of itself does NOT appear in the Bible. The phrase is a figure of speech. It is a label that believers and Bible students have given to a specific biblical Scripture. That being Matthew 7:12: As It Is Written: “Therefore, whatever you want men to do to you, do also to them, for this is the Law and the Prophets.(Matthew 7:12 NKJV) The reason that believers and Bible students refer to this is the golden rule is because Messiah said that this rule explains the point of every other biblical law out there. The whole point of all the rules is to teach you how to love God with all of your being, and how to love your neighbor as yourself. The \"Golden Rule\" is just a label to remind believers in conversation to remember this concept. It's the same idea as referring to, \"The Lord's Prayer.\" Believers and Bible students know that when you use that term you are either referring to the Bible passages of Matthew 6:9-15, or John 17; but the phrase, \"The Lord's Prayer.\" Does not actually appear in a biblical verse. It's just a label given to identify that important concept and those two Scripture passages to other believers in conversation. ",
            "date": "Answered March 11, 2020",
            "views": "57",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Carol Ward",
                "href": "/profile/Carol-Ward-123"
            },
            "answer_text": "Yes, the answer can be found in your Bible in many places especially Luke 10:27 Read more on their official website and watch some amazing videos too. For I say to you, many prophets and kings desired to see the things you are observing but did not see them,cand to hear the things you are hearing but did not hear them.” 25 Now look! a man versed in the Law stood up to test him and said: “Teacher, what do I need to do to inherit everlasting life?”d 26 He said to him: “What is written in the Law? How do you read?” 27 In answer he said: “‘You must love Jehovah your God with your whole heart and with your whole soul and with your whole strength and with your whole mind’e and ‘your neighbor as yourself.’”f 28 He said to him: “You answered correctly; keep doing this and you will get life.”g 29 But wanting to prove himself righteous,h the man said to Jesus: “Who really is my neighbor?” 30 In reply Jesus said: “A man was going down from Jerusalem to Jerʹi·cho and fell victim to robbers, who stripped him, beat him, and went off, leaving him half-dead. 31 Now by coincidence a priest was going down on that road, but when he saw him, he passed by on the opposite side. 32 Likewise, a Levite, when he came to the place and saw him, passed by on the opposite side. 33 But a certain Sa·marʹi·tani traveling the road came upon him, and at seeing him, he was moved with pity. 34 So he approached him and bandaged his wounds, pouring oil and wine on them. Then he mounted him on his own animal and brought him to an inn and took care of him. 35 The Above source from their website. ",
            "date": "Updated April 5, 2020",
            "views": "50",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Simon Long",
                "href": "/profile/Simon-Long-22"
            },
            "answer_text": "JC said that ‘do unto others’ sums up the law and the prophets’ In other words, if you are careful to always do unto others as you would have them do to you, then you are fulfilling all of the laws of the Bible. You could then say, ‘but there are a lot of food laws in the Bible’, those laws relate to spreading infection. If people had obeyed more of the food laws, we wouldn’t have the covid 19 epidemic. Those reckless diners have harmed their fellow humans in their desire for strange meats. ",
            "date": "Answered March 11, 2020",
            "views": "52",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Janice Ishman-Murray",
                "href": "/profile/Janice-Ishman-Murray-1"
            },
            "answer_text": "Yes. The golden rule in God’s Word the Bible is: Treat Others The Way You Would Want To Be Treated. Just as you want men to do to you, you do the same to others. Matthew 7:12. ",
            "date": "Answered March 11, 2020",
            "views": "5",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Bill Rawlins",
                "href": "/profile/Bill-Rawlins-1"
            },
            "answer_text": "Yes. Matthew 7:12. “So in everything, do to others what you would have them do to you, for this sums up the Law and the Prophets.” ",
            "date": "Answered March 11, 2020",
            "views": "52",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Precious Afolabi",
                    "user_href": "/profile/Precious-Afolabi-14"
                },
                {
                    "user_id": "Haile",
                    "user_href": "/profile/Haile-13"
                }
            ]
        },
        {
            "author_info": {
                "name": "Jasmine Watts",
                "href": "/profile/Jasmine-Watts-30"
            },
            "answer_text": "Yes Matthew 7:12. I hope this was helpful. ",
            "date": "Answered March 11, 2020",
            "views": "6",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Jamie Jodoin",
                "href": "/profile/Jamie-Jodoin"
            },
            "answer_text": "Yes ",
            "date": "Answered March 11, 2020",
            "views": "4",
            "upvotes": "0"
        }
    ]
}