{
    "title": "Is this grammatically correct, “There has not been any rainfall in this part of the country since the last two years”? - Quora",
    "tags": [
        "Grammar",
        "English Grammar"
    ],
    "response": [
        {
            "author_info": {
                "name": "Zarine Arya",
                "href": "/profile/Zarine-Arya"
            },
            "answer_text": "We should say.. There has been no rainfall in this part of the country for the last two years (OR.. since 2017) It hasn't rained here for... There hasn’t been any rainfall in this part of the country for the last two years (OR … since 2017) Using the verb ‘rain' gives a better sentence than using the noun created from it (rainfall). Using one word is better than using many (here/in X rather than ‘in this part of the country’). Those were stylistic choices. Now, we need to correct the actual mistake. The grammar rule is.. FOR a period of time SINCE a point of time An easy trick to remember this.. In the word ‘for', the letter ‘f’ in lower case has a long line through it.. suggesting a duration. In the word ‘since', the letter ‘i' has a dot or point on it :) ",
            "date": "Answered February 16, 2019",
            "views": "21",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Shrikant Narayan Dhekne",
                    "user_href": "/profile/श्रीकांत-नारायण-ढेकणे-Shrikant-Narayan-Dhekne"
                },
                {
                    "user_id": "Tapan Mehta",
                    "user_href": "/profile/Tapan-Mehta-29"
                }
            ]
        },
        {
            "author_info": {
                "name": "Ranjit Maniktala",
                "href": "/profile/Ranjit-Maniktala"
            },
            "answer_text": "I found one error in this sentence I found one error in this sentence and that world is scenes instead of since there should be for so it should be for 2 years not since 2 years because since is used for particular time like since Monday since 1996 etc where as far is used for the last 2 days for the last 2 years etc ",
            "date": "Answered February 16, 2019",
            "views": "448",
            "upvotes": "0"
        }
    ]
}