{
    "title": "Is there any good way to write a novel with multiple first-person narrators that allows for switching between narrators mid-chapter? - Quora",
    "tags": [
        "Novel Writing",
        "Creative Writing",
        "Novels",
        "Writing Advice"
    ],
    "response": [
        {
            "author_info": {
                "name": "Sue Sanders",
                "href": "/profile/Sue-Sanders-3"
            },
            "answer_text": "Is there any good way to write a novel with multiple first-person narrators that allows for switching between narrators mid-chapter? I tried that style once because I needed to present the thoughts and actions of a character hundreds of miles away (in the story), or maybe even just down the block, but in all to capture his point of view that would be at some level opposed to what the main protagonist was feeling. I guess all I can say is that I got tired of working with that format, for that particular book, deciding that any POV should come from the main character’s mouth and any contradicting action would present itself, so to speak, “right in front of her.” But when I struggled with the multi-POV style, I had tried separating chapters by editing the chapter headings, such as “Lenny: A big disappointment.” Then back to the main protagonist, “Sheila: Steals away for a bad girl rendezvous.” That worked fairly well but was a huge weight on my head, and I felt the story would fall with more peaceful acceptance if I kept it more simple as far as POV and beefed up the emotional elements in the story, scene by scene, concentrating on making that better and more entertaining. Simplicity for more depth, you might say. As far as mid-chapter changes, it has to be the creator in you who can manage that irregularity and be praised for your originality. You’re talking about, I assume, changing perspectives mid-chapter as opposed to chapter-by-chapter. I can see that. There should be some physical guide to separate the two, and you should consider other creative ways to dramatically separate the two speakers. You’re dealing with creativity, no more or less than painting, sculpting, designing a house. It’s your baby. The big problem you’ll probably endure is the reader’s acceptance, and the main way around such a thing is to convince them that you have a method to your madness, a reasonable route through the story that they’ll love. Catch their attention, make them wonder what the heck just happened when your second narrator stepped in, prevent them from putting the book aside because they’re okay waiting to find out what your character is up to, what s/he has discovered, is about to take action on, or some uncharacteristic behavior that has their eyes bugged in a “what the hell” manner, and there’s no way you’re going to sleep now. Much good fortune with your writing, and be safe. ",
            "date": "Answered April 20, 2020",
            "views": "85",
            "upvotes": " View 2 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Shana Chen",
                    "user_href": "/profile/Shana-Chen-3"
                },
                {
                    "user_id": "Minnie Spiros",
                    "user_href": "/profile/Minnie-Spiros"
                }
            ]
        },
        {
            "author_info": {
                "name": "Harry Dewulf",
                "href": "/profile/Harry-Dewulf"
            },
            "answer_text": "No. There’s no good way. But if you are an absolute master at handling POV, preferably via psychic distance and free indirect style, then you can probably find a way to make it work, although it will seem mannered (and possibly pretentious, to start with), and will still probably tire the reader and spend their good will rather quickly. If you are a master, however, you probably can do it. Here’s the thing. If you are a master, you will know this already. So if you have to ask, it means you still have a lot of learning to do. But I’m not telling you not to try! Absolutely do try. Every experiment you make in narrative technique will teach you valuable lessons, and make you a better writer, in the most effective way possible, because you will be tailoring the lessons perfectly for the student. ",
            "date": "Answered April 20, 2020",
            "views": "54",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Rachel Caine",
                "href": "/profile/Rachel-Caine-3"
            },
            "answer_text": "Not really, because you have to make absolutely sure your readers follow the switch. I’ve seen this done very effectively in romance novels (which often switches POV from one character to the other) by use of physical transference … maybe a character pours a glass of wine, makes eye contact, and hands it to the other character. There’s a scene break, and then we’re in the POV of the character who’s taking the wine glass. But the key is, you have to make it absolutely clear where and who we are or it doesn’t work. ",
            "date": "Answered April 20, 2020",
            "views": "64",
            "upvotes": " View 2 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Minnie Spiros",
                    "user_href": "/profile/Minnie-Spiros"
                },
                {
                    "user_id": "Peter Nicholas Baines",
                    "user_href": "/profile/Peter-Nicholas-Baines"
                }
            ]
        },
        {
            "author_info": {
                "name": "Susan Rand",
                "href": "/profile/Susan-Rand-1"
            },
            "answer_text": "I have certainly seen it done — in the same paragraph even — but only by highly skilled, well-established authors whose following would accept their stuff if they wrote it upside down. Novel writing is hard enough, don’t make it any more difficult than it is, especially if you are a beginner. ",
            "date": "Answered April 20, 2020",
            "views": "43",
            "upvotes": " View 2 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Peter Nicholas Baines",
                    "user_href": "/profile/Peter-Nicholas-Baines"
                },
                {
                    "user_id": "Minnie Spiros",
                    "user_href": "/profile/Minnie-Spiros"
                }
            ]
        },
        {
            "author_info": {
                "name": "Nadine Gallo",
                "href": "/profile/Nadine-Gallo"
            },
            "answer_text": "This sounds too confusing for most readers. What good does it do? Why not separate chapters? Sounds like changing horses in mid-stream. ",
            "date": "Answered April 20, 2020",
            "views": "15",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Peter Nicholas Baines",
                    "user_href": "/profile/Peter-Nicholas-Baines"
                }
            ]
        },
        {
            "author_info": {
                "name": "Francisco Ojeda",
                "href": "/profile/Francisco-Ojeda-12"
            },
            "answer_text": "I recommend switching first-person perspective from one chapter to another. Make sure there is a purpose to this that moves the story forward. ",
            "date": "Answered April 20, 2020",
            "views": "9",
            "upvotes": " Answer requested by Minnie Spiros"
        }
    ]
}