{
    "title": "Is the silence of the lambs film better than the book? - Quora",
    "tags": [
        "Silence of the Lambs (1991 movie)",
        "Hannibal Lecter (character)",
        "Movie Adaptations",
        "Book to Film Adaptations",
        "Silence",
        "Hollywood",
        "Literature",
        "Book Recommendations",
        "Books"
    ],
    "response": [
        {
            "author_info": {
                "name": "Dan Bentley-Baker",
                "href": "/profile/Dan-Bentley-Baker"
            },
            "answer_text": "Is a Rolls Royce Silver Shadow better than a P-51 Mustang? Ridiculous question. Not only is each superlative in their own right, comparing them is a grave misunderstanding of both. Classic motor coach and Air Superiority Fighter are fundamentally different and no benefit will come of judging them against each other. I teach both print and film literature, and I can show you how many times new media has been subordinated to old. It took photography almost 100 years to be accepted as art, and half as long for film. Any expression worthy of careful consideration is art. Art presents itself in layers and aspects, it unfolds to different viewpoints and contexts. It sometimes takes new eyes to see the most obvious. Thomas Harris and Jonathan Demme are each worthy of careful study; their artworks can be looked at side by side, but neither is better. Take the relationship between FBI Dir. Jack Crawford and recruit Clarice Starling. In the book, that dynamic enriches and raises the stakes of Crawford’s placing her in front of a psychotic serial killer even before she's fully trained. Not only is it unethical, it calls into question all the attachments they have built up together. It doesn't appear at all in the film. Look at the anticlimactic scene in the film when Jack thinks he's leading a raid on a house in Pittsburgh where Buffalo Bill is hiding, and Clarice starts talking to the killer before the FBI gets there, in Cleveland; a perfect AB matching-action sequence misdirect, something rarely carried off in print literature. Print can spend fifty pages on a back story and take readers deep into the mind of a character that would likely destroy a 120 minute film. Film can use tools print can't: casting, color palettes, music, jump cuts and fades. Each medium has its powers and limitations. The Hannibal franchise is a world in print, and its film and TV renditions are part of the true aficionado’s collection. What's better: food or sex? Any answer is moot. ",
            "date": "Answered May 1, 2019",
            "views": "552",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Akhil Satheesh",
                    "user_href": "/profile/Akhil-Satheesh-10"
                }
            ]
        },
        {
            "author_info": {
                "name": "Laurence Fegan",
                "href": "/profile/Laurence-S-Fegan"
            },
            "answer_text": "In short, no. It is an enjoyable film though and it’s right up there in my favorites’! The book gives a more in depth view of Clarice Starling and hints at the fact that her FBI career may not be all she thought it was? Also, the life of her boss, Jack Crawford, is given painful detail. His Wife, Bella (Phyllis) is terminally ill and he is juggling her constant care with the incredible urge to catch ‘Buffalo Bill’. This is handled sensitively in the novel and not in the ham-fisted way that it is approached in the television series! Please don’t misunderstand me, all the actors n the TV show played excellent roles, but the show as whole, tried to be too clever, imho? Perhaps the most famous line in the film, “…with a nice Chianti!” Is the biggest difference! Dr. Lecter states that it is, in fact an ‘Amarone’ in the novel! Also, he leads ‘Dr.’ Chilton to believe that Buffalo Bill’s real name is ‘Billy Rubin’. ‘Bilirubin’ is in fact the substance which gives fecal matter its colour and is also the colour of Chilton’s hair! Is there perhaps, a better way of calling someone a ‘shit-head’? In the novel, Starling finds porno pics of Catherine Martin that were hidden and subsequently missed by the crime scene processors, who were probably all male? However, Senator Martin appears with the awful Paul Krendler and insinuates that Starling may have been a thief? Krendler doesn’t need much of an excuse to begin hating Starling because he is a mysoginist; so begins her undoing… So, book or film? Both! ",
            "date": "Answered March 27, 2019",
            "views": "748",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Gavin Miles",
                    "user_href": "/profile/Gavin-Miles-13"
                },
                {
                    "user_id": "Karen Kinsey",
                    "user_href": "/profile/Karen-Kinsey-2"
                }
            ]
        },
        {
            "author_info": {
                "name": "Steve Drost",
                "href": "/profile/Steve-Drost"
            },
            "answer_text": "Not for my money, no. I first read the book when I was about 15. I acquired it by accident (long, irrelevant and somewhat boring story), right about the time that it was first published and not a lot of people had read it yet. I loved it. Thought it was one of the most amazing things I had ever read. Because, I find, the things that we read and watch when we are a little bit younger and our brains are a little bit more impressionable make a stronger impression on us, the book did leave a lasting impression on me. I also read it quite a few times before I ever watched the movie, so by the time I saw the movie, I had resigned myself to the images that my mind had created for me based on the book. The ideas for the actors who should have played the various parts had set like concrete in my mind - arbitrary though they might have been. Elizabeth Perkins as Clarice Starling. Jonathan Banks as Jack Crawford. They may not have been the best choices for the parts, but they were the ones I wanted. The book does a much better job of characterization than the movie. The movie seems to present Starling as wide-eyed and earnest, which isn’t necessarily wrong, but I think the book further characterizes her as smarter and more determined. Behind all of her efforts and the work that she does for Crawford, there seems to be a head-crunching drive, a determination to get to the bottom of the mystery that is Lecter and Buffalo Bill. Jodie Foster’s Starling is reactive; she seems to let things happen to her. By contrast, Harris’ Starling is proactive; she seeks to make things happen. I’ve only seen the movie once, but I wasn’t too impressed with it. It seemed to me that it just wasn’t able to explore the characters as deeply as the movie. ",
            "date": "Answered August 31, 2019",
            "views": "318",
            "upvotes": " Answer requested by Jennifer Hastings",
            "upvoters": [
                {
                    "user_id": "Akhil Satheesh",
                    "user_href": "/profile/Akhil-Satheesh-10"
                }
            ]
        },
        {
            "author_info": {
                "name": "Pirie Kaufman",
                "href": "/profile/Pirie-Kaufman"
            },
            "answer_text": "I read The Silence of the Lambs before seeing the movie. It started me binge-reading Harris’s previous books. It’s one of the best suspense novels I’ve ever encountered. I’m forever grateful that the film was as good as it was, earning the rare sweep of the big four Oscars. The film is not exactly the book: I can only recall seeing one movie that is completely faithful in that way, The Maltese Falcon. The two media have their respective strengths and limitations. Was this film better than the book? No, but it was just as good, in my opinion, and that is an achievement. ",
            "date": "Answered May 1, 2019",
            "views": "301",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Leslie Marshall",
                    "user_href": "/profile/Leslie-Marshall-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Peter Bellis",
                "href": "/profile/Peter-Bellis"
            },
            "answer_text": "I read the book long before I saw the movie. The movie was good, I enjoyed it. Both Jodie Foster and Anthony Hopkins are excellent actors and I found their performances convincing. The book, however, was brilliant! Books always contain so much more detail and nuance than movies. In books the internal thoughts and feelings of the characters are explored. I can honestly say that I have yet to find a movie that is better than the book it is based on. ",
            "date": "Answered March 1, 2019",
            "views": "199",
            "upvotes": " View 1 Upvoter"
        }
    ]
}