{
    "title": "Is the term 'as best they could' or 'the best they could' in English writing? - Quora",
    "tags": [
        "English Literature",
        "Words",
        "English Word Definitions, Terminology, and Jargon",
        "Grammar",
        "English Grammar"
    ],
    "response": [
        {
            "author_info": {
                "name": "Shrikant Narayan Dhekne",
                "href": "/profile/श्रीकांत-नारायण-ढेकणे-Shrikant-Narayan-Dhekne"
            },
            "answer_text": "As Ugur Akunchi pointed out, both need corrections, though they are found in day to day usage. Accordingly, at least, the following corrections are certainly on: “… as best as they could …” and “… the best that they could …”.  Further, ‘best’ is the superlative degree of the adjective ‘good’, and it also means ‘better than all of (some specified or implied) others’. For correct use of superlative degree, it is essential that the sentence specify or identify the lot with which a comparison was being contemplated. Thus, “He is a best student.” is wrong, because best can be one and only be one. “He is the best student.” is also wrong, since best ‘from out of which lot’ is not specified; for example, best (of all students) in the class, in the school, during the year, et c. Best means ‘better than all else’, and better means ‘more good compared to some (specified) other(s)’. The phrase in your example, therefore, could be: “as well as they could”. or “the best (of all) that they (possibly) could”. The latter version has words in parentheses which are implied, whether stated, muted, or unstated. ",
            "date": "Answered October 12, 2017",
            "views": "703",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Ugur Akinci",
                "href": "/profile/Ugur-Akinci"
            },
            "answer_text": "I’d say neither is correct grammatically, even though I’m sure you hear both of those usages frequently in everyday exchanges. The grammatically correct form is “as best as they could” since the clause is most probably a part of an invisible sentence that compares one thing with another. The full open form of this sentence is probably something like “They answered the question as best as they could,” comparing their current performance with their potential best. Both “as best they could” and “the best they could” are truncated and more popular versions of “as best as they could.” So at the end of the day and from a purely practical point of view, you can say that both are correct. ",
            "date": "Answered October 12, 2017",
            "views": "13",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Asmaa Muhammad",
                    "user_href": "/profile/Asmaa-Muhammad"
                },
                {
                    "user_id": "Kendra Grote",
                    "user_href": "/profile/Kendra-Grote"
                }
            ]
        },
        {
            "author_info": {
                "name": "Maggie O'Brien",
                "href": "/profile/Maggie-OBrien-30"
            },
            "answer_text": "‘as’ is the giveaway here ! It implies a comparative simile “ AS…………AS……….” so, if the sentence is e.g. “They did the examination as best as they could.” your first phrase is correct….BUT no sense of comparison? E.g. “ They took care of the sick man. They did the best they could.” Your second phrase is used ",
            "date": "Answered October 12, 2017",
            "views": "193",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Kendra Grote",
                    "user_href": "/profile/Kendra-Grote"
                }
            ]
        },
        {
            "author_info": {
                "name": "Sharon Wolfgang",
                "href": "/profile/Sharon-Wolfgang"
            },
            "answer_text": "Both are correct, but have slightly different meanings. “As best they could” suggests that they had to struggle, and the result wasn’t very good; “the best they could” is more neutral - it suggests that they worked enthusiastically, and the result may have been anything from so-so to excellent. ",
            "date": "Answered October 12, 2017",
            "views": "119",
            "upvotes": " Answer requested by Kendra Grote",
            "upvoters": [
                {
                    "user_id": "Kendra Grote",
                    "user_href": "/profile/Kendra-Grote"
                },
                {
                    "user_id": "George Lord Jr DC",
                    "user_href": "/profile/George-Lord-Jr-DC"
                }
            ]
        },
        {
            "author_info": {
                "name": "Charles Partrick",
                "href": "/profile/Charles-Partrick"
            },
            "answer_text": "Both are acceptable. ",
            "date": "Answered October 12, 2017",
            "views": "52",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Kendra Grote",
                    "user_href": "/profile/Kendra-Grote"
                }
            ]
        },
        {
            "author_info": {
                "name": "Jim Grossmann",
                "href": "/profile/Jim-Grossmann"
            },
            "answer_text": "OPQ: Is the term \"as best they could\" or \"the best they could\" in English writing? The two phrases mean the same thing. The first is more formal than the second. ",
            "date": "Answered October 23, 2017",
            "views": "207",
            "upvotes": " View 1 Upvoter "
        }
    ]
}