{
    "title": "Is there any publisher who can publish my novel? - Quora",
    "tags": [
        "Publishers",
        "Book Publishing",
        "Publishing",
        "Novels",
        "Existence Question"
    ],
    "response": [
        {
            "author_info": {
                "name": "Mercedes R. Lackey",
                "href": "/profile/Mercedes-R-Lackey"
            },
            "answer_text": "This is for traditional publishing only. You find a publisher who is publishing books similar to yours. Then you go to their website, and you find the Submissions Guidelines. You follow them to the letter. This is your first test. If you cannot be arsed to follow a simple set of guidelines, why would they ever bother trying to work with you? Let me explain the process here. See this? This is an actual slush pile (where unsolicited manuscripts go)  Generally someone like a secretary goes through them and rejects certain things automatically. (Believe me, I am not making this up) Things like manuscripts with illustrations, manuscripts handwritten, written in crayon, written on a yellow legal pad, written on one long continuous scroll, or basically manuscripts that don’t conform to the formatting. Also, the initial sorter rejects anything that is based on someone else’s property, like, for instance, a Game of Thrones book by someone other than GRRM, or a Star Wars novel. Then they sit there until the First Reader gets to them. There may be more than one First Reader. They are generally someone the editor trusts, who shares the editors taste. The First Reader reads the synopsis and the first page. That weeds out a lot. Then he reads the first chapter. That weeds out more. Then he reads the first three chapters and the last chapter. If the manuscript passes all that, he takes it home and reads the whole thing. If it still passes muster it goes to an assistant editor where it goes through the whole process, and finally to the editor. The longer your book takes in this process, the higher up the chain it got. However, editors are crazy busy. The fact that you got a personalized rejection letter is something; usually it’s a form-letter. But because the editor had very little time, he was only able to dash off a note. Always remember this mantra: Publishers are not in the business to publish books; like any other business, they are in this business to make money. Thirty or forty years ago, editors could publish niche books they really believed in, knowing that the others would make up for the losses on the oddball books. Not any more. Publishing companies are now owned by media conglomerates, and editors are under incredible pressure to make every book pay off. You have two options here if you get a rejection letter. You can rewrite your book, or you can try somewhere else. If you keep getting the same reaction, then your only option is going to be a rewrite or self-publishing. But I can absolutely guarantee you that if your writing is any good it will always take about a year for you to get an answer. And never, ever say “I’ll never submit to X again!” That’s just cutting off your own foot. Admit gracefully that you didn’t write a book that fit what they were looking for at the time and move on. They didn’t insult your firstborn child. The book just wasn’t what they were looking for and they had the courtesy to give you a short answer why. Try sending it somewhere else. Remember: when it comes to sending an unsolicited manuscript, so far as the publisher is concerned, this is not you—  THIS is you—-  And there is an entire room full of people like you just waiting for their manuscripts to be read. ",
            "date": "Answered August 6, 2016",
            "views": "12",
            "upvotes": " View 10 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Rajwant Kaur",
                    "user_href": "/profile/Rajwant-Kaur-445"
                },
                {
                    "user_id": "Jitendra Jitanshu",
                    "user_href": "/profile/Jitendra-Jitanshu"
                },
                {
                    "user_id": "Harun Šiljak",
                    "user_href": "/profile/Harun-Šiljak"
                },
                {
                    "user_id": "Dorothy Hockenberry",
                    "user_href": "/profile/Dorothy-Hockenberry"
                },
                {
                    "user_id": "Levan Arkertd",
                    "user_href": "/profile/Levan-Arkertd"
                },
                {
                    "user_id": "Marion Gropen",
                    "user_href": "/profile/Marion-Gropen"
                },
                {
                    "user_id": "Larry Dixon",
                    "user_href": "/profile/Larry-Dixon-1"
                },
                {
                    "user_id": "Nikola Meerburg",
                    "user_href": "/profile/Nikola-Meerburg"
                },
                {
                    "user_id": "Melissa Hoy",
                    "user_href": "/profile/Melissa-Hoy-2"
                },
                {
                    "user_id": "Mike Jackson",
                    "user_href": "/profile/Mike-Jackson-15"
                }
            ]
        },
        {
            "author_info": {
                "name": "William Poundstone",
                "href": "/profile/William-Poundstone"
            },
            "answer_text": "I’ve been a full-time author nearly all my whole adult life (which is a fairly unusual thing). Of all the advice I’ve heard about the business of writing, one comment sticks in my mind: “The good Lord didn’t intend anyone to make a living this way.” Calvin Trillin said that. His point is that every writer has to invent a career for him or herself. No one’s going to do it for you. That means there aren’t many hard-and-fast rules to being an author. But one generalization ends up being true for most people: You need an agent to land a book contract with a big, commercial publisher. Why? It guess the answer is, that’s just the way the book publishing business works. It’s a division of labor thing. Today’s editors don’t have time for vetting completely unknown authors, proposals, and manuscripts. Agents do. That’s how they earn their commissions. How do you find an agent? Pretty much the way you find anything else. Google “literary agents” (and turn on your Internet-scam radar). Avoid anyone who wants to charge you a fee for reading a manuscript. Legitimate agents earn their money from commissions and get paid when you do. A good resource is Literary Marketplace. A one-week subscription (which is all you’ll probably need) is $24.95. You may be able to avoid that at a public library. Once you’re logged in, Literary Marketplace has a comprehensive listing of agents. Most agents specialize to some degree. Take down contact information for those representing authors in your field. It’s then up to you to pitch yourself and your project to an agent. The pitch will initially be an e-mail with suitable attachments (résumé, proposal, etc.) If you were in an impressive writer’s program at college, mention it. If you’ve got a huge number of followers on social media, mention it. But mainly you need to talk up your book in the most compelling way possible. An agent doesn’t expect perfection, but make it as polished as you can. And if the first agent isn’t interested, try another. Repeat as needed. ",
            "date": "Answered June 18, 2019",
            "views": "967",
            "upvotes": " View 9 Upvoters ",
            "upvoters": [
                {
                    "user_id": "David Croft",
                    "user_href": "/profile/David-Croft-6"
                },
                {
                    "user_id": "Marwan Amireh",
                    "user_href": "/profile/Marwan-Amireh"
                },
                {
                    "user_id": "Martin Hauser",
                    "user_href": "/profile/Martin-Hauser"
                },
                {
                    "user_id": "David Alterman",
                    "user_href": "/profile/David-Alterman-1"
                },
                {
                    "user_id": "Ranjani Ranji",
                    "user_href": "/profile/Ranjani-Ranji-6"
                },
                {
                    "user_id": "Patricia Cooper",
                    "user_href": "/profile/Patricia-Cooper-18"
                },
                {
                    "user_id": "Anne Rappaport",
                    "user_href": "/profile/Anne-Rappaport"
                },
                {
                    "user_id": "Joe Wilder",
                    "user_href": "/profile/Joe-Wilder-10"
                },
                {
                    "user_id": "Oliver Stone",
                    "user_href": "/profile/Oliver-Stone-58"
                }
            ]
        },
        {
            "author_info": {
                "name": "Lawrence Watt-Evans",
                "href": "/profile/Lawrence-Watt-Evans"
            },
            "answer_text": "The first step, and by far the hardest one, is to make sure that your novel is something a reputable publisher believes they can sell to readers. Seriously, that’s by far the hardest part. You have no idea how many people think they’ve done it, and are completely, utterly wrong. You cannot possibly assess your own work realistically; it’s just not human nature. To some extent you’ll always see what you meant it to be, rather than what’s actually there for a reader who knows nothing about you. But once you have your novel ready, you settle on the best publisher who handles that sort of novel — don’t bother trying to sell a horror novel to a romance publisher, or hard science fiction to a mystery imprint. If you don’t know who the best publisher in your genre is, go to a library or bookstore (not Amazon, for complicated reasons) and look at who published the best books in that field, the ones most similar to your own. Go to the publisher’s website and look for “Submission Guidelines” or “For Authors” or something similar, and you will find instructions on how to submit your novel for consideration — either that, or you’ll find something like, “We do not consider unagented works.” If you find guidelines, follow them exactly. Do not deviate in any way. Do not think you can stand out by doing something different. This is a test; if you can’t follow the rules, then it’s not worth their time and trouble to work with you. There are literally millions of other writers out there. Using a non-standard font or inserting a hidden message on page 50 to see if they actually read it or anything else “clever” will get you on the blacklist as a troublemaker; it will not help in any way. Believe me on this. If they don’t take unagented submissions, then find an agent. Start your search at the Association of Authors' Representatives website. Again, don’t try to be clever. Publishers and agents don’t want clever except in plots, and not always there. Be prepared to wait six months for a response. After six months, if you haven’t heard anything, it’s acceptable to make a polite inquiry. If this all seems to be horribly unfair and weighted against beginning authors, it is, because there really truly are literally millions of you and there is no reason for a publisher to waste time and effort trying to treat you all fairly and kindly. Publishers and editors are not in business to be nice to beginning writers; they’re in business to make money by selling books. If you follow all the rules and get your novel onto an editor’s desk, she will start reading it and will give it a fair shot — but that doesn’t mean reading the entire thing, or telling you what you did wrong, or trying to help you fix it. If she’s bored or annoyed after three pages, she doesn’t need to read the whole novel; there are hundreds more in the queue, after all, and a would-be buyer in the bookstore wouldn’t read further than that. She’ll just give it a form rejection. So — how do you get your novel published by a reputable publisher? Make it good enough and commercial enough that the editor will buy it. Rejecting everything else is how that publisher became reputable. ",
            "date": "Answered December 6, 2019",
            "views": "15",
            "upvotes": " View 16 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Kelly Santana-Banks",
                    "user_href": "/profile/Kelly-Santana-Banks"
                },
                {
                    "user_id": "Frieda Sutton",
                    "user_href": "/profile/Frieda-Sutton"
                },
                {
                    "user_id": "Nancy Collins",
                    "user_href": "/profile/Nancy-Collins-140"
                },
                {
                    "user_id": "Jeffrey Van Dyke",
                    "user_href": "/profile/Jeffrey-Van-Dyke-5"
                },
                {
                    "user_id": "Akhil Gupta",
                    "user_href": "/profile/Akhil-Gupta-198"
                },
                {
                    "user_id": "Brenda Nichols",
                    "user_href": "/profile/Brenda-Nichols-9"
                },
                {
                    "user_id": "Jonathan Chiu",
                    "user_href": "/profile/Jonathan-Chiu-27"
                },
                {
                    "user_id": "Noel Ngundu",
                    "user_href": "/profile/Noel-Ngundu"
                },
                {
                    "user_id": "Olya Ianovskaia",
                    "user_href": "/profile/Olya-Ianovskaia"
                },
                {
                    "user_id": "Timothy Eisele",
                    "user_href": "/profile/Timothy-Eisele-1"
                },
                {
                    "user_id": "J. B. Levin",
                    "user_href": "/profile/J-B-Levin"
                },
                {
                    "user_id": "George Stepanek",
                    "user_href": "/profile/George-Stepanek"
                },
                {
                    "user_id": "Darrell Blank",
                    "user_href": "/profile/Darrell-Blank"
                },
                {
                    "user_id": "Mercedes R. Lackey",
                    "user_href": "/profile/Mercedes-R-Lackey"
                },
                {
                    "user_id": "Michael Lowrey",
                    "user_href": "/profile/Michael-Lowrey-7"
                },
                {
                    "user_id": "Kurt Doerring",
                    "user_href": "/profile/Kurt-Doerring"
                }
            ]
        },
        {
            "author_info": {
                "name": "Marion Gropen",
                "href": "/profile/Marion-Gropen"
            },
            "answer_text": "First, before you do the last draft of your manuscript, read the bestselling of the books that your book will compete against. Analyze what they do well, even if they’re badly written, that leads your target readers to prefer these books to others of the same type. Then re-read your own work, with an eye to that “payload” and how to increase how much of it you deliver. Re-write your work to do just that. While you are doing this, define your target reader. Obviously, those who attempt to market to too many different types of reader end up selling far fewer copies than those who stay focused. Then figure out where those folks can be found (and remember it might not be directly connected to your type of book). And look in those places and others to find out how the bestsellers are marketed. Book marketing is rarely easily identified as marketing by the uninitiated. It may not even mention the book. But it does involve the author saying things that will interest the target readers, and leaving a trail that leads to the book (in bylines, bios, and profiles). When you have done all that, develop your own marketing plan (usually with the help of a handful of books on book marketing or book publicity). THEN you research how to query and submit to the publishers in your market segment. And last, look at the front and back matter of your successful competitive books, and query those agents and editors who are thanked in those books. Maybe you even mention that you’re querying them because they did such a good job on XYZ book. Good luck. ",
            "date": "Answered February 18, 2019",
            "views": "88",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Luke Wiese",
                    "user_href": "/profile/Luke-Wiese"
                }
            ]
        },
        {
            "author_info": {
                "name": "William D. Richards",
                "href": "/profile/William-D-Richards"
            },
            "answer_text": "First, what genre is your book? Some authors bristle at the thought of pigeon-holing their work, but readers don’t like it when they are looking for one kind of book but get another. Once you’ve determined the best genre to categorize your book, start searching for agents who market books in that genre. Yes, a literary agent. Publishers don’t accept direct submissions anymore. Unless a publisher has contacted you directly and asked you to submit your manuscript to them directly, you have no choice but to go through a literary agent. Publishers only deal with authors who have been brought to them by agents. Period. (With VERY few exceptions.) Once you have a list of literary agents you think (hope) will be interested in your manuscript, start going to their websites and read their submission guidelines. Submit your manuscript according to those guidelines and hope (pray) for the best. Good luck! ",
            "date": "Answered February 13, 2019",
            "views": "47",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Luke Wiese",
                    "user_href": "/profile/Luke-Wiese"
                }
            ]
        },
        {
            "author_info": {
                "name": "Jo Roderick",
                "href": "/profile/Jo-Roderick"
            },
            "answer_text": "Publishing: Is there any publisher who can publish my novel? The question is not so much if there is a publisher who can publish your book, but rather if there is one that wants to do so. The big guys are very picky about the books they select. It's a business and for the most part, they do not like taking risks.  If you write in a genre that is very popular, and they like your novel, then you will probably be signed up. This is not as easy as it might seem, but if you don't secure the interest of a traditional publisher, stay very far away from some of the small 'wannabe' publishers. A very simple test you can apply to a publishing company or individual is to check how much they are asking you to pay them in the contract. If you are asked to fund your own publishing, run away and keep running! You are better served self-publishing. For a more in-depth answer with many links to publishing questions, please visit this question. How do I get a book published? Bheemsain, thanks for your A2A.  Image from Wikipedia ",
            "date": "Answered February 15, 2016",
            "views": "627",
            "upvotes": " View 21 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Sally Lasinga",
                    "user_href": "/profile/Sally-Lasinga"
                },
                {
                    "user_id": "Harriet Hontus",
                    "user_href": "/profile/Harriet-Hontus"
                },
                {
                    "user_id": "Grant Sothingham",
                    "user_href": "/profile/Grant-Sothingham"
                },
                {
                    "user_id": "Karl Branzel",
                    "user_href": "/profile/Karl-Branzel"
                },
                {
                    "user_id": "Tyron Shorsten",
                    "user_href": "/profile/Tyron-Shorsten"
                },
                {
                    "user_id": "Dean Greader",
                    "user_href": "/profile/Dean-Greader"
                },
                {
                    "user_id": "Chris Cassey",
                    "user_href": "/profile/Chris-Cassey"
                },
                {
                    "user_id": "Paul Entzel",
                    "user_href": "/profile/Paul-Entzel"
                },
                {
                    "user_id": "Lousie Legalle",
                    "user_href": "/profile/Lousie-Legalle"
                },
                {
                    "user_id": "Olgo Hortez",
                    "user_href": "/profile/Olgo-Hortez"
                },
                {
                    "user_id": "John Jenson",
                    "user_href": "/profile/John-Jenson-3"
                },
                {
                    "user_id": "Franz Reulum",
                    "user_href": "/profile/Franz-Reulum"
                },
                {
                    "user_id": "Barry Larson",
                    "user_href": "/profile/Barry-Larson-1"
                },
                {
                    "user_id": "Roger Roland",
                    "user_href": "/profile/Roger-Roland-4"
                },
                {
                    "user_id": "Ramona Nunes",
                    "user_href": "/profile/Ramona-Nunes"
                },
                {
                    "user_id": "Isabella Sacks",
                    "user_href": "/profile/Isabella-Sacks"
                },
                {
                    "user_id": "Abigail Anderson",
                    "user_href": "/profile/Abigail-Anderson-12"
                },
                {
                    "user_id": "Quincy Tuacker",
                    "user_href": "/profile/Quincy-Tuacker"
                },
                {
                    "user_id": "Evan Duarte",
                    "user_href": "/profile/Evan-Duarte"
                },
                {
                    "user_id": "Manuel Mont",
                    "user_href": "/profile/Manuel-Mont"
                },
                {
                    "user_id": "Jo Turner Field",
                    "user_href": "/profile/Jo-Turner-Field"
                }
            ]
        },
        {
            "author_info": {
                "name": "Amar Vyas",
                "href": "/profile/Amar-Vyas"
            },
            "answer_text": "Thanks for the question, let us begin with the language. English? Hindi? Spanish? that will help you narrow down your list of publishers. Next, the geography. Are you primarily targeting India? Or are you looking at the international market? For India, print might be the way to go, because the ebook market is still at a nascent stage. Next, let us understand what your novel is about, i.e what genre it falls into. Have you prepared a shortlist of the publishers who typically publish books in that genre? For example, a publisher of academic textbooks may not accept your proposal for a Science Fiction book. Fourth, at what stage is your novel? Is the manuscript ready, or it is a work in progress draft? I had sent the three sample chapters with my proposal to many Indian publishers even before I had finished writing the novel. Would I ever do ti again? Probably not, but the logic was that they take about 3 months to respond, enough time for me to finish the manuscript. Which brings us to the next point: what is the timeline you are looking at to release the novel? Does it mark a special occasion? Are you planning to tie it with an event? On the MyKitaab Podcast, one of the guests wanted to release their book around the same time a major Bollywood film was going to get released. Finally, let us look at What is your \"why\", that is why did you want to get your book published? Is it for improving your brand/ visibility? How about stepping into a full time writing career? Do you believe that you have a story to tell to others? There is a publisher who will be able to provide you with solutions for the above major reasons (and there could be many more). Some would be traditional publishers, others could support with self publishing, some Vanity publishers (stay away from them!) Choice at the end of the day is yours. Of course, you can also go through literary agents. ",
            "date": "Updated August 19, 2016",
            "views": "209",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Marion Gropen",
                    "user_href": "/profile/Marion-Gropen"
                }
            ]
        },
        {
            "author_info": {
                "name": "Phyllis Azar",
                "href": "/profile/Phyllis-Azar-1"
            },
            "answer_text": "Finding a publisher takes research, lots of outreach, and patience. Some publishers will only deal directly with agents. And others are inundated with submissions and only except a few new books a year. There are a ton of books out there on how to plan a strategy to get noticed by traditional publishers. However… Due to a long list of reasons, traditional publishers are not able to publish all of the great work out there. And so, for the vast majority of writers, obtaining an agent, and then actually getting a traditional publishing deal has a very slim margin of success. For those folks, self-publishing or hybrid publishing are the only choices. It’s not easy to self publish, but if you’re driven, you will see your book on sale globally. And then you need to let readers know your book is available thru marketing. PublishDrive is one of the top ebook distribution platforms in self-publishing. They offer authors access to thousands of digital libraries and 400+ online stores including all the majors: Amazon, Barnes & Noble, Google Books, Apple Books, Kobo, and many, more. They have a built-in marketing suite with free and paid options including Amazon advertising. They offer free online tools, details financial and sales reports, and a group of great people - book nerds every one - behind the scenes making sure that all goes well with your ebook. Pay a fee only if you sell books: pay PublishDrive 10% of your ebook’s cover price for distribution and pay a standard percentage to the stores (varies by store) you choose to distribute to on the PD platform. Hope this helps. ",
            "date": "Updated February 21, 2019",
            "views": "44",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Luke Wiese",
                    "user_href": "/profile/Luke-Wiese"
                }
            ]
        },
        {
            "author_info": {
                "name": "Christine Keleny",
                "href": "/profile/Christine-Keleny"
            },
            "answer_text": "It kind of depends on if you want to try and get with a big publisher or a smaller publisher. The only reason I would recommend a smaller publisher is if they have a good marketing plan. Marketing is key. Any publishing company can publish your book, but if they aren’t willing to help you with marketing, then I’d suggest you save your pennies and do it yourself (self-publish). Self-publishing isn’t really doing it yourself - you’d hire an editor, someone to do the cover design… but you’re the manager of the publishing and you get all the royalty at the end of the process. If you want a traditional publisher, then you need to find an agent. The best place to find an agent is the Writer’s Market book. You can find it in your local library. It’s a large book and put out almost every year. Another way to find an agent (a bit faster way) is to go to writer’s conferences that have agents that are taking book pitches. Best of luck!Christine KelenyCKBooksPublishing.com ",
            "date": "Answered February 14, 2019",
            "views": "41",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Luke Wiese",
                    "user_href": "/profile/Luke-Wiese"
                }
            ]
        },
        {
            "author_info": {
                "name": "Joseph Reinemann",
                "href": "/profile/Joseph-Reinemann"
            },
            "answer_text": "Well that depends.  What's your novel about?  What kind of length is it?  How much experience have you had?  Do you have an agent to represent you?  What's their reputation like in the industry? These are all things that are going to play into any publisher's decision to publish your manuscript.  And even if you've got good answers for all of them, it's by no means a guarantee that you're going to get it accepted. You will no doubt discover there are several publishers who are willing to accept it if you pay them - be very, very cautious with these.  There are a lot of predatory houses out there that will attempt to take advantage of people who don't have a lot of experience with how the industry generally works.  Be extra cautious if they come to you. ",
            "date": "Answered February 13, 2016",
            "views": "126",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "L.S. Lopez",
                    "user_href": "/profile/L-S-Lopez"
                }
            ]
        },
        {
            "author_info": {
                "name": "Bhargava Adepalley",
                "href": "/profile/Bhargava-Adepalley"
            },
            "answer_text": "Hi there, Disclaimer First: I am one of the founders @ Notion Press Publishing. If you have already written your book, you have a few options. 1. You could approach any top traditional publisher like Penguin, Harper Collins,, Hachette etc. and submit your manuscript for a review. however, traditional publishers get bombarded with hundreds of manuscripts and take a long time to even go through them ( if at all they do ). More often than not, they also reject first time authors due to a perceived risk of publishing an unknown name. 2. You could subsequently approach a self-publishing platform similar to Notion Press and work with a team of book experts who will take care of the entire publishing process and bring your book out to the market. In this guided publishing model, you will own 100% of the rights to the book and take home 100% of the profits from book sales. To know more about how this works you can check out the website link given above. 3. Your third option would be to publish it by yourself by using platforms like KDP or Createspace. This would essentially require you to take care of every aspect of publishing ie. cover design, interior formatting, editing etc by yourself. Such platforms are mostly free to use and take a commission from each book sale and pay out a percentage of the profits in terms of royalty. ",
            "date": "Answered March 28, 2018",
            "views": "191",
            "upvotes": " View 17 Upvoters",
            "upvoters": [
                {
                    "user_id": "Anamika",
                    "user_href": "/profile/Anamika-55"
                },
                {
                    "user_id": "Lekshmi Baskar",
                    "user_href": "/profile/Lekshmi-Baskar"
                },
                {
                    "user_id": "Jessie Joseph",
                    "user_href": "/profile/Jessie-Joseph-11"
                },
                {
                    "user_id": "Prethy Keba",
                    "user_href": "/profile/Prethy-Keba"
                },
                {
                    "user_id": "Ahiraj Prathap",
                    "user_href": "/profile/Ahiraj-Prathap"
                },
                {
                    "user_id": "Gautham Gopakumar",
                    "user_href": "/profile/Gautham-Gopakumar-4"
                },
                {
                    "user_id": "RAVI KIRAN",
                    "user_href": "/profile/RAVI-KIRAN-1121"
                },
                {
                    "user_id": "Lakshmipathy Karthikeyan",
                    "user_href": "/profile/Lakshmipathy-Karthikeyan"
                },
                {
                    "user_id": "Surekha Thammannan",
                    "user_href": "/profile/Surekha-Thammannan"
                },
                {
                    "user_id": "Ann Vinod",
                    "user_href": "/profile/Ann-Vinod-2"
                },
                {
                    "user_id": "Subbhaiya P",
                    "user_href": "/profile/Subbhaiya-P"
                },
                {
                    "user_id": "Swati Malik",
                    "user_href": "/profile/Swati-Malik-71"
                },
                {
                    "user_id": "Murali Sukumar",
                    "user_href": "/profile/Murali-Sukumar"
                },
                {
                    "user_id": "Sai Deepak",
                    "user_href": "/profile/Sai-Deepak-36"
                },
                {
                    "user_id": "Anshu Sinha",
                    "user_href": "/profile/Anshu-Sinha-35"
                },
                {
                    "user_id": "Naganath Iyer",
                    "user_href": "/profile/Naganath-Iyer-1"
                },
                {
                    "user_id": "Yathav Priyan",
                    "user_href": "/profile/Yathav-Priyan"
                }
            ]
        },
        {
            "author_info": {
                "name": "Bruce Jones",
                "href": "/profile/Bruce-Jones-3"
            },
            "answer_text": "You will need to connect with an agent. Agents market to publishers. But you can also self-publish and be guaranteed of publishing your book. If you want to try and meet a lot people you might try the Book Expo America in New York in May. it is huge and you could talk to a lot of people. Book Expo America The #1 book and author event Figure out where the agents are and get in front of them. Also build out your platform. Publishing is a business. If you have a lot of followers and fans you can sell a lot of books. Start building that today. Build enough people you won’t need a publisher, you can do it yourself ",
            "date": "Answered December 6, 2019",
            "views": "38",
            "upvotes": " Answer requested by Logan Diekmann",
            "upvoters": [
                {
                    "user_id": "Kim Cool",
                    "user_href": "/profile/Kim-Cool"
                },
                {
                    "user_id": "Kerry V Love",
                    "user_href": "/profile/Kerry-V-Love-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Ivor Davis",
                "href": "/profile/Ivor-Davis"
            },
            "answer_text": "Logan: A tough job ahead. If you can find a good agent (and there’s a website called Tracker, that actually lists agents and what kind of books they are looking for) you are on the right path. But frankly, I think it’s tougher, much much tougher for first time writer’s with a novel than writer’s of non fiction books to get published. Go that route and be prepared for rejections. Be persistent and work up a good short pitch for your novel. Good luck on what could be a long and winding road. I have been writing for half a century—but my books are non fiction. Yet I know even with a lifetime of writing behind me, producing a novel makes the road tougher and rougher! Off you go, and good luck.—ivor davis ",
            "date": "Answered December 6, 2019",
            "views": "42",
            "upvotes": " Answer requested by Logan Diekmann",
            "upvoters": [
                {
                    "user_id": "Bliss Binoy Vallabhassery",
                    "user_href": "/profile/Bliss-Binoy-Vallabhassery"
                },
                {
                    "user_id": "Zhao Cedric",
                    "user_href": "/profile/Zhao-Cedric"
                },
                {
                    "user_id": "Zahid Ahmed",
                    "user_href": "/profile/Zahid-Ahmed-14"
                },
                {
                    "user_id": "Rabby Thakur",
                    "user_href": "/profile/Rabby-Thakur"
                }
            ]
        },
        {
            "author_info": {
                "name": "Chris Harold Stevenson",
                "href": "/profile/Chris-Harold-Stevenson"
            },
            "answer_text": "You will have to know the category of your book, i.e, Adult novel, New Age, Young Adult, Children’s etc, and then decide on the nearest genre that fits your story line—Science Fiction, Fantasy, Horror, Romance, Western, Paranormal, Mystery, Suspense, Thriller, etc. Don’t forget there are sub-genres or secondaries—example: romantic thriller, erotic romance, romantic mystery, romantic science fiction, romantic fantasy, romantic young adult, and so on. Heat levels might also be included with a romance publisher, sometimes colored-coded and sometimes tagged by numerals, 1 to 3, 4, or 5. Many publishers specialize in a certain genre and concentrate on putting these books out. This is because they have cultivated their audience and make more individual sales and success in their perspective field of expertise. Publishers who publish multiple genres should be your secondary choice. Just match your book type to the right publisher Look up publishers in Writer’s Digest, or the similar publication overseas. There are e-mail and paperback copies available. ",
            "date": "Answered November 10, 2018",
            "views": "212",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Luke Wiese",
                    "user_href": "/profile/Luke-Wiese"
                }
            ]
        },
        {
            "author_info": {
                "name": "Shatarupa Dhar",
                "href": "/profile/Shatarupa-Dhar"
            },
            "answer_text": "In India…there is StoryMirror - Wikipedia, a fairly new publishing house who approach up and coming authors and get their books published. You too can contact them and present your work for publishing. You can visit their site Online Portal for Reading & Submit Stories, Poems, Lyrics, Quotes and Art Works and contact them. From what I know as of now, they can get your novel published in both the physical and e-book format. Also, you can share your short stories/poems/art on their online portal with your fellow readers/artists. You can also start a blog which will help with marketing before/after your publish your work. (For blogging, WordPress is the best bet, by far) ",
            "date": "Answered April 7, 2017",
            "views": "331",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Luke Wiese",
                    "user_href": "/profile/Luke-Wiese"
                }
            ]
        },
        {
            "author_info": {
                "name": "Sarvesh Kumar",
                "href": "/profile/Sarvesh-Kumar-1773"
            },
            "answer_text": "There are 3 roads that you can take, while getting your book publish and they are - Traditional Publishing House| Self Publishing House and Do-it-yourself online platforms. In a traditional publishing house they handle everything from there end, but in the end pay you a small royalty on the sales they make from your book. In a self publishing house, services can be customized. You can choose between getting your book proofread to designing your cover page. You can customize as per your budget and more over needs. These publishing platform pay 100% royalty on your book. In a Do-it-yourself kind, are websites where you will have to do everything, they are merely just a platform for you to sell your book and nothing else. If you wish to understand more in detail you can get in touch with publishing consultant at Betagram Group. Do note I'm the Co-founder of the company. Have a Great Day! ",
            "date": "Answered September 20, 2019",
            "views": "29",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Jewel Parago",
                "href": "/profile/Jewel-Parago-1"
            },
            "answer_text": "No publisher can answer a question like this without a submission. This question does nothing to answer the questions publishers look at such as what genre is it, what is the novels plot, what the authors writing skill, what is authors marketing ability, and much more. Do the research and find a publisher who is looking for books like yours and follow their submission guidelines to the letter. Their is no easy way around the submission process. ",
            "date": "Answered December 8, 2019",
            "views": "45",
            "upvotes": " Answer requested by Logan Diekmann"
        },
        {
            "author_info": {
                "name": "Rashi Shrivastava",
                "href": "/profile/Rashi-Shrivastava-12"
            },
            "answer_text": "Choosing the right publisher for your novel is a very confusing choice because first, it depends on how many publishers actually respond to your proposal and second, that depends on whether you are ready to publish with them. You need to first find out what you want from your publisher and also the kind of publishing that you may wish to employ. For instance, if you want to publish traditionally, or via partnered publishing, or via indie publishing. Explore each and every choice carefully before making a choice. As and when you choose one publisher and the method of publishing, ensure that you research enough about their background. Talk to some authors who published with them, and study their ways of marketing. Make an informed choice. ",
            "date": "Answered November 13, 2017",
            "views": "292",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Larry J. Martin",
                "href": "/profile/Larry-J-Martin"
            },
            "answer_text": "Look on book racks and shelves to find who publishes books like yours, go online and see if they accept submissions (most want digital) and submit, submit, submit a perfectly formatted clean manuscript. Good luck. ",
            "date": "Answered February 12, 2019",
            "views": "26",
            "upvotes": " View 1 Upvoter "
        },
        {
            "author_info": {
                "name": "Brad Chisholm",
                "href": "/profile/Brad-Chisholm"
            },
            "answer_text": "Have it accepted by a reputable agent. Assuming your novel fits a known genre, has been professionally edited, is within 60/90k words (YA 50k plus) you have as good a shot as anyone. Do exactly as the agent instructions ask. Exactly. It’s partly a test to see you you are a problem child or not. ",
            "date": "Answered December 6, 2019",
            "views": "41",
            "upvotes": " Answer requested by Logan Diekmann"
        },
        {
            "author_info": {
                "name": "Ted Bowman",
                "href": "/profile/Ted-Bowman-1"
            },
            "answer_text": "Depends on whether you self-publish or go for a contract with on of the big boys. ",
            "date": "Answered February 11, 2019",
            "views": "11",
            "upvotes": " View 1 Upvoter "
        }
    ]
}