{
    "title": "Is there a point to the 'custom house' introductory in the Scarlet Letter? - Quora",
    "tags": [
        "Nathaniel Hawthorne",
        "The Scarlet Letter (1850 book)",
        "Literature"
    ],
    "response": [
        {
            "author_info": {
                "name": "Terry Vestal",
                "href": "/profile/Terry-Vestal"
            },
            "answer_text": "Is there a point to the \"custom house\" introductory in the Scarlet Letter? Nathaniel Hawthorne was obviously a very complicated easy philosopher as was Adam Smith. What is a complicated easy philosopher? Hume’s idea that metaphysics is to serve art is probably the most important idea that has been ignored by philosopher and artist ever. It will not hurt the philosopher that dabbles in art or the artist that dabbles in philosophy to consider it so. Hawthorne was an artist who was more than a dabbler in metaphysics — he was a philosopher in his own right. The great American artists is connected to Hume, Smith, Schopenhauer, Charles Darwin, Emily Dickinson, and Homer. How? I feel I have not been totally accurate in passing Hume’s idea of how metaphysics serves art. I believe he was saying the philosopher is to be artist at same time he is philosopher. In my previous interpretations I have implied that the abstract philosopher and artist are separate minds. This is true sometimes but Hume was stressing that the philosopher who is abstract has to explain what is the point or how are the abstract principles useful even in the work that introduces them. Hawthorne’s most famous work is example of very easy art with a healthy dose of abstract philosophy. With the abstract philosophy Hawthorne was explaining the solutions to common problems; the complex ill feelings towards Hester were natural yet because Hester, her whole person, was naturally pleasing to [those] complex feelings most important in advancing critical understanding, through the very abstract understanding of the characters Hawthorne actually explained how and why the puritan mindset was phased out; Hawthorne actually explained the evolution of understanding and it is in line with Hume, Smith, and Darwin himself. Hester’s child Pearl was such a philosopher she was actually spooky. She was obviously the wisest of them all. Chillingworth was next in line. Dimmesdale was the dim-witted philosopher. The abstract understanding from the interplay of these three philosophers, the child who was extra brilliant, the brilliant old man, and the dim-witted preacher, is where Hawthorne gave a very unique explanation of the evolution of critical understanding. It was because all of these philosopher’s understanding was had by natural feelings that Hawthorne was compatible with [my] philosophers. Therefore he is [my] artist. I am simply trying to stress that just as I won’t fool with a second-rate philosopher by my feel I will not fool with a second-rate artist by my feel either. When we think of Hume or Smith we think of philosopher. When we think of Hawthorne we think of artist. In the end all are abstract philosophers that clarified their abstractions in art, which is [the] manner humanity is educated. Study this very related thought: “Indulge your passion for science, says she, but let your science be human, and such as may have a direct reference to action and society. Abstruse thought and profound researches I prohibit, and will severely punish, by the pensive melancholy which they introduce, by the endless uncertainty in which they involve you, and by the cold reception which your pretended discoveries shall meet with, when communicated. Be a philosopher; but, amidst all your philosophy, be still a man.” Excerpt From: David Hume. “An Enquiry Concerning Human Understanding.” iBooks. The eerie abstract wisdom of Pearl or the more believable yet extraordinary abstract wisdom of Chillingworth could not have been passed but in a critical problem of life. The question is asking what is the point of the very long and tedious introduction to The Scarlet Letter. Hawthorne is pointing out how monotonous and mind numbing the business of life is. In the custom house he was surrounded by very crude bores. And even though there is [some] need in the business of the custom house and the talent to perform the tasks involved is real and necessary, it is not conducive to the creation of art. I believe Hawthorne’s mind was alive to the problems of excessive materialism and the politics involved in maintaining it. There was no way for an artist of his caliber, he was good and he just knew it, to be happy in the world. It was his exhaustive criticism of the bores mixed with the cursory mention of the talent involved that gives his Smith-ish understanding away; because of excessive materialism the world doesn't allow for development of art only bores. It is beyond interesting that Smith became employed in customs. The greatest easy philosopher ever became employed in mind-numbing work more suited for bores than philosopher/artist thus every great thinker from that point on would be cheated. I am not saying that [we] can’t figure things out only that it is going to be much more difficult than it would have been had Smith been able to fulfill his dreams as artist. It was example of the biggest waste of mind ever. Just to be clear, it is [the] blemish of the capitalistic mind that proves the chief flaw of the system; it destroys ability of intellectuals of stating the obvious. ",
            "date": "Updated June 27, 2020",
            "views": "366",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Sheree Strange",
                "href": "/profile/Sheree-Strange"
            },
            "answer_text": "A couple, as I see it ;) Firstly, the Custom House passage introduces the narrator, and in so doing positions the reader to understand the perspective from which the story will be told. It’s being told many years later by someone completely removed from the story (which means it will read very differently than had it been narrated by, say, Hester, or one of the people in her village). Of course, Hawthorne didn’t need to write dozens of pages to set that up, so that brings us to his second reason… … which was to hang sh*t on all of his colleagues. Really, he just had a lot of frustration and needed to vent. He saw the people he worked with as boring old gas bags that were held in too high esteem. So, he wrote them all into the Custom House, and did the bare minimum (if that) to disguise their true identities. He must have hit a nerve, because a lot of them got quite ticked off with him after The Scarlet Letter was published. Bonus “point”: combining the two, in a way, the Custom House chapter establishes a kind of continuity for the story. The descendants of those Puritan community leaders are now officials in the Custom House - Hawthorne is saying that the problems of Puritanical society haven’t gone away, they’re just expressed differently now. Clever, eh? ",
            "date": "Answered February 23, 2018",
            "views": "575",
            "upvotes": " Answer requested by Joshua Cielo"
        },
        {
            "author_info": {
                "name": "Robert Rowe",
                "href": "/profile/Robert-Rowe-45"
            },
            "answer_text": "I believe the writer, Nathaniel Hawthorne, was actually trying to make fun of himself and other writers through making fun of the culture of the people about whom the story was. His deliberate use of unnecessary verbiage and unusual selection of difficult words was, in my opinion, his way of using obtuse humor to poke fun at the writers of his time who were known for such practices. ",
            "date": "Answered February 22, 2018",
            "views": "319",
            "upvotes": "0"
        }
    ]
}