{
    "title": "Is there any kind of word processing software that shuts off all other software while it is running? - Quora",
    "tags": [
        "Creative Writing",
        "Existence Question"
    ],
    "response": [
        {
            "author_info": {
                "name": "Neo En-Dian",
                "href": "/profile/Neo-En-Dian"
            },
            "answer_text": "Hi, The functionality you are looking for is not part of any word processing software I know of. What you're looking for are program blockers. Disclaimer: I have not used any of the programs, nor do I endorse any. This list is merely the product of my google searches. There are a few options, so I will list them for you to follow up. Windows Live Family Safety - free with Windows 8 (part of Windows Essentials), has basic options for you to block particular programs based on the user account. For more info: http://familysafety.microsoft.comHomeGuard Activity Monitor - not free, offers a host of features including keylogging, computer usage restrictions and is harder to bypass. For more info: http://veridium.net/homeguard-activity-monitor/FortiClient - Another free option, this time supported by ads (lots of ads). Has the 2 main features you want - Application Firewall allows you to block programs from running either as a group (\"Instant Messaging\") or individually, while Parental Control allows you to block websites by category or URL. For more info: http://www.forticlient.com/P.S. Or you could go old school and write/type on paper. No worries about distracting software then. ",
            "date": "Answered September 21, 2014",
            "views": "93",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Torin Lee",
                "href": "/profile/Torin-Lee"
            },
            "answer_text": "I'm unsure of what you mean by \"shuts off all other software\", but I'll answer this question with the assumption that you mean \"eliminates distractions\".  Scrivener has served me well, having a full screen feature where all you can see is the blank page and your cursor, as well as lost of other neat tricks and useful tools. It was designed primarily for creative writing, by creative writers. Literature and Latte - Scrivener Writing Software.  Yarny is a similar tool, but rather than being downloaded software, you write on the Yarny website and save your work in the cloud. Yarny If you want it to shut off all other software, just go ahead and turn everything off yourself before starting to write! ",
            "date": "Answered September 20, 2014",
            "views": "91",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Glenn Anderson",
                    "user_href": "/profile/Glenn-Anderson"
                }
            ]
        }
    ]
}