{
    "title": "Is there a way to find out how many events are in my Google Calendar? - Quora",
    "tags": [
        "Existence Question"
    ],
    "response": [
        {
            "author_info": {
                "name": "T Hazan",
                "href": "/profile/T-Hazan"
            },
            "answer_text": "I had the same problem… What I did is to type the name of the event in to the search box. There was too many instances of the event for me to count manually so I Copied the entire list and then paste it to Microsoft Word( They have a live version that is free to use online). The list goes on sth like this; Wed Sep 12 All day draft Calendar: Calendar 01, Accepted Thu Sep 13 All day draft Calendar: Calendar 01, Accepted Here I counted the number of words that is used to define a single event ( in this case 10 words), check the total word count at the bottom left of the entire list at Microsoft word and divide it to the number of words that are used to define a single event. Not a very clean solution but worked for me. ",
            "date": "Answered September 12, 2018",
            "views": "34",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Vaughn Copeland",
                    "user_href": "/profile/Vaughn-Copeland"
                }
            ]
        },
        {
            "author_info": {
                "name": "David Kao",
                "href": "/profile/David-Kao-34"
            },
            "answer_text": "If the entries have a common \"signal\", then you can search for that phrase/string/number and see the number count. If there is no common signal, you could export the calendar into an ICS-file, open it with excel and then count the number of a field like \"BEGIN:VEVENT\". (a bit complicated, I know.... but it gets you there!) ",
            "date": "Answered June 24, 2014",
            "views": "57",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Donald Bystrom",
                    "user_href": "/profile/Donald-Bystrom"
                },
                {
                    "user_id": "Dave T Randall",
                    "user_href": "/profile/Dave-T-Randall"
                },
                {
                    "user_id": "Anand Pajpani",
                    "user_href": "/profile/Anand-Pajpani"
                }
            ]
        }
    ]
}