{
    "title": "Is the coronavirus predicted in any book? - Quora",
    "tags": [
        "Predictions (astrology)",
        "Virology",
        "COVID-19 (2019-2020)",
        "Books"
    ],
    "response": [
        {
            "author_info": {
                "name": "Purushottam Kumar",
                "href": "/profile/Purushottam-Kumar-301"
            },
            "answer_text": "The novel coronavirus pandemic has gripped the world with a deadly disease spreading like wildfire, affecting thousands of people. In India, the number of positive cases has crossed the 100 mark and the death toll has touched three people. In a scenario where panic is as contagious as the virus, rumours take no time to become viral. Some stories of uncanny predictions are also doing the rounds. Here's a list: A book from 1981 The Eyes of Darkness, a novel written by Dean Koontz and published in 1981, allegedly predicted the outbreak of a coronavirus. There is a passage in the book that alludes to the creation of a deadly virus known as Wuhan-400, which is named after the place where it originated. Netizens are going gaga over the strange similarity and many are saying that the author was one person who foresaw the occurrence of COVID-19. A prediction in The Simpsons More often than not, The Simpsons is credited with predicting that Donald Trump would become the President of United States. \"The Simpsons predicted it” is a common phrase on the internet. A 1993 episode of the animated sitcom titled Marge in Chains dealt with the outbreak of a mysterious virus that originated in the Far East. The episode focuses on an illness called 'Osaka flu' that spreads through Springfield after residents order juicers from Japan. Nostradamus predicted this? Nostradamus, the 16th-century French astrologer, physician and reputed seer is famous for his predictions. From the end of the world to natural calamities, his predictions are dynamic and mind-boggling. And according to one Twitter user, Nostradamus also predicted the coronavirus. The authenticity of the user's claim is debatable.  'The war of Armageddon' Jeane Dixon was an American psychic who reportedly predicted the 1963 assassination of John F. Kennedy. Dixon also predicted that the world would end in 2020 when a 'war of Armageddon' would wipe out the planet. According to netizens, the Armageddon that she was referring to was the coronavirus. End of Days Pictures of a page from a book titled End of Days, written by late Sylvia Brown, has gone viral on social media. Certain lines in the book make it seem like the author had predicted that a coronavirus-like epidemic would attack the world in 2020. Here's an excerpt: \"In around 2020 a severe pneumonia-like illness will spread throughout the globe, attacking the lungs and the bronchial tubes and resisting all known treatments. Almost more baffling than the illness itself will be the fact that it will suddenly vanish as quickly as it arrived, attack again ten years later, and then disappear completely.\" All of these predictions may just be shots in the dark. For now, people need to keep themselves safe by following the guidelines shared by governments, medical experts and the World Health Organization. Reference:- Coronavirus: Did you know about these predictions? ",
            "date": "Answered April 10, 2020",
            "views": "794",
            "upvotes": " Answer requested by Srini Reddy",
            "upvoters": [
                {
                    "user_id": "Kaje Graf",
                    "user_href": "/profile/Kaje-Graf"
                }
            ]
        },
        {
            "author_info": {
                "name": "Kyle David",
                "href": "/profile/Kyle-David-59"
            },
            "answer_text": "“No one could have seen this coming” they say. But any Native American can tell you otherwise. ———————————— [I’m not an expert. I’m synthesizing information so that I can make the best decisions for my business in the next 12–36 months. Take what I say with a grain of salt. If you have better information please add it with a comment and link to the source.] ———————————— Two years ago I posted on Facebook that viruses were the largest threat to Native Americans. A little bit of xenophobia would have been good for them. My friends were none too kind with their responses:  Pathogens have decimated populations probably since the dawn of time. And they will continue to do so. Lindy Effect The Lindy Effect says that something will be relevant in the future for about as long as it was relevant in the past. The bible has been relevant for 2,000 years. Shakespeare has been relevant for 500 years. Twitter has been relevant for 15 years. You get the idea. Epidemics have been relevant since… forever. How this compares to Coronavirus What’s notable in this example (Source: Acuna-Soto, et al 2002) from Mexico is that 21 out of 22 million native people in Mexico died from pathogens, around 95% of the population. Compare this to the Diamond Princess where 0.2% of people died. The Native Americans had no immunity to the new viruses, Smallpox “imported” from Europe and Cocoliztli possibly native. But the people on the Diamond Princess seem to have had some immunity — only 19% were infected despite the close quarters. Perhaps there is some natural immunity among humans to COVID-19. This gives me hope in our current situation that we won’t end up like the unlucky natives 500 years ago. However, decimated populations are Lindy. If it’s been relevant since the dawn of time, it could happen again. In fact it will. Let’s look at what happened back then to see what we can do now to protect ourselves. Why were Native Americans so susceptible? The new world wasn’t colonized by guns; it was colonized by chickens. That probably sounds strange. We were taught that the brutal colonizers killed a lot of people. And they did. But guns didn’t cause the majority of deaths. You see, in the New World people had very few domesticated animals — only dogs and llamas. You’ve heard of avian flu and you’ve heard of swine flu but you probably never heard of llama flu or dog flu. Because those animals generally don’t pass on viruses to humans. They’re just not similar enough. Europeans living in close proximity to domesticated animals like pigs and chickens built up immunity over time. Then they brought these viruses to the new world which wiped out the native people. The native people didn’t have domesticated chickens to help them build up immunity. This helps explain how we make vaccines. The most common way is with chicken eggs. We inject a virus into a fertilized chicken egg, the virus multiplies and then we extract the virus. We then purify the antigen, a molecule from the virus that our antibodies need to be exposed to. We then inject that antigen into humans who can now get the exposure to the antigen without being exposed to the virus.  Source. A Tangent on Wheels. The reason Native Americans never invented the wheel, supposedly, was because they didn’t have domesticated animals. They didn’t have beasts of burden like oxen or horses. Thus, there was not much use in having a wheel because there was no animal to pull a wheeled cart. But wheelbarrows don’t require beasts of burden. Thus, it’s still a mystery why they never invented wheels. At the very least you can see the utility of the wheel was substantially less for people who didn’t have horses or oxen. Back to the original story… How can we see it coming next time? This is the hard and the simple question to answer. Simply, anything that happens rarely but repeatedly will happen again and surprise us: Economic crashesWorld warsParadigm shifts in science (Heliocentrism, Newton’s laws of motion, Relativity, etc.)Change of super powers, no super power has lasted more than 1,000 yearsMeteorites hitting the earthNew ReligionsAlien invasions (ok, just kidding about this one)The hard answer is I don’t know how to predict these things. Do you know? Let me know in the comments. I’m very curious. ",
            "date": "Answered March 24, 2020",
            "views": "972",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Rohan Venky",
                    "user_href": "/profile/Rohan-Venky"
                }
            ]
        },
        {
            "author_info": {
                "name": "Jerry Hicks",
                "href": "/profile/Jerry-Hicks-15"
            },
            "answer_text": "No one predicted the Covid19 virus which is a mutation of SARS. It broke out in China and was apparently eaten in a Wuhan restaurant, (perhaps pig that had eaten a bat infected with SARS-2), at the end of December 2019. 36 people from the store were infected and each of them infected 2 or more other people. Others contacted it but had no outward symptoms. China instigated a program to contain the disease which is working now. Many people from Wuhan flew to Italy and Covid19 broke out in the Lombard region of Italy a major manufacturing region which attracts immigrants who live in poor conditions and were devastated. Europe quickly became an epicenter for Covid19 in a domino reaction. The disease was spread by people flying from place to place, cruise ships, etc. Although the Italians were prepared for such an event, they were overwhelmed by Covid19 and determined the only way to cope with it was to contain it so it could not spread. But initial efforts failed and they did a complete lockdown of Italy which is working. 18,000 people have contracted the disease over 1000 have died, mostly elderly people. South Korea seemed to be the best prepared country for such a scourge they were able to contain the disease with the help of the population and were able to instigated a rapid system of testing which reached the figure of 3,000 people per day. The U.S. has instigated procedures to contain Covid19 which include lockdowns in California, New York, Massachusetts, Washington, and Texas. ",
            "date": "Answered March 24, 2020",
            "views": "923",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Shilpi Thard",
                    "user_href": "/profile/Shilpi-Thard"
                },
                {
                    "user_id": "Vikram Gandhi",
                    "user_href": "/profile/Vikram-Gandhi-30"
                },
                {
                    "user_id": "Tanvi Rajput",
                    "user_href": "/profile/Tanvi-Rajput-25"
                }
            ]
        },
        {
            "author_info": {
                "name": "Sarath Arunachalam",
                "href": "/profile/Sarath-Arunachalam-1"
            },
            "answer_text": "Surprisingly YES! This outbreak was predicted 500 years ago by a French Astrologer called Nostradamus. He is know for his book called Les Prophéties. The book is know for it's quatrains on future events.  In total, this book has 942 poetic quatrains which predicts all future events till the year 3700 AD. Nostradamus even predicted his own death date and it turned out to be true. This book was first published back in 1555 and has been translated into several languages globally. In one of his quatrains from the second century it's written French Quatrain Le pare enclin grande calamité, Par l'Hesperie & Insubre fera: Le feu en nef peste & captiuité, Mercure en l'Arc Saturne fenera. English Translation The sloping park great calamity To be done through Hesperia and Insubria: The fire in the ship, plague and captivity, + Mercury in Sagittarius Saturn will fade. Let me break down the translation below, Sloping park - Means the park in Wuhan where people can walk into the water. Hesperia- It's a place in the United States Insurbia- This is in Italy The fire in the ship- This means the trade, commerce and wealth. Plague- Corona Virus Captivity- Lockdown Mercury in Sagittarius, Saturn fading- This means the beginning of Jan 23 and 24. This is when majority of the operations started to get suspended in Wuhan. If all the above clues are combined together, we'll get the message that's conveyed on his quatrain. Nostradamus is also famous for many of his previous predictions like the twin tower incident and world war 2. Mostly his predictions are based on past historical events and as we all know History repeats itself. P.S - This is just my personal view and some may agree or disagree based on their point of views. ",
            "date": "Answered March 24, 2020",
            "views": "3",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Peter Cooper",
                    "user_href": "/profile/Peter-Cooper-110"
                },
                {
                    "user_id": "Nidhi Sharma",
                    "user_href": "/profile/Nidhi-Sharma-1088"
                }
            ]
        },
        {
            "author_info": {
                "name": "Rosamund Oliver",
                "href": "/profile/Rosamund-Oliver"
            },
            "answer_text": "Such an outbreak was predicted as likely in a research paper, Bat Coronaviruses in China, published in March 2019, written by scientists working in Wuhan, the centre of the outbreak in China. Details: Bat Coronaviruses in China, Published online 2019 Mar 2. Authors: Yi Fan, Kai Zhao, Zheng-Li Shi, and Peng Zhou, from the CAS Key Laboratory of Special Pathogens and Biosafety, Wuhan Institute of Virology, Chinese Academy of Sciences, Wuhan 430071, China. Introduction: “Fifteen years after the first highly pathogenic human coronavirus caused the severe acute respiratory syndrome coronavirus (SARS-CoV) outbreak, another severe acute diarrhea syndrome coronavirus (SADS-CoV) devastated livestock production by causing fatal diseases in pigs. Both outbreaks began in China and were caused by coronaviruses of bat origin [1,2]. This increased the urgency to study bat coronaviruses in China to understand their potential of causing another virus outbreak. In this review, we collected information from past epidemiology studies on bat coronaviruses in China, including the virus species identified, their host species, and their geographical distributions. We also discuss the future prospects of bat coronaviruses cross-species transmission and spread in China.” The prediction comes in this section in the paper. 2.3. Why China? Two bat CoVs caused outbreaks in China; it is thus urgent to study the reasons to avoid future outbreaks. China is the third largest territory and is also the most populous nation in the world. A vast homeland plus diverse climates bring about great biodiversity including that of bats and bat-borneviruses—most of the ICTV coronavirus species (22/38) were named by Chinese scientists studying local bats or other mammals. The majority of the CoVs can be found in China (Table 1). Moreover, most of the bat hosts of these CoVs live near humans, potentially transmitting viruses to humans andlivestock. Chinese food culture maintains that live slaughtered animals are more nutritious, and this belief may enhance viral transmission. It is generally believed that bat-borne CoVs will re-emerge to cause the next disease outbreak. In this regard, China is a likely hotspot. The challenge is to predict when and where, so that we can try our best to prevent such outbreaks. ",
            "date": "Answered March 24, 2020",
            "views": "427",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Preeti Jain",
                    "user_href": "/profile/Preeti-Jain-146"
                },
                {
                    "user_id": "Ritwik Chandak",
                    "user_href": "/profile/Ritwik-Chandak"
                },
                {
                    "user_id": "Timothy Anderson",
                    "user_href": "/profile/Timothy-Anderson-113"
                },
                {
                    "user_id": "Vineet",
                    "user_href": "/profile/Vineet-119"
                },
                {
                    "user_id": "Yagna Narayana",
                    "user_href": "/profile/Yagna-Narayana-3"
                },
                {
                    "user_id": "Daniel Paul Piotrowicz",
                    "user_href": "/profile/Daniel-Paul-Piotrowicz"
                }
            ]
        },
        {
            "author_info": {
                "name": "Osama Malik",
                "href": "/profile/Osama-Malik-36"
            },
            "answer_text": "Only after WHO declared corona virus as a global pandemic and governments decided to lock down their cities we saw number of rise in false and irrelevant information spreading thorough social media apps and other texting sources. I even read some answers which talk about some voojo doojo guy from the past who predicted future. I say FUCK YOU ALL! But if we carefully look at the other side with scientific and reasearch perspective the answer would be YES! ABSOLUTE YES! I remember one day surfing through the internet I saw a video of a guy who was at that time also the richest man in the world. YES BILL GATES.  THE NEXT OUTBREAK?WE’RE NOT READY This guy predicted it before any other man could because he is the founder of BILL & MELINDA GATES FOUNDATION which invest in efforts throughout Sub-Saharan Africa to improve health and help smallholder farmers lift themselves out of poverty. So next time somebody say this was all predicted by ABRACADABRA dude the grab a brick, smack it onto his face and run as fast as possible. He might be carrying corona. Who knows? Stay home, Stay safe! ",
            "date": "Answered April 1, 2020",
            "views": "366",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Trilok Kumar Jain",
                "href": "/profile/त्रिलोक-कुमार-जैन-Trilok-Kumar-Jain"
            },
            "answer_text": "Both scientists and social scientists have been saying that if you work against nature, you will face problems sooner or later. Scholars have been arguing that our policies are exploitative. We are causing grave damage to nature. Novel Coronavirus is a revolt of nature against human beings. We have been cruel towards our nature. This is not sustainable. We may, believe it or not, nature has its own conscious and it works to restore balance. Traditional Jain lifestyle will solve all your problems regarding this disease. I follow the Jain lifestyle and this lifestyle has come to me from many generations (times immemorial). I give my examples to illustrate my life-style: - I get up early and drink 4 glass of warm water in the morning one hour after sunrise I am vegetarian I avoid taking food after sunset I adopt Preksha Dhyaan (Meditation), Yog, Samayiki in my day to day life Jain saints have been following this lifestyle for thousands of years. Jain saints have been drinking boiled water and they keep masks (muhbatti) when they open their mouth (this is the practice that they have been following for thousands of years). Jain philosophy is now limited to a few persons and its followers are reducing every day. Despite scientific practices, these practices are becoming extinct. It is becoming difficult to revive these practices. Due to Covid-19, people all over the world have become attracted to Jain Philosophy again. Jain families find it difficult to train the young generation in Jain lifestyle due to contractions by the modern education system. The schools teach students that eggs should be eaten and mean has good protein intake, while the parents ask the children not to take eggs and meat or meat-based products. Schools tell something and parents tell the opposite, ultimately the children follow their friends' circle and follow the crowd mentality. Fortunately, we still have many Jain Saints, who are practicing Jain philosophy in their lives. They are a source of hope for the next generations. Traditional Indian practices are extremely helpful in this time. Eat Tulsi, meetha Neem, Methi, and take spices including Haldi, Mirch, and other herbs, which will help you. Return back to old practices (which have been followed by Indians for thousands of years). ",
            "date": "Answered March 7, 2020",
            "views": "14",
            "upvotes": " View 6 Upvoters",
            "upvoters": [
                {
                    "user_id": "Tracy Boylan",
                    "user_href": "/profile/Tracy-Boylan"
                }
            ]
        },
        {
            "author_info": {
                "name": "Anita Baklund",
                "href": "/profile/Anita-Baklund"
            },
            "answer_text": "The specific covid-19 virus was not predicted. But all professional epidemiologists predict a leap of a virus from animals to humans - with uneven time space among them. This is prepared against - even if not as well as we would like.The reason for the deficiency in preparation is preparation costs money, and many people are not willing to pay for protection against a danger which is not already there. I will not bring in party politics, but there is a difference between gouvernments supporting the lasting guard against new epidemics and those which close down the gard against new epidemics as soon as there is no new epidemics going on. These leaps of viruses from animals to humans are mostly due to mutations in the virus, many viruses being specific for which species they infect.In seldom cases the leap can be due to new contact with animals we usually do not have contact with. All these leaps of viruses from animals to humans have some things in common. The most important is ALL the antigens on the virus being new to humans, meaning No humans have ANY innate resistance at all against the virus. Let us compare this with the seasonal flu. With the seasonal flu, the main antigens mutate. This makes us vulnerable to the mutated virus even if we had the flu in the former years, and is why we have new flu shots every year. But still the “new” flu viruses are not totally new after all, as they still carry on them several of their old antigens. These antigens they continue to have, do we have some resistance against. This is why the Spanish Flu, the Avian flu and the Swine flu was different from the ordinary flus. All these flus came new from animals, and no human had any resistance against any of the antigens on them. The covid-19 virus is the same (even if it is not a flu), it came “new” from some animal, possibly bats on the “wetmarked” in Wuhan. No human have any prior immunity against any of the antigens on the virus. That makes us vulnerable to it. Being viruses, they spread like viruses. Viruses can differ in how contagious they are, the most contagious virus we know being the measles virus.But most viruses spread in such a way that every infected person, infects more than one other person. This is what we call “viral spread”. What makes a virus more or less infectious are:How much the infected person excrete the virusHow long time does an infected person excrete virusesHow long does an infected person survive? If a virus kills the infected person too quickly, it has not enough time to infect others.How high virus load (how many viruses) it takes to make a person infectedHow long does the virus survive outside the body, and on which surfaces does it surviveWhat are the infection routes: Contact infection, airborne infection, infection by water, infection by food, infection by vectors like mosquitoes Epidemiologists study these questions, and study how to deal with them. ",
            "date": "Answered March 11, 2020",
            "views": "293",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Clarence Sherrick",
                "href": "/profile/Clarence-Sherrick"
            },
            "answer_text": "From what I understand Sylvia Brown predicted a worldwide pandemic of a flu like illness in 2020. Sylvia Browne: Did Psychic Predict Coronavirus Outbreak ... News2020/03/sylvia-browne I have maintained in several of my posts that a worldwide pandemic would be nature’s response to climate change. And that it could come at any time. This pandemic actually began in 2019. Which in the Tarot would be represented by 20 (Judgment), 1( God), 9 (the Hermit) and also 19 (the Sun). This combination augers a judgment (possibly by God) forcing everyone into a hermit state for up to 1 year. However, if you look at the Tarot for the year 2020, you can then again break one of the two 20s into 20 and the other numbers would represent 2 and 0. Then you would have 20 (Judgment), 0 (the Fool) and 2 (the High Priestess). Or this could mean a year of Judgment-Judgment. The interpretation of Judgment would be universal as a time of Judgment. the Fool would be those not paying attention to where they are going. However, the High Priestess may represent a highly clairvoyant woman (Sylvia Brown) or even a warning given by a highly placed female spiritual entity such as the Virgin Mary. There are likely other interpretations for the Tarot and 2020. However, the presence of Judgment does not appear positive in either year. Also the presence of 20 will exist in every year of this century. Yet 2020 is the only year it will appear twice. ",
            "date": "Answered April 2, 2020",
            "views": "25",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Jennie Balfour",
                    "user_href": "/profile/Jennie-Balfour-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "David McKay",
                "href": "/profile/David-McKay-26"
            },
            "answer_text": "Epidemics and super bugs are not new. Many scientists and researchers have warned that such things will happen. In fact, the reason some countries have been so well prepared for this one is because they were NOT so well prepared for things like SARS and MERS. But, from the perspective of Bible prophecy (my special interest), an increase in such epidemics is specifically followed by a caution that it does not signal the end of the world, but it does signal the “beginning of sorrows”. So there is something far more sinister lying out there beyond what is happening… imo, not only with the corona virus, but also with climate change. Both of these could be key links in a chain of events that would result in something far worse than what we are facing at the moment. Only minutes ago, I released a video which includes excerpts of things I have been saying since October of last year. Please do not be confused by the change in voices. I usually just write the scripts and have a friend do the recording; but this one includes a few excerpts with my real voice. URGENT Update on COVID19 and Bible Prophecy ",
            "date": "Answered March 24, 2020",
            "views": "326",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Eric Christian Hansen",
                "href": "/profile/Eric-Christian-Hansen"
            },
            "answer_text": "Yes, I predicted in 2019, on Quora, that we would have a SIGN from God in 2020, related to the 2nd coming of Jesus, and the SIGN would be previous to the the 100th anniversary of Joan of Arc’s sainthood May 16, 2020. COVID-19 = Christian/Catholic, Omen, Virgo/Virgin/Virus, Iris, Darc/d’Arc/Domremy/Daughter(of God) - 19 years old at her martyrdom 14th/15th century France: bubonic plague, Hundred Years War. Joan of Arc comes down from heaven to save France, and mankind from the fires of Purgatory by her life and martyrdom. 1918 to April 1920: Spanish Flu Pandemic. Joan of Arc is canonized a saint May 16, 1920. 2020: COVID-19 Pandemic. Joan of Arc’s 100th anniversary of her canonization as a saint. This starts the 111 year countdown to the return of Jesus Christ. ACTS 1:11 tells us how that return will be. 2020 + 111 = 2131 A.D. Jesus executed 31 A.D. Joan of Arc executed 1431 A.D. Jesus returns 2131 A.D. The ACTS 1:11 clock is now ticking…. Time to get your ACT together and prepare. ",
            "date": "Answered August 6, 2020",
            "views": "51",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Adrienne Lamb",
                "href": "/profile/Adrienne-Lamb"
            },
            "answer_text": "I’m not a scientist, just a lay person who has had the flu twice since January…and all I can say is that they are identifying this as COVID-19. That tells me the COVID virus has been around and has…grown/mutated. And…will continue to…grow/mutate. Right now we are at a stage where it is growing rapidly - and it needs to be contained/isolated/treated or it will do what all viruses do. Now…there has been many good fiction authors who have predicted virus, as well as movie makers, etc., some of which started zombie outbreaks, some of which predict mass deaths - for example, the 2011 Steven Soderbergh film ‘Contagion’ really comes to mind and is chilling looking at it…right now) religious books, etc., if one wants to make the parallel. ",
            "date": "Answered March 4, 2020",
            "views": "382",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Yegge KC",
                    "user_href": "/profile/Yegge-KC"
                },
                {
                    "user_id": "Paolo Carpi",
                    "user_href": "/profile/Paolo-Carpi"
                },
                {
                    "user_id": "Suneil Rai",
                    "user_href": "/profile/Suneil-Rai"
                },
                {
                    "user_id": "Sumanth Gururaj",
                    "user_href": "/profile/Sumanth-Gururaj-1"
                },
                {
                    "user_id": "Jagan Mohan",
                    "user_href": "/profile/Jagan-Mohan-584"
                }
            ]
        },
        {
            "author_info": {
                "name": "Bhishm Sharma",
                "href": "/profile/भीष्म-शर्मा-Bhishm-Sharma"
            },
            "answer_text": "No, as far as I think. But I have read a science fiction book regarding health topics converted into beautiful philosophical stories. There has been described an infectious organism invading respiratory system of man. This has resulted in widespread deaths of weak persons but miraculous escaping of brave ones. They have been shown as victorious in the war with their enemies. Microorganisms have been shown as personified enemies. The man is shown as a whole country. The tunnels, cavities and spaces inside the respiratory system are shown as mountain caves and big water ponds, rivers etc. The cells in the body of man has been personified as civilians of that big country. It has also been shown that when many body-countries get affected, they hold meeting to fight enemies just as G-20 meeting is going on. The death or destruction of countless body counties due to suffocation of their inhabitants has been shown effectively producing shock waves in readers. The book is showing the whole of health science as philosophical knowledge quite effectively. The readers get dual benefit. They understand health science fully in an interesting way as well as obtain the spiritual uplifting in the form of growth of their kundalini. The book is in Hindi. The book was released in 2018. The name of book is “shareervigyan darshan- ek adhunik kundalini tantra (ek yogi ki premkatha). ",
            "date": "Updated March 28, 2020",
            "views": "445",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Wally White",
                "href": "/profile/Wally-White-1"
            },
            "answer_text": "There are references in novels to a similar virus, but they are too vague to be considered good predictions. There are reports of numerous intelligence reports predicting such a pandemic virus, including a January 2017 briefing by outgoing Obama officials to incoming Trump administration officials, but this was about a pandemic in general, not the COVID-19 virus specifically. There was one report published in China in Jan 2019 (rev Feb 2019) that has so much specificity that it could be considered the first scientific prediction of COVID-19. It is referred to as Bat Coronaviruses in China. Viruses 2019, 11, 210, by Fan, Y.; Zhao, K.; Shi, Z.-L.; Zhou, P. If anyone has an earlier scientific paper that predicted COVID-19, I’d be most interested in hearing about it. But please, NO conspiracy theories. Thx. ",
            "date": "Answered March 25, 2020",
            "views": "311",
            "upvotes": " Answer requested by Jyothir Adithyan",
            "upvoters": [
                {
                    "user_id": "Sukanya Dwivedi",
                    "user_href": "/profile/Sukanya-Dwivedi-3"
                }
            ]
        },
        {
            "author_info": {
                "name": "Sheshachalam Iyengar",
                "href": "/profile/Sheshachalam-Iyengar"
            },
            "answer_text": "Microbial attack and infections have been happening even before Man came into being. Each microbe wants to survive and hence will attack its food source and will reproduce. This is not new to this creation. The rate of spread of Corona virus has been hyped due to the media coverage and the social networks. When we see the positive side of it, this information flood has also made people aware of this infectious disease so that the people are alert. Other than that, Covid-19 is also another virus which will have an impact over the human race for a while and again fade away. ",
            "date": "Answered March 8, 2020",
            "views": "856",
            "upvotes": " View 5 Upvoters",
            "upvoters": [
                {
                    "user_id": "Rohit Rajput",
                    "user_href": "/profile/Rohit-Rajput-76"
                },
                {
                    "user_id": "Aqib Riaz",
                    "user_href": "/profile/Aqib-Riaz-9"
                },
                {
                    "user_id": "Sukanya Dwivedi",
                    "user_href": "/profile/Sukanya-Dwivedi-3"
                }
            ]
        },
        {
            "author_info": {
                "name": "Ivar Wind Skovgaard",
                "href": "/profile/Ivar-Wind-Skovgaard"
            },
            "answer_text": "That a new virus would pop up somewhere at some indeterminate time in the future? Yeah, that’s predictable. Still is. That the new virus in Wuhan was a global epidemic risk? Yeah, Taiwan started testing travelers from Wuhan on December 31st, so at that point that was predictable. That the mainland Chinese authorities would bungle their initial response to such a virus, with disastrous consequences? Yeah, that’s pretty much inherent in their current system of governance. But that a new strain of coronavirus would appear in Wuhan in late November 2019? No, before November 2019 nobody could have predicted those particulars. ",
            "date": "Answered March 18, 2020",
            "views": "325",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Madhusudan Sarkar",
                    "user_href": "/profile/Madhusudan-Sarkar-2"
                }
            ]
        },
        {
            "author_info": {
                "name": "Atul Sankar",
                "href": "/profile/Atul-Sankar"
            },
            "answer_text": "Bill gates predicted a decade ago , we are not ready for the bio wars or bio attacks and he has been warning us to prepare ourselves for panademics from virus and super bugs hidden in the anatartica . Super bugs and super virus are 10x more powerful than Corona . We should be pro active and make sure the vaccine is produced before it is an panademic . We should be friendly with our mother nature . Quit meatUse bio enzymesBe chemical freeLive a minimal life styleRe use., Reduce and recycleBYOB , byoc etc ..We should be using bio degradable products and eliminate plastic and crude from our daily lives . We should be pro active in treating our diseases and make simulations and make cold site z hot site preparations for epidemic . ",
            "date": "Answered March 13, 2020",
            "views": "322",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Marie Godfrey",
                "href": "/profile/Marie-Godfrey-2"
            },
            "answer_text": "This new virus may have to wait a while to be in a book. It’s possible that one or more of the 25 SARS books available from an international company included a prediction of a new version of SARS, but—from the lurid pictures on the covers of some—I wouldn’t bother checking them one by one. I’ve not read the book of Revelations recently so something might be implied there. If someone did write something warning of this occurrence, I wonder if they worried about how it would be named. It seems our current world had some difficulty with that. SARS-CoV-2 (virus) and COVID-19 (disease) are the current names, but even the CDC is still reporting the “old” 2019-nCoV name. ",
            "date": "Answered March 6, 2020",
            "views": "560",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Salvatore Barrera",
                "href": "/profile/Salvatore-Barrera"
            },
            "answer_text": "You would have to go on-line to get the most recent evidence to answer your question unbiasedly, unredactedly, objectively, seriously and truthfully answered because there is now on-line evidence that a doctor that worked in the USA’s biowarfare program released it with a Chinese participant in Wuhan Province in late January 2020. If this is true and not bull-shit, therefore it was NOT predicted but was INTENDED to be strategically released. If so, then it has national security implications that will never be revealed. I hope this conspiracy theory is incorrect, but good luck in your findings, though. ",
            "date": "Updated May 1, 2020",
            "views": "19",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Sukanya Dwivedi",
                    "user_href": "/profile/Sukanya-Dwivedi-3"
                },
                {
                    "user_id": "Charles Raisor",
                    "user_href": "/profile/Charles-Raisor-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Ujjwal Kumar",
                "href": "/profile/Ujjwal-Kumar-209"
            },
            "answer_text": "The novel corona virus that originated in Wuhan, China, in late November. Worst thing is that, China government hiding the fact to the world. The virus is now known to have infected more than 240,000 people around the world and killed more than 9,800 of them. The virus has also spread to about 160 countries and regions around the world in less than three months. Various IT-Tech predicted the COVID, but china & World ignore the fact. Thanks for scrolling. Jai Hind !! ",
            "date": "Answered March 21, 2020",
            "views": "414",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Rob Ratcliff",
                    "user_href": "/profile/Rob-Ratcliff-3"
                },
                {
                    "user_id": "Olsha Jsnbwop",
                    "user_href": "/profile/Olsha-Jsnbwop"
                }
            ]
        },
        {
            "author_info": {
                "name": "William Nabaza",
                "href": "/profile/William-Nabaza"
            },
            "answer_text": "Hello there, I guess there’s none who can predict that, but here’s a corona virus resources[1] hub that you can learn from more of corona virus Footnotes[1] Free Career Research Library of White Papers, Magazines, Reports, and eBooks",
            "date": "Answered April 7, 2020",
            "views": "78",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Brian Flanagan",
                "href": "/profile/Brian-Flanagan-6"
            },
            "answer_text": "Specifically, no. But I have been part of risk management for a few decades, and can tell you that pandemic risk is at top of most credible insurance company’s list of worse case scenarios, risks to be managed. Now that doesn’t mean they all have a handle on operational what exactly to do to effectively manage risk, but it’s on their list. While we can view this as a low probability event, it’s something on the radar, a Black Swan of sorts. ",
            "date": "Answered March 18, 2020",
            "views": "216",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Neelam Tanwer",
                    "user_href": "/profile/Neelam-Tanwer"
                },
                {
                    "user_id": "Karan Ahuja",
                    "user_href": "/profile/Karan-Ahuja-186"
                },
                {
                    "user_id": "Vishal Pooner",
                    "user_href": "/profile/Vishal-Pooner-2"
                }
            ]
        },
        {
            "author_info": {
                "name": "Carl Ejnar Nielsen",
                "href": "/profile/Carl-Ejnar-Nielsen"
            },
            "answer_text": "Yes, I did! I am neither a great seer nor a divine entity, just an ordinary biologist. But from the viewpoint of any biologist, it is easy to see that when you have a big and unexploited biological niche (the human species) it is just a matter of time before somebody start to exploit that niche. As life evolves, and new species appear, there will always be some other species that evolve to use this new resource. And the new species will always evolve to combat these threads - or go extinct it it cannot. Humans already play host to a long list of specific pests, bacteria and vira that can live nowhere else (fleas, tuberculosis bacteria, colds and AIDS vira etc.). Some of these may initially prove so successful that they decimate the population before we have developed a defense against the invader (the black death, typhus, Spanish flu etc.). So really: given the sheer number and mobility of humans, pandemics like the Corona pandemic are inevitable, and we should expect to see them regularly - as we in fact do! ",
            "date": "Answered March 11, 2020",
            "views": "425",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Saranya Palraj",
                    "user_href": "/profile/Saranya-Palraj-3"
                },
                {
                    "user_id": "Adrienne Lamb",
                    "user_href": "/profile/Adrienne-Lamb"
                }
            ]
        },
        {
            "author_info": {
                "name": "Raghu Kashyap",
                "href": "/profile/Raghu-Kashyap-2"
            },
            "answer_text": "Is there a method to chart all likely natural generation of viral vectors based on scientific theory or hypothesis? Answer is NO. Thus prediction is just not possibler. ",
            "date": "Answered April 15, 2020",
            "views": "42",
            "upvotes": " Answer requested by Srini Reddy",
            "upvoters": [
                {
                    "user_id": "Devesh Mahavar",
                    "user_href": "/profile/Devesh-Mahavar-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Kathleen Drude",
                "href": "/profile/Kathleen-Drude"
            },
            "answer_text": "All of us who fight for and rescue animals in Asia! Truth is this was inevitable! It’s now going to run it’s course! It’s not the end of humanity! Lessons that should be learned won’t be! Majority who contract the virus will be just fine! ",
            "date": "Answered March 24, 2020",
            "views": "23",
            "upvotes": " Answer requested by Jyothir Adithyan"
        },
        {
            "author_info": {
                "name": "Krishnamoorthy Ramachandran",
                "href": "/profile/Krishnamoorthy-Ramachandran-5"
            },
            "answer_text": "There are some references in the past almanacs which can be treated as alluding to Corona virus.But whether these were exactly referring to Corona virus is debatable. ",
            "date": "Answered March 7, 2020",
            "views": "214",
            "upvotes": " View 3 Upvoters "
        },
        {
            "author_info": {
                "name": "Barb Crow",
                "href": "/profile/Barb-Crow-1"
            },
            "answer_text": "Dean R Koontz, Eyes of Darkness, written in 1981, talks about a virus called Wuhan400 that escaped from a lab in China and hit in 2020. SOME startling coincidences. ",
            "date": "Answered March 4, 2020",
            "views": "175",
            "upvotes": " View 2 Upvoters"
        },
        {
            "author_info": {
                "name": "Srinivas Charlu",
                "href": "/profile/Srinivas-Charlu-3"
            },
            "answer_text": "No prediction in terms of specific virus was made, though the reported excerpt from “end of days\" seems very prophetic. What is certain is the progress of the pandemic and the problems it has thrown up are as expected by Bill Gates in his talk on pandemic preparations given 5 years ago. ",
            "date": "Answered April 12, 2020",
            "views": "59",
            "upvotes": " Answer requested by Srini Reddy"
        },
        {
            "author_info": {
                "name": "Akshay Sharma",
                "href": "/profile/Akshay-Sharma-3042"
            },
            "answer_text": "No, No one can predicted that the corona virus pandemic will coming in future. There are many rumours that many people predicted about corona virus. But it's now true these all are rumours government make announcements that these all are rumours don't believe on them. Regards Akshay Sharma ",
            "date": "Answered April 10, 2020",
            "views": "88",
            "upvotes": " View 1 Upvoter "
        },
        {
            "author_info": {
                "name": "Tim Kerk.",
                "href": "/profile/Tim-Kerk-1"
            },
            "answer_text": "It is always possible to predict that there will be a major disease outbreak. But not the time or severity. But China is a common source of viral outbreaks. Currently, there is a lot of bad information and conspiracy theories about the virus. ",
            "date": "Answered March 4, 2020",
            "views": "177",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Vithal Chauvan",
                "href": "/profile/Vithal-Chauvan"
            },
            "answer_text": "Yes a virus was predicted before. Bill Gates in 2015. Also two books were written on this. ",
            "date": "Answered March 15, 2020",
            "views": "103",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Kabir Mohammed",
                "href": "/profile/Kabir-Mohammed-30"
            },
            "answer_text": "National Book Trust to launch 'Corona Studies Series' books for all age-groups for the post-Corona readership needs ",
            "date": "Answered March 31, 2020",
            "views": "35",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Indumathi Yelchur",
                "href": "/profile/Indumathi-Yelchur"
            },
            "answer_text": "In kalajnam written by pothuluri Veerabrahmendra swami, he talked about a virus korangi. His devoutees say korangi and carina are same. ",
            "date": "Answered May 13, 2020",
            "views": "26",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Saifee Alii",
                "href": "/profile/Saifee-Alii-1"
            },
            "answer_text": "Yes Sylvia Brown Predicted it 12 years ago. Learn More <<Click Here>> ",
            "date": "Answered March 21, 2020",
            "views": "36",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Max Patrick",
                "href": "/profile/Max-Patrick-5"
            },
            "answer_text": "No. ",
            "date": "Answered April 2, 2020",
            "views": "81",
            "upvotes": " Answer requested by Jyothir Adithyan and Tiffany Havelka"
        }
    ]
}