{
    "title": "Is the 'meeting over' OR is the 'meeting done'? - Quora",
    "tags": [
        "Meetings",
        "Grammar",
        "English Grammar"
    ],
    "response": [
        {
            "author_info": {
                "name": "Mark Hallock",
                "href": "/profile/Mark-Hallock-1"
            },
            "answer_text": "Let’s see, I’m in a meeting with a VP who’s been called to meet me at the corporate office. We’re going to discuss why he discussed a recent robbery with the press when directed not to. Me: Hey Jack, thank you for coming on short notice. Jack: No problem, I needed to stop by anyway, what’s up. Me: Jack, the recent robbery in your region….Jack: Yeah, the police are working it. Me: Ok I’m a little confused, on Monday the robbery happened, you and I spoke about the situation, and how we were going to have our PR people handle any outside communications. Jack: Yes sir Me: Did you receive my e-mail reconfirming our conversation? Jack: Yes sir Me: Tuesday’s National news had you being interviewed discussing the robbery. At the same time you released confidential information related to the investigation. Can you explain to me why you elected to disregard my direction to have PR handle it? And second, by your admission, you read my email reconfirming what was happening. You then disregarded that too. Please explain. Jack: Sir, I understood what you said and wrote but I felt placing a personal spin would benefit the organization. Me: Jack, this meeting is done. Any further discussions will be between you and HR. Effective at once, you’re contract is void. Your decision to release information after being directed not to will impact a police investigation. ",
            "date": "Answered August 10, 2019",
            "views": "49",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "John Strecker",
                    "user_href": "/profile/John-Strecker-3"
                },
                {
                    "user_id": "Robert Muller",
                    "user_href": "/profile/Robert-Muller-1"
                },
                {
                    "user_id": "Lise Russell",
                    "user_href": "/profile/Lise-Russell-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Robert M. Gross",
                "href": "/profile/Robert-M-Gross"
            },
            "answer_text": "Is the \"meeting over\" OR is the \"meeting done\"? Yes. However, the two often have subtly different meanings. The former can mean that the meeting is adjourned; the second may add the implication that we completed what we were working on. Maybe the same; maybe not. ",
            "date": "Answered May 15, 2019",
            "views": "28",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Inhome Tutor",
                    "user_href": "/profile/Inhome-Tutor"
                },
                {
                    "user_id": "Arjun Nayak",
                    "user_href": "/profile/Arjun-Nayak-31"
                }
            ]
        }
    ]
}