{
    "title": "Is the Friday at the end of this current week 'this' Friday or 'next' Friday? - Quora",
    "tags": [
        "Friday",
        "Diction and Word Usage",
        "Vocabulary of the English Language"
    ],
    "response": [
        {
            "author_info": {
                "name": "Elaine Milner",
                "href": "/profile/Elaine-Milner"
            },
            "answer_text": "“This” Friday means the Friday at the end of this current week. “Next” Friday means the Friday at the end of the next week. There are “other expressions” which would not be helpful. To be accurate about ` which Friday` or any other day, just add the date eg. “Friday 15th. Many native speakers get confused about “this” and “next” and so “ this coming Friday “ does seem to help. But I think the date helps more for people who are forgetful. And, writing it on a slip of paper may clarify things unless the slip of paper gets lost between this Friday and next Friday. ",
            "date": "Answered May 5, 2020",
            "views": "93",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Elizabeth Henderson",
                    "user_href": "/profile/Elizabeth-Henderson-40"
                }
            ]
        },
        {
            "author_info": {
                "name": "Pam Hodges",
                "href": "/profile/Pam-Hodges-11"
            },
            "answer_text": "You could use either. This Friday might imply the closest in time, going forward. Next Friday is quite specific, meaning the next Friday to occur, so maybe the best choice. For a Friday that just passed, you could say last Friday, or Friday last. For one beyond the coming Friday, you could say (the, optional) Friday after next. This seems to be a confusion for even native speakers and a conversation trying to establish just which Friday is meant often goes back and forth and includes checking calendars and dates. ",
            "date": "Answered May 5, 2020",
            "views": "14",
            "upvotes": " Answer requested by James Donaldson",
            "upvoters": [
                {
                    "user_id": "Ted Olsen",
                    "user_href": "/profile/Ted-Olsen-10"
                }
            ]
        },
        {
            "author_info": {
                "name": "Miguel Corazao",
                "href": "/profile/Miguel-Corazao"
            },
            "answer_text": "The terms can be a little ambiguous but in general… “This Friday\" generally always means the nearest Friday that is approaching, but not any previous Friday. “Next Friday” is a little less clear but it is usually taken to mean the Friday that is a week or more away. If said on a weekend, it typically means the Friday at the end of the coming week. If said in the middle of the week, it typically means the Friday of the following week. If said on a Monday, the interpretation really depends on the speaker. ",
            "date": "Answered May 5, 2020",
            "views": "24",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Barbara Reed",
                "href": "/profile/Barbara-Reed-46"
            },
            "answer_text": "People differ on this point but personally I would say Friday of this week is ‘this Friday’ and ‘next Friday’ is Friday of the following week. Having said that, I know people who would say ‘next Friday’ instead of ‘this Friday’ and ‘the Friday after next’ instead of ‘next Friday’. For clarity it’s probably best to either give a date or to say ‘Friday of this week’ or ‘Friday of next week’. ",
            "date": "Answered May 5, 2020",
            "views": "26",
            "upvotes": " Answer requested by James Donaldson",
            "upvoters": [
                {
                    "user_id": "James Donaldson",
                    "user_href": "/profile/James-Donaldson-65"
                }
            ]
        },
        {
            "author_info": {
                "name": "Rory Fellowes",
                "href": "/profile/Rory-Fellowes"
            },
            "answer_text": "It depends a little on how distant it is, so at the weekend before, and up until maybe Tuesday you may still say “next Friday”, but by Wednesday it would have to be “this Friday”. If you want to be sure of being understood, you can say “the Friday coming” or “Friday this week”. ",
            "date": "Answered May 5, 2020",
            "views": "21",
            "upvotes": " Answer requested by James Donaldson",
            "upvoters": [
                {
                    "user_id": "Craig Mowbray",
                    "user_href": "/profile/Craig-Mowbray-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Nelson Workman",
                "href": "/profile/Nelson-Workman"
            },
            "answer_text": "My wife and I disagree on this all the time. Her degree is from Oxford, mine from an US university. For her, “next Friday” is the one AFTER the one toward the end of this week. I argue that “next” is the superlative form of the obsolete word “neigh” meaning “near.” So “next” means “nearest.” that is the Friday in the future nearest to today. ",
            "date": "Answered May 5, 2020",
            "views": "62",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "James Donaldson",
                    "user_href": "/profile/James-Donaldson-65"
                }
            ]
        },
        {
            "author_info": {
                "name": "John English",
                "href": "/profile/John-English-23"
            },
            "answer_text": "The question was - Is the Friday at the end of this current week \"this\" Friday or \"next\" Friday? Where I am, today is Wednesday. I am looking forward to “this Friday.” (That will be in 2 days.) Netx Friday will be the one in 9 days. The distinction seems very clear. Perhaps the OP will tell me what I missed. Thanks for the A2A. ",
            "date": "Answered May 6, 2020",
            "views": "50",
            "upvotes": " Answer requested by James Donaldson"
        },
        {
            "author_info": {
                "name": "Philip Dale",
                "href": "/profile/Philip-Dale-9"
            },
            "answer_text": "Dependent upon the location of your residence (ie where you live and the language you speak) it could be either. In my opinion they are one and the same but, (here in Australia) “this” is the friday next occurring and “next” is the day occurring after the next friday which actually occurs after this friday! Clear as mud. ",
            "date": "Answered May 5, 2020",
            "views": "5",
            "upvotes": " Answer requested by James Donaldson"
        },
        {
            "author_info": {
                "name": "Curt Weinstein",
                "href": "/profile/Curt-Weinstein"
            },
            "answer_text": "Yes! “This Friday” is used to refer to the next Friday that happens. BUT “Next Friday” is used to refer to the next Friday that happens. Therefore, this day is the next day — weird. (← joke) ",
            "date": "Answered May 5, 2020",
            "views": "24",
            "upvotes": " View 1 Upvoter"
        },
        {
            "author_info": {
                "name": "Elizabeth Henderson",
                "href": "/profile/Elizabeth-Henderson-40"
            },
            "answer_text": "It’s Wednesday today but maybe you posted your question yesterday, on Tuesday. Either way, ‘this’ Friday is Friday 8 May. ‘Next’ Friday is the 15th. I’m British if that helps, and OLD. ",
            "date": "Answered May 6, 2020",
            "views": "11",
            "upvotes": " View 1 Upvoter "
        },
        {
            "author_info": {
                "name": "Marilyn Kleekamp",
                "href": "/profile/Marilyn-Kleekamp"
            },
            "answer_text": "You would refer to it as “this Friday”. Ex.: “My plan is to get my closet cleaned by this Friday.” (meaning upcoming in the week.) Glad to help you! :) MK ",
            "date": "Answered May 5, 2020",
            "views": "20",
            "upvotes": " View 1 Upvoter"
        }
    ]
}