{
    "title": "Is there such a thing as a fish? - Quora",
    "tags": [
        "No Such Thing as a Fish",
        "Marine Biology"
    ],
    "response": [
        {
            "author_info": {
                "name": "Salman Ahmad Khan",
                "href": "/profile/Salman-Ahmad-Khan"
            },
            "answer_text": "Including the details from your question: The excellent podcast by the QI elves, No such thing as a fish is named after a fact found in the opening chapter of the Oxford Encyclopedia of Underwater Life — which claims “fish” are not a single group. I.e., “salmon are more closely related to camels than hagfish.” To what extent is this true? I will agree that it is a fact that the phrase “no such thing as a fish” is found in the opening chapter of the book Encyclopedia of Underwater Life - Oxford Reference. However, is this phrase stating a fact in itself or is it being taken out of context? As Jack Fraser said, the book is actually a discourse (Jack didn’t use that word, but I like it better, OK Jack) on the way we group and categorize different species — because we love grouping things, making lists, finding things in common, finding things that differentiate. I also likes the thread spawned by the answer by Kirk A. Janowiak. But then in the end, it is a group of sounds we humans invented to identify the things in the water that more or less look and behave in a similar way. On the rare chance, if it is an existential question whether all the things we identify as fish actually exist, we need to talk you pay for drinks, I’ll pay for the fish ;) ",
            "date": "Answered August 10, 2017",
            "views": "275",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Faryal Memon",
                    "user_href": "/profile/Faryal-Memon-2"
                },
                {
                    "user_id": "Samuel Rosenberg",
                    "user_href": "/profile/Samuel-Rosenberg-10"
                }
            ]
        },
        {
            "author_info": {
                "name": "Paul van der Linden",
                "href": "/profile/Paul-van-der-Linden-4"
            },
            "answer_text": "Of course there’s such a thing as a fish. Look at me, I’m a new fish in the realm of answering questions on quora. That’s a fish of a different kettle, for sure! Or, according to the urban dictionary: A new fish: “A newcomer to something such as a person who spends their first night in jail or then new kid on the block. Many new fish get made fun of by people who are more experienced then them.” I may feel like a fish out of the water, answering a question like this, So, unless you’re into cannibalism, and feel the need to suddenly eat me, I feel a bit like a fish out of the water, fishing for compliments probably, but, unless you have other fish to fry, I’d say there’s definitely something fishy about all of this, and, it’s probably me. So, it being neither fish nor fowl, I’ll give you the fish eye regardless. And, there’s definitely some that is a fish, and, it apparently is…… me. ",
            "date": "Answered September 14, 2017",
            "views": "142",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "David James",
                "href": "/profile/David-James-114"
            },
            "answer_text": "Well, if you believe in evolution then everything is related and even shellfish, cuttlefish and silverfish have common ancestry with teleosts. Bears have the same problem, and a number of other kinds of animals. But you can take this ti a ridiculous level and say there is no such thing as a horse because there are also sea horses, or there is no such thing as America because it can be defined in different ways. In the end there is no such thing as us because we can define ourselves in different ways and what means “me” to one person is quite different to what this word entails for the next person. Getting back to fish, though. You can argue about this cladistically as well as looking at genomes, as to whether there is a taxonomic grouping which contains all of the animals we have for most of the last two hundred and sixty years since Systema Naturae been commonly considering as fish, namely the hagfish, the lampreys, the sharks, rays and chimeras and the bony fishes or teleosts, right through to lungfishes and coelacanths and other species which look on the road to being amphibia. And the answer to that is if you want it, you can make it. Some systems of classification have it. The main ones used to have it, it was called Pisces, and some don't. Now I can still use the terms Yugoslavia, Czechoslovakia and Pisces meaningfully even if all of them are no longer “official\" clades and countries. If they are the best word to define a thought, then such words are still valid. Perceptions of reality depend very much on language, but if we have an idea then each of us is entitled to use language in such a way as to describe the thought we have. Reality remains reality and if we choose to make it vanish or change on a puff of smoke for ourselves by some feat of linguistic legere-de-main, we scarcely have the right to enforce our altered perception of reality on others. ",
            "date": "Answered July 28, 2017",
            "views": "352",
            "upvotes": " Answer requested by Jack Fraser",
            "upvoters": [
                {
                    "user_id": "Mert Ozan",
                    "user_href": "/profile/Mert-Ozan-2"
                },
                {
                    "user_id": "PRIYAN ELANGOVAN",
                    "user_href": "/profile/PRIYAN-ELANGOVAN-1"
                },
                {
                    "user_id": "Taylor Griffin",
                    "user_href": "/profile/Taylor-Griffin"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/Kevin-F-2"
                },
                {
                    "user_id": "Andrei Streche",
                    "user_href": "/profile/Andrei-Streche-1"
                },
                {
                    "user_id": "Ryan Saridar",
                    "user_href": "/profile/Ryan-Saridar"
                },
                {
                    "user_id": "Venetia Flowers",
                    "user_href": "/profile/Venetia-Flowers"
                },
                {
                    "user_id": "Dan West",
                    "user_href": "/profile/Dan-West-35"
                },
                {
                    "user_id": "Robin Chatterjee",
                    "user_href": "/profile/Robin-Chatterjee-2"
                },
                {
                    "user_id": "Ellie Presner",
                    "user_href": "/profile/Ellie-Presner-1"
                },
                {
                    "user_id": "Kevin Ferrucci",
                    "user_href": "/profile/Kevin-Ferrucci"
                },
                {
                    "user_id": "Kanav Dwevedi",
                    "user_href": "/profile/Kanav-Dwevedi"
                },
                {
                    "user_id": "Nikita Tuteja",
                    "user_href": "/profile/Nikita-Tuteja"
                },
                {
                    "user_id": "John Starich",
                    "user_href": "/profile/John-Starich"
                },
                {
                    "user_id": "Gabriel Broome",
                    "user_href": "/profile/Gabriel-Broome"
                },
                {
                    "user_id": "Dane Clarke",
                    "user_href": "/profile/Dane-Clarke-1"
                },
                {
                    "user_id": "John Cinsky",
                    "user_href": "/profile/John-Cinsky"
                },
                {
                    "user_id": "Anupam Nayak",
                    "user_href": "/profile/Anupam-Nayak-12"
                },
                {
                    "user_id": "Prathamesh Kanbaskar",
                    "user_href": "/profile/Prathamesh-Kanbaskar"
                },
                {
                    "user_id": "Ashutosh Agarwal",
                    "user_href": "/profile/Ashutosh-Agarwal-6"
                },
                {
                    "user_id": "Puthtipong Thunyatada",
                    "user_href": "/profile/Puthtipong-Thunyatada"
                },
                {
                    "user_id": "Yaaseen Bodhanya",
                    "user_href": "/profile/Yaaseen-Bodhanya"
                },
                {
                    "user_id": "Seán Tjong",
                    "user_href": "/profile/Seán-Tjong"
                },
                {
                    "user_id": "Tyler McMann",
                    "user_href": "/profile/Tyler-McMann"
                },
                {
                    "user_id": "Andres Pilquil Varas",
                    "user_href": "/profile/Andres-Pilquil-Varas"
                },
                {
                    "user_id": "Steve Jones",
                    "user_href": "/profile/Steve-Jones-235"
                },
                {
                    "user_id": "Christine Wendt",
                    "user_href": "/profile/Christine-Wendt"
                },
                {
                    "user_id": "S Mann",
                    "user_href": "/profile/S-Mann-20"
                },
                {
                    "user_id": "Zeibura S. Kathau",
                    "user_href": "/profile/Zeibura-S-Kathau"
                },
                {
                    "user_id": "Isaac Starobin",
                    "user_href": "/profile/Isaac-Starobin"
                }
            ]
        },
        {
            "author_info": {
                "name": "Kirk A. Janowiak",
                "href": "/profile/Kirk-A-Janowiak"
            },
            "answer_text": "This encyclopedia entry is simply being pedantic. It is a “smarty pants” statement. What we call “Fish” are so called based on relatively easy to observe physical characteristics and morphological taxonomy that just about anyone can grasp. Fish live in water, “breathe” by means of gills, have a backbone (only visible when the fish is opened, but usually “observable” in life), are (mostly) “cold-blooded,” (usually) have scales covering their skin, and have appendages usuallyborganized as fins. This taxonomic description is a human invention. It is admittedly arbitrary, but is quite useful in placing animals into basic groups. It helps humans to categorize without resorting to complicated techniques that require laboratory investigation and oft n great expense in time and resources. One can merely look at an organism and fairly easily categorize it as fish or not fish. Today we know much more about biochemical and genetic relationships and can classify organisms based on their DNA profiles, but the old fashion Linnaean taxonomic classification system using more or less dichotomous decisions about observable characteristics still works great and is a whole lot easier to do in the field or on the spot. ",
            "date": "Answered July 28, 2017",
            "views": "13",
            "upvotes": " View 30 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Jacob Bieker",
                    "user_href": "/profile/Jacob-Bieker-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Nate Fuller",
                "href": "/profile/Nate-Fuller-20"
            },
            "answer_text": "I mean, a Hagfish is kind of “out there,” isn't it? I'd guess it's only called a fish because that's what they called it back when everything in the ocean was a fish. It's like an eel… but it doesn't even have a spine? It does this weird slime thing to defend itself? I wouldn't think we'd call it a fish if we found it today. Say… a salmon and a trout, or a salmon and a clownish or a tuna or even a moray eel. I'm no marine biologist, or any other kind of biologist for that matter, but I'd say they all have some element of common “fishiness” that camels, dolphins, and even hagfish lack. My 2 cents. ",
            "date": "Answered July 30, 2017",
            "views": "271",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Jess O'Neill",
                    "user_href": "/profile/Jess-ONeill-3"
                },
                {
                    "user_id": "João Guilherme Madeira Araújo",
                    "user_href": "/profile/João-Guilherme-Madeira-Araújo"
                }
            ]
        },
        {
            "author_info": {
                "name": "Tim Kaye",
                "href": "/profile/Tim-Kaye-1"
            },
            "answer_text": "Fish can have more than one definition. For example, for culinary purposes it can include crab, lobster, squid, and jellyfish. However, standard reference works on fish generally define fish as any vertebrate that's not a tetrapod (amphibian, reptile, bird or mammal).Since vertebrate and tetrapod are each monophyletic, fish is the \"cleanest\" sort of paraphyletic taxon there is. ",
            "date": "Answered July 31, 2017",
            "views": "231",
            "upvotes": " View 2 Upvoters"
        }
    ]
}