{
    "title": "Is this story (link in details) correct? - Quora",
    "tags": [
        "Indian Rupee Inflation",
        "The Economy",
        "Indian Rupee (INR)",
        "The Economy of India"
    ],
    "response": [
        {
            "author_info": {
                "name": "Aviral Shrivastava",
                "href": "/profile/Aviral-Shrivastava"
            },
            "answer_text": "It is correct only to a very limited extent. Yes, the prices are definitely determined by the demand and supply of dollars. And India needs dollars to pay for the import of oil. But, India has always been importing oil and paying for it in dollars. The real question is this : Why did the price of dollar suddenly go so high? The reason for this is that it is not that the dollar is appreciating, but in fact the rupee is depreciating. And according to the article that you have provided as a link, if we stop using petrol for a week, the prices of dollar will come down. But is it sustainable? We need petrol not only for our cars, but also for generation of power, running machines and a lot of other things. So this idea is not only foolish, but idiotic. Also, the article says that \"I promise to pay the bearer the sum of Hundred Rupees\" means that if a person goes to the RBI, he will be paid Gold worth Rs 100. This is crap. Indian currency is no longer denominated by Gold (it used to be so earlier, but not any more). It actually means that a person will be paid good(and not gold, mind you) worth Rs 100. Similar is the case with USD. If you take a $100 bill to the US, you can purchase goods worth $100. (without getting into too much technical details). India needs dollar not only for petrol, but also for all its imports which include minerals, heavy machinery, arms, electronics. Oil does make a major component (the biggest one, in fact), but it is also the most important one. The country can't just stop using oil for one week. We'll have to go without electricity, stop all the travelling, etc etc. Instead of stopping to import oil, the country needs to be more investment friendly so that foreign companies can come here and indulge in productive activities. That is when the prices of Rupees will appreciate. If you notice carefully, Rupee is depreciating not only with respect to dollar, but with respect to all the other foreign currencies. Since USD is used as an international currency and we are used to it, we see all the news only concerned with dollars. ",
            "date": "Answered August 20, 2013",
            "views": "508",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Hemanth Meka",
                    "user_href": "/profile/Hemanth-Meka"
                },
                {
                    "user_id": "Bryce Johannes",
                    "user_href": "/profile/Bryce-Johannes"
                }
            ]
        }
    ]
}