{
    "title": "Is Wattpad really the right place to get audience for your writings? If not then what is the right one? - Quora",
    "tags": [
        "Web Publishing",
        "Breaking in as a New Author or Novelist",
        "eBook Publishing",
        "Wattpad.com (website)",
        "Digital Publishing",
        "Self-Publishing",
        "Book Publishing"
    ],
    "response": [
        {
            "author_info": {
                "name": "Sochuiwon Priscilla Khapai",
                "href": "/profile/Sochuiwon-Priscilla-Khapai"
            },
            "answer_text": "Well it depends. I wouldn't recommend it(at all) if you're someone who wants to be taken seriously for your writing. Period. Getting an audience?now that's a whole new thing on its own. Sure you may get an audience-one of hormone driven amateur teens that want a quick entertaining read of romantic fantasies about their imaginary crushes. One Direction fanfics, vampires, werewolves, hot guy rescued by nerdy heroine-if that's the thing you're into (despite being criminally cheesy #sorry but it's true ) then go for it.Now of course, there are always exceptions. There may be possibly good writers out there,who have the potential and are genuinely serious about pursuing teenage romantic genres. However, these are gems in a sea of utter shit. The standard is super low(you don't even need basic grammar ) and you'll likely end up in a bubble of just catering to the endless suggestions and comments of your daily readers. That's really not a good thing even if you want to tell a mildly authentic stupid story. My two cents is- Take the traditional long route. Write at home alone with your ideas and characters; take the risk of failing 99.9% of the time but if you're meant to be, that 0.01% chance of success will happen. It's gonna be hard,really hard to the point where you’re drained mentally,emotionally and physically; you'll have heartaches and breakdowns and go nearly insane, but hey thats the price you pay for even attempting to create good art. You should write not because you want to get an audience or be published or for any of the glitzy fantastical part of being a ‘celebrity- writer’, rather do it because you can’t help it. You can't help breathing right? Something like that. Hell most of us aspiring writers may never get published but you owe it to yourself at least to be truthful about the voices inside your head, to those people that are dying to come alive on paper through you, you're merely a mediator. Take that responsibility consciously. Just write away, you are not entitled to an audience before even assembling a cast. Wattpad is a temporary fleeting ‘pleasure’ that can trap a new, sensitive insecure writer with false accolades. I suggest you seek a higher kind of ‘joy’,one of freedom and truth that comes with telling a story that is the reward itself. ",
            "date": "Answered April 22, 2018",
            "views": "68",
            "upvotes": " View 56 Upvoters",
            "upvoters": [
                {
                    "user_id": "Nancy Collins",
                    "user_href": "/profile/Nancy-Collins-17"
                },
                {
                    "user_id": "Sigmund Royce S",
                    "user_href": "/profile/Sigmund-Royce-S-1"
                },
                {
                    "user_id": "Stephanie Meyer",
                    "user_href": "/profile/Stephanie-Meyer-22"
                },
                {
                    "user_id": "Chan Kah Wai",
                    "user_href": "/profile/Chan-Kah-Wai-1"
                },
                {
                    "user_id": "Serendipity",
                    "user_href": "/profile/Serendipity-99"
                },
                {
                    "user_id": "Joseph Dubem",
                    "user_href": "/profile/Joseph-Dubem"
                },
                {
                    "user_id": "Mikasa Akrmen",
                    "user_href": "/profile/Mikasa-Akrmen"
                },
                {
                    "user_id": "Rose Mohammad",
                    "user_href": "/profile/Rose-Mohammad-2"
                },
                {
                    "user_id": "오대일",
                    "user_href": "/profile/오대일"
                },
                {
                    "user_id": "Eugene Leung",
                    "user_href": "/profile/Eugene-Leung-20"
                }
            ]
        },
        {
            "author_info": {
                "name": "K.P. Wee",
                "href": "/profile/K-P-Wee"
            },
            "answer_text": "Thanks, Tommy, for the A2A. I may not be the best person to ask this because I didn't know what WattPad is and I had to look it up online and also read up on it on Wikipedia.  What I got out of my 'research' is that there seems to be potential with it in the sense that a select few have been fortunate enough to be 'discovered.' Having said that, though, that's only a few lucky people whose works stood out (I assume).  For you, and for anybody that is thinking of putting their stories on WattPad, I would suggest the following: Be realistic with your expectations.  What is your expectation of having your stories posted there? Gain a few followers? Receive plenty of views? Convert them to become fans so they would cross over to your website? How many do you anticipate would do so... per month? ...per year? etc.  You are right in the sense that if you put in too much effort into WattPad and do not get what you expected, then it would be a huge letdown. I know of a guy on Quora, for instance, who wrote a book recently and right away expected sales, expected people who follow him here to automatically convert to paying customers. When that didn't happen, he was flustered and (in my opinion) became argumentative and threw people under the bus because sales didn't go up right away. He started whining and complaining and became clingy and needy. That's the story with one guy I know. He didn't understand his market, he didn't understand anything related to writing and publishing; he just wrote a book because his mentor told him to (as the story goes).  It's important to have realistic expectations, and understand what you will get in return for your efforts. That way you will not feel deflated, etc., if for some reason your goal is not met, which is always a possibility. As long as you understand the types of readers on WattPad, what they're interested in reading, and other factors, then it will help you make the proper decision as to whether or not to post there - or on any other sites where your writing will be shared for free.  Once again, I'm not the best person to ask because I'm not familiar with WattPad, but those are my insights. Good luck to you! ",
            "date": "Answered November 22, 2014",
            "views": "77",
            "upvotes": " View 21 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Liora Wilkins",
                    "user_href": "/profile/Liora-Wilkins-1"
                },
                {
                    "user_id": "Joseph Dubem",
                    "user_href": "/profile/Joseph-Dubem"
                },
                {
                    "user_id": "Maria Echica",
                    "user_href": "/profile/Maria-Echica"
                },
                {
                    "user_id": "Malady C.d",
                    "user_href": "/profile/Malady-C-d"
                },
                {
                    "user_id": "Brendan Tolentino",
                    "user_href": "/profile/Brendan-Tolentino"
                },
                {
                    "user_id": "Go Ray June",
                    "user_href": "/profile/Go-Ray-June"
                },
                {
                    "user_id": "Essie LaShae",
                    "user_href": "/profile/Essie-LaShae-1"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/Axel-The-Axolotl"
                },
                {
                    "user_id": "Milky Tae",
                    "user_href": "/profile/Milky-Tae-3"
                },
                {
                    "user_id": "Fatma Sari",
                    "user_href": "/profile/Fatma-Sari"
                }
            ]
        }
    ]
}