{
    "title": "Is writer's block real, or is it just an excuse of not having the will to write again? - Quora",
    "tags": [
        "Writer's Block",
        "Creating Writing Advice",
        "Creative Writing",
        "Writers and Authors",
        "Writing Advice"
    ],
    "response": [
        {
            "author_info": {
                "name": "Tamara Wilhite",
                "href": "/profile/Tamara-Wilhite"
            },
            "answer_text": "Yes, it is real. I’ve experienced in my hobby writing (science fiction/horror) and professional writing (technical). I’ve occasionally had a story flow and then realize I don’t know what to do after reaching this point. What is a good way to tie up the loose ends? How do I get from this great action scene to the ending I have imagined? What are these other characters doing, and should I show it to the reader? I periodically interview other writers for my N3F and Liberty Island Magazine columns. Sometimes writers get a great idea for a novel or story but may not be able to get the structure or details to crystallize. For some, it means the story sits for weeks or months. For others, they’re asking for ideas after banging their head on the keyboard for a few hours. I run into it professionally from time to time, though that’s less of an issue because of how much detail generally comes with the request. For example, someone asked for a 500 word article on supercars. OK, what can I write about that includes these key terms and hasn’t been done a hundred times over? Or I’m asked to write yet another plumbing article. We’ve already discussed what shouldn’t be do-it-yourself and what signs of impending plumbing problems are. What else can I do that isn’t a rehash? It isn’t a matter of will for most writers. I want to get the story done and submitted. Or I want to get the article done so I can send it in and get paid. ",
            "date": "Answered September 7, 2020",
            "views": "85",
            "upvotes": " View 2 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Mathias Van Pelt",
                    "user_href": "/profile/Mathias-Van-Pelt-1"
                },
                {
                    "user_id": "Sana Yabuki",
                    "user_href": "/profile/Sana-Yabuki"
                }
            ]
        },
        {
            "author_info": {
                "name": "Denis Martindale",
                "href": "/profile/Denis-Martindale"
            },
            "answer_text": "Perhaps this could be called Editor’s Block as writing includes this activity as well. Being upbeat and creative, or business-like and creative, can lead to an initial momentum, but the next day can be full of frets and frowns. Some traumatic experiences sabotage us… and yes, we need to get back on track, but getting back on track isn’t always that easy. Imagine it like there’s hardly any feedback or upvotes or no income paying for our writing to continue. I’ve had poverty shoved done my throat sideways for decades. I kept going until I had nothing left to pay for the expenses to distribute my thoughts to others. Later on, family finances improved. So there I was paying out the extra for various ways to improve. I had to get larger TVs and PC monitors and better white QWERTY keyboards, basic reading glasses to help me focus on the text better. So as I could pay for the computer and Internet age I wasn’t going to suffer writer’s block any further? : No, I’ve had times I simply got on with life instead. When you’ve written about 3,000 poems, you’re not in a damned hurry to write another 3,000 poems. Same with writers who think that way, too. ‘Why worry about a thing?’ as the pop song says. Do we really NEED to write? Are we somehow addicted? Or do we feel it’s our destiny? Maybe we’ve got a few years left in us? Should we invest more time writing or not? This is where the nagging doubts can undermine the good that only we can do. : Do we want to make money, help Mankind, or both? Whatever the motivations are, we put in the hours at the expense of our lives and our time left on this Earth. We either retire or we return to write another day. : denismartindale (co)(uk) : ",
            "date": "Answered September 7, 2020",
            "views": "41",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Sana Yabuki",
                    "user_href": "/profile/Sana-Yabuki"
                }
            ]
        },
        {
            "author_info": {
                "name": "Mathias Van Pelt",
                "href": "/profile/Mathias-Van-Pelt-1"
            },
            "answer_text": "Is writer's block real, or is it just an excuse of not having the will to write again? Yes it is real and also is sometimes and I say sometimes, an excuse not to write. But my boss, which believe it or not is my journal, won't have any of it. If I don't want to write or am blocked or just cant think of anything, I have to give my journal an explanation why. My journal is heartless, ruthless even. It's wants every little detail as to why I don't want to write, or am blocked, etc. so I tell my journal why and why not and this and that and by the time I'm done making excuses and such I'm back to writing because I'm tired of explaining everything to my journal. I write in my journal first thing every morning and even then if I can't come up with anything I have to explain why! It gets me out of my block almost everytime. Except for those days I just absolutely refuse to write like a 2 year old refusing to nap. I just write, “Not today journal, not today!!!” But, most of the time it pulls me back to what I'm suppose to be doing. ",
            "date": "Answered September 7, 2020",
            "views": "44",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Sana Yabuki",
                    "user_href": "/profile/Sana-Yabuki"
                }
            ]
        },
        {
            "author_info": {
                "name": "Harold Cohn",
                "href": "/profile/Harold-Cohn-1"
            },
            "answer_text": "Writer’s block is real. I wrote an article about writer’s block for a Articles Writing class in college many years ago. This article is titled: “WRITER’S BLOCK” and is my book “Crazy Old Man, An Anthology” (amazon.com). The best thing I can suggest you do is do anything you want for three days except write! Give your mind the forgoing time to rest. Repeat the forgoing steps If necessary. Harold P.S. In addition, I wrote the article “HOW TO SURVIVE A WRITER’S WORKSHOP” if you are taking writing classes. This article is also in the book “Crazy Old Man, An Anthology. Harold ",
            "date": "Answered September 11, 2020",
            "views": "11",
            "upvotes": " Answer requested by Sana Yabuki",
            "upvoters": [
                {
                    "user_id": "Sana Yabuki",
                    "user_href": "/profile/Sana-Yabuki"
                },
                {
                    "user_id": "Darrell Blank",
                    "user_href": "/profile/Darrell-Blank"
                }
            ]
        },
        {
            "author_info": {
                "name": "Brenda Nichols",
                "href": "/profile/Brenda-Nichols-9"
            },
            "answer_text": "Writer’s Block is a convenient catch all term indicative of something else going on. You’ve written yourself into a corner you don’t know how to get out ofYou’re trying to force a situation into a story that doesn’t fitYou’ve come to a scene you’re struggling with, a love scene, a fight scene, the villain reveal, etc.You’re struggling with the description of a magic system, a system of commerce, religion, time travel, etc.The story took an unexpected turn and you can’t get it back on trackYou’ve lost interest in the storyYou’ve received an honest critique and don’t want to accept the fact that parts of your story suck.Discovering writing really is hard work.Self-inflicted doubt, impostor syndrome, questioning your talent, wanting to ditch it all and throw up your hands in defeat. (This is the most devastating of all.)So, yes, for lack of something better to call it, writer’s block will do. ",
            "date": "Answered September 9, 2020",
            "views": "40",
            "upvotes": " View 2 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Sana Yabuki",
                    "user_href": "/profile/Sana-Yabuki"
                },
                {
                    "user_id": "Darrell Blank",
                    "user_href": "/profile/Darrell-Blank"
                }
            ]
        },
        {
            "author_info": {
                "name": "Dia Stone",
                "href": "/profile/Dia-Stone"
            },
            "answer_text": "Writers block is real, I personally, have never experienced it. I tackle a new book with the process originating in my mind, I have already worked out the characters, the villains, I do not even make notes. I am a writer that just goes with the flow,, I have been told by other Authors, Dia you are just a natural. I would like to think that is true… Regards, Author Dia Stone ",
            "date": "Answered September 8, 2020",
            "views": "48",
            "upvotes": " View 2 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Elizabeth Franklin",
                    "user_href": "/profile/Elizabeth-Franklin-84"
                },
                {
                    "user_id": "Sana Yabuki",
                    "user_href": "/profile/Sana-Yabuki"
                }
            ]
        },
        {
            "author_info": {
                "name": "Skip Press",
                "href": "/profile/Skip-Press"
            },
            "answer_text": "Get my late friend Jerrold Mundis’s book on beating writer’s block - he was the all-time expert on beating it, and it’s real, but self-created. Break Writer's Block Now! (Writer's Library): Mundis, Jerrold: 9780312053949: Amazon.com: Books ",
            "date": "Answered September 7, 2020",
            "views": "50",
            "upvotes": " View 2 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Sana Yabuki",
                    "user_href": "/profile/Sana-Yabuki"
                }
            ]
        },
        {
            "author_info": {
                "name": "Jay Robert Baer",
                "href": "/profile/Jay-Robert-Baer"
            },
            "answer_text": "I happen to be an expert in writers block and in my opinion it doesn’t exist because your brain never shuts down and I don’t think people use it as an excuse I think they just get stuck in their writing and they don’t know how to keep going so they blame it on writers block. ",
            "date": "Answered September 8, 2020",
            "views": "28",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Sana Yabuki",
                    "user_href": "/profile/Sana-Yabuki"
                }
            ]
        },
        {
            "author_info": {
                "name": "Michael Pickard",
                "href": "/profile/Michael-Pickard"
            },
            "answer_text": "Writers’ block is when a writer refuses to make a decision about what comes next. Something happens next in the story, right? The writer needs to decide which of the possibilities and put down the words. The hesitation is likely caused by the question, “What if I made the wrong choice? I will have wasted time and effort.” You’ll figure that out later during editing. But if you don’t write, you’ll never have the words to edit. ",
            "date": "Answered September 10, 2020",
            "views": "30",
            "upvotes": " Answer requested by Sana Yabuki"
        },
        {
            "author_info": {
                "name": "Jeremy Menefee",
                "href": "/profile/Jeremy-Menefee"
            },
            "answer_text": "For me, writer’s block is usually my subconscious mind realizing I have a big problem that my conscious mind doesn’t yet see. A plot hole, a character acting out of character, a scene that doesn’t move the story forward. I fix it by writing something else entirely. Somewhere in the middle of doing so, I’ll realize what’s wrong and how to fix it, and the block is gone. ",
            "date": "Answered September 10, 2020",
            "views": "28",
            "upvotes": " View 1 Upvoter"
        }
    ]
}