{
    "title": "Is writing fanfiction a good step for a beginner to become a writer? Or does it ruin one's creativity? - Quora",
    "tags": [
        "Fanfiction",
        "Creativity",
        "Creative Writing",
        "Writers and Authors"
    ],
    "response": [
        {
            "author_info": {
                "name": "Anna Whitlinger",
                "href": "/profile/Anna-Whitlinger-1"
            },
            "answer_text": "Fanfiction is amazing! Seriously, it is. You see, the majority of published authors like to play it safe. They cater to audiences whose tastes have long been established, and it works, but this also results in the same time-worn tropes floating around. You know the ones. Then there are fanfiction authors, who have different intentions and goals entirely. These are authors who love their fandoms enough to pour hours of effort into showing their appreciation, who write for the sheer joy of writing. Their primary concern is not convincing agents that their content is marketable, but rather getting the attention of other fans. Now, the fanfiction culture is beautiful. Yes, you can point out the ugly underbelly of fanfiction that no one wants to talk about, but ultimately it is a culture that encourages experimentation and deconstruction of literary norms. Fanfiction authors will take a wearied trope--say, bad boy meets good girl--and beat the living shit out of it, until it transforms into a magnificent butterfly. Other fanfiction authors will then behold this butterfly and think, “But what if you did this…” So, responding to a reading community that relishes anything it's never seen before, authors of fanfiction are free to explore uncharted territory and challenge themselves as writers. And even if you enjoy familiar tropes (I know I do), just writing about existing characters can serve as practice for illustrating different personalities and voices; the same goes for world-building. To answer your question, yes, writing fanfiction is definitely a good exercise—and laboratory—for character/plot development. As long as fanfiction is kept within legal constraints, I think it is a wonderful community of readers and writers that is one partner in a mutually beneficial relationship with the published world: fanfiction draws inspiration from original works, then introduces new ideas to published writing that keep the wonder of storytelling alive. ",
            "date": "Answered December 26, 2016",
            "views": "660",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Elizabeth Centori",
                    "user_href": "/profile/Elizabeth-Centori"
                },
                {
                    "user_id": "Compass Fairee",
                    "user_href": "/profile/Compass-Fairee"
                },
                {
                    "user_id": "Ash Martin",
                    "user_href": "/profile/Ash-Martin-15"
                }
            ]
        },
        {
            "author_info": {
                "name": "James Sams",
                "href": "/profile/James-Sams-6"
            },
            "answer_text": "Thanks for the A2A. I think most writing is a good thing. The only time it isn’t is when the person writing refuses to learn as they write. This sounds strange, but I have encountered people who do this. They have in their mind what the “perfect” way to write is, and the heck with what anyone else thinks, they just keep writing that way. (Examples are continually writing vignettes or refusing to use grammar that would allow clarity.) Fan fiction, in and of itself, is a bit of a controversial thing. I was once approached by a person who wanted to find out how to go about printing 500 copies of a book filled with fan fiction, because they knew most printing companies aren’t interested in violating copyrights. No matter how hard he tried to explain that it was for “personal use” and the copies were only for the “fans”, he was never going to convince me that 500 copies of a printed fan fiction book was acceptable. Likewise, I was never going to convince him that he and his other fan fiction writers who wanted printed copies were in fact trying to violate copyright and intellectual property laws. Morally and ethically I am not so happy with the idea of fan fiction. It is a terrible gray area. I would personally never publish/make available any fan fiction as it could very much eventually hurt my career as a writer. As someone who has written licensed media tie-ins (under a pseudonym), I don’t want to take the chance of ruining future possible jobs by upsetting someone if I was found to be writing unlicensed fan fiction. So, in that way, I do consider writing fan fiction a step away from becoming a good writer. Not in an ability to write sense, but in an opportunity for career sense. This is however seemingly a more and more outdated opinion and only reflects my personal values. All of that having been said, I often suggest to new writers, who have questions about giving a character depth/creating a character, that they pick an actor or a character from a movie that they are really familiar with and write that person as the character. Having a fully fleshed out idea for a character makes it a lot easier to write that character. This could, I suppose, be considered writing fan fiction. I always strongly suggest changing the name and any identifying traits. If I were to write an adventure story and model the main character off of Indiana Jones, it would not be wise to call the character Indy, Henry, Jones, or Junior. Now is this wrong? Not really, I don’t think so. Especially if the character is unrecognizable when the writer is done and releases the story. Done properly, the character will have depth, will pick up unique traits from the writer, and in the end will not be instantly recognizable as “Indiana Jones”. Is this unprecedented? Not even remotely. How many Indiana Jones knock-offs have there been? A hundred? If I start naming some, you’ll probably nod and agree that those are Indiana Jones knock-offs, either with the character, the story, or both. Tomb Raider, Tales of the Gold Monkey, and King Solomon’s Mines. Even Disney got in on the action with Tailspin and DuckTales. And those are just some I think you might know. If you research, you’ll find dozens of cheap B-movies most of us have never heard of that blatantly take the idea of the movie and copy the character. But how many of the movies that imitated took the idea to a different level and came up with something new and spectacular? The Mummy, Romancing the Stone, The Goonies. Done right, basing an idea upon an existing idea is a good thing. It goes back to the whole idea of “everything has already been written”. In a way, that is true, but in other ways, there will always be as many stories as there are people to tell a story. I once heard that Raiders of the Lost Ark was based on an old movie called Secret of the Incas. If that’s true, then even Indiana Jones was a character based upon an older character. I feel like I am starting to ramble, sorry. So I will wrap this up now before it becomes an entire lecture. Ideas are not copyrightable. The way an idea is presented is. If you want to write a book about a kid who catches wild animals and trains them to battle, you can. But you can’t call them Pokemon, or him Ash. And the more your story looks just like The Pokémon Company, the less value it has to offer the rest of the world and the more it steals from the hard work the The Pokémon Company has put into creating it. Fan fiction, depending upon how it is done, is most definitely a good exercise in character and plot development. Fan fiction done as copyright infringement is an exercise in unscrupulous behavior of questionable morality. ",
            "date": "Answered December 8, 2016",
            "views": "764",
            "upvotes": " View 4 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Smriti Suresh",
                    "user_href": "/profile/Smriti-Suresh-2"
                },
                {
                    "user_id": "Alex Granato",
                    "user_href": "/profile/Alex-Granato"
                },
                {
                    "user_id": "Steph Halloran",
                    "user_href": "/profile/Steph-Halloran"
                },
                {
                    "user_id": "Andrew Hoffman",
                    "user_href": "/profile/Andrew-Hoffman-36"
                }
            ]
        },
        {
            "author_info": {
                "name": "Alexandra Pell",
                "href": "/profile/Alexandra-Pell"
            },
            "answer_text": "I think it's a pretty fantastic way to improve as a writer — as long as you seek out honest, and perhaps even harsh, criticism. I don't feel that it takes away the ability to develop plot. The fan fiction has an entirely new plot. The inspiration plot — the Canon — can be compared to somebody writing a historical novel about, I don't know, let's say World War II. Have they had the plot handed to them? Of course not. And even if they flesh out that world with thousands of pages of documents from and about that time period, does that take away the necessity of world building? No. Because they're creating a new world within the structure of what has already been given to them. What if they write about documented historical figures? Even ones who wrote memoirs? Does that take away from character development? No. It forces them to delve deeply into new ideas about these humans who really existed — in other words, characters who have been handed to them. So let's call the above “World War II fan fiction.” If anything, having so many constraints can make your job a little harder. You have to be very creative indeed to create something fresh out of this vast material you've already taken in. There's also the cliched but true advice: ideas alone are worthless. Every random guy (or gal) you meet has some sort of idea that would make an awesome story. You will often see these people asking how to “protect” their ideas so nobody will steal them. Typically that gets a laugh from professional writers. Ideas are worthless. If you have an idea, there’s a 0% chance that nobody else has come up with one almost exactly like it. Execution is what matters. I have a lot of mindblowingly vivid dreams with original characters of depth. With vast, intricate, unusual worlds. Many of them contain complete, coherent, and exciting plots. If those were the most difficult parts of the process, I would have published quite a few novels by now. But I haven't. Because those are just the bones of any piece of writing. Writing fan fiction is fully suitable for learning how to turn ideas into prose that is solid, skillful, and enjoyable. As I said above though, that happens when you make sure to get, and take in, significant criticism and advice — particularly from people whose writing you find to be superior to your own. ",
            "date": "Updated January 19, 2017",
            "views": "715",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Mariano Rivero",
                    "user_href": "/profile/Mariano-Rivero-1"
                },
                {
                    "user_id": "Kurt Weggler",
                    "user_href": "/profile/Kurt-Weggler"
                },
                {
                    "user_id": "Jeff Collins",
                    "user_href": "/profile/Jeff-Collins-6"
                },
                {
                    "user_id": "Claire J. Vannette",
                    "user_href": "/profile/Claire-J-Vannette"
                }
            ]
        },
        {
            "author_info": {
                "name": "Severine Riise",
                "href": "/profile/Severine-Riise"
            },
            "answer_text": "Fanfiction is good for writing, because, you know, at least you’re writing something. Writing things, be they fanfiction, «regular» fiction, or nonfiction, all help you get your writing on. You put your grammatical prowess into praxis, and might get some pointers from readers should you post it online. It’s a good experience. Can it wind up earning you money? Sure thing. It isn’t likely to, but who am I to name it impossible when it has been done (looking at you, Fifty Shades). Can it be a good starter assignment when you’re a fresh off the racks writer to go for fanfiction? Sure. Like I said, it’s about writing something, giving you much needed experience you won’t get if you just sit around aspiring to write. But it does have its drawbacks. What is useful about fanfiction can also be a challenge when moving on to other endeavours. With fanfiction you have a world, some plotlines, and some characters all readily made for you to play with, that you can use to you heart’s content. Cut some here, edit some there, find an interesting and plausible (or less plausible) development and get that stuff on a page. It doesn’t require as much establishment of backstory, as many explanations and worldbuilding, because chances are most of that is already there. It’s all to easy when moving on to your own world, that you try to establish these early on so you can write your story as a fanfiction. While this could work if done right, it’d just as easily (arguably more likely) develop into a information-dense encyclopedia early on that’ll turn off readers well before the actual story you want to tell starts. Another issue is target audience. When writing fanfiction for people, you are usually writing for people in a niche. If it’s based off the world of Harry Potter most people are Harry Potter readers. As a new writer you have to carve out that niche yourself. You can start off in a genre (e.g. making it clear it is high fantasy to attract readers interested in that), but you won’t start off with a given fanbase that’ll have an idea of what you’re writing prior to reading it. But write something. Nothing is worse for an aspiring writer than pausing at the aspiration without getting to the writing part. Be it fanfiction, poetry, lyrics, NaNoWriMo, a full blown novel or an elaborate review on the latest movie you saw, get the tools of your trade on the ready, and use them. Best of luck, and write on! ",
            "date": "Answered October 9, 2018",
            "views": "489",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Lycanroc Okami",
                    "user_href": "/profile/Lycanroc-Okami"
                },
                {
                    "user_id": "Sallie Loftin",
                    "user_href": "/profile/Sallie-Loftin-1"
                },
                {
                    "user_id": "Steve Jones",
                    "user_href": "/profile/Steve-Jones-243"
                },
                {
                    "user_id": "Miguel, Olof Jusinski",
                    "user_href": "/profile/Miguel-Olof-Jusinski"
                }
            ]
        },
        {
            "author_info": {
                "name": "Sallie Loftin",
                "href": "/profile/Sallie-Loftin-1"
            },
            "answer_text": "Fan fiction has a built in audience, depending on your fandom (there are stories out there for one season shows and some of their audiences are waning.) If you want to find out if you can write something that someone out there is going to read, fan fiction … well, has a built in audience. LOL. If you haven’t been fighting off story ideas in your head since you were younger, but find yourself wanting to interact with the characters you love, this is a good way to start writing. The mechanics of making your story communicate are the same in fan fiction and in non derivative fiction; the only thing that is easier is that you have a pre-built universe and characters people are already interested in. On the other hand, and there are generally at least two sides to most things, if you’ve been world building and creating characters and making notes, drawing maps, or just having fun writing up the characters and places, you might want to work in your own worlds instead of starting with fan fiction. World building is hard work, but it’s also fun because … well, if you can figure out a way to justify the way the world works, you don’t have to defend what you’ve done to someone who doesn’t think this universe you’ve borrowed works that way. I started in fan fiction when I was 12. Off and on I have played in my own worlds and I’m getting ready to publish. I know there are others out there who have done the same, much faster (Fifty Shades, whatever you may think of it, went from fan fiction to original and made money for the author. Not necessarily the way you want to go, of course. Magician was submitted in the 80s in all the wrong ways and became a best seller, 50 Shades has done well, but, and this is a big but here, you don’t see a lot of other series or stand alones following the same paths.) As Severine Riise has said, the big thing, which ever route you take, is to get words on paper … or electrons; and then read those words back and see where they need changing, how they could better tell your story, etc. The only person who knows your stories is you. And as my online writing mentor says, write with joy. ’Cause if you don’t enjoy it, don’t expect anyone else to do so. (big grin) ",
            "date": "Answered October 9, 2018",
            "views": "167",
            "upvotes": " Answer requested by Deborah Ramos",
            "upvoters": [
                {
                    "user_id": "Alexandria Dziekonski",
                    "user_href": "/profile/Alexandria-Dziekonski"
                },
                {
                    "user_id": "Melissa Wickersham",
                    "user_href": "/profile/Melissa-Wickersham-3"
                },
                {
                    "user_id": "Sarah Lynn Johnson",
                    "user_href": "/profile/Sarah-Lynn-Johnson"
                },
                {
                    "user_id": "Xhulia Balla",
                    "user_href": "/profile/Xhulia-Balla"
                },
                {
                    "user_id": "Stephanie Van Dyke",
                    "user_href": "/profile/Stephanie-Van-Dyke-3"
                },
                {
                    "user_id": "Casey Parker",
                    "user_href": "/profile/Casey-Parker-28"
                },
                {
                    "user_id": "Courtney Johnson",
                    "user_href": "/profile/Courtney-Johnson-139"
                },
                {
                    "user_id": "Lorena Cavalcanti",
                    "user_href": "/profile/Lorena-Cavalcanti-1"
                },
                {
                    "user_id": "Aakmal Bin Mohd Yusop",
                    "user_href": "/profile/Aakmal-Bin-Mohd-Yusop"
                },
                {
                    "user_id": "Liona Squires",
                    "user_href": "/profile/Liona-Squires"
                },
                {
                    "user_id": "Josiah Rose",
                    "user_href": "/profile/Josiah-Rose-1"
                },
                {
                    "user_id": "Sarah Amundsen",
                    "user_href": "/profile/Sarah-Amundsen-1"
                },
                {
                    "user_id": "Sam Alexis",
                    "user_href": "/profile/Sam-Alexis-6"
                },
                {
                    "user_id": "Dante Crailman",
                    "user_href": "/profile/Dante-Crailman"
                },
                {
                    "user_id": "Sumathi S",
                    "user_href": "/profile/Sumathi-S-96"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/April-May-59"
                },
                {
                    "user_id": "Kencana Maria",
                    "user_href": "/profile/Kencana-Maria"
                },
                {
                    "user_id": "Michael P. Dunn",
                    "user_href": "/profile/Michael-P-Dunn"
                },
                {
                    "user_id": "Lawrence Raybon",
                    "user_href": "/profile/Lawrence-Raybon"
                },
                {
                    "user_id": "Anand Silodia",
                    "user_href": "/profile/Anand-Silodia"
                },
                {
                    "user_id": "Amanda Kwok",
                    "user_href": "/profile/Amanda-Kwok-3"
                },
                {
                    "user_id": "Joseph Roberts",
                    "user_href": "/profile/Joseph-Roberts-19"
                },
                {
                    "user_id": "Alexandra Pell",
                    "user_href": "/profile/Alexandra-Pell"
                },
                {
                    "user_id": "Johan Carter",
                    "user_href": "/profile/Johan-Carter-1"
                },
                {
                    "user_id": "Chase Bivens",
                    "user_href": "/profile/Chase-Bivens-1"
                },
                {
                    "user_id": "Emma German",
                    "user_href": "/profile/Emma-German-2"
                },
                {
                    "user_id": "Toni Lichtenstein Bogolub",
                    "user_href": "/profile/Toni-Lichtenstein-Bogolub"
                },
                {
                    "user_id": "Corwin Bradshaw",
                    "user_href": "/profile/Corwin-Bradshaw"
                },
                {
                    "user_id": "Leif Sann",
                    "user_href": "/profile/Leif-Sann"
                },
                {
                    "user_id": "Jordan Yates",
                    "user_href": "/profile/Jordan-Yates-4"
                },
                {
                    "user_id": "Michael Vogel",
                    "user_href": "/profile/Michael-Vogel-5"
                },
                {
                    "user_id": "Geoffrey Brickley",
                    "user_href": "/profile/Geoffrey-Brickley"
                },
                {
                    "user_id": "Jasper Boccalatte",
                    "user_href": "/profile/Jasper-Boccalatte"
                },
                {
                    "user_id": "Hannah Turc",
                    "user_href": "/profile/Hannah-Turc"
                },
                {
                    "user_id": "Ken Weaver",
                    "user_href": "/profile/Ken-Weaver-7"
                },
                {
                    "user_id": "Emma Homes",
                    "user_href": "/profile/Emma-Homes"
                },
                {
                    "user_id": "Rue Chan",
                    "user_href": "/profile/Rue-Chan-1"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/Candacey-D"
                },
                {
                    "user_id": "Anne Fletcher-Jones",
                    "user_href": "/profile/Anne-Fletcher-Jones"
                },
                {
                    "user_id": "Authora Pendragyn",
                    "user_href": "/profile/Authora-Pendragyn"
                },
                {
                    "user_id": "Hannah Perrin",
                    "user_href": "/profile/Hannah-Perrin-3"
                },
                {
                    "user_id": "Alexander Goodwill",
                    "user_href": "/profile/Alexander-Goodwill"
                },
                {
                    "user_id": "Edward Conway",
                    "user_href": "/profile/Edward-Conway"
                },
                {
                    "user_id": "Anzan Shaan",
                    "user_href": "/profile/Anzan-Shaan"
                },
                {
                    "user_id": "Melissa Hoy",
                    "user_href": "/profile/Melissa-Hoy-2"
                },
                {
                    "user_id": "Sam Wiegand",
                    "user_href": "/profile/Sam-Wiegand-1"
                },
                {
                    "user_id": "Stijn Hommes",
                    "user_href": "/profile/Stijn-Hommes"
                },
                {
                    "user_id": "Riley Thompson",
                    "user_href": "/profile/Riley-Thompson-12"
                },
                {
                    "user_id": "Lara l Lord",
                    "user_href": "/profile/Lara-l-Lord"
                },
                {
                    "user_id": "Anna Vale",
                    "user_href": "/profile/Anna-Vale-2"
                },
                {
                    "user_id": "John McClenny",
                    "user_href": "/profile/John-McClenny"
                },
                {
                    "user_id": "Lucas Souza",
                    "user_href": "/profile/Lucas-Souza-36"
                },
                {
                    "user_id": "Alina Zhiltsova",
                    "user_href": "/profile/Alina-Zhiltsova"
                },
                {
                    "user_id": "Ash Bloomfield",
                    "user_href": "/profile/Ash-Bloomfield"
                },
                {
                    "user_id": "Abraham Muñoz",
                    "user_href": "/profile/Abraham-Muñoz-3"
                },
                {
                    "user_id": "Aware Deshmukh",
                    "user_href": "/profile/Aware-Deshmukh"
                },
                {
                    "user_id": "Jacqueline George",
                    "user_href": "/profile/Jacqueline-George-1"
                },
                {
                    "user_id": "Osho Tiwary",
                    "user_href": "/profile/Osho-Tiwary-2"
                },
                {
                    "user_id": "Shea Francis Patrick Moran",
                    "user_href": "/profile/Shea-Francis-Patrick-Moran"
                },
                {
                    "user_id": "David Rutter",
                    "user_href": "/profile/David-Rutter-2"
                },
                {
                    "user_id": "Ilana Halupovich",
                    "user_href": "/profile/Ilana-Halupovich"
                },
                {
                    "user_id": "Julian Shi",
                    "user_href": "/profile/Julian-Shi-1"
                },
                {
                    "user_id": "Michal Herbert",
                    "user_href": "/profile/Michal-Herbert"
                },
                {
                    "user_id": "Mike Jackson",
                    "user_href": "/profile/Mike-Jackson-15"
                },
                {
                    "user_id": "Ryan Mars",
                    "user_href": "/profile/Ryan-Mars-2"
                },
                {
                    "user_id": "Holly Root-Gutteridge",
                    "user_href": "/profile/Holly-Root-Gutteridge"
                },
                {
                    "user_id": "Lisa Shields",
                    "user_href": "/profile/Lisa-Shields-4"
                },
                {
                    "user_id": "Barbara Brutsch",
                    "user_href": "/profile/Barbara-Brutsch"
                }
            ]
        },
        {
            "author_info": {
                "name": "Mercedes R. Lackey",
                "href": "/profile/Mercedes-R-Lackey"
            },
            "answer_text": "I am strongly in favor of fanfic, but I am prejudiced, since that is how I started out. (At the age of about 10 or 11 I started writing Andre Norton fanfic before I ever knew there was such a thing.) The advantage of writing fanfic is that your world is already built for you, and the background of at least some of your characters is established. You get to concentrate on mastering plot and the characterization of your original characters. As Mike Prinke has mentioned writing “fanfic”, in the form of “spec scripts,” is a requirement for attempting to get a job on an existing show. If you are writing fanfic purely for pleasure and to have more stories in your chosen ‘verse than the writer(s) have already produced, that’s great. It’s fantastic to have a creative hobby. Enjoy, find your audience and niche, and always remember that this is supposed to be fun. If it stops being fun, if you find yourself raging against your readers, or coming into conflict with other writers in the ‘verse, stop. If you are writing fanfic for practice, then you need to take a whole different approach. You need to find someone who is a good, hard, but fair critic. Preferably more than one. You can’t just coast; you need to improve. You need to move out of using the existing ‘verse characters into creating your own, entirely original cast. You need to read books about writing and put what you learn into practice. You also need to remember that 50 Shades and Twilight were the black swans of writing. Editors really are not combing the billions of words of fanfic looking for a new star, no matter what you’ve been told or you hope. Once you are good enough for real publication, you’ll have to break in the old-fashioned way. ",
            "date": "Answered December 7, 2016",
            "views": "28",
            "upvotes": " View 68 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Grace Hurd",
                    "user_href": "/profile/Grace-Hurd-6"
                },
                {
                    "user_id": "Joel Biswas",
                    "user_href": "/profile/Joel-Biswas-1"
                },
                {
                    "user_id": "Amanda Belms",
                    "user_href": "/profile/Amanda-Belms"
                },
                {
                    "user_id": "Lycanroc Okami",
                    "user_href": "/profile/Lycanroc-Okami"
                },
                {
                    "user_id": "Metltzi Eli",
                    "user_href": "/profile/Metltzi-Eli"
                },
                {
                    "user_id": "Ashley Kim",
                    "user_href": "/profile/Ashley-Kim-194"
                },
                {
                    "user_id": "Rebekah Bernal",
                    "user_href": "/profile/Rebekah-Bernal-1"
                },
                {
                    "user_id": "Johanus Haidner",
                    "user_href": "/profile/Johanus-Haidner"
                },
                {
                    "user_id": "Deborah Teramis Christian",
                    "user_href": "/profile/Deborah-Teramis-Christian"
                },
                {
                    "user_id": "Steve Jones",
                    "user_href": "/profile/Steve-Jones-235"
                },
                {
                    "user_id": "Alexander Skow",
                    "user_href": "/profile/Alexander-Skow"
                },
                {
                    "user_id": "Paul Austin Ardoin",
                    "user_href": "/profile/Paul-Austin-Ardoin"
                },
                {
                    "user_id": "Anna Vale",
                    "user_href": "/profile/Anna-Vale-2"
                },
                {
                    "user_id": "Larry Atchley Jr",
                    "user_href": "/profile/Larry-Atchley-Jr"
                },
                {
                    "user_id": "Kamila Miller",
                    "user_href": "/profile/Kamila-Miller-2"
                }
            ]
        },
        {
            "author_info": {
                "name": "Deborah Ross",
                "href": "/profile/Deborah-Ross-6"
            },
            "answer_text": "Your question reminds me of a panel I was on some years ago, all of us pro writers with significant trad pub cred, and all of us appreciating the role of fanfic (both the fanfic we wrote, read, and was about our own work). I think fanfic is neither here nor there in terms of being a career path on its own. I would never instruct an aspiring writer to write fanfic instead of original work. At the same time, I would never tell a young writer to not write fanfic if that is what they really want to do. (Just don’t try to sell it or you will run afoul of the copyright holder’s attorneys!) At its best, fanfic is the equivalent a love letter to the creators of the world and characters. It arises from the joy you feel in that particular world. But more than that, it’s a way to begin writing, to get in touch with that inner wellspring of words and scenes and characters. The important thing is to write and write and write until you find your own stories. That may mean following the fanfic plot lines as they morph into something quite different from the original (be sure to file all the serial numbers off) or setting aside fanfic in favor of something that’s original from the onset. As for ruining creativity, I think that’s nonsense. No one really understands what that is, anyway. Most stories are riffs on others, perhaps dreams based on childhood bedtime stories, bits of visual imagery, ways other works have stayed with us and become mushed up in different combinations in our minds. I think the most important way to cultivate creativity is to let your imagination follow what delights you. Follow your passion, as Joseph Campbell advised. If that’s into the world of Star Trek or Harry Potter or The Lord of the Rings, just notice what parts are the most wonderful to you. Pay attention to what’s the coolest thing that might happen next — that’s where your creativity will be most nourished and where you will discover your authentic voice. ",
            "date": "Answered October 10, 2018",
            "views": "18",
            "upvotes": " View 15 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Elisabeth Hewer",
                    "user_href": "/profile/Elisabeth-Hewer"
                },
                {
                    "user_id": "Lycanroc Okami",
                    "user_href": "/profile/Lycanroc-Okami"
                },
                {
                    "user_id": "Anand Silodia",
                    "user_href": "/profile/Anand-Silodia"
                },
                {
                    "user_id": "Ashleigh Stanton",
                    "user_href": "/profile/Ashleigh-Stanton-2"
                }
            ]
        },
        {
            "author_info": {
                "name": "Tony Jamie Gordon",
                "href": "/profile/Tony-Jamie-Gordon"
            },
            "answer_text": "I would say it’s a mixed bag, honestly. It won’t ruin your creativity, though, that’s for certain. When I was regularly writing fanfiction I was pretty much at my creative peak, and I was churning out a lot of different content. Was it good? Not at all at the start, but you can see if you look over the course of my fic writing career that I improved significantly over time. Some of it was better formal instruction (I started in middle school, so I had a lot more learning how to write left) but a lot of it was just that I was writing all the time and getting instant feedback from readers about what worked and what didn’t. The only real negative to starting in fanfiction is the lack of respect that it has in our societies right now. Some people may look down on you if you start in fanfiction and move to original fiction, or pull a 50 Shades and adapt a fanfic into an original fic. (50 Shades gave fanfiction SUCH A BAD NAME. I’m still really salty about it. Her writing is not good! But there’s a lot of fanfiction that’s better than published books I’ve read.) Also, at least for me, writing fanfiction was easier at first because I didn’t have to develop the world or the characters, I just had to develop a plot. It was sort of a way to ease into it. I went from writing fanfiction, to writing fanfiction with an original character or two thrown in, to writing fully original works (not that I don’t indulge in writing fanfic at all nowadays, I just work more on my own, original worlds because I’m mildly obsessed with them haha.) ",
            "date": "Answered October 10, 2018",
            "views": "442",
            "upvotes": " View 4 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Sarah Lynn Johnson",
                    "user_href": "/profile/Sarah-Lynn-Johnson"
                },
                {
                    "user_id": "Dorie Campbell",
                    "user_href": "/profile/Dorie-Campbell"
                },
                {
                    "user_id": "Mikey Rigs",
                    "user_href": "/profile/Mikey-Rigs"
                },
                {
                    "user_id": "Casey Parker",
                    "user_href": "/profile/Casey-Parker-28"
                },
                {
                    "user_id": "Michal Soukup",
                    "user_href": "/profile/Michal-Soukup"
                },
                {
                    "user_id": "Harm Kramer",
                    "user_href": "/profile/Harm-Kramer"
                },
                {
                    "user_id": "Mariana Sanchez",
                    "user_href": "/profile/Mariana-Sanchez-2"
                },
                {
                    "user_id": "Joseph Roberts",
                    "user_href": "/profile/Joseph-Roberts-19"
                },
                {
                    "user_id": "Adam Price",
                    "user_href": "/profile/Adam-Price-25"
                },
                {
                    "user_id": "Alexandra Pell",
                    "user_href": "/profile/Alexandra-Pell"
                },
                {
                    "user_id": "Lucas Souza",
                    "user_href": "/profile/Lucas-Souza-36"
                },
                {
                    "user_id": "Toni Lichtenstein Bogolub",
                    "user_href": "/profile/Toni-Lichtenstein-Bogolub"
                },
                {
                    "user_id": "Ivan Braun",
                    "user_href": "/profile/Ivan-Braun-1"
                },
                {
                    "user_id": "James Sams",
                    "user_href": "/profile/James-Sams-6"
                },
                {
                    "user_id": "Alina Zhiltsova",
                    "user_href": "/profile/Alina-Zhiltsova"
                },
                {
                    "user_id": "Aaron Li",
                    "user_href": "/profile/Aaron-Li-12"
                },
                {
                    "user_id": "Holly Root-Gutteridge",
                    "user_href": "/profile/Holly-Root-Gutteridge"
                },
                {
                    "user_id": "Ryan Mars",
                    "user_href": "/profile/Ryan-Mars-2"
                },
                {
                    "user_id": "Barbara Brutsch",
                    "user_href": "/profile/Barbara-Brutsch"
                }
            ]
        },
        {
            "author_info": {
                "name": "Mike Prinke",
                "href": "/profile/Mike-Prinke"
            },
            "answer_text": "A common exercise, both in getting hired as a writer and improving your skills, is to create what’s called a Spec Script. This is a script for an existing television series, ideally one that is very popular and presently running, more ideally one you would like to work on. Very occasionally these actually get picked up and produced, but the goal is to get attention. To that end you try to push the limits of what would be acceptable on that show. As an example, word has it that a would-be comedy writer once wrote a spec script for Seinfeld wherein George, Jerry, and Elaine have a three-way. The premise in itself got a lot of attention and the script was known by word of mouth. The writer apparently got picked up to work on the show, but sadly the episode was never produced. Then again, it was never meant to be. In a sense this practice resembles fan fiction writing, but with a few rules that help structure it. Much of fan fiction is little more than wish fulfillment fantasy writing, without a lot of regard for the characters or the actual format of the show. The worst you could do is sideline the starring characters in favor of someone else, aka “Mary Sue.” A television spec script, on the other hand, is designed to perfectly display fundamental understanding of the show’s pacing, its characters’ motivations, and the overall formula each episode follows. It must be a believable entry, even if it does push boundaries, and that takes a lot of analysis — not just into the characters and themes of the show, but also the spacing and ongoing role of commercial breaks, which are designed into the script as act breaks, as well as other common devices used to invoke suspense or else keep the story moving. I wrote a spec script once. To do so I had to marathon a couple of seasons and write beat-by-beat summaries of each episode. After about eight of them I wrote a “generic” beat outline covering what kind of information is established in each act and when it gets used. From there I devised my own script accordingly. This is the kind of research I’ve found is constructive. Fan fiction does not by any means have to be bad. It can get you a job! But leave the shipping at the docks, and remember to do your homework! ",
            "date": "Answered December 7, 2016",
            "views": "805",
            "upvotes": " View 19 Upvoters",
            "upvoters": [
                {
                    "user_id": "Chase Bivens",
                    "user_href": "/profile/Chase-Bivens-1"
                },
                {
                    "user_id": "Mariana Sanchez",
                    "user_href": "/profile/Mariana-Sanchez-2"
                },
                {
                    "user_id": "Bernard Glassman",
                    "user_href": "/profile/Bernard-Glassman-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Laura Mitchell",
                "href": "/profile/Laura-Mitchell-5"
            },
            "answer_text": "Note I am speaking as someone who does not write fiction of any kind, so take that however you will. Yes, I think that writing fan fiction can be an excellent way to develop all your writing skills, including plot and character development. Despite what you might think, it can promote originality and creativity as well. Even the most thoroughly developed fictional worlds have events, times, places, and people that are only alluded to, and these can require a great deal of inventiveness to flesh out in a credible manner. In creative terms, it’s rather like writing historical fiction, except that the history itself is fictional. And of course, fan fiction is fun, or people wouldn’t write it or read it. The downside to using fan fiction as your writing exercise is a lack of honest critique. While virtually every host site permits reviews, reviewers only rarely comment on an author’s writing mechanics and only occasionally on plot or character development. An author might receive some constructive criticism if they ask for it, but truly negative reviews are rare—there’s an etiquette of “Don’t like? Don’t read.” Fan fiction reviewers can’t be trusted to tell you, or even to know, if your writing is bad. Absolute crap writing still gets reviews like “Geeeeeeeee I am so I am so geeking out over this story LOOOOVE IT!” Yes, someone wrote that. So if you want to use fan fiction to improve your writing, find a good critic or two to read and review it. ",
            "date": "Answered December 8, 2016",
            "views": "370",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Diya Upadhyay",
                    "user_href": "/profile/Diya-Upadhyay-1"
                },
                {
                    "user_id": "Chase Bivens",
                    "user_href": "/profile/Chase-Bivens-1"
                },
                {
                    "user_id": "Leonard Aston",
                    "user_href": "/profile/Leonard-Aston-3"
                },
                {
                    "user_id": "Max Soloff",
                    "user_href": "/profile/Max-Soloff"
                },
                {
                    "user_id": "Toni Lichtenstein Bogolub",
                    "user_href": "/profile/Toni-Lichtenstein-Bogolub"
                },
                {
                    "user_id": "Alina Zhiltsova",
                    "user_href": "/profile/Alina-Zhiltsova"
                },
                {
                    "user_id": "Frank Dauenhauer",
                    "user_href": "/profile/Frank-Dauenhauer"
                },
                {
                    "user_id": "Elisa Perret",
                    "user_href": "/profile/Elisa-Perret-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Lisa Shields",
                "href": "/profile/Lisa-Shields-4"
            },
            "answer_text": "The key word is “fan”. Fan fiction can be an excellent exercise for your skills. But fans also tend to appreciate anything in their particular area of interest. Very very few writers transition from fan fiction to conventional publishing. After 50 Shades of Grey, anyone with a computer fancied themselves a potential novelist. But fans are not always discerning. A young writer I knew thinks he is amazing for writing animorphic fiction. I have read his stuff. Poor would be gracious. It clearly was focused on the fan base, but lacked skill. I did not discourage him. He enjoys what he writes. But neither did I encourage his father to invest 25k in a self publishing project. There are tons of self published writers out there. The possibility of breaking even on this poorly written , badly illustrated series was slim to none. So by all means write. But publishers are not surfing the Net for talent. This is not the droid you seek. My talented daughter also reminds me that fan fiction can be written off a living writer's work. Copyright issues are no way to introduce yourself to publshing. Some writers don't mind. Some will sue you blue. ",
            "date": "Answered December 7, 2016",
            "views": "408",
            "upvotes": " View 8 Upvoters",
            "upvoters": [
                {
                    "user_id": "Shayna Biswas",
                    "user_href": "/profile/Shayna-Biswas"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/Tsu-Dho-Nimh"
                },
                {
                    "user_id": "Lisa Mooc",
                    "user_href": "/profile/Lisa-Mooc"
                },
                {
                    "user_id": "Chase Bivens",
                    "user_href": "/profile/Chase-Bivens-1"
                },
                {
                    "user_id": "Hosea Siu",
                    "user_href": "/profile/Hosea-Siu"
                },
                {
                    "user_id": "Liona Squires",
                    "user_href": "/profile/Liona-Squires"
                }
            ]
        },
        {
            "author_info": {
                "name": "Jackson Davies",
                "href": "/profile/Jackson-Davies-1"
            },
            "answer_text": "Don’t listen to anyone who knocks Fan Fiction. Fan Fiction is a fab place to start. I started there, you can start there. Writing is writing. There are many people who love fan-fiction. You may get the age old argument that some people turn their nose down at fan fiction “because its not real writing” but that is hogwash. It takes skill to continue a story somebody else penned and it is good practice. Technically you are infringing on intellectual property, but often there are many large entertainment companies that encourage a fan base, and allow fan fiction. I started with Star Trek Fan Fiction, my sister with Buffy/Angel Fan Fiction. It’s just like normal writing only you have more of a framework/world to explore, and rules to adhere to. What you do sometimes get with fan-fiction is canon dweebs. Those individuals who like to police Canon. Canon is where you have to conform to established rules and history, otherwise you court scrutiny from turbo-nerds (regular nerds and dweebs wielding twigs because you angered them). Otherwise it is simple. Go out and enjoy! ",
            "date": "Answered October 10, 2018",
            "views": "183",
            "upvotes": " Answer requested by Deborah Ramos",
            "upvoters": [
                {
                    "user_id": "Amanda Belms",
                    "user_href": "/profile/Amanda-Belms"
                },
                {
                    "user_id": "Lycanroc Okami",
                    "user_href": "/profile/Lycanroc-Okami"
                },
                {
                    "user_id": "Elizabeth Zwick",
                    "user_href": "/profile/Elizabeth-Zwick-1"
                },
                {
                    "user_id": "Crystal Maven",
                    "user_href": "/profile/Crystal-Maven-1"
                },
                {
                    "user_id": "Emmanuel Emmanuel",
                    "user_href": "/profile/Emmanuel-Emmanuel-146"
                },
                {
                    "user_id": "Joshua Bus",
                    "user_href": "/profile/Joshua-Bus"
                },
                {
                    "user_id": "Kaviru Gunaratne",
                    "user_href": "/profile/Kaviru-Gunaratne"
                },
                {
                    "user_id": "Desta Star",
                    "user_href": "/profile/Desta-Star"
                },
                {
                    "user_id": "கோஸ்ட் லவர்",
                    "user_href": "/profile/கோஸ்ட்-லவர்"
                },
                {
                    "user_id": "Rickendy Salvant",
                    "user_href": "/profile/Rickendy-Salvant-1"
                },
                {
                    "user_id": "Lynn Sun",
                    "user_href": "/profile/Lynn-Sun-14"
                },
                {
                    "user_id": "Angela Cook",
                    "user_href": "/profile/Angela-Cook-20"
                },
                {
                    "user_id": "Yasef Hossain",
                    "user_href": "/profile/Yasef-Hossain"
                },
                {
                    "user_id": "Ariel Cahn",
                    "user_href": "/profile/Ariel-Cahn"
                },
                {
                    "user_id": "Chase Bivens",
                    "user_href": "/profile/Chase-Bivens-1"
                },
                {
                    "user_id": "Matthew Beasley",
                    "user_href": "/profile/Matthew-Beasley-5"
                },
                {
                    "user_id": "JN",
                    "user_href": "/profile/JN-19"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/Jaida-M-1"
                },
                {
                    "user_id": "Vijay Unnithan",
                    "user_href": "/profile/Vijay-Unnithan"
                },
                {
                    "user_id": "Neil Sarver",
                    "user_href": "/profile/Neil-Sarver"
                }
            ]
        },
        {
            "author_info": {
                "name": "Kate Cosette",
                "href": "/profile/Kate-Cosette"
            },
            "answer_text": "It absolutely does not ruin creativity. I write original stories all the time, and yet I still come back to writing fanfiction. But it’s true. You’re using someone else’s world and characters and writing new stories around them. It is a great start to writing! For one, it’s like you’re almost given an outline of a picture and what you’re doing is coloring it in. It helps you write, especially as a beginner, because you don’t have to worry about creating an original plot, original characters, establishing all those relationships between them, etc. This way, you can practice writing natural dialogue, descriptions, introspection and characterization. And the original plot lines you write as you write fanfiction are still something that you come up with yourself, but, again, you don’t have to worry about filling in a bunch of plot holes. The original writer already did that for you. Also, to be able to stay within that original writer’s voice and style, where anyone can read your fanfic and think it’s the real thing (i.e. your characters’ dialogue sounds exactly how they would talk) that takes a ton of talent too. Honestly, in the TV biz, being a staff writer on a show, they have countless writers who write the scripts, and they make it seem like only one person is writing them. They pretty much get paid to write fanfiction every day haha. (I want to write for TV, so that’s my goal :) ) So, yes! I think it’s an awesome place to start, and I don’t even plan on leaving any time soon haha! ",
            "date": "Answered May 22, 2017",
            "views": "726",
            "upvotes": " View 6 Upvoters",
            "upvoters": [
                {
                    "user_id": "Steph Halloran",
                    "user_href": "/profile/Steph-Halloran"
                },
                {
                    "user_id": "Alina Zhiltsova",
                    "user_href": "/profile/Alina-Zhiltsova"
                },
                {
                    "user_id": "Mike Prinke",
                    "user_href": "/profile/Mike-Prinke"
                }
            ]
        },
        {
            "author_info": {
                "name": "Milton Lastof",
                "href": "/profile/Milton-Lastof"
            },
            "answer_text": "I started writing, strangely enough, by means of Zoids fanfiction. In fact, to this day, 96% (estimated) of my writings are contained in a folder named 'Fanfics', and it's been named that since 2006. (And no, I'm not writing Zoids fanfic anymore; I outgrew Zoids years ago.) Honestly, fanfic gets a bad rap mainly because of Sturgeon's Law. Published fiction has an advantage in that it goes through a fair bit of hoops before it, well, gets published, and thus the crap generally tends not to make it to the presses. (With the occasional exception here and there by various means, of course. Let's not name names; that would be indelicate.) With fanfiction, on the other hand, not only do you have the near-unbounded freedom of the Internet, but at best you've got a beta reader covering your arse before it goes out for all to see - assuming you didn't just write, edit the worst bits away, and then post. I trust I need not illustrate the problems with this. Mind you, again, Sturgeon's Law. Not all fanfic is bad, just a lot of it. But I have read a lot of fanfic that ranges from 'no worse than average' to 'you know, if this wasn't fanfic, you could publish it and make it a bestseller'. Creativity, much like a muscle, must be exercised to be developed. Of course, exercise the wrong way and you end up borking the thing out of shape. Walk with care. ",
            "date": "Answered June 3, 2014",
            "views": "24",
            "upvotes": " View 20 Upvoters",
            "upvoters": [
                {
                    "user_id": "Lycanroc Okami",
                    "user_href": "/profile/Lycanroc-Okami"
                },
                {
                    "user_id": "Kaviru Gunaratne",
                    "user_href": "/profile/Kaviru-Gunaratne"
                },
                {
                    "user_id": "Desta Star",
                    "user_href": "/profile/Desta-Star"
                },
                {
                    "user_id": "Shayna Biswas",
                    "user_href": "/profile/Shayna-Biswas"
                }
            ]
        },
        {
            "author_info": {
                "name": "Von Krieger",
                "href": "/profile/Von-Krieger"
            },
            "answer_text": "Yup! The way you get better at writing is by writing, and your very first writing is going to be bad. Really bad. Lock it in a box and pitch it into a fire bad. Your ideas can be good, even great. There are a few people that still recall the ID I was using to write stuff in my teens that recalled things I wrote becuase they liked the concepts in the stories, but my actual writing then as compared to now was kind of rubbish. And that was stuff I wrote over 20 years ago. I come across things that I’ve written even a handful of years ago that I wince that I could re-write into being much better if I had written them now. Write, write often, just make sure you’re writing SOMETHING. My own writing grew in leaps and bounds by engaging in a form of copetative writing known as “e-fedding,” wherein you play a fictional professional wrestler of your own creation under the “employ” of a fictional wrestling federation. Typically the people in charge of the wrestling federation put the matches together and write the results based off of which side they felt was the winning one according to their own ways of scoring your writings. I wrote somewhere between two and eight thousand words (though on occasion I did more) weekly for about 5–6 years and for the most of that I wasn’t writing fiction at all. When I came back to fiction some years later I found that the quality of my work had improved a great deal, to the point where people would actually pay me to write. And over time this built up more and more to the point where I had to adjust my rates upward to keep from being overwhelmed with commissions. Starting with fan fiction will allow you to get a leg up on writing as opposed to doing so from scratch. You’ll have a framework with characters, characterization, worldbuilding and the like already in place. You’ll also have an in-built passion for your work that is difficult to cultivate in your own works. There will also be an audience in place for your fan works that you can post to get feedback from, as well as drawing eyes to them that would be difficult to achieve with an entirely created work of your own. Though this can also be negative as some fan communities can be filled with mouthy, unrepentant douchecanoes. Fan fiction provides a framework for you to build on that can serve as training wheels for your own works. And in some cases (glaring towards 50 Shades of Grey) you can cross out the names, change a few things, and use your fan work as an original work. I read stuff from several best-selling authors who made their start in fanfiction. There are several writers that I read stuff from who have never done anything BUT fanfiction, as well as several that I read a mix of original works and fanfic from. And there are published authors who I’ve picked up a book from, read, and threw it across the metaphorical room (because I have an e-reader) vowing “Never again!” Though it is comforting to read something that’s published in an actual book and go “Christ, even I’ve got a better plot to therianthropic smut ratio then this, and my characterizations and sex scenes are better and WAAAAY less creepy!” ",
            "date": "Answered October 9, 2018",
            "views": "236",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Timm Wellman",
                "href": "/profile/Timm-Wellman"
            },
            "answer_text": "A fanfiction is an excellent practice tool. Think of it like training wheels: you still have to do the work but you have pre-established plots, characters, settings, etc. to help you along. I think it is also a good form of prompt. The only fanfiction I ever wrote was of the podcast “Welcome to Nightvale” because it had a unique style that was a fun challenge. However, if you use fanfiction as a crutch, it will actually hamper your writing ability. The training wheels are made to come off. If you don't use the pre-established parts properly, you focus too much on what you want to happen and not making an interesting story and end up with a hot mess. In short, fanfiction can be a useful tool, but if you don't seek to move past it, your writing will not improve. ",
            "date": "Answered December 7, 2016",
            "views": "213",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Kenz Huynh",
                    "user_href": "/profile/Kenz-Huynh"
                },
                {
                    "user_id": "Augustus Le",
                    "user_href": "/profile/Augustus-Le"
                },
                {
                    "user_id": "Rachel Baillie",
                    "user_href": "/profile/Rachel-Baillie-1"
                },
                {
                    "user_id": "Aline Jacobs",
                    "user_href": "/profile/Aline-Jacobs-1"
                },
                {
                    "user_id": "Lalie Vleugels",
                    "user_href": "/profile/Lalie-Vleugels"
                },
                {
                    "user_id": "Wesley Vidler",
                    "user_href": "/profile/Wesley-Vidler-1"
                },
                {
                    "user_id": "Shripad Kulkarni",
                    "user_href": "/profile/Shripad-Kulkarni-67"
                },
                {
                    "user_id": "Jessica M. Steele",
                    "user_href": "/profile/Jessica-M-Steele"
                },
                {
                    "user_id": "Josiah Matthews",
                    "user_href": "/profile/Josiah-Matthews-3"
                },
                {
                    "user_id": "Milena Trukhan",
                    "user_href": "/profile/Milena-Trukhan-1"
                },
                {
                    "user_id": "Eliseo Navarro",
                    "user_href": "/profile/Eliseo-Navarro-2"
                },
                {
                    "user_id": "Michael Breen",
                    "user_href": "/profile/Michael-Breen-72"
                },
                {
                    "user_id": "Yasef Hossain",
                    "user_href": "/profile/Yasef-Hossain"
                },
                {
                    "user_id": "Alexander Fortier",
                    "user_href": "/profile/Alexander-Fortier"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/Lancey"
                },
                {
                    "user_id": "Adnan Aftab",
                    "user_href": "/profile/Adnan-Aftab-6"
                },
                {
                    "user_id": "Max Soloff",
                    "user_href": "/profile/Max-Soloff"
                },
                {
                    "user_id": "Kyle Vanderkin",
                    "user_href": "/profile/Kyle-Vanderkin"
                },
                {
                    "user_id": "Sarah Amalie Lerstrøm Margolin",
                    "user_href": "/profile/Sarah-Amalie-Lerstrøm-Margolin"
                },
                {
                    "user_id": "Ankhi Mun",
                    "user_href": "/profile/आखीं-मुन-Ankhi-Mun"
                },
                {
                    "user_id": "Vaan Cotton",
                    "user_href": "/profile/Vaan-Cotton"
                },
                {
                    "user_id": "Allie Peusch",
                    "user_href": "/profile/Allie-Peusch"
                },
                {
                    "user_id": "Miki Souza",
                    "user_href": "/profile/Miki-Souza"
                },
                {
                    "user_id": "Chinyere Victoria Nwankudu",
                    "user_href": "/profile/Chinyere-Victoria-Nwankudu"
                },
                {
                    "user_id": "Ishita Roy",
                    "user_href": "/profile/Ishita-Roy-9"
                },
                {
                    "user_id": "Katie Powers",
                    "user_href": "/profile/Katie-Powers-3"
                },
                {
                    "user_id": "Naina Lohana",
                    "user_href": "/profile/Naina-Lohana"
                },
                {
                    "user_id": "Ameya Dubey (अमेय दुबे)",
                    "user_href": "/profile/Ameya-Dubey-अमेय-दुबे"
                },
                {
                    "user_id": "Zyeni Teloma",
                    "user_href": "/profile/Zyeni-Teloma"
                },
                {
                    "user_id": "Kanupriya Tiwari",
                    "user_href": "/profile/Kanupriya-Tiwari-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Ken Hughes",
                "href": "/profile/Ken-Hughes-10"
            },
            "answer_text": "It could be a good start, if the characters there are what you’re most interested in. Finding your passion is always the key to writing, and spotting an interesting angle in an existing world is a good writing exercise. Plus with fanfiction you have a start at finding readers—both to give you feedback and to build your following. At the same time, it’s different from other writing. Working with existing characters isn’t the full challenge of creating your own. And fanfiction has a distracting pressure that you’re “coloring within the lines” of that known world, and trying to please its fans, compared to the deep responsibility of making something all your own. So I’d say, use fanfiction if you want, but then get practice in more original stories too, and learn to see the difference. (Then again, if your writing goal is to write for TV or comics or other established characters, fanfiction might be just what you need.) ",
            "date": "Answered April 24, 2018",
            "views": "823",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Caryn Green",
                    "user_href": "/profile/Caryn-Green"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/Tsu-Dho-Nimh"
                },
                {
                    "user_id": "Vinessa Shepard",
                    "user_href": "/profile/Vinessa-Shepard"
                },
                {
                    "user_id": "Chase Bivens",
                    "user_href": "/profile/Chase-Bivens-1"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/AskA-1"
                },
                {
                    "user_id": "Catherine Wong-Gerken",
                    "user_href": "/profile/Catherine-Wong-Gerken"
                },
                {
                    "user_id": "Roberto Guzman",
                    "user_href": "/profile/Roberto-Guzman-58"
                },
                {
                    "user_id": "Lisa Santika Onggrid",
                    "user_href": "/profile/Lisa-Santika-Onggrid"
                },
                {
                    "user_id": "Laura Rajsic-Lanier",
                    "user_href": "/profile/Laura-Rajsic-Lanier-1"
                },
                {
                    "user_id": "Vijay Unnithan",
                    "user_href": "/profile/Vijay-Unnithan"
                },
                {
                    "user_id": "Neil Sarver",
                    "user_href": "/profile/Neil-Sarver"
                },
                {
                    "user_id": "Alison Bennett",
                    "user_href": "/profile/Alison-Bennett-6"
                }
            ]
        },
        {
            "author_info": {
                "name": "John Krauss",
                "href": "/profile/John-Krauss-1"
            },
            "answer_text": "I write fanfiction. Mostly Naruto/DBZ fanfiction, so take that with a grain of salt. The thing that I’ve noticed in all my years of reading and writing fanfiction is that the stories with seriously good character development are incredibly hard to come by. And even then I’d be hard pressed to point out one story with good character development. This thing about fanfiction that is both good and bad is that it is always about characters that the author and the readers all know, intimately so. You aren’t reading fanfiction if you are a casual fan. You have most likely read the entire series and are still left with itches that the current series isn’t scratching. So you know the characters, you know their backstory, you know the rules of their world. For an author, this is great because you don’t have to worry too much about explaining these things to your audience. Even when you skip something important, most readers will be able to fill in the blanks themselves since you both are basically playing with the same building blocks. Your fanfiction that you have written is only different in the way that the blocks are arranged. You are basically writing what if stories for your favorite characters. Putting them in different situations, setting them on new adventures, or rewriting the actual story with a few (hopefully) interesting changes. So for an inspiring author, I would say that writing fanfiction is great practice in crafting plots. All the hard creative parts of character development is already done by the author of the actual series. You just need to make them do new things. It also gives you a taste of thinking up stories, arcs, following through with writing, writing action scenes, romance scenes, horror scenes, etc. In my opinion, it does not prepare an author for developing their own characters. It is easier to think of predeveloped characters and imagine what they would do in a situation and how they would react to it. You being a fan would know that intimately and be able to judge if your character did something out of character. When you have your own character, you dictate how they will and will not react to things. If they do anything out of character you need to explain why your character would act this way in a way that makes sense to the reader. Keeping in mind that the reader only knows about this new character as much as you have told them previously in the story. And most importantly, more often than not in a fanfiction, the author’s favorite characters are all Mary Sues that are perfect at everything. It is still annoying in fanfiction when it is overwhelmingly obvious, but OverPowered characters are more tolerated in fanfiction since the readers of said fanfiction are usually major fans of the author’s favorite character too. So write fanfiction if you want a taste of how to write stories. See how well you can keep to a schedule and write through the long boring slougs. But do not look to it to train you on how to develop your own characters. ",
            "date": "Answered February 27, 2017",
            "views": "277",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Chelsea Sanchez",
                "href": "/profile/Chelsea-Sanchez-7"
            },
            "answer_text": "I wrote Doctor Who fanfiction and other miscellaneous fandoms. I started with the ideas of branching out scenarios that Steven Moffat didn’t explore yet. I started with the idea that the 11th and 12th Doctor with Clara was the only ship I could ever want. These were petty ideas, but this boosted my desire and love of English. I was hardly confident in my writing abilities. Looking back at the 2013 era of my writing, I could see at least 10 mistakes in the first paragraph alone. But to that little 11 year old me, I thought that was the greatest thing ever. When people began reading and leaving reviews and kudos/favorites, it made my confidence soar. I developed further into writing and before you know it, I auditioned into my high school to be a Creative Writing major and got in. It’s great to use as a writing tool when you can’t think of anything to write or you just want to write for fun, as most of the foundation like the characters and rough plotline is already there. For example, the audience already knows the Doctor travels to different planets and timezones and often has a companion. This case, it’s Clara. I could write a story about how they go to Rome and see Lucius Caecilius, Peter Capaldi’s other role in Doctor Who before he became the Doctor. I built around the basic premise and this allows my creativity to flow. The only thing is, you shouldn’t rely on fanfiction alone to help you boost your writing abilities. You need to take initiative and write out of your comfort zone and week spots. It won’t ruin creativity and it certainly wouldn’t hurt to try if you want to start writing. Who knows? You might become the next hotshot writer and all it took was starting with fanfiction. ",
            "date": "Answered October 10, 2018",
            "views": "176",
            "upvotes": " Answer requested by Deborah Ramos",
            "upvoters": [
                {
                    "user_id": "Alexandra Cabatbat",
                    "user_href": "/profile/Alexandra-Cabatbat"
                }
            ]
        },
        {
            "author_info": {
                "name": "Franklin Veaux",
                "href": "/profile/Franklin-Veaux"
            },
            "answer_text": "The main issue with fan fiction is you are using someone else’s characters in someone else’s world. Character creation and world building are two of the hardest parts of writing fiction. When you write fanfic, you're skipping some of the hard bits of fiction writing. Reading is a bit like playing Skyrim. Writing with someone else’s characters in someone else’s world is a bit like making mods for Skyrim; writing your own characters in your own world is more like creating Skyrim. Now, if you want to create an engaging video game, it's very helpful to play video games. But modding someone else’s video game doesn't necessarily help you become a game designer, and writing fanfiction doesn't necessarily help you become a great writer. In both cases, modding and fanfic, someone else has done the heavy lifting for you. ",
            "date": "Answered December 12, 2016",
            "views": "2",
            "upvotes": " View 47 Upvoters",
            "upvoters": [
                {
                    "user_id": "Shana Chen",
                    "user_href": "/profile/Shana-Chen-3"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/AskA-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Chris Meadows",
                "href": "/profile/Chris-Meadows"
            },
            "answer_text": "Writing fanfic is a great way to practice writing. Writing is writing, and what's more, a lot of fanfic communities are close-knit enough that you can get reasonably good feedback on what you write and learn what works and what doesn't. It also lets you focus on the mechanics of writing without having to worry about inventing the character and world from scratch. Once you've gotten the mechanics down, then you can worry about that. It takes a lot of writing to get any good at it. You might as well start out with the \"training wheels\" of part of the work done for you. And if you choose one of the settings that is licensed for Amazon's Kindle Worlds fanfic program, you might even produce something you can go on to sell, sooner or later. ",
            "date": "Answered June 3, 2014",
            "views": "11",
            "upvotes": " View 12 Upvoters",
            "upvoters": [
                {
                    "user_id": "Karen Marie Shelton",
                    "user_href": "/profile/Karen-Marie-Shelton"
                }
            ]
        },
        {
            "author_info": {
                "name": "James Johnson",
                "href": "/profile/James-Johnson-187"
            },
            "answer_text": "It’s not so much that it ruins your creativity, as it allows you to skip essential steps you should be taking as a budding writer. When working in fan fix, a writer may reuse characters, plot (in its entirety or in part), character dynamics and relationships, or any other part of the previously established work. All of this is bad not for your creativity, but for your ability to come up with these things yourself. The reason I wouldn’t say that’s the same thing as ‘creativity’ is because I want it to be clear that character, plot, setting, storytelling style, and all the other elements of writing, are each their own separate element of what makes a story. So yeah, avoid fanfic completely, the “this is hard and it’s much easier to start with someone else’s story” approach is the exact opposite of what you need right now as a writer. Oh sure, your character’s, dialogue, plot, and the relationship between those characters will seem boring, dull, and simplistic compared to the thing that originally inspired you to write fan-fic, but you’re going to be a much better writer if you stick with it the “hard” way. ",
            "date": "Answered March 6, 2019",
            "views": "174",
            "upvotes": " Answer requested by Deborah Ramos",
            "upvoters": [
                {
                    "user_id": "Bernard Glassman",
                    "user_href": "/profile/Bernard-Glassman-1"
                },
                {
                    "user_id": "Robert Charles Lee",
                    "user_href": "/profile/Robert-Charles-Lee"
                },
                {
                    "user_id": "Akanksha Singh",
                    "user_href": "/profile/Akanksha-Singh-145"
                },
                {
                    "user_id": "Kosal Tep",
                    "user_href": "/profile/Kosal-Tep"
                }
            ]
        },
        {
            "author_info": {
                "name": "Alex LaMaster",
                "href": "/profile/Alex-LaMaster"
            },
            "answer_text": "Fan fiction is an easy and excellent way to practice writing. characters and worlds are oftentimes already established so you can gain ground focusing on prose, character interactions, understand characters and how they relate to others, and how worlds work and how the characters exist in them. As long as the writing isn't wish fulfilling and thinly written just to achieve short term emotional goals, then I think fan fiction is great exercise. The only bad thing is you will play with other prople’s characters and depend on a plot that isn't your own. There has to be balance between their content and your own. ",
            "date": "Answered December 16, 2016",
            "views": "214",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Vinessa Shepard",
                    "user_href": "/profile/Vinessa-Shepard"
                },
                {
                    "user_id": "Larry Dixon",
                    "user_href": "/profile/Larry-Dixon-1"
                },
                {
                    "user_id": "Vijay Unnithan",
                    "user_href": "/profile/Vijay-Unnithan"
                }
            ]
        },
        {
            "author_info": {
                "name": "Crimson Blaziera",
                "href": "/profile/Crimson-Blaziera"
            },
            "answer_text": "That's the thing. It's a nice way to practice writing, but then you bump into a pothole where you suddenly can't come up with your own ideas. Fanfiction is good in many ways, especially when wanting to work out writing skills. It's true that it can block creativity for original ideas. If you've read Fangirl by Rainbow Rowell, you'll see that the main character has trouble writing original stories for a college writing class since all she ever did was write fanfiction. Bottom of line: there's two sides to the coin, good and bad. On the bright side, a writer can balance their types of writing. ",
            "date": "Answered March 18, 2015",
            "views": "332",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Lisa Santika Onggrid",
                "href": "/profile/Lisa-Santika-Onggrid"
            },
            "answer_text": "Writing fanfiction actually gets you to practice consistency, to stick on a known character sets and settings. Any random story with a published character's name slapped on is not worthy to be called fanfiction IMHO. In fanfiction, you pick apart worlds and persons from many different perspectives while keeping them easy to recognize for anyone familiar to the actual source. Believe me, it is not easy. I've seen heaps and heaps of junks, but also dozens of gems in this world. Yes, it is a good step for beginner and a nice practice for everyone, not to mention a fun activity for lovers of any particular title. Writing requires practice. Even a fanfiction writer IS a writer, I daresay. It only ruins one's creativity if one becomes afraid to create things on their own and stays too long in someone else's shadow. ",
            "date": "Answered September 16, 2014",
            "views": "525",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Laura De los Santos",
                    "user_href": "/profile/Laura-De-los-Santos-2"
                },
                {
                    "user_id": "Vinessa Shepard",
                    "user_href": "/profile/Vinessa-Shepard"
                },
                {
                    "user_id": "Ariel Cahn",
                    "user_href": "/profile/Ariel-Cahn"
                },
                {
                    "user_id": "Chase Bivens",
                    "user_href": "/profile/Chase-Bivens-1"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/AskA-1"
                },
                {
                    "user_id": "Laura Rajsic-Lanier",
                    "user_href": "/profile/Laura-Rajsic-Lanier-1"
                },
                {
                    "user_id": "Alison Bennett",
                    "user_href": "/profile/Alison-Bennett-6"
                }
            ]
        },
        {
            "author_info": {
                "name": "Karen Cole",
                "href": "/profile/Karen-Cole-4"
            },
            "answer_text": " Well, I got published in a prestigious English (British or UK) literary magazine. Called Twisted Tongue. The lead story in the Winter issue (forgotten the year) was mine. A Most Genre-ous Offer. It was fanfiction about “Batman” and the Twilight Zone. Starring Bateman (an ordinary Jew, but not really) and Rod Sterling. You do that, nobody can sue you. Nobody. I was incredibly creative and found myself right there with Bateman. Nowadays I’m one of the most famous underground ghosts available online. If you have any questions about how to learn to ghostwrite, or to learn how to ghostwrite, or how to become a book ghostwriter try me below: Karen S. Cole Ghost Writer, Inc. (formerly Rainbow Writing, Inc.) Contact Ghostwriter | GHOST WRITER, INC. | Karen S. Cole ",
            "date": "Answered October 10, 2018",
            "views": "221",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Terri Geer",
                    "user_href": "/profile/Terri-Geer"
                }
            ]
        },
        {
            "author_info": {
                "name": "Chase Bivens",
                "href": "/profile/Chase-Bivens-1"
            },
            "answer_text": "It can be. It can also be a good way to better your writing abilities as a whole (grammar, spelling, paragraphing, etc). Characterization, new plots, character interactions, etc, can all come from practice writing fanfiction. Other things you learn are proofreading and deciding if something that you wrote earlier really belongs in the story, or if it stays in character. And, if you choose to use them, beta readers are essentially editors (though the real ones can be pretty hardcore), in that they look over your story, find and correct little mistakes (like misspellings), and point to something that you yourself may have overlooked. ",
            "date": "Answered April 24, 2018",
            "views": "203",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Rachel Ross",
                "href": "/profile/Rachel-Ross-264"
            },
            "answer_text": "I’ve been writing stories since I was able to, no joke. Some of my earliest pieces of work were done at around aged 5. And I’ve been writing fanfiction since I was 11. I’m now 18. Between the ages of 5 and 11, I wrote stories all day, every day. My fingers were calloused because of how often I held the pen - but, on NYE 2013, I discovered fanfiction. Wattpad. ArchiveOfOurOwn. Since that day, I have not written a single piece of original fiction which is longer than a page. I am physically unable to. I start writing something original and either get bored, lose inspiration, or just forget about it. Fanfiction is good for honing your skills and getting your writing out there, but it ruins your creativity for original stuff - but some of my fanfiction have had upwards of 100K reads, so it can’t be that bad, right? ",
            "date": "Answered June 20, 2020",
            "views": "27",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Stan Hayward",
                "href": "/profile/Stan-Hayward-1"
            },
            "answer_text": "A good writer is one who appeals to the market they write for Here is an example of ‘Good writing’  Yes, the Mr Men books for under fives. How did they start? Once upon a time a father was telling his son a bedtime storyand the story involved someone (or something) being tickledand his son said“What does a tickle look like?” From that question, the father became a multi-millionaire A good writer understands what interests peopleThey make it sound simple and sincereeven to the point of being obviousand anyone can do it You will not find such ideas taught on writing coursesNor will the books be analyzed by the Criticsbut such books and ideas are the basis of Western culturewhere all things eventually resolve to their simplest formwhich, of course, is the what the Artist and Scientist have as their greatest ambition ",
            "date": "Answered December 8, 2016",
            "views": "408",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Laura Mitchell",
                    "user_href": "/profile/Laura-Mitchell-5"
                }
            ]
        },
        {
            "author_info": {
                "name": "Chris Jeffords",
                "href": "/profile/Chris-Jeffords"
            },
            "answer_text": "Short answer: The incredibly prolific Mercedes Lackey started out writing FF.  Look her up on Fantastic Fiction and see what she's turned out since she became a Feelthy Pro.  Yes.  FF is a great launch if you use it right.  You have an established universe and characters to work from, yet you can create original plots within that universe, or add new characters for the canonical ones to interact with.  Or you can look at some aspect of a canonical character (a CC, for short) and try to explain it by making up a backstory. ",
            "date": "Answered June 4, 2014",
            "views": "795",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/Tsu-Dho-Nimh"
                },
                {
                    "user_id": "Fathimah Lukman",
                    "user_href": "/profile/Fathimah-Lukman"
                },
                {
                    "user_id": "Edward Conway",
                    "user_href": "/profile/Edward-Conway"
                }
            ]
        },
        {
            "author_info": {
                "name": "Charles Phipps",
                "href": "/profile/Charles-Phipps-7"
            },
            "answer_text": "It is. The best part, for me at least, is that you have instant worldwide feedback on your work, assuming you publish each chapter as you finish. I have found that doing so has also helped my creativity. If you make a mistake in an already published chapter, you have to figure a way out of the hole you’ve dug for yourself instead of just rewriting things to make your story work out as planned. I tend to blame my main character for messing up when it’s really my fault. ",
            "date": "Answered October 9, 2018",
            "views": "44",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Grace Swaim",
                "href": "/profile/Grace-Swaim"
            },
            "answer_text": "I wrote a whole paper on this once. Yes. Fanfiction is a way to polish your skills, get instant criticism, and give you a sense of popularity that can inspire you to write more. There are lower boundaries, you can write whatever you want, since you are anonymous, and you are spared the burden of coming up with the entire setting. Fanfiction is a wonderful tool for aspiring writers of original fiction. Use it! ",
            "date": "Answered August 7, 2014",
            "views": "598",
            "upvotes": " View 7 Upvoters",
            "upvoters": [
                {
                    "user_id": "Anne Car",
                    "user_href": "/profile/Anne-Car"
                }
            ]
        },
        {
            "author_info": {
                "name": "Cindy Ris",
                "href": "/profile/Cindy-Ris-1"
            },
            "answer_text": "Why would you think that writing fanfiction would ruin creativity? Would writing short stories in high school ruin creativity? Would writing essays in college ruin creativity? Writing fanfiction gives the author the opportunity to plan, develop, and create a story. For some it inspires creativity and for others it offers writing practice. I have read some absolutely professional writing from some fanfiction authors while I have found some to be barely literate. The other fanfiction writers fit in just between the best and the worst. Fanfiction is a creative outlet. ",
            "date": "Answered April 7, 2019",
            "views": "49",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Anna Vale",
                    "user_href": "/profile/Anna-Vale-2"
                }
            ]
        },
        {
            "author_info": {
                "name": "Joel Ruggaber",
                "href": "/profile/Joel-Ruggaber"
            },
            "answer_text": "There are many authors who got their start this way. The highly prolific Mercedes Lackey for one: she is a firm believer in the “million words” theory: everybody has to write a million words of crap before they can write something good, so fanfic is a great way to start whittling away at that. ",
            "date": "Answered October 9, 2018",
            "views": "111",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Jonathan Chiu",
                    "user_href": "/profile/Jonathan-Chiu-27"
                }
            ]
        },
        {
            "author_info": {
                "name": "C.S. Friedman",
                "href": "/profile/C-S-Friedman"
            },
            "answer_text": "It is a good step only in that it gives you practice writing. Writing original material would provide the same benefit. It does not ruin or increase creativity. It is simply something you do because you enjoy doing it. ",
            "date": "Answered August 1, 2016",
            "views": "425",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Rich Mayer",
                    "user_href": "/profile/Rich-Mayer-4"
                }
            ]
        },
        {
            "author_info": {
                "name": "Catherine Cone",
                "href": "/profile/Catherine-Cone-2"
            },
            "answer_text": "I think it can certainly help you. You can practice some elements of writing without having to worry about others, but it’s up to you. If for some reason you would rather practice with original fiction go ahead. If you want to write both go ahead. There’s no wrong answer. ",
            "date": "Answered January 2, 2019",
            "views": "21",
            "upvotes": " Answer requested by Deborah Ramos"
        },
        {
            "author_info": {
                "name": "Mugdha Mohan",
                "href": "/profile/Mugdha-Mohan"
            },
            "answer_text": "I have read some of the most appetising works written as fan-fiction. Some of them have surpassed their original inspiration. If you have an idea and can incorporate an existing plot, do go ahead with it. Afterall DC and Marvel work, especially Batman/Spiderman/Superman have been weaving a single tale since decades. ",
            "date": "Answered July 11, 2014",
            "views": "336",
            "upvotes": " View 1 Upvoter"
        },
        {
            "author_info": {
                "name": "Lewis Little",
                "href": "/profile/Lewis-Little-1"
            },
            "answer_text": "It is. It’s a great way to learn because for the most part, the world-building and characterisation is already done for you, so you only need focus on plot and narrative. Once you have those skills sufficiently developed, you can move on to creating characters and worlds for your own original fiction. Everything you write is practise. ",
            "date": "Answered October 9, 2018",
            "views": "135",
            "upvotes": " View 1 Upvoter"
        },
        {
            "author_info": {
                "name": "Mendel Cooper",
                "href": "/profile/Mendel-Cooper"
            },
            "answer_text": "Go ahead and write fan fiction. It develops your skills. I've done it myself.Historical Fiction Bohlen, R. Sidley: Dave Dawson Over Berlin (Installment I). v1 25 Nov 2012 But, stay away from A Game of Thrones.George RR Martin: “Fuck Your Fan Fiction” ",
            "date": "Answered June 3, 2014",
            "views": "351",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Phyllis Stewart",
                "href": "/profile/Phyllis-Stewart-2"
            },
            "answer_text": "If you don't have the imagination to create your own characters, you aren't ready to be a writer. Welcome to the hard part. The writing itself is easy. ",
            "date": "Answered October 9, 2018",
            "views": "11",
            "upvotes": " View 1 Upvoter"
        },
        {
            "author_info": {
                "name": "Susan Smith",
                "href": "/profile/Susan-Smith-53"
            },
            "answer_text": "As others have said, fan fiction is great practise, great for receiving instant feedback and a joy to write. I use it to test all the things you’re not supposed to do in fiction. I use it to try out ideas and just for a fun activity without pressure. Enjoy it. ",
            "date": "Answered October 10, 2018",
            "views": "39",
            "upvotes": " View 1 Upvoter"
        },
        {
            "author_info": {
                "name": "Vina Andrea",
                "href": "/profile/Vina-Andrea"
            },
            "answer_text": "Well, Fifty Shades of Grey was initially a fan fiction to Twilight series and now it will have its own movie. ",
            "date": "Answered June 2, 2014",
            "views": "188",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Dean Howard",
                "href": "/profile/Dean-Howard-7"
            },
            "answer_text": "Yes. ",
            "date": "Answered December 24, 2016",
            "views": "13",
            "upvotes": "0"
        }
    ]
}