{
    "title": "ISKCON say we go back to God only if we follow them, is it true? - Quora",
    "tags": [
        "Śrī Krishna",
        "Theology",
        "God",
        "Religion"
    ],
    "response": [
        {
            "author_info": {
                "name": "Murari Das",
                "href": "/profile/Murari-Das-1"
            },
            "answer_text": "Iskcon doesn’t say this. People who are envious of Iskcon’s success and are demoralized by their own insignificance say that Iskcon says this, but they are wrong. There may be one or two new and enthusiastic bhaktas who imply this, but it is not part of Iskcon’s doctrine and philosophy. That takes a little time and trouble to investigate so the less intelligent tend to skip that and create their own version of what Iskcon says. The first point in Iskcon’s mission statement, drawn up by Srila Prabhupada reads: (1) To systematically propagate spiritual knowledge to society at large and to educate all peoples in the techniques of spiritual life in order to check the imbalance of values in life and to achieve real unity and peace in the world. There is nothing exclusive in this, and no indication that only Iskcon members are ‘the chosen ones’ and everyone else is damned. Iskcon is spreading awareness of our relationship with God through the chanting of God's holy name. Prabhupada's message transcends all material designations of religion and nationality. Srila Prabhupada would say that if one is a Christian or Muslim one should be a good Christian or Muslim and faithfully follow the instructions. If you are dissatisfied as an atheist, Christian, Muslim, Jew, or any other religion then take up Krishna consciousness. It’s a very potent process for those who want to know and love God. Some of the people who misrepresent Iskcon know they are wrong but deliberately lie in an effort to caste Iskcon in a bad light because they don’t want Iskcon to prosper and expand. They want Iskcon to wither and die. They take great glee in any problems that Iskcon faces as a society, and gloat over any difficulties its individual members have to overcome. This is not the mentality of a happy person. It’s the way frustrated, bitter people think. For all those wishing Iskcon would fade away like the hippie movement which gave rise to some of its first members here’s a fun fact. On average, all across the world, every three seconds a person buys or receives a piece of Iskcon literature. That doesn’t include any content online which runs to hundreds of thousands of views per month. There’s no indication that is going to slow down. Here’s an excerpt from a room conversation with Srila Prabhupada on June 10, 1976, Los Angeles Richard: What would you classify, ah, other works, say, the Koran or the Bible or any other religious... Prabhupada: Well they are also aiming to this aim of life. Richard: They are in the same aim. Prabhupada: Yes. Yes. Richard: But do you think they are successful? Prabhupada: They are successful if they follow the education. Just like Christ, he's speaking of kingdom of God. So if you follow Christ, there is hope that you go to kingdom of God. But if you don't follow, you simply rubberstamp, \"I am Christian,\" then it is useless. Richard: But there are other...? Prabhupada: Yes, they are of the same type. Richard: Yes, but do they have any value as far as you are concerned? Prabhupada: Oh, yes, they have value. Richard: Okay, that's what I was trying to get at. Prabhupada: There is value. Richard: The goal of Christianity is to make a better life here on earth for the followers of Christ and after death. Prabhupada: That's nice. That is our preaching also. Richard: That's your goal also. Okay... Prabhupada: Just like a student is being trained up in medical college, and when he becomes practitioner, the same thing. There is no change. There is no change. Richard: Yes, I think you are talking about specific... Prabhupada: No, no, this is.... Take Christian religion. So going to the church, it is practicing how to establish relationship with Christ and God. So after death, if he's perfect, he goes back to home, back to Godhead. Room Conversation -- June 10, 1976, Los Angeles ",
            "date": "Answered February 18, 2020",
            "views": "410",
            "upvotes": " View 30 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Steve Paul",
                    "user_href": "/profile/Steve-Paul-115"
                },
                {
                    "user_id": "Gaurav Oberoi",
                    "user_href": "/profile/Gaurav-Oberoi-11"
                },
                {
                    "user_id": "Irene Romero",
                    "user_href": "/profile/Irene-Romero-36"
                },
                {
                    "user_id": "Keerthi Raj",
                    "user_href": "/profile/Keerthi-Raj-30"
                },
                {
                    "user_id": "Vinay Mehta",
                    "user_href": "/profile/Vinay-Mehta-139"
                },
                {
                    "user_id": "Indrasen Chauhan",
                    "user_href": "/profile/Indrasen-Chauhan-1"
                },
                {
                    "user_id": "Joy Das",
                    "user_href": "/profile/Joy-Das-309"
                },
                {
                    "user_id": "Shravya Kanchi",
                    "user_href": "/profile/Shravya-Kanchi"
                },
                {
                    "user_id": "Aditi Pandey (अदिति पाण्डेय)",
                    "user_href": "/profile/Aditi-Pandey-अदिति-पाण्डेय"
                },
                {
                    "user_id": "Arya Ajay",
                    "user_href": "/profile/Arya-Ajay-25"
                }
            ]
        },
        {
            "author_info": {
                "name": "Sreedar Raju",
                "href": "/profile/Sreedar-Raju-1"
            },
            "answer_text": "No, There is no such claim. ISKCON respects all other sampradayas. This is a faulty understanding on part of many that there is a “Only ISKCON” theory that exists. No such theory exists, neither does Srila Prabhupada claim such things. There are so many God realized souls in the world. In fact when Srila Prabhupad took His disciples to the Kumbh Mela the first time, the disciples asked “Who is original and real and who is fake” - to this Srila Prabhupada answered “Assume everyone is real” And hence respect them as such. Also, there are so many babaji’s in Holy places like Vrindavana, Badrikashrama and Jagannath Puri who are truly realized - these are recognized by our Gurus, and the message passed is “Disrespect no one”. Also the concept of “Disrespect to Devas” propagated by people is also not correct. Many Many places Srila Prabhupada has pointed out that the demigods are representatives of the Supreme Lord, never disrespect them. Also in SB 1.2 Srila Prabhupada points out Lord Shiva is the form of the Supreme Lord, so be very careful while talking about Lord Shiva, and be very very respectful towards Him. He is one of the 12 Mahajanas. If you cant respect a Mahajana, how can anyone expect any respect and kindness for other ordinary living entities?? Kindness and respect has to be the nature of a Vaishnava. only then one can make progress. Also Non judgmental mentality and aversion to faultfinding. Without these quality, how can anyone make progress in spirituality?? Do not listen to people. People can read anything from a written word. There are people who will misinterpret and take offense, no one can help them. You have to read for yourself, make a careful conclusions after due considerations. Hare Krishna! Sutra Malika Dasa. ",
            "date": "Answered February 17, 2020",
            "views": "48",
            "upvotes": " View 6 Upvoters",
            "upvoters": [
                {
                    "user_id": "Kamesh Krishnan",
                    "user_href": "/profile/Kamesh-Krishnan-3"
                },
                {
                    "user_id": "Steve Paul",
                    "user_href": "/profile/Steve-Paul-115"
                },
                {
                    "user_id": "Vaishnava Charana Dasa",
                    "user_href": "/profile/Vaishnava-Charana-Dasa"
                },
                {
                    "user_id": "Murari Das",
                    "user_href": "/profile/Murari-Das-1"
                },
                {
                    "user_id": "Ganapati Govind Das",
                    "user_href": "/profile/Ganapati-Govind-Das"
                },
                {
                    "user_id": "Adrienne Wingfield",
                    "user_href": "/profile/Adrienne-Wingfield-1"
                }
            ]
        }
    ]
}