{
    "title": "It's reported that this pandemic could last for 10 years - is this true? - Quora",
    "tags": [
        "Anemia",
        "Doctors"
    ],
    "response": [
        {
            "author_info": {
                "name": "Axel Carlson",
                "href": "/profile/Axel-Carlson-2"
            },
            "answer_text": "Hi and thanks for asking for my answer. Personal observation: I don’t follow closely what the worldwide Pandemic situation is or will be anytime soon regards covid19 However the corona epidemic in america is beginning to wain in several areas. And everyone will be back to work in less than ten months. Best guess. And I’ll give even odds to no more than six months. I didn’t say it would be gone. AIDS isn’t gone MRSA isn’t gone Alzheimer's isn’t gone Pancreatic cancer isn’t gone Heart disease isn’t gone But we go on. And don’t forget, an almost identical flu like illness that was just as deadly called SARS-CoV-1 isn’t much of a thing anymore in because it’s just gone, worldwide. Of course at the moment there is the sequel to get past: “Son of SARS-CoV-1” (alias SARS-CoV-2, alias covid-19, alias novel corona virus, etc) ",
            "date": "Answered August 8, 2020",
            "views": "229",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Michele Jones",
                    "user_href": "/profile/Michele-Jones-196"
                }
            ]
        },
        {
            "author_info": {
                "name": "Noelle Bridgman-Wile",
                "href": "/profile/Noelle-Bridgman-Wile"
            },
            "answer_text": "The pandemic definitely will not. But the virus will last indefinitely - just like all the colds and flus we already have in regular circulation. Even without a vaccine, SARS-coV-2 may eventually run out of victims. And, with luck, it will evolve into a less mortal and fatal version. The “survival of the fittest” applies to viruses as well as every living thing: some mutations adapt better to an environment than others, and those adapted version survive better. Let’s cross our fingers and be hopeful that, once it’s circulated through most of the population (or we have a vaccine), a mutation that is less virulent wins the evolutionary lottery. Our adaptive immune response to coronaviruses are against us (immunity to them usually lasts 3mos.-1yr.), but nature may give us a boost. At the very least, it buys us time to develop a vaccine that we can adjust when a nastier mutation appears again. ",
            "date": "Answered August 8, 2020",
            "views": "439",
            "upvotes": " View 5 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Ashutosh Jha",
                    "user_href": "/profile/Ashutosh-Jha-783"
                },
                {
                    "user_id": "Michele Jones",
                    "user_href": "/profile/Michele-Jones-196"
                },
                {
                    "user_id": "Vijay Venkataraman",
                    "user_href": "/profile/Vijay-Venkataraman-1"
                },
                {
                    "user_id": "James Patrick Kerry",
                    "user_href": "/profile/James-Patrick-Kerry"
                },
                {
                    "user_id": "James Winter",
                    "user_href": "/profile/James-Winter-12"
                }
            ]
        },
        {
            "author_info": {
                "name": "Steven L. Gaudry",
                "href": "/profile/Steven-L-Gaudry"
            },
            "answer_text": "I have NOT heard that, but this is a certified fact: Study this chart from 102 years ago:  Can you see the exact repeating pattern, right down to the month? Another REALISTIC concern is that it is here to stay forever, like the common cold, seasonal flu, or as smallpox was for several thousand years. As it is a NOVEL virus with unknown perimeters, it IS possible, yet.  ",
            "date": "Answered August 8, 2020",
            "views": "791",
            "upvotes": " View 5 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Milly Stuchinski",
                    "user_href": "/profile/Milly-Stuchinski"
                },
                {
                    "user_id": "Robert Harvey",
                    "user_href": "/profile/Robert-Harvey-41"
                },
                {
                    "user_id": "Shane Wanninger",
                    "user_href": "/profile/Shane-Wanninger"
                },
                {
                    "user_id": "Criuth Rorschach",
                    "user_href": "/profile/Criuth-Rorschach"
                },
                {
                    "user_id": "James Winter",
                    "user_href": "/profile/James-Winter-12"
                }
            ]
        },
        {
            "author_info": {
                "name": "Kelli Shomaker",
                "href": "/profile/Kelli-Shomaker"
            },
            "answer_text": "I highly doubt that it will last 10 years. Will the virus be around for 10 more years? That is a distinct possibility. There are people out there that just because they can get their opinion and theories out…. they present it as factual. Attention seekers…. Fear mongering… rebels… there are all types. Opinion is stated as opinion. Theories as theories. Facts as facts. People need to know where a person is coming from so they can use their own judgement…. not someone else's. It's a pet peeve. ",
            "date": "Answered August 9, 2020",
            "views": "140",
            "upvotes": " Answer requested by James Winter",
            "upvoters": [
                {
                    "user_id": "James Winter",
                    "user_href": "/profile/James-Winter-12"
                }
            ]
        },
        {
            "author_info": {
                "name": "Richard Greco",
                "href": "/profile/Richard-Greco-3"
            },
            "answer_text": "I think that, as a pandemic, the problem will settle down well before 10 years is over but the virus will still be with us at that time. We should, by then, have a vaccine or two that we can use and there should be some specific medication that would help alleviate the disease making it less severe. ",
            "date": "Answered August 8, 2020",
            "views": "187",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "David Conroy",
                    "user_href": "/profile/David-Conroy-4"
                },
                {
                    "user_id": "James Winter",
                    "user_href": "/profile/James-Winter-12"
                }
            ]
        },
        {
            "author_info": {
                "name": "Walter A Duda",
                "href": "/profile/Walter-A-Duda"
            },
            "answer_text": "I don’t know about the pandemic but there is the possibility this virus will be around forever like the flu requiring annual shots to keep up as it mutates. The sooner everyone begins to adhere to the rules setdown by the CDC and WHO., not polticians with an agenda, the sooner we will get this under control. ",
            "date": "Answered August 8, 2020",
            "views": "203",
            "upvotes": " View 2 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Joakim Berg",
                    "user_href": "/profile/Joakim-Berg-1"
                },
                {
                    "user_id": "Margery Caroline Whittle",
                    "user_href": "/profile/Margery-Caroline-Whittle"
                },
                {
                    "user_id": "Sean Hitchcock",
                    "user_href": "/profile/Sean-Hitchcock"
                },
                {
                    "user_id": "Robert Harvey",
                    "user_href": "/profile/Robert-Harvey-41"
                },
                {
                    "user_id": "Andrew O'Donnell",
                    "user_href": "/profile/Andrew-ODonnell-48"
                },
                {
                    "user_id": "Linda Eekhof",
                    "user_href": "/profile/Linda-Eekhof"
                },
                {
                    "user_id": "James Winter",
                    "user_href": "/profile/James-Winter-12"
                }
            ]
        },
        {
            "author_info": {
                "name": "Bernard Peek",
                "href": "/profile/Bernard-Peek"
            },
            "answer_text": "It could. It will end when 60–70% of the population in every country is immune either because of infection or vaccination. The virus will still be around and there will be occasional outbreaks, primarily where vaccination levels are low. ",
            "date": "Answered August 14, 2020",
            "views": "11",
            "upvotes": " View 7 Upvoters ",
            "upvoters": [
                {
                    "user_id": "James Winter",
                    "user_href": "/profile/James-Winter-12"
                }
            ]
        },
        {
            "author_info": {
                "name": "Sharon Coburn",
                "href": "/profile/Sharon-Coburn-4"
            },
            "answer_text": "Not full blast. And it just means ppl will have to get yet another vaccine. Might as well get used to it. More then 10 years ago the doctors and scientists said global warming was gonna cause the birth of a lot of new bugs and illnesses. Well, they r here. Covid, ““murder bees” - what’s next? I hate bugs. ",
            "date": "Answered August 8, 2020",
            "views": "181",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Simon Lee",
                    "user_href": "/profile/Simon-Lee-259"
                }
            ]
        },
        {
            "author_info": {
                "name": "Joel Cornfield",
                "href": "/profile/Joel-Cornfield"
            },
            "answer_text": "Most likely this organism isn’t going to go away and we will have to learn accommodate to its existence once the initial explosion is over. I suspect a vaccine will require yearly boosters and there will always be certain populations that will be more at risk from severe infections than other, but all of this remains to be seen. ",
            "date": "Answered August 9, 2020",
            "views": "83",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "James Winter",
                    "user_href": "/profile/James-Winter-12"
                },
                {
                    "user_id": "Michele Jones",
                    "user_href": "/profile/Michele-Jones-196"
                }
            ]
        },
        {
            "author_info": {
                "name": "Dick Stockley",
                "href": "/profile/Dick-Stockley"
            },
            "answer_text": "No. It will be endemic for ever it can’t go away. It will no longer be a pandemic when numbers decline to insignificant and community transmission has ceased in a majority of the world. It is already over in about 80 countries but enough of the richer countries still have enough cases to make WHO call it “pandemic”. ",
            "date": "Answered August 9, 2020",
            "views": "284",
            "upvotes": " Answer requested by James Winter",
            "upvoters": [
                {
                    "user_id": "Elle Hayes",
                    "user_href": "/profile/Elle-Hayes-2"
                },
                {
                    "user_id": "Melissa Hoy",
                    "user_href": "/profile/Melissa-Hoy-2"
                },
                {
                    "user_id": "Julie McNamee",
                    "user_href": "/profile/Julie-McNamee-2"
                }
            ]
        },
        {
            "author_info": {
                "name": "Robert Mucci",
                "href": "/profile/Robert-Mucci-1"
            },
            "answer_text": "They dont believe it will go away but that we will have to learn to live with it like we have with HIV and the flu. Thats if no real vaccine can be produced. It is said that if 10 vaccines are produced one has a 90% chance of beginning effective . But we must just pray for better results . They believe that in general that it will slow down a lot by July next year. ",
            "date": "Answered August 8, 2020",
            "views": "287",
            "upvotes": " View 2 Upvoters ",
            "upvoters": [
                {
                    "user_id": "James Winter",
                    "user_href": "/profile/James-Winter-12"
                }
            ]
        },
        {
            "author_info": {
                "name": "John Buginas",
                "href": "/profile/John-Buginas"
            },
            "answer_text": "Where is it reported? Add link to your question The virus will last forever. The virus may run out of steam due to social distancing or acciones. It will pop up now and then for many years, there will be flare ups. ",
            "date": "Answered August 8, 2020",
            "views": "179",
            "upvotes": " View 3 Upvoters"
        },
        {
            "author_info": {
                "name": "Joel Goldberg",
                "href": "/profile/Joel-Goldberg-21"
            },
            "answer_text": "No, but COVID-19 will be back in some form at some point. Remember that there will be more than one effective vaccine . ",
            "date": "Answered August 11, 2020",
            "views": "28",
            "upvotes": " View 1 Upvoter "
        }
    ]
}