{
    "title": "Malcom Gladwell explains the 10,000-hour rule in his book Outliers. Does this mean that I can choose anything in the world and become an expert at it if I practice for 10,000 hours? - Quora",
    "tags": [
        "Outliers (2008 book)",
        "10,000 Hours Rule",
        "Malcolm Gladwell (author)",
        "Learning New Things",
        "Learning"
    ],
    "response": [
        {
            "author_info": {
                "name": "Istvan Geza Juhasz",
                "href": "/profile/Istvan-Geza-Juhasz"
            },
            "answer_text": "I already answered a few versions of this question. Here’s a fragment where I quoted Malcolm Gladwell: Ten thousand is just a random number that someone attached to that “rule” because it sounded good. Now he regrets it. Malcolm Gladwell, the guy who is usually blamed for “inventing” the “rule”, (see Robert Frost’s answer) writes: “(…) practice isn't a SUFFICIENT condition for success. I could play chess for 100 years and I'll never be a grandmaster. The point is simply that natural ability requires a huge investment of time in order to be made manifest. Unfortunately, sometimes complex ideas get oversimplified in translation.” My translation: a monkey hitting random keys on a keyboard for 10,000 hours will be still a monkey hitting random keys on a keyboard. Only older. For more, see: my answer to How was the 10,000 hour rule of mastery finally exposed as an urban myth? my answer to Is there any way how to shorten 10000 hour rule by deliberate practice? my answer to Is the 10,000 hours rule works for all fields, if not, can you provide an example? my answer to If I practice piano for 10,000 hours, will that actually make me an \"expert\" pianist? Read about the failure of “the Dan Plan” here: The Average Guy Who Spent 6,003 Hours Trying to Be a Professional Golfer. At about halfway through his 10,000 hours plan he was almost there, but he tried to overshoot his goal, exaggerated a bit his training, and his back gave up. Some people will make the perfect omelette or scrambled eggs on their first attempt; others won’t make it in a lifetime. Read those answers, look around on my profile page, google the “rule”, maybe you’ll understand why I consider it a dangerous myth. ",
            "date": "Updated June 7, 2019",
            "views": "101",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Elsa Kristian",
                    "user_href": "/profile/Elsa-Kristian"
                }
            ]
        },
        {
            "author_info": {
                "name": "Joshua Dawes",
                "href": "/profile/Joshua-Dawes"
            },
            "answer_text": "In theory, yes, but not just any 10,000 hours will do. You need to make sure you are challenging yourself and improving the whole time - more experience doesn’t necessarily equal better. How Developers Stop Learning: Rise of the Expert Beginner This article is an example from software development - a discussion of what leads people to stop progressing, no matter how many hours they put in. ",
            "date": "Answered April 16, 2019",
            "views": "29",
            "upvotes": "0"
        }
    ]
}