{
    "title": "My boyfriend is in Air Force BMT, how often can he write letters? - Quora",
    "tags": [
        "U.S. Air Force",
        "Air Forces",
        "Boyfriends",
        "Military"
    ],
    "response": [
        {
            "author_info": {
                "name": "Reggie Harrell",
                "href": "/profile/Reggie-Harrell"
            },
            "answer_text": "When I served, there was not a set number of letters that could be sent, but limited time in which to do so, and only in the later weeks of training. Most of his time is going to be spent studying, getting his bunk, locker, and uniforms (even underwear and t-shirts) ready for inspections, practicing for inspections, marching drills, exercising (PT), cleaning things, etc. What little time he does have when he’s not being told what to do, he may be taking the time to rest, and reading the letters you’re sending every single day. I can tell you that getting a lot of mail, or getting unauthorized packages will bring unwanted attention to him. My then fiance sent me a huge box stuffed with snacks— entire boxes of little debbies, Apple Newtons, AirHeads, some pictures of her, and a pair of her perfumed panties in a ziploc baggy. Fortunately, I was able to hide that last item before the T. I. came into the room. Nevertheless, I got fussed at, and the T.I. said I had 5 mins to go downstairs and eat as much as I could in those 5 mins and throw the rest away. Also, much to my squad mates’ dismay, I wasn’t allowed to take anyone with me to share the load and prevent so much food going to waste. So I would say, don't expect too much in the way of receiving letters, but appreciate whatever you get, and please do not send excessive mail or any other packages to him. He will not want to be on his instructor's radar because of that, and he also has to keep his locker inspection-ready, and that will become increasingly difficult to do if you send him lots of mail. ",
            "date": "Updated February 6, 2018",
            "views": "38",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Floyd Frazier",
                    "user_href": "/profile/Floyd-Frazier-4"
                },
                {
                    "user_id": "Brigid Totten",
                    "user_href": "/profile/Brigid-Totten"
                },
                {
                    "user_id": "Eboni Hinton",
                    "user_href": "/profile/Eboni-Hinton"
                }
            ]
        },
        {
            "author_info": {
                "name": "Zach Anderson",
                "href": "/profile/Zach-Anderson-92"
            },
            "answer_text": "I don’t want you to worry, because I can’t speak about the AF directly. But in Army Basic (IADT), other than going to church once a week, mail was one of the few privileges privates had. I didn’t get to make a phone call home until almost three weeks into the program, but I was able to send and receive letters once a week, beginning with the 2nd week. There was no limit to the number of letters (other than my ability to write and pay postage). But there were times when I didn’t *get* letters until two weeks after they were sent, due to bureaucratic bull that all military people sometimes encounter. (And have you double-checked his address?) So it is possible your guy isn’t getting your letters in a timely fashion, and it is also possible he just isn’t much of a writer. In our modern age, can you honestly say he’d ever written you that many pen and paper letters BEFORE he left? It is also possible he may face some hazing (from his fellow airmen, and/or his superiors) for getting a pile of lovey-dovey letters from you, and he might be trying to silently discourage you. ",
            "date": "Answered May 19, 2017",
            "views": "18",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Nathalie González Torres",
                    "user_href": "/profile/Nathalie-González-Torres"
                }
            ]
        },
        {
            "author_info": {
                "name": "Mark Sherhart",
                "href": "/profile/Mark-Sherhart"
            },
            "answer_text": "We had time just about every night but I don't remember writing too many letters for the first couple of weeks. I totally understand you missing him but relax. He is much more worried about you forgetting him right now. Believe me. The first weeks of Basic is an assult on his body and mind. …and each day when the DI's are done with us, all we can do is collapse into the rack and just like that….we are out! Exhausted. Be patient. He will undoubtedly see one or more of the guys in his platoon get a dear John letter. It happens often. My girlfriend wrote me two months in and informed me she loved my brother . And that she had aborted our baby. So yeah…he has you on his mind each night. Once the letters start, they will come pretty regular. And don't stop writing. It's the one enjoyable thing in boot. Good luck. ",
            "date": "Answered May 19, 2017",
            "views": "12",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Kiara Nelson",
                    "user_href": "/profile/Kiara-Nelson-27"
                }
            ]
        },
        {
            "author_info": {
                "name": "Murphy Barrett",
                "href": "/profile/Murphy-Barrett"
            },
            "answer_text": "Basic training for any military force is time and effort intensive. What little free time he has is probably going to be taken up by sleeping. And by free time, I mean time while not training, cleaning gear, studying, pulling fire watch, more training, etc. Your boy is probably exhausted, and simply can’t focus on anything beyond training right now. Don’t worry about it. You’re letters are probably the bright point of his day, week, or however often he gets mail. Keep it up. After basic training, he’ll go to tech school, for more training. He may have time to write you there, but possibly not. Just ride it out. He’ll get in touch with you when he can. ",
            "date": "Answered May 19, 2017",
            "views": "1",
            "upvotes": " Answer requested by Nathalie González Torres",
            "upvoters": [
                {
                    "user_id": "Rene Hernandez",
                    "user_href": "/profile/Rene-Hernandez-49"
                },
                {
                    "user_id": "Meagan Hebert",
                    "user_href": "/profile/Meagan-Hebert"
                },
                {
                    "user_id": "Thomas Washington",
                    "user_href": "/profile/Thomas-Washington-14"
                },
                {
                    "user_id": "Daniel Heuvelman",
                    "user_href": "/profile/Daniel-Heuvelman-1"
                },
                {
                    "user_id": "Nathalie González Torres",
                    "user_href": "/profile/Nathalie-González-Torres"
                }
            ]
        },
        {
            "author_info": {
                "name": "Takeo Eda",
                "href": "/profile/Takeo-Eda"
            },
            "answer_text": "First few weeks are going to be a mess. They are going to be up for very long hours and time to write is a privilege, so if his flight isn’t doing well, he won’t have time to do much more than the very next thing he’s told to do. You should hear back by the 3rd/4th week of training though. I think this a cold splash of water in the face, but once he signed on the line, you automatically became probably 5th or 6th in his immediate list of priorities. Welcome to the military life! ",
            "date": "Answered May 19, 2017",
            "views": "1",
            "upvotes": " View 5 Upvoters",
            "upvoters": [
                {
                    "user_id": "Nathalie González Torres",
                    "user_href": "/profile/Nathalie-González-Torres"
                }
            ]
        },
        {
            "author_info": {
                "name": "Deary Ana",
                "href": "/profile/Deary-Ana"
            },
            "answer_text": "It depends on his TI (technical instructor). As soon as I arrived to BMT they were yelling at us for anything and they would punish us by not giving us enough time to make phone calls or to write. By about the 3rd or 4th week it was a little better flow and depending on the TI or the whole class not screwing up that they would let us have some time to send letters. But if you write letters he should get them all if you have the correct address. ",
            "date": "Answered May 26, 2019",
            "views": "331",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Martin Bayer",
                "href": "/profile/Martin-Bayer-3"
            },
            "answer_text": "My advice to you is to relax. He’s very busy and need to focus on his training, that’s why he is limited in the number of letters he can send and receive. If every recruit got caught up in drama from his girl, or guy, back home, they’d lose focus on their training. So just be patient. He isn’t in contact with any women, so you’ve got nothing to worry about. You’ll see him when he’s done. ",
            "date": "Answered May 19, 2017",
            "views": "820",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Nona K Wacha",
                    "user_href": "/profile/Nona-K-Wacha"
                }
            ]
        },
        {
            "author_info": {
                "name": "Lisa Corbett",
                "href": "/profile/Lisa-Corbett-11"
            },
            "answer_text": "Everyday if he chooses but some days their isn't enough time. The free time in basic is sometimes a tough thing to find. Don't worry it is only 6 weeks then off to tech school for training in his career field. Then he will have allot more free time. I Know that you miss him and trust me he misses you very much also. ",
            "date": "Answered February 23, 2019",
            "views": "378",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Maryann Kempher",
                "href": "/profile/Maryann-Kempher"
            },
            "answer_text": "When I was in BMT I wrote on the toilet, so basically, whenever he has a stolen moment. Sometimes even when you're doing nothing, you can't write. So, you might not get a lot of letters. On the other hand, you might get enough. If you don't, be patient, and don't take it personally. Trust me, he misses you. ",
            "date": "Answered May 19, 2017",
            "views": "327",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Karl W",
                "href": "/profile/Karl-W-20"
            },
            "answer_text": "It varies by unit. We had time to write everyday after the first week. Takes a few days to get mail though. ",
            "date": "Answered May 19, 2017",
            "views": "196",
            "upvotes": " View 1 Upvoter "
        },
        {
            "author_info": {
                "name": "Ailyn Torres Smith",
                "href": "/profile/Ailyn-Torres-Smith-1"
            },
            "answer_text": "David is right…. Depends on the person. He can write to you everyday and mail call is everyday too. You should ask his parents if he has written to them. ",
            "date": "Answered May 20, 2017",
            "views": "41",
            "upvotes": " Answer requested by Nathalie González Torres"
        }
    ]
}