{
    "title": "My boyfriend is going into the Marines. I don't know if he wants to stay together or break things off. Should I ask him or just wait until he tells me? - Quora",
    "tags": [
        "Advice About Boyfriends",
        "Boyfriends",
        "Dating and Relationship Advice",
        "Relationship Advice",
        "Dating Advice",
        "Dating and Relationships"
    ],
    "response": [
        {
            "author_info": {
                "name": "Wayne Francis",
                "href": "/profile/Wayne-Francis"
            },
            "answer_text": "Here is my advice. Break up on good terms. The reality is he’s away for over 3 months in boot camp. He’s back home for just a few weeks before going off to his MOS school which could involve a few more months before he’s again back home for week or two. Then he’s off to his first duty station, which could involve him going over to Okinawa Japan. Even if he doesn’t go there odds are he’ll not be stationed anywhere near you. The only option you probably have to see him regularly would be to get married and that is a bad reason to get married. Married life as a young Marine is hard. Divorce rates in the military are high. They climb even higher when the military member gets deployed taking them away from their spouse. Pay is also very low. A married couple with no children is already living below the poverty line for the first few ranks. So you have to add the realistic financial burden that comes with it as well. The reality is if you tried to stay a couple without getting married there is a high probablility that he’ll cheat on you. Marines work hard and play hard. Both male and female marines are seldom at a loss for potential sexual partners after boot camp. And the number of Marines I personally knew in boot camp that got a letter from their “girlfriend” talking about breaking up or explicitely stating that they’ve started seeing someone else, is huge. We even had one Marine in my platoon that got a letter from his wife stating she was filing for divorce because it was already to hard just in those 3 months. I’ve help young Marines that were married and had their spouse living with them on base after they’ve come home to an empty house because their wife left them. You two could be an exception but even if you are it is probably going to be very hard. If you got married and he got base housing and you got a job it isn’t going to be a “carreer”. Most companies around a military base know that if you are married to a military member you aren’t really a long term employee making other people more attractive to hire. This leaves jobs that have high turnover already which tend to be jobs that don’t pay well. It will be hard to break up before he goes to boot camp but it will probably be better than the result if you try to stay together.  Answer to:My boyfriend is going into the Marines. I don't know if he wants to stay together or break things off. Should I ask him or just wait until he tells me? ",
            "date": "Answered October 12, 2020",
            "views": "160",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Michelle Rushing",
                    "user_href": "/profile/Michelle-Rushing-1"
                },
                {
                    "user_id": "Angela Christianson",
                    "user_href": "/profile/Angela-Christianson-9"
                },
                {
                    "user_id": "Harsh Baranwal",
                    "user_href": "/profile/Harsh-Baranwal-23"
                }
            ]
        },
        {
            "author_info": {
                "name": "Michael Ireland",
                "href": "/profile/Michael-Ireland-21"
            },
            "answer_text": "It’s important what YOU want to do and don’t just “wait” for him to bring it up. When I went through boot camp back in the early 1970’s the three guys that had the hardest time were the three that received a “Dear John” letter from their girlfriend at home. He will be far better off knowing how you feel, and how you want to deal with this separation period. I went from boot camp to another base for my real training that lasted 6 more months before I had the chance to take a leave and go home to see everyone. Then after 30 days I was loaded up and went to play war in the jungle. By the time all was said and done it was just over another year before I got home again. It isn’t easy to be a soldiers girlfriend and I hope you will learn exactly what it means. Perhaps going to the marine recruiters office and finding out what is likely to happen and the time frames involved. If he is deployed to combat a “Dear John” letter from you could be distracting and painful enough for him to make a mental mistake in combat and that’s never has a good ending because others brothers in combat are counting on him to do his job right. I don’t mean to scare you, but this isn’t any high school romance where your boyfriend will be gone for the summer being a camp councilor and you “promised” each other to be “faithful”and wait. It will be much easier for HIM to keep that promise, and much more painful for HIM if it’s broken. Just learn all you can about the reality of him becoming a marine and what it will mean, then YOU decide for yourself if you can or can’t. ",
            "date": "Answered October 12, 2020",
            "views": "73",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Tony Brown",
                    "user_href": "/profile/Tony-Brown-698"
                },
                {
                    "user_id": "Alicia Wang",
                    "user_href": "/profile/Alicia-Wang-2"
                },
                {
                    "user_id": "Angela Christianson",
                    "user_href": "/profile/Angela-Christianson-9"
                }
            ]
        },
        {
            "author_info": {
                "name": "Aida Lipari",
                "href": "/profile/Aida-Lipari"
            },
            "answer_text": "If you love your boyfriend, ask him how he feels about you. Being married to someone who is in the military isn’t easy. You’ll have to move around to a new military base either every 2 years or if you’re lucky not that often (3+ years but that’s a rarity). For that very reason, it’s not an easy life for a civilian (non-military) spouse to live. It takes a very special person to be married to someone in the military. I’m a married woman vet/veteran and served my country for nearly 10 years. I am also a wife and stay at home mother. I separated (I didn’t finish my military contract and told my unit that I’m done) after I had my last/second child. ",
            "date": "Answered October 13, 2020",
            "views": "35",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Angela Christianson",
                    "user_href": "/profile/Angela-Christianson-9"
                }
            ]
        },
        {
            "author_info": {
                "name": "Maria Del Barrio",
                "href": "/profile/Maria-Del-Barrio-3"
            },
            "answer_text": "as long as he’s not saying anything, i think it’s safe to assume he wants to stay together. he would tell you if he thinks LDR won’t work and he wants to breakup. but if it’s really eating at you, ask if you guys can talk, then you can bring it up. (tho personally i think you should wait). ",
            "date": "Answered October 12, 2020",
            "views": "960",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Angela Christianson",
                    "user_href": "/profile/Angela-Christianson-9"
                }
            ]
        },
        {
            "author_info": {
                "name": "Daniel McCullar",
                "href": "/profile/Daniel-McCullar"
            },
            "answer_text": "Let me give you peace advice, a simple rule in life. If there’s anything you ever want to know don’t be afraid to ask. Just be prepared to except the answer. This way you’ll never live in limbo or the dark. ",
            "date": "Answered October 13, 2020",
            "views": "77",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Judy McElearney",
                    "user_href": "/profile/Judy-McElearney"
                },
                {
                    "user_id": "Angela Christianson",
                    "user_href": "/profile/Angela-Christianson-9"
                }
            ]
        },
        {
            "author_info": {
                "name": "Louise Hudson",
                "href": "/profile/Louise-Hudson-6"
            },
            "answer_text": "Get it settled ASAP. This is too important to be playing games. In my opinion, If you're under 25—physically or emotionally—you should not be promising to wait for him. Long distance relationships seldom work for anyone. It may seem romantic now—it won't in a few months. ",
            "date": "Answered October 13, 2020",
            "views": "15",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Angela Christianson",
                    "user_href": "/profile/Angela-Christianson-9"
                }
            ]
        },
        {
            "author_info": {
                "name": "Winston H Reed",
                "href": "/profile/Winston-H-Reed"
            },
            "answer_text": "Ask him , end the uncertainty and worry. Assuming stuff is not a good basis for a relationship, discuss your concerns. ",
            "date": "Answered October 12, 2020",
            "views": "20",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Mary Skinner",
                    "user_href": "/profile/Mary-Skinner-19"
                },
                {
                    "user_id": "Angela Christianson",
                    "user_href": "/profile/Angela-Christianson-9"
                }
            ]
        },
        {
            "author_info": {
                "name": "Laurence Howey",
                "href": "/profile/Laurence-Howey"
            },
            "answer_text": "Why wouldnt he just cause hes going to the marines doesnt mean hes breaking up with you. Have a talk with him ",
            "date": "Answered October 12, 2020",
            "views": "22",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Angela Christianson",
                    "user_href": "/profile/Angela-Christianson-9"
                }
            ]
        },
        {
            "author_info": {
                "name": "Jane Frine",
                "href": "/profile/Jane-Frine"
            },
            "answer_text": "Ask, he’ll definitely let you know either way. ",
            "date": "Answered October 12, 2020",
            "views": "18",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Angela Christianson",
                    "user_href": "/profile/Angela-Christianson-9"
                }
            ]
        }
    ]
}