{
    "title": "My boyfriend is joining the U.S. Marines. How do I handle the distance and not being able to speak to him much? I refuse to leave him. - Quora",
    "tags": [
        "U.S. Marine Corps",
        "United States Armed Forces",
        "Military"
    ],
    "response": [
        {
            "author_info": {
                "name": "Jake Patterson",
                "href": "/profile/Jake-Patterson-16"
            },
            "answer_text": "How you handle it is by considering your options and making a decision. You have to understand this is his decision, and support him one way or another. Supporting him doesn’t mean you have to stay with him, just that you aren’t angry and understand his need to join up. Should you choose to stay with him, there’s more to consider. The life of a significant other for our troops is very different than others. If you love him, like really love him, stick it out. He will be gone for a while training, he will be stationed somewhere that’s probably not home. Deployments last anywhere from 6–14 months. Many of our troops opt to rush in marriage so they can be with their significant other and get out of the barracks. Rushing into it is not a good idea, I don’t know about other branches but for first term Marines the divorce rate is 110%. Seriously. Many of my friends came home from the war to find their wives/girlfriends were not faithful. Some of my friends had excellent wives/girlfriends, who supported their man through thick and thin. Being a significant other for our troops is a job of its own. The ones that do it right are greatly appreciated. Many wives/girlfriends lean on each other during deployments and training, and there’s things you can do like joining auxiliary support clubs to find others in the same situation. It doesn’t take a strong woman to do this, it does take one that is in a really loving relashinship though. So you can say you want to stick it out and live the life of loving and supporting significant other for one of our warriors, or you can say this is not the life I want and cut your losses. Remember that you are both making a big decision and there doesn’t need to be any anger on either side. Just if you decide to try it and see how it goes, build the foundation of your relashinship on faithfulness and DO NOT rush into a marriage. Good luck! ",
            "date": "Answered May 3, 2018",
            "views": "41",
            "upvotes": " View 5 Upvoters",
            "upvoters": [
                {
                    "user_id": "Denise Neuman",
                    "user_href": "/profile/Denise-Neuman-2"
                },
                {
                    "user_id": "Luke Yates",
                    "user_href": "/profile/Luke-Yates-44"
                },
                {
                    "user_id": "Leah Monèt Scott",
                    "user_href": "/profile/Leah-Monèt-Scott"
                },
                {
                    "user_id": "Ai ;)",
                    "user_href": "/profile/Ai-250"
                },
                {
                    "user_id": "Walt Anderson",
                    "user_href": "/profile/Walt-Anderson-3"
                }
            ]
        },
        {
            "author_info": {
                "name": "Walt Anderson",
                "href": "/profile/Walt-Anderson-3"
            },
            "answer_text": "Well, easy option is to lean on your family. Lean on your female friends. When he deploys and is in real mortal danger, that feeling is only going to get more intense. The good news is the longer you do long distance, the better you get at it. I’m married now. When I was deployed, my girlfriend and I at the time broke up 3 or 4 times. That’s pretty normal. Some guys get cheated on. Military relationships do tend to end in failure because of the stress, so be aware of that. In the meantime, don’t get coffee or lunch with other guys. Even if they are really good friends. Stay loyal. If you can’t handle that, be honest and send the breakup letter to your Marine-to-be. He will recover, but your integrity won’t grow back. The most common story goes something like this for cheaters at home: “I met a friend after class, we had a good time. He was so sweet and totally respectful of our relationship. I went over to his place to study one night, and we held hands. I was thinking about how lonely I was, then we kissed and one thing led to another… I didn’t mean it.” Heed that warning, 100%. Your real friends and family are the ones who will hold you accountable to the relationship. That’s where all of your focus can be. Send him letters and stand by the phone when he is due to call you. You’ll get through it. ",
            "date": "Answered May 2, 2018",
            "views": "25",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Denise Neuman",
                    "user_href": "/profile/Denise-Neuman-2"
                },
                {
                    "user_id": "Angela Christianson",
                    "user_href": "/profile/Angela-Christianson-9"
                },
                {
                    "user_id": "Leah Monèt Scott",
                    "user_href": "/profile/Leah-Monèt-Scott"
                },
                {
                    "user_id": "Dylan Kovacs",
                    "user_href": "/profile/Dylan-Kovacs-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Kimberly Blair",
                "href": "/profile/Kimberly-Blair-14"
            },
            "answer_text": "Now’s the time to get your social life booming. Make yourself busy - find people to give you a sense of community and belonging while he’s away. Rely on friends and family for emotional support, and good friends for platonic hugs and affection when that’s something you require. If you’re too busy with great people to feel genuinely lonely, missing your BF will hurt much less. You’ll be a much healthier and happier girlfriend when he does come home, and he will appreciate that. There are also support groups for military families and partners. What you’re facing is a big part of being a military spouse or the “home” end of a dating partnership (heck, even in being a child of a military parent!). There are loads of people who can commiserate with you and you might find a tight community of people who know exactly what you’re going through. I find that helps, a lot. You can often find support groups in your local town even if it’s not a military base town or the city in which he is stationed. Remember, you are NOT alone! Make plans for what is going to happen after training is over. Knowing a long distance relationship will not *always* be long distance helps keep your heart and mind on the right track. ",
            "date": "Answered May 2, 2018",
            "views": "16",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Peter Hara",
                    "user_href": "/profile/Peter-Hara"
                },
                {
                    "user_id": "Leah Monèt Scott",
                    "user_href": "/profile/Leah-Monèt-Scott"
                },
                {
                    "user_id": "Graham Gemmell",
                    "user_href": "/profile/Graham-Gemmell"
                },
                {
                    "user_id": "John Littleton",
                    "user_href": "/profile/John-Littleton-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Tyler Adams",
                "href": "/profile/Tyler-Adams-94"
            },
            "answer_text": "Honestly. You should probably just end the relationship. I know this will probably get a lot of disagreement. Quite simply, you're young. And after 3 months of being at a USMC recruit depot will change him. The he will go to his job training school. Than his actual first station. Unless you intend on marrying him and moving around with him, you'll be stuck doing a long term relationship. People are going to tell you do find hobbies, lean on your family, all that stuff. But the simple fact is, you'll probably forget what his face looks like before he gets out of basic. Yeah, you'll recognize when you see him, but you may have a hard time bringing up that image in your head. The distance will be rough, and the emotional immaturity, no offense, just isn't conducive to a long lasting relationship. Tell you what though, after you've been apart for a while, and he's done some cool US Marine stuff, meet back up and see if there's anything still there. If so, then you have a real shot. ",
            "date": "Answered May 3, 2018",
            "views": "45",
            "upvotes": " View 10 Upvoters",
            "upvoters": [
                {
                    "user_id": "James Schroeder",
                    "user_href": "/profile/James-Schroeder-20"
                },
                {
                    "user_id": "Denise Neuman",
                    "user_href": "/profile/Denise-Neuman-2"
                },
                {
                    "user_id": "Phil Gardner",
                    "user_href": "/profile/Phil-Gardner-18"
                },
                {
                    "user_id": "Leah Monèt Scott",
                    "user_href": "/profile/Leah-Monèt-Scott"
                },
                {
                    "user_id": "Meadow Kelley",
                    "user_href": "/profile/Meadow-Kelley-3"
                },
                {
                    "user_id": "Ai ;)",
                    "user_href": "/profile/Ai-250"
                },
                {
                    "user_id": "Paul King",
                    "user_href": "/profile/Paul-King-198"
                },
                {
                    "user_id": "Rony Rene Romero",
                    "user_href": "/profile/Rony-Rene-Romero-1"
                },
                {
                    "user_id": "Rea Monserate",
                    "user_href": "/profile/Rea-Monserate-1"
                },
                {
                    "user_id": "Alex Arteaga",
                    "user_href": "/profile/Alex-Arteaga-11"
                }
            ]
        },
        {
            "author_info": {
                "name": "Teresa Williams",
                "href": "/profile/Teresa-Williams-99"
            },
            "answer_text": "Are you considering marriage when he is done with Boot Camp? The answer to that would definitely depend upon the advice I would give you. Until he is able to write & receive letters, keep a journal. Begin a new hobby. The most important thing you can do is support him in whatever he asks of you to do to help him get through basic training, and respect his choice to serve his country by fulfilling his request of how best to support him. I’m sure if you ask him, he will have a good answer. Thank you for serving him, while he chooses to serve us! ",
            "date": "Answered May 6, 2018",
            "views": "12",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "George H McCollum III",
                "href": "/profile/George-H-McCollum-III"
            },
            "answer_text": "FIRST of all he's a “boyfriend” SECOND of all he's “leaving” you THIRD of all he will have a different life and DEFINITELY return a VERY different individual FOURTH and Last of all the separation will provide you time to have a different life. So a mutual agreement to NOT be monogamous or committed during the separation would be in both of your best interest this way should feelings change or you or he meet that “SPECIAL” someone theres no sense of betrayal or deceitful behavior When he returns assess your feelings for one another an behave accordingly ",
            "date": "Answered May 2, 2018",
            "views": "15",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "William John G. Balderama",
                "href": "/profile/William-John-G-Balderama"
            },
            "answer_text": "Be prepared to meet a new man after boot camp. Absence makes the heart go fondlier still. He will need you to keep the faith while he learns how to defend your right as an American. ",
            "date": "Answered May 3, 2018",
            "views": "261",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Hsa S",
                    "user_href": "/profile/Hsa-S"
                },
                {
                    "user_id": "Daniel Ruiz",
                    "user_href": "/profile/Daniel-Ruiz-158"
                }
            ]
        },
        {
            "author_info": {
                "name": "Deborah Geyer",
                "href": "/profile/Deborah-Geyer"
            },
            "answer_text": "Then join the generations of wives and sweethearts who were left behind. They had to be brave and Not cause their husbands and boyfriends worry on top of what missions they had to engage. Suck it up, girl if you want to help him be his best. ",
            "date": "Answered May 2, 2018",
            "views": "165",
            "upvotes": "0"
        }
    ]
}