{
    "title": "My English is really good when I write but horrible when I speak. What should I do? - Quora",
    "tags": [
        "English Writing",
        "English Language Writing Advice",
        "Advice About Learning English",
        "English as a Second Language (ESL)",
        "Learning English",
        "Writing Advice",
        "Writing",
        "English (language)"
    ],
    "response": [
        {
            "author_info": {
                "name": "Severine Riise",
                "href": "/profile/Severine-Riise"
            },
            "answer_text": "1: Speak to yourself. Explain to yourself what plans you have for the day. Are you going shopping? If so, what are you buying? What are you going to use it for? Where are you going shopping? I need to go shopping for dinner.I need bananas, beans, jelly, chicken thighs, and asparugues. I should also buy some mustard and spices(name them if you know them).I want to marinate that chicken thigh. I need to mix the mustard with the spices, put it in a bag with the chicken. An hour of marination should do. Perhaps 2 for good measure. In the meantime the oven should be cleaned. That reminds me, I need to put down some extra soap for the floors. I need to wash them. It’s been a while.I wonder if I should go shopping at the shopping mall. There’s more to choose from, but then again the meat from the local butcher is better. Then I’m also supporting the local community. The vegetable store next to the butcher has really good clementines too. I should buy some.etc.The first excercise is about sentence structure and vocabulary. You are planning your day, you are listing up names of stuff, and you are using what you know about grammar in a semi-unplanned manner. You do know what you are planning to do, so you know what needs to be said, it’s just a manner of how you say it. 2: Read aloud. Read both self-written pieces to familiarise yourself with how the words fit in your mouth, and articles that you have not written. The former will let you put your penmanship into practice, while the latter creates more surprises and may include different words and idioms than you would prefer using yourself. The second excercise is about pronunciation. The words are already there unlike the first excercise, you just need to read them as you see them. If you want to repeat the first lesson, you can summarise the contents of the article of piece of writing in your own words afterwards, along with praise and critique if you want to. 3: Watch English movies and series to evolve your listening skills. When possible, try to mimic the exact manner the sentences in the series/movie are pronounced. For this to work it is advisable to watch different series (with different dialects and accents) so you do not get stuck with a particular on (unless you want to have that particular accent or dialect). The third excercise is (similarly to the second) about pronunciation, but here the pronunciation is provided, and you only need to repeat it. This is a good excercise if you are uncertain about a few words here and there. 4: Speak to people. Eventually you will have to address the main purpose of spoken language. Communication. You will likely make mistakes. Words will be misspoken. Misunderstandings will occur. But you proficiency will benefit greatly from it. The last excercise is the hardest one, and utilises the knowledge gained from the previous excercises. You will not know what kind of words will be used by your conversation partner, nor where the conversation is going. I hope this helps, and wish you luck! ",
            "date": "Answered December 20, 2016",
            "views": "590",
            "upvotes": " View 7 Upvoters",
            "upvoters": [
                {
                    "user_id": "Ima Ami",
                    "user_href": "/profile/Ima-Ami-1"
                },
                {
                    "user_id": "Kristen Elizabeth",
                    "user_href": "/profile/Kristen-Elizabeth-21"
                },
                {
                    "user_id": "Kitty Nixon",
                    "user_href": "/profile/Kitty-Nixon"
                },
                {
                    "user_id": "Sandro Beradze",
                    "user_href": "/profile/Sandro-Beradze"
                },
                {
                    "user_id": "Amr Hiamrela",
                    "user_href": "/profile/Amr-Hiamrela"
                },
                {
                    "user_id": "Igor Guba",
                    "user_href": "/profile/Igor-Guba"
                },
                {
                    "user_id": "Yan Liu",
                    "user_href": "/profile/Yan-Liu-102"
                }
            ]
        },
        {
            "author_info": {
                "name": "Nandan Choksi",
                "href": "/profile/Nandan-Choksi"
            },
            "answer_text": "Writing & speaking are different forms of communication. Being good at one, as you have learned, does not necessarily mean that you are good at the other. Learn debate and oratory if you want to learn to speak well. Don’t just learn the principles. Do it. Apply what you have learned, immediately. See how well the technique works — for you. Learn a variety of techniques. See what works best for you. Keep speaking to others and with others. Above all, keep these few things in mind: Listen. Sometimes, this  is  all you can do. But the act of genuine listening is often far more valuable than any number of words or even the quality of the words. Respond. Don’t just speak. Wait for the other person to finish speaking. Understand his or her words. Ask questions when you don’t. Try to help. Don’t try to win. Try to make  things clear. Don’t find fault. Develop a huge vocabulary. Then use the simplest words you know. This sounds silly. But it works. Think of your vocabulary as a bank account. It’s good to have tons of money in your account. But that doesn’t mean you must use a $100 bill for every purchase. Use $1 or even $0.25, if that’s what is most appropriate in the situation. ",
            "date": "Answered December 20, 2016",
            "views": "794",
            "upvotes": " View 10 Upvoters",
            "upvoters": [
                {
                    "user_id": "Arun Balasubramanian",
                    "user_href": "/profile/Arun-Balasubramanian-17"
                },
                {
                    "user_id": "Mustafa Abdelrahman",
                    "user_href": "/profile/Mustafa-Abdelrahman"
                },
                {
                    "user_id": "Yolanda Ramos",
                    "user_href": "/profile/Yolanda-Ramos"
                },
                {
                    "user_id": "Jarrar Khan",
                    "user_href": "/profile/Jarrar-Khan-1"
                },
                {
                    "user_id": "John Smith",
                    "user_href": "/profile/John-Smith-9785"
                },
                {
                    "user_id": "Candace Lei",
                    "user_href": "/profile/Candace-Lei"
                },
                {
                    "user_id": "Medo Elryan",
                    "user_href": "/profile/Medo-Elryan"
                },
                {
                    "user_id": "Deniz Şuözer",
                    "user_href": "/profile/Deniz-Şuözer-1"
                },
                {
                    "user_id": "Prashant Kumar",
                    "user_href": "/profile/Prashant-Kumar-635"
                },
                {
                    "user_id": "Sebastian Cordero",
                    "user_href": "/profile/Sebastian-Cordero-4"
                }
            ]
        },
        {
            "author_info": {
                "name": "Tom Potter",
                "href": "/profile/Tom-Potter-32"
            },
            "answer_text": "The Bible says there are gifts of talents. Some persons received a “gift of tongue, they can speak eloquently though they dont even know how to sharp the writing pencils”, they are illiterate. Others received gift of healing, gift of knowing the future, gift of deceiving or pretending, gift of telling a lie, even though you cut their necks they will not confess for the truth. Your gift is in writing. The famous writers never had public speaking like a blabbing politician. Indeed, everytime we see them, during their interview engagements, they just say “hi-hello”. Have courage and be satisfied. Your confidence must remain in you. We must be thankful we have healthy tounge. You have one step progress ahead from me! ",
            "date": "Answered December 20, 2016",
            "views": "95",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Jon Coake",
                    "user_href": "/profile/Jon-Coake"
                }
            ]
        },
        {
            "author_info": {
                "name": "Eric Lee",
                "href": "/profile/Eric-Lee-614"
            },
            "answer_text": "I feel you bro. The key point is that you have to use the language you've learned as often as possible. You'd like to describe everything in your sight when crossing road or waiting at bus stop. What I'm trying to say is that you need to create a situation where you can use the target language. People tend to remember meaningful stuff keep them in their mind as they can recite the telephone number that they often dialed every day. Hang on when you want to give up. Forget the judgements from others because you don't have to live in their shades. You're what you want to be. Hope you can make much more progress on your way to success . ",
            "date": "Answered December 20, 2016",
            "views": "148",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Jarrar Khan",
                    "user_href": "/profile/Jarrar-Khan-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "John Ware",
                "href": "/profile/John-Ware-4"
            },
            "answer_text": "Seems like a lot of questions are around this topic. Here’s how I teach this: I sit two students (or, if there is only one student, the student and myself) across a table from one another. I have them start talking to each other, even if they have trouble speaking English, coming up with a word or phrase, whatever. Then I stop the conversation, and tell the students to write a question to the other person and pass it across the table. The students answer each other to the best of their ability. But the greater example here is the students are COMBINING listening, speaking and writing in this one simple exercise. In so doing, the students usually are able to grasp the links between the three. If you do this, you’ll see a big improvement in your listening and speaking skills within 3 hour-long sessions. ",
            "date": "Answered December 20, 2016",
            "views": "345",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Michael Patrick",
                    "user_href": "/profile/Michael-Patrick-52"
                },
                {
                    "user_id": "Akash Chauhan",
                    "user_href": "/profile/Akash-Chauhan-164"
                },
                {
                    "user_id": "Rhea Khanna",
                    "user_href": "/profile/Rhea-Khanna-8"
                }
            ]
        },
        {
            "author_info": {
                "name": "Deepika",
                "href": "/profile/Deepika-279"
            },
            "answer_text": "Speak and listen. That’s the only way you’ll develop good vocal command on the language. I would suggest you watch English movies, serials, listen to podcasts, and songs. The more your expose yourself to the language, the more your mind will adjust to it. Converse with people in English as well. This can be uncomfortable if you’re not confident in your spoken English but you need to start somewhere. Find someone who won’t judge you and is quite fluent in the language and converse with them daily. You’ll eventually start to develop an instinctive grasp on the spoken language. ",
            "date": "Answered December 20, 2016",
            "views": "206",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Michael Patrick",
                    "user_href": "/profile/Michael-Patrick-52"
                },
                {
                    "user_id": "Akash Chauhan",
                    "user_href": "/profile/Akash-Chauhan-164"
                }
            ]
        },
        {
            "author_info": {
                "name": "Norman Astrin",
                "href": "/profile/Norman-Astrin"
            },
            "answer_text": "Take up acting. It will help you understand that language is a part of role making ,and if you wish to communicate well, you must be aware of who you are communicating with, and be able to use thier language to get them on your side. It's not what you know, it's how you say it. Good luck with that. I find writing and editing clears up whatever I am pondering, but talking to others is essential in order to allow a simpler answer that can be easily understood. I subscribe to KISS: Keep It Simple Stupid. ‘Nuff said. ",
            "date": "Answered December 24, 2016",
            "views": "152",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Hidayati Tri",
                    "user_href": "/profile/Hidayati-Tri"
                }
            ]
        },
        {
            "author_info": {
                "name": "Pratham Luthra",
                "href": "/profile/Pratham-Luthra-9"
            },
            "answer_text": "First of all, it’s ok. Nobody is perfect. There are many people out there who are confident enough in writing but fumble a bit when it comes to speaking in English. This has happened with me and i am not afraid to accept this fact. If you want to improve this thing, you need to become a little courageous, stop thinking about what other people say about you and start speaking English at your home with your siblings or parents,colleagues at your workplace, friends at college. This will help you to come out of your shell and gradually you will be fluent in speaking English. ",
            "date": "Answered April 13, 2020",
            "views": "203",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Greg Mummah",
                "href": "/profile/Greg-Mummah"
            },
            "answer_text": "Practice! Lots and lots of practice! Seriously, find a friend to talk to and talk your head off. You’ll be more comfortable in no time. ",
            "date": "Answered December 23, 2016",
            "views": "33",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Stephen Kazoullis",
                "href": "/profile/Stephen-Kazoullis"
            },
            "answer_text": "You must practise speaking. Set up an interest group so you can practise speaking. All speaking is learnt by practise. ",
            "date": "Answered December 21, 2016",
            "views": "47",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Tan Wei Liang Nathanael",
                "href": "/profile/Tan-Wei-Liang-Nathanael"
            },
            "answer_text": "Learn the pronunciations. Differentiate between pure English words and borrowed words - such as rendezvous. ",
            "date": "Answered December 20, 2016",
            "views": "55",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Vidyanandi Iyer",
                "href": "/profile/Vidyanandi-Iyer"
            },
            "answer_text": "Listen to good English while paying attention to how words are pronounced. ",
            "date": "Answered December 20, 2016",
            "views": "77",
            "upvotes": "0"
        }
    ]
}