{
    "title": "My son started kindergarten and doesn't like writing his name. How do I help him with this? - Quora",
    "tags": [
        "Kindergarten",
        "Parenting Advice",
        "Children",
        "Parenting"
    ],
    "response": [
        {
            "author_info": {
                "name": "Chrystal Hays",
                "href": "/profile/Chrystal-Hays"
            },
            "answer_text": "Often this is from discomfort holding the implement. I’ve written in a little detail about this elsewhere. Be sure he is angling the paper, resting his arm on the desk so it is anchored, and holding the pencil or crayon with thumb and first 2 fingers while other fingers curl up under hand. He should be at an angle so he can see where the tip meets the paper, and weight is on his elbow, so hand and fingers are free to move. If you try writing with your whole arm in the air and the pencil held randomly where you cannot even see it, you have to really push down to keep it on the paper, and it makes arm and fingers sore. Really frustrating. You may also want to talk about his name. Is it long? Do kids make fun of it? My nephew Lafayette goes by Fate. Now is a good time to decide if he wants to go by his middle name or a nickname or something. ",
            "date": "Answered October 10, 2018",
            "views": "66",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "James Collins",
                    "user_href": "/profile/James-Collins-33"
                },
                {
                    "user_id": "Crystal Why",
                    "user_href": "/profile/Crystal-Why"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/Marya-Sholevar"
                }
            ]
        },
        {
            "author_info": {
                "name": "Denise Quigley",
                "href": "/profile/Denise-Quigley-1"
            },
            "answer_text": "Another Quoran started down this path, the path that maybe it’s uncomfortable. If it is, another step is getting these gel grips to put on his pencils. That makes it more comfortable for him to write. If it continues, you may want to pay attention to whether or not he has issues with other things that fall into fine motor skill categories, eg, buttoning shirts, tying shoes, cutting food. If he struggles with some of these, he should be assessed by an occupational therapist. He could have issues with fine motor skills associated with sensory processing disorders. This won’t be quite on the same spectrum as autism, but it does cause issues where he might experience discomfort with things you might find completely comfortable. Think about how he is with socks, tags, etc. ",
            "date": "Answered October 10, 2018",
            "views": "25",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/Marya-Sholevar"
                }
            ]
        },
        {
            "author_info": {
                "name": "Nathan Ketsdever",
                "href": "/profile/Nathan-Ketsdever"
            },
            "answer_text": "Here are six suggestions: Tell him his name is beautiful and help him to see it as such.Help him see the value in knowing someone's name or being able to sign one’s name.Help him see the purpose of his name in particular.I think also asking him might help to unpack or uncover or otherwise surface the root emotional cause. Please don’t overlook this one.Encourage his writing overall.I think periodically giving him the opportunity to color in his name. I say periodically in order to make it a unique opportunity rather than a chore.And a couple more: You might make a sign of his name, that he contributes to, in which each letter in his name stands for something.When I was younger, I remember doing a shield (really a crest) for our family, I can imagine something similar working for one’s name.",
            "date": "Answered October 10, 2018",
            "views": "15",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/Marya-Sholevar"
                }
            ]
        },
        {
            "author_info": {
                "name": "Tatyana Zabanova",
                "href": "/profile/Tatyana-Zabanova"
            },
            "answer_text": "Even though I knew how to read and write, I refused to do those things until I got into school. In kindergarten, it was not even a “she doesn’t like”, it was more of a “try making her write whatever and the hell will break loose”. My life turned out just fine. I finished the school as the top student of the class. I entered a good university. Got a master degree. Got a good job. Blablabla. Just let the kid sort it out. ",
            "date": "Answered October 10, 2018",
            "views": "150",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/Marya-Sholevar"
                }
            ]
        },
        {
            "author_info": {
                "name": "Brooke Lenington",
                "href": "/profile/Brooke-Lenington"
            },
            "answer_text": "Try making a game out of it, you know? Just try to find some ways to make it fun. To help him practice. Maybe give him different colored pens and let him write each letter in a different color? Positive reinforcement . ? You write your name xx many times you get this in return. ",
            "date": "Answered October 10, 2018",
            "views": "16",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/Marya-Sholevar"
                }
            ]
        },
        {
            "author_info": {
                "name": "Fatimah Darwish",
                "href": "/profile/Fatimah-Darwish"
            },
            "answer_text": "Write his name a few times on paper. Put in a sleeve protector or laminate the paper. Give him a dry erase marker and have him trace his name, wipe off and repeat. This practice should help. ",
            "date": "Answered October 10, 2018",
            "views": "9",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Adam Wilke",
                    "user_href": "/profile/Adam-Wilke-1"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/Marya-Sholevar"
                }
            ]
        },
        {
            "author_info": {
                "name": "Andreas Buechel",
                "href": "/profile/Andreas-Buechel"
            },
            "answer_text": "perhaps he would appreciate to be asked what name would you give to yourself if you can choose freely or how would you describe yourself what is the most important part of you ",
            "date": "Answered October 10, 2018",
            "views": "19",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/Marya-Sholevar"
                }
            ]
        }
    ]
}