{
    "title": "My Turnitin percentage was 47%, and I am worried that I failed to cite every direct quote I used (plagiarism). How should I confront my teacher? - Quora",
    "tags": [
        "Turnitin",
        "Academic Plagiarism and Cheating",
        "Plagiarism"
    ],
    "response": [
        {
            "author_info": {
                "name": "Jerry Lewis",
                "href": "/profile/Jerry-Lewis-10"
            },
            "answer_text": "You should review the Turnitin report to see what it flagged as plagiarism. When you see those indications, you should follow them up. If you haven’t submitted the paper yet, you can work to correct them. Also, note that the settings may affect your percentage. For example, if the teacher did not set it up to exclude quotes and bibliography, this could explain a high percentage, although if your paper is nearly 50% quoted, that may be a problem. You can change these filter settings to see what affect they have. The results would be a point of discussion. If you have submitted the paper, you should talk with (not confront - why would you want to confront) your teacher. If you have an explanation, you could go over it and ask for the ability to correct it. If you plagiarized inadvertently or even on purpose, you can say you learned your lesson, etc. This only works once, though, so be more careful next time. Ask your teacher to allow you to turn in a draft to check. This is helpful to avoid making inadvertent mistakes. ",
            "date": "Answered November 12, 2019",
            "views": "2",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Martin Stacey",
                "href": "/profile/Martin-Stacey-9"
            },
            "answer_text": "Go and talk to your teacher. Do not confront. Be completely honest. 47% is a very high number, and I’d want to know what’s going on (and Turnitin does a pretty good job of telling me), but the number doesn’t tell me if you’re plagiarising or legitimately quoting, so I’d look. What you need to do is to give credit for all ideas, information and words that aren’t yours, honestly, clearly and accurately. If you’re quoting too much and thinking not enough, you’ll get a fair mark for what you’ve done. Summarising and combining is good - it’s what you’re supposed to do. Do NOT paraphrase paragraphs to make them “yours” or to reduce your Turnitin scores - we HATE this. ",
            "date": "Answered June 18, 2020",
            "views": "296",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Evelyn Elwell Uyemura",
                "href": "/profile/Evelyn-Elwell-Uyemura"
            },
            "answer_text": "One way that it can show up like that is if you left a space between the quotation marks and the words. “Little Women” will not be counted but “ Little Women “ or “Little Women or ‘Little Women’ will all show up as plagiarized, potentially. If you used proper lead-ins and parenthetic reference, but merely forgot to use quotation marks correctly, most teachers will not consider that to be deliberate plagiarism. On the other hand, if nearly half your paper is unacknowledged quotes, I think you are in a bit of trouble, even if you did write it as if you were paraphrasing. But “confront” is not what you want to do to your teacher! The teacher may “confront” you! I think you should go to your instructor and say, “Can we talk about my paper? I didn’t intend to plagiarize, but I think I may have made some errors in my citations and use of quotation marks.” And hope for the best! ",
            "date": "Answered November 10, 2019",
            "views": "14",
            "upvotes": " View 5 Upvoters",
            "upvoters": [
                {
                    "user_id": "Sherry Chisamore",
                    "user_href": "/profile/Sherry-Chisamore"
                },
                {
                    "user_id": "Terri Grassby",
                    "user_href": "/profile/Terri-Grassby"
                },
                {
                    "user_id": "Gordon Dewis",
                    "user_href": "/profile/Gordon-Dewis"
                },
                {
                    "user_id": "Barbara Robson",
                    "user_href": "/profile/Barbara-Robson-1"
                },
                {
                    "user_id": "David Ferrell",
                    "user_href": "/profile/David-Ferrell-3"
                }
            ]
        },
        {
            "author_info": {
                "name": "Lawrence Ness",
                "href": "/profile/Lawrence-Ness-4"
            },
            "answer_text": "One possible reason for the higher similarity percentage is not necessarily that you plagiarized, but rather, did not write in your own “voice” by paraphrasing. Turnitin allows professors and students to determine whether plagiarism occurred, but does not actually catch plagiarism - only similarity. If using quotes, that raised the similarity (reduces originality). Recommend not using quotes, but to continue citing all sources, where used in the paper. In this instance, it does not appear that the teacher should be confronted, but rather, to learn from the report and revise the writing style to improve originality. ",
            "date": "Answered December 12, 2019",
            "views": "678",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "James Nash",
                "href": "/profile/James-Nash-20"
            },
            "answer_text": "Watch the videos on Turnitin, print the Turnitin report, and have an open discussion with your teacher. Treat this as a learning experience. Remember that the score has to do with coincidence as well as correct citation. ",
            "date": "Answered November 10, 2019",
            "views": "405",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Evelyn Elwell Uyemura",
                    "user_href": "/profile/Evelyn-Elwell-Uyemura"
                }
            ]
        }
    ]
}