{
    "title": "My thesis is very simple. What should I do to make it seem like enough work? - Quora",
    "tags": [
        "Graduate School Education Advice",
        "Theses and Dissertations",
        "Graduate School Education",
        "Writing Advice"
    ],
    "response": [
        {
            "author_info": {
                "name": "Tom McNamara",
                "href": "/profile/Tom-McNamara-4"
            },
            "answer_text": "I felt exactly that way. I found out later, most grad students feel that way. It's usually because they're so incredibly familiar with their work that they can move through it very quickly mentally. Like a gymnast on those uneven parallel bars, zip, zip, easy, right? Why would anyone want to watch this stuff I do every day? Well, we've never done what you do every day.  Every grad student takes wrong turns, and every grad student throws away most of the work they did. That's normal.  So. Have you tried explaining your work, in a short chalk talk, to a friend in your field? The goal is to show that you did original research.  For that you need to  Explain the latest, most relevant work in the literature. (\"Jane grew algae in the water filter of her blue laser. Her algae population doubled every 3 days.\")  Explain simply and clearly what you did that is new. (\"I found a green laser, and I grew algae in its water filter. My algae population doubled every 4 days. My control population, with a blue laser, doubled every 3.2 days, consistent with prior work.\") Prove that your new work is correct. (\"Here's how I know it is or isn't the same strain of algae, here are my algae pictures, here are my growth graphs for the green laser and the control sample, here are some sources of error and how bad they might be.\") Can you really do all that in five minutes? At a speed and level of detail that people can follow? Anything else you say beyond points 1,2,3 is secondary. But you can talk about applications  (\"So green lasers are better if you're worried about algae.\"), or future work (\"We'd like to know how the pH of the water affects these experiments. We did use the same water for our control algae and our green-laser algae.\") or interesting observations (\"When you shade the water filter from the laser light, the algae turns brown and dies.\")  If you can really do all that in five minutes, that's an extremely valuable thing to have. That's your abstract. Hopefully you can give that same five-minute version to your advisor and get feedback. But very likely anyone who knows something about the field won't find the five-minute version obvious at all. They'll need a lot more information than you can possibly give them in five minutes. Even just part 2 above will probably take more than five minutes to explain to anyone who hasn't been practicing those moves all day long.  ",
            "date": "Answered February 1, 2016",
            "views": "378",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Karan Mehta",
                    "user_href": "/profile/Karan-Mehta-8"
                },
                {
                    "user_id": "Alexander Farrugia",
                    "user_href": "/profile/Alexander-Farrugia"
                },
                {
                    "user_id": "Sameer Gupta",
                    "user_href": "/profile/Sameer-Gupta"
                },
                {
                    "user_id": "Joel Goldstein",
                    "user_href": "/profile/Joel-Goldstein-7"
                }
            ]
        },
        {
            "author_info": {
                "name": "Ellie Figueroa",
                "href": "/profile/Ellie-Figueroa"
            },
            "answer_text": "There are two issues that you seem to bring up. One is the complexity of your work, and the other one is your advisor failing you. I will treat these separately.   Feeling that your work can be summarized in 5 minutes does not mean it was easy to accomplish.  Furthermore, it is actually not uncommon for thesis work (even at PhD level) to be done, in reality in a few weeks.  In many cases, students spend years preparing the experiment (understanding the background, doing setup, calibration and troubleshooting) and then the experiment only takes a few minutes/days.  That doesn't mean that the experiment was easy.  Part of the reason for the post bachelor education is to train you.  That requires time.  Your thesis is suppose to show that you have currently been trained.  Furthermore, that you know enough to contribute back to your field.  As for the appearance of your thesis: talk about what the challenges are precent in your setup/procedure,  why your experiment/proposition/discovery is important, do a through background review. Are all the \"basic\" concepts properly explained? Is there other work published similar? how is it different? why is your point of view still needed?  Is there anything you are oversimplifying that in relativity could be better explained? Basically, make sure your reader knows why your work is important.   Have you looked into every aspect of your thesis and made sure that anyone (meaning a person with a completely different background) can read it and gain a deeper understanding into your area of study?  Will that same person finish reading your thesis and know why you did what you did, and how you did it? if not, there is room for more information. As far as your advisor goes, if you are one week away from submission, you MUST have been in communication with him about your work being done.  If he OKed you to write your thesis, then he must be satisfied with what you have accomplished.  If you have not spoken with him, you need to do that immediately. Tell your advisor what you've done and flat out ask him if that is enough.  It's in his best interest to tell you the truth, since it looks bad on him if he does end up failing you.  Can you show him your work and have him give you corrections? (the rules on this seems to change from one dept to another).  Other things to know: Does he have a minimum number of pages he requires for your to write? Does he want you to include/discussed procedures that failed? Does he feel you need a minimum amount of publications before you write your thesis?  The only way to know for sure is to talk to him.  That will answer all the questions you have about your particular situation WAY better than anyone on Quora can. Good luck!  ",
            "date": "Answered February 1, 2016",
            "views": "944",
            "upvotes": " View 7 Upvoters",
            "upvoters": [
                {
                    "user_id": "Colin Jensen",
                    "user_href": "/profile/Colin-Jensen"
                },
                {
                    "user_id": "Sameer Gupta",
                    "user_href": "/profile/Sameer-Gupta"
                },
                {
                    "user_id": "Kousik Krishnan",
                    "user_href": "/profile/Kousik-Krishnan"
                },
                {
                    "user_id": "David Belair",
                    "user_href": "/profile/David-Belair"
                },
                {
                    "user_id": "Debra Klopfenstein",
                    "user_href": "/profile/Debra-Klopfenstein"
                },
                {
                    "user_id": "Joel Goldstein",
                    "user_href": "/profile/Joel-Goldstein-7"
                },
                {
                    "user_id": "Tom McNamara",
                    "user_href": "/profile/Tom-McNamara-4"
                }
            ]
        },
        {
            "author_info": {
                "name": "Jay Bazzinotti",
                "href": "/profile/Jay-Bazzinotti"
            },
            "answer_text": "There are many things in life that are DECEPTIVELY simple and yet defy common explanation. Water, for example, is one of the rare things that expands when it freezes while other things contract when they get cold. Other things in life seem contrary to common sense. Scientists sometimes spend years trying to find the underlying reasons why simple things are the way they are. Just because something looks simple does not mean it is simple. It was not more than 150 years ago that people firmly believed that things like \"bad air\" caused infection and disease and that rotting meat somehow \"created\" maggots. A simple experiement that a five year old could figure out and devise (put a screen around one piece of meat and leave the other in the open air) would prove the truth in a matter of hours or days. Just because something appears to be simple does not make it so. You need to include a measure of showmanship and marketing in your thesis to underscore these truths. You need to search for suitable examples. And of course you need to play up the intense amount of time-consuming data collecting research with the requisite number of dead ends, red herrings and failed hypotheses that occurred before the arrival at the ultimate conclusion, which you have drawn QED.  The fact that something is simple doesn't mean the explanation of how and/or why it exists or occurs at all is simple. Proving it is something different altogether. The Four Color Theorem is a case in point. In the 1800s there was a raging scientific debate taking much time and space in journals about the minimum number of colors needed on a map to separate all the countries such that two of the same colors never touched each other at a country's border. Careers were made and broken. Some scientists claimed it could not be done with less than five colors; some said four was sufficient. But it wasn't until 1976 that a conclusive proof was made. Something as simple as coloring a map with crayons took on extraordinary interest in science. Your paper must be made to appear to follow the same situation. It seems simple - your job is to explain why obtaining the result was not simple.  ",
            "date": "Answered February 1, 2016",
            "views": "13",
            "upvotes": " View 6 Upvoters",
            "upvoters": [
                {
                    "user_id": "Carmen Hernandez",
                    "user_href": "/profile/Carmen-Hernandez-406"
                },
                {
                    "user_id": "Raymond Deng",
                    "user_href": "/profile/Raymond-Deng-3"
                },
                {
                    "user_id": "Pranay Handa",
                    "user_href": "/profile/Pranay-Handa-1"
                },
                {
                    "user_id": "David Belair",
                    "user_href": "/profile/David-Belair"
                },
                {
                    "user_id": "Tom McNamara",
                    "user_href": "/profile/Tom-McNamara-4"
                },
                {
                    "user_id": "Cody Cook",
                    "user_href": "/profile/Cody-Cook-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "John Kennedy",
                "href": "/profile/John-Kennedy-151"
            },
            "answer_text": "I dont know what your thesis is but i have a few questions. 1. Does it need to be complicated? That you can summarize it so simply could be a good thing. You can demonstrate the work youve done with all the supporting evidence it sounds like you will have accumulated through your hard work.  2.Can you explain it easily because its obvious and self evident or because you understand it so well?  3.Do you understand it so clearly now because of all the work you've done? Anything can be easy if you know how to do it. Talk to your proffesseur and you still have time to sort it out if theres anything actually wrong.  ",
            "date": "Answered February 1, 2016",
            "views": "93",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Tom McNamara",
                    "user_href": "/profile/Tom-McNamara-4"
                }
            ]
        },
        {
            "author_info": {
                "name": "Kit Watson",
                "href": "/profile/Kit-Watson"
            },
            "answer_text": "Start by talking to your professor and showing him where you are up to. You have a month to write things up, so you're in good time to make changes.  Remember that you can include failures and errors if you explain them properly e.g. \"We initially tried doing X because Y, but we discovered that...\" Good luck! ",
            "date": "Answered February 1, 2016",
            "views": "112",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Marnanel Thurman",
                    "user_href": "/profile/Marnanel-Thurman"
                }
            ]
        }
    ]
}