{
    "title": "People say I have a bad tone of speaking. What should I do? - Quora",
    "tags": [
        "Social Advice",
        "Understanding Human Behavior",
        "Interpersonal Interaction"
    ],
    "response": [
        {
            "author_info": {
                "name": "Christina Watson",
                "href": "/profile/Christina-Watson-58"
            },
            "answer_text": "I am guilty of this. It requires me to realize it . Sometimes someone has to point it out to me. I am a very passionate person, very strong willed. I've lived my life, always having to proove myself. It makes me become defensive. It makes my thinking become confused. I've been forced to be responsible for others. I tend to sound forceful, too direct and sometimes it comes out sounding mean or hateful. I'm very loyal, protective, too direct with my wordings, it comes out sounding bossy or harsh, and even sometimes controlling. And then I have a loving side, a caring side, a giving side, a protective side, a nurturing side, emotional and extremely sentimal side, a feminine side. I'm still trying to balance all of these. I'm trying to blend them all together. To understand myself. I'm a work in progress, so to speak. I know that I need to work on this individually, in order to change to become a better me! Time, faith, hope, belief ,and acceptance of this is, and trusting that I will accomplish this is helping me to change now. To show more of my feminine side. Because if I don't make those changes… I will never gain or learn to be a better person for myself or for anyone else in my life. I know that I can do it, it just going to take me one step at a time, changing my perceptions, adjusting my thinking and overthinking and working towards becoming who I truly want to be. Someone special in my life, made me realize this, and it has changed my perspective and my thinking alot in the last few months. It made me challenge myself to become a better, stronger, wiser and feminine ME! And sometimes people care enough to help you along the way. To show you that they know you better than you know yourself, because they saw, felt and cared enough about you, to get you to understand who you are. I understand that now, I realize it, and I am willing, open to it, and have been working on this for quite some time now. This was my lesson that I had to learn, accept, think about and to CHANGE. Because I know that if I don't, I will end up alone, miserable, hateful, spiteful, vindictive and lonely. And that is NOT who I am or who I want to become. And I am trying to change this now, even as I am answering this question, I am showing my softer,vulnerable and feminine side. ",
            "date": "Answered November 23, 2018",
            "views": "11",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Kerry Newport",
                    "user_href": "/profile/Kerry-Newport"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/Reg-O-5"
                }
            ]
        },
        {
            "author_info": {
                "name": "Martha Katherine",
                "href": "/profile/Martha-Katherine"
            },
            "answer_text": "When people say this to you, are you typically in a bad mood? Usually, your tone of voice will reflect your emotion. So perhaps finding what puts you in a good mood will help your tone of voice improve. During one of my communication classes in college, the professor recommended video taping a speech. This was helpful in that whenever I was happy, I could see and hear the positive emotion. When I showed the video to a close friend, she said that my tone was very upbeat. ",
            "date": "Answered December 16, 2018",
            "views": "450",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Kerry Newport",
                    "user_href": "/profile/Kerry-Newport"
                }
            ]
        }
    ]
}