{
    "title": "Resume for a SAT tutor? - Quora",
    "tags": [
        "Tutoring",
        "Ad Networks, Ad Exchanges and Ad Services",
        "SAT (Scholastic Assessment Test)"
    ],
    "response": [
        {
            "author_info": {
                "name": "Cynthia Ward Hemminger",
                "href": "/profile/Cynthia-Ward-Hemminger"
            },
            "answer_text": "When they asked for an information sheet about your services, they weren't just asking about your qualifications. When people look for an SAT tutor they will also want to know:  What do you charge?  Where will the tutoring take place (the student's home? the local library?) What approach do you take?  Some SAT tutors just help the student with practice problems. Some have a curriculum they follow. Some do a form of assessment and then design a study plan based on the results. What will you do?How long should the student expect to see you? Some tutors recommend a certain number of sessions.Do you guarantee that the student will get a higher score after seeing you? What would happen if he doesn't? As you think about these things, you will also want to examine the tutoring services already available in your area? What do they offer? What niche is available for you? You want to make sure that your pricing is appropriate compared to other tutors given what you plan to offer. Ask the high school to show you the information sheets they have for the other tutors on their list. I notice some of the other answers are focused on what you should do to gain teaching experience, and that is important. However, I think you can begin to tutor without a lot of prior teaching experience as long as you are upfront about your qualifications and cheap relative to the more qualified options available. Some students really only need someone to help them with the more difficult practice problems and you should be able to do that just fine. ",
            "date": "Answered December 24, 2012",
            "views": "939",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Stefano Campagna",
                    "user_href": "/profile/Stefano-Campagna"
                }
            ]
        },
        {
            "author_info": {
                "name": "Andrew Magliozzi",
                "href": "/profile/Andrew-Magliozzi"
            },
            "answer_text": "Karan, thanks for sharing your question.  Sounds like you're an enterprising young student.  Your story reminds me a lot of how I got started tutoring 15 years ago.   First and foremost, I would encourage you not to discount your reputation in the community as a scholar and informal instructor.  You have high scores and are likely a bright young man.  It's not unlikely that you'll get a few SAT clients on your reputation and personal networking.   Before becoming a professional tutor, however, I would encourage you to hone your skills, broaden your experience, and build your reputation with some volunteer tutoring services.  Tutoring is a reputation-based business.  That means it is hard to get started but easy to grow if you continue to do good work and have satisfied clients who will spread the word about your talents.  I tutored more than 300 hours pro-bono to friends and classmates before my first paying client.  Now, I've got over 3,500 hours of one-on-one teaching experience. The best thing you can do early on is find people willing to be your champions and refer your services to others.  Do you have friends whose younger siblings could use some SAT prep?  If so, give them a discount and encourage them to tell their friends.  If that's difficult, see if you can arrange a few free lessons at the local library.  If you make yourself available to teach for free, someone will be willing to learn.  Good luck! ",
            "date": "Answered November 12, 2012",
            "views": "916",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Tim Urban",
                    "user_href": "/profile/Tim-Urban"
                }
            ]
        },
        {
            "author_info": {
                "name": "Alison Johnston",
                "href": "/profile/Alison-Johnston"
            },
            "answer_text": "While having high SAT scores yourself is important, you should also be ready to highlight your teaching experience. Have you tutored other academic subjects? Did you help your friends prepare the SAT? Did you grow up helping younger siblings with homework? It may make sense to volunteer to tutor your first customer, or at least offer a satisfaction guarantee for all your students. Track score improvements closely so you can use them as proof points for what an awesome SAT tutor you are. If you haven't already, you should also think about how you can most effectively put together a prep course and what you want to charge. (It may make sense to have a few options.) Are you going to work out of a prep book? Will you administer practice tests throughout the prep period? For greater distribution beyond the school, check out tutor listing sites like Wyzant and Tutorspree. They'll take a small cut of your earnings, but may be able to get you more exposure. Or consider tutoring online; InstaEDU is always looking for great tutors. ;) ",
            "date": "Answered November 12, 2012",
            "views": "11",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Jessica Su",
                    "user_href": "/profile/Jessica-Su"
                }
            ]
        }
    ]
}