{
    "title": "Should a husband tell his wife when he had an affair? - Quora",
    "tags": [
        "Husbands",
        "Infidelity and Adultery",
        "Marriage"
    ],
    "response": [
        {
            "author_info": {
                "name": "Val Lynson",
                "href": "/profile/Val-Lynson"
            },
            "answer_text": "I’m reading all of these comments… I’ve been the cheated on spouse… I’ve also since (regrettably) been the mistress. you just tell her. Don’t dump details in her. If she asks for more, be honest. Offer to go to counseling if you want to stay. If you want to leave, don’t hide that either. Make sure she knows it wasn’t her fault. people knew that my ex was cheating on me for years and never told me!! I had suspected for years and he always downplayed those fears of mine as if I was crazy. I wish I had known far sooner. I wish the choice to stay or go had been left in my hands much sooner. He knew cheating was my big deal breaker. I was hurt far more deeply by knowing others let me continue on in that relationship without telling me what he was up to. I feel like i was robbed of years of my life. did it hurt to find out he had been cheating? Yes. You want to believe people won’t do that. But they do. Some do it constantly. It’s a way of life for them. Some do it because the stars aligned at the wrong time. But at any rate I don’t want to be with someone who doesn’t want to be fully with me. be prepared for her to tell you to get out or to insist she needs time apart at bare minimum. Be prepared that if she wants to work on things, she’s going to make many demands on you-and she’s completed entitled to do so if you want to stand any chance of her forgiving you and moving forward with you. Things will be on her terms for awhile, until she’s comfortable. Make sure you offer up tearing down any sort of walls there-give her passwords, allow her access to computers, phones, etc any time she wants them. You will need to prove that you are seriously remorseful and want to do absolutely anything it takes to win her back. sure, some may not want to know. Ignorance is bliss in their heads, but even when I suspected my ex was cheating, but I didn’t want to know, so when I saw scratches on his back and he excused them with absurd things, I took that and forced myself to believe it. I gained weight. I didn’t know what I was here for. I lost sight of myself entirely. I didn’t want to believe that he would cheat, but deep down I knew what was up and it was tearing me apart!! So not knowing for, gosh, 5 years tore me apart (or more-I has suspicions shortly after we got together! I buried those deep down…. Didn’t have any real proof, just a gut feeling and some things he did that were things that he knew bothered me. Like he didn’t have any respect for who I was at all, how far would he take it??) I was constantly stressed, dizzy, putting on weight, just losing myself entirely. When he walked out and then confirmed my long lasting suspicions of his cheating, I was actually relieved. I knew all of the crap I had been feeling and going through was real. And my conscience was clean. His wasn’t. ",
            "date": "Answered January 25, 2020",
            "views": "29",
            "upvotes": " View 18 Upvoters",
            "upvoters": [
                {
                    "user_id": "Jeff Wise",
                    "user_href": "/profile/Jeff-Wise-23"
                },
                {
                    "user_id": "Gabby Monge",
                    "user_href": "/profile/Gabby-Monge-2"
                },
                {
                    "user_id": "Alexis Pruitt",
                    "user_href": "/profile/Alexis-Pruitt"
                },
                {
                    "user_id": "Richard Burton",
                    "user_href": "/profile/Richard-Burton-174"
                },
                {
                    "user_id": "Mari Smith",
                    "user_href": "/profile/Mari-Smith-70"
                },
                {
                    "user_id": "Anna Zammit",
                    "user_href": "/profile/Anna-Zammit-6"
                },
                {
                    "user_id": "Ashley Kaercher",
                    "user_href": "/profile/Ashley-Kaercher-2"
                },
                {
                    "user_id": "Jojo Miller",
                    "user_href": "/profile/Jojo-Miller-12"
                },
                {
                    "user_id": "Carrie Mcdonald",
                    "user_href": "/profile/Carrie-Mcdonald-9"
                },
                {
                    "user_id": "Yanislava Dinkova",
                    "user_href": "/profile/Yanislava-Dinkova"
                }
            ]
        }
    ]
}