{
    "title": "Should you write a thank you letter for a salary increase? How should you write it? - Quora",
    "tags": [
        "Thank You Letter",
        "Salary Increase"
    ],
    "response": [
        {
            "author_info": {
                "name": "Luis Hefner",
                "href": "/profile/Luis-Hefner"
            },
            "answer_text": "If your salary increase has been in the works for weeks or even months, saying \"thank you\" to your boss or writing a thank-you note is a kind and professional gesture. Choose your words carefully, however. Avoid saying something like, \"At last, my raise becomes effective and I'm glad you finally pushed it through the HR channels.\" Wording like that may sound like a backhanded compliment for the hoops your boss may have jumped through to get the approval for your raise. The same is true for a raise you believe isn't enough, based on your performance and other factors that affect your pay. Be gracious and simply say, \"Thank you for the recent salary increase. I looking forward to greater financial rewards as my tenure with the company increases.\" Write a thank-you note that expresses deep appreciation for a salary increase that's more than what you expected – especially if it's above what you asked for or what the compensation structure allows. You needn't go overboard and gush about the amount, but you could say, \"I deeply appreciate the salary increase you gave me. I'm pleased that you and the organization value my achievements and contributions with such a generous pay raise. Thank you.\" As much as they would like to do so, many employers aren't in a position to give salary raises. They may try to recognize your performance in other ways, but if your employer's is experiencing a downturn in business, yet still finds a way to reward you, a thank-you is in order. In these circumstances, you could write, \"Thank you for the recent salary increase. I appreciate your confidence and generosity, particularly during a time when the organization has had some economic setbacks. Also, thank you for the opportunity for allowing me to be a part of your team.\" More hints ",
            "date": "Answered January 20, 2018",
            "views": "60",
            "upvotes": " View 8 Upvoters",
            "upvoters": [
                {
                    "user_id": "Ekansh Maithil",
                    "user_href": "/profile/Ekansh-Maithil"
                },
                {
                    "user_id": "Kelly Tho",
                    "user_href": "/profile/Kelly-Tho"
                },
                {
                    "user_id": "Lawal Sherif",
                    "user_href": "/profile/Lawal-Sherif-1"
                },
                {
                    "user_id": "Barsa Rani",
                    "user_href": "/profile/Barsa-Rani-1"
                },
                {
                    "user_id": "Kate Feld",
                    "user_href": "/profile/Kate-Feld-1"
                },
                {
                    "user_id": "Nagarajan Rajamanickam",
                    "user_href": "/profile/Nagarajan-Rajamanickam-1"
                },
                {
                    "user_id": "Odudu Ndabuk",
                    "user_href": "/profile/Odudu-Ndabuk"
                },
                {
                    "user_id": "Eniola Cole",
                    "user_href": "/profile/Eniola-Cole-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Jamie Thomas",
                "href": "/profile/Jamie-Thomas-18"
            },
            "answer_text": "Whether to write a letter depends on the situation - a cost-of-living increase doesn’t need a thank-you note, but a performance-based increase or bonus might. If you do write one, stick to the basics: greeting, gratitude, specifics, look ahead, restate gratitude, close. So, something like, “Dear Jim, Thank you for the recent salary increase. I appreciate this recognition of my work. I look forward to continuing to progress here at Company. Thanks again, Marco.” ",
            "date": "Answered November 27, 2016",
            "views": "905",
            "upvotes": " View 22 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Sarwat Hashmi",
                    "user_href": "/profile/Sarwat-Hashmi-2"
                },
                {
                    "user_id": "Khairul Azlan",
                    "user_href": "/profile/Khairul-Azlan-16"
                },
                {
                    "user_id": "Daniel Akokodaripon",
                    "user_href": "/profile/Daniel-Akokodaripon"
                },
                {
                    "user_id": "Harish.d.k Dk",
                    "user_href": "/profile/Harish-d-k-Dk"
                },
                {
                    "user_id": "Mohammed Mokhim",
                    "user_href": "/profile/Mohammed-Mokhim"
                },
                {
                    "user_id": "Chaitanya Gangane",
                    "user_href": "/profile/Chaitanya-Gangane"
                },
                {
                    "user_id": "Mukesh Babre",
                    "user_href": "/profile/Mukesh-Babre-1"
                },
                {
                    "user_id": "Jenny Choudhary",
                    "user_href": "/profile/Jenny-Choudhary-2"
                },
                {
                    "user_id": "Yoka Dawood",
                    "user_href": "/profile/Yoka-Dawood"
                },
                {
                    "user_id": "Suyash Gulati",
                    "user_href": "/profile/Suyash-Gulati-1"
                }
            ]
        }
    ]
}