{
    "title": "Should you write for an audience or with someone in mind even if it changes the story you write? - Quora",
    "tags": [
        "Creative Writing",
        "Writing Advice"
    ],
    "response": [
        {
            "author_info": {
                "name": "Just Rama",
                "href": "/profile/Just-Rama"
            },
            "answer_text": "There’s not really a one-size-fits-all answer to this one. Extroverts often find it much easier to write very deliberately to an audience, even to a specific person—like having a conversation—while introverts may slip away into their private imaginary worlds to write. I seem to remember Vladimir Nabokov saying he wrote to a generalized idea of a very sophisticated and intelligent older woman, and even though I’m an introvert of the “secret imaginary world” variety, one of my most enjoyable writing experiences was writing a young adult novel very specifically for a young writer (and friend) who read my drafts at the end of every day’s writing. I’m pretty sure the only way to solve any writing problem or answer any writing question is not to think too much about it but to write your way through it. Experiment—try writing today while keeping someone specific in mind and tomorrow by closing the door to your fantasy world behind you and keeping everyone out. For every writer, and even for the same writer with every different project, you may get a different answer. ",
            "date": "Answered December 15, 2019",
            "views": "23",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Simonetta Raymon-Barker",
                "href": "/profile/Simonetta-Raymon-Barker"
            },
            "answer_text": "Anything one writes, if it is to be published is for the public to read. eg. An audience. Also, more often than not, story's are baced on certain characters, beit yourself or someone close to you or other participants that play a role in the story. What's important to remember when one writes is to translate your thoughts and facts in a manner that flows so the readers get a concise understanding of what your trying to deliver. What changes the story is, whether you write it in the first person as in an Autobiography or in the third person. Whether is fiction as in your imagination or fact, as in a true story. ",
            "date": "Answered December 15, 2019",
            "views": "18",
            "upvotes": "0"
        }
    ]
}