{
    "title": "Should I write a journal or diary? - Quora",
    "tags": [
        "Self-Help Writing",
        "Diaries and Journals",
        "Writing"
    ],
    "response": [
        {
            "author_info": {
                "name": "Praveen",
                "href": "/profile/Praveen-245"
            },
            "answer_text": "Depends on why you want to write a personal diary. I write atleast 30 minutes a day in my diary. Nowadays i cannot control my overwhelming thoughts, so I switched to notepad (I did not get a chance to doodle,but it is fine). A) Journal writing is not a significant effort - You are capturing your own life. It does not mean that it has to be perfect and writing with quality. Just start with 10 minutes a day. Find a quite spot and write your diary. (I usually write diary when i am commuting to office/home!). B) Time - I don’t think time is an issue. Just start writing 10 minutes a day. That’s it. Nothing more nothing less. In those 10 minutes, recall how much you want to recall and then write it down. Make time, may be don’t watch TV. Reduce something else so that you find time for writing diary. C) Writing quality - once you have started writing. Over time your writing will get better (if you review it on a weekly basis!). It is fine even if you don’t review it, just get the writing practice flowing. Don’t aim for quality, but aim for quantity. The more you write, more data you have for analysis. D) Time taken to complete one page - I don’t track the time taken to complete a page. Somedays thoughts are flowing, i will write/type a lot of words (1000 words). Some days my entry will contain less than 250 words. Just stay at this habit. Things will improve. E) Switching from diary to journal - My notepad is my diary & journal. As long as you write and do a weekly review. You can better yourself. More on journalling Praveen's post in Lets Have fun ",
            "date": "Answered September 10, 2016",
            "views": "756",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Rupesh Routray",
                    "user_href": "/profile/Rupesh-Routray"
                },
                {
                    "user_id": "Rohith Bhardwaj",
                    "user_href": "/profile/Rohith-Bhardwaj"
                }
            ]
        },
        {
            "author_info": {
                "name": "Eddy Acuna",
                "href": "/profile/Eddy-Acuna"
            },
            "answer_text": "I personally write in a journal. The time it takes to write an entry varies depending on what it is I'm writing about. I don't over think it. I let my thoughts just flow freely and talk naturally without censoring myself. I'm just myself. I find that it allows one to be genuine in writing. I would recommend trying out journal writing and write as much as you can when you can. Just make the goal to write often, even if it's just snippets here and there. Trust me, you don't have to write huge lengths to write something that will be of value to you later on. Being wordy isn't necessarily better. Just be genuine in everything you write and it will capture who you are. At times I find that writing a Diary can be more time consuming than journal writing. Journal writing also doesn't have to be an every day thing either, but it's great if you do do it that way. ",
            "date": "Answered April 24, 2016",
            "views": "544",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Rana Balmiki",
                    "user_href": "/profile/Rana-Balmiki"
                }
            ]
        },
        {
            "author_info": {
                "name": "Timothy Mailloux",
                "href": "/profile/Timothy-Mailloux"
            },
            "answer_text": "I was just researching \"the pros and cons\" of writing a daily JOURNAL\". Mostly it is beneficial to write one but I see one problem: If your life is full of ups and downs, you may just be counseling yourself in the wrong direction. For example you may just reinforce negative attitudes like \"I am just different from the rest\" or people are just going to continue to disappoint me\". Overtime these negative reinforcements will imprint irreversible walls of imprisonment on your mind. Then you might consider exposing the journal to another for advice which probably is Taboo in the Society of JOURNAL Writers (I made that up :).But overall I think it is a great idea to write a journal and I wish I had started one years ago. ",
            "date": "Answered August 27, 2015",
            "views": "861",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Mukul Tiwari",
                    "user_href": "/profile/Mukul-Tiwari-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "John R. Buckley",
                "href": "/profile/John-R-Buckley"
            },
            "answer_text": "Never write down what you don't want someone else to read. I use LiveJournal.  It's easy, online, and has many features.  I also have a real paper book journal... which I never use. Just be cautious, employers are more than ever using whatever you say against you during the hiring or promotion process.  The world is full of critics, trolls, and judgmental people. If you care less what others think, do what you want. If you plan to use a paper book journal just remember those are usually around long after you pass away. If you use an electronic journal be wary of how you use it and who can read it. I have found expressing myself through a diary very very therapeutic throughout my life. ",
            "date": "Answered March 1, 2014",
            "views": "836",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Jayashree Ishwar",
                    "user_href": "/profile/Jayashree-Ishwar-1"
                },
                {
                    "user_id": "Tony Annechino",
                    "user_href": "/profile/Tony-Annechino"
                },
                {
                    "user_id": "Alpha Lim",
                    "user_href": "/profile/Alpha-Lim"
                }
            ]
        },
        {
            "author_info": {
                "name": "Barbara Carleton",
                "href": "/profile/Barbara-Carleton"
            },
            "answer_text": "You might consider combining the two.In a full page notebook, designate the top 1/4th of the page for your diary entries.  Brief notes, important experiences, etc.The remainder of the page (and subsequent pages, as needed) could be devoted to a more comprehensive record of your thoughts and feelings and questions about the events noted above.   As for the time required, one can develop a 'short hand' style of writing than need not make sense to anyone but yourself.  Or even encrypted symbols if you feel the need to protect your privacy.The number and frequency of entries is secondary to the value of the recorded content. ",
            "date": "Answered March 1, 2014",
            "views": "144",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Rupesh Routray",
                    "user_href": "/profile/Rupesh-Routray"
                },
                {
                    "user_id": "Hamidsl",
                    "user_href": "/profile/Hamidsl"
                }
            ]
        },
        {
            "author_info": {
                "name": "Sid Kemp",
                "href": "/profile/Sid-Kemp"
            },
            "answer_text": "I strongly recommend writing every day, and going beyond a simple diary into some kind of journal. Instructions in The Artists Way by Julia Cameron for what she calls Morning Pages are a great start.  Commit to a minimum and a goal. The best minimum is one true sentence, even if it is just \"I don't want to write today.\" You can then set a goal, such as 15 minutes or 500 words. Back in 2006 or so, I wrote a minimum of 500 words a day in my journal. Now I am a professional writer - my life dream. Writing comes with practice. Wisdom comes from intelligent introspection. Write away, right away! ",
            "date": "Answered April 10, 2016",
            "views": "415",
            "upvotes": " View 5 Upvoters",
            "upvoters": [
                {
                    "user_id": "Anushka Karlekar",
                    "user_href": "/profile/Anushka-Karlekar"
                },
                {
                    "user_id": "Archana Gurijala",
                    "user_href": "/profile/Archana-Gurijala"
                },
                {
                    "user_id": "Monique V",
                    "user_href": "/profile/Monique-V-4"
                },
                {
                    "user_id": "Rohith Bhardwaj",
                    "user_href": "/profile/Rohith-Bhardwaj"
                },
                {
                    "user_id": "Cemil Raman",
                    "user_href": "/profile/Cemil-Raman"
                }
            ]
        },
        {
            "author_info": {
                "name": "Alpha Lim",
                "href": "/profile/Alpha-Lim"
            },
            "answer_text": "Most definitely. To overcome the tyranny of the blank page, simply commit to just write one sentence a day. Of course, you'll find that you end up writing much more than that most of the time. Almost all the time, in fact.  The self reflection and self discovery that a journal provides to you is invaluable in improving yourself and your life. I highly recommend it. Nevertheless, if the keeping of a journal becomes so overbearing that it cripples you, then it defeats its purpose and you might want to try some other means of introspection. (Although, I can't imagine a better one.) ",
            "date": "Answered March 10, 2014",
            "views": "106",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Sheri Fresonke Harper",
                    "user_href": "/profile/Sheri-Fresonke-Harper"
                }
            ]
        },
        {
            "author_info": {
                "name": "Radhika",
                "href": "/profile/Radhika-182"
            },
            "answer_text": "I recently started to write. Its a small pocket diary and I write every now and then - a line or a page at once. I feel easy and connected to myself more. Its like being aware of whats happening. I often go back and do a quick read and it helps me to calm down or make better decision. Maybe you can give it a try, with a pocket diary which lets you write when you want to. ",
            "date": "Answered April 2, 2017",
            "views": "145",
            "upvotes": "0"
        }
    ]
}