{
    "title": "Should I hand-write or type an essay? - Quora",
    "tags": [
        "Essays",
        "Writing Advice"
    ],
    "response": [
        {
            "author_info": {
                "name": "Sarah Bowman",
                "href": "/profile/Sarah-Bowman-28"
            },
            "answer_text": "You should use whichever method is easier for you or comes more naturally. The purpose of the essay is probably not to look professional or personal but to show the judges some aspect of your sincerity or need or ability. I have never been a judge on a scholarship panel so I don’t know what they look for but I have applied for scholarships. Following the instructions is important. Guessing at their motives for the instructions is futile. Just get busy writing; meeting that deadline is important and so is qualifying and following instructions. ",
            "date": "Answered March 31, 2017",
            "views": "572",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Kim Wozencraft",
                "href": "/profile/Kim-Wozencraft"
            },
            "answer_text": "Definitely type it. Remember that the people who will be reading your essay will be reading many, many essays and the easier you can make it on their eyes, the better it will be for you. Even if your handwriting is gorgeous, it is easier to read typewritten essays than handwritten ones. If you are more comfortable handwriting, then by all means hand write your first draft, but then find a computer and type it out. Use at least 1.5 line spacing, 12 point font, preferably in an easy-to-read font, such as Times New Roman. Use one inch margins on the sides, top, and bottom of the page. Don’t pack the page with text. Make it easy on the eyes. Good luck! ",
            "date": "Answered April 3, 2017",
            "views": "792",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Bartholomew B",
                "href": "/profile/Bartholomew-B"
            },
            "answer_text": "Given this scenario, if you feel that your hand writing is neat and grammar up to par, I think that hand written application will stand out. When I think about your question, I asked myself: Considering that computers are readily available why give the hand written option. But than again, I’m prbobly overthinking this. Food for thought - Handwriting in itself can reveal personality and traits. Wish you best of luck! ",
            "date": "Answered April 3, 2017",
            "views": "592",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Leif Sann",
                    "user_href": "/profile/Leif-Sann"
                }
            ]
        },
        {
            "author_info": {
                "name": "Mamun ur Rashid",
                "href": "/profile/Mamun-ur-Rashid-5"
            },
            "answer_text": "In my point of view, you should type it. you can easily make it look more professional if you type it. There can be some issues of proof reading or correction. you can do it easily when you will type it. On the other hand it gonna take too much toil to get a good professional look hand written essay… ",
            "date": "Answered March 30, 2017",
            "views": "170",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Thomas Rahm",
                "href": "/profile/Thomas-Rahm-1"
            },
            "answer_text": "Really depends on what your writing for,if your trying to show that you can type with profiency for a college application then typing would be best,however if your writing to show your personality or that you want extra meaning on what your writing then handwritten is a good idea in practice discern what and who your writing for. ",
            "date": "Answered April 3, 2017",
            "views": "621",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Stan Loz",
                "href": "/profile/Stan-Loz"
            },
            "answer_text": "I would hand-write it. One, for the fact that I like to do things a little differently. Besides, it will also indicate that you are willing to do some hard work. You want to get as much points as possible, and hand-writing your application in my opinion should add some points in your basket. ",
            "date": "Answered March 31, 2017",
            "views": "215",
            "upvotes": "0"
        }
    ]
}