{
    "title": "Should I explain the low grades in my statement of purpose? - Quora",
    "tags": [
        "Personal Statements"
    ],
    "response": [
        {
            "author_info": {
                "name": "Scott E. Fahlman",
                "href": "/profile/Scott-E-Fahlman"
            },
            "answer_text": "A2A: If there was one really disastrous semester, and if there was a really good reason for it (had a baby, terrible illness during finals week, etc.) then maybe add one sentence to your SOP explaining that. Otherwise, I agree with the other answers here: don’t highlight shortcomings that might not even be noticed, and that are clearly outliers from your overall performance. In our review process (in CMU’s School of Computer Science), I often see comments from other evaluators like, “This guy got a C- in ‘Algorithms and Data Structures’ (a very central course for a CS person), but all his other CS grades are solid, and his research project shows that he has a solid working knowledge of this stuff. So that must just have been a bad week.” So if the problem is not too egregious, we are prepared to notice and forgive a bad result or two. In your case, a 3.5/4 GPA would be a little bit low for a top program like ours, but not so low that an excellent research record and good letters could not overcome it. And one 3.0 semester is not too disgraceful as part of the overall package. I imagine that the standards in top OR programs are similar. All that said, if in the course of your bad semester you failed (or even got a C) in a course that is central to the gad program you are applying to, you really should make sure that you know this stuff, and do something on your record to show that you do — take and ace a follow-on course, use the material in some project, or whatever. That makes it much easier for the committee to give you the benefit of the doubt. Added later: Yes, as Loretta B DeLoggio suggests, if there is good reason to include an explanation, it sounds a lot better (less defensive) coming from from one of your letter writers than coming from you in the SOP. ",
            "date": "Answered November 11, 2016",
            "views": "74",
            "upvotes": " View 27 Upvoters",
            "upvoters": [
                {
                    "user_id": "Abdurahman Jamoliddinov",
                    "user_href": "/profile/Abdurahman-Jamoliddinov"
                },
                {
                    "user_id": "Anshul Dalal",
                    "user_href": "/profile/Anshul-Dalal"
                },
                {
                    "user_id": "Shoumi Sarkar",
                    "user_href": "/profile/Shoumi-Sarkar"
                },
                {
                    "user_id": "Jack Kellerk",
                    "user_href": "/profile/Jack-Kellerk-1"
                },
                {
                    "user_id": "Karthik Subramani",
                    "user_href": "/profile/Karthik-Subramani-32"
                },
                {
                    "user_id": "Yiping Ma",
                    "user_href": "/profile/Yiping-Ma-5"
                },
                {
                    "user_id": "Al Simmons",
                    "user_href": "/profile/Al-Simmons-27"
                },
                {
                    "user_id": "Amanpreet Singh",
                    "user_href": "/profile/Amanpreet-Singh-520"
                },
                {
                    "user_id": "Nihit Munakala",
                    "user_href": "/profile/Nihit-Munakala"
                },
                {
                    "user_id": "Mark Black",
                    "user_href": "/profile/Mark-Black-2"
                }
            ]
        },
        {
            "author_info": {
                "name": "Loretta B DeLoggio",
                "href": "/profile/Loretta-B-DeLoggio"
            },
            "answer_text": "Since Scott E. Fahlman is obviously a person who reads these SOP’s, as is Dr. James Leland Harp , I would follow their advice most of the time. I would make an exception if the reason for the low grades were not apparent. If you attempted six difficult courses and got lower grades, the reader is likely to chuckle and say, “Well, he learned his lesson,” and continue reading the file. You should only explain if the person’s going to be upset or confused: “Three courses and D’s in all of them?” might require an explanation. Even so, it shouldn’t be in the SOP. You can include a brief addendum, or one of your recommenders who knows you well could mention: “Richard has generally been an excellent student; he really should have taken a leave of absence the semester he broke his leg, but he insisted on trying to continue with his classes. It may not have been the best judgment, but is evidence of the kind of dedication he shows.” ",
            "date": "Answered November 11, 2016",
            "views": "26",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Sai Kiran",
                    "user_href": "/profile/Sai-Kiran-30"
                },
                {
                    "user_id": "Urwa Shabir",
                    "user_href": "/profile/Urwa-Shabir"
                }
            ]
        },
        {
            "author_info": {
                "name": "Shriram Krishnamurthi",
                "href": "/profile/Shriram-Krishnamurthi"
            },
            "answer_text": "Yes, but keep it brief. Nobody wants to read a long sob story. If there is a good reason, tell us about it. Note that this can address one or two semesters but not a pattern of poor performance. Indeed, if it’s just one semester, usually a committee will overlook it unless it was a key semester (e.g., the one semester when you took all the core courses in your subject). In general, one semester won’t make or break an admission: there are lots of inputs and even the GPA is but one of them. In short: if you have a compelling argument, feel free to say it, but please keep it short. Note that, per my policy, I don’t get into specifics of cases, so I’m ignoring the details of the actual GPAs, etc. ",
            "date": "Answered December 7, 2016",
            "views": "81",
            "upvotes": " View 29 Upvoters",
            "upvoters": [
                {
                    "user_id": "Rohan Sogani",
                    "user_href": "/profile/Rohan-Sogani-1"
                },
                {
                    "user_id": "Ishita",
                    "user_href": "/profile/Ishita-152"
                },
                {
                    "user_id": "Karthik Subramani",
                    "user_href": "/profile/Karthik-Subramani-32"
                },
                {
                    "user_id": "Himanshu Kumar",
                    "user_href": "/profile/Himanshu-Kumar-166"
                },
                {
                    "user_id": "Kevin Zheng",
                    "user_href": "/profile/Kevin-Zheng-97"
                },
                {
                    "user_id": "Carlos Oliveira",
                    "user_href": "/profile/Carlos-Oliveira-31"
                },
                {
                    "user_id": "Bachar Elzein",
                    "user_href": "/profile/Bachar-Elzein"
                },
                {
                    "user_id": "Sai Kiran",
                    "user_href": "/profile/Sai-Kiran-30"
                },
                {
                    "user_id": "Rohit Dwivedula",
                    "user_href": "/profile/Rohit-Dwivedula"
                },
                {
                    "user_id": "Esteban Madrigal",
                    "user_href": "/profile/Esteban-Madrigal"
                },
                {
                    "user_id": "Adwait Nadkarni",
                    "user_href": "/profile/Adwait-Nadkarni"
                },
                {
                    "user_id": "Kausik Subramanian",
                    "user_href": "/profile/Kausik-Subramanian"
                },
                {
                    "user_id": "Shuge Luo",
                    "user_href": "/profile/Shuge-Luo"
                },
                {
                    "user_id": "Sai Gayatri Prasad",
                    "user_href": "/profile/Sai-Gayatri-Prasad-1"
                },
                {
                    "user_id": "Paramyogi",
                    "user_href": "/profile/Paramyogi"
                },
                {
                    "user_id": "Shalini Sinha",
                    "user_href": "/profile/Shalini-Sinha-7"
                },
                {
                    "user_id": "Sushmitha Rao",
                    "user_href": "/profile/Sushmitha-Rao-9"
                },
                {
                    "user_id": "Adam Hawk",
                    "user_href": "/profile/Adam-Hawk-7"
                },
                {
                    "user_id": "Mahesh Jethalia",
                    "user_href": "/profile/महेश-जेथलिया-Mahesh-Jethalia"
                },
                {
                    "user_id": "Saurabh Khanduja",
                    "user_href": "/profile/Saurabh-Khanduja"
                }
            ]
        },
        {
            "author_info": {
                "name": "Brandon Hudson",
                "href": "/profile/Brandon-Hudson-51"
            },
            "answer_text": "Guys, if someone of you is experiencing some difficulties with explaining bad grades in personal statement as well as I did it some time ago, then I hope that it will be helpful for you to read this my small article. Because I would like to advise to all of you not to regret your time and to search carefully about some web sites which will be helpful for all of you in these issues. But also you should remember, that not all the web sites are of the same level of quality and you should pay special attention to this.  For example, please, take a look if this web site has such features: Management Personal StatementJournalism and Mass Communication Personal StatementMedia and Communication Personal StatementBecause, if it does not have them, please, do not use its services, because you will be disappointed in the result which you will get at the end! ",
            "date": "Answered January 25, 2018",
            "views": "14",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Leon Mason",
                "href": "/profile/Leon-Mason-4"
            },
            "answer_text": "Hello, friends! In the case you have some bad grades then explaining bad grades in personal statement becomes a necessity for you if you want to succeed.  There are may be some legal reasons for the bad grades you have: one of them is an illness due to which you may have missed classes but remember that you have to provide a medical receipt so to prove your situationstudying in another country may also be one of those reasons but you also have to prove it, so if it is not true about you, it is better not to make up such things as in this case you will lose a chance to participateyour bad grades may have some other reasons, try to describe them in an appropriate waySo, as you have understood now, it is important to state your bad grades and to tell why you have get such grades ",
            "date": "Answered August 18, 2018",
            "views": "12",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Karthik Subramani",
                    "user_href": "/profile/Karthik-Subramani-32"
                }
            ]
        },
        {
            "author_info": {
                "name": "James Leland Harp",
                "href": "/profile/James-Leland-Harp"
            },
            "answer_text": "QA2A. Unless you consider low grades an accomplishment, it does not belong in an SOP. As for suggestions, see How to improve my chances to be admitted into a top university that everyone under the sun wants in. Note: For those who are following me, you never want to make excuses for a negative because by explaining it, you are highlighting it. ",
            "date": "Answered November 11, 2016",
            "views": "2",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Shubham Singh Tomar",
                    "user_href": "/profile/Shubham-Singh-Tomar"
                }
            ]
        }
    ]
}