{
    "title": "Should I start a Podcast? How hard is it to start a Podcast? - Quora",
    "tags": [
        "Podcast Recommendations"
    ],
    "response": [
        {
            "author_info": {
                "name": "Ravi Jayagopal",
                "href": "/profile/Ravi-Jayagopal-1"
            },
            "answer_text": "Podcasting is so Dang Hard, But You Should Start One Today: That’s my tongue-in-cheek title of one of my podcast episodes. In fact, I talked about this on 2 of my podcast episodes: 1) Podcasting is So Dang Hard, So You Should Start One Today! 2) Podcast Discoverability Issue and Apple's Apathy Towards Podcasting 3) EDIT (added on 9/16/18): Audio and Voice Are The future - And that's exactly why I'm All-In On Audio On the episodes, I talked about a few reasons for both why you SHOULD and why you should NOT start a podcast. And also about the controversial discoverability issue from a podcaster’s perspective. Reasons why you should NOT start a podcast Audio is actually easier than creating Video - at least, most forms of face-on-camera videos, because if you're going to be in the video, then you have to think about your outfit, hair, shaving, makeup, lighting, are you going to do it indoors or outdoors. If you're doing it outdoors, are you going to use just natural sun light, if yes, then if you shoot for an hour or two, then you'll see the lighting differ in the final output because of clouds and the position of the sun itself changing, all of the outdoor noises that you have to consider because I don't know about you, but the second I walk into my backyard to shoot a quick 3 minute video, it feels like the entire universe conspires against me. And my neighbor, who probably hasn't mowed his lawn in weeks, comes out of the blue and starts his lawn mower or leaf blower. Another neighbor down the street starts doing some construction work, all of the kids come out to play, especially the cute little ones with such high-pitched screams that only your dog can hear it. Of course, your mic picks up EVERY thing, including the A/C unit in your own backyard going off all of a sudden. But think about how many talking-head or face-on-camera videos a typical person creates over their lifetime. Probably not too many, unless they're doing the occasional sales video for their web site. That number is however tripling by the day thanks to Facebook Live and Instagram and Snapchat and what not. But still, that's still a very small percentage. Of course, there are those casual screencast and how-to videos which are actually easier to produce than a typical podcast, because of the long-term commitment that a podcast brings. So don't compare audio to the much harder face-on-camera videos. Instead, compare creating audio - or a series of audio files (aka, a podcast) with the mostly-written-word Blog posts and Facebook posts and Instagram posts and Medium posts that you would create. So podcasting, in spite of what some people would have you believe, is actually way harder compared to most other form of content generation. Because it’s not just about starting one. There’s a lot more to it after you’ve launched it. And you don’t have the same long-tail search traffic advantage that a blog post has, when compared to podcast search and discoverability, which is a lot harder, because most podcast apps are not that great at search and indexing, including the Apple Podcasts app. And then I also talk about all the reasons why you SHOULD start a podcast... like, today! So listen to the full episode at Podcasting is So Dang Hard, So You Should Start One Today! And then listen to this other episode Podcast Discoverability Issue and Apple's Apathy Towards Podcasting Cheers! // Ravi Jayagopal Podcast Host, http://SubscribeMe.fm Creator, CoolCastPlayer.com ",
            "date": "Updated September 27, 2018",
            "views": "607",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Dominic Dimagmaliw",
                    "user_href": "/profile/Dominic-Dimagmaliw"
                }
            ]
        }
    ]
}