{
    "title": "Should you put a question mark at the end of an 'I was wondering question?' - Quora",
    "tags": [
        "Question Marks",
        "Punctuation",
        "Grammar"
    ],
    "response": [
        {
            "author_info": {
                "name": "Robert Latta",
                "href": "/profile/Robert-Latta-5"
            },
            "answer_text": "Should you put a question mark at the end of an “I was wondering question”? “I was wondering whether the speed of light changes through time.” As others have pointed out, the answer is no. In terms of form, this is not a question, but a statement. But that is defeasible. defeasible: open in principle to revision … —New Oxford American Dictionary online As you intimate, depending on the social context and the speaker’s tone of voice, these words might function as a question, and that causes confusion. Even when they do function as a question, as a rule, though not absolutely always, it is best to follow form as opposed to function, and omit the question mark. A possible exception: You are writing a novel, and you want to convey the personality of the speaker. Then you might write “I was wondering whether the speed of light changes through time?” There are few if any absolutely hard and fast rules when it comes to usage. Communication through language is a creative process. But it is also governed by rules, of necessity. Hence tension can arise between the pull of creativity and the pull of convention. Now for a second point. You must worry about quotation marks, too. Here is your question again, put correctly: Should you put a question mark at the end of an “I was wondering” question? ",
            "date": "Updated May 13, 2019",
            "views": "149",
            "upvotes": " View 7 Upvoters",
            "upvoters": [
                {
                    "user_id": "Antonio Dolan",
                    "user_href": "/profile/Antonio-Dolan"
                },
                {
                    "user_id": "Gayathri Narayan",
                    "user_href": "/profile/Gayathri-Narayan-3"
                },
                {
                    "user_id": "Murray Cowell",
                    "user_href": "/profile/Murray-Cowell-1"
                },
                {
                    "user_id": "Barbara Lopez-Lucio",
                    "user_href": "/profile/Barbara-Lopez-Lucio"
                },
                {
                    "user_id": "Robert Hollander",
                    "user_href": "/profile/Robert-Hollander-3"
                },
                {
                    "user_id": "Molly KB Hunt",
                    "user_href": "/profile/Molly-KB-Hunt"
                },
                {
                    "user_id": "Pádraic Breathnach",
                    "user_href": "/profile/Pádraic-Breathnach"
                }
            ]
        },
        {
            "author_info": {
                "name": "Danny Kodicek",
                "href": "/profile/Danny-Kodicek"
            },
            "answer_text": "It depends. “I was wondering” on its own is just a sentence and definitely doesn’t need a question mark. “I was wondering if I should eat chips for dinner” is also just a sentence with no need for a question mark. “I was wondering if you wanted to go out with me” is theoretically just a sentence which doesn’t need a question mark, but in practice is intended as a question, and would probably be spoken with a question intonation. It wouldn’t be unusual to see it written with a question mark. “I was wondering: would you like to go out with me?” is a question and needs a question mark. The “I was wondering” part is just a polite circumlocution at the beginning. ",
            "date": "Answered February 25, 2020",
            "views": "31",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Anna Jewel Ilao Leal",
                    "user_href": "/profile/Anna-Jewel-Ilao-Leal"
                },
                {
                    "user_id": "Diamant Asllani",
                    "user_href": "/profile/Diamant-Asllani"
                },
                {
                    "user_id": "Helen Meredith",
                    "user_href": "/profile/Helen-Meredith-6"
                }
            ]
        }
    ]
}