{
    "title": "Should I write male characters the same way I write female characters? - Quora",
    "tags": [
        "Male Characters in Fiction",
        "Female Characters in Fiction",
        "Fictional Characters"
    ],
    "response": [
        {
            "author_info": {
                "name": "Jeran Jenks",
                "href": "/profile/Jeran-Jenks"
            },
            "answer_text": "The only time a male character should feel “different” than a female character (or vice versa) is when gender is a theme of the story, or if you are specifically trying to highlight some difference. A character is a character. If you’re doing it right, that means that they are a big pile of characteristics, hopes, goals, fears, struggles, strengths, successes, and failures. Notice that I didn’t say in there the word “gender.” That’s because it usually isn’t a huge detail that matters to how a reader interacts with him/her. Short answer: of course you should! Long answer: yes! Just don’t make any big blunders like anatomy mistakes (if anatomy matters in your story) ",
            "date": "Answered October 5, 2017",
            "views": "201",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Dream Candy",
                    "user_href": "/profile/Dream-Candy"
                },
                {
                    "user_id": "Richard Enna",
                    "user_href": "/profile/Richard-Enna"
                }
            ]
        },
        {
            "author_info": {
                "name": "Joel Henry Hinrichs",
                "href": "/profile/Joel-Henry-Hinrichs"
            },
            "answer_text": "Nature vs. Nurture? I was, er, educated recently by a young lady that whereas boys and girls were trained into gender roles in the past, truth had finally arrived and both sexes thought the same, emoted the same, and should be written the same. The fact that she exhibited a need for consensus so deep that disagreement infuriated her was one of the differences between Mars and Venus. The web is full of argument, but the evidence when strained through a filter and looked at closely says that male and female brains differ structurally in several small but important ways. So, no, even Shakespeare had a hard time writing female characters. Most of he rest of male writers can’t do it at all. Female writers may have better intuition to go on, but even they can’t fake across genders with real success. ",
            "date": "Answered October 5, 2017",
            "views": "200",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Elena Rais",
                "href": "/profile/Elena-Rais"
            },
            "answer_text": "Yes! I have been telling many quora users that the key to writing characters of yoru oppostie sex is to write them the same way. It doesnt make a difference what you’ve got in your pants! __Elena ",
            "date": "Answered October 8, 2017",
            "views": "54",
            "upvotes": " View 4 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Hinda Kohn",
                    "user_href": "/profile/Hinda-Kohn"
                },
                {
                    "user_id": "Steve Kohn",
                    "user_href": "/profile/Steve-Kohn-6"
                },
                {
                    "user_id": "Steve Kohn",
                    "user_href": "/profile/Steve-Kohn-4"
                },
                {
                    "user_id": "Aubrey Wright",
                    "user_href": "/profile/Aubrey-Wright-12"
                }
            ]
        },
        {
            "author_info": {
                "name": "Richard Enna",
                "href": "/profile/Richard-Enna"
            },
            "answer_text": "If your female characters are complex human individuals with personal goals, biases, prejudices, desires, fears, and thoughts that are not all reflective of gender stereotypes, then by all means, write your male characters the same way. Otherwise, no. ",
            "date": "Answered October 5, 2017",
            "views": "111",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Edward Conway",
                    "user_href": "/profile/Edward-Conway"
                },
                {
                    "user_id": "Dorie Campbell",
                    "user_href": "/profile/Dorie-Campbell"
                }
            ]
        }
    ]
}