{
    "title": "Should I help my 12 year old in her elocution and essay competitions? - Quora",
    "tags": [
        "Understanding Child Behavior",
        "Teen Advice",
        "Parenting and Raising Teenagers",
        "Essays",
        "Parenting Advice",
        "Child Development",
        "Writing",
        "Teenagers and Teenage Years",
        "Children",
        "Parenting"
    ],
    "response": [
        {
            "author_info": {
                "name": "Ganta Hemanth",
                "href": "/profile/Ganta-Hemanth"
            },
            "answer_text": "Yes , you should.  Every one becomes independent and stops taking help from parents at one point of time. It is good to let the child say i don't need your help anymore rather saying to child that you shouldn't need my help any longer.  I stopped taking the help of my mother in studies when i was 10 years old. It was my choice. I no longer felt she need to help me in my studies , so i never asked her to help. In my 7 th class ,  i need to make some plant cell for my science exhibition. i am a terrible artist. So i ran to my mother for help.. She sat all the night and made the whole thing. I brought her clay and colors. I learn t everything about the plant cell and gave a good explanation of it..I justified her work with the appreciation i got for the exhibit..Frankly it was she who should be receiving it..  I just want you to know the impact she had on me by helping me. Helping the child in something is totally different from doing the work all by yourself. The latter one makes the child lazy.  In case of essay you guide the child by giving an idea on the topic at hand. Share your thoughts with him but let him present it in his own words. It will make him feel much better.. It also makes him lot powerful as he is putting the idea of a adult into words. Have a nice day.. :).. ",
            "date": "Answered April 18, 2015",
            "views": "111",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Elizabeth Bennet",
                "href": "/profile/Elizabeth-Bennet-10"
            },
            "answer_text": "Help her, but make sure she's the one who does the work. Improve upon the sentences she makes out of her ideas, polish them, you can take this opportunity to improve her vocabulary by throwing in a few new words. Help her think, be a guide, ask her questions like \"In the begining we should start with a little history, what history can you think of?\" or \"let's use the internet to find some history\". Help her structure her essay better, introduction- history- problem statement- proposed solution- other solutions- acknowledgements- future work. Now let her fill these sections by what she can think up. Ask her to put form an opinion of her own and write it down in the best way she can, now sit with her to think of points that support her opinion and the ones that don't.  Don't write her essay, help her become the woman who can write the best essays one day. Always help your child become independent and the best at what he or she is doing. It's not as hard as it sounds. ",
            "date": "Answered April 17, 2015",
            "views": "437",
            "upvotes": " View 7 Upvoters",
            "upvoters": [
                {
                    "user_id": "Alliyyah Mansoor",
                    "user_href": "/profile/Alliyyah-Mansoor"
                },
                {
                    "user_id": "Ron Keinan",
                    "user_href": "/profile/Ron-Keinan"
                },
                {
                    "user_id": "Raiza Shaikh",
                    "user_href": "/profile/Raiza-Shaikh"
                },
                {
                    "user_id": "Robbie Taylor",
                    "user_href": "/profile/Robbie-Taylor-8"
                },
                {
                    "user_id": "Beth Taylor",
                    "user_href": "/profile/Beth-Taylor-10"
                },
                {
                    "user_id": "Romli Janet",
                    "user_href": "/profile/Romli-Janet"
                },
                {
                    "user_id": "Anthony Johnson",
                    "user_href": "/profile/Anthony-Johnson-98"
                }
            ]
        },
        {
            "author_info": {
                "name": "Gautam St",
                "href": "/profile/Gautam-St"
            },
            "answer_text": "Ohh yes you should. Infact you should act like a facilitator in the whole process. Put up questions in her mind which will make her think on her own. And most importantly let her understand why should she participate in the competition and what does gain out of it.1. Later in life when you are out of college its all about how well you can put forth your idea and impress people.So speaking well and speaking with that flow is the key factor.So this is going to be kind of a net practice for that.2. This would get out that stage fear(if any).3. This would get out the self doubt that can i speak in front of a crowd? Ohh u know what i havnt spoken in front of an audience. All this wont arise because the child would have alredy spoken for this competition so he knows that he has done it once and can repeat it again. Specially in kids getting the purpose and showing them the wider gain should be of utmost importance. Hope this helps :) ",
            "date": "Answered April 18, 2015",
            "views": "104",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Shaheen Kapasi",
                    "user_href": "/profile/Shaheen-Kapasi"
                }
            ]
        },
        {
            "author_info": {
                "name": "Kanchan Dodeja",
                "href": "/profile/Kanchan-Dodeja"
            },
            "answer_text": "As a teacher, here are my two cents-  You must definitely help her. Ask her to research the topic, show her how that's done. Then she must summarize, form an opinion and write a first draft. When she gives you the first draft, ask her leading questions, that would show the reasoning behind her assertions. Ask her to incorporate all the feedback and come up with the second draft. Then the third, and so on.  Help her rehearse- that's on you too.  You need to have patience to perform this process and you also need to explain to her the value of critical and independent thinking. Invest her in how this is going to be a crucial skill in the long run.  Good luck. ",
            "date": "Answered April 16, 2015",
            "views": "109",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Mehul Manot",
                "href": "/profile/Mehul-Manot"
            },
            "answer_text": "Help her by correcting her pronunciation and grammar. Proofread her essays.But don't help her write an essay. It should be her original work. Later in life, when most of her peers would be struggling to write an essay for the job interview, she'd be thanking you. Remember, you're preparing her for many essays, not just one. ",
            "date": "Answered April 16, 2015",
            "views": "256",
            "upvotes": " View 5 Upvoters",
            "upvoters": [
                {
                    "user_id": "Pragya Jha",
                    "user_href": "/profile/Pragya-Jha-7"
                },
                {
                    "user_id": "Raul Jain",
                    "user_href": "/profile/Raul-Jain-1"
                },
                {
                    "user_id": "Arjun Mehra",
                    "user_href": "/profile/Arjun-Mehra-12"
                },
                {
                    "user_id": "Ishan Daga",
                    "user_href": "/profile/Ishan-Daga-2"
                },
                {
                    "user_id": "Vanshika Abroal",
                    "user_href": "/profile/Vanshika-Abroal"
                }
            ]
        },
        {
            "author_info": {
                "name": "Ambrosine Lagerloff",
                "href": "/profile/Ambrosine-Lagerloff"
            },
            "answer_text": "Stick to what u r doing. My mother did the same and it irritated me a lot. Sure, in my primary classes I didn't do well in CCA but in secondary my content started beating that of my classmates's parents. And today after finishing 12 years of schooling and living through all those unfair situations; when it comes to English, I am the best in my class. And for all that I have my mother to thank. ",
            "date": "Answered April 16, 2015",
            "views": "73",
            "upvotes": "0"
        }
    ]
}