{
    "title": "Should I illustrate my own books, or would it be better to hire an illustrator? - Quora",
    "tags": [
        "Adobe Illustrator",
        "Graphic Design",
        "Hiring",
        "Book Recommendations"
    ],
    "response": [
        {
            "author_info": {
                "name": "Cynthia Anaya",
                "href": "/profile/Cynthia-Anaya-12"
            },
            "answer_text": "There are plenty of children's books illustrated by the author. If you're self-publishing this book then your options are open to you because you can most definitely paint those pictures to your hearts content and arrange the book in any way you want. If you would rather pay someone to illustrate the book for you and then publish it you can always do that so long as you have the budget for it. Things to consider: How many illustrations will I need?Do I have time to paint them myself?Do I feel that my level of experience as a painter will allow me to create the illustrations I've envisioned?Will anyone else be able to understand my own vision of how these illustrations should turn out?Can I afford to pay someone else to do it? (You'll need to research costs associated with this, but I've found some stellar illustrators on Fiverr: The marketplace for creative & professional services. You can get great illustrators here for very reasonable prices. Just make sure you look at their portfolios and track records on fiverr so you know that you're getting a good product and working with a reliable individual. I would also consider a trial run with just one illustration to see if they \"get\" it or if their style of art meshes well with your take on things.If you're going the traditional way of publishing, the publisher is the one who decides whether or not your illustrations will be used, and many times the publisher goes with illustrators they have already worked with and know they can rely on. In this situation, you must stress the importance of your own illustrations being used and have them all ready to go so your publisher gets a feel for your level of competence and has something he/she can work with. Even then, they may go with another illustrator. My opinion: if you're a painter then do it yourself. It's your baby and your vision. I think it would be so satisfying to create every aspect of this book on your own terms and then publish it on your own. Of course, those decisions are all up to. I hope this helps you know what your options are. ",
            "date": "Answered March 4, 2016",
            "views": "862",
            "upvotes": " View 2 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Tanya Eagan",
                    "user_href": "/profile/Tanya-Eagan-1"
                },
                {
                    "user_id": "Damtew Engida",
                    "user_href": "/profile/Damtew-Engida-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Charlene Chua",
                "href": "/profile/Charlene-Chua-2"
            },
            "answer_text": "It depends on what kind of book you are thinking of doing. I'm going to take a guess that you want to do some kind of children's book or comic book? If you want to pitch the project to a publisher, then either pitch it with your own artwork, or without any artwork at all. The publishers generally will pick an illustrator if it's needed for the manuscript. If you're self publishing, it could go either way. If you want to pay someone else to do the art, that's fine, but you'd still need to oversee the production and possibly art direct it.  Hope that helps.  ",
            "date": "Answered March 3, 2016",
            "views": "788",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Maya Malaga",
                    "user_href": "/profile/Maya-Malaga-1"
                },
                {
                    "user_id": "Kirsten Atkin",
                    "user_href": "/profile/Kirsten-Atkin"
                }
            ]
        }
    ]
}