{
    "title": "Summary Writing: What are excellent tips on how to write a brief summary? - Quora",
    "tags": [
        "Summary Writing"
    ],
    "response": [
        {
            "author_info": {
                "name": "Robert Charles Lee",
                "href": "/profile/Robert-Charles-Lee"
            },
            "answer_text": "The first tip is to know the subject matter well enough. Unless that happens, the summary is going to be lopsided and/or at the wrong end of the stick. Assuming the person knows the subject matter reasonably well enough, then go for the following general rules of thumb:- - 20 to 25 words per sentence - 2 to 4 sentences per paragraph - Avoid using adjectives as much as practicably possible (unavoidable sometimes) - Avoid using adverbs as much as practicably possible (unavoidable sometimes) - Keep 'facts' relatively together - Keep examples relatively together - Keep counterarguments relative together - Keep opinions relatively together (and relatively neutral-sounding) Other than that, the rest is up to your abilities in summarising things. Thanks for the A2A. How short is a piece of string, right? ",
            "date": "Answered December 17, 2015",
            "views": "655",
            "upvotes": " Answer requested by Paul Robinson",
            "upvoters": [
                {
                    "user_id": "Rana Islam",
                    "user_href": "/profile/Rana-Islam-15"
                },
                {
                    "user_id": "Paul Robinson",
                    "user_href": "/profile/Paul-Robinson-107"
                }
            ]
        },
        {
            "author_info": {
                "name": "Thompson Jerry",
                "href": "/profile/Thompson-Jerry"
            },
            "answer_text": "Summary writing is an important part in the essay writing task. We have to remember something while writing a summary.  Do not rewrite the original piece. Keep your summary short. Use your own wording. Refer to the central and main ideas of the original piece. Read with who, what, when, where, why and how questions in mind. Do not put in your opinion of the issue or topic discussed in the original piece etc. writing a good summary is very important to thoroughly understand the material you are working with. The main purpose of a summary is to give an interesting idea about the body content or main subject to the reader. That is why the always writer take care to build the summary more specific and clear. ",
            "date": "Answered December 21, 2015",
            "views": "784",
            "upvotes": " View 2 Upvoters"
        }
    ]
}