{
    "title": "Suppose you are given an essay, which should be 'up to 500 words', and you write about 300 words, is that bad? - Quora",
    "tags": [
        "Essay Writing Help",
        "Essays",
        "Writing Advice"
    ],
    "response": [
        {
            "author_info": {
                "name": "Mario Gravina",
                "href": "/profile/Mario-Gravina"
            },
            "answer_text": "Typically I like to be around 20% or so of the limit. Can’t make an essay exactly up to the word requirement, but they’re really looking to avoid two things: The 150–200 word “I didn’t study/I don’t care” time waster, or the “Ode to all Essays, written by Vogons” and only around 2300 words. Another time waster. Here’s where I stand. If you have everything you had to say in those 300 words, have added any additional comments, and are confident that one more word than as it is currently written would detract from the quality of the piece as it stands, then send it as is. If not, there are always sections -as one re-reads- that might be expounded on, or perhaps secondary ideas or side notes that had not been considered or included. But only for the sake of thoroughness, not to reach the 500 words. I’ve gotten a couple profs who have not appreciated such theory, but many did. No sense in faffing a perfectly good essay, unless it must be modified or edited for publishing in a periodical or other specific reason. My thoughts in answer to your question, in 200 words. All the best. ",
            "date": "Answered February 17, 2017",
            "views": "27",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Ryan Gorham",
                    "user_href": "/profile/Ryan-Gorham-9"
                }
            ]
        },
        {
            "author_info": {
                "name": "Lorraine Lordi",
                "href": "/profile/Lorraine-Lordi"
            },
            "answer_text": "Word count is never as important as content. That being said, if every word holds a perfect place, then yes, 300 is fine. But you have to make sure that you have written a perfect “bouillon cube” that’s concentrated with meaning. One of my former students was accepted into an Ivy League college by giving this answer to the following essay question: “For you, what is the meaning of your life?” My student answered, “The period at the end of this sentence.” Now, the recommended word count was 500 words. And if you notice, the sentence my student wrote isn’t a sentence at all but a fragment. Still, it is brilliant. My point here is that if you do not have a knack for the best language in the right places, then aim for the 500 word count mark. Some professors see less than that as laziness or a last minute rush on the student’s part. It’s not always true, but if I were you, aim for 500 words that also create a lasting effect. ",
            "date": "Answered February 17, 2017",
            "views": "37",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "D Nilesh",
                    "user_href": "/profile/D-Nilesh"
                }
            ]
        }
    ]
}