{
    "title": "The ISKCON temples & deities resemble Buddhist. Their scriptures & philosophy sound semi Abrahamic. Their activities & outfit appear as Vedic Hindu. What's wrong with ISKCON? - Quora",
    "tags": [
        "Krsna, the Supreme Personality of Godhead",
        "Shri Vishnu (Hindu Deity)",
        "Vedas",
        "Bhagavad Gita",
        "Śrī Krishna",
        "Hinduism"
    ],
    "response": [
        {
            "author_info": {
                "name": "Serva Chan",
                "href": "/profile/Serva-Chan"
            },
            "answer_text": "ISKCON is likely to have the most members in the Western world. So, it's not a \"mistake\", but people with a western influence cannot change to the Indian way of thinking. That is quite normal. For example, look at Christian services in different countries, you will see that Spanish and Italian people have a very different passion than people in other countries. It's not a fault of devotees or ISKCON, it's normal for an exported religion to adapt to the mentality of the region where it is brought. In my view, this mentality is particularly evident in the attitude towards Prabhupada. While Hindus measure the authenticity of a guru by whether he or she agrees with and speaks in accordance with the Sruti scriptures, most ISKCON members do not check whether Prabhupada agrees with the scriptures. They accept it without any closer examination, without knowledge of the Vedas, the Upanishads, the Vedanta Sutra, etc. Prabhupada is considered more like an Abrahamic prophet who brought the one blessing and liberating truth to the West. They ignore that the Puranas are not to be taken literally and treat them like a second Quran - precisely because the way of thinking remains Western. Prabhupada said so many things about women, Jews, blacks, which are totally unacceptable. Ironically, the ISKCON scriptures themselves say that someone who cannot master his tongue cannot be accepted as a teacher. Sometimes ISKCON disciples attack Buddhism. Ironically, they themselves trample on the Sruti scriptures. ",
            "date": "Answered December 22, 2019",
            "views": "80",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Keitel Helms",
                    "user_href": "/profile/Keitel-Helms"
                }
            ]
        },
        {
            "author_info": {
                "name": "Nishnat Deb Sharma Biswas",
                "href": "/profile/Nishnat-Deb-Sharma-Biswas"
            },
            "answer_text": "ISKON’s mentality is Abrahamic. They are not polytheists or pagans. They worship Krishna just like a muslim worships Allah or Christian worships Jeovah. In fact, many Christians and Muslims are more open minded that these ISKON people. In fact, among Hindus there are some people who are very sect oriented and believe in the main God of that sect in an Abrahamic manner, i.e., my god is true god and other gods are either weak or false. ISKON claims to be Vaishnavite but their way of thinking is not just love for Krishna but a hatred for all other gods. What ISKON does is nothing new. There has been some Hindus who always believed in such a twisted fact. It reflects the abrahamic minority of Hindus. Just telling you, Abraham was before Jews, Muslims or Christians appeared on earth and he preached monoism, which was quite similar to Upanishads. On the contrary, the three religions are monotheists and internal competition among polytheists ",
            "date": "Answered July 12, 2019",
            "views": "139",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Tarun Kumar",
                    "user_href": "/profile/Tarun-Kumar-6269"
                }
            ]
        }
    ]
}