{
    "title": "The ideas are all there, but then I keep writing nonsense and deleting. How do I start writing my first novel? - Quora",
    "tags": [
        "Novel Writing",
        "Creative Writing",
        "Novels",
        "Writing Advice"
    ],
    "response": [
        {
            "author_info": {
                "name": "Robert Johnston",
                "href": "/profile/Robert-Johnston-26"
            },
            "answer_text": "At the start of a long project, just like in business, you are well advised to facilitate it from several initial angles, in preparation for creating a unity that can blossom later: create a one paragraph and then a one page version of the novel. Those versions will constantly change as you progress, but they force you, at any stage, to be very clear on a few things; themes, storyline, plots and start/middle/end general structure. Do NOT worry about being right or professional or polished, you just want SOMETHING on paper, and then you can evolve and expand and improve it once you’ve got a brief sketch.Create a visual rough model, a combination of mind map and flow chart, where you can show major components of the novel: characters, themes, important scenes and turning points, several plots that interweave. Customize that as you see fit, but at least get it OUT OF YOUR HEAD and get what you need on the table and keep it organized as you build it and work it towards completion. Being organized, and keeping it ALIVE and out of your head, keeping it clear, keeping it complex yet very understandable, is what you need. Do not filter things out, you need this to accommodate complexity, the great mishmash of information exploding in your head, that should be OUT OF YOUR HEAD and finding structure somehow, as a story.Create lists of resources: lists of characters, themes, scenes, order of scenes, plotlines, and also helpful resources you’ll use, such as lists of movies and novels or poems or other things that you find helpful to bounce ideas off of or extract ideas out of, lists of real life people or fictional characters that could serve to help inspire creation of your novel’s characters, lists of real life events (topics, people, dates, locations, comments) that serve as research and support for your project, and keep going, and then be sure to keep those lists handy every day. I recommend printing them and keeping them in a single folder/binder like high school kids use for handing in big essays, but as loose leaf, for fast easy selection and moving around.Look online for “mind maps” of topics that help creators, artists, writers, people dealing with certain topics. There are thousands of mind maps to be found online if you search for the type, and look for the images. For example, just search “mind map plotlines”, look at the “images” results, and you’ll see different ways plotlines can interact, how elaborate information can be organized for fast easy access and instant understanding, and you’ll see hundreds of different topics expanding and displayed according to what each person or topic needs. This is very rewarding.Don’t start writing a novel, or anything larger than a poem, by writing long-form. You might find that an idea for a novel creates a few scenes in your imagination, so yes, write those out, you’re initial sketches, so you remember clearly and capture what they are, but that’s just building your raw content, an important thing. But long-form writing IS NOT what you should be aiming for at the start; in general you need to be gathering raw material so you can organize it once you’ve got it. Generating your content is the most important part of building your story; not the long-form writing which organizes it and fills it in as a smooth read from chapter to chapter. Long-form writing should be floating on top of a large supply of research and resources that you can quickly and easily and constantly access to guide you and the scenes. Then, the last stage, the editing for improving the final drafts, is a confident, organized and efficient process because the whole process started correctly like an acorn landing in fertile soil in the sunshine, allowing the giant oak tree to grow like it wants to.",
            "date": "Answered April 26, 2020",
            "views": "154",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Walter D. Petrovic",
                "href": "/profile/Walter-D-Petrovic-1"
            },
            "answer_text": "It sounds like you have not planned anything for your book. Writing off the cuff is not the best way to write any book. There are just a few writers, with true genius, who can do that without a single mistake in spelling, grammar or style, and who never need to refer to or remember the names of characters and their personalities. I am not a genius, and you can’t be if you don’t design your book. I am working on a textbook on the creative process and what makes writing literature instead of just a story. The difference comes down to not writing ‘off the cuff’ the story. Each character is to be real and part of the realism is the name you choose. What the the names mean and can it work for what your characters’ personality are all about? Refrain from using names because they are unusual or a favorite. Use one that conveys meaning to each character’s persona. The reason you have ideas but you keep writing nonsense and delete is because that book is not designed and like a house, it has to have certain features built to be able to withstand the worst weather — professional criticism. If I see a name that appears to just be a favorite, or unusual for its own sake, I lose interest in the read. This is all covered in the textbook I am writing. Advice here: Don’t write a book until you have learned to construct a story properly. Practice on a couple dozen short stories of no more than 5,000 words. If you are good and successful in your design, by the time you start writing you will know exactly what will be set down on each page. ",
            "date": "Answered May 24, 2017",
            "views": "341",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Eman Farfar",
                    "user_href": "/profile/Eman-Farfar"
                },
                {
                    "user_id": "Diana Kosianka",
                    "user_href": "/profile/Diana-Kosianka"
                }
            ]
        }
    ]
}