{
    "title": "Was there any cases of American soldiers falling out of helicopters during the Vietnam war? - Quora",
    "tags": [
        "Warfare in Vietnam",
        "Helicopters",
        "Military History of the United States of America",
        "Vietnam War",
        "Military Personnel",
        "Vietnam",
        "United States Armed Forces"
    ],
    "response": [
        {
            "author_info": {
                "name": "Kevin Baldwin",
                "href": "/profile/Kevin-Baldwin-44"
            },
            "answer_text": "Excerpt from my book REMF Life Inside The Wire  Out of boredom, and possibly “under the influence” … which might help explain the lunacy in part, at least a little … when I had a bit free time on my hands all by myself, no buddies tagging along, I would occasionally walk over to the Củ Chi airfield, a short jaunt away from my hootch, and bum a ride off the first slick I saw where I could find the pilot getting ready to take off. I never met a single one who refused me or even asked where I was going. And I don’t really recall ever asking where they were going either until I would start trying to find a ride back to Củ Chi. I went to places I never imagined … there were a lot of those … out in the absolute middle of nowhere, jungles, mountains, winding rivers and streams, rice paddies, fire bases, bomb craters … and took in the scenic views at about two thousand feet, landing and taking off from obscure, remote locations, mostly just routine milk runs for the chopper pilots and crews but each separate trip a highly charged experience for me. But, eventually came the day that ended my joy-riding. It was just another routine chopper hop out to a fire base to deliver mail and a few supplies, ammo, C-rats, whatever; I think we dropped off a grunt returning from R&R. This particular fire base was really small, circular, perhaps less than a hundred meters in diameter, and quite near the Cambodian border. I saw three or four men standing just outside the perimeter, very nearby the wire, practicing with their M-16s. This was 25th Infantry Division territory. I remember musing about how this must have been the scene of some really fierce fighting judging by the shell and bomb craters surrounding the little outpost. From the air you could see how the patterns began to merge, tighten as they got closer to the perimeter, obviously walked in by command direction until it appeared they were firing almost on top of the perimeter circle. And they surrounded the little camp on all sides; three hundred sixty degrees around the perimeter looked like a soggy pepperoni pizza. All I could think of was my relief that I wasn’t anywhere around this place when that shit was going down!  Moving right along, the pilot did his thing and soon we were back airborne, heading home to Củ Chi. There was the pilot, co-pilot in the cockpit, the door gunners at their positions, and one other passenger besides myself sitting in the rear jump seats, me on the port side. So here we’re flying along, nothing unusual, about twelve hundred feet of altitude, taking in the scenery below, enjoying the rush of cool air through the wide open side doors, and suddenly with no warning whatsoever the chopper jinked over onto its port side and I was dangling from my seat belt … thank God I had it locked on securely … hanging out the now downward facing door, held into the chopper … a more accurate description would be hanging from the chopper … by nothing more than the belt around my waist. Both hands and both feet were akimbo, flagging helplessly in the wind, for just a couple seconds, when just as suddenly the chopper jinked back over to the other side. And I mean right on its side again … forcefully. Only this time it yanked me back through the door and threw me at my fellow passenger on the starboard side, again my seat belt saving both of us … or at least me assuming he had his seat belt strapped tight like I did! And then it was into the breach once more as the pilot flipped the slick back to my side again, once more leaving me in this precarious position, though this time I was able to grab hold of some part of the door post and keep myself mostly inside the chopper. At that point the air craft righted itself and continued along as usual. Meanwhile, I see this other guy taking it all in stride, holding on tight of course, but seemingly otherwise unperturbed … ho-hum. Choi oi!!! “What in the hell was that all about?” I shouted at the other guy when I could finally get some sounds to leave my airless mouth. “You mean you didn’t hear that ground fire?” he yelled back. Ground fire? I thought to myself … You mean someone was shooting at us? I only thought this to myself, albeit loudly in my brain, trying to get a grip on my panic. Of course I didn’t want to appear uncool so I put on my best Fonzi face and yelled back nonchalantly “Oh … must have missed it” as if nothing had happened. And perhaps to the others onboard nothing of any note had happened, but I decided right then and there my chopper hopping days were over. There were too many ways to get killed here doing what they made you do; in my mind only a fool … I can’t believe I’m saying this … would put oneself in harm’s way like I was doing and call it fun. I’m not saying I didn’t choose to do a bunch of other stupid shit, but from that point on I at least did them on the ground. Going forward the only way to get me in the air was to force me … and they did … or tell me the plane was going back to the World. And eventually that happened too but it was small comfort at the moment. ",
            "date": "Answered April 11, 2019",
            "views": "69",
            "upvotes": " View 51 Upvoters",
            "upvoters": [
                {
                    "user_id": "Simon Aimer",
                    "user_href": "/profile/Simon-Aimer"
                },
                {
                    "user_id": "Raymond Horton",
                    "user_href": "/profile/Raymond-Horton-5"
                },
                {
                    "user_id": "Jean Wright",
                    "user_href": "/profile/Jean-Wright"
                },
                {
                    "user_id": "Christopher Payne",
                    "user_href": "/profile/Christopher-Payne-122"
                },
                {
                    "user_id": "Jessica Taylor",
                    "user_href": "/profile/Jessica-Taylor-164"
                },
                {
                    "user_id": "Ramón Martín Soto",
                    "user_href": "/profile/Ramón-Martín-Soto"
                },
                {
                    "user_id": "Mark Claytor",
                    "user_href": "/profile/Mark-Claytor-1"
                },
                {
                    "user_id": "Paul Latter",
                    "user_href": "/profile/Paul-Latter-1"
                },
                {
                    "user_id": "Jan Peterson",
                    "user_href": "/profile/Jan-Peterson-4"
                },
                {
                    "user_id": "Dave Roberts",
                    "user_href": "/profile/Dave-Roberts-185"
                }
            ]
        },
        {
            "author_info": {
                "name": "David Albert",
                "href": "/profile/David-Albert-76"
            },
            "answer_text": "Lol !! Not that it’s actually “funny” for that to happen to ANY Soldier. But I think you’ll understand why I wrote it by the time you reach the end of my following “Vietnam Chopper Experience”, about when, in 1970, I was a US Army Infantry Soldier. Because during my US Army Nam Tour, I had been about 1–0 seconds from that exact thing happening to me. This particular event happened during (1) of my many, many chopper rides when my Infantry Squad was being choppered back to our Base Camp. It was a stormy & rainy day. So the chopper pilot flew higher then usual to try to get above the worst of the weather. As is the standard practice when many Soldiers are being choppered to & from one LZ, we always try to squeeze in as many Grunts as possible onto the whole available floor between the (2) opened doors of the Huey (chopper). We end up with 3–4 in between the (2) opened doors & with 2–3 (depending on the stature of each Grunt) sitting on the very outside edge of the floor right where the bottom of each door would be, had they been closed. My very 1st Huey chopper flight in Nam was a real learning experience. Mainly because, surprisingly, you actually stay pretty well put as the Huey is transporting you through the dangerous skys of Vietnam. As long as you sit your ass back as far as possible on the chopper’s floor & leave just your legs, from your knees down, hanging outside the chopper floor anyways. When your the middle one of (3) guys sitting precariously on the edge of available floor space when in flight, you’re the one that’s got nothing (except POSSIBLY your Bud next to you) to actually grab onto if ya feel yourself getting sucked or ejected or sliding further out then what feels safe. Also, at the back edge of the area of EACH open door, mounted high up off the floor, is (1) of the (2) M60 machine guns being manned by (2) of the Huey’s Crew. They’re the only armament fitted on each Huey. Well…. with me being the “unlucky” middle guy, & also with being loaded down with my full rucksack strapped to my back, the high winds buffeted the chopper & I too started to get bucked around. The winds were stronger & much noisier then usual, & along with the inherent extremely noisy chopper, no one could hear another talk or even holler out. All the things necessary for a Soldier to do exactly what you’re asking about in your original question, fate had put into place. I started to be bucked & sucked a little further & a little further out, till where I then started to feel “unsafe”. I kept leaning back further & further. But then my full rucksack only allowed me very little distance & then kept me from leaning back any further. And I didn’t wanna “surprise grab” onto either of my Buds which would definitely risk them also falling out with me. The extreme noise made hollering out to be useless. As I got closer & closer to “the point of no return”, my head was spinning with trying to quickly come up with a solution. My last thought just a milli-second before I started my “descent”, was that I might be able to quickly grab onto the chopper’s skids (landing gear) right below me. But…. It’s also a little bit back from where I’d be falling, so it would be behind me. Then….OH SHIT !! TIMES OUT !! Right at that exact millisecond…. I felt someone pull me backwards, back into the chopper !! WHAT OR WHO IS THAT ?!! As I was being pulled back in enough to be a safe distance, I saw that my “Savior” was the M60 Machine Gunner who was to my left & with one of my Buds sitting between us. It was way too noisy for him to even hear me, but I mouthed out “Thank You” to him. And I’m sure he also read my wide open eyes that “SAID JUST HOW THANKFUL I WAS.” I then commenced to start getting my heart back down out of my throat. Most non-Military US Citizens would be quite surprised by how many Military deaths aren’t the result of Combat with the enemy. There are so MANY potentially dangerous ways to die or to be seriously injured when a Military person has so many “Occupational Hazards” to deal with on a daily basis. And in a Combat Zone the enemy is just (1) of those many. I know that by my discharge date, I ended up being much more enlightened to both our Military’s non-Combat deaths & their non-Combat injuries (some are VERY serious injuries). During just my own Nam experiences, I escaped non-combat Death & non-Combat injures several times. And unfortunately I witnessed many who didn’t escape them. And please believe me when I tell you, “Friendly Fire” can (& DOES) happen, & can so easily happen in a Combat Zone. Where everyone has at least (1) of MANY available lethal “Tools” that are designed to kill &/or maim. But that is yet another story of my 1970 “Vietnam Experiences”. ",
            "date": "Answered April 16, 2019",
            "views": "18",
            "upvotes": " View 21 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Will Robinet",
                    "user_href": "/profile/Will-Robinet"
                },
                {
                    "user_id": "Ed Corliss",
                    "user_href": "/profile/Ed-Corliss"
                },
                {
                    "user_id": "Thomas Passelaigue",
                    "user_href": "/profile/Thomas-Passelaigue"
                },
                {
                    "user_id": "Matt D'Arcy",
                    "user_href": "/profile/Matt-DArcy-7"
                },
                {
                    "user_id": "Ike McCabe",
                    "user_href": "/profile/Ike-McCabe"
                },
                {
                    "user_id": "T. Stephen Cornelius",
                    "user_href": "/profile/T-Stephen-Cornelius"
                },
                {
                    "user_id": "Troy Chavez",
                    "user_href": "/profile/Troy-Chavez-7"
                },
                {
                    "user_id": "James Videbeck",
                    "user_href": "/profile/James-Videbeck-1"
                },
                {
                    "user_id": "Terry Little",
                    "user_href": "/profile/Terry-Little-35"
                },
                {
                    "user_id": "Jan Peterson",
                    "user_href": "/profile/Jan-Peterson-4"
                }
            ]
        }
    ]
}