{
    "title": "Was the Bible the first anthology? - Quora",
    "tags": [
        "Anthologies",
        "Biblical History",
        "Bible Verses",
        "Bible Study",
        "The Bible",
        "Literature",
        "Christianity",
        "Books",
        "Religion"
    ],
    "response": [
        {
            "author_info": {
                "name": "Brady Williams",
                "href": "/profile/Brady-Williams-30"
            },
            "answer_text": "I would say yes. There are things about the Bible that is still unknown. Like the rod of Moses. The Rod of God, The Children are our future The rod of God or Moses rod is a concept that opens many avenues of mystery and hidden revelations like when was the rod first created and how it was created and for what purpose was it created. How did Moses get the rod and how did the Egyptians learn to duplicate the rod? I want you to note in particular the different ways we are introduced to the rod. To understand the mysteries of the Rod of God we are going to use a concept called textual criticism but instead of finding word origins we are going to the meaning of certain statements. In this case the rod of God. We first hear about the rod when it was in Moses possession. He had it with him when he saw the burning bush on the mountain (Exodus 3:3). At this point I must adlib to bring us up to speed on how Moses received the rod. This information is not found in the Bible but if we follow the lead of the Bible, we find this story in the book of Jasher (Joshua 10:13). In the book of Jasher we that find Moses Got the rod from his father-in-law Jethro who received the rod from Pharaoh of Egypt as a gift. Jethro took the rod home went into his garden and stuck the rod in the ground and never could pull the rod back out again. When Jethro saw Moses, he called him an Egyptian because of the way he was dressed but Moses said he was an Israelite. Jethro knew that the rod was the rod of the God of Israel so he told Moses if you are an Israelite there is a rod stuck in the ground in my garden see if you can pull it out. When Moses grabbed the rod, it released the ground into his hands. That is how Moses came by the Rod of God. In Exodus 4:20 the rod is called the rod of God. So, what is the rod of God? If you google what was the rod made of you will find that it was made out of sapphire stone, God created it for Adam when he cast him out of the garden. The following information states that the rod could have been made of almond wood because once budded and grew almonds. What the translators missed was that since the rod was made of stone and grew almonds it could have only been done by God and that God had chosen Moses and Aaron to be their leaders. (According to Jewish myth, the rod was created on the eve of the sixth day. It was made of either sapphire or almond wood (Avot 5.6). Believe it or not, the Excalibur legend is after this myth — because like Excalibur, only the rightful owner could withdraw the staff once it had been planted into the ground.) So, it is said that God made it but I believe Adam made it, if God had made it how could the Egyptians duplicate it. In Exodus 7:8–12 the rod is called Aaron’s rod. The reason it was called Aaron’s rod is because Aaron was the official High Priest, he had the birthright being Moses older brother. And also, the rod was a jewel of the High Priesthood being owned by every High Priest from Adam down to Aaron. Finally, the last time we hear about the rod is when the new generation came forth from the wilderness after 40 years and began murmuring about lack of water and thirst in the same place the old generation murmured. God told Moses and Aaron to take the rod but this time speak to the rock to bring water forth. But Moses and Aaron miss-took what God was doing and God became angry with them. Moses was greatly beloved by God, he was a man of great faith, he was obedient, and he was steadfast. So, it was a shock to me that God felt it necessary to make an example of him by denying him the thing he wanted most in life, until I understood why. Moses was denied entrance into the promise land because he hit the rock instead of speaking to it as God had instructed. The circumstances around this event are very puzzling because it was not Moses that was complaining and displaying a lack of faith, it was the people. But the people went into the land of promise and Moses did not. Let’s go to this event and see firsthand what happened. But first let me give you some background information that is a little more in-depth so we can see what really happened. Exodus 17:6-7 5And the LORD said unto Moses, go on before the people, and take with thee of the elders of Israel; and thy rod, wherewith thou smotest the river, take in thine hand, and go. 6Behold, I will stand before thee there upon the rock in Horeb; and thou shalt smite the rock, and there shall come water out of it that the people may drink. And Moses did so in the sight of the elders of Israel. 7And he called the name of the place Massah, and Meribah, because of the chiding of the children of Israel, and because they tempted the LORD, saying, is the LORD among us, or not? So, God brought them back up to the borders of the promise land again. And again, the people were thirsty and murmuring against Moses. Again, Moses prayed and God answered but this time God said: Numbers 20:8-13; Take the rod, and gather thou the assembly together, thou, and Aaron thy brother, and speak ye unto the rock before their eyes; and it shall give forth his water, and thou shalt bring forth to them water out of the rock: so thou shalt give the congregation and their beasts drink. 9And Moses took the rod from before the LORD, as he commanded him. 10And Moses and Aaron gathered the congregation together before the rock, and he said unto them, hear now, ye rebels; must we fetch you water out of this rock? 11And Moses lifted up his hand, and with his rod he smote the rock twice: and the water came out abundantly, and the congregation drank, and their beasts also. 12And the LORD spake unto Moses and Aaron, because ye believed me not, to sanctify me in the eyes of the children of Israel, therefore ye shall not bring this congregation into the land which I have given them. 13 This is the water of Meribah, because the children of Israel strove with the LORD, and he was not sanctified in them. Notice verse 12 that God says that Moses and Aaron Fail to sanctify him in the eyes of the people. And this is where he first rebukes Moses for that mistake. But notice it was not Moses that was striving against God. Numbers 20:22-29; And the children of Israel, even the whole congregation, journeyed from Kadesh, and came unto mount Hor. 23And the LORD spake unto Moses and Aaron in mount Hor, by the coast of the land of Edom, saying, 24Aaron shall be gathered unto his people: for he shall not enter into the land which I have given unto the children of Israel, because ye rebelled against my word at the water of Meribah. 25Take Aaron and Eleazar his son, and bring them up unto mount Hor: 26And strip Aaron of his garments, and put them upon Eleazar his son: and Aaron shall be gathered unto his people, and shall die there. 27And Moses did as the LORD commanded: and they went up into mount Hor in the sight of all the congregation. 28And Moses stripped Aaron of his garments, and put them upon Eleazar his son; and Aaron died there in the top of the mount: and Moses and Eleazar came down from the mount. 29And when all the congregation saw that Aaron was dead, they mourned for Aaron thirty days, even all the house of Israel. ",
            "date": "Answered November 12, 2019",
            "views": "112",
            "upvotes": " Answer requested by Richard Harrison"
        }
    ]
}