{
    "title": "Were you ever guilty of academic dishonesty in school? - Quora",
    "tags": [
        "Academic Dishonesty",
        "Dishonesty",
        "Academic Plagiarism and Cheating",
        "Plagiarism",
        "Ethics",
        "Schools"
    ],
    "response": [
        {
            "author_info": {
                "name": "Adam Brian Raynes",
                "href": "/profile/Adam-Brian-Raynes"
            },
            "answer_text": "No, I wasn’t. I did well in school and especially on exams. I generally resented anyone that cheated on academics. I never turned anyone in, as I didn’t see myself as the academic standards enforcer, but I was quite pious in my refusal to help others cheat. The fact that I did not turn them in didn’t seem to make me more likable to the cheaters (no one thanked me), but it was all the flexibility or allowance I could handle back then. I don’t see that much now, but my profession (Licensed Land Surveyor) sees cheating and dishonesty in data or computations as absolutely not compatible or acceptable and my peers are mostly against it just as much as I am. It is not about grades, but things that can actually cause financial harm to people. ",
            "date": "Answered November 13, 2017",
            "views": "588",
            "upvotes": " View 2 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Keith Albert",
                    "user_href": "/profile/Keith-Albert-2"
                },
                {
                    "user_id": "Fred Landis",
                    "user_href": "/profile/Fred-Landis"
                }
            ]
        },
        {
            "author_info": {
                "name": "Jessee Beighley",
                "href": "/profile/Jessee-Beighley"
            },
            "answer_text": "Somewhat. Officially the answer is no. I cited somethings in an English class wrogly for my PowerPoint. In my defense the class didn't go over how to cite for a powerpoint every other paper was a standard word document. I'm still not sure that I messed up or what I should have done this was never explained to me properly. Anyways while initially I was charged with plegerisum because of that upon appeal it got overturned. ",
            "date": "Answered November 13, 2017",
            "views": "239",
            "upvotes": " View 3 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Keith Albert",
                    "user_href": "/profile/Keith-Albert-2"
                },
                {
                    "user_id": "April Powell",
                    "user_href": "/profile/April-Powell-42"
                },
                {
                    "user_id": "AUBREON MILLER",
                    "user_href": "/profile/AUBREON-MILLER"
                }
            ]
        }
    ]
}