{
    "title": "What inspires you to write? - Rainbow's little journal - Quora",
    "tags": [
        "Artwork",
        "Inspiration",
        "Poems",
        "LGBTQ"
    ],
    "response": [
        {
            "author_info": {
                "name": "Ipsita Mondal",
                "href": "/profile/Ipsita-Mondal-7"
            },
            "answer_text": "What gets me to pick up that pen? What gets me to the keyboard? It's not an easy question to answer. There are a lot of things that inspire my writing, a lot of things that get the creative juices flowing, the hand writing, fingers typing, words appearing on the page. So… in order to answer this question let’s have a quick flashback of my life, around 2–3 years before from today. And, if you ask, why a flashback? Well, because that is from where, I got this habit of writing. (Lol yeah, another long ass answer so bear with me, I just can’t help with this habit of mine.)  So, few years back, my friendship with one of my best friend broke into shreds. And this happened around the end of my 9th grade, as far as I remember. And, if you are thinking if it’s like the normal story of revenge and back bitching then, sorry, it wasn’t anything like that. My story was way more twisted and harsh. Our friendship ended on a very bad note and it caused me a mental breakdown and it took me around 3 years to recover from it. Yes, which means at this moment I have somewhat got over it. So, after that incident, I honestly cried a lot. I poured buckets of tears every night thinking what went wrong until the day my tears eventually dried up, and I couldn’t feel anything more. I shut myself off from everyone and lost the ability to show emotions on my face. During those times, two of my new best friends suggested me to start writing a diary so that I could pen down my emotions if I had a hard time expressing it. At first I was hesitant, but then I thought of giving it a try. And now, I can’t express how much thankful I am two these two idiots for nagging me to write down my feelings. They literally saved me that time and raised me to who I am today. During those teen-years I also had a lot of rage growing up (due to some issues that I can’t mention) and writing helped me excise it. Writing down everything kept me from lashing out physically at other people. At that time of my life, writing was only a way to escape my problems and anger issues. Earlier, the inspiration to write was to control my emotions from leaking out and killing down my anger. My overwhelming emotions and my anger was the sole reason why I started writing. Not a great or a type of inspirational start, right?  Whenever I was sad or angry, I jotted down my thoughts. This habit of writing when when I had a bad encounter or something became an obsession and slowly I stopped expressing the emotions on my face and poured them onto paper. Later, I tried putting my thoughts into a different pattern other than normal journaling. And, from there my love for poetry began. I began to write poems, and then a few short stories. I discovered more about writing, and this time I wasn’t writing because I felt sad or angry, but this time it was because I felt overjoyed to find happiness in this process of noting everything down. Writing became a release first, but now, it’s a joy. Sometimes it’s like I have an great idea floating in my head and when I pen it all down, it’s such a great relief! Sometimes there are days when it gets really hard and I can hardly form a sentence or two. I don't know how else to explain that. Just that literally, the more I write the easier it gets and the more I want to write. Sometimes it's a burden but I seem to hit a point even on those days where it starts feeling better. To me, writing is like a drive, a desire, a tic, an itch. And what is the inspiration for writing?  Well, it was something else before and it is something else now. As the years went by, the source of my inspiration changed significantly. Well, I try to find inspiration in everything. The constant little things in life spurn an idea in my mind. A small snatch of an overheard conversation sometimes ends up being a nugget in my writings, or maybe an entire concept.A news story, a thing somebody says, the little observations I make about the weather, about nature, about people, everything! Inspiration can come from anywhere. Little observances made throughout the day that spark my imagination. Sharing my story or that of someone else or even about a fictional piece of work, they all are a powerful tool. If you take away writing from my life, it would be as if to loose the ability to speak, or to hear, as if the very senses that give you the ability to live a meaningful life would cease to function. That’s what it would be like to quit writing. I would feel muted. It’s about which part of me I can bring out, through my writings. It is in those moments that when I write, I find my voice. My purpose. My meaning.  P.S: Special thanks to Vinnie to help me sort and organize all my thoughts together. ~ Ipsita Mondal Choose what helps your heart bloom! ♡ ",
            "date": "August 19, 2020",
            "views": "2",
            "upvotes": " View 40 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Sophia Louise",
                    "user_href": "/profile/Sophia-Louise-38"
                },
                {
                    "user_id": "Revai Rivaille",
                    "user_href": "/profile/Revai-Rivaille"
                },
                {
                    "user_id": "Sonia Sharma",
                    "user_href": "/profile/Sonia-Sharma-1746"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/Alyssa-1886"
                },
                {
                    "user_id": "Arun K M",
                    "user_href": "/profile/Arun-K-M-2"
                },
                {
                    "user_id": "Vaishnavi Singh",
                    "user_href": "/profile/Vaishnavi-Singh-840"
                },
                {
                    "user_id": "Kyle Prado",
                    "user_href": "/profile/Kyle-Prado-2"
                },
                {
                    "user_id": "Ritik Gupta",
                    "user_href": "/profile/Ritik-Gupta-94"
                },
                {
                    "user_id": "Mita Patnaik (ମିତା ପଟ୍ଟନାୟକ)",
                    "user_href": "/profile/Mita-Patnaik-ମିତା-ପଟ୍ଟନାୟକ"
                },
                {
                    "user_id": "Raj",
                    "user_href": "/profile/Raj-4133"
                }
            ]
        },
        {
            "author_info": {
                "name": "Aditya Chouhan",
                "href": "/profile/Aditya-Chouhan-98"
            },
            "answer_text": "What inspires me to right ? Hm , it's you guys The quora family . I am no stretch by any imagination . I joined quora 6 - 7 months ago , found an anime blog . Was promoted to contributor . The only thing I could contribute was my artwork . It's not like I can't write the answers,just I wasn't sure of my writing skills . I was a silent reader who kept to read other’s answers . I was amazed by seeing the answers of other qourans who are now part of the family . Those answers were well written and the catch is that I also had the knowledge of particular things in those answers but i couldn't write because i questioned myself that i couldn't use attractive words, correct grammar etc It was at that moment i decided to extract as much knowledge as i can from who guys . Hahaha saying in an intense way . Got some courage to write short answers not for the sake of views or upvotes , just to see how can I Express myself. Show your skills not to impress but to Express yourself . - classmate notebook I started from the start . The thing that inspires me to write is because I don't want be static . Just keep going and you will improve . Now in this answer also there will be hell amount of errors but i will definitely improve .  ",
            "date": "August 18, 2020",
            "views": "192",
            "upvotes": " View 13 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Ravit Joshi",
                    "user_href": "/profile/Ravit-Joshi-1"
                },
                {
                    "user_id": "Vinay Khanduri",
                    "user_href": "/profile/Vinay-Khanduri-7"
                },
                {
                    "user_id": "Utkarsh Pratap Singh",
                    "user_href": "/profile/Utkarsh-Pratap-Singh-34"
                },
                {
                    "user_id": "Deepshikha Pandey",
                    "user_href": "/profile/Deepshikha-Pandey-41"
                },
                {
                    "user_id": "Kalyan",
                    "user_href": "/profile/Kalyan-285"
                },
                {
                    "user_id": "Soumya Ranjan",
                    "user_href": "/profile/Soumya-Ranjan-810"
                },
                {
                    "user_id": "Vishal Singh",
                    "user_href": "/profile/Vishal-Singh-2268"
                },
                {
                    "user_id": "Prateek Kashyap",
                    "user_href": "/profile/Prateek-Kashyap-67"
                },
                {
                    "user_id": "Bhargav",
                    "user_href": "/profile/Bhargav-88"
                },
                {
                    "user_id": "Ipsita Mondal",
                    "user_href": "/profile/Ipsita-Mondal-7"
                }
            ]
        },
        {
            "author_info": {
                "name": "Ryuzen Ichinose",
                "href": "/profile/Ryuzen-Ichinose"
            },
            "answer_text": "You guys. I’ve never written or posted anything before joining these spaces on Quora. But seeing you guys here all active an contributing, I felt like I should also pen down my ideas. Have some people to share them with. Thanks a lot for that. And yes it’s short because I don’t really have much else to say. ",
            "date": "August 18, 2020",
            "views": "138",
            "upvotes": " View 11 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Vishal Singh",
                    "user_href": "/profile/Vishal-Singh-2268"
                },
                {
                    "user_id": "Kalyan",
                    "user_href": "/profile/Kalyan-285"
                },
                {
                    "user_id": "Aastha Singh",
                    "user_href": "/profile/Aastha-Singh-548"
                },
                {
                    "user_id": "Vinay Khanduri",
                    "user_href": "/profile/Vinay-Khanduri-7"
                },
                {
                    "user_id": "Deepshikha Pandey",
                    "user_href": "/profile/Deepshikha-Pandey-41"
                },
                {
                    "user_id": "Utkarsh Pratap Singh",
                    "user_href": "/profile/Utkarsh-Pratap-Singh-34"
                },
                {
                    "user_id": "Sheereen",
                    "user_href": "/profile/Sheereen-3"
                },
                {
                    "user_id": "Aditya Chouhan",
                    "user_href": "/profile/Aditya-Chouhan-98"
                },
                {
                    "user_id": "Rudra Rana",
                    "user_href": "/profile/Rudra-Rana-25"
                },
                {
                    "user_id": "Ipsita Mondal",
                    "user_href": "/profile/Ipsita-Mondal-7"
                }
            ]
        }
    ]
}