{
    "title": "What tips can you offer a new writer? - Quora",
    "tags": [
        "Creating Writing Advice",
        "Creative Writing",
        "Writers and Authors",
        "Writing Advice",
        "Writing"
    ],
    "response": [
        {
            "author_info": {
                "name": "Piper Punches",
                "href": "/profile/Piper-Punches"
            },
            "answer_text": "Congratulations on taking the first step toward your creative journey! The first tip I will give you as a new writer is to have fun. Write with abandon and always write for you. There will come a time in your writing journey where you will have readers and fans. You will want to please these people. This is natural. Making your readers happy is important or you won’t sell your works, right? There’s danger in writing for others, though. When you write for others, you lose track of your voice. You question your storytelling ability and the creative spark inside you doesn’t flicker like it once did. Always write for yourself first because authenticity matters. When you write freely and please yourself, everything else falls into place. Find Your Circle My next tip is to find a supportive circle. Not everyone will support your writing the way you want them to. Some people will think your writing is nothing more than a hobby. Others might be very critical and urge you to put away your thoughts and live a “normal” life. These are not the people you want in your circle. In my circle, I have a few creatives like myself, but I also have people who haven’t chosen the creative path. Although these people don’t think like I do or have the same aspirations as me, they raise me up and encourage my storytelling. Surround yourself with people who get you even if they’re not like you. Know What Constructive Criticism Is Know the difference between constructive criticism and trolls. If part of your writing journey includes publishing your works for an audience, learn to recognize the difference between helpful criticism and mean-spirited comments. Constructive criticism improves your writing. It points out weak spots that sometimes we can’t see because we’re in the trenches with our story. A critical analysis of your work isn’t a personal attack. It’s feedback that gives you an extra boost for your story and helps your career to reach its fullest potential. The motive behind mean-spirited comments is to tear you down. Most people, if they aren’t fond of a story, will not tell people to rip up the book. They won’t leave a 1-star review that says, “If this had been an actual book I would have tossed it in the garbage, but I didn’t want to lose my Kindle over a bad piece of writing.” Yes, that’s an actual comment I received five years ago for a book I wrote that, thankfully, many more people loved. In fact, it was an Amazon bestseller. This leads me to my final point. Don’t let others' opinions of your writing stop you from doing what you love. I’ll be honest. The 1-star review I received hurt a lot. It dug deep and made me question whether writing was something I should be doing. But you know what? It made me better. It made me realize that if writing as a career was something I wanted to pursue; I would have to take the good with the bad. I would fail and have to rise again, bruised but with more knowledge and more resources to create amazing work. Storytelling is an amazing gift and more stories need sharing in this crazy world we live in. Thank you for sharing your gift. Piper Punches is an Amazon best-selling author of The Waiting Room, Missing Girl (a novella), and 60 Days. She is also the creator of The Murder Lawyer Series, a novelette series, about family and murder. Would you like to read the first story, When Luck Dies, for free? Get your free copy of this novelette here. ",
            "date": "Answered January 14, 2019",
            "views": "476",
            "upvotes": " View 10 Upvoters",
            "upvoters": [
                {
                    "user_id": "Fatimah An-Nabilah",
                    "user_href": "/profile/Fatimah-An-Nabilah-1"
                },
                {
                    "user_id": "Bhanu Prakash Thurram",
                    "user_href": "/profile/Bhanu-Prakash-Thurram"
                },
                {
                    "user_id": "Anisha Khatoon",
                    "user_href": "/profile/Anisha-Khatoon-28"
                },
                {
                    "user_id": "Barbara Rich",
                    "user_href": "/profile/Barbara-Rich-22"
                },
                {
                    "user_id": "Just A Human",
                    "user_href": "/profile/Just-A-Human-63"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/Round-Omo-Valley-Tour-Firew-Fikadu"
                },
                {
                    "user_id": "Catherine Lanski",
                    "user_href": "/profile/Catherine-Lanski"
                },
                {
                    "user_id": "Exotic Dray",
                    "user_href": "/profile/Exotic-Dray"
                },
                {
                    "user_id": "Malky McEwan",
                    "user_href": "/profile/Malky-McEwan"
                },
                {
                    "user_id": "Avinash Singh",
                    "user_href": "/profile/Avinash-Singh-3046"
                }
            ]
        },
        {
            "author_info": {
                "name": "Kevin Hong",
                "href": "/profile/Kevin-Hong"
            },
            "answer_text": "I just published my first book, The Outlier Approach, which has been an Amazon Bestselling book for nearly 5 weeks now Prior to this, given my experience, I am very familiar with launching products. One of my startups grew to a valuation of $15M after I raised over $4M. So I was familiar with product launches not necessarily book launches or even writing for that matter!!! Now, most of the time when you talk to an agent or a book consultant, they will ask you generally the following: What do you want to get out of book?Who is your target audience?What is your short-term/long-term goal of this book?The problem is, most people have a book in them, but very few have the drive to finish one. To start strategizing and thinking of it a s business or career endeavor will discourage you to even get started!!! WRITING, WHETER IT IS FOR A BOOR OR NOT, IS JUST THE SAME GAME To quote Maya Angelou: “I've learned that people will forget what you said, people will forget what you did, but people will never forget how you made them feel.” I truly believe that great writing comes from the heart and when you start opportunistically thinking about what you can get out of it opposed to writing a great book, you’re going to fail! Write what you want as much as you want and as long as you want. Do it for fun. Enjoy it. Do it like no one will ever read your writing. As you write, you will realize there will be a theme that comes naturally to you. Let the writing come to you opposed to forcing writing out of you! To quote Michelangelou: Every block of stone has a statue inside it and it is the task of the sculptor to discover it. ... As you write, you will find a central theme that will help you guide you to something you are passionate about. Get my drift? I truly believe that is why as a first time author I was able to launch a bestselling book and currently began discussions with translating my book to Russian (I have submitted my manuscript to the largest publishing house after their request) because of the habits I created. Once you get the mindset right, here are the tips to becoming a better writer: Write a lot One of the things that helped me tremendously was writing a journal! I did it for over 17 years after moving back from Korea when I realized my English was very poor.Show your work Start a blog, post on medium, or even pratice on Quora. The goal is for you to start sharing your work. If you are coy about your writing, you can use services such as The World’s Most Popular Free Online Survey Tool which allows you to get feedback anonymously. Getting your work critiqued will be crucial for your successRead a lot Reading good literature will help you improve your writing. Save expressions and sentences you enjoy and make it your own. Come with your own version and your own style.Rinse and repeat over and over again and you will improve as a writer. Just doing these 3 things, helped my career tremendously. I am now not only an Amazon bestselling author, but many of my business articles have been published from outlets such as CNBC, Forbes, Inc, etc. Most of all, make sure you enjoy the journey and you will one day be amazed at what you will reap from what you have sowed. ",
            "date": "Answered April 8, 2018",
            "views": "394",
            "upvotes": " View 6 Upvoters",
            "upvoters": [
                {
                    "user_id": "Fatimah An-Nabilah",
                    "user_href": "/profile/Fatimah-An-Nabilah-1"
                },
                {
                    "user_id": "Just A Human",
                    "user_href": "/profile/Just-A-Human-63"
                },
                {
                    "user_id": "Catherine Lanski",
                    "user_href": "/profile/Catherine-Lanski"
                },
                {
                    "user_id": "Sonja Hänig",
                    "user_href": "/profile/Sonja-Hänig"
                },
                {
                    "user_id": "Daydream Warrior",
                    "user_href": "/profile/Daydream-Warrior"
                },
                {
                    "user_id": "Ubay Kartik",
                    "user_href": "/profile/Ubay-Kartik"
                }
            ]
        }
    ]
}