{
    "title": "What are some of the best Statistics books? - Quora",
    "tags": [
        "Book Lists",
        "Best of X",
        "Statistics (collected data)",
        "Statistics (academic discipline)",
        "List Question",
        "Book Recommendations"
    ],
    "response": [
        {
            "author_info": {
                "name": "William Chon",
                "href": "/profile/William-Chon"
            },
            "answer_text": "There are a lot of interesting books related to statistics, but I'll try to list the few that I thought were particularly interesting and easy for a layman to understand. Before giving these recommendations though, I'd like to preface it by saying that statistics is very ubiquitous and can be a topic of many books in various formats. The books that I'm recommending are my favorites, and give you a greater appreciation of statistics, and for a good reason - they're very well written by great authors. Amazon.com: Naked Statistics: Stripping the Dread from the Data (9781480590182): Charles Wheelan, Jonathan Davis: Books is an awesome book. I studied statistics in college and this book introduces some of the most popular concepts about statistics in a friendly manner that is very easy to understand. Going off on a tangent, I highly suggest also reading another book written by Charles Wheelan, Naked Economics: Undressing the Dismal Science (Fully Revised and Updated): Charles Wheelan, Burton G. Malkiel: 9780393337648: Amazon.com: Books. Statistics itself is a powerful tool, and it's found across many different disciplines. I think that reading both of these books give you a better understanding of statistics, and especially how it's applied in the social sciences (economics). Amazon.com: The Signal and the Noise: Why So Many Predictions Fail - but Some Don't (Audible Audio Edition): Nate Silver, Mike Chamberlain: Books. This book shows us examples in which statistics is used throughout the world, particularly in forecasts and predictions. In addition to that, this is Nate Silver's first book. If you don't know about Nate Silver, you should definitely read up on some of the things he's done in terms of political analysis as well as analysis of sports using statistics. A good way to get an idea of the work that he's interested in is reading his website, FiveThirtyEight Beyond that, if you decide to purchase these books on Amazon, you'll be able to find further recommendations on books related to these and sift through them yourselves. A lot of the books that I myself have read recently were picked by Amazon to be likely matches to my interest. And hey, maybe reading up on how Amazon makes these recommendations (another statistics topic, machine learning!) may pique your interest. But from my experience, the three books that I have listed above are a great foundation to start from before exploring other books. ",
            "date": "Answered May 1, 2015",
            "views": "146",
            "upvotes": " View 11 Upvoters",
            "upvoters": [
                {
                    "user_id": "Gustavo Meza",
                    "user_href": "/profile/Gustavo-Meza-1"
                },
                {
                    "user_id": "Tung Nguyen",
                    "user_href": "/profile/Tung-Nguyen-308"
                },
                {
                    "user_id": "Hien Trang Dang",
                    "user_href": "/profile/Hien-Trang-Dang"
                },
                {
                    "user_id": "Michelle Taupier",
                    "user_href": "/profile/Michelle-Taupier"
                },
                {
                    "user_id": "Sriram YS",
                    "user_href": "/profile/Sriram-YS"
                },
                {
                    "user_id": "Siddhartha M",
                    "user_href": "/profile/Siddhartha-M-9"
                },
                {
                    "user_id": "Levi Thatcher",
                    "user_href": "/profile/Levi-Thatcher"
                },
                {
                    "user_id": "Shoumi Sarkar",
                    "user_href": "/profile/Shoumi-Sarkar"
                },
                {
                    "user_id": "Jay Chen",
                    "user_href": "/profile/Jay-Chen-7"
                },
                {
                    "user_id": "Andrew Koo",
                    "user_href": "/profile/Andrew-Koo-3"
                }
            ]
        },
        {
            "author_info": {
                "name": "Paritosh Gupta",
                "href": "/profile/Paritosh-Gupta-29"
            },
            "answer_text": "Below are some useful literature used in analytics industry for Statistics: 1. Statistics for management levin and rubin2. Basic Economics- Gujarati3. Business Statistics- for contemporary decision making -  Ken Black How to learn Statistics in best possible manner ?  1. Start following any one literature above to understand the basic concepts for ex regression.  2. Once you are good with basic concepts,  use any statistical tools- R or SAS.   Download any real life case study from google in familiar domain. If you belong to telecom domain then go with telecom domain case study.  Now apply statistical technique you have learned in case study to solve business problem.  4. Once you are good with concept, assumption, implementation, uses etc. Try to align these concepts with your present work at office.  5. Trying doing different projects in kaggle,  github and other websites.  6. Enroll for various courses in sites like Cousera.  some important topics are: 1. Types of distribution- normal, chi square, pdf etc 2. sampling techniques- random, stratified etc 3. T test,  hypothesis testing,  Annova, normality test,  chi square test and some important theorem like Central limit theorem, likelihood estimation etc 4. Regression(linear and logistics)  5. Classification and segmentation using clustering and decision tree 6. Time series (advance topic)  This is not the exhaustive list of topics but enough to make solid statistics background and make career in analytics.  P.S.- Statistics is very big, so try to learn only those topics that are really required to built your stats background.  Don't try too much to derive equations and expression of statistical techniques. All techniques are available in software like SAS/R.  You only need to understand the concepts and apply it to the problems.  If you want to shift to analytics try learning Statistics using SAS because it is widely used in analytics industry(personal recommendation) ",
            "date": "Answered April 7, 2016",
            "views": "127",
            "upvotes": " View 14 Upvoters",
            "upvoters": [
                {
                    "user_id": "Masoom Akram",
                    "user_href": "/profile/Masoom-Akram"
                },
                {
                    "user_id": "Mate Endre",
                    "user_href": "/profile/Mate-Endre"
                },
                {
                    "user_id": "Shobha Bhagwat",
                    "user_href": "/profile/Shobha-Bhagwat"
                },
                {
                    "user_id": "Aseem singhal",
                    "user_href": "/profile/Aseem-singhal-6"
                },
                {
                    "user_id": "Deep Choudhuri",
                    "user_href": "/profile/Deep-Choudhuri-1"
                },
                {
                    "user_id": "Koushik Bag",
                    "user_href": "/profile/Koushik-Bag-3"
                },
                {
                    "user_id": "Soban Jawaid",
                    "user_href": "/profile/Soban-Jawaid"
                },
                {
                    "user_id": "Abhishek Shukla",
                    "user_href": "/profile/Abhishek-Shukla-94"
                },
                {
                    "user_id": "Nishant",
                    "user_href": "/profile/Nishant-252"
                },
                {
                    "user_id": "Saurav Kumar",
                    "user_href": "/profile/Saurav-Kumar-284"
                }
            ]
        }
    ]
}