{
    "title": "What are the benefits of being a journalist? - Quora",
    "tags": [
        "Benefits",
        "Journalists",
        "Jobs and Careers"
    ],
    "response": [
        {
            "author_info": {
                "name": "Bill Husted",
                "href": "/profile/Bill-Husted-1"
            },
            "answer_text": "I'm mostly retired now after working for newspapers big and small for decades. I still write a column that I sell to a few newspapers but, for all practical purposes I'm retired and can look back on the time I spent at newspapers. As far as the benefits of working for newspapers here's what stands out for me. It's an interesting life In my early years at newspapers I was a general assignment reporter. That meant I had no particular beat, no specific area of expertise. I was sent out on stories by the editors - and the type of stories I covered varied wildly. I could receive a call at midnight from the newspaper and head out to cover a plane crash. On the other hand, I might end up covering a dog show the next day. Then on the next day I might cover a political speech. I enjoyed the fact that I'd go to work without the slightest idea of what I'd do that day. It was an adventure. I was good at it So that's no different than it would be for someone who was a good car mechanic, or an excellent architect. It's satisfying to be good at what you do. I met interesting people Over my long life I've shared a pizza with Steve Jobs (he ended up getting mad at me and stalked off leaving this poor underpaid reporter to pay for the pizza). I've introduced my wife to Bill Clinton. But I've also met \"little shots\" that really were far more interesting than the big shots including people who were nutty as a pecan orchard as well as some who became lifelong friends. I was there when newspapers were important If you are very young you have no idea how important, how influential newspapers once were. It was fun to be part of something that was seen that way. Sometimes what we did made a difference I spent some time early on covering the civil rights movement in the South. I covered it fairly as I could. I think, over time, some of what newspapers (as well as TV and radio did) changed hearts. Not by editorializing or bending the facts, but by just telling the truth and letting our readers get an inside look at what was going on. I came away from all that realizing that the readers were, by and large, smart and decent people. And that people - armed with the facts - can and do change. So, for me, those are the benefits that stand out. I'm so glad I was able to work for print newspapers during the end of their golden age. If you had told me - say 20 years ago - how print would fade in importance I would have laughed at you. But no one who cares about newspapers is laughing now. ",
            "date": "Answered December 21, 2016",
            "views": "1",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Jose Maria Ballesteros",
                    "user_href": "/profile/Jose-Maria-Ballesteros-1"
                },
                {
                    "user_id": "Dan Robrish",
                    "user_href": "/profile/Dan-Robrish"
                },
                {
                    "user_id": "Gil Hernandez",
                    "user_href": "/profile/Gil-Hernandez"
                }
            ]
        },
        {
            "author_info": {
                "name": "Hasan Zuberi (حسن زبیری)",
                "href": "/profile/Hasan-Zuberi-حسن-زبیری"
            },
            "answer_text": "The answer totally depends on you. What is your objective to become a journalist … looking for fame? Or money? … ‘cause it is all there … OR you wish to tune the world with truth … So is it the adventure, the dangers,of seeking and sharing truth that increases your heart beat rate … Or the name … ’cause as I said … its all there! ",
            "date": "Answered December 21, 2016",
            "views": "642",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Vishu Gupta",
                    "user_href": "/profile/Vishu-Gupta-24"
                }
            ]
        }
    ]
}