{
    "title": "What's a good website to host photos but protect them at the same time? - Quora",
    "tags": [
        "Photo Hosting and Sharing",
        "Photosharing",
        "Copyright Infringement",
        "Copyright Law",
        "Digital Photography",
        "Website Recommendations"
    ],
    "response": [
        {
            "author_info": {
                "name": "Jeff Phillips",
                "href": "/profile/Jeff-Phillips-17"
            },
            "answer_text": "It seems like you are asking about protection from the photo hosting website company, and not protection from someone who wishes to download or copy your images.  For the former question, the EULA (End User License Agreement) that you agree to when you sign up for a site like Flickr, PhotoShelter, SmugMug, Facebook, Twitter, Instagram, etc.  defines which rights you will compromise, while your images are on their servers and networks.   While each of these sites is clear that you always retain the copyright to the images you upload, you grant various permissions, such as allowing the site to share, use, or sub-license your images for profit.  The conditions are different for each social media or photo hosting company, and their rights typically are revoked once all of your images have been deleted, unless your images have been shared with others and still exist elsewhere on the service. If you are concerned about the latter question, and you are trying to prevent someone copying, downloading or saving a copy of your images for use elsewhere, here are some considerations.  There is no solution that is 100% effective.  Look for a website provider like squarespace.com, carbonmade.com, indiemade.com, wix.com Photoshelter.com, or other web hosting site that has the ability to set up private areas where you can assign accounts or logins to the people you want to share with (even dropbox.com can provide private folders);Use a photo editing application to add a watermark to the image area of the photo you are posting (stock photography agencies do this); Embed your contact information as metadata, which could be used later as proof of the theft. Some sites will strip this information before it is presented, though;Use javascript in your web pages to disable right-clicking on an image, so that it is more difficult to save the image to disk;Use the lowest acceptable resolution (pixel dimensions) possible, which may prevent someone from stealing it for use in print, such as a brochure or magazine.In the footer of your web page gallery (or in any context where one of your photographs appears), be clear about the license that you are granting the reader/visitor and that it is copyrighted. This is not required to protect your image, but it may reduce the amount of times that your images are casually shared on the web, without attribution to you.Remember, if someone really wants to use your image, they probably can. Even if you take precautions like using low resolution images or disabling right-click saving, a person can still make a screen capture of your image. ",
            "date": "Answered August 10, 2014",
            "views": "13",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Bryan Silverman",
                    "user_href": "/profile/Bryan-Silverman-2"
                },
                {
                    "user_id": "Luis Garcia",
                    "user_href": "/profile/Luis-Garcia-75"
                },
                {
                    "user_id": "Daniel E. Casale",
                    "user_href": "/profile/Daniel-E-Casale"
                }
            ]
        },
        {
            "author_info": {
                "name": "Daniel Foster",
                "href": "/profile/Daniel-Foster-9"
            },
            "answer_text": "Photoshelter and Smugmug have photo protection features as does 500px. There's also a new solution, PixelRights, that protects your images from download and scraping:Pixelrights - Portfolio builder for photographers Flickr also has a good private albums feature. You might also try Picasa for your usage case.  If you want absolute peace of mind, you can also use a photo monitoring service such as PIXSY that scans the Internet for copies of your photos. That way you will know if the picture is ever distributed without your consent. ",
            "date": "Answered November 20, 2015",
            "views": "679",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Wassim Zoghlami",
                    "user_href": "/profile/Wassim-Zoghlami-1"
                },
                {
                    "user_id": "Nadia Reckmann",
                    "user_href": "/profile/Nadia-Reckmann"
                }
            ]
        }
    ]
}