{
    "title": "What are some of the best poetry sites? - Quora",
    "tags": [
        "Website Recommendation Lists",
        "Writing Poetry",
        "Poems",
        "Poetry",
        "Creative Writing",
        "Literature",
        "Website Recommendations"
    ],
    "response": [
        {
            "author_info": {
                "name": "Michel Clark",
                "href": "/profile/Michel-Clark-7"
            },
            "answer_text": "What you are looking for is a web poetry workshop, an area wherever you post your poems et al. post comments on them. (At most workshops, you're conjointly expected to investigate alternative people's poems. typically you must post a minimum of 2 or 3 critiques of alternative people's work for each literary work of your own that you just post for others to critique.)There are many various workshops, designed for writers at many various levels of expertise. You must continuously pay it slow reading before you opt to begin posting your poems at any website. starting poets usually notice that they cannot handle the hard-hitting criticism that's common at additional advanced sites.When commenting on alternative people's poems, it is often best to deal in specific details. do not simply say, \"That's entirely awesome\" or \"That entirely sucks.\" point out what precisely works for you in an exceedingly literary work, and what does not work, and why. Alternative workshop participants get pleasure from thoughtful, well articulated comments, and  notice that golf stroke into words what is right and wrong concerning alternative people's writing will cause you to a much better critic of your own work, and therefore a much better writer. ",
            "date": "Answered January 11, 2016",
            "views": "25",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Garima Kimothi",
                    "user_href": "/profile/Garima-Kimothi-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Shana Chen",
                "href": "/profile/Shana-Chen-3"
            },
            "answer_text": "I have published a few poetry works and spend a lot of time posting online. Here are the places I typically go to post poetry, all of them have apps that accompany them as well. Commaful: Great for bringing poetry to life in its unique format. Really active community Wattpad: More of a young audience, mostly for novels, but also has a lot of poetry Medium: mostly thought pieces and articles, the poetry here is typically more formal 20lines: I’ve heard good things, though never personally used it ",
            "date": "Answered December 26, 2017",
            "views": "103",
            "upvotes": " View 222 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Grace Ibrahim",
                    "user_href": "/profile/Grace-Ibrahim-2"
                },
                {
                    "user_id": "Gary Daniels",
                    "user_href": "/profile/Gary-Daniels-59"
                },
                {
                    "user_id": "John Milne",
                    "user_href": "/profile/John-Milne-43"
                },
                {
                    "user_id": "Latanya",
                    "user_href": "/profile/Latanya-2"
                },
                {
                    "user_id": "Jordyn",
                    "user_href": "/profile/Jordyn-31"
                },
                {
                    "user_id": "Carissa",
                    "user_href": "/profile/Carissa-27"
                },
                {
                    "user_id": "Hilary",
                    "user_href": "/profile/Hilary-54"
                },
                {
                    "user_id": "Matze Karajanov",
                    "user_href": "/profile/Matze-Karajanov-1"
                },
                {
                    "user_id": "Cassidy",
                    "user_href": "/profile/Cassidy-66"
                },
                {
                    "user_id": "Harrison Jones",
                    "user_href": "/profile/Harrison-Jones-87"
                }
            ]
        }
    ]
}