{
    "title": "What type of photography are you good at? - Quora",
    "tags": [
        "Photographers",
        "Digital Photography"
    ],
    "response": [
        {
            "author_info": {
                "name": "BC Liang",
                "href": "/profile/BC-Liang"
            },
            "answer_text": "I’m not sure to what “good” refers, but what I “do” is FILM photography, preferably large format (although I also ‘do’ small and medium format as well). The process of slowing down to the bare essentials of a box, a hole, a lens and a piece of film makes me think of what the composition and the output desired might be, and the limits thereof. The settings - from aperture to shutter speed - based on what the film being used, can create an image in a way that is different than using photoshop or lightroom per se. That can then be continued with the processing of the film, and printing of the image. After close to 50 years, I still cannot describe the excitement I feel when looking at the negative for the first time, or seeing the print develop before my eyes. I’ve been fortunate enough to use this process on the streets of Pune to the landscapes of China, from the tops of the Rockies to the depths of Death Valley. It’s a great ride and one I hope to continue. Whatever your medium or style of choice is, I wish you the best in this photographic adventure. There’s nothing quite like it.  Vancouver, BC. Photo copyright of the author. ",
            "date": "Answered September 29, 2017",
            "views": "254",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Tuan Nguyen",
                    "user_href": "/profile/Tuan-Nguyen-355"
                }
            ]
        },
        {
            "author_info": {
                "name": "Lana Pajdas",
                "href": "/profile/Lana-Pajdas"
            },
            "answer_text": "1)Museum Photography This one is not even among my best, but it shows what is important - there is an object, a space, and people inside. A story of experience of visiting museums.  (location: Museum of Ancient Art, Lisbon, Portugal) 2)People on places I take picture of places with people on. I tell the stories of an experience of being somewhere, outdoors, at particular spot and in a moment. I always try to keep people’s faces difficult to recognize, and to take pictures from their backs, or from some distance. In Europe it’s not a big issue to take pictures of people. I know that in some parts of the world it would be the issue, but everyone is welcome to ask politely for a picture. I just want to show some kind of enjoyment, positivity, or maybe some kind of struggle or a need to raise awareness about something. This is one of my pictures of that kind.  (location: Zagreb, Croatia) I like vertical pictures more than horizontal ones. I see them as immersive. ",
            "date": "Answered January 5, 2018",
            "views": "14",
            "upvotes": " View 5 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Charles Haacker",
                    "user_href": "/profile/Charles-Haacker"
                },
                {
                    "user_id": "Scott Hughey",
                    "user_href": "/profile/Scott-Hughey-1"
                },
                {
                    "user_id": "Gaurav Kumar",
                    "user_href": "/profile/Gaurav-Kumar-715"
                },
                {
                    "user_id": "Roushan Kumar Chandan",
                    "user_href": "/profile/रौशन-कुमार-चंदन-Roushan-Kumar-Chandan"
                },
                {
                    "user_id": "Maja Burazin",
                    "user_href": "/profile/Maja-Burazin-1"
                }
            ]
        }
    ]
}