{
    "title": "What are some examples of academic dishonesty? - Quora",
    "tags": [
        "Academic Dishonesty",
        "Dishonesty",
        "Academic Plagiarism and Cheating",
        "Academia",
        "Academic Research"
    ],
    "response": [
        {
            "author_info": {
                "name": "Paul Hywel-Evans",
                "href": "/profile/Paul-Hywel-Evans"
            },
            "answer_text": "Academic dishonesty comes in several flavors, they all revolve around claiming something that is not theirs or that they say they have found. As I put in an earlier post there was a student who quite literally made up his experimental results because the experiments did not work. Fabrication of results is a very tempting thing to do or disclosing only those that match what you want is a terrible thing. So is pinching work of others to make you look good. Plaigerism is a very deceitful and quite literally painful thing. Sometimes the perpetrators are doing it to keep their jobs and to get extra credit but they are lying to themselves and everybody else. Examples are. Student at staffs Uni that made up all his results because his experiments did not work. He was stripped of his PhD by the university. Student at Hamburg University copied the results from another published PhD and claimed them himself. He was found out and stripped of his PHD. A Inverse gel was created by using super hydrophobes, (think of an emulsion but backwards) A member of staff reported that he had “discovered this technology” to keep his position, when it was found out he was dismissed. A PhD students thesis was published by a member of staff who obtained the students research records before the student finished, I don’t know what happened but that selfish action put the students PhD under threat. These are just a tiny few of the wrongful things that have happened and continue to happen. The problem is there are always going to be those who try to steal intercultural ideas of others because it is not illegal (as I have been shown). It should be illegal but its not. ",
            "date": "Answered February 14, 2020",
            "views": "81",
            "upvotes": " View Sharers ",
            "upvoters": [
                {
                    "user_id": "Jun Dong",
                    "user_href": "/profile/Jun-Dong-15"
                }
            ]
        },
        {
            "author_info": {
                "name": "Aj.Raymond James Ritchie",
                "href": "/profile/Aj-Raymond-James-Ritchie"
            },
            "answer_text": "There are two types of scientific fraud (a) the cheap and nasty types attempted by those who do not understand what they are working on (easy to detect) and (b) the psychopathic genius types who get it into their head that everyone else in the world is dog-meat and you can tell them anything. Paradoxically they are often publish quite good work as well and so where does the reliable stuff end and the fraud begins? The other field of academic dishonesty is the almost universal problem that most academics are not honest with their students, post-docs and junior colleagues about the perversely poor career structure in academia and how poor their career prospects actually are. Perhaps they cannot face up to the reality that academia is not a real meritocracy and much depends on shear dumb luck and whose mate you are. ",
            "date": "Answered February 14, 2020",
            "views": "188",
            "upvotes": " View 1 Upvoter "
        }
    ]
}