{
    "title": "What are some good blogging topics? - Quora",
    "tags": [
        "Blog Topics",
        "Topics",
        "Blog Writing",
        "Blogging Advice!"
    ],
    "response": [
        {
            "author_info": {
                "name": "Pooja Khare",
                "href": "/profile/Pooja-Khare-5"
            },
            "answer_text": "The whole idea of blogging itself is so cool! Your blog is your voice, your perception, your opinion and above all, your true self! So you clearly know what you can be penning down. If you're yet completely clueless about how to get started, maybe you should have a look at this list I've made exclusively for this question, and decide yourself. Countless ideas are already at work, but here are a few ways to find out which one suits your forte the most.. things you've done in the past and have an experience of travelling, trekking and camping One of the most popular genre of blogging these days. If you're someone who likes to travel and discover new places, maybe you should try displaying your memories publicly! adventure sports, biking, and driving. Sharing a few moments of your adventurous life on your blog can get you all the attention you ever wanted yoga, workout and gyming you might know how fitness has become the talk of the town, and every other person is looking for solutions on the internet. You can surely be of some help to these people through your blog! vlogging (video+blogging) I'm sure you yourself must have subscribed to a few vloggers on youtube, facebook and other websites. Vlogging is the new trend and people are loving it everywhere. the stuff you're good at photography Photography blogs stand apart. You can try posting some insanely unique and unbelievable pictures on your blog and who knows if they become the talk of the town! cooking, kitchen hacks Bring out all your cooking skills online if you're the chef of your family, and let people all around the world savour your unique recipes and cooking ideas.. crafts, clay modelling, and designing Are you good at recycling used stuff into good crafts and designer showpieces? Then you've got to make your ideas public through your blog. Comedy, trolling Everyone loves a good laugh, and so do I. Funny quotes and articles are really fun to read at times. So if you've got a good sense of humor, you can set the ball rolling on your blog. things you find interesting and have a lot of knowledge about tech goods, gadgets, and appliances Blogs about latest inventions and innovations in the tech world can be quite interesting for a lot of gadget freaks all around the world and such blogs have crazy fan following! lifestyle and luxury Lifestyle blogs are too easy. You believe your ideas about lifestyle are worth sharing? Maybe you should try showing off your luxury through your blog and you might end up having a good following on your blog! fashion, make up and make overs Flaunt your stylish wardrobe and accessories through your fashion blog or maybe you can shoot tutorials for all the fashion maniacs and fetch some good compliments from people online! food, cuisines and restaurant reviewing I'm a big foodie myself and I love food bloggers more than anything else. Bring out your Anton Ego and start reviewing your favorite restaurants and dishes you've had so far on your blog and make it huge! Blogging is not an easy thing though. Keeping your blog updated all the time can also be a pain in the neck at times. But it's purely fun, if you're considerate about your thoughts and know well how to express them wisely. P. S. Upvote the answer! ",
            "date": "Updated October 17, 2018",
            "views": "19",
            "upvotes": " View 44 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Priyanka Sukhwani",
                    "user_href": "/profile/Priyanka-Sukhwani"
                },
                {
                    "user_id": "Ali Raza",
                    "user_href": "/profile/Ali-Raza-2444"
                },
                {
                    "user_id": "James Bosire",
                    "user_href": "/profile/James-Bosire"
                },
                {
                    "user_id": "Chinwendu Ngozi Ebelebe",
                    "user_href": "/profile/Chinwendu-Ngozi-Ebelebe"
                },
                {
                    "user_id": "Deepak Jain",
                    "user_href": "/profile/Deepak-Jain-450"
                },
                {
                    "user_id": "Lummy Boom",
                    "user_href": "/profile/Lummy-Boom"
                },
                {
                    "user_id": "Rupa Khamrai",
                    "user_href": "/profile/Rupa-Khamrai"
                },
                {
                    "user_id": "Satyam Official",
                    "user_href": "/profile/Satyam-Official-1"
                },
                {
                    "user_id": "Shatakshi Gupta",
                    "user_href": "/profile/Shatakshi-Gupta-67"
                },
                {
                    "user_id": "Ikbal Singh",
                    "user_href": "/profile/Ikbal-Singh-8"
                }
            ]
        },
        {
            "author_info": {
                "name": "Jan Rossi",
                "href": "/profile/Jan-Rossi"
            },
            "answer_text": "Any topic that addresses a problem or concern for your audience is a topic that will be read and shared to the masses. If you just want to talk about the same old things everyone else is talking about….ho…hum…. cobwebs. Try and use the questions from your Facebook page and make thorough blog post answers. Know that when one customer asks a question there are probably 10 other people too shy to ask the question and they are eager for your response. Are you using Google Alerts? This is a very easy method to find out what is happening in your industry. If you are in the florist business and you set up Google Alerts to send you an email whenever someone talks about “floral” or “flower business” or even specifically “martha washington roses” then you will have something new to discuss. I would take these great gems and sometimes just link to the articles on my business page. It makes people see your social media account as very forward thinking and ontop of the industry. In some cases these lovely gems being sent to my in-box give me the coolest ideas for blog posts. I take an idea and find other sources and then make a totally fresh approach to the topic. Be sure to write in a manner that is readable for the masses. If you cannot remember how to spell a word - use a different word. Add some fun with your titles. Talking about 2 different types of geraniums? Call your post “A Tale of 2 Geraniums” or “Ditto! I’ll Take Two!” Make your titles and subheading dynamic and always use headers and keywords to further get indexed by Mama Google. I can write on subjects that interest me - if you ask me to write about insurance my eyes roll back into their sockets (had to quit that gig). So choose topics that make sense to your clients, your business, your community - and all will be fine! Best of luck! ",
            "date": "Answered July 11, 2016",
            "views": "56",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Bat Thyme",
                    "user_href": "/profile/Bat-Thyme"
                }
            ]
        }
    ]
}