{
    "title": "What’s the best taekook fanfic? - Quora",
    "tags": [
        "Taekook",
        "Fanfic"
    ],
    "response": [
        {
            "author_info": {
                "name": "Sarah Grace",
                "href": "/profile/Sarah-Grace-403"
            },
            "answer_text": "*Inhales* wHOA. I have a bunch from Ao3 that I highly recommend. As a hardcore Taekook shipper, I gotchu! I only got 3 of them at the moment, but hope you’ll read them and like them :D I have a bookmarked list at: Archive of Our Own Just use the filters on the right and enter in at “Other tags to include” just Jeon Jungkook/Kim Taehyung | V There you’ll get a cRAP ton of Taekook fanfictions I’ve liked. Mind you, most of them do have smut. So I’m sorry if you want your innocence preserved TwT #1 Keep your pencil on my skin: This one was the best one I had read. It hit me right in the feels and it was so beautiful I cried. It does have smut in the last chapter so skip it if you feel uncomfortable. Link: https://archiveofourown.org/works/13970322 #2 Eclipse It’s a supernatural AU! :D Eclipse has really good plot and the story flows very nicely. It also has multiple smut chapters. So again, skip those if you don’t like it. Link: https://archiveofourown.org/works/13170726/chapters/30124269 #3 Serve & Protect Police AU! Storyline was great and Jungkook is an angsty baby in this one. Also. Whispers “Smut.” Hope you look these up and enjoy. If not you can also look at someone else’s answer TwT ",
            "date": "Answered April 14, 2019",
            "views": "332",
            "upvotes": " View 40 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Palak Goyal",
                    "user_href": "/profile/Palak-Goyal-166"
                },
                {
                    "user_id": "Anushka Pal",
                    "user_href": "/profile/Anushka-Pal-38"
                },
                {
                    "user_id": "Zahin Rashid Faiza",
                    "user_href": "/profile/Zahin-Rashid-Faiza"
                },
                {
                    "user_id": "Nikita Ruke",
                    "user_href": "/profile/Nikita-Ruke"
                }
            ]
        }
    ]
}