{
    "title": "What are some great writing exercises that teach me how to think about and develop better fictional characters? - Quora",
    "tags": [
        "Fiction Writing",
        "Fictional Characters",
        "Writers and Authors"
    ],
    "response": [
        {
            "author_info": {
                "name": "Sage Williams",
                "href": "/profile/Sage-Williams-18"
            },
            "answer_text": "Personally, I like to imagine what the scenario will be like in real life. Fictional characters are just like real-life people, that's how we make our stories realistic and relatable. And in order to better develop these characters, put yourself in the situation, and/or in their shoes, and think about what they would say in the conversation. If you're unable to think of anything because you don't know what the person would say, then maybe you can think about the personality traits that you want the character to have. For instance: If the character is very nice and reserved, they likely won't participate in the conversation much at allIf the character is typically shy around people they are unfamiliar with but more extroverted around their friends, then in a conversation with a stranger, their sentences will be shorter, while around their friends, they may be more likely to speak longer and more frequently. You can then decide if you want them to be sarcastic, or funny, or optimistic, etc.If the character is very loud, they are likely to talk a lot, and voice their opinions whenever they get the opportunity to. Maybe, if you want to add more depth, you can make this character present themself as very indifferent about their troubles, but in truth, they have a lot of internal suffering and stress that comes out the more the main character gets to know them. Or, the main character can be them.At the end of the day, characterization is really up to the author. Ergo, it's up to you. When you think about a character, try to think about a backstory — what makes them who they are? Have any childhood experiences affected their personality/confidence/self-esteem (etc.)? You can also think about how they act when they first meet someone, and when they get to know the person better. Think about your character's strengths, flaws, and how you want them to contribute to the story. You can think about how they interact with a group of people versus one person. Is it different? Are they more reserved/outspoken? For me, the best thing to use is real life. The people around you are examples of what people are like in real-life, so maybe you can base your characters off someone you know. Or, at least, some personality traits. Understand your characters like you would one of your family members or friends. If there's something you can't seem to figure out, just remember that the characterization is completely up to you. And how you build this character will affect the story, so you can shape your characters based on the storyline you have planned. I wouldn't worry too much about whether a character is 'good' or not. No character is good or bad, it's just whether the author/writer ends up writing something out-of-character for a particular character in the story. So, there's no good or bad, just make sure you know who you want your character to be, and stick to it. For character development, you can think about how you want this character to be like at the end of the story. If you already have a plot planned, you can think about how the major events in the plot will affect this character. Because characterization is most effectively learned through observing real-life people, I wouldn't say writing exercises would help all that much, because it could really take away the raw and authentic aspect of making your characters. Just like how you don't practice your responses to what your friends say to you on a daily basis, you probably wouldn't want to do that for your character, either. Jusr treat your character like a real person. Don't overthink characterization. Go with the flow of the story, and what you think is realistic and beneficial to your story. Hope this helped, all the best with your writing! ",
            "date": "Answered September 11, 2018",
            "views": "204",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "David Rempel",
                    "user_href": "/profile/David-Rempel-11"
                },
                {
                    "user_id": "Drayton Alan",
                    "user_href": "/profile/Drayton-Alan"
                }
            ]
        },
        {
            "author_info": {
                "name": "Sheri Fresonke Harper",
                "href": "/profile/Sheri-Fresonke-Harper"
            },
            "answer_text": "A great character is: Emotional, so exercises writing about different emotions and how they affect a human body, and the variation can be very helpful.Faced with conflict, so identifying a list of conflicts can be helpfulReactive to others, so looking for psychological explanations for what happens to a person when faced with grief, change, mental illness, exhaustion, envirnmental changes, stress, etc can be helpful for creating empathy or other reactionsActive, so knowing about jobs, places, hobbies can be enriching to a character definitionCommunicative so learning various ways of speaking, talking, etc can provide a fuller view of a character",
            "date": "Answered September 11, 2018",
            "views": "101",
            "upvotes": " View 3 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Karen Marie Shelton",
                    "user_href": "/profile/Karen-Marie-Shelton"
                },
                {
                    "user_id": "William Johansson",
                    "user_href": "/profile/William-Johansson-14"
                },
                {
                    "user_id": "Bennett W. Nelson",
                    "user_href": "/profile/Bennett-W-Nelson"
                }
            ]
        }
    ]
}