{
    "title": "What's the process to get a book published through a decent publisher as a first time author? - Quora",
    "tags": [
        "Book Publishing",
        "Publishing",
        "Writers and Authors"
    ],
    "response": [
        {
            "author_info": {
                "name": "Eleanor Lang",
                "href": "/profile/Eleanor-Lang"
            },
            "answer_text": "First, you need to write a book. I know that sounds flippant, but it isn’t meant to be; while a publishing house may initially want to see an outline and sample chapters, if you don’t know where your book is going, it will show. After you write the book, you’ll want to have another go. Clean it up. I’m not talking about typos or the occasionally misplaced comma, although it’s nice to take care of those things, too, but make sure your narrative is coherent, your characters are identifiable when they speak, and that your story is going someplace. Next, you’ll want to get a literary agent, and no, you really can’t agent your own book. The agent’s relationships are what will get your manuscript seen, and the agent has the knowledge and responsibility of negotiating a contract. So, unless you know about contracts, different types of rights, and royalties, you really need an agent. To get an agent, you’ll need to follow advice previously given. Writer’s Market, different associations for writers (SFWA, Mystery Writers, etc) will also have guidelines and you can look online. If an agent wants money up front or a fee to read your manuscript, move along. Agents typically collect 15% of your earning from the work they do, described above. Submit your manuscript to appropriate agents. That is to say, do not send a science fiction novel to someone specializing in self help books, or an academic history to someone specializing in romance novels. This is also true when the agent submits your book to a publishing house. Listen to the agent. If the agent is asking for revisions or clarifications, he or she needs that to better sell your book. The agent will submit your book. The agent will, in all probability, write cover letters. That doesn’t mean you don’t have to. For a start, you’ll need to send a cover letter with the manuscript to get the agent. Make sure that your cover letter to the agent includes anything that might help you become more marketable. Is it a cookbook and do you have culinary awards or a restaurant? Have you participated in a prestigious writing workshop? Do you know big name writers who have already offered to give a quote on your book? Are you a former talent coordinator on a morning talk show? Any detail may help. Once the agent has agreed to represent you, be prepared for a wait. The process of submitting a book and getting the book discussed in an editorial meeting can take months, and you may be asked to provide additional information during that time. If you’re lucky, one of the houses that has seen your book will agree to publish it. But hold on: you’re still probably looking as seeing the book for sale in 12–18 months. This is because other books are already on the schedule, and the publishing house needs to figure out where to schedule it, and where it will do best, both seasonally and in terms of potential competition. During that time, a lot will happen. You’ll be asked for more editorial revisions. The manuscript will then go to a copy editor and a proof reader, sequentially, and you’ll be asked to check the manuscript after each, making additional corrections and making sure that mistakes haven’t entered into the process. There will also be months of marketing, sales, and publicity. You may get phone calls asking if you’re willing to take a trip and meet buyers, or attend a trade show, or appear on local media. Whenever possible, do whatever is asked. And then, your book will go out to reviewers. Don’t read the reviews. Seriously. If there’s anything very positive, or very major, your publisher will let you know. And having said all of that, take a deep breath and write the best book that you can. ",
            "date": "Answered September 9, 2016",
            "views": "24",
            "upvotes": " View 15 Upvoters",
            "upvoters": [
                {
                    "user_id": "Maumita Ganguli",
                    "user_href": "/profile/Maumita-Ganguli"
                },
                {
                    "user_id": "Pawan Pal",
                    "user_href": "/profile/Pawan-Pal-240"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/Los-Angeles-Jaen"
                },
                {
                    "user_id": "Corgi butt",
                    "user_href": "/profile/Corgi-butt-2"
                },
                {
                    "user_id": "Lisa Adams-Lloyd",
                    "user_href": "/profile/Lisa-Adams-Lloyd"
                },
                {
                    "user_id": "Mary Carnahan",
                    "user_href": "/profile/Mary-Carnahan-2"
                },
                {
                    "user_id": "Leitha Howe",
                    "user_href": "/profile/Leitha-Howe"
                },
                {
                    "user_id": "Bruce Downing",
                    "user_href": "/profile/Bruce-Downing-1"
                },
                {
                    "user_id": "Pinky Jones",
                    "user_href": "/profile/Pinky-Jones-2"
                },
                {
                    "user_id": "Kanu Bhagwat",
                    "user_href": "/profile/Kanu-Bhagwat"
                }
            ]
        },
        {
            "author_info": {
                "name": "Michael Jecks",
                "href": "/profile/Michael-Jecks-2"
            },
            "answer_text": "First, write the book. I know it’s obvious, but a lot of people seem to think that they’ll be given a million bucks for having a good idea. No. If you’re new (or a professional of many years standing) you will have to write the thing first. Second, get an agent. It’s tedious, thinking that you have to hand over some fifteen percent of all your writing income for the rest of your life, but you need agents. They understand the contracts (I don’t); they can help knock your manuscript into better shape (you can’t); they can contact editors on a personal and professional basis and get your work in front of the right people; they can read and explain the incomprehensible spreadsheets that publishers laughingly term “plain English” royalty statements; and they can be a shoulder to cry on when the rejection letters start to come back. Editors have about 10–15 unsolicited manuscripts arriving on their desks every day. Yes, every day. If you send in your work without an agent, it will sit in an unread pile for weeks, and perhaps get a cursory glance from an English Literature student who’s paid to search for any gems. That student will see a typo on the first page, or a formatting error, or an infelicitous use of the wrong adjective, and write “Reject” across the front. They won’t get the hit if your book is the next Harry Potter, after all. They’re only there for the holidays for work experience. However, if you have an agent, you have someone whom the editor knows. And the editor will know that she (it’s almost always a woman) can trust the manuscript because the agent has read it and will only present work to the editor that will uphold the agent’s reputation. The editor will be inclined to read your work because you have an agent. After that it’s just a case of hoping that the editor likes it. They don’t always. After all, editors (I still personally find this hard to believe) tend to be moderately human. They are as objective as they can be, but with fiction, they cannot help but be subjective. If they have fallen over the cat, argued with the husband before leaving home, found drugs in the teenage daughter’s school bag, or discovered they’re likely to be made redundant, their attitude on picking up your worthy prose may not be as rosy as you might like. So good luck! ",
            "date": "Answered April 24, 2017",
            "views": "12",
            "upvotes": " View 6 Upvoters",
            "upvoters": [
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/Los-Angeles-Jaen"
                },
                {
                    "user_id": "Ushi Kak",
                    "user_href": "/profile/Ushi-Kak"
                },
                {
                    "user_id": "Sikder Diamond",
                    "user_href": "/profile/Sikder-Diamond"
                },
                {
                    "user_id": "George Anders",
                    "user_href": "/profile/George-Anders"
                },
                {
                    "user_id": "Prapti Sadh",
                    "user_href": "/profile/Prapti-Sadh"
                },
                {
                    "user_id": "Dale Thomas",
                    "user_href": "/profile/トーマス-デール-Dale-Thomas"
                }
            ]
        }
    ]
}