{
    "title": "What should you do when a splinter is infected? - Quora",
    "tags": [
        "Splinters",
        "Infections",
        "Medical Conditions and Diseases"
    ],
    "response": [
        {
            "author_info": {
                "name": "Bruce Achterberg",
                "href": "/profile/Bruce-Achterberg"
            },
            "answer_text": "I got a splinter, and it was clear the area was infected when I noticed: It was still soreIt wasn’t healingThe area around it was red and slightly raisedWhen I squeezed it, lymph (clear liquid. Clear liquid may not always be lymph, but I think this was) or pus (cream-coloured, thicker consistency liquid) came out.It had former a scab, and I was waiting to see if the infection would resolve itself before opening it up. It didn’t resolved, so I took: some medical scissors (not sure what to call them; they’re used for nails and such)tweezersa toe nail clipperAn eyeglass. I have one that has an LED light on the side, so it’s easier to see thingsI held all of the tools I used above a flame to clean them before use and let them cool down. Looking at it through the eyeglass, I drug the tweezers over the wound to see if the scab (it was more like skin) would come off, and yes, I was able to pull it aside without having to cut into it with the nail clippers, which was a good result. (Cutting leads to bleeding usually, and more risk for infection.) From there, with the scab removed and the wound exposed, I gave it a sustained squeeze to see what came out. A long, cream-coloured circular rod shape came out—like when you squeeze a black head or cyst. I thought, “no wonder it was sore! It’s quite infected.” But as I pulled it out with the tweezers, it felt quite hard. I put it on a tissue and tried to break it in half with the tweezers (pus would easily be cut in half), only to find it wouldn’t break. I realised it wasn’t pus—it was a splinter! I thought only a small sliver was left in the finger, but it turns out it was much bigger. My body had started to reject it—one of several outcomes that can happen. To help my splinter wound heal, I opted to use aloe vera. Though what you use depends on how infected it is, and if you’re unsure, you should consult a doctor. Some natural solutions involve: Soaking it in some salt water (made from actual salt crystals, like Himalayan or sea salt) either once or several times (change the liquid each time; soak it in a small, clean vestle—ideally non-porous, like glass—so you can use less salt and water)Using aloe veraPerhaps using some tea tree or eucalyptus oil. I haven’t worked with either for healing muchHydrogen peroxide diluted to 3% (don’t use 100%—it is very dangerous and can burn you and the fumes can cause damage to your eyes or lungs). Though hydrogen peroxide burns the cells it comes into contact with, so I’d only use it if something was infected to a point where I really needed it to get a deep clean and other solutions weren’t effective What should you do? Well, it depends. To quote an article published in 2017 by Cathy Johnson, which quotes Dr Adam Sheridan, dermatologist and spokesman for the Australasian College of Dermatologists: Is it safe to assume it will come out by itself, or can you leave it alone regardless? It depends on several factors, says Dr Adam Sheridan, dermatologist and spokesman for the Australasian College of Dermatologists. Horror stories aren't common but when they do occur, generally the splinter has come from plant material. \"Nine times out of 10, splinters are trivial things. But the classic scenario where things go wrong and end up in our clinic relates to vegetable matter,\" Dr Sheridan says. \"They are the ones that most often cause infection and an immune reaction. The splinter is seen as a living foreign body and we're designed to reject that.\" A splinter of inert, non-living material like metal or glass is less likely to trigger an immune reaction, Dr Sheridan says. What is the infection risk? While anything that pierces the skin can create a point of entry for microbes from outside the body, organic splinters are themselves likely to be carrying bacteria and fungi that can cause infections. The result can be pain, swelling and redness - or sometimes worse. Rose thorns, for instance, may be coated with a fungus called Sporothrix and many a gardener has discovered the pitfalls of pruning the popular flower. These sores do not heal unless they are treated with anti-fungal medicine. They may last for years and can sometimes drain small amounts of pus. Splinters from plants are also more likely to carry bacteria like Staphylococcus aureus or golden staph, Dr Sheridan says. If this is the case, a splinter in the foot might result in a visible red streak up the leg around 24 hours later — again a result of inflammation in the lymph vessels. If you develop fever and chills, that's likely a sign of a severe bacterial infection. Leave a thorn or splinter of wood in your body for a few months, and it's likely to disintegrate and further stimulate your body's immune response. And any infection left untreated can spread and cause septicaemia or blood poisoning. So leaving a splinter alone isn't without risks. […] \"We'll see people presenting with a painful nodule — like a non-healing lump — on their finger and it all goes back to them getting pierced by a rose thorn or a bit of mulch when they were working in the garden,\" Dr Sheridan says. \"Twenty to 30 days later, they can get this line of red inflamed lumps right up their arm.\" The lumps occur in a pattern known as sporotrichoid spread, which follows the line of vessels in your body's lymphatic system, which has a role in fighting infection. So it depends on: what the splinter is fromwhether you can get it out and clean it effectivelyhow bad the infection is, or how bad it could become (given what the splinter came from)When in doubt, go to a doctor. One thing doctors are good at are linking symptoms to common ailments humans understand well. (They suck at linking symptoms to uncommon ailments. Either case, it’s worth going, anyway.) And splinters are something humans understand well. If you can’t go to the doctor because you don’t have health care, move to a different country. ;) Something else you should do is take measures to avoid getting splinters, because they’re a pain in the hand/foot! ",
            "date": "Answered October 27, 2018",
            "views": "225",
            "upvotes": " View 5 Upvoters",
            "upvoters": [
                {
                    "user_id": "Joey Tuttle",
                    "user_href": "/profile/Joey-Tuttle"
                },
                {
                    "user_id": "Matthew P Jackson",
                    "user_href": "/profile/Matthew-P-Jackson"
                },
                {
                    "user_id": "Angel Fonseca-Valdez",
                    "user_href": "/profile/Angel-Fonseca-Valdez"
                },
                {
                    "user_id": "Jason Stamm",
                    "user_href": "/profile/Jason-Stamm"
                },
                {
                    "user_id": "Stephanie Brown",
                    "user_href": "/profile/Stephanie-Brown-343"
                }
            ]
        },
        {
            "author_info": {
                "name": "Jamie Gilbert",
                "href": "/profile/Jamie-Gilbert-1"
            },
            "answer_text": "Have you taken the splinter out? If not you should do that to avoid it staying inflamed and infected. Then clean the wound well with an alcohol swab and place a clean bandage over it and try to ignore it while it heals. Change the bandage every day. It's better not to squeeze the wound to try and get puss out, the whiteness is cells that are still fighting the infection for you. If it doesn't get better or gets worse within a week then see a doctor. Try to avoid using topical antibiotics (in a cream or gel) because you can make the bacteria resistant to antibiotics and you also kill the good bacteria and cells while are helping your body to fight the infection ",
            "date": "Answered March 20, 2017",
            "views": "104",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Lisa Killian",
                    "user_href": "/profile/Lisa-Killian-3"
                },
                {
                    "user_id": "Mike Huff",
                    "user_href": "/profile/Mike-Huff-22"
                },
                {
                    "user_id": "Jackie Drotar",
                    "user_href": "/profile/Jackie-Drotar"
                },
                {
                    "user_id": "Hollace Yeary",
                    "user_href": "/profile/Hollace-Yeary"
                }
            ]
        }
    ]
}