{
    "title": "What is uttering forgery? - Quora",
    "tags": [
        "Uttering"
    ],
    "response": [
        {
            "author_info": {
                "name": "Keith Lemons",
                "href": "/profile/Keith-Lemons"
            },
            "answer_text": "Thanks for the A2A. It is actually “uttering” or “forgery”, two separate English common law offenses. Uttering actually means “publication”. I have always wondered why ‘uttering’ was used as a word denoting a crime, it doesn’t sound too criminal. Uttering was different than forgery in that you uttered a false or forged document when you passed it off as real with the intent to defraud. Forgery is the making of or creation of a false document to make it appear as though it was the real deal with the intent to defraud. Penal statutes have replaced common law crimes and I doubt that any of them now contain the word “uttering”, they are covered under once offense - forgery. In summary, you uttered when you tried to pass a fake document [that you did not create] off on someone with the intent to defraud them. If you actually made the false document yourself, whether you used it to defraud someone or sold or gave it to someone else so that they could defraud someone, you committed forgery. ",
            "date": "Answered December 2, 2016",
            "views": "12",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Tom Peracchio",
                    "user_href": "/profile/Tom-Peracchio"
                }
            ]
        },
        {
            "author_info": {
                "name": "Ken Dunham",
                "href": "/profile/Ken-Dunham"
            },
            "answer_text": "Forgery is the act of creating a fake or altered document. Uttering is communicating or passing something off to another person. Uttering a forged document is the act of knowingly giving or transmitting a forged document to someone else (e.g. passing an altered cheque). ",
            "date": "Answered February 6, 2017",
            "views": "316",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Charles Clack",
                "href": "/profile/Charles-Clack"
            },
            "answer_text": "You have to read the current statute in your jurisdiction. It might be that passing a bad check (giving it to another person) is the “uttering” part, but the statute will have other elements. That is, you may be guilty of “uttering” if you signed the check, or stole the blank, or provided the pen to the person who signed the check. The question is impossible to answer in the abstract; you have to read the relevant statute. ",
            "date": "Answered November 24, 2016",
            "views": "285",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Kristin Annexstad",
                    "user_href": "/profile/Kristin-Annexstad"
                }
            ]
        }
    ]
}