{
    "title": "What would you do if all of a sudden a helicopter started falling from the sky? - Quora",
    "tags": [
        "Helicopters"
    ],
    "response": [
        {
            "author_info": {
                "name": "Joe Shelton",
                "href": "/profile/Joe-Shelton-6"
            },
            "answer_text": "What would you do if all of a sudden a helicopter started falling from the sky? If the helicopter is actually “falling” — out of control — the first thing to do is to get out of the way. At the same time — if possible — warn anyone in the vicinity where it might land. Then, call 911 or the equivalent emergency number. Finally, assist in any rescue if necessary. There is something to be aware of. All helicopters that look like they are “falling from the sky” might not actually be falling. If a helicopter loses engine power it doesn’t have airplane style wings to glide to a landing. Instead, helicopters use the energy in its’ spinning rotors to provide enough lift to cushion a landing. It’s called an “autorotation,” and it is something that is often practiced by both student and licensed helicopter pilots. From the ground it will look and sound like the helicopter is flying normally and then the engine’s sound will diminish at the same time the helicopter starts descending rapidly. That rapid descent has the same effect as blowing through a kids’ fan. As the helicopter almost reaches the ground the pilot will use a cockpit control (Collective) to use the energy in the rotating blades to slow the descent and land. When done correctly, the landing can be very soft.  If you’ve ever tried one of these, you’ll have some sense of what an autorotation is. ",
            "date": "Answered May 22, 2018",
            "views": "12",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Bella Harrison",
                    "user_href": "/profile/Bella-Harrison-14"
                },
                {
                    "user_id": "Chiquitta Washington",
                    "user_href": "/profile/Chiquitta-Washington"
                },
                {
                    "user_id": "João Vitor",
                    "user_href": "/profile/João-Vitor-43"
                },
                {
                    "user_id": "Evans Amekudzi",
                    "user_href": "/profile/Evans-Amekudzi"
                }
            ]
        },
        {
            "author_info": {
                "name": "Jay Lawrence",
                "href": "/profile/Jay-Lawrence-47"
            },
            "answer_text": "Thanks for the A2A. I would try to determine where it was going to land and get out of its path. Then I would dial 911 to report the incident. If I were close enough to the helicopter I would check the condition of the people on board and assist them if needed. Q. What would you do if all of a sudden a helicopter started falling from the sky? ",
            "date": "Answered February 14, 2020",
            "views": "56",
            "upvotes": " Answer requested by Rebecca Bean"
        }
    ]
}