{
    "title": "What's the best way to ask users for a positive review? - Quora",
    "tags": [],
    "response": [
        {
            "author_info": {
                "name": "Anastasiia Khlystova",
                "href": "/profile/Anastasiia-Khlystova"
            },
            "answer_text": "We make it a part of our customer service job. I even heard that some companies even make it their team’s performance indicator. We at HelpCrunch provide customer support through live chat (and sometimes, emails). In fact, it’s own own live chat tool, which you can test yourself, but that’s not the point. So, our review collection process looks like this: When someone says something nice about our business in a chat conversation, it’s a direct signal for our customer service managers to act.We ask whether they’re willing to write the same about our tool on G2 Crowd or Capterra (popular review websites in our niche) as well as some other places.If that’s not forbidden by review website’s policy, we might offer something in exchange — like a small discount or feature extending. That’s just our way of showing gratitude and appreciation.We also track our customer satisfaction rate based on ‘chat rating’ reports. Basically, customers receive a short message asking them to rate their experience with our customer support team at the end of every closed chat. They must choose of the three options — good, neutral, or bad.So, we then take all those who rated their chat conversation as ‘great’ and send them a targeted email campaign. We ask them to leave reviews on corresponding website in order to retrieve a small discount or something along these lines.All this is done by our customer service team. All they need to do is to react promptly on nice words, that’s it. ",
            "date": "Answered July 10, 2019",
            "views": "712",
            "upvotes": " View 5 Upvoters",
            "upvoters": [
                {
                    "user_id": "Joshua Griffin",
                    "user_href": "/profile/Joshua-Griffin-88"
                },
                {
                    "user_id": "Daniil Kopilevych",
                    "user_href": "/profile/Daniil-Kopilevych-2"
                },
                {
                    "user_id": "Vladimir Ivanov",
                    "user_href": "/profile/Vladimir-Ivanov-88"
                },
                {
                    "user_id": "Pavlo Prykhodko",
                    "user_href": "/profile/Pavlo-Prykhodko-1"
                },
                {
                    "user_id": "Pavel Pavlenko",
                    "user_href": "/profile/Pavel-Pavlenko-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Venkatesh Rajendran",
                "href": "/profile/Venkatesh-Rajendran"
            },
            "answer_text": "That is a wonderful question. :) The best way is to ask for reviews in a straight forward way by incentivising the user by giving in-app freebies. If your app doesn't have any in-app purchase you could probably gift them some apps that they would love. There are some users that give free reviews based on the type of App. If they find it useful they may definitely give some great reviews and do it free of cost too. These users can be found in many forums or FB groups. But the most common method is paying money to get a review which will usually work but is against the policy of Apple and also doesn't give an useful review and usually says \"Great\" or \"Super App\" etc. Hope that answers your question ",
            "date": "Answered August 28, 2013",
            "views": "12",
            "upvotes": " View 10 Upvoters",
            "upvoters": [
                {
                    "user_id": "Sakthi Vel",
                    "user_href": "/profile/Sakthi-Vel-2398"
                },
                {
                    "user_id": "Prasanna G",
                    "user_href": "/profile/Prasanna-G-58"
                },
                {
                    "user_id": "Saravana Priya",
                    "user_href": "/profile/Saravana-Priya-57"
                },
                {
                    "user_id": "Fiona Molly",
                    "user_href": "/profile/Fiona-Molly"
                },
                {
                    "user_id": "Nicolas Jack",
                    "user_href": "/profile/Nicolas-Jack"
                },
                {
                    "user_id": "RAVI P.R.S",
                    "user_href": "/profile/RAVI-P-R-S"
                },
                {
                    "user_id": "Prasanna Kumar",
                    "user_href": "/profile/Prasanna-Kumar-2266"
                },
                {
                    "user_id": "John Maximus",
                    "user_href": "/profile/John-Maximus-2"
                },
                {
                    "user_id": "Sharmila Kamaraj",
                    "user_href": "/profile/Sharmila-Kamaraj"
                },
                {
                    "user_id": "Paul August",
                    "user_href": "/profile/Paul-August-3"
                }
            ]
        }
    ]
}