{
    "title": "What's the best way to write a fantasy novel? - Quora",
    "tags": [
        "Fantasy (genre)",
        "Novels",
        "Writing"
    ],
    "response": [
        {
            "author_info": {
                "name": "David Grunwell",
                "href": "/profile/David-Grunwell"
            },
            "answer_text": "Start writing. You don’t have to start at the beginning. I like to have an image or idea in my head of a scenario and write that down, dialogue, and descriptions. It is often easier starting at some dramatic point where the action is intense. Some may want to slowly reveal the scene. I would caution that taking too long to build your world will bore some readers and they will quit. There will be some that love that. I had about twenty pages of my character going about his chores in the morning, going to town selling milk and eggs, developing the rural feel and him as a character. I cut it all out as most of the emotion and history could be condensed into a few paragraphs where there is a pause in the action and he had time to reflect. Most of us can imagine a medieval village without every detail. A quick paragraph to paint it in. If your world has pixies and dragons flying around, or ogres running the pub, those are salient points. To write is to rewrite. Get down your story and go back and condense, rewrite it so only things that move the plot along are kept. Don’t be married to an idea or sentance if it doesn’t work for the whole. If you love it, print it out and tape it to your wall, but leave it out. Stories need moments of slow and fast action. It doesn’t have to be frenetic fast, it is just in comparison. No one wants non-stop action or to spend hours reading about someone cleaning their boots. I don’t like excessive descriptions. I read one author that described every detail in a house. He was impressed with his own vision. One example was that he wrote in laborious detail about plates on a wooden place rail (including color, finish, texture) and that the plate had two chips at different angles on the edging. This information was not key to any event. It was just stupid. These novels where huge tomes that could have been great by gutting half of the descriptions. Do we really need to write in the sound effects of horse hooves on cobblestones? Clip, klop, Clip, klop, Clip, klop. I like to paint myself into corners and then try to figure my way out of it without some too convenient magic item that handles just that situation. It has to be surprising and not obvious. I caution making your characters too dark and self-hating. Stephen Donaldson is a good writer, but his stuff is so full of self-loathing that it is painful. So my long suggestion is just start writing and let your characters tell you who they are going to be. You may have to go back and change sections as you realize that your character would never do or say something that you wrote. Unless there was some deeper lurking plot twist that made them do what they dreaded to do. Most of all, have fun. If you don’t, others may not either. ",
            "date": "Answered March 13, 2018",
            "views": "196",
            "upvotes": " Answer requested by Tittus Anthony",
            "upvoters": [
                {
                    "user_id": "Wendelin St Clair",
                    "user_href": "/profile/Wendelin-St-Clair"
                },
                {
                    "user_id": "Aiden Watson",
                    "user_href": "/profile/Aiden-Watson-16"
                },
                {
                    "user_id": "Bernadette Loftus",
                    "user_href": "/profile/Bernadette-Loftus-3"
                },
                {
                    "user_id": "Paula DeMichele",
                    "user_href": "/profile/Paula-DeMichele-1"
                },
                {
                    "user_id": "Ernie Black",
                    "user_href": "/profile/Ernie-Black-3"
                },
                {
                    "user_id": "Christine Shultz",
                    "user_href": "/profile/Christine-Shultz-3"
                },
                {
                    "user_id": "Margaret Carter",
                    "user_href": "/profile/Margaret-Carter-2"
                },
                {
                    "user_id": "Sebastiano Argenti",
                    "user_href": "/profile/Sebastiano-Argenti"
                },
                {
                    "user_id": "Tim Jarvis",
                    "user_href": "/profile/Tim-Jarvis"
                },
                {
                    "user_id": "Sebastian Winter",
                    "user_href": "/profile/Sebastian-Winter"
                }
            ]
        },
        {
            "author_info": {
                "name": "Martin Turner",
                "href": "/profile/Martin-Turner-57"
            },
            "answer_text": "I think, on reflection, the same characteristics apply to great fantasy as to any other kind of fiction. Let us remember that, up until the 19th century, fantasy was not a separate kind of writing. From Homer to Swift, fantasy was an integral part of the craft of writing. Shakespeare wrote some naturalistic plays, such as Othello, and some fantasy plays, such as The Tempest, but many plays, such as Macbeth and Julius Caesar, have elements of the supernatural, and others, such as King Lear, allow for the supernatural. So we go back to Aristotle, who, more than anyone else, codified what makes stories good or bad. I’ve written elsewhere about Aristotelian plotting and the double-reversal, but he introduces a different principle which I think is key to fantasy. Something is complete not when nothing more can be added, but when nothing else can be taken away.With fantasy, it’s tempting to include absolutely everything. Dragons? Sure. Robots? Why not? Dragons and robots? If you like. Dragons, robots, steamy writing, politicking, clashes of vast armies, a cast of hundreds of named characters, stories spanning centuries or millennia, outer space, telepathy, King Arthur and zombies? Anything you like. The problem is, the more you put in, the more it just becomes a mush of anything. Let me look at four modern classics: The Lord of the Rings (of course)The Narnia booksHarry PotterEarthseaNow, these are four huge series. Earthsea deserves to be better known—it’s easily as good as the others, but suffered even more disastrously than Narnia did from its film and TV versions, and it wasn’t as well known before they came along. You may say that these are examples of books that contain pretty much everything, but it’s instructive to look at what they exclude. I’m going to stick to the original Earthsea trilogy because, like many other extended trilogies, the tone and milieu changed—not for the better—when they were revisited by the author more than a generation later. First off, none of them have sex. In an era where ‘fantasy’ was often seen as an excuse for steamy book-covers of the Tribesmen of Gor type, and fantasy was either in the children’s section or in the ‘adult’ section, it’s notable that none have sex. This is not because the authors were repressed. Lewis isn’t afraid of sex in That Hideous Strength, and LeGuin’s science-fiction doesn’t just have sex, but it has transgenderism decades before anyone else thought it was an important issue. But all four of these series avoid sex. Second, none of them have religion, or, at least, not ‘true’ religion. There are no temples in the Lord of the Rings. There are no temples in Narnia, and the only ones in the Narnia universe are in Calormene or Charn. The Kargad Empire in A Wizard of Earthsea has gods, and we later discover they have malevolent semi-deities called The Nameless, but, as Ged explains, these are not worthy of anyone’s worship. Although Christmas and Easter are in the Hogwarts calendar, there is no religious observance. In fact, although Harry Potter exists in our world, there is no religious observance at all. This is not because Tolkien, Lewis or Rowling were opposed to religion. Tolkien was a Catholic and Lewis and Rowling were Anglicans (Rowling now identifies as Church of Scotland, or did, last time I heard her on the radio). Third, none of them have superheroes. The heroes in all four milieus are constantly battling things much bigger than they are. The only one who might become a superhero is Ged, in A Wizard of Earthsea, but he is only the protagonist when he is weak. The focus shifts to other characters when Ged becomes strong. Fourth, none have science. There is no organised attempt to discover the laws of nature. This is not because the authors were opposed to science. LeGuin and Lewis both wrote science-fiction, and LeGuin is probably better known as a science-fiction writer. All four of these were conscious decisions to clarify and simplify the world of magic. In as much as they added magic, they removed other things, even when they included them in their other books. This comes down to the nature of fairy tales, which Tolkien discusses in Tree and Leaf. Fairy tales are not ‘our world plus magic’, they are a reduced, stylised depiction of our world—a simplified universe in which magic can operate. If you’re starting on a fantasy novel, begin not by working out the detailed languages, rules of magic, and ninety-two different interacting species. Begin by working out what to remove. Remove everything not demanded by our plot. A thing is complete when nothing further can be removed. ",
            "date": "Answered May 9, 2020",
            "views": "11",
            "upvotes": " View 20 Upvoters "
        }
    ]
}