{
    "title": "What are some of the most common mistakes that you see a novice writer make most often? - Quora",
    "tags": [
        "Common Mistakes",
        "Writers and Authors"
    ],
    "response": [
        {
            "author_info": {
                "name": "Lisa Oliver",
                "href": "/profile/Lisa-Oliver-84"
            },
            "answer_text": "Hi Dani, I think there are three big mistakes novice writers make when telling a story. They lose their voice - what I mean by that is that they try to write like someone else, usually an author they admire. That is commendable, but really difficult. If you’re talking to a friend, your voice has a certain flow, you find the conversation is easy. Writing should be like that too - the words need to flow, like you’re weaving a plait, or casting a spell. You want to involve your reader into your conversation, so they keep reading to the very end.Editing - you MUST have a good editor. It doesn’t matter how many degrees you have, or how well you’ve been told you following editing rules correctly, you must get someone else to preview your work before you let it out into the world. Your story is your baby - I don’t know how many times I have reread my final draft, and for some reason my eyes glaze over mistakes I’ve made. Having an editor is a must.The dreaded info dump - this doesn’t get mentioned very often, but time and time again I have picked up a book by a new author with eager anticipation and been disappointed. The opening page jumps us straight into the action, you’re poised, eager to see what happens next and then bam - page after page of dreaded info dump. Yes, the world you’ve created is undoubtedly awesome in excruciating detail, but we don’t need to know all about it in the first chapter. Spread all those creative ideals you’ve built up across the book, drop them in when it’s necessary to explain a scene, but never more than a paragraph or two at a time. I have a small post it note on my computer and it’s been there for years, courtesy of a good friend - Resist The Urge To Explain.Have fun :) ",
            "date": "Answered June 7, 2019",
            "views": "166",
            "upvotes": " View 2 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Reece Harvey",
                    "user_href": "/profile/Reece-Harvey-1"
                },
                {
                    "user_id": "Dani Michaels",
                    "user_href": "/profile/Dani-Michaels"
                }
            ]
        },
        {
            "author_info": {
                "name": "Jon Nathanson",
                "href": "/profile/Jon-Nathanson"
            },
            "answer_text": "Find and stick to your natural voice. This should be as close to your speaking voice as possible. You want your writing to come across clearly, as though part of a conversation with your readers.Don’t use overly flowery and ‘cute’ turns of phrase. This is known as purple prose — self-satisfied prose that is vivid and floral for its own sake. Often, such prose distracts the reader from whatever point you’re trying to make. Simpler is almost always better.The same rules apply to nonfiction and to fiction.In the realm of fiction, it is a common fiction (ha, ha) that “literary fiction” should be written like James Joyce, or F. Scott Fitzgerald. That every word should sing off the page. This is largely bullshit. Literary fiction is an invention of college English departments. Even James Joyce once admitted that he wrote impenetrable books for the sole purpose of confounding professors, and thus being admitted into the great canon. So, yes, ‘literary fiction’ generally pays closer attention to the meter, style, and rhythm of the prose — but these things should not come in the way of a good story.All writing is storytelling. Nonfiction. Fiction. Literary fiction. Mass-market fiction. Fiction about dreamy vampires. Fiction about undreamy vampires. Television, film, novel, or public speech. Whether you’re making an argument around a hypothesis in a nonfiction essay, or whether you’re spinning a yarn in a novel, you’re telling a story. Human beings are programmed to be receptive to stories. Write everything as a story, and you’ll break through to audiences everywhere!",
            "date": "Answered June 7, 2019",
            "views": "213",
            "upvotes": " View 2 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Reece Harvey",
                    "user_href": "/profile/Reece-Harvey-1"
                },
                {
                    "user_id": "Dani Michaels",
                    "user_href": "/profile/Dani-Michaels"
                }
            ]
        }
    ]
}