{
    "title": "What are good book topics? - Quora",
    "tags": [
        "Topics"
    ],
    "response": [
        {
            "author_info": {
                "name": "Zahid Ahmed",
                "href": "/profile/Zahid-Ahmed-14"
            },
            "answer_text": "Books, fiction and non-fiction, have been written on thousands of topics, ranging from war to history to contemporary fiction to much more. However the best topics that entice people, in same manner, across the globe are about Fortune and Love. People love reading stories of fortune and love. Why? Everyone wants to be a rich guy, and at the same time it is the best of human (man) desire to have the love of most beautiful woman in the world. This unbridled desire has fueled many stories – some get penned down while many get recognized in the folklore, while many are lost in the milling voices of this world. If you look at the list of hit books around you, you will find that those ranging from these two categories are either from love or fortune. For instance, The Alchemist by Paulo Coelho – it was mix of both love and fortune. Similarly, on love there are some good books like P.S. I Love You, and nowadays many contemporary authors are making to the bestseller list because of love theme in their novels, especially in India. Some authors are Durjoy Datta, Preeti Shenoy, Shashi Deshpande, and many more. Recently, I read a book based on dark shades of love and romance. The novel was ‘Either Or Else Nor’ by Varun Gupta. I gained interest in the novel because I was interested in knowing the future of the lovers – who got what? You know…it is a basic human inquisitiveness to know about the others. Also, the stories of fortune and love are relatable and common in finding, unlike war and historical fiction. ",
            "date": "Answered November 7, 2019",
            "views": "851",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Karan Baria",
                    "user_href": "/profile/Karan-Baria-4"
                },
                {
                    "user_id": "Asif Ahmed",
                    "user_href": "/profile/Asif-Ahmed-801"
                }
            ]
        },
        {
            "author_info": {
                "name": "Sherlie Moriarty",
                "href": "/profile/Sherlie-Moriarty"
            },
            "answer_text": "Here are some topics that I personally think are good for books: OctopusesHackingShapeshiftingPierogi (seriously, I want to read a book about pierogi)GymnasticsComplex gauntlets full of DnD-style traps and challengesAll the weird things you did as a young childSummer campPenguinsRobotsRobot penguinsClimbing buildingsSeriously, if any of these are a plot point in a fiction book, I will read it, as long as there isn’t anything I have a major problem with. ",
            "date": "Answered December 1, 2018",
            "views": "1",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Sarthak Kedia",
                    "user_href": "/profile/Sarthak-Kedia"
                }
            ]
        }
    ]
}