{
    "title": "What are some great writing exercises for screenwriters? - Quora",
    "tags": [
        "Screenwriters",
        "Screenwriting",
        "Movie Story and Plot Themes",
        "Writing"
    ],
    "response": [
        {
            "author_info": {
                "name": "James Jordan",
                "href": "/profile/James-Jordan-54"
            },
            "answer_text": "Have any of you done the famous writing exercise suggested by television writing genius David Milch? The exercise is practically guaranteed to improve your writing as you embrace Milch’s philosophy of having “an open mind and a humble heart.”  David Milch Rift Fournier concisely outlined David Milch’s writing exercise (in a wonderful article from “Written By” Magazine, November 2002 issue, entitled “Problems of the Spirit, When David Milch lectures, it’s a call to worship writing.”) For your benefit, here are the article details. “In his seminar David Milch did present one profoundly basic tool for writers. David suggested a writing exercise to prepare the writers' spirits for how one separates oneself from their work and develops writing muscles without conscious effort. The exercise was simple: Commit to writing for 20 minutes and not more than 50 minutes each day at the same time using two distinct voices. David laid out two rules for the exercise: No names for the characters and no descriptions.” Voice #1, Voice # 2, Just dialogue, nothing more. You have the opportunity of writing 15 of these exercises total.” (Commit to doing the exercises for 5 consecutive days, then take two days off. Repeat for 5 more days, then take two more days off.) “For the final week, David suggests five more exercises with a twist: adding a third voice as a story-organizing element, (Voice #3).” When I did this 15-day exercise, I was encouraged by David Milch (at a Sherwood Oaks College event) to send the material to him personally, which I did, of course. So, did he read it? To this day, I don’t know. I didn’t follow up because it was never about Milch. It was about me improving my writing mind. In fact, some of what I created is going into a current script that I am now writing, so the exercise was supremely beneficial to me. I would suggest putting all the completed exercises in one envelope. Then mail it to someone you know, (but not me). Call the recipient to indicate the envelope is coming and what is in it. But they are NOT to open the envelope; they are to hold it for at least 90 days, then return it to you unopened when they next see you. This is about \"writing with a humble heart\" and giving up the material to the universe. It’s a physical thing and a metaphysical thing. Rift Fournier continued, “The exercises have nothing to do with writing television or movies… It is a more profound lesson in getting one's self into a natural rhythm and in being in a place where one's spirit is prepared for a vision. Milch made this point by quoting the late Billy Wilder: ‘The muse has to know where to find you.’” When you finally look at the exercises again in 3 months, perhaps you will realize that your writing has magically improved, or perhaps not. But why not try this and see what happens? I suggest this exercise to all my writing clients and many other writers as well. I am always surprised when so few writers see enough potential benefit to actual try the exercise. What doesn’t surprise me is the feedback I get from the most committed writers who do the exercise. Every one of them felt the experience benefited them as writers. If you determine this was beneficial to you, I'd appreciate you letting me know. Good luck! Also, I encourage screenwriters to follow me on Quora for craft and career advice as I will be posting answers frequently. (You might find some of my previous answers helpful as well.) ",
            "date": "Answered October 31, 2016",
            "views": "35",
            "upvotes": " View 20 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Christine Owens",
                    "user_href": "/profile/Christine-Owens-43"
                },
                {
                    "user_id": "James King",
                    "user_href": "/profile/James-King-4"
                },
                {
                    "user_id": "Jonah Martinez",
                    "user_href": "/profile/Jonah-Martinez-11"
                },
                {
                    "user_id": "Callum Sutherland",
                    "user_href": "/profile/Callum-Sutherland-3"
                },
                {
                    "user_id": "Tabitha Chase",
                    "user_href": "/profile/Tabitha-Chase-2"
                },
                {
                    "user_id": "Ali Akhtar Randhawa",
                    "user_href": "/profile/Ali-Akhtar-Randhawa"
                },
                {
                    "user_id": "Shahab Sheikhzadeh",
                    "user_href": "/profile/Shahab-Sheikhzadeh"
                },
                {
                    "user_id": "Luís Eugênio do Nascimento Santos",
                    "user_href": "/profile/Luís-Eugênio-do-Nascimento-Santos"
                },
                {
                    "user_id": "Multi Fandom",
                    "user_href": "/profile/Sara-3591"
                },
                {
                    "user_id": "Skye R. Regan",
                    "user_href": "/profile/Skye-R-Regan"
                }
            ]
        },
        {
            "author_info": {
                "name": "Toni Colley-Lee",
                "href": "/profile/Toni-Colley-Lee"
            },
            "answer_text": "Thanks for asking.  I suggest you go to our online screenwriting training site WriteMoviesRight! and take the first free class Certificate Course: How to write your FIRST Academy Award Winning Screenplay! and complete it. It is designed to show you how our program operates and has some general information about screenwriting, my teaching background of 20 years, what we will teach you, the cost and payment options. But you must complete all parts of it (automated) to get a coupon to move forward to the next course. As soon as you take the Certificate Course: How to Write your FIRST Academy Award Winning Screenplay! take the free Certificate Course: Great Idea and Choosing Your Genre (a $29.97 value). Completion of it will give you a coupon for the Certificate Course: The Grabber 1 -The Rundown class valued at $69.97.Then after you have done the Certificate Course: Great Idea and Choosing Your Genre course, you'll be ready for the Certificate Course: The Grabber 1 -The Rundown. This class will teach you how the first 10 minutes mirrors an entire screenplay, with three sections, and you will have a lot of exercises within, to help you understand screenwriting, while you actually execute the tasks.This will give you three free classes with a series of actions you must take including learning to use a screenwriting formatting program Real-time collaborative screenwriting software, as well as duplicating scenes from finished films and creating some of your own work. You can do this over and over again in different genres, using other films and learn a lot about delivering impactful scenes and structure. The more you do, the better you will get.We designed the entire program to build skills progressively. If you continue past the free stuff, and actually take the entire Master Class, by the end of the program, you will have completed your own screenplay as the exercises are designed for a student to learn the craft as you complete your own script. It is like having a mentor working alongside you from first to last page, idea to completion.  Best of luck! ",
            "date": "Updated July 16, 2017",
            "views": "910",
            "upvotes": " View 5 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Tricia Marlyne",
                    "user_href": "/profile/Tricia-Marlyne"
                },
                {
                    "user_id": "Marge Moon",
                    "user_href": "/profile/Marge-Moon"
                },
                {
                    "user_id": "Gary Smith",
                    "user_href": "/profile/Gary-Smith-105"
                },
                {
                    "user_id": "Mark McRae",
                    "user_href": "/profile/Mark-McRae-6"
                },
                {
                    "user_id": "Winston Yang",
                    "user_href": "/profile/Winston-Yang-1"
                }
            ]
        }
    ]
}