{
    "title": "What are fantasy novel publisher looking for? - Quora",
    "tags": [
        "Publishers",
        "Fantasy (genre)",
        "Book Publishing",
        "Publishing",
        "Novels"
    ],
    "response": [
        {
            "author_info": {
                "name": "Martyn Pentecost",
                "href": "/profile/Martyn-Pentecost"
            },
            "answer_text": "Good question! I hope I can help from the publisher-perspective. There are some very good answers here, so do take them on board in addition to this—especially Ms Lackey’s response. Do not attempt to please a publisher by predicting what ‘fad’ they might, may, could possibly be interested in. Show the publisher what they never knew they wanted by finding your own, unique and powerful voice! Do, this by focusing on your audience—your reader. Fix that one reader in your mind and tell them your story in a way that grips them; holds them tight and does not let them go (even when they have put the book down). Create something that is uniquely yours—not a rehash of somebody else’s work. Sure, you may use existing tropes, but makes these stand out in a way that intrigues and creates an unexpected journey. World-building is good. When the reader gets a sense of the world beyond the main narratives (without ever losing sight of clarity and focus), they will want to stay in your world. Think ecosystem/Universe, whilst honouring the intimacy of the moment (just you and your reader). Avoid ‘telling your reader what is happening’—this is just information overload waiting to happen. Breadcrumb your story! Keep us guessing and sculpt the ‘perfect’ tempo of how each arc unfolds, evolves and ends. Guide your reader by employing emotional impact, curiosity and letting them use their own imagination. And, drive the story in ways that are natural—a series of moments that are motivated by (and flow from), other moments. Remember to avoid the trap of the ‘single story’—create contrast, diversity and polarity (tension) within the narrative. Maintain your creative-tension—holding the vision of your book, without letting the ‘reality’ of the process cause you to ‘dumb down’ that overarching vision. Too many authors have great ideas, only to discard them when everyday critics say ‘that will never work’, ‘this should happen next…’ or ‘no publisher will touch that’! Overall, do the work—don’t cut corners or skip important aspects of the authoring. Do the best you can, get it done and remember—you are leaving a legacy. Reader’s hundreds of years from now could be enjoying your words; inspired to recreate your world in their imaginations! ",
            "date": "Answered August 7, 2018",
            "views": "238",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Luca Devalier",
                    "user_href": "/profile/Luca-Devalier"
                },
                {
                    "user_id": "Richard Hagen",
                    "user_href": "/profile/Richard-Hagen-10"
                }
            ]
        },
        {
            "author_info": {
                "name": "Mercedes R. Lackey",
                "href": "/profile/Mercedes-R-Lackey"
            },
            "answer_text": "Don’t base what you are writing on what is hot now. By the time you get done writing it, the “hot thing” will be cooling off. By the time an editor sees it, the “hot thing” will be dead, and there will have been two new “hot things” since then. Just write a damned good story. Make sure your grammar and spelling are correct. Don’t try to recast your unsold SF story by taking out the “blasters” and substituting “wands.” Don’t try to recast your unsold western by taking out the “ranches” and substituting “castles.” Make sure your characters are solid and believable. Your relationships should make sense. Your characters should never do something just because you want them to do that to drive the plot along. At no time in the history of the universe has anyone ever walked into an inn, looked at a group of people he knows nothing about and said “Greetings travelers! You look trustworthy! Would you like to join my quest?” And at no time in the history of the multiverse has anyone answered that question with “Why, of course!” unless he or she intended to murder and rob the innocent dweeb who asked it. Never write up your Dungeons and Dragons (or any other game) adventure and think it will work as a book. If I can mentally hear dice rolling every time your character makes a decision, it’s not a book, it’s a D and D adventure written up as a book. Follow C.S. Friedman’s advice. ",
            "date": "Answered August 6, 2016",
            "views": "51",
            "upvotes": " View 77 Upvoters",
            "upvoters": [
                {
                    "user_id": "Averma",
                    "user_href": "/profile/Averma-5"
                },
                {
                    "user_id": "Chris Hollaway",
                    "user_href": "/profile/Chris-Hollaway-1"
                },
                {
                    "user_id": "Rachael Saltzman",
                    "user_href": "/profile/Rachael-Saltzman"
                },
                {
                    "user_id": "Janet Reedman",
                    "user_href": "/profile/Janet-Reedman"
                },
                {
                    "user_id": "Naurah Deatrisya Gitany",
                    "user_href": "/profile/Naurah-Deatrisya-Gitany"
                },
                {
                    "user_id": "Nicole Lawrence",
                    "user_href": "/profile/Nicole-Lawrence-139"
                },
                {
                    "user_id": "Samuel Orona",
                    "user_href": "/profile/Samuel-Orona-4"
                },
                {
                    "user_id": "Rafael Martin",
                    "user_href": "/profile/Rafael-Martin-4"
                },
                {
                    "user_id": "Claire Jordan",
                    "user_href": "/profile/Claire-Jordan-10"
                },
                {
                    "user_id": "Reyna Mitchell",
                    "user_href": "/profile/Reyna-Mitchell"
                }
            ]
        }
    ]
}