{
    "title": "What are steps to be taken by a beginner who is writing first novel? - Quora",
    "tags": [
        "Novel Writing",
        "Book Writing",
        "Novels",
        "Writing"
    ],
    "response": [
        {
            "author_info": {
                "name": "Jody Lebel",
                "href": "/profile/Jody-Lebel"
            },
            "answer_text": "First, learn the craft of writing. Then… start with baby steps. Write some short stories first. The man on top of the mountain didn’t just fall there. Things take time. If you wanted to fly a plane, what would you do? You'd find a ground school and take lessons. If you wanted to play the piano, what would you do? You'd find a piano teacher and take classes. What makes writing any different? Writing is an art, but it’s a learned art. To ask someone how to write a story is like asking “How do I climb a mountain?” You don’t, unless you’ve had the training. And no, it’s not rocket science, but writing is something that needs to be studied and practiced. Anybody can sit down and write crap. You see it all the time in self pubbed books. Most people will tell you to just start writing, and keep writing, but I don't agree. It's not enough to just write every day if you don't know what you're doing or how to improve something. That just means days and weeks and months of useless writing. It's like not knowing how to knit so you just keep making loops with the yarn. You can't get better, you can't turn that into a scarf ... you have the desire, but you don't know how. I'm going to give you my stock answer that I give everyone who asks me this question. I'm going to give you some good advice on how to learn the craft, and give you a place to send in some of your work when you're ready. In order to write stories that people want to read you will need to understand how to put one together. There is a definite pattern and rhythm to it. And there are certain expectations from the editors and publishing houses as to how your story is laid out. You will need a good imagination, one that can look at a situation and picture all sorts of different scenarios. You need to be able to ask 'what if' and come up with twists and lines that are new and fresh. You will need to be able to research things. For example I wrote a story set in Iran where there was a wedding. I had to research how the wedding would take place, the food, the customs, common Iranian names, clothing, etc. in order to write an interesting yet correct story. Take classes in writing; grammar and punctuation (very important... lots of self published books are swimming in glaring errors and typos), character building, dialogue, plotting, pacing, point of view (POV), inner and outer conflicts, subplots, scenes and sequels, genres, story boards, twists, chapter hooks, suspense, killer opening lines, and satisfying endings. If you're going to write sci-fi you will need to take classes in world building. Each genre of book has its own set of expectations from the reader that you will need to fulfill. For example a murder mystery must have clues for the reader to try and solve. A romance needs a happily ever after ending, known to writers as an HEA. A thriller needs fast pacing and danger. There are classes in short story writing. Where to find these classes? Local community colleges often offer writing classes. My local library has classes seasonally. Best of all there are hundreds of classes you can take on-line. They run about $25-$35 each and range from 2 to 4 weeks. Google on-line writing classes and you will get lots of sites. Try www.oirwa.com or www.savvyauthors.com. They have classes year round. You don’t have to join either one but if you do you get a discount on their classes. Just because a class might be about writing romances, writing is writing; many of the same principles apply to other genres. So don’t hesitate to take a course on character building or writing scenes just because the site caters to romance. There are sites that offer expensive classes, so be careful. I’d recommend starting with a few less expensive ones to see if you really like writing and want to continue. IMO it is not necessary to have a degree or to take an expensive course to write well. Read a lot. Get a feel for how a story is told; how it starts, how it progresses through the story to a satisfying end. See how your favorite author keeps you interested. I don't know your age, but when you are able join some writing groups, even online groups are helpful. Oftentimes these groups offer lectures and classes in writing. They share their work and critique each other. Once you start taking classes and get a good feel for how to put a story together, write some short stories (800 - 1500 words). The more you write, the better you will become. You will make new writer mistakes, we all did. But that's how you learn. I say start with short stories because they are, well short, and don't take years to complete like a novel does. You can share your stories with others and get feedback. Take the feedback and use what you feel is constructive for you and ignore the others. Some people don't give good feedback, or there is a motive behind their negative comments. You have to learn which ones to take and learn from and which ones to disregard. And when you are reading and critiquing other's stories, be kind, give good feedback, and find something positive to say to them. It's hard to hear harsh things about your writing. It's tough love. But it works when you get it and understand why the comment was made and you go and make your piece better because of it. Submitting to contests is another way to get good feedback because the judges are usually editors and agents who have their finger on the pulse of good writing that sells. Once you feel you have written a great short story, be brave and submit it to a magazine that publishes fiction in the genre you wrote. Don't worry about rejections. They will come. Oftentimes it's not because your story is not good, it's because the story doesn't fit their needs. They are running a business after all, and they pick the stories that they feel will best entertain their readers. All authors get rejections. It's part of the 'hunt'. Here’s a place to start submitting. Check out their guidelines carefully. FLASH FICTION ONLINE http://flashfictiononline.com/main/submission-guidelines/ We publish stories from 500 to 1,000 words in length. They’re very short, but they are still stories. That means the best ones have strong, interesting characters, plots, and (to some extent, at least) settings. We’re not that concerned about genre. Many of us have a fondness for science fiction and fantasy, but we also like literary fiction; and in any case, great flash stories aren’t always easily classified. If you wrote it, and you love it, then submit it. No erotica, porn, graphic sex, or violence. Pays $60 per story. Buys reprints at two cents/word. (I checked this site on 10/12/18 and it’s still operating and the details are correct.) Once you are good enough to sell a few short stories, then you will have the skills to think about plotting out a whole book. Check out my e-book for more writing tips: Write Better Right Now: Creative Writing Tips http://amzn.com/B00IHIWUDC Only $1.99. ",
            "date": "Answered March 23, 2019",
            "views": "564",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Austin Fowlkes",
                    "user_href": "/profile/Austin-Fowlkes"
                }
            ]
        },
        {
            "author_info": {
                "name": "Yonatan Gershon",
                "href": "/profile/Yonatan-Gershon"
            },
            "answer_text": "I’m working on a novel right now. Five pages down so far, which is terrible work ethic for professionals, but I’m not on a clock, and I’m proud of how good those five pages are. For the record, I’d already written almost 50 pages, but they were filled to the brim with plot holes and oceans of subtext that would take hundreds of pages to resolve, so I decided to start over. That’s your first challenge to overcome: why you’re writing a novel. If you’ve managed to write tens of thousands of words, decided that it’s mediocre, and you actually want to start over instead of quitting, then writing a novel might be the right hobby for you. Getting it published is a wholly separate matter, so don’t ask me about that. The way I’m writing my novel is pretty simple: I know the beginning and end, and I have a gist of how the characters will get from the former to the latter. Planning out every detail of the entire book is pointless to me; where’s the fun in transcribing a finished story? I prefer instead to have a good grasp of the themes I want to evoke and the motivations of the characters I’m working with, such that the work becomes figuring out how best to explore these things in a scene. On top of this, you’ll need a good grasp of how your world works and how you want to reveal this to the reader. Beyond that, there’s not much else to it except sitting down, opening your document, and deciding how you want your scene to go. You don’t need to be perfect at grammar, syntax, punctuation, all that shit before you start. Why? So that a publisher won’t sneer in disgust? Fuck them. You can figure that out later, or perhaps not at all, depending on whether you even want to publish. A story should be a labor of love first, not menial labour of choosing one of a few pre-approved formats and archetypes masquerading as original stories. Lacking proficiency in the language you write can indeed be a detriment, but it’s not a requirement for creativity or genius; stories have been told for hundreds of thousands of years, much of it in oral fashion because writing is not that old in comparison. Point being, if you want to write, then write. That’s the only true requirement. The desired result is the only thing that dictates standards for your writing. Getting published is much harder than just finishing a story, but if you only desire the latter, why would you write for the sake of the former? Ya shouldn’t! ",
            "date": "Answered March 23, 2019",
            "views": "617",
            "upvotes": " View 6 Upvoters",
            "upvoters": [
                {
                    "user_id": "Abhishek Ray",
                    "user_href": "/profile/Abhishek-Ray-14"
                },
                {
                    "user_id": "Ashton Hennessy",
                    "user_href": "/profile/Ashton-Hennessy"
                },
                {
                    "user_id": "Yacine Barhoumi",
                    "user_href": "/profile/Yacine-Barhoumi"
                },
                {
                    "user_id": "Douglas James",
                    "user_href": "/profile/Douglas-James-41"
                },
                {
                    "user_id": "Susan Bertolino",
                    "user_href": "/profile/Susan-Bertolino"
                },
                {
                    "user_id": "Anayra Shah",
                    "user_href": "/profile/Anayra-Shah"
                }
            ]
        }
    ]
}