{
    "title": "What is academic writing? What are its features? - Writing & Blogging - Quora",
    "tags": [
        "Academic Writing",
        "Creative Writing",
        "Academic Papers",
        "Writing Advice"
    ],
    "response": [
        {
            "author_info": {
                "name": "Michael Sellars",
                "href": "/profile/Michael-Sellars-3"
            },
            "answer_text": "Essays are sometimes assigned in middle school, high school, and college. You may even some have to write essays in the business world, but those office managers rename them as \"reports.\" Essays are actually short papers that define your stance or \"position\" on a given topic. What you decide to talk about is the subject, and what you say about that subject is your topic. For example, you choose \"baseball\" as your subject but \"baseball shoes\" as your topic, you could narrow your topic even more to \"baseballs themselves\" for a smaller \"narrowing of the topic. There are four concepts that create the logic of today's format. They are Focus, Development, Organization, and Mechanics. The place to start is on the concept of Focus, which is the fundamental subject of the essay, the topic will approach. A \"Topic\" will arise when you consider the subject to discuss, and you have narrowed the subject down to a topic. NARROWING THE TOPIC A Step-by-Step Example on Narrowing a Research narrow down a specific topic, follow these steps: 1. Choose a general topic area. An example could be employee turnover. 2. Choose a specific description of the topic area. (The Discipline). 3. Example: turnover in the nursing industry. 3. Mention an aspect of the specific topic: Example: factors that affect turnover among registered nurses. To narrow down a topic’s focus, follow these steps: 4. Note down extra specifics about the topic. Example: Workplace stress and turnover among registered nurses. 5. Turn the topic into a sentence or Thesis Statement. Example: Workplace stress has a significant impact on turnover among registered nurses. Tune your topic’s focus using elements such as time, place, and relationship. Example: Workplace stress causes increased turnover among registered nurses in Houston and Waco. What’s Too Broad? Students get irritated when an instructor tells them that the topic they selected is too broad. This is a common problem. How do you tell if the topic is too broad? If you’ve summed up the topic in one or two words, such as college, school, dishonesty, crimes & punishment, drinking alcohol, or overweight teens, it’s obviously too broad. If you visit the library and realize you are staring at a great number of books that you can use as sources for your study topic, then the topic is too broad. A good topic addresses a specific question. You should spot four to five books or even fewer that can effectively address a research topic. If you can’t come up with a thesis statement for your research paper, then chances are your topic is too broad. The Dangers: Not Narrowing Down If you don’t do it, you’ll find it a challenge to handle the research topic You might face a number of issues if you choose to write on a very broad research topic. The include: Finding tons of sources of informationFinding generic information that makes it difficulty to come up with a clear framework for addressing the research tasks.Lack of adequate parameters to define the research problem makes it challenging to identify and use correct methods required for its analysis.. You come across information that addresses such a large array of concepts that can’t included in a single paper. In every research paper, there’s a common challenge – determining how to narrow down a research topic. Even if the professor assigns you a specific topic of study, you’ll still be required to narrow it down to some degree. That’s why you should narrow your study’s focus early in the writing process. Select ONE lens and use it for viewing a research problem! In general, analyzing a smaller geographical unit means a narrow topical focus. Instead of studying trade relations in Asia, focus on trade relations between China and Singapore as a case study to guide you in explaining problems in that region. Find out how two or more variables or perspectives relate to each other. When you design a study around the correlation of different variables, it helps you to reduce the scope of your variables. Study periods can be assigned time frames. Generally, the shorter a study’s time period, the more narrow its focus becomes. For example, instead of studying trade relations between China and Singapore, focus on the trade relations between China and Singapore between 2010 and 2018 Focus the study topic with regard to a particular class of people, phenomena, or places. For instance, a study of developing better housing near schools may focus on condominiums, universities, or building materials only. ",
            "date": "August 12, 2020",
            "views": "108",
            "upvotes": " Submission accepted by Shamima Akter "
        }
    ]
}