{
    "title": "What are some examples of poem with 3 stanzas? - Quora",
    "tags": [
        "Poems",
        "Poetry"
    ],
    "response": [
        {
            "author_info": {
                "name": "James Turner",
                "href": "/profile/James-Turner-414"
            },
            "answer_text": "Here’s a famous (or infamous) example of a poem of three stanzas. This Be The Verse BY PHILIP LARKIN They fuck you up, your mum and dad.  They may not mean to, but they do. They fill you with the faults they had And add some extra, just for you. But they were fucked up in their turn By fools in old-style hats and coats, Who half the time were soppy-stern And half at one another’s throats. Man hands on misery to man. It deepens like a coastal shelf.Get out as early as you can, And don’t have any kids yourself. This is from his short collection High Windows published by Faber & Faber in 1974. There must be many examples of 3-stanza poems. It’s early in the morning and this is the first that came to mind. Perhaps because I know it by heart and have done ever since I first came across it when I first got interested in poetry (reading it and writing it) in the early 1990s Sonnets (14 lines of iambic pentameters, usually) are occasionally laid out in 3 stanzas. Here’s one by James Turner, from A Chance of Love: Sonnets of Two Decades, published by Oversteps Books in 2015. Autumn Wednesday I’m older than I’ve ever been before. As each day dawns I’m older by a day. The grub that gobbled Tuesday’s wanting more.It’s name is time, and time is here to stay. It’s chomping started back when I did. Then,it scared the child I was and made him ill,though once or twice before the age of tenit stopped, a glimpse of calm that haunts me still. Time’s not a problem these days anyhow,It’s speed cannot be slowed, and I don’t try,for now will always go on being nowthough day may follow day until I die.That falling leaf. Those unseen running feet.The soft light on that roof across the street. ",
            "date": "Answered August 1, 2018",
            "views": "146",
            "upvotes": " View 5 Upvoters",
            "upvoters": [
                {
                    "user_id": "Linard Dela Cruz",
                    "user_href": "/profile/Linard-Dela-Cruz"
                },
                {
                    "user_id": "Sneha Singh",
                    "user_href": "/profile/Sneha-Singh-2317"
                },
                {
                    "user_id": "Aliyah Walker",
                    "user_href": "/profile/Aliyah-Walker-2"
                },
                {
                    "user_id": "Lauren Elsenpeter",
                    "user_href": "/profile/Lauren-Elsenpeter"
                },
                {
                    "user_id": "Tim King",
                    "user_href": "/profile/Tim-King-34"
                }
            ]
        },
        {
            "author_info": {
                "name": "Ibrahim Belhaji",
                "href": "/profile/Ibrahim-Belhaji"
            },
            "answer_text": "O Father, how I have grown How I have grown tired and sickOf decorated men on thronesTalking self-proclaimed politicsUsing fear and anger as tricksTo drive the us blind herds with tacticsUntil the day when we have grown oldTo have never seen days of gold O Mother, how I have dreadThe faces I’ve met in placesWhom I’ve sent to join the deadI dread their teary-eyed facesIgnorance’s finger tracesAll of Mankind’d boasting pagesAnd in the end I will follow themFor, Mother, I am to be comdemned O dear Love, please do not cryFor I loved, love and will love youUntil the day I’ll have to dieEven after that, through and throughFor my love is spent on a fewOf whom you are the most trueI’ll be waiting for your replyBut for now, Love, this is goodbye. A stanza simply stands for a ‘paragraph’, as in this poem you’ll find three ‘paragraphs’ or in poetic terms stanza. ",
            "date": "Answered June 13, 2016",
            "views": "117",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Linard Dela Cruz",
                    "user_href": "/profile/Linard-Dela-Cruz"
                },
                {
                    "user_id": "Rahul Phillip",
                    "user_href": "/profile/Rahul-Phillip"
                },
                {
                    "user_id": "Jack Dubs",
                    "user_href": "/profile/Jack-Dubs-1"
                }
            ]
        }
    ]
}