{
    "title": "What tools inspire you to write? - Quora",
    "tags": [
        "Learning to Write",
        "Creating Writing Advice",
        "Inspirational Stories",
        "Creativity",
        "Inspiration",
        "Creative Writing",
        "Writers and Authors",
        "Writing Advice",
        "Writing"
    ],
    "response": [
        {
            "author_info": {
                "name": "Lori L. Robinett",
                "href": "/profile/Lori-L-Robinett"
            },
            "answer_text": "Many years ago, I worked my way through The Artist’s Way and began to write Morning Pages (3 pages longhand every day). Over the years, the practice has shifted from Morning Pages to Before I Write Pages. I sit down in a comfy spot with a nice journal and a favorite pen (sometimes a fountain pen with a 24k gold nib . . . and sometimes a pen I got free from the library that writes really well) and write. It’s a very freeform, stream of consciousness talk with myself about my story, my setting, what my characters are doing, what might happen next, what problems they might encounter. There’s something about the feel of quality paper and pen and the hand-brain connection of writing in longhand that inspires me to write (and I feel like I write better if I follow this routine). ",
            "date": "Answered April 26, 2019",
            "views": "51",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Yasmine Aouassar",
                "href": "/profile/Yasmine-Aouassar"
            },
            "answer_text": "You know when I was back 13~14 years old, I tried to suicide too many times due to a lot of reasons like having no friends ((but thank GOD I’m over it today)), ANYWAYS I had to recover my self and because of the lack of people in my life, I started imagining people(( like any person I want to face)) and opening up any random subject but….that wasn't enough because I thought that one day I Will change, I'm not going to stay the same miserable me ((which is thank GOD for!!! Because I did, yay!!!)) So I need it to write down my problems at any book, any page (( but keep for your self!!!)) as a reminder of what you have been passing through and feel the change, because change is good!!! ((In the positive way of course)) ",
            "date": "Answered July 6, 2019",
            "views": "27",
            "upvotes": " Answer requested by Donna Quiroz"
        }
    ]
}