{
    "title": "What's your opinion on Grammarly? - Quora",
    "tags": [
        "Grammar",
        "English Grammar"
    ],
    "response": [
        {
            "author_info": {
                "name": "Daniella Jones",
                "href": "/profile/Daniella-Jones-46"
            },
            "answer_text": "I use the premium version of Grammarly for all my research work. It helps me structure my content in organized grammar free format. What I love the most about Grammarly is that when you upload a document to its platform, the first thing it would ask you to do is set targets based on audience, formality, domain, tone and intent. This is an excellent approach to assessing content and grammar as different audiences, and different settings require different tones of writing. For instance, I generally use Grammarly for my research papers. Hence I set the tone to be technical. What I realized is that I used a lot of future tense in my writing, which isn’t ideal for technical writing. Also setting my domain to academic helps me avoid slangs or abbreviations that are informal. All of these features unquestionably come in handy, and the plagiarism tool is quite useful as well. However, I need to be exceptionally sure that my content doesn’t have plagiarism, so I don’t prefer relying on Grammarly for this. It should work fine for most business and general content, but I make sure to put my work through Copyscape too, to double-check. Overall I feel Grammarly is an excellent software for grammar correction and spelling mistakes; however, it at times provides too many invaluable suggestions, which are just synonyms to the word you used. Hence don’t blindly take all the suggestions Grammarly has to offer, go through their descriptions and see which changes are helpful, and avoid the others. I hope this helps! ",
            "date": "Answered April 14, 2020",
            "views": "161",
            "upvotes": " View 12 Upvoters",
            "upvoters": [
                {
                    "user_id": "Magwawa Bente Dos",
                    "user_href": "/profile/Magwawa-Bente-Dos"
                },
                {
                    "user_id": "Klai TV",
                    "user_href": "/profile/Klai-TV"
                },
                {
                    "user_id": "Jessa Palamos",
                    "user_href": "/profile/Jessa-Palamos"
                },
                {
                    "user_id": "Nick Palamos",
                    "user_href": "/profile/Nick-Palamos"
                },
                {
                    "user_id": "Shinichi Tanaka",
                    "user_href": "/profile/Shinichi-Tanaka-7"
                },
                {
                    "user_id": "Alwynjohn Eraña",
                    "user_href": "/profile/Alwynjohn-Eraña"
                },
                {
                    "user_id": "Alma Nalda Modesto",
                    "user_href": "/profile/Alma-Nalda-Modesto"
                },
                {
                    "user_id": "Lino Modesto",
                    "user_href": "/profile/Lino-Modesto"
                },
                {
                    "user_id": "Jomar Collera",
                    "user_href": "/profile/Jomar-Collera-1"
                },
                {
                    "user_id": "Bhabe Chiquillo",
                    "user_href": "/profile/Bhabe-Chiquillo"
                }
            ]
        },
        {
            "author_info": {
                "name": "Jack Greens",
                "href": "/profile/Jack-Greens"
            },
            "answer_text": "Grammarly is no doubt an amazing tool that I prefer using every now and then. It tells a lot of things including the basic grammar, spellings and relevance of words. I also prefer using Grammarly as my browser extension but the thing is most of the important features are available in the premium version of Grammarly. Now seeing to all this for years, I come to a conclusion that it is good for small purposes but If you want to use it for some professional purposes then it is a big “NO” from my side because there are a lot of things that can be made better and let it be anywhere the quality of the content is very important. If you want to get the best out of your content by effective proofreading then choose Aussie Translations for this purpose and create a difference. Check out here- Professional Proofreading Services in Australia - Aussie Translations ",
            "date": "Answered August 30, 2020",
            "views": "29",
            "upvotes": "0"
        }
    ]
}