{
    "title": "What makes a book 'young adult' exactly (fiction, audience, first time author, writing)? - Quora",
    "tags": [
        "Young Adult Literature",
        "Young Adults",
        "Children's and Young Adult Books",
        "Fiction Writing",
        "Fiction",
        "Writers and Authors",
        "Literature",
        "Writing"
    ],
    "response": [
        {
            "author_info": {
                "name": "D.J. Herda",
                "href": "/profile/D-J-Herda-2"
            },
            "answer_text": "According to Wikipedia: “Young adult fiction (YA) is a category of fiction written for readers from 12 to 18 years of age. While the genre is targeted to adolescents, approximately half of YA readers are adults. The subject matter and genres of YA correlate with the age and experience of the protagonist.” While different book publishers may have various age groups into which they slot their acquisitions, most adhere pretty closely to Wikipedia’s age range, mostly for the benefit of their sales departments. Book marketers and sales folks have to know to which age range a book is geared in order to sell that book to a store our online outlet. It’s important to note that YA books aren’t necessarily fiction OR nonfiction but can be either. Although the subject matter for YA books is wide open, the majority of YA’s appeal to those areas in life that cause pre-adolescents and teens the most concern, including sex, drugs, alcohol, and family life. Surprise, surprise! Some of the category-bending attributes of a YA that might entice adult readers to jump onboard include advanced subjects as well as the main character’s advanced level of social awareness, experience, and activity. In other words, if you have a YA as your main character and he/she is more aligned with adult circumstances and development, adults are more likely to pick up and read the book. That’s true even with the sappiest (oops, did I say that?) and least “mature” examples of tween-sex series such as Nancy Drew and Trixie Belden. Often, adults will pick up and read a YA simply because they’re often easier to read than adult books, faster paced, and shorter. Oh, and did I mention “more fun”? One special note of caution for developing writers in search of their first book sales: Contrary to popular opinion, YA’s are NOT easier to write than adult books. Just because the level of sophistication may be somewhat lower than for adult books doesn’t make them a walk through the park for a writer. In fact, knowing what interests YA readers these days is not always easy for an adult to determine, and wording the book to a certain educational reading level can be trying. Still, for YA writers who really want to make a difference in the world by influencing their reading audiences from a young age on, YA’s are definitely worth considering. Hope this helps. ",
            "date": "Answered October 21, 2020",
            "views": "106",
            "upvotes": " View 12 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Tzivia Adler",
                    "user_href": "/profile/Tzivia-Adler"
                },
                {
                    "user_id": "Pavel Morava",
                    "user_href": "/profile/Pavel-Morava"
                },
                {
                    "user_id": "Vanessa Ford",
                    "user_href": "/profile/Vanessa-Ford-65"
                },
                {
                    "user_id": "Dorothy Fontaine",
                    "user_href": "/profile/Dorothy-Fontaine"
                },
                {
                    "user_id": "Laaibah Shahriar",
                    "user_href": "/profile/Laaibah-Shahriar"
                },
                {
                    "user_id": "John Hudson",
                    "user_href": "/profile/John-Hudson-158"
                },
                {
                    "user_id": "James W Clarke",
                    "user_href": "/profile/James-W-Clarke-1"
                },
                {
                    "user_id": "Oleg Volkov",
                    "user_href": "/profile/Oleg-Volkov-29"
                },
                {
                    "user_id": "Lanny Luz",
                    "user_href": "/profile/Lanny-Luz"
                },
                {
                    "user_id": "Elena Piatti",
                    "user_href": "/profile/Elena-Piatti"
                },
                {
                    "user_id": "Lily Temmer",
                    "user_href": "/profile/Lily-Temmer"
                },
                {
                    "user_id": "William D. Richards",
                    "user_href": "/profile/William-D-Richards"
                }
            ]
        },
        {
            "author_info": {
                "name": "Judith Caesar",
                "href": "/profile/Judith-Caesar-1"
            },
            "answer_text": "A strong plot, an exterior conflict (usually human vs, society) , a young protagonist, a lack of graphic sex or violence, and a theme which may cause the reader to question received opinion. It also usually is not stylistically complex or experimental in form. In short, it’s a novel a bright 12 year old can understand, enjoy and find thought-provoking. ",
            "date": "Answered October 21, 2020",
            "views": "53",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Jon Bryce",
                    "user_href": "/profile/Jon-Bryce"
                },
                {
                    "user_id": "Dorothy Fontaine",
                    "user_href": "/profile/Dorothy-Fontaine"
                },
                {
                    "user_id": "Laaibah Shahriar",
                    "user_href": "/profile/Laaibah-Shahriar"
                },
                {
                    "user_id": "John Hudson",
                    "user_href": "/profile/John-Hudson-158"
                }
            ]
        },
        {
            "author_info": {
                "name": "Adelaide Fitzpatrick",
                "href": "/profile/Adelaide-Fitzpatrick"
            },
            "answer_text": "For a book to be young adult it has to appeal to teens. so it needs to include. relatable characters who are in their teens. .romance but not too much so it’s inappropriate . Friendship . More grownup themes. E.g. war, death, sadness. ",
            "date": "Answered October 25, 2020",
            "views": "46",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Tzivia Adler",
                    "user_href": "/profile/Tzivia-Adler"
                },
                {
                    "user_id": "Laaibah Shahriar",
                    "user_href": "/profile/Laaibah-Shahriar"
                }
            ]
        },
        {
            "author_info": {
                "name": "Richard P. Morrall",
                "href": "/profile/Richard-P-Morrall"
            },
            "answer_text": "I am sure you would like a high-minded publishing/library answer, and I could try to write one, but the real answer is this: if a reviewing journal puts the review in the young adult section, the book is YA. ",
            "date": "Answered October 27, 2020",
            "views": "16",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Judy Gill",
                "href": "/profile/Judy-Gill-2"
            },
            "answer_text": "Audience, regardless of the age of the reader, the writer, how experience s/he is. If the book is aimed at the YA Market, then it’s a YA book and a whole lot of adults love them. ",
            "date": "Answered October 23, 2020",
            "views": "38",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Laaibah Shahriar",
                    "user_href": "/profile/Laaibah-Shahriar"
                }
            ]
        }
    ]
}