{
    "title": "What are some good books with a brief summary that one must read at least once? - Quora",
    "tags": [
        "Reading Lists",
        "Book Lists",
        "Literature",
        "List Question",
        "Reading",
        "Book Recommendations"
    ],
    "response": [
        {
            "author_info": {
                "name": "Ramya Vasudevan",
                "href": "/profile/Ramya-Vasudevan"
            },
            "answer_text": "In fact, that would depend a lot on your interests and the topics that you like to read about, like fiction, non-fiction, philosophy, history, art etc. One of the books I personally took up as a challenge during my teenage years is Ayn Rand's 'Atlas Shrugged'. I didn't even understand the title at the time, each page was a punishment and I remember carrying a dictionary around to look up the difficult words as and when I find one. It took me a while to complete it, but I still consider it one of my greatest accomplishments ;) Some other books that I want to suggest:Animal Farm by George OrwellBrave New World by Aldous HuxleyCatch-22 by Joseph HellerCrime and Punishment by Fyodor DostoevskyMalcolm Gladwell's The Outliers and Tipping PointShantaram by Gregory David RobertsThe Kite Runner and Thousand Splendid Suns by Khaled HosseiniShashi Tharoor's The Great Indian NovelActually, I can go on and on :) My personal note: Ayn Rand's books are philosophical, so is the case with Animal Farm, Brave New World, Catch-22 (Satire) - might not be a good thing to start with these. You might not understand the actual meaning of the books and might feel that the books are quite draggingCrime and Punishment, again, based on human psychology, but the narration is very captivating. It's a story, so might be easier to readMalcolm Gladwell's books are an interesting twist on real life stories based on research. Interesting take on some of the things that we take for granted.Shantaram - an autobiographical note of the author's time in India, more like an interesting storyKhaled Hosseini's books are heart warming and really touches your soul - again, both of them are stories, so easier to read and digestThe Great Indian Novel is a good mix of Indian mythology and Indian History. It's recorded as a story, but it is easier to make sense of, if you have a good grasp of both Indian mythology and Indian historySo all in all, I am not sure if these are the best books for a teenager. You could probably go through the book reviews online and select which ones best suit your interest. But these are definitely some of the must reads! ",
            "date": "Answered April 5, 2015",
            "views": "794",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Annie Zerin Jacob",
                    "user_href": "/profile/Annie-Zerin-Jacob"
                }
            ]
        },
        {
            "author_info": {
                "name": "Maira Khan",
                "href": "/profile/Maira-Khan-16"
            },
            "answer_text": "I am a teenager, and I can quite relate to what you are saying. It was always a hard decision deciding what to read, given that we teenagers want something painful, smart, intelligent and intriguing which we can relate to.Some of the well written short books I came across were,- The Perks of Being a Wallflower, Stephen Chbosky- The Catcher in the Rye, JD Salinger- The Book Thief, Markus Zusak- The Kite Runner, Khalid Hosseni- Eleanor & Park, Rainbow Rowell- To Kill A Mockingbird, Harper Lee- Pride and Prejudice, Jane AustenAnd my favourite,- The Godfather, Mario Puzo ",
            "date": "Answered April 5, 2015",
            "views": "317",
            "upvotes": "0"
        }
    ]
}