{
    "title": "What's the point of a thesis and dissertation? - Quora",
    "tags": [
        "Theses and Dissertations"
    ],
    "response": [
        {
            "author_info": {
                "name": "Wendy Hardman",
                "href": "/profile/Wendy-Hardman"
            },
            "answer_text": "From my understanding, a thesis is another word for dissertation.  Both are names for a written report about the research that you have done as part of your academic requirements.  This is a requirement for advanced degrees at many educational institutions. A defense of your research, where you meet with a small group of researchers in the field you researched and explain verbally how your research contributes to the 'pool of knowledge' verbally has long been part of the academic tradition, although a face to face defence is not required by many institutions these days.   Back to your question about what's the point of a thesis.  The expectation is that you have carried out some original research following standard research methods and protocoles.  You use your thesis as a written form of sharing your research results.  You are expected to explain how what you researched, how it fits into the field of study and how the resuts found or not found fits into the field of knowledge in the area you studied.   There is a typical structure for a thesis with predefined chapters such as introduction, literature review, methodology, findings, discussion and summary/conclusions.   Each educational institution has it's own requirments, format and variation of that basic structure.   It's all part of an old tradition where the rearch and thesis you complete is how you demonstrate to the academy that you can follow their rules, carry out research according to the methodology that you chose and when you receive your doctoral degree for example, you have been deemed ready to carry out your own research. ",
            "date": "Answered September 11, 2015",
            "views": "22",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Emma Butler",
                "href": "/profile/Emma-Butler-6"
            },
            "answer_text": "The primary purpose of a thesis or dissertation is to train the student in the processes of scholarly research and writing under the direction of members of the Graduate Faculty. After the student has graduated and the work is published, it serves as a contribution to human knowledge, useful to other scholars and perhaps even to a more general audience.  Therefore, the Graduate School, the University Libraries, and the Graduate Faculty of Penn State have established format standards that theses and dissertations must meet before receiving final approval as fulfillment of graduate requirements. This publication sets forth those standards. Some of these requirements are purely technical; others have been established to ensure that certain vital information is presented in an orderly, uniform manner.  The requirements in this publication apply to all Penn State theses and dissertations. They are, however, designed to allow for maximum flexibility in minor matters, which vary among academic disciplines. Thus, while you will need to comply with the specifications given here, you will probably also need to consult a specialized manual of scholarly style in your field or the style sheet of a leading journal ",
            "date": "Answered September 25, 2015",
            "views": "918",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Afrodite Andalib",
                    "user_href": "/profile/Afrodite-Andalib"
                }
            ]
        }
    ]
}