{
    "title": "What should I do with songs that I write, if I have a passion for music and good lyrics, but not a good voice? - Quora",
    "tags": [
        "Songwriting",
        "Rap Music",
        "Hip Hop Music",
        "Song Lyrics",
        "Songs",
        "Writing",
        "Teenagers and Teenage Years"
    ],
    "response": [
        {
            "author_info": {
                "name": "Tyler Mead",
                "href": "/profile/Tyler-Mead-3"
            },
            "answer_text": "The best thing you can possibly do if you seek to get your music out there is to put it on the internet. The internet was practically made to help people out in connecting with other parts of the world and the people that live in those parts of the world. Unsurprisingly, however, there are plenty of people who write music and they put their music online. What you should do, depending on what you currently have written, is to put them on social media and hope for the best. And I mean that with the greatest of hope because a lot of people do not find fame and fortune because, unfortunately, the music business is HIGHLY selective. Since you have talked about writing rap pieces, there is a program on the Apple Store called RapPad where you can write and perform your writings to a beat. Then, you can put them into the community and let other people hear it. There, you can receive criticism and get some constructive advice. I've used it a couple times before to experiment with a couple sounds. It comes in handy. By the way, if you ever get around to make a mixtape, hit me up, fam (lol) ",
            "date": "Answered March 8, 2016",
            "views": "603",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Clean Slate",
                    "user_href": "/profile/Clean-Slate"
                }
            ]
        },
        {
            "author_info": {
                "name": "Corregan Brown",
                "href": "/profile/Corregan-Brown"
            },
            "answer_text": "I say do the same thing you'd do for any instrument you don't play -- find a collaborator that can. Most people are only proficient in a couple of instruments or instrument classes, and that's fine. The voice is just another instrument. So find a vocalist who sings the songs the way you want them sung and collaborate.  There are a number of groups built this way, with a composer at the center of it all and a changing cast based on where the music is going or who is available. The band Incognito is a prime example; their leader, Jean-Paul \"Bluey\" Maunick mostly plays guitar and sings a bit, and he has musicians he works with again and again, but he is the heart of it all and respected as such.  If you are really passionate about singing and want to be in the front, then take some voice lessons. People, especially musicians who know sound and notes, generally have better voices than they think they do; they're just untrained on the physical aspects of the vocal instrument. Assuming no injuries or egregious physical quirks, you can construct a respectable voice in a few years' time, even if you don't feel you have one today. At 16, if you had asked me if I could sing, I would have said no. Today, at 40, I sing often and am regarded as having a good enough voice to back bands and occasionally lead. (Don't worry, I didn't spend all 24 years practicing! *laugh*) ",
            "date": "Answered March 8, 2016",
            "views": "510",
            "upvotes": "0"
        }
    ]
}