{
    "title": "What should one write in his journal everyday? - Quora",
    "tags": [
        "Diaries and Journals",
        "Writing Advice",
        "Writing"
    ],
    "response": [
        {
            "author_info": {
                "name": "Martina Michalikova",
                "href": "/profile/Martina-Michalikova"
            },
            "answer_text": "Write whatever you want. Or maybe even things, that you don’t want to think about — but be gentle with yourself. If there is a reason why you started your daily journal, then follow that reason: if you want to learn yourself better, then write about your experiences and feelings. If you want to create a documentation of your life, then write about the important events. Etc. I personally like to see my journal as my “sacred space”, which I can fill with whatever I feel like at the moment. So it contains also drawings, diagrams, notes of ideas I would like to develop, letters drafted but never sent, etc. I typically don’t try to make my text understandable to others (or even to my future) by providing context — because many times I got so caught up in describing the context, that the feeling I tried to understand disappeared. So now I just try to stay with the flow as much as possible… ",
            "date": "Answered May 6, 2019",
            "views": "135",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Jennifer Ghresh",
                    "user_href": "/profile/Jennifer-Ghresh"
                }
            ]
        },
        {
            "author_info": {
                "name": "Takesha Powell",
                "href": "/profile/Takesha-Powell"
            },
            "answer_text": "One should write whatever one wants in their journal everyday - random thoughts about your day; dreams that you've had; recording things people have said to you, literally anything that is in your head. The greatest benefit of writings in your journal is freedom of expression. On those pages you can say vile, blasphemous things if you wish because, unless it's for a class assignment, only your eyes will see your thoughts. ",
            "date": "Answered May 11, 2019",
            "views": "24",
            "upvotes": " Answer requested by Jennifer Ghresh"
        }
    ]
}