{
    "title": "What are motivation skills? - Quora",
    "tags": [
        "Understanding and Maintaining Motivation",
        "Self Motivation",
        "Skills"
    ],
    "response": [
        {
            "author_info": {
                "name": "Abhishek Pastore",
                "href": "/profile/Abhishek-Pastore-1"
            },
            "answer_text": "Motivation skills Guide To Achieve Goals – Motivation skills push us to get our goals, feel more satisfied, and improve the overall value of life. People who are self-motivated tend to be more prepared, with good upcoming opportunities in the job market. Also, the quality of a strong mindset will be very much useful in tiding over the crisis and passing on into a new life and job. In the end, it is the self that needs to be strengthened from all aspectsTo make the transition to a new career or in a new workplace requires strong belief and planning. With the help of people giving advice, one can go ahead to have a career, if there is mettle in self. It will be surely a hard job to do so, but the transition will have to be done by self and give all the best efforts possible in the most prudent and effective manner. ",
            "date": "Answered September 18, 2020",
            "views": "16",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Abduraheem Saheb Campbell",
                "href": "/profile/Abduraheem-Saheb-Campbell"
            },
            "answer_text": "Motivation skills are what drives one into action and there are many even though few will apply the same if you lack the necessary motivation then no amount of skills are going to help you so do initiate your own drive and will to do your best be relentless do whatever it takes to up your game and bear in mind that the road to success is a long and tricky and winding one as well as uphill and thank you again for your query it shows that you have good motivational skills. ",
            "date": "Answered February 19, 2020",
            "views": "28",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Diyendra Perera",
                    "user_href": "/profile/Diyendra-Perera"
                }
            ]
        }
    ]
}