{
    "title": "What are the best courses available for creative writing? - Quora",
    "tags": [
        "Best of X",
        "Creative Writing"
    ],
    "response": [
        {
            "author_info": {
                "name": "Kamila Miller",
                "href": "/profile/Kamila-Miller-2"
            },
            "answer_text": "That depends on what kind of writing you want to do. Fantasy? Creative non-fiction? Historical? Mystery? Poetry? All of those are ‘creative writing’ and all of them have places and online courses that you can learn how to write more deeply and more skillfully. My genre is fantasy, so my recommendations are all going to be for the SF/F/H genres. For fantasy and science fiction with a literary leaning, I highly recommend Cat Rambo’s classes. Cat is an accomplished author, editor and instructor. I’ve taken her courses and have found them very valuable. They might be better for intermediate or advanced authors, though I’ve heard beginners do fine as well. If you’re interested, email her for details and ask her whether you’d be a good fit for a specific class. Clarion is a well-known seminar where many SF/F/H short story authors have gotten a good start in writing. (It’s also broken some writers …) A related seminar, but focused on novel length work, is Viable Paradise. These are both based in the United States. Mary Rosenblum does excellent work. She teaches one-on-one and also has book doctoring services. I don’t normally recommend book doctors, but I’ve personally seen the results of her work. Her students and clients advance quickly and are all happy with her. She’s also an accomplished author. For romance, the Romance Writers of America have specific recommendations, and local chapters often offer in-person classes. In general, one of the best ways to find quality learning opportunities is to join a writing group that focuses on the type of writing that you do. Facebook is an easy place to start, but not necessarily the best place. Try the Absolute Write Water Cooler forums. There’s a huge amount of information available there. Please use the search function, as you’ll probably find that someone else has asked about good writing classes before you. You can jump to the last page to get the newest answers first. Good luck! ",
            "date": "Answered January 14, 2017",
            "views": "3",
            "upvotes": " View 5 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Sharon Joseph",
                    "user_href": "/profile/Sharon-Joseph-39"
                },
                {
                    "user_id": "Jonathan Wong",
                    "user_href": "/profile/Jonathan-Wong-99"
                },
                {
                    "user_id": "Grant Boothe",
                    "user_href": "/profile/Grant-Boothe"
                },
                {
                    "user_id": "Tatiana Horod",
                    "user_href": "/profile/Tatiana-Horod"
                },
                {
                    "user_id": "Saravanan Meivel",
                    "user_href": "/profile/Saravanan-Meivel"
                }
            ]
        },
        {
            "author_info": {
                "name": "Pawan Kumar Jha",
                "href": "/profile/Pawan-Kumar-Jha-2"
            },
            "answer_text": "If the ability to write creatively were possible through courses, the world would rather have become the hub of institutes imparting knowledge on creative writing skills. Can’t deny the veracity of some institutes though, but if you ask me, I never went for it or will not go for it in future as well. Why? Because writing is more ‘application of your thought in the fashion that is semantically unique’ than ‘application of imposed thought-pattern that is semantically artificial’.  This is the reason why the world has countless unsuccessful writers, but very few (finger-countable) ones who are truly gifted in their niche.  You will, if you Google down your query, receive deluge of pros and cons discourses as to whether or not creative writing course leads to successful outcome of making the course-pursuer a talented and gifted, creatively. But my standpoint will always be in the antithesis of those viewpoints supporting such a course. And this is the reason why I barely got stunned upon coming to know about the statement of Creative writing professor Hanif Kureishi, who said such courses are 'a waste of time' (Creative writing professor Hanif Kureishi says such courses are 'a waste of time').  Quandary that most of the pursuers like you may encounter is the reliability of these courses.  Over the last seven months, I have been receiving a mail from a UK-based institute (I’ve spammed it), attempting to persuade me to enroll for its creative writing course (can’t disclose the name on account of my morality). Well, the institute seems genuine on prima facie, as I have come to know various positive reviews supporting its veracity. However, I didn’t bulge. I believe, and I have shared my empirical understanding about creating writing in many articles/blogs of mine, that writing is all about writer’s creative expression, and this expression is an acquired taste. It can’t be instilled in you through inculcated practice of your tutor until you are docile. And if you are docile, then believe me, you will never need your creativity being shaped by others – you will architect it by yourself...through dedicated practice and learning from others (seniors/known writers etc.).  Does that mean these courses are irrelevant?  Well, as far as I concur, this depends on your docility and financial condition (for sure this doesn’t come cost-free). There were also some comments opposing viewpoint of Hanif, and some of them resonate my views as well. For instance, I agree with Matt Haig’s standpoint when he said - I do think some people will never be writers. Just like some people will never be architects or web designers. But good writing courses will help you work out if you are a writer or not.\"  There are writing courses that can inflict changes in your relationship with the language (writing). So, the decision is all yours.  If you intend to learn it on your own, then just flush out your ego and learn from mistakes. Keep on, as persistence is the reward of an improved talent. Thanks! ",
            "date": "Answered November 7, 2015",
            "views": "26",
            "upvotes": " View 14 Upvoters",
            "upvoters": [
                {
                    "user_id": "Sharon Joseph",
                    "user_href": "/profile/Sharon-Joseph-39"
                },
                {
                    "user_id": "Anne Sarah",
                    "user_href": "/profile/Anne-Sarah-2"
                },
                {
                    "user_id": "Viddhi Shah",
                    "user_href": "/profile/Viddhi-Shah-1"
                },
                {
                    "user_id": "Ishan Sharma",
                    "user_href": "/profile/Ishan-Sharma-234"
                },
                {
                    "user_id": "Zeus Ghosh",
                    "user_href": "/profile/Zeus-Ghosh"
                },
                {
                    "user_id": "Sarada Prasad",
                    "user_href": "/profile/Sarada-Prasad-7"
                },
                {
                    "user_id": "Chloe Wang",
                    "user_href": "/profile/Chloe-Wang-50"
                },
                {
                    "user_id": "Tejas Shah",
                    "user_href": "/profile/Tejas-Shah-14"
                },
                {
                    "user_id": "Sanket Singh",
                    "user_href": "/profile/Sanket-Singh-2"
                },
                {
                    "user_id": "Bhanupriya Jayaraj",
                    "user_href": "/profile/Bhanupriya-Jayaraj"
                },
                {
                    "user_id": "Irda Kahn",
                    "user_href": "/profile/Irda-Kahn"
                },
                {
                    "user_id": "Pallavi N.P",
                    "user_href": "/profile/Pallavi-N-P"
                },
                {
                    "user_id": "Justin Blatt",
                    "user_href": "/profile/Justin-Blatt-1"
                },
                {
                    "user_id": "Margo Ritter",
                    "user_href": "/profile/Margo-Ritter"
                }
            ]
        },
        {
            "author_info": {
                "name": "Wallace Lee",
                "href": "/profile/Wallace-Lee-6"
            },
            "answer_text": "I am against creative writing courses for the simple reason that 90% of the courses tries to TEACH you something you have learn YOURSELF. No teacher can ‘fix’ you. They can point you the right path at best, but reading ‘ON WRITING’ by S. King is enough to get the same result (and sparing a lot of money too). A good point to start writing is accepting you are not good at writing. You accept that and you have done 90% of the job already. Then you start experimenting with style with the only purpose of make your works +++work+++. Don’t try to get your style ‘better’, ‘cooler’ or ‘prettier’. .. It only makes things worse and longer before you become a good writer. Make your style ‘work only’, and trust me: no one can say you how to do that, because EVERY mind is different from the other and no teacher can tell you what path to take. At best, a teacher can tell you why a single work of yours does not work, but he will never ever explain you hoe to make it work, because he cant. The second part is about ideas. You have to find ideas (not create them). You understand that and than it’s done… You are a writer already. You only have to read a lot and write a lot, and if there’s a soul in your body, first or later you wil write something worth to read. ",
            "date": "Answered September 13, 2016",
            "views": "13",
            "upvotes": " View 5 Upvoters",
            "upvoters": [
                {
                    "user_id": "Julie Keishi",
                    "user_href": "/profile/Julie-Keishi"
                },
                {
                    "user_id": "RENU SREE",
                    "user_href": "/profile/RENU-SREE-13"
                },
                {
                    "user_id": "Aachal Vayeda",
                    "user_href": "/profile/Aachal-Vayeda"
                },
                {
                    "user_id": "Saravanan Meivel",
                    "user_href": "/profile/Saravanan-Meivel"
                },
                {
                    "user_id": "Anne Sarah",
                    "user_href": "/profile/Anne-Sarah-2"
                }
            ]
        },
        {
            "author_info": {
                "name": "Balraj Sidhu",
                "href": "/profile/Balraj-Sidhu-1"
            },
            "answer_text": "This is what I found on internet: From a wide range of colleges and universities in India, here is a list of the ten most popular and sought after institutions which offer courses in creative writing: The British Council located in all metro cities in India offers degree, diploma and certificate courses in Creative writing.The JNU (Jawaharlal Nehru University) in New Delhi offers creative writing as an optional subject in its MA (English) courseCalcutta University offers a Diploma course in Creative WritingBharatiya Vidya Bhavan in New Delhi offers a Postgraduate Diploma course in Creative WritingXavier’s Mumbai Central Institute of Indian Languages, KarnatakaCenter for Research in Art of Film and Television, Delhi which offers a one-year diploma courseIndira Gandhi National Open University, New Delhi which offers a PG diploma in Creative writing though the distance learning programU.P.Rajarshi Tandon Open University, Allahabad offers diploma courses through the distance modeDr. Babasaheb Ambedkar Open University, AhmedabadThe Karnataka State Open University, Karnataka offers Diploma courses through the distance mode.But many universities across India, in one way or another (what I mean is, if not a dedicated course in creative writing then at least they teach it as a part of curriculum) teach creative writing to some extent.What I would say is that though Rohinton Mistry, Chimamanda Ngozi Adichie, Mohsin Hamid have all benefited from creative writing courses they pursued in North America Universities and Young Adult writer Nikita Singh has also started the same from New York University. I would still say that one must have an urge from within to tell stories. No matter how many people have told you this, but it actually is extremely important. You can ask further questions or start a proper discussing under this thread. I will be more than happy to engage myself with this. ",
            "date": "Answered October 11, 2016",
            "views": "15",
            "upvotes": " View 2 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Kajori Patra",
                    "user_href": "/profile/Kajori-Patra"
                },
                {
                    "user_id": "Avneesh Bhatia",
                    "user_href": "/profile/Avneesh-Bhatia"
                }
            ]
        },
        {
            "author_info": {
                "name": "Justin Swapp",
                "href": "/profile/Justin-Swapp"
            },
            "answer_text": "I wouldn’t limit yourself to courses, per se. Today, there are many ways for you to learn how to improve your creative writing: Podcasts (Writing Excuses, The Story Grid, etc.)Online courses (iTunes University has a ton of courses from Standford, and Harvard, etc.)Blogs (There are MANY of these, often with fantastic information. Abolute Write is a great place to start.)Audiobooks (Listen to books on writing)Book books. (eBooks, printed books, manuals, text books)Try your local collegeSeminarsWorkshopsYour local chapter for League of WritersEtc. ",
            "date": "Answered August 3, 2016",
            "views": "12",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Preeti Rai",
                    "user_href": "/profile/Preeti-Rai-6"
                },
                {
                    "user_id": "Farheen Siddiqui",
                    "user_href": "/profile/Farheen-Siddiqui-36"
                },
                {
                    "user_id": "Anne Sarah",
                    "user_href": "/profile/Anne-Sarah-2"
                },
                {
                    "user_id": "Medimax Hospital Abuja",
                    "user_href": "/profile/Medimax-Hospital-Abuja"
                }
            ]
        },
        {
            "author_info": {
                "name": "Sanjay Singh",
                "href": "/profile/Sanjay-Singh-1638"
            },
            "answer_text": "Hey there! Creative Writing Workshop is being organized by Plugg Social in association with PepperScript, delivered by Kavya Sharma at PowerStation by OYO, on 26th of May, 2019, Sunday. Detailed discussion about the ways and areas of focus such as character building, plot, timeline, setting, narration, Point of View, styles, etc in novel/novella/short story writing. The workshop will cover the following topics- 1. How to make a start when it comes to writing prose 2. Dealing with the basics of creative writing 3. Structuring your work to make it presentable and readable 4. Coming to ends 5. Editing your own work, critical analysis 6. Approaching a publisher 7. Marketing your work What you will get out of it ? *Tea/Coffee☕*Study Material*One-on-one discussion with the mentor*One-on-one discussion with the publisher⌨️*e-Certificate of Workshop Completion*A free book Limited seats available, registrations are now open. Book your seats asap. To learn more about the event visit ... https://www.facebook.com/events/2300932590143344/ or you can visit the website for more details at https://www.plugg.social/ ",
            "date": "Updated May 20, 2019",
            "views": "243",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Bharat Kanojia",
                "href": "/profile/Bharat-Kanojia-1"
            },
            "answer_text": "I think you should simply follow creative writers on different platforms. This will help you to learn a lot of insights about persuasive, creative and influential writing. Some of my recommendations to you would be copyblogger, hubspot, bufferapp. If you follow them closely you will be able to recognise as to what extent you are creative when it comes to writing. Avoid doing courses... ",
            "date": "Answered August 6, 2015",
            "views": "15",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Aachal Vayeda",
                    "user_href": "/profile/Aachal-Vayeda"
                },
                {
                    "user_id": "Soma Varun",
                    "user_href": "/profile/Soma-Varun"
                }
            ]
        },
        {
            "author_info": {
                "name": "Taha Sewedy",
                "href": "/profile/Taha-Sewedy"
            },
            "answer_text": "Last year I was enrolled in “how writers write fiction “ MOOC organized by the international writing programm IWP in the unversity of Iowa city USA, it was a very useful and helpful course as it dealt with all components of fiction writing and I do encourage whoever interested in creative writing to keep up with the IWP as it offers good and free online stuff from time to time. ",
            "date": "Answered September 6, 2016",
            "views": "520",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Vic Thomas",
                "href": "/profile/Vic-Thomas-5"
            },
            "answer_text": "Skillshare has some really good courses on Creative Nonfiction and Fiction writing taught by nationally acclaimed writers. They're having a sale right now that says you can enroll unlimited classes for $1 .There's like a hundred writing classes . ",
            "date": "Answered October 28, 2015",
            "views": "331",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Fiona Wallace",
                "href": "/profile/Fiona-Wallace"
            },
            "answer_text": "Arvon selected fiction.Any reputable course that admits by portfolio.Of course, the question you need to ask yourself first is what level your writing is at, and if you’re unsure, to get a professional opinion. You choose courses based on your teaching needs, not based on how famous or ‘best’ they are. ",
            "date": "Answered September 11, 2016",
            "views": "568",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Haroldj Duk",
                "href": "/profile/Haroldj-Duk"
            },
            "answer_text": "The understudies at Iowa, similar to the a large number of others selected in the developing number of graduate composition programs broadly, are tainted with the fever of the rising craftsman, and the yearning to succeed against the calming chances of the distributed scene. Attempting to evaluate graduate written work projects is similar to rating the main 10 party schools: You can include what number of containers go, and what number of discharges go out, yet you can't demonstrate the gathering was enjoyable. ",
            "date": "Answered January 27, 2016",
            "views": "758",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Shubhneet Arora",
                "href": "/profile/Shubhneet-Arora-1"
            },
            "answer_text": "yes, there are many courses related to creative writing on coursera. here is the link Coursera | Online Courses From Top Universities. Join for Free ",
            "date": "Answered January 18, 2017",
            "views": "145",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Dakota Lim",
                    "user_href": "/profile/Dakota-Lim"
                }
            ]
        },
        {
            "author_info": {
                "name": "Soma Varun",
                "href": "/profile/Soma-Varun"
            },
            "answer_text": "In my view, MA literature is the best course in creative writing. ",
            "date": "Updated September 17, 2016",
            "views": "47",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Maha Raja",
                "href": "/profile/Maha-Raja-15"
            },
            "answer_text": "If you are creative enough! you can make it own.",
            "date": "Answered July 31, 2015",
            "views": "238",
            "upvotes": "0"
        }
    ]
}