{
    "title": "What are some examples on how to start a horror story? - Quora",
    "tags": [],
    "response": [
        {
            "author_info": {
                "name": "Timm Wellman",
                "href": "/profile/Timm-Wellman"
            },
            "answer_text": "I assume you mean the very beginning or first few scenes. In that regard, there are a couple ways to start a horror story: The Lovecraft route where you hint at the horror your reader will discover. This is good if your horror doesn't rely solely on a twist. It can have one, but the twist must only add to the horror that the reader was already expecting.For instance: I recently wrote a story about a guy who discovers a church where things from another world were trying to break through. It starts off by illustrating the narrator’s fear despite the distance he put between himself and the church. The story later reveals that the priest that was summoning them was dead, then finally that the priest was actually the only thing keeping the creatures at bay. There's a twist, but coming from a place that this narrative hook doesn't cover. It is still an effective tool if you feel like you want to keep the reader curious about the ending. The poltergeist method where you do not address the horrors that await your characters until they appear. This technique understands that the reader knows it's a horror, and so will anticipate it regardless or doesn't know, and will be that much more scared when it comes.The original poltergeist movie is an excellent example. The entire first act has almost no horror in it at all. This can often be a better option but relies on your skills as a non-horror writer. There's no shame in using either method but be aware of your abilities in this regard. ",
            "date": "Answered August 29, 2017",
            "views": "965",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Swarnim Bhardwaj",
                    "user_href": "/profile/Swarnim-Bhardwaj"
                },
                {
                    "user_id": "Twinkal Gala",
                    "user_href": "/profile/Twinkal-Gala"
                },
                {
                    "user_id": "Mariah Delepierre",
                    "user_href": "/profile/Mariah-Delepierre"
                }
            ]
        },
        {
            "author_info": {
                "name": "Bill Johnson",
                "href": "/profile/Bill-Johnson-31"
            },
            "answer_text": "Here’s part of an essay I wrote breaking down the opening pages of The Exorcist. Bill Johnson, The Exorcist For many writers the issue of how to structure the elements of a novel can seem a mystery only to be solved by writing toward understanding. Another path is to review the opening chapters of a well-written novel to explore how that author set that story into motion. What follows will be a review of the opening pages of The Exorcist. This review explores how the novel is constructed to be dramatic and engaging from its opening pages. In The Beginning... It is of prime importance that novelists cue their audience to the promise of their stories. This promise needs to be viewed as a separate issue from introducing a story's characters or plot. The actions of a story's characters only take on a clear meaning as they act out a story's promise. If that promise is withheld to create a revelation for a story's plot, it withholds from the story's audience a context for what the action means. Readers can typically only go several pages into a story without some context that gives the action meaning; after that, it's like wading through mud. The Novel In The Exorcist, William Blatty begins setting out the promise of his story on the first page of his prologue. On page three of the Bantam paperback edition (purple cover), opening paragraph, he writes, He could not shake the premonition. It clung to his back like chill wet leaves. What this premonition is and why it clings to the narrator's back is left to be revealed latter. More to the point, to get the answer to the question posed by these two sentences, the story's audience must continue reading. Therefore, this opening paragraph has met a prime directive of the opening paragraph of a novel: it has set up a desire for the book's audience to read the second paragraph. Novelists who fail to create an engaging, dramatic opening to their stories generally remain unpublished. Note that Blatty has already given his audience a place for the location of the prologue simply by having a title page that reads, \"Prologue....Northern Iraq.\" This is a subtle but important point. An audience in the beginning of a story craves to know where and when they are. Blatty satisfies that need in the simplest, most direct way possible. He simply tells the audience via the title page that the prologue opens in Northern Iraq. This saves him from needing to use the opening lines of the prologue to set out this information. Instead, he can focus on the more important issue, setting out the dramatic purpose of the story at the same time he sets the stage for his opening scene. Continuing with this process, Blatty lets us know that we are at an archeology dig in Iraq. While one set of words is used to create the time, place and feel of the environment of the scene, its heat and bleakness, other sentences cue the audience to the story's purpose. An author creating an opening to a novel must always, on some level, serve this dual purpose of creating a vivid time and place while setting a story into motion. In the second paragraph of the prologue Blatty writes, The bones of man. The brittle remnants of cosmic torment that once made him wonder if matter was Lucifer upward-groping back to his God. And yet now he knew better. Blatty just cued his audience that the drama of this story will revolve around good and evil, Lucifer and God and humankind. It also sets up another question. What is this issue the narrator now \"knew better?\" Again, it is a suggestive comment that both sets up the story's dramatic purpose while drawing the reader deeper into the story to discover the answer. At the end of the second paragraph he writes, The dig was over. What was beginning? The author cues the audience through the story's narrator that significant events are taking shape. He started the audience along this particular path with his first two sentences by mentioned the premonition. Now, he moves them a beat farther along the path. It creates a quality of movement. Again, to discover the meaning of those events, one must keep reading. Note that at the end of the second paragraph, we know more about the story than we do about the character perceiving these events. Blatty, like all successful novelists, has not confused introducing character and plot with introducing his story. If he'd simply found a way to introduce his characters and plot and not his story, the actions of his characters would lack dramatic purpose. Third paragraph, a \"dark shadow\" appears over the prologue's narrator. These words are suggestive of the forces that will be unleashed in this story. A story's dramatic purpose reaches into every character scene and word in a story to give it meaning and purpose. Words, characters and events that exist outside of a story's dramatic purpose should be revised. They confuse the story's audience. Looking at the dirt encrusted shoes of a local helping with the dig, the narrator thinks, The man in khaki shook his head, staring down at the laceless, crusted shoes caked thick with debris of the pain of living. The author continues to cue his audience to his story's dramatic purpose via the details of what he chooses to describe. Life is about pain. Continuing, The stuff of the cosmos, he softly reflected: matter, yet somehow spirit. Spirit and the shoes were to him but aspects of a stuff more fundamental, a stuff that was primal and totally other. Again, the author sets out the terrain of this story. This story will explore not just what is visible, but this \"other\" that underlies reality. The author continues, The shadow lifted. The Kurd stood waiting like an ancient debt... Once he could not have loved this man. This last line is a very suggestive, very dramatic sentence. If \"once he could not have loved this man,\" then what happened to our narrator? Again there's the arrangement of the story's elements designed to pull its audience deeper into the story. Note that as yet we don't know the narrator's name, how old he is, his background. We just know we're in a story written by a storyteller. ",
            "date": "Answered July 25, 2020",
            "views": "285",
            "upvotes": "0"
        }
    ]
}