{
    "title": "What should I put in my resume? - Quora",
    "tags": [
        "Resume",
        "Résumé and CV writing"
    ],
    "response": [
        {
            "author_info": {
                "name": "Amanda Lynn",
                "href": "/profile/Amanda-Lynn-727"
            },
            "answer_text": "Your resume should have these important sections: Your name and title – Your professional title should match the job position you are applying for. Contact details – List down your mailing address, telephone and mobile nos., email address Executive Summary – Describe in the most compelling way your suitability for the job position, your major skills and expertise and how you can positively contribute to the cause of the hiring company. Skills – List both technical and soft skills Work Experience – You may do in in chronological order or according to the relevance of your past experiences to that you apply for. There is no need to include those that are over 15 years ago unless they are really worth mentioning in relation to the requirements of the current position being advertised. It is necessary to highlight your past contributions to your former employers in terms of measurable descriptions of your feats. Education – Positioned at the end of the resume, being less important than work experience and achievements that the prospective employer expects to see. Other Information related to the area of work you are applying for. I suggest you take a look at some good examples of professionally written resume samples in this free resume builder tool site. ",
            "date": "Updated February 18, 2019",
            "views": "207",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Jeremy Shreve",
                "href": "/profile/Jeremy-Shreve"
            },
            "answer_text": "As simple of a question as this is, I think more people need to ask it. A resume is NOT the place to put everything you’ve ever done, every skill you have, and every trait you possess that might help you get a job one day. Too many people make this mistake. Don’t do it. A resume IS a single page that represents all your most impressive skills and qualifications, designed to secure an interview for your very next job. This means if you want to move from a sales rep to a sales manager, this is not the time to put that you speak beginner german or took a class in HTML in high school. I hope the difference is obvious. Only put the most relevant things that position you for an interview. The hiring manager is going to skim this and say “does this person sound like they can handle the job? And if so, are they worth taking up 30 minutes of my time for an interview?” If you aren’t answering one of those questions, you’ve gone off course in the resume. This is a long winded answer, but the point is this: Only put things they’re actually going to care about. It’s tough when you are first starting out and you don’t feel like you have much accomplishment to show to the world. But a half-page resume that is straight-forward and plain-spoken will perform better than 2 pages of fluff and bloat that only make you sound out of touch and insincere. ",
            "date": "Answered May 22, 2016",
            "views": "123",
            "upvotes": " Answer requested by Amanda Rampersad and Sowdhamini Sunder"
        }
    ]
}