{
    "title": "What’s the difference between having 200 million and 1 Billion? - Quora",
    "tags": [
        "Billion",
        "Valuations (finance)",
        "Becoming a Millionaire",
        "Billionaires",
        "Wealth",
        "Wanting and Making Money",
        "Numbers (mathematics)",
        "Money"
    ],
    "response": [
        {
            "author_info": {
                "name": "Adam Lee Chadwick",
                "href": "/profile/Adam-Lee-Chadwick"
            },
            "answer_text": "Difference between 200 Million and 1 Billion: 200 Million is 5 times less than 1 Billion and also the separation of the 2 is 800 Million. Big Difference 1. Bank Account Size between the 2 is enormous. 2. This is what you get when you have $1 Billion. This house cost $250 Million.  3. This is a private jet owned by Donald Trump. When you are a billionaire, this is what you can own and the cost of this private jet is $100 Million.  4. This private yacht is owned by the Owner of the Dallas Cowboys Jerry Jones. When you are a billionaire, you can afford a private yacht like this one. The cost of this private yacht is $250 Million.  5. When you are a billionaire. You can invest and own a Professional Soccer Stadium like this one. This particular stadium is for a Professional Soccer League in Nashville and the cost of the stadium is $250 Million.  6. As a billionaire, this luxury hotel can be yours if the price is right. This hotel cost is for $250 Million on the waterfront.  The biggest difference is that with $1 Billion, you can basically have and own your own professional sports team to the most luxurious yachts and private jets, a luxury hotel on the waterfront that can never happen with $200 Million. Super Super Rich of the most lavishing lifestyle with $1 Billion in your own personal bank account. ",
            "date": "Answered April 8, 2019",
            "views": "339",
            "upvotes": " View 60 Upvoters ",
            "upvoters": [
                {
                    "user_id": "David Dasilma",
                    "user_href": "/profile/David-Dasilma-1"
                },
                {
                    "user_id": "Arthur Nomnganga",
                    "user_href": "/profile/Arthur-Nomnganga"
                },
                {
                    "user_id": "Mark G. Shorr",
                    "user_href": "/profile/Mark-G-Shorr"
                },
                {
                    "user_id": "Joshua Joji",
                    "user_href": "/profile/Joshua-Joji"
                },
                {
                    "user_id": "Siddharth Mukherjee",
                    "user_href": "/profile/Siddharth-Mukherjee-26"
                },
                {
                    "user_id": "Davion Wilson",
                    "user_href": "/profile/Davion-Wilson"
                },
                {
                    "user_id": "Chudi Makam",
                    "user_href": "/profile/Chudi-Makam"
                },
                {
                    "user_id": "Paras Vora",
                    "user_href": "/profile/Paras-Vora"
                },
                {
                    "user_id": "Nilanjan Basak",
                    "user_href": "/profile/Nilanjan-Basak"
                },
                {
                    "user_id": "Jerwyn James",
                    "user_href": "/profile/Jerwyn-James"
                }
            ]
        },
        {
            "author_info": {
                "name": "Denis Berthier",
                "href": "/profile/Denis-Berthier"
            },
            "answer_text": "“What’s the difference between having 200 million and 1 Billion?” I see lots of answers saying 800 million. While that’s materially correct, I think it doesn’t answer the question. I guess the intended question was: “does one feel different with 200 million and with one billion?” I guess it shouldn’t make much difference. But maybe it does when you have 200 million and your neighbour has one billion, a larger house, a larger ship, a larger swimming pool, a faster private jet…, and lots of other useless things. ",
            "date": "Answered April 8, 2019",
            "views": "281",
            "upvotes": "0"
        }
    ]
}