{
    "title": "What will you write in your will? - Quora",
    "tags": [
        "Death and Dying",
        "Life and Living"
    ],
    "response": [
        {
            "author_info": {
                "name": "Forrest Pope",
                "href": "/profile/Forrest-Pope-1"
            },
            "answer_text": "My will? I don’t own much I’m 14. I suppose, all my clothes and those old action figures and stuff I have go to my 1st cousin, (take care of it,) I have another first cousin, but it’s a girl so probably wouldn’t be interested. All my books? Probably to anyone who wants them. Nobody in my family reads much. I have one of those crystal rock things that I would split with my family to remember me by.  My money.. you mean that 100$ and my savings bonds? To my parents, won’t help them much but oh well. I would leave my bible to my nana, because she would like it, being the big ol Christian she is. All my Clemson stuff goes to my Grandparents on my dad’s side. I do save my goosebumps books for my mom, because she loved goosebumps as a kid. Those old cars and monster trucks that I hoard until they find another use? I give them to my moms best friends son, he loves them. I leave my Ds’s and 3ds’s to them as well, but give the Pokémon games to my cousin. Anything Else, just let my parents do whatever with it. But also write a note to my friends telling them that i died, and I love them all, Thanks for reading, Your country boy, Forrest 🌳 ",
            "date": "Answered February 28, 2020",
            "views": "129",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Sophia Wang",
                    "user_href": "/profile/Sophia-Wang-177"
                },
                {
                    "user_id": "Kim Dahyun",
                    "user_href": "/profile/Kim-Dahyun-90"
                }
            ]
        },
        {
            "author_info": {
                "name": "Nicky Sarti",
                "href": "/profile/Nicky-Sarti-1"
            },
            "answer_text": "I would leave everything I had (which isn’t much to be honest) to any family I might have acquired along the way, or to my two passions in life… volunteering with St. John Ambulance or the charities that I support ",
            "date": "Answered February 27, 2020",
            "views": "11",
            "upvotes": "0"
        }
    ]
}