{
    "title": "What's the real truth about what happened to the Native Americans? Did the white man destroy a beautiful civilisation? - Quora",
    "tags": [
        "Native Americans",
        "Truth"
    ],
    "response": [
        {
            "author_info": {
                "name": "Ted Allen Hart",
                "href": "/profile/Ted-Allen-Hart"
            },
            "answer_text": "Diseases that the Native Americans weren’t immune to was what really killed them. The original colonists would write back to people in England and say that they would see the hills full of cooking fires all over the coast at night. That’s how numerous the Native Americans were. Literally 5 to 10 years later, most of those Native Americans had died due to disease. It was so bad that approximately 75 to 85% of the people died and the colonists who came on to land reported they were able to ride a horse and carriage for hundreds of miles unopposed in the forests. How? The Native Americans were the ones who burned off the underbrush for thousands of years. Now we have issues with wildfires due to the white man not accommodating the lands’ needs. To call the Native Americans beautiful and excellent conservatives of the land is not true. They did ruin the environment in some ways. Ever hear of the buffalo jumps? I saw my first one in Montana. Basically they would have warriors make a living fence on two sides to funnel the running buffalo into one point. They would have one or two people who would convince the buffalo to chase them over the cliff. That job was the most dangerous job because that runner would be attached to the ground by a rope wrapped around the waist and he was expected to jump off the cliff and then the buffalo would thunder off the cliff to their deaths while he would hang in the air and hope the rope was enough to hold him until his buddies pulled him up. Of course, they couldn’t get to EVERY buffalo that died from the cliff fall offs so lots of meat was left there rotting. They’re STILL there. The bones, that is! Now I’m from Texas and the Comanches/Kiowas kept the settlements from expanding during the Civil War and they kept anyone from settling it for over 50 years by killing the settlers and fighting just about everyone. They also were known to kidnap children to raise because they had a low birth rate (if you ride horses every day (day in/out) the male fertility rate drops and females are more prone to miscarriages) and had to deal with diseases that killed their kids…so the southern tribes had approximately 30–40% not native children growing up. They practiced adoption in a big way. To be fair, all the tribes practiced adoption in a big way before the Europeans arrived. When certain diseases hit the southern tribes, it was really what finished the Comanches/Kiowas off…it was so devastating that they never could recover in time and the man named Colt invented the repeating revolver. Prior to that, an excellent arrow marksman could actually be far more skilled in killing while the whites would reload. So a combination of disease and new technology plus killing off the buffalo were the reasons the tribes had to give up. After Quanah Parker and his band came in to surrender, the frontier moved so fast that the Texas frontier was settled in faster than when the Comanches had been fighting the settlers. What most people don’t realize or be aware about is the eastern tribes did take in white children or children from other races. They always have. The Seneca have Mary Jemison , who they took in as a teen who decided to stay with the nation. Her descendants still are Seneca tribal members today. (Mary Jemison - Wikipedia) There are quite a few accounts of child captives growing up with various tribes. I bet you there were a lot more that weren’t recorded simply because settlers didn’t have the time to record or they were illiterate or whatever or the possibility was that their parents died and didn’t inform the other authorities that their kids had been taken. ",
            "date": "Answered March 2, 2017",
            "views": "11",
            "upvotes": " View 8 Upvoters",
            "upvoters": [
                {
                    "user_id": "Will Harper",
                    "user_href": "/profile/Will-Harper-15"
                },
                {
                    "user_id": "Felix Feline",
                    "user_href": "/profile/Felix-Feline"
                },
                {
                    "user_id": "Gábor Császár",
                    "user_href": "/profile/Gábor-Császár"
                },
                {
                    "user_id": "Zénaïde Buonaparte",
                    "user_href": "/profile/Zénaïde-Buonaparte"
                },
                {
                    "user_id": "Bob Trammell",
                    "user_href": "/profile/Bob-Trammell-1"
                },
                {
                    "user_id": "Ghetonda Mosley Shertzer",
                    "user_href": "/profile/Ghetonda-Mosley-Shertzer"
                },
                {
                    "user_id": "Ashok Babu Bhandari",
                    "user_href": "/profile/Ashok-Babu-Bhandari-1"
                },
                {
                    "user_id": "Robin Bailey",
                    "user_href": "/profile/Robin-Bailey-6"
                }
            ]
        },
        {
            "author_info": {
                "name": "Traye White",
                "href": "/profile/Traye-White"
            },
            "answer_text": "Beautiful is relative, but it was surely a thriving civilization before the Pilgrims settled here. Quantifying it as beautiful or not is a way to disregard what happened here if you disagree with its value. A person can easily say, well it was a primitive culture so what they did was okay. Not saying that's what you're doing, but still. What happened was a crime by any measure of law, ethics, and morality. Native Americans welcomed settlers, shared the land, their culture and “mostly” tried to live in peace. The settlers decided they owned the land they were allowed to live on, took even more, then killed anyone who said different. If you want to really know what it was like for Native Americans read up on the Trail of Tears. Regardless of how you view Native American civilization, you can't read that and not see Andrew Jackson and everyone involved as morally reprehensible human beings. Hardened soldiers who'd fought wars are on record saying that was the thing they'd done that kept them up at night. And to put things in perspective think of it this way. The world we live in is far from perfect, but let's say aliens land from outer space. We welcome them here, try to make nice and be friendly. We give them parts of Alaska to settle on, there's nobody there and the weather doesn't bother them so it's a win win. They say okay, move there, then promptly decide they want the entire planet for themselves instead. We say hold up, this is our home, they just shrug. We try to fight back and they wipe us out. Nearly all races, all cultures, monuments, all of it gone forever. Then a hundred years or so later, they offer us a half assed apology, give us a little tract of land to live on and pretend we don't exist. Then a hundred years after THAT, some alien kid asks, was it true we killed a beautiful civilization? Then some other kid promptly says, well I don't know how beautiful it was, they were a bunch of savages intent on killing each other. You hear that, chuckle, and say, that won't happen. He's being ridiculous. Problem is, it already has. Several times throughout history in fact. This time we were the Aliens, eventually though, we'll be the savages. ",
            "date": "Answered February 28, 2017",
            "views": "14",
            "upvotes": " View 39 Upvoters",
            "upvoters": [
                {
                    "user_id": "Sam Wheeler",
                    "user_href": "/profile/Sam-Wheeler-22"
                },
                {
                    "user_id": "Crystal Williams",
                    "user_href": "/profile/Crystal-Williams-1046"
                },
                {
                    "user_id": "Will Harper",
                    "user_href": "/profile/Will-Harper-15"
                },
                {
                    "user_id": "Mark Vaughn",
                    "user_href": "/profile/Mark-Vaughn-17"
                },
                {
                    "user_id": "Kagan Hudayar",
                    "user_href": "/profile/Kagan-Hudayar-1"
                },
                {
                    "user_id": "Nabil Uddin",
                    "user_href": "/profile/Nabil-Uddin-5"
                },
                {
                    "user_id": "Ishan D",
                    "user_href": "/profile/Ishan-D-1"
                },
                {
                    "user_id": "Riley Smith",
                    "user_href": "/profile/Riley-Smith-562"
                },
                {
                    "user_id": "Sofia Natalie",
                    "user_href": "/profile/Sofia-Natalie"
                },
                {
                    "user_id": "Margarita Orlova",
                    "user_href": "/profile/Margarita-Orlova-2"
                }
            ]
        }
    ]
}