{
    "title": "What are some good storylines for novels? - Quora",
    "tags": [
        "Storyline",
        "Novels",
        "Book Recommendations"
    ],
    "response": [
        {
            "author_info": {
                "name": "Komal Bansode",
                "href": "/profile/Komal-Bansode-6"
            },
            "answer_text": "Sometimes we want to write but don’t have good ideas, I know that feeling. Instead of story-lines though, look for characters. You will automatically get your story. Observe the neighbors, friends and your family members. Pick one of them and start writing - the plot emerges. This actually works for me. The other thing you can do is use the cliche plots-the werewolf, vampire, mermaids, rich guy meets poor girl- and give them your own twist. At first, people might point out that it is cliche but they won’t do that if they see you’ve tried something different. Apart from this, you can rewrite fairy tales. Snow White, Cinderella, etc. It’s a good practice for writing. And lastly, write something from your own culture. It has a distinct taste no one can copy or take away from you. Best of luck :) ",
            "date": "Answered June 4, 2018",
            "views": "217",
            "upvotes": " View 2 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Swati Agrawal",
                    "user_href": "/profile/Swati-Agrawal-107"
                },
                {
                    "user_id": "Nafisa",
                    "user_href": "/profile/Nafisa-20"
                }
            ]
        },
        {
            "author_info": {
                "name": "Shivani Singh",
                "href": "/profile/Shivani-Singh-234"
            },
            "answer_text": "I am no one to answer this. You are one who will decide that which zoner is for you. Now if you don't know which zoner is for you, I can help you in this thing. If you are on the very beginning of being a reader, start with short stories. You will slowly get ideas that which genre you are interested in. Now if you are interested in motivational contents, go for Old Man and the Sea, Monk who sold his Ferrari, The Subtle art of not giving a F*ck e.t.c. If you like fiction, then go for twilight series, harry potter series, Divergent series and some books of Indian authors. If you like tragedy then I would personally recommend Ravinder Singh's books if you are looking for an Indian author and you can also check out Fault in our Stars. If you are looking for mythological fiction, then I personally like work of Amish such as Shiva Trilogy, The Scion of Ishvaku and Sita The Warrior of Mithila. Other genres like Horror, Non-fiction, based on science e.t.c is very vast. All you have to do is explore your self and have patience, as it is all a book needs the most. Happy Reading! :) ",
            "date": "Answered June 4, 2018",
            "views": "438",
            "upvotes": " View 5 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Akanksha Mishra",
                    "user_href": "/profile/Akanksha-Mishra-229"
                },
                {
                    "user_id": "Anubhav Dutta",
                    "user_href": "/profile/Anubhav-Dutta-24"
                },
                {
                    "user_id": "Khushi Gupta",
                    "user_href": "/profile/Khushi-Gupta-226"
                },
                {
                    "user_id": "Nafisa",
                    "user_href": "/profile/Nafisa-20"
                },
                {
                    "user_id": "Swati Agrawal",
                    "user_href": "/profile/Swati-Agrawal-107"
                }
            ]
        }
    ]
}