{
    "title": "What are less known books that critique atheism? - Quora",
    "tags": [
        "Atheism",
        "Christianity",
        "Book Recommendations"
    ],
    "response": [
        {
            "author_info": {
                "name": "Bruce Bain",
                "href": "/profile/Bruce-Bain-4"
            },
            "answer_text": "“God's Undertaker: Has Science Buried God?” by John Lennox Ph.D. (mathematics) ISBN-13: 978-0745953717  Edgar Andrews, Ph.D. physicist and engineer, Emeritus Professor of Materials at Queen Mary, University of London. Edgar Andrews has published over 100 research papers and scientific books and is the author of “Who Made God” ISBN-10: 0852347073  “The Devil's Delusion: Atheism and its Scientific Pretensions” by David Berlinski Ph.D. (mathematics) ISBN-13: 978-0465019373 ——————————————— \"Modern Physics and Ancient Faith\" by Stephen M. Barr Ph.D. (physics) ISBN-13: 978-0268034719  ———————————————- “Reasonable Faith” by William Lane Craig, Ph.D. (dual doctorate in theology and philosophy) ISBN-13: 978-1433501159 is a book not entirely well-known. —————————————————— Many people are not familiar with  the following title, but it is a compendium of logic in argument and apologetics. Another book, by J. P. Moreland, Ph.D. (philosophy) B. S. (chemistry) and William Lane Craig, Ph.D. is almost encyclopedic in size. The title is: “Philosophical Foundations for a Christian Worldview” ISBN-13: 978-0830826940 ",
            "date": "Answered July 7, 2017",
            "views": "132",
            "upvotes": " View 5 Upvoters",
            "upvoters": [
                {
                    "user_id": "Aadil Abdul-Qadir",
                    "user_href": "/profile/Aadil-Abdul-Qadir"
                },
                {
                    "user_id": "Isaac McPherson",
                    "user_href": "/profile/Isaac-McPherson"
                },
                {
                    "user_id": "Michael Kogevnikoff",
                    "user_href": "/profile/Michael-Kogevnikoff"
                },
                {
                    "user_id": "Sherif R. Fahmy",
                    "user_href": "/profile/Sherif-R-Fahmy"
                },
                {
                    "user_id": "Elizabeth Penrose",
                    "user_href": "/profile/Elizabeth-Penrose-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Michael Hickman",
                "href": "/profile/Michael-Hickman-26"
            },
            "answer_text": "E. F. Schumacher - Wikipedia, author of the better-known Small Is Beautiful - Wikipedia, a study of people and the economic system, wrote a very heady treatise on his conversion from atheism to Christianity. A Guide for the Perplexed - Wikipedia is a critique of the scientism that dominates many atheist rejections of monotheistic faiths. In his view, it is arrogance for humans to believe that our ability to see, even with technology, all things as they are. Additionally Mr. Schumacher asserts that without the wisdom of the ages atheism devolves inevitably into moral relativism. I assert that both of these main premises are true — man cannot see all, and moral relativism drives much of the ‘progressive’ movement today. Schumacher’s ultimate conclusion is that it’s more logical to believe in the existence of God than it is to deny His existence. ",
            "date": "Answered July 6, 2017",
            "views": "104",
            "upvotes": " View 6 Upvoters",
            "upvoters": [
                {
                    "user_id": "Isaac McPherson",
                    "user_href": "/profile/Isaac-McPherson"
                },
                {
                    "user_id": "Bruce Bain",
                    "user_href": "/profile/Bruce-Bain-4"
                },
                {
                    "user_id": "Sherif R. Fahmy",
                    "user_href": "/profile/Sherif-R-Fahmy"
                },
                {
                    "user_id": "Elizabeth Penrose",
                    "user_href": "/profile/Elizabeth-Penrose-1"
                },
                {
                    "user_id": "Joel Gilleland",
                    "user_href": "/profile/Joel-Gilleland"
                },
                {
                    "user_id": "Alexander Felious",
                    "user_href": "/profile/Alexander-Felious"
                }
            ]
        }
    ]
}