{
    "title": "What are some really scary stories with humorous endings? - Quora",
    "tags": [],
    "response": [
        {
            "author_info": {
                "name": "Natta Makesh",
                "href": "/profile/Natta-Makesh"
            },
            "answer_text": "Well to start with, I am an IT professional who is just back from his onsite assignment. This WTF incident happened when I was still onsite. Spooky alert ahead!! My assignment was to basically provide infrastructure management consultancy to a hospital in Charlotte. Server operations maintenance, to be exact. The server's downtime was scheduled to happen between 12:15AM to 12:25AM, to push bug fixes and patches. I happened to be one of those unlucky guys with night on call shift. The first two weeks were quite uneventful. Routine maintenance. BAU. The first incident occurred on Monday of the third week. We were dozing off in our cubicles, waiting for the patches to be installed on the server. As I said earlier, this took 15-20 minutes normally. What left us unnerved was the incident when the server shut down itself, just as it was up and running after the downtime. We were perplexed. Maybe some of the scripts in the packages had some variables that automatically forced the server to shut down. We called some of the tech assistants to shed some light on the situation. After gruelling hour, they found nothing wrong with the script. The server was restarted and it was up in a jiffy. This left us puzzled and wary, as we feared this might happen again. What really made us shit our pants was the fact that this incident kept on happening, for two weeks. Everyday. Same time. All the experts were baffled and they seriously suspected some spooky phenomenon behind this. As we were stationed in the hospital itself, we feared that a ghost might be involved. What made us think about this? Imagine yourself in a hospital, late at night. The server room is at the far and gloomy end of the hallway, next to an ICCU. Imagine walking down that path, you will several hidden eyes following you. There were incidents reported earlier of paranormal activities within the hospital. Some people saw strange figures, some felt a hand on their shoulders, some a feeling of being constantly watched upon. Get it? We were surprised when this incident stopped occurring, instantly. Life was happy again. Amongst one of my acquaintances there was kind and elderly janitor. He had been working in the hospital since its foundation and was familiar with all kinds of stuff a normal guys wouldn't come across easily. I mentioned this incident, when we were chilling out at a local pub. \"To be honest Esthevan (janitor's name), those nights were pretty fucked up. I still get chills when I go near the server room.\" I said. He nodded, in agreement. \"Well son, don't ask about it. That room surely is a nightmare.\" He said. Seeing that I was noticeably puzzled, he carried on, \"The last two weeks of the previous month were freezing hell. To earn some overtime, I had signed up for a night shift to clean up the server room. It was so cold out there. Everyday I tried turning off the air conditioning, but failed. I used to shut down every single switch but it still happened to chill out my bones.\" \"Did you just say that you turned off all the switches in the room?\". I asked, shocked. \"Yes Sir! Two weeks, every single day.\" \"What time did you come in the room?\" \"12:30 AM.\" ",
            "date": "Answered November 16, 2015",
            "views": "695",
            "upvotes": " View 7 Upvoters",
            "upvoters": [
                {
                    "user_id": "Whitley Whitehead",
                    "user_href": "/profile/Whitley-Whitehead-1"
                },
                {
                    "user_id": "Sahasra",
                    "user_href": "/profile/Sahasra-12"
                },
                {
                    "user_id": "Rajesh Panwar",
                    "user_href": "/profile/Rajesh-Panwar-3"
                },
                {
                    "user_id": "Akshay Phatak",
                    "user_href": "/profile/Akshay-Phatak-5"
                },
                {
                    "user_id": "Madhura Salvi",
                    "user_href": "/profile/Madhura-Salvi-2"
                },
                {
                    "user_id": "Vikalp Sharma",
                    "user_href": "/profile/Vikalp-Sharma"
                },
                {
                    "user_id": "Madhav Sarpal",
                    "user_href": "/profile/Madhav-Sarpal"
                }
            ]
        },
        {
            "author_info": {
                "name": "Vaibhav Lakhera",
                "href": "/profile/Vaibhav-Lakhera-1"
            },
            "answer_text": "So one night I was listening to radio using earphone. A after some time I removed earphones then suddenly I heard sound of anklets ( in India female ghosts are known to wear anklets ( bhool bhulaiya reference) ) Chan-chan …… I just Freaked out. I thought I was going die. Suddenly I noticed something it was sound a cricket ( cher-cher sound in night producing insects) who was under my bed. I was totally relived. I was so happy( read as embarrassed). I didn't tell anyone about it. ",
            "date": "Updated February 5, 2018",
            "views": "211",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Tanya Sharma",
                    "user_href": "/profile/Tanya-Sharma-81"
                },
                {
                    "user_id": "Vineet Kumar",
                    "user_href": "/profile/Vineet-Kumar-269"
                },
                {
                    "user_id": "Tarun Moolchandani",
                    "user_href": "/profile/Tarun-Moolchandani"
                }
            ]
        }
    ]
}