{
    "title": "What's the next step in a thesis if not enough data is collected for a thorough analysis and you have no time to change topics? - Quora",
    "tags": [
        "Topics",
        "Theses and Dissertations",
        "Data",
        "Data Analysis"
    ],
    "response": [
        {
            "author_info": {
                "name": "Richard Ahern",
                "href": "/profile/Richard-Ahern-2"
            },
            "answer_text": "Welcome to the real world. Frankly, aren't most thesis finalized with insufficient information? If the available information is so inadequate that there is nothing significant to say about it then either you haven't been focused on the goals of your project or the thesis needs to be reoriented to deal with the data that you have, and if the results are inconclusive, that is the way things often turn out. You may not get a degree out of it but that is on you. Report your data, draw what conclusions you can and identify the directions and objectives for future investigations. As an exploration geologist, many of my investigations fall into this category. Time is up, is a return trip justifiable or are there more interesting things to look at elsewhere? Write up what you have and put a pin in it. ",
            "date": "Answered June 22, 2017",
            "views": "571",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Nirav Prathek",
                    "user_href": "/profile/Nirav-Prathek-1"
                },
                {
                    "user_id": "Richard Karlsson",
                    "user_href": "/profile/Richard-Karlsson"
                },
                {
                    "user_id": "Varsha M",
                    "user_href": "/profile/Varsha-M-5"
                },
                {
                    "user_id": "Michael Cassidy",
                    "user_href": "/profile/Michael-Cassidy-60"
                }
            ]
        },
        {
            "author_info": {
                "name": "Thomas Taylor",
                "href": "/profile/Thomas-Taylor-34"
            },
            "answer_text": "Apologizing to your adviser for not performing a power analysis during your proposal stage. This can be followed in most cases by another data collection phase if you have the resources… or a very awkwardly written conclusion. Mostly it depends on your project/school. ",
            "date": "Answered June 22, 2017",
            "views": "487",
            "upvotes": "0"
        }
    ]
}