{
    "title": "What are some of the best lines from a novel? - Books that influenced You - Quora",
    "tags": [
        "Novels",
        "Literature"
    ],
    "response": [
        {
            "author_info": {
                "name": "Rebecca Reji",
                "href": "/profile/Rebecca-Reji-3"
            },
            "answer_text": "These are the few quotes which I liked: Allegiant by Veronica Roth Every question that can be answered must be answered must be answered or at least engaged. Illogical thought processes must be challenged when they arise. Wrong answers must be corrected. Correct answers must be affirmed. - From the Erudite Faction ManifestoKnowledge is Power. Power to do evil or power to do good. Power itself is not evil. So Knowledge itself is not evil.But that wasn’t the first time I ever saw her. I saw her in the hallways at school, and at my mother’s false funeral, and walking the sidewalks in the Abnegation sector. I saw her, but I didn’t see her; no one saw her the way she truly was until she jumped.I suppose a fire that burns that bright is not meant to last.I fell in love with him. But I don't just stay with him by default as if there's no one else available to me. I stay with him because I choose to, every day that I wake up, every day that we fight or lie to each other or disappoint each other. I choose him over and over again, and he chooses me.I think you're still the only person sharp enough to sharpen someone like me.To Kill a Mockingbird by Harper Lee You never really understand a person until you consider things from his point of view, until you climb into his skin and walk around in it.Shoot all the bluejays you want, if you can hit ’em but remember it’s a sin to kill a mockingbird.Pride and Prejudice by Jane Austen It is a truth universally acknowledged, that a single man in possession of a good fortune, must be in want of a wife.Angry people are not always wise.Vanity and pride are different things, though the words are often used synonymously. A person may be proud without being vain. Pride relates more to our opinion of ourselves, vanity to what we would have others think of us.I must learn to be content with being happier than I deserve.The Ask And The Answer by Patrick Ness We are the choices we make, nothing more, nothing less.Sometimes the rumour of an army is just as effective as the army itself.War makes monsters of men.A thing worth learning is worth learning well.If you ever want to see how small you are in the plan of god, just stand at the edge of an ocean.You have to crawl before you walk.",
            "date": "July 19, 2020",
            "views": "788",
            "upvotes": " View 11 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Chinkhanmuan Samte",
                    "user_href": "/profile/Chinkhanmuan-Samte"
                },
                {
                    "user_id": "Srinivas J",
                    "user_href": "/profile/Srinivas-J-39"
                },
                {
                    "user_id": "Sena Diaz",
                    "user_href": "/profile/Sena-Diaz-3"
                },
                {
                    "user_id": "Andi Sat",
                    "user_href": "/profile/Andi-Sat"
                },
                {
                    "user_id": "Amjad O Abdallah",
                    "user_href": "/profile/Amjad-O-Abdallah"
                },
                {
                    "user_id": "Hannah Mathew",
                    "user_href": "/profile/Hannah-Mathew-47"
                },
                {
                    "user_id": "Samikshya Thapa",
                    "user_href": "/profile/Samikshya-Thapa"
                },
                {
                    "user_id": "Kanak Ranjan",
                    "user_href": "/profile/Kanak-Ranjan-2"
                },
                {
                    "user_id": "Loukik Kulkarni",
                    "user_href": "/profile/Loukik-Kulkarni"
                },
                {
                    "user_id": "Silka Jayapadme",
                    "user_href": "/profile/Silka-Jayapadme-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Himaja B",
                "href": "/profile/Himaja-B-4"
            },
            "answer_text": "\"I believe the nicest and sweetest days are not those on which anything very splendid or wonderful or exciting happens but just those that bring simple little pleasures, following one another softly, like pearls slipping off a string.” ― L.M. Montgomery (Anne of Avonlea) “Why must people kneel down to pray? If I really wanted to pray I’ll tell you what I'd do. I'd go out into a great big field all alone or in the deep, deep woods and I'd look up into the sky—up—up—up—into that lovely blue sky that looks as if there was no end to its blueness. And then I'd just feel a prayer.” ― L.M. Montgomery (Anne of Green Gables) There is a stubbornness about me that never can bear to be frightened at the will of others. My courage always rises at every attempt to intimidate me.” ― Jane Austen (Pride and Prejudice) It had to do with how it felt to be in the wild. With what it was like to walk for miles with no reason other than to witness the accumulation of trees and meadows, mountains and deserts, streams and rocks, rivers and grasses, sunrises and sunsets. The experience was powerful and fundamental. It seemed to me that it had always felt like this to be a human in the wild, and as long as the wild existed it would always feel this way.” ― Cheryl Strayed (Wild: From Lost to Found on the Pacific Crest Trail) ",
            "date": "October 25, 2020",
            "views": "12",
            "upvotes": " View 7 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Sonal Sareen",
                    "user_href": "/profile/Sonal-Sareen-5"
                },
                {
                    "user_id": "Vrinda Goan",
                    "user_href": "/profile/Vrinda-Goan"
                },
                {
                    "user_id": "Qudsiya Fatima",
                    "user_href": "/profile/Qudsiya-Fatima-3"
                },
                {
                    "user_id": "Aaditya Sharma",
                    "user_href": "/profile/Aaditya-Sharma-30"
                },
                {
                    "user_id": "Shalini Singh",
                    "user_href": "/profile/Shalini-Singh-438"
                },
                {
                    "user_id": "Silka Jayapadme",
                    "user_href": "/profile/Silka-Jayapadme-1"
                },
                {
                    "user_id": "Ashish Gaude",
                    "user_href": "/profile/Ashish-Gaude-4"
                }
            ]
        },
        {
            "author_info": {
                "name": "Sweta Vijayan",
                "href": "/profile/Sweta-Vijayan"
            },
            "answer_text": "Let me share this heart-touching book named A Thousand Splendid Suns, a 2007 novel by Afghan-American author Khaled Hosseini. The story covers three decades of anti-Soviet jihad, civil war and Taliban tyranny seen from the perspectives of two women, named Mariam and Laila. Mariam is the scorned illegitimate daughter of a wealthy businessman, forced at age 15 into marrying Rasheed, who grows increasingly brutal when she fails to produce a child. 18 years later, Rasheed takes another wife, 14-year-old Laila. They live in a world of old-time values and refuse to accept the need for women to have an identity beyond what can be seen under a burqa. Mariam and Laila become allies in a battle with Rasheed, whose violent abuse is endorsed by custom and law. Rasheed is murdered by Mariam, the Taliban drives out the Mujahideen, and the United States drives the Taliban out of power. The author gives a forceful portrait of despotism where women are dependent on fathers, husbands and especially sons, the bearing of male children being their only path to an accepted social status. The following are some of my favourite quotes from this book: ‘“You see, some things I can teach you. Some you learn from books. But there are things that, well, you have to see and feel.”“Learn this now and learn it well. Like a compass facing north, a man’s accusing finger always finds a woman. Always. You remember that, Mariam.”“And the past held only this wisdom: that love was a damaging mistake, and its accomplice, hope, a treacherous illusion. And whenever those twin poisonous flowers began to sprout in the parched land of that field, Mariam uprooted them. She uprooted them and ditched them before they took hold.”“Boys, Laila came to see, treated friendship the way they treated the sun: its existence undisputed; its radiance best enjoyed, not beheld directly.”“One could not count the moons that shimmer on her roofs,Or the thousand splendid suns that hide behind her walls.”“Of all the hardships a person had to face, none was more punishing than the simple act of waiting.”“A man's heart is a wretched, wretched thing. It isn't like a mother's womb. It won't bleed. It won't stretch to make room for you.”“Marriage can wait, education cannot.”“Tell your secret to the wind, but don’t blame it for telling the trees.”“But the game involves only male names. Because, if it's a girl, Laila has already named her.” You can find this book at free of cost or at a cheap price (includes only the shipping charges) at MyPustak: an online website that sells good-conditioned second-hand books. ",
            "date": "October 19, 2020",
            "views": "23",
            "upvotes": " View 22 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Jaya Awasthi",
                    "user_href": "/profile/Jaya-Awasthi-21"
                },
                {
                    "user_id": "Pradeep Kumar",
                    "user_href": "/profile/Pradeep-Kumar-3761"
                },
                {
                    "user_id": "Roma Nayak",
                    "user_href": "/profile/Roma-Nayak"
                },
                {
                    "user_id": "Gopal Payra",
                    "user_href": "/profile/Gopal-Payra-1"
                },
                {
                    "user_id": "Anjali Agrawal",
                    "user_href": "/profile/Anjali-Agrawal-219"
                },
                {
                    "user_id": "Panthagani Armstrong",
                    "user_href": "/profile/Panthagani-Armstrong"
                },
                {
                    "user_id": "Dhruv Sapariya",
                    "user_href": "/profile/Dhruv-Sapariya"
                },
                {
                    "user_id": "Visakh Vijayan",
                    "user_href": "/profile/Visakh-Vijayan-7"
                },
                {
                    "user_id": "Qudsiya Fatima",
                    "user_href": "/profile/Qudsiya-Fatima-3"
                },
                {
                    "user_id": "Afeera Ahmad",
                    "user_href": "/profile/Afeera-Ahmad"
                }
            ]
        }
    ]
}