{
    "title": "What is your review of Article furniture? - Quora",
    "tags": [
        "Article (furniture) ",
        "Furniture",
        " Reviews"
    ],
    "response": [
        {
            "author_info": {
                "name": "Sara C",
                "href": "/profile/Sara-C-17"
            },
            "answer_text": "Had you asked me 6 months ago, I would have said my Sven Charme sofa from Article was the best purchase I had made in years. It’s a beautiful, comfortable, well made couch and the price point is incredibly reasonable. However, the leather on one of the back cushions appears to be defective. When cleaned with high quality conditioner this one cushion (and only this cushion- the rest of the couch was fine) developed ugly striations that never faded, I ignored it for awhile, thinking it would fade in time. It didn’t. This isn’t the natural variation in leather, either- I don’t mind spots or scuffs or anything that occurs naturally over time to full grain aniline leather and adds to its character. This was eye-catching discoloration that made this one cushion look like it didn’t even go with the couch. I finally decided to reach out to Article about a replacement, because I was still within the one year warranty window. To their credit, Article customer service responded to my email very quickly, requesting details and photos, which I then provided. They asked what conditioner I had used and I told them Effax Lederbalsam. This was their reply: “Hello again, Thanks for all that detailed info-- Unfortunately, since Article does not recommend the use of that exact product, we cannot determine for sure that the discoloration is indeed due to a defect - we just have no idea how a particular patch of leather will respond. The only products that we recommend for our leather sofas are Otter Wax products (the leather oil in particular) - you can find them here. As I mentioned, the cost of a back cushion cover for the Sven in charme tan is $140, plus shipping. If you'd like to order a new one please let me know and I'll put the order in. I'm really sorry that this has happened to your cushion, but I hope you understand that as per company policy, we aren't able to send a complimentary replacement for your cushion. Please let me know how you'd like to proceed, and I'll be happy to help. DenisCustomer Care” What “company policy”, Denis? You better believe if I knew about a company policy whereby use of any other leather cleaning product would void my warranty, I would have purchased some freaking Otter Wax. Nowhere do they say that they recommend ONLY Otter Wax, only that they recommend a conditioner “like” Otter Wax. I am disappointed that Article didn’t live up to its reputation for stellar customer service. So, in sum, as much as I love my Sven Couch minus the defect cushion- I would shop around before buying from Article. The low price point might not be worth the risk of having a potentially defective couch whose warranty they decide not to honor. ",
            "date": "Answered January 24, 2018",
            "views": "258",
            "upvotes": " View 16 Upvoters",
            "upvoters": [
                {
                    "user_id": "Henrys YouTube",
                    "user_href": "/profile/Henrys-YouTube"
                },
                {
                    "user_id": "Marilyn Jensen",
                    "user_href": "/profile/Marilyn-Jensen-3"
                },
                {
                    "user_id": "Tiffany Smith",
                    "user_href": "/profile/Tiffany-Smith-57"
                },
                {
                    "user_id": "Andrew Cho",
                    "user_href": "/profile/Andrew-Cho-7"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/Meg-B-122"
                },
                {
                    "user_id": "Elaine Bogart",
                    "user_href": "/profile/Elaine-Bogart"
                },
                {
                    "user_id": "Lisa Darville",
                    "user_href": "/profile/Lisa-Darville-1"
                },
                {
                    "user_id": "Jae Youn Lee",
                    "user_href": "/profile/Jae-Youn-Lee-2"
                },
                {
                    "user_id": "Tchao Thao",
                    "user_href": "/profile/Tchao-Thao"
                },
                {
                    "user_id": "Nicole Diaz",
                    "user_href": "/profile/Nicole-Diaz"
                }
            ]
        },
        {
            "author_info": {
                "name": "Meadow Gobert",
                "href": "/profile/Meadow-Gobert"
            },
            "answer_text": "I was looking for a large, statement leather sofa for a newly renovated living room. I searched the internet and various box stores, but so many were either too traditional or too expensive, or too boring!... I happened upon Article in one of my searches, probably through Pinterest or in my Facebook feed. What I love about the site is how easy it is to navigate and the photos of all the modern products. Plenty of choices, yet not overwhelming. I instantly locked into the SVEN sofa. I took some time to chat with the online customer service about the quality and wear of the various leather….that person offered to send me swatches on their own! My husband wanted a dark leather, and I thought I wanted tan. BUT,when the swatches came I absolutely fell in LOVE with the navy. My designer encouraged me to take that risk with a non-traditional color, and I'm so glad I bought it. Gorgeous! I did read many reviews of this specific sofa, but it seems as though those customers didn't ask the right questions or understand how leather “lives”…..at any rate, I tend to read negative reviews to see where people are coming from. I have been very impressed with the customer service online and in person. The delivery was great and on time. The delivery guys even protected my new wood floors from carrying the giant box inside. This was a major purchase for us, so the idea of buying a sofa online felt super risky. The people I encountered at Article NEVER made me feel like I couldn't change my mind, change items, or return an unhappy purchase. Of course I have told many friends looking for modern items to check out Article….I want them to do well. Why should I care?….I have spent the last 26 years in a customer service industry as a self-employed hairdresser. I support any individual or small business that offers quality AND service at reasonable cost. Thank you Article and your great people. I love my SVEN sofa! ",
            "date": "Answered February 27, 2019",
            "views": "92",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Thomas Yang",
                    "user_href": "/profile/Thomas-Yang-52"
                },
                {
                    "user_id": "Julia Nash",
                    "user_href": "/profile/Julia-Nash-26"
                },
                {
                    "user_id": "Mary Stitt",
                    "user_href": "/profile/Mary-Stitt-4"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/Meg-B-122"
                }
            ]
        }
    ]
}