{
    "title": "What are some examples of literary canons? - Quora",
    "tags": [
        "Literary Devices and Techniques",
        "Literary Analysis and Criticism",
        "Literary Fiction"
    ],
    "response": [
        {
            "author_info": {
                "name": "Alex Coffman",
                "href": "/profile/Alex-Coffman-4"
            },
            "answer_text": "Oh man this is a tricky question. Literary canons overlap, intersect, contain other canons as a subset, and, most importantly, they change over time. There is no single group that decides what literary texts constitute a canon. Instead, canon is basically determined by vague, contentious agreement. Perhaps the most famous, widely taught, and hotly contested, canon is the canon of World Literature. Historically, World Literature referred to texts from Western Europe, but has since expanded to include a broader range of texts. [1] Therefore, it is possible to consider Postcolonial literature as a subset of the World Literature canon. However, I’d recommend that one evaluates Postcolonial literature on its own merits, rather than considering it as a continuation of a “World Literature” tradition, since Postcolonial literature often criticizes Western ideology. Canons are great when you’re talking about a general movement of literature, but once you start trying to cram texts into them, you will always run into problems. However, in order to answer your question, I’ll give you an example. The Wikipedia entry on Southern United States literature, defines that genre as: “American literature about the Southern United States or by writers from this region. Characteristics of Southern literature include a focus on a common Southern history, the significance of family, a sense of community and one’s role within it, a sense of justice, the region's dominant religion (Christianity — see Protestantism) and the burdens/rewards religion often brings, issues of racial tension, land and the promise it brings, a sense of social class and place, and the use of the Southern dialect.”[2] If you look at the history of the genre, you’ll see that there’s antebellum literature, “Lost Cause” literature, and modernist/post-war Southern literature. The problem is, at least one of the texts listed on that page will undoubtedly defy the definition of the article, and then you’ll find yourself in an argument over what is — or isn’t — canon Footnotes[1] World literature - Wikipedia[2] Southern United States literature - Wikipedia",
            "date": "Answered June 15, 2017",
            "views": "22",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Jon Johnson",
                    "user_href": "/profile/Jon-Johnson-90"
                }
            ]
        },
        {
            "author_info": {
                "name": "Omolola Odunowo",
                "href": "/profile/Omolola-Odunowo"
            },
            "answer_text": "Literary canons are more like collection of works measured by others on the basis of literary skill and value. The western canon was revolted in the 80’s by a group of people who claimed women had been excluded from its collection. These group of people advocated for the fact that several other authors, poets and playwrights whose works of literature were good enough had also been excluded from the western canon. Over the years the western canon has been revisited with various qualified authors, poets and playwrights given their place in the western canon. I will just give two examples of re-known canon’s we have Shakespeare and Homer who wrote the odyssey. You can search out the rest. Cheers ",
            "date": "Answered June 16, 2017",
            "views": "28",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Priya Bajaj",
                    "user_href": "/profile/Priya-Bajaj-41"
                },
                {
                    "user_id": "Callum Sutherland",
                    "user_href": "/profile/Callum-Sutherland-3"
                },
                {
                    "user_id": "Aleena Afzal",
                    "user_href": "/profile/Aleena-Afzal"
                }
            ]
        }
    ]
}