{
    "title": "What’s better, cross-pens or mont blanc pens? - Quora",
    "tags": [
        "Cross Pens",
        "Fountain Pens",
        "Ink"
    ],
    "response": [
        {
            "author_info": {
                "name": "Aeon Invictus",
                "href": "/profile/Aeon-Invictus"
            },
            "answer_text": "If we were talking about the best value for your money then Cross would win. If we are just comparing their standard production lines side by side I would have to say Montblanc. Montblanc has things like piston fillers and retractable nibs that Cross just doesn’t. Montblanc also makes #9 nibs (the big ones) while Cross is stuck with smaller nibs. Montblanc also makes nibs out of things like solid rose gold and tunes every nib out of the factory. Montblanc also has the brand name and logo attached to it, this matters to some people. with Montblanc, you buy an experience, you can go into a Montblanc store (which is rare in the world of high-end pens) to buy them. They also have mostly good customer service. I could go on and on. But… You have to pay, a LOT. A $950 149 costs less than $200 to make. But… Montblancs have a higher resale value than Cross pens in general. Then again none of this matters because they two are completely different approaches to pen making that shouldn’t be compared. ",
            "date": "Answered December 17, 2018",
            "views": "21",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Paul Cooper",
                    "user_href": "/profile/Paul-Cooper-460"
                }
            ]
        },
        {
            "author_info": {
                "name": "Mark West",
                "href": "/profile/Mark-West-3"
            },
            "answer_text": "There is substantial reason to believe Peter Bock AG makes the Mont Blanc nibs. The Cross nibs are probably made by Bock as well. Almost all nibs, except for Sailor and Platinum, are made by either Bock or JoWo. I have repaired a number of Mont Blanc pens, and have found the plastic quite cheap and fragile, and personally believe that they are astronomically priced and quite a bad bargain. Since I invariably work on the nibs, I would vote for a Cross pen any day. But if I were buying a new pen, I would get a Sailor, without question. The fit and finish is miles beyond either the Mont Blanc or the Cross, and the nibs are miles beyond. For info on who makes what nibs, read this: Who Make Their Own Nibs - Of Nibs & Tines ",
            "date": "Answered September 9, 2018",
            "views": "16",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Paul Cooper",
                    "user_href": "/profile/Paul-Cooper-460"
                }
            ]
        }
    ]
}