{
    "title": "What are some good starting lines for a poem? - Quora",
    "tags": [
        "Writing Poetry",
        "Poems",
        "Poetry",
        "Creative Writing"
    ],
    "response": [
        {
            "author_info": {
                "name": "Tom Robinson",
                "href": "/profile/Tom-Robinson-110"
            },
            "answer_text": "Beyond something cliche like “roses are red, violets are blue” there aren't ones. Poetry has to catch the reader’s attention, and it won't do that with clichés. I can give you a few favorites, though, as examples of how to do it well. (All are from memory so I apologize for any inaccuracies.) Let us go, then, you and I When the evening is spread out against the sky Like a patient etherized upon a table. -T.S. Eliot, The Love Song of J Alfred Prufrock Comrades, leave me here a little while, as yet, ’tis early morn Leave me here and, when you want me, sound upon the bugle horn ’Tis the place and, all around it, as of old the curlews call Dreary gleams about the moorland flying over Locksley Hall. -Alfred, Lord Tennyson, Locksley Hall Nel mezzo del cammin di nostra vita mi ritrovai per una selva oscura ché la diritta via era smarrita. -Dante Alighieri, The Divine Comedy/Inferno The sun was shining on the sea, shining with all its might It did its very best to keep the billows smooth and bright And this was odd because it was the middle of the night -Lewis Carroll, The Walrus and the Carpenter ’Twas brilig, and the slithy toves did gyre and gimble in the wabe. -Lewis Carroll, Jabberwocky The world was young, the mountains green No stain yet on the moon was seen No words yet lay on stream or stone When Durin woke, and walked alone -JRR Tolkien, The Song of Durin There are strange things done in the midnight sun by the men who moil for gold The arctic trails have their secret tales that would make your blood run cold The northern lights have seen queer sights, but the queerest they ever did see Was that night on the marge of Lake LeBarge, I cremated Sam McGee. -Robert Service,The Cremation of Same McGee My mistress’ eyes are nothing like the sun -William Shakespeare, Sonnet It looked extremely rocky for the Mudville Nine that day The score stood four to two with but one inning more to play And so when Cooney died at first, and Boroughs did the same A sickly silence fell upon the patrons of the game. -Ernest Thayer, Casey at the Bat If you wake at midnight and hear a horses feet, Don’t go drawing back the blinds or looking in the street. Them that ask no questions isn't told a lie. Watch the wall, my darling, while the gentlemen go by. -Rudyard Kipling, The Smugglers’ Song. The wind was a torrent of darkness among the gusty trees The moon was a ghostly galleon cast upon cloudy seas The road was a ribbon of moonlight over the purple moor And the Highwayman came riding, riding, riding the Highwayman came riding up to the old Inn door -Alfred Noble, The Highwayman (you convinced me, Gigi.) Stop all the clocks, cut off the telephone Prevent the dog from barking with a juicy bone Silence the pianos, and with muffled drum Bring out the coffin, let the mourners come. -W.H. Auden, Funeral Blues When I play on my fiddle in Dooney Folks dance like a wave of the sea -W.B. Yeats, The Fiddler of Dooney Did I ever tell you how Mrs McCave Had twenty three sons and she named them all Dave? -Dr Seuss, Too Many Daves Those are just off the top of my head. As you can see, some catch your interest by beginning a story. Some catch the interest with an unexpected simile or reversal of cliche, like Shakespeare’s “My mistress’ eyes are nothing like the sun,” a personal favorite of mine. I tried to pick opening lines that display a wide range of different ways to catch the reader’s interest and I think all of the above do so very effectively. I highly recommend reading all of the above poems in their entirety, especially as most are very short, except Dante, who is nonetheless about as great a read as you could hope for. Happy writing! ",
            "date": "Updated January 4, 2017",
            "views": "54",
            "upvotes": " View 24 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Jakub Čačo",
                    "user_href": "/profile/Jakub-Čačo"
                },
                {
                    "user_id": "Mason Hicks",
                    "user_href": "/profile/Mason-Hicks-20"
                },
                {
                    "user_id": "Angelina Audley",
                    "user_href": "/profile/Angelina-Audley"
                },
                {
                    "user_id": "Nathan Ketsdever",
                    "user_href": "/profile/Nathan-Ketsdever"
                },
                {
                    "user_id": "Jackie Moffitt",
                    "user_href": "/profile/Jackie-Moffitt"
                },
                {
                    "user_id": "Manissha PR",
                    "user_href": "/profile/Manissha-PR"
                },
                {
                    "user_id": "Arjaita",
                    "user_href": "/profile/Arjaita-1"
                },
                {
                    "user_id": "Gregory Miner Gustafson",
                    "user_href": "/profile/Gregory-Miner-Gustafson"
                },
                {
                    "user_id": "Saumya Pandey",
                    "user_href": "/profile/Saumya-Pandey-261"
                },
                {
                    "user_id": "Hope Hillel",
                    "user_href": "/profile/Hope-Hillel"
                }
            ]
        },
        {
            "author_info": {
                "name": "Sharmeka Victoria Hunter",
                "href": "/profile/Sharmeka-Victoria-Hunter"
            },
            "answer_text": "I will try to answer this question as good as I can, but I can’t give away any imagery. I have listed various ways you can start a poem Start with dialogue (something simple but layered someone has said)Start with the act of someone doing something (at the end of something)Start with a sense like the sense of sound and see how many sound images you can list to create a poem.Start with a line that describe the most moving image you see in a painting, particularly an image in a painting you can’t stop thinking of or that seems out of place or other people may not have noticed.Write a poem that fits the story of a song, but of course let it begin at the end resolve.I have a video on how to start a poem here  ",
            "date": "Answered July 13, 2018",
            "views": "15",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Jeff Kinney",
                    "user_href": "/profile/Jeff-Kinney-7"
                }
            ]
        }
    ]
}