{
    "title": "What's a good example of a false premise that everyone can relate to? - Quora",
    "tags": [
        "Logical Fallacies",
        "Reasoning",
        "Logical Reasoning",
        "Science and Religion",
        "Logic (philosophy)",
        "Philosophy of Religion",
        "Religion"
    ],
    "response": [
        {
            "author_info": {
                "name": "Nick Lilavois",
                "href": "/profile/Nick-Lilavois-1"
            },
            "answer_text": "What's a good example of a false premise that everyone can relate to? America is the greatest nation that ever existed! The poor are poor because they are lazy. Anyone can pull themselves up by their bootstraps and become rich. Government programs never work. There are no sick people dying in their apartments. The poor do not need health care, they can go to the emergency room. There is no such thing as white privilege. The races have had equality since the 1960’s. There is no such thing as male privilege. The sexes have had equality since the 1960’s. LGBT people want special rights. Taxation is theft. When the rich have more money, it trickles down to everybody. Donald Trump is a stable genius. He is not mentally ill, he is not a racist, and he is a very successful self-made businessman. Oh, and all the women love him so he can’t rape the willing. He made the economy great after Barry Husain Obama’s dismal failures. … pretty much the basis of every modern conservative argument is a false premise. Now, to religion- The Earth is perfect for human habitation, showing that it was designed for us. The human eye is irreducibly complex. Jesus’ resurrection was witnessed by hundreds of people. The universe is proof of God’s existence. If you cannot prove that God does not exist, then he must exist! The Bible is the word of God, thus infallible. Since the infallible Bible says God exists, God must exist. Homosexuality is a far worse sin than adultery, divorce, or premarital sex. ",
            "date": "Answered September 20, 2019",
            "views": "23",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/Nick-4120"
                },
                {
                    "user_id": "Giovanni Rico",
                    "user_href": "/profile/Giovanni-Rico-5"
                },
                {
                    "user_id": "Manu Senan",
                    "user_href": "/profile/Manu-Senan-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Andrew Bauserman",
                "href": "/profile/Andrew-Bauserman"
            },
            "answer_text": "The classic example (for instance here: False premise - Wikipedia) is this: If the streets are wet, it has rained recently. (premise)The streets are wet. (premise)Therefore it has rained recently. (conclusion)The frustrating thing about debating anything after the false premise is that every argument beyond the premise may be logically consistent. The conclusion might even be true in specific cases. But a premise must always be true to build further logical arguments upon it. The trouble occurs when the starting point is not true (or is only sometimes or partially true), when the cause and effect are reversed (as the example above), or when the relationship is a correlation – per the old mantra, “correlation is not causation.” In the example above, the street will be wet if it has rained. But they can also get wet in other ways – for instance if a nearby sprinkler is mis-aimed, etc. In a case where a premise can easily be shown false (that is, not always true) it can be labeled as such. But not every unproven premise is necessarily false. For instance, science is built on several such premises (assumptions). They are falsifiable – meaning we might one day discover an example that contradicts the assumption, and would need to adjust our understanding accordingly. Some examples include: the measurable/observable universe is governed by a set of rulesthis set of rules is universal – the same throughout the universehumans can figure out and comprehend these rulesevery measurable/observable effect has a measurable/observable causeWhile it is possible, even likely, that these are all true – we have not yet observed every locale in the universe, for instance, to “prove” the second statement is true. But in the case of science, care is given to craft such assumptions in a manner that can be tested – thus it is falsifiable. To bring that back around to the false premise – answer these questions when you’re wondering if you are dealing with a false premise… What is the starting point for the argument in question? Is there ever a case where it is not true (that makes it easy)? If not… Could it be a correlation vs causation? Could the cause and effect be reversed? Is the premise constructed to be falsifiable? These latter don’t prove it false, but are warning signs for a variety of possible logical flaws. ",
            "date": "Updated April 10, 2018",
            "views": "59",
            "upvotes": " View 9 Upvoters",
            "upvoters": [
                {
                    "user_id": "Jan Fargo",
                    "user_href": "/profile/Jan-Fargo-1"
                },
                {
                    "user_id": "Jacob Ningen",
                    "user_href": "/profile/Jacob-Ningen-1"
                },
                {
                    "user_id": "Linda Lomberg",
                    "user_href": "/profile/Linda-Lomberg"
                },
                {
                    "user_id": "Aaron Pollard",
                    "user_href": "/profile/Aaron-Pollard-12"
                },
                {
                    "user_id": "Charles Edwards",
                    "user_href": "/profile/Charles-Edwards-18"
                },
                {
                    "user_id": "Simon Mohapi",
                    "user_href": "/profile/Simon-Mohapi-3"
                },
                {
                    "user_id": "Nathan Luk",
                    "user_href": "/profile/Nathan-Luk-1"
                },
                {
                    "user_id": "Gioele Vaglica",
                    "user_href": "/profile/Gioele-Vaglica"
                },
                {
                    "user_id": "Dorion Taylor",
                    "user_href": "/profile/Dorion-Taylor-2"
                }
            ]
        }
    ]
}