{
    "title": "What advice on writing did Ernest Hemingway give? - Quora",
    "tags": [
        "Ernest Hemingway (author)",
        "Literature of the United States of America",
        "Creative Writing",
        "Advice",
        "Writers and Authors",
        "Literature",
        "Writing Advice"
    ],
    "response": [
        {
            "author_info": {
                "name": "Mikey Shaughnessy",
                "href": "/profile/Mikey-Shaughnessy"
            },
            "answer_text": "\"No good book has ever been written that has in it symbols arrived at beforehand and stuck in...That kind of symbol sticks out like raisins in raisin bread. Raisin bread is all right, but plain bread is better....I tried to make a real old man, a real boy, a real sea, a real fish and real sharks. But if I made them good and true enough they would mean many things. The hardest thing is to make something really true and sometimes truer than true.\" This quote was taken after he was awarded the Nobel Prize for The Old Man and The Sea. To live; to write. Not to live to write. More than anything else, I think it was the way Hemingway lived that inspired so many writers. He lived honestly and in the moment. His thirst for life was unquenchable on many accounts. What we know about Hemingway is his love of Spain, drinking, bull fights, fishing and boxing. They are all but the stories we have of him. They litter his works. He lived. He wrote. He wrote these stories in short, terse sentences. Perhaps he thought it was important to be readable and relatable to all. Literature in the opposite sense can be so daunting for people: “Poor Faulkner. Does he really think big emotions come from big words? He thinks I don’t know the ten-dollar words. I know them all right. But there are older and simpler and better words, and those are the ones I use.” — Hemingway quoted in Papa Hemingway: A Personal Memoir by A. E. Hotchner, 1966 Perhaps it’s because when you write short sentences with simple, correct words, all that can come from them is truth. Truth above all.  I think his one big takeaway is to always write what’s true. To “bleed onto the page” is to put yourself into your work. Then by putting something authentic and real and good out into the world, a writer has done all they can. So what does it mean to write something true? What does it mean (as mentioned in the first quote) to write something truer than true? For Hemingway it meant to live. Breathe deep and eat well. Sleep when it’s time to sleep and drink wine when it’s time to drink wine. And when it’s time to write, write. ",
            "date": "Answered April 10, 2019",
            "views": "12",
            "upvotes": " View 27 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Norman Leach",
                    "user_href": "/profile/Norman-Leach-1"
                },
                {
                    "user_id": "L. R. Asheq",
                    "user_href": "/profile/L-R-Asheq"
                },
                {
                    "user_id": "Pramodya Thilakarathna",
                    "user_href": "/profile/Pramodya-Thilakarathna"
                },
                {
                    "user_id": "Pranitha",
                    "user_href": "/profile/Pranitha-46"
                },
                {
                    "user_id": "Venky Jason",
                    "user_href": "/profile/Venky-Jason"
                },
                {
                    "user_id": "Laird Sutherland",
                    "user_href": "/profile/Laird-Sutherland"
                },
                {
                    "user_id": "Sean Pruitt",
                    "user_href": "/profile/Sean-Pruitt-7"
                },
                {
                    "user_id": "Mandy Wessen",
                    "user_href": "/profile/Mandy-Wessen"
                },
                {
                    "user_id": "Philippe de Tiege",
                    "user_href": "/profile/Philippe-de-Tiege"
                },
                {
                    "user_id": "William Harold Hinkson II",
                    "user_href": "/profile/William-Harold-Hinkson-II"
                }
            ]
        },
        {
            "author_info": {
                "name": "Sam Cox",
                "href": "/profile/Sam-Cox-84"
            },
            "answer_text": "Paul Dracon, I’ve tried to locate a quote I read somewhere but cannot, so extra grain of salt, it said that Hemingway chose his words very carefully, sometimes contemplating for days to find the perfect word. Whether an actual quote or not, I found the notion fascinating. So Much so I have bought three copies of Roget’s Thesaurus. It’s not just cold, its frigid, bone chilling, freezing, brisk, stinging, Siberian, polar, sharp raw, cutting, mother-in-law cold. Sam Cox comedygym@austin.rr.com ",
            "date": "Answered April 9, 2019",
            "views": "60",
            "upvotes": " Answer requested by Paul Dracon"
        }
    ]
}