{
    "title": "What are 1 to 14 lines in a poem called? - Quora",
    "tags": [
        "Poems",
        "Poetry"
    ],
    "response": [
        {
            "author_info": {
                "name": "Seddik Jelouane",
                "href": "/profile/Seddik-Jelouane"
            },
            "answer_text": "A sonnet ! Sonnets are poems which were written in 14 lines rhyming in (abab/ cdcd/ efef/ gg), and that’s what Shakespeare is familiar by. 1 ex: Sonnet 130: My mistress' eyes are nothing like the sun My mistress' eyes are nothing like the sun; Coral is far more red than her lips' red; If snow be white, why then her breasts are dun; If hairs be wires, black wires grow on her head. I have seen roses damasked, red and white, But no such roses see I in her cheeks; And in some perfumes is there more delight Than in the breath that from my mistress reeks. I love to hear her speak, yet well I know That music hath a far more pleasing sound; I grant I never saw a goddess go; My mistress, when she walks, treads on the ground. And yet, by heaven, I think my love as rare As any she belied with false compare. 2/ ex: Sonnet 18: Shall I compare thee to a summer’s day? Shall I compare thee to a summer’s day? Thou art more lovely and more temperate: Rough winds do shake the darling buds of May, And summer’s lease hath all too short a date; Sometime too hot the eye of heaven shines, And often is his gold complexion dimm'd; And every fair from fair sometime declines, By chance or nature’s changing course untrimm'd; But thy eternal summer shall not fade, Nor lose possession of that fair thou ow’st; Nor shall death brag thou wander’st in his shade, When in eternal lines to time thou grow’st: So long as men can breathe or eyes can see, So long lives this, and this gives life to thee. (hope that helps)! ",
            "date": "Answered January 16, 2019",
            "views": "152",
            "upvotes": " View 5 Upvoters",
            "upvoters": [
                {
                    "user_id": "Gifty Sabeh",
                    "user_href": "/profile/Gifty-Sabeh"
                },
                {
                    "user_id": "Annaz Malaiz",
                    "user_href": "/profile/Annaz-Malaiz"
                },
                {
                    "user_id": "Abraham Tetteh",
                    "user_href": "/profile/Abraham-Tetteh-6"
                },
                {
                    "user_id": "PSmita PSmita",
                    "user_href": "/profile/PSmita-PSmita"
                },
                {
                    "user_id": "Kenneth Vanderwall",
                    "user_href": "/profile/Kenneth-Vanderwall"
                }
            ]
        },
        {
            "author_info": {
                "name": "Suzanne Kiera Anthony",
                "href": "/profile/Suzanne-Kiera-Anthony"
            },
            "answer_text": "A one line poem is a monostich; two lines is a couplet; three lines is a tercet or triplet; four lines is a quatrain; fives lines is a quintain; six lines is a hexastich; seven lines is a heptastich; eight lines is an octave; nine lines is a Spenserian stanza. Ten, eleven, twelve and thirteen line poems don’t seem to have their own names, but rather are referred to as combinations of their predecessors: for example, a ten line poem consists of two quintains or a couplet and an octave. When you put meter into the mix, then you create an additional level of description. For example, a haiku is a 3 line poem with 17 syllables broken up as 5/7/5 - that is, first line has 5 syllables, second line has 7, third line has 5. A sonnet is a 14 line poem with 10 syllables per line (known as iambic pentameter). Hope that is helpful. ",
            "date": "Answered August 13, 2018",
            "views": "309",
            "upvotes": " View 32 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Boom Banana",
                    "user_href": "/profile/Boom-Banana"
                },
                {
                    "user_id": "Danny Brownny",
                    "user_href": "/profile/Danny-Brownny"
                },
                {
                    "user_id": "ÃŘÄ Ay",
                    "user_href": "/profile/ÃŘÄ-Ay"
                },
                {
                    "user_id": "Solomon Okon",
                    "user_href": "/profile/Solomon-Okon-5"
                },
                {
                    "user_id": "Olivia Nancy WONG",
                    "user_href": "/profile/Olivia-Nancy-WONG"
                },
                {
                    "user_id": "Reena Sackey",
                    "user_href": "/profile/Reena-Sackey"
                },
                {
                    "user_id": "Anupriya",
                    "user_href": "/profile/Anupriya-10"
                },
                {
                    "user_id": "Anil Bhosale",
                    "user_href": "/profile/Anil-Bhosale-37"
                },
                {
                    "user_id": "Maria Rak",
                    "user_href": "/profile/Maria-Rak"
                },
                {
                    "user_id": "Vîçkhy Ñmësø Çhîbüdìké",
                    "user_href": "/profile/Vîçkhy-Ñmësø-Çhîbüdìké"
                }
            ]
        }
    ]
}