{
    "title": "What's the most creative way you have seen someone use emojis? - Quora",
    "tags": [
        "Emoji",
        "Emoticons",
        "Creativity"
    ],
    "response": [
        {
            "author_info": {
                "name": "Vite Vega",
                "href": "/profile/Vite-Vega"
            },
            "answer_text": "There is a point in life when one ponders to be or not to be. En español podemos pensar en la referencia de cuando Pichulas Cuellar perdió el miembre ante in perro haciendo referencia a un sistema educativo castrante y anticuado. Then there is my 7 and 9 year old son who discovered whatsapp (only allowed contacts) I made a family group the mom, the kids and myself. They discovered voice notes and not 5 minutes after having the group, wife and I where spammed with several hundred notes. So smart me told them they where not allowed to use voice notes. So they discovered taking pictures and videos, so again the barage of text came by. I then set my foot down and said, no pictures, no videos, no voice notes only text from the key board…. My honest goal was getting the to write and practice spelling. The the glorious moment my 7 year old in protest following all rules sends me this:  Yes I saved the chat history to remind me to never stop their creativity… They are now allowed to send in any form but to please try to use text more. ",
            "date": "Answered May 6, 2018",
            "views": "22",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Trevor Sladen",
                    "user_href": "/profile/Trevor-Sladen"
                }
            ]
        },
        {
            "author_info": {
                "name": "Dwayne Walker",
                "href": "/profile/Dwayne-Walker-4"
            },
            "answer_text": "Yung Jake is a contemporary artist who combined graphic design, portraiture and emojis to create captivating pieces. His work went viral on social media and has captured the attention of 100,000's of people. I'd love to share them with you today.     Follow me for more answers on love, creativity, stories, and ideas. Thanks for reading! ",
            "date": "Updated May 18, 2018",
            "views": "284",
            "upvotes": " View 2.2K Upvoters ",
            "upvoters": [
                {
                    "user_id": "Irene Scarlet",
                    "user_href": "/profile/Irene-Scarlet-2"
                },
                {
                    "user_id": "Prakash",
                    "user_href": "/profile/Prakash-168"
                },
                {
                    "user_id": "Puneet Raj",
                    "user_href": "/profile/Puneet-Raj-15"
                },
                {
                    "user_id": "Ife Higgins",
                    "user_href": "/profile/Ife-Higgins"
                },
                {
                    "user_id": "Abhijeet Lokhande",
                    "user_href": "/profile/Abhijeet-Lokhande-32"
                },
                {
                    "user_id": "Ajayi Adedotun Oluwakorede",
                    "user_href": "/profile/Ajayi-Adedotun-Oluwakorede"
                },
                {
                    "user_id": "Saloni Iqbal",
                    "user_href": "/profile/Saloni-Iqbal"
                },
                {
                    "user_id": "Aditya Raj",
                    "user_href": "/profile/Aditya-Raj-703"
                },
                {
                    "user_id": "Robert McDougal",
                    "user_href": "/profile/Robert-McDougal-11"
                },
                {
                    "user_id": "Karla Williams",
                    "user_href": "/profile/Karla-Williams-63"
                }
            ]
        }
    ]
}