{
    "title": "What should you never say to a French person? - Quora",
    "tags": [
        "French Ethnicity and People",
        "France"
    ],
    "response": [
        {
            "author_info": {
                "name": "Julien Philippe",
                "href": "/profile/Julien-Philippe-3"
            },
            "answer_text": "What should you never say to a French person? Well, depends of who you talk to of course, but in general : “France is not France anymore.” That’s not logic, and even if that’s true to some extend, it can be upsetting, coming from wherever, abroad, within, or in oneself. “France is always late.” Socialists, backward and against economical progress, etc… That’s clearly an offense here ! We are very proud of our national struggle which paved the way to the modern nation States formation, our culture, arts, litterature, scientific achievements, and… providence State, and no decent French will hear otherwise, except the ultra-liberals who we still mainly consider as sell-outs even if they are so visible in the majority of the French media… Media than they sadly control. “France is not productive.” Productive whaaaat ?? We built 300 nukes, space-rockets only behind the U.S.A and Russia, we made Alcatel, Alstom, Airbus, and competed for decades in GDP rise with countries much more liberal, with much more inequalities, and much less public services and redistribution than us. We are super-productive, and the French way was the epitome of a successfull People-oriented capitalist economy before neoliberals started to fuck with us until we fucked up ourselves in their wake. Thanks God for us, we didn’t have the problems of Yugoslavia, our mirroring counterpart in the socialist World. “It’s over for France, you’re not important anymore.” Agreed, but don’t get confused : if the second part is partly true, the first one ain’t at all. That’s our Sovereign choice to bow out of our elite greeds and desire to hide from responsability, and our People gullibility. We can also stand the same way. France is actually one of the few countries in the World who can still have plainly its future in its hands. No one can really prevents us materially, not even the U.S.A or China. We are a nuclear Power quite autonomous in matters of military aparatus, have the biggest European territory behind Russia and Ukraine (and behind Russia only if we account our oversea territories : the sun never sets on France), enough arable lands to feed 100 millions of French, a quite highly educated population of 67,000,000+ inhabitants and would we chose to have a staunch natalist policy, we could climb quickly and pass Germany in 2 decades. We lack of sovereignly held industrial ressources, but still hold the defense and monetary system of a dozen of African countries which can provide them to us. Russia has the rest, and we could very well ally with it to its great pleasure. Would we orientate our nation toward the conquest of the stars, we’d quickly catch up on both Americans and Russians, set foot on the moon and why not build a permanent base here, just for the glory of it. Especially if we decide to work with Russians, that can go even faster. And as our current importance, 200,000 French in the streets lead to 2,000,000 Worldwide. Would we reestablish conscription, the whole Europe would follow. Would we leave the E.U, said E.U would collapse in 2 or even 3 different blocks. Would we leave NATO for good and explain why, a few other countries would probably follow : we can now honour our alliances if we wish so. We can affect the whole course of Occident if we decide so. We can lead half of the European Union if we decide so. We could bypass Germany in the Russian courting race if we decide so : Germany can’t escape the American orbit as easily as we can. Can we take the heat ? It’s another issue, France is indeed not France anymore with our current oligarchy, but that doesn’t mean we CANNOT remedy to that if we DECIDE so. It means that right now, we are in a limbo. That doesn’t mean that it’s over for France, and that’s quite important. “French are traitors.” The Czechs, Poles, Harkis, Israeli and Serbs are entitled to call us that, for we sold them out or broke Historical alliances with them without a proper cause but our Leaders’ cowardice. As we can call ourselves, at times. No one else really can. Going out of NATO command structure in 1966 or refusing to go in Irak, 2003, on falacious causes, were sovereign decisions in respect of our commitments, and we didn’t breach any treaty nor alliance, only our level of commitment within them and beyond their letter. Coming back in NATO command structure was, similarly, a sovereign decision, a betrayal of ourselves somehow, and only ourselves. “French are pussies.” The debacle of 1939–1940 and the collaboration that followed was indeed a shame, but it can’t be blamed on the People. The Political leadership and high military command hold full responsability. We lost a quater millions of soldiers in WW2, most of them trying to free our country and a few others with our allies. Beyond that fiasco we still tried to correct, French military History is full of battles, lot of lost ones, even more of won ones, may they were just wars or not. And that goes until today. From the skies mostly, true, with some special forces on the ground. But then the whole occident is a leaking pussy. “French are weak.” The Americans and Russians can legitimely consider it, and even they don’t. The Germany can legitimately consider that “1v1, they had us”, but well, after wrecking twice the whole European continent in the last century, I’d say their strength was the strength of the mad, and we French are much more reasonnable : we did not see ourselves as the Master-Race of Europe. Too much of that moderation led us to failure against such a foe, too much of the opposite led Germany to failure against a World of untermenschen as well. “France is hypocrite.” A lot of People will agree, me included, a lot of others will get pissed and some even infuriated, for they sincerely believe than we are good-doers or doing our best / what we had to do in a difficult World (Civilizationnism, WW2, Colonial Wars, NATO Wars). “France became a NATO bully.” That’s my own line, don’t steal it from me ! And if you do, I will gladly agree. But many of my countrymates will not, see previous paragraph. WE ARE TRYING TO MAKE THE WORLD A BETTER PLACE, DON’T YOU UNDERSTAND ??? 8===D(_(_)8===D(_(_), basically. Frogs, cheese eaters, beret-baguette and this kind of caricatural qualificatives will make laugh a lot of People, me included, and deeply offend others. Get close before you go for this ! ;-)  ",
            "date": "Answered March 10, 2019",
            "views": "27",
            "upvotes": " View 19 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Clémentine Desormes",
                    "user_href": "/profile/Clémentine-Desormes"
                },
                {
                    "user_id": "Sixtine Gouesse",
                    "user_href": "/profile/Sixtine-Gouesse"
                },
                {
                    "user_id": "Jacques Verhaeghe",
                    "user_href": "/profile/Jacques-Verhaeghe"
                },
                {
                    "user_id": "Xavier Lebrun",
                    "user_href": "/profile/Xavier-Lebrun"
                },
                {
                    "user_id": "HawkNButterfly",
                    "user_href": "/profile/HawkNButterfly"
                },
                {
                    "user_id": "Mathieu Boullot",
                    "user_href": "/profile/Mathieu-Boullot"
                },
                {
                    "user_id": "Filip Alavanja",
                    "user_href": "/profile/Filip-Alavanja"
                },
                {
                    "user_id": "Cyril Nadarien",
                    "user_href": "/profile/Cyril-Nadarien"
                },
                {
                    "user_id": "Dorian Morel",
                    "user_href": "/profile/Dorian-Morel"
                },
                {
                    "user_id": "Jérôme Froget",
                    "user_href": "/profile/Jérôme-Froget"
                }
            ]
        },
        {
            "author_info": {
                "name": "Antonio Balvet",
                "href": "/profile/Antonio-Balvet"
            },
            "answer_text": "“ouh là là” followed by “comme-ci, comme-ça” :) Yes, people say it all the time, but not in the sense Americans assume. “ouh là là” is just a very common exclamation, there’s nothing sexual about it. It’s like “gosh” or “wow”. As for “comme-ci, comme-ça”, it means “so-so”, nothing more, nothing else. And people use it when they don’t really want to make a strong statement about something. So saying both of these in the same utterance is just weird. Oh, and Paris is not “romantic” (as per the wiktionary, “romantic” means: An artistic and intellectual movement, stressing emotion, freedom and individual imagination, that originated in Europe toward the end of the 18th century). Paris, as most of European cities, is a town built on very ancient foundations that far predate what is known as “romanticism”. It’s a city where the weight of history is evident anywhere you go. In this sense, it’s probably easier to get your first kiss after walking the streets of Paris at night with your date than, say, coming from the nearest burger joint in Oklahoma… But that’s it. Paris is also very crowded, not always as clean as we’d like, and can be quite depressing, too. It does make for nice pictures, though. And please refrain from using “cute” all the time. The Eiffel tower is not “cute” (as a matter of fact, most Parisians thought it was a real eye sore when it was first built for the Exposition Universelle). Notre-Dame is not “cute”, either. It’s “impressive” (it took several centuries to be completed, and it’s not even really finished btw), “massive”, “awe-inspiring” etc. But not “cute”. Two more for the road: if you’re British, maybe you shouldn’t talk about Napoleon. There are plenty of other hot topics (eg. Which is best: wine or beer? Who has the best cheeses?). If you’re American, please refrain from stating that you saved our asses in WWII. The French know it, and they will be forever thankful for that, but it won’t stop them from criticizing the American way of life, nor the way America’s foreign policy has an impact on the rest of the world (dicatorships in South America, and terrorism come to mind). ",
            "date": "Answered September 1, 2017",
            "views": "28",
            "upvotes": " View 31 Upvoters",
            "upvoters": [
                {
                    "user_id": "Clémentine Desormes",
                    "user_href": "/profile/Clémentine-Desormes"
                },
                {
                    "user_id": "Éva Vas",
                    "user_href": "/profile/Éva-Vas"
                },
                {
                    "user_id": "Linda Grady",
                    "user_href": "/profile/Linda-Grady-9"
                },
                {
                    "user_id": "Pierre-Yves Saumont",
                    "user_href": "/profile/Pierre-Yves-Saumont-1"
                },
                {
                    "user_id": "Christine Sowards",
                    "user_href": "/profile/Christine-Sowards-2"
                },
                {
                    "user_id": "GP Chen",
                    "user_href": "/profile/GP-Chen"
                },
                {
                    "user_id": "Michel le Gouill",
                    "user_href": "/profile/Michel-le-Gouill-1"
                },
                {
                    "user_id": "Tello Silva",
                    "user_href": "/profile/Tello-Silva"
                },
                {
                    "user_id": "Tom Norberg",
                    "user_href": "/profile/Tom-Norberg"
                },
                {
                    "user_id": "Camille Latham",
                    "user_href": "/profile/Camille-Latham"
                }
            ]
        }
    ]
}