{
    "title": "What are some real world examples of non-linearity? - Quora",
    "tags": [
        "Non-linear Thinking",
        "Nonlinear Systems",
        "Non-Linear Models",
        "Real Life Applications",
        "Mathematics",
        "Philosophy of Everyday Life"
    ],
    "response": [
        {
            "author_info": {
                "name": "Vincent Moreau",
                "href": "/profile/Vincent-Moreau-5"
            },
            "answer_text": "Some other examples in line with Larry Storeteling post. Change on input quantity very often not only changes non-linearly the amount of output, but also the nature of the output. Stop breathing 30 s every minute for 20 minutes. You can make it. Stop breathing 5 minutes every 10 minutes for 20 minutes. I strongly doubt you survive the first stop. Sunbath 30 minutes a day in August for 24 days, you feel healthy. Sunbath 24*30 minutes=12 hours in one day, you die. You are a healthy young guy. You jump from 3 m height 4 times at 5 minutes interval. Waouh, what a man! You jump from 6 m height twice at 10 minute interval. First time you break both legs. Second time you die (or worse if you are unlucky). If one woman can make a baby in 9 month, 9 woman cannot make a baby in 1 month… All of these are discrete events, so we must also find more continuous ones. You want to grow a plant. No water, the plant dies. Small water, the plant hardly survives. More water, the plant flourish. Even more water, the plant hardly survives. Still even more water, the plant dies… same with food and animals (or humans). It is cold outside (say 0 degree C). You enter a house at the same temperature. You begin to freeze. You heat the house 20 C more: you feel comfortable. You heat the house 40 C: you begin to sweat heavily. You heat up to 60 C: you feel you are in a sauna and you would better not stay long. You heat up to 80 C: you risk to die very quickly. You take a shower with water at 17 C: well, you are tough. You take a shower with water at 37 C: you feel comfortable. You take a shower with water at 57 C: maybe you survive the burn if you reach fast enough the hospital. You earn no money: you are a failure. You earn small money: you are a worker. You earn decent money: you are a white collar. You earn indecent money: you (most probably) are an ***-hole. Last one. You go to the market and buy 20 kg of tomatoes: you are Italian and want to make “sugo”. You go to the market and buy 3197 kg of tomatoes. You are a mathematician in a math problem, so no one wonders what you will do with them and how you will transport them barehanded. I am diverging… ",
            "date": "Answered September 11, 2019",
            "views": "964",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Larry Storeling",
                "href": "/profile/Larry-Storeling"
            },
            "answer_text": "Exercise twice, your not likely to lose twice the weight. Exercise for one minute twenty separate times, you won't get the same effect as exercising once for twenty minutes consecutive. Similar for studying. ",
            "date": "Answered September 4, 2019",
            "views": "402",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Anthony Adam",
                    "user_href": "/profile/Anthony-Adam-9"
                },
                {
                    "user_id": "Sam Nazari",
                    "user_href": "/profile/Sam-Nazari-2"
                }
            ]
        }
    ]
}