{
    "title": "What are fountain pens used for? - Quora",
    "tags": [
        "Stationery (office supplies)",
        "Fountain Pens",
        "Handwriting",
        "Ink",
        "History of Inventions",
        "Pens",
        "Tips and Hacks for Everyday Life",
        "Writing"
    ],
    "response": [
        {
            "author_info": {
                "name": "Luna Fowler",
                "href": "/profile/Luna-Fowler-1"
            },
            "answer_text": "Just about any writing, doodling and drawing. Many students use them because they strain their hands less than ballpoints, which require constant pressure, would. Many then carry on with that habit because they’ve grown to dislike ballpoints or start using fountain pens later on for that reason.Writers that prefer paper over digital text programs use them as well, for much the same reason students do. Many urban sketchers use them as an alternative to fineliners like microns, ballpoints or the dip pens that are still widely used to ink comic or manga pages. The latter is definitely a good choice when sitting on a desk or other permanent workplace, but widely impractical when traveling.Generally artists tend to prefer permanent inks and flex nibs to get some line variation and have the option of using watercolours and such to colour their drawings afterwards. Doodling should be self explanatory. Maybe people have a habit of doodling whenever they have a pen and paper and don’t have to write anything at the minute. Some find it helps them focus, relax or they just find it to be fun so they may bring them even if they wouldn’t have the need to. Some reasons why people use fountain pens specifically include the mentioned lessening of strain, the wide array of colour choices (you can even buy shimmering inks), the different feeling when writing with it or because using less pressure helps them control their pen and makes their handwriting look more legible.I’ve even heard that some people enjoy the ritual of filling the pens or feel the need to slow down and appreciate their writing more with fountain pens, though writing slowly isn’t something that is required to use them. ",
            "date": "Answered February 2, 2019",
            "views": "91",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Jack Uniglicht",
                    "user_href": "/profile/Jack-Uniglicht"
                },
                {
                    "user_id": "Ashley Avallone",
                    "user_href": "/profile/Ashley-Avallone-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Michael Ballai",
                "href": "/profile/Michael-Ballai"
            },
            "answer_text": "Just about anything you would normally use a ballpoint or rollerball for in everyday writing. Most people today may limit their use depending on their willingness to give their writing chores time for any extra maintenance required by the pen. You do have to clean the pen and refill it on a regular basis. Really simple stuff, but some people are just too lazy. The advantage is a truly superior writing experience and the ability to have a much more distinctive style to the way your writing appears. A cursive italic or stub nib makes beautiful lettering. Properly adjusted, a fountain pen requires little or no pressure and is exceptionally smooth. ",
            "date": "Answered January 25, 2019",
            "views": "87",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Luna Fowler",
                    "user_href": "/profile/Luna-Fowler-1"
                },
                {
                    "user_id": "Betsy Megas",
                    "user_href": "/profile/Betsy-Megas"
                }
            ]
        }
    ]
}