{
    "title": "What are some examples of oral narratives? - Quora",
    "tags": [
        "Oral Narratives",
        "Narratives"
    ],
    "response": [
        {
            "author_info": {
                "name": "Jim Lee",
                "href": "/profile/Jim-Lee-359"
            },
            "answer_text": "What later became Grimm’s Fairy Tales were actually stories in the oral tradition passed down from one generation to the the next, then collected and published by the Brothers Grimm. Another interesting oral tradition is the oven-overlooked mythology of Native Americans. There was even a university study in 1936 of the werewolf legends of the Navajo. In Europe until almost modern time, most people (excluding the clergy) were illiterate. You brought up a fascinating topic; have fun with it. ",
            "date": "Answered August 8, 2019",
            "views": "16",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Jonathan Chiu",
                    "user_href": "/profile/Jonathan-Chiu-27"
                }
            ]
        },
        {
            "author_info": {
                "name": "Robert Esposito",
                "href": "/profile/Robert-Esposito-7"
            },
            "answer_text": "\"By the shores of Gitchee Gumee, By the shining Big-Sea-Water, Stood the wigwam of Nokomis, Daughter of the Moon, Nokomis. Dark behind it rose the forest, Rose the black and gloomy pine-trees, Rose the firs with cones upon them; Bright before it beat the water, Beat the clear and sunny water, Beat the shining Big-Sea-Water. There the wrinkled old Nokomis, Nursed the little Hiawatha, Rocked him in his linden cradle, Bedded soft in moss and rushes. Safely bound with reindeer sinews; Stilled his fretful wail by saying, \"Hush! The Naked Bear will hear thee!\" Lulled him into slumber, singing,\"Ewa-yea! my little owlet! Who is this, that lights the wigwam? With his great eyes lights the wigwam? Ewa-yea! my little owlet!\" From The Song of Hiawatha by Henry Wadsworth Longfellow ",
            "date": "Answered March 6, 2020",
            "views": "723",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Virginia Hanlon",
                    "user_href": "/profile/Virginia-Hanlon"
                }
            ]
        }
    ]
}