{
    "title": "What are the different ways to find your passion back? - Quora",
    "tags": [
        "Following Your Passion",
        "Passion"
    ],
    "response": [
        {
            "author_info": {
                "name": "Taylor Puth",
                "href": "/profile/Taylor-Puth"
            },
            "answer_text": "You’re probably the kind of person who works hard, with commitment and persistence. When you know what you’re doing, nothing will stop you. But before you can become unstoppable, you need to know what you’re starting. Before you can follow your passion, you have to find it. If you’re feeling stuck, here are five fresh ways to discover what you really want to do with your life. Take time to work through the process and know that, no matter what, you’ll be getting closer to where you want to be. 1. Start With the Right Perspective If you went into a restaurant with the strong opinion—“I’m not hungry. There’ll be nothing here I want to eat. I don’t want to be here”—the menu isn’t going to look appealing. You won’t explore it with due time or attention, and it’s unlikely you’ll find food you’ll enjoy eating. The same principle applies to passion-seeking. If you’re convinced that finding your passion is hard, or that it’s not going to happen for you, you’ll remain closed to possibilities. You’ll block the little nudges, pulls, and signals that guide us all. After all, how can you expect to find fulfilling work if you don’t believe it exists? Choose to adopt the perspective that you can do what you love with your life. One of the best ways to strengthen this point of view is to surround yourself with people who are living examples. How many of your friends and family are following their passions? If it’s not many, it might be time to expand your circle; associate with—and be inspired by—men and women who are inspired by their work. 2. Get Out Your Metal Detector Once you’ve decided that your passion is findable, it’s time to look for evidence of what you already love to do. If you scan the landscape of your life, you’ll notice certain experiences peak up. It’s so valuable to delve into these “peak moments” and extract the key ingredients. Consider yourself a beach-trawler, discerning between the gold and the cheap metal. For example, one of my favorite summer jobs involved teaching English to teenagers. I might assume the key ingredient was the English language, or young people. But when I paid attention to my metaphorical metal detector, it become clear that the bleep went off when I was being a leader within a community, and teaching that community something of great value to them. That’s exactly what I do now in my work—but without the teenagers, present perfect tense, or vocabulary tests! Make a list of the ingredients that truly mattered in your peak moments; don’t be distracted by the counterfeits. 3. Look for the Umbrella When you look at all the ingredients that matter to you, they might at first seem entirely disconnected. Let’s say you love French, drinking coffee, playing with words, analyzing and categorizing, and being a leader within a community. How could you construct a career from these? It'd be like peering into your cupboard and seeing cocoa powder, tofu, and carrots and wondering: How could I possibly make something delicious that includes all of these? This is the time to look beyond the ingredients and seek an umbrella; something that all of these ingredients can fit beneath. For example, my colleague Abby—whose diverse passions are described above—helps business owners to find the right words to fit their brand. She analyzes and categorizes copy into what she calls “voice values.” She draws wisdom from previously running a funky French lifestyle boutique, and French words pepper her own copy, giving her brand that special je ne sais quoi. She’s become known as a leader for those who want to communicate effectively with their potential clients. Oh—and she’s built a recognizable Pinterest profile showcasing her favorite coffee houses. All of these passions fit under the overarching umbrella of her business; they’ve all found a home there, and the variety actually helps her to stand out and attract her perfect clients. What might be your umbrella? 4. Discern Between a Hobby and a Profitable Passion It might be that, through this exploration, you fall head over heels in love with an activity that engrosses you—something that lights you up and makes your heart sing. But now you have to ask yourself the next question: Who would benefit from (and pay for) this? Well, if you want to contribute your passion to society and make an income from it, you need to get realistic about whether this could actually turn into a career—and what you would need to do to make that happen. Moreover, think about if you would even enjoy doing those things; for some people a passion is just fun, and turning it into work changes it from a “love to do” to a “have to do.” For example, my client Lisa loves to draw. She makes art for the sheer joy of it. When she attempted to turn this passion into a profitable business, she realized that the market who were hungry for her talents were business owners who needed illustrations for their blogs, websites, and products. This felt like play to Lisa, but in order to make her services marketable, she also needed to add tech skills to her toolkit, so that her design work could be useable online by her ideal clients. Be alert to who might need your newly emerging passion, and aim to have conversations with them to get you clearer on how, where, and when you can serve them.  5. Expect the Mutiny When you seek your passion, there’ll be parts of you that go into rebellion. I’d guess that this article itself might be provoking some of those resistant parts! We all have a huge number of fears—around failure, success, visibility, and vulnerability—that speak in sensible voices, instructing us that we mustn’t do what we love. If you let these voices win, your passion will remain out of your grasp. Instead, look for the fear beneath each supposedly reasonable voice. Uncover the years of conditioning—from parents, school, partners, and colleagues—and reassure the mutinying parts that your ship is sailing in the right direction. 6. Find the Limits of Your Bravery On my own journey, I’ve mostly lived by the motto: “Leap and the net will appear.” I’ve noticed I couldn’t find the new until I’d said farewell to the old. With each step into the unknown—for example, handing in notice on my part-time salaried job to go fully self-employed—my announcement to the universe has been: I’m available. I’m serious about this. I’ve been called brave, but I don’t see it that way; I’ve simply been more committed to my happiness and freedom than to staying cozy with the status quo. Find your own version of brave. Discover what risks work for you. The path of passion is where you do things that scare you enough, without leaving you in a constant state of fear. Expand your comfort zone, rather than leaving it. The world needs your passion, so decide right now that it’s possible to find it, and use this guidance to gain clarity. When you find your passion, be assured: It will always guide you right. ",
            "date": "Answered November 15, 2017",
            "views": "766",
            "upvotes": " View 26 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Tanisha Albert",
                    "user_href": "/profile/Tanisha-Albert-1"
                },
                {
                    "user_id": "Maria Thuongza",
                    "user_href": "/profile/Maria-Thuongza"
                },
                {
                    "user_id": "Mary R. Glenn",
                    "user_href": "/profile/Mary-R-Glenn"
                },
                {
                    "user_id": "Lyndsay J. Thomsen",
                    "user_href": "/profile/Lyndsay-J-Thomsen"
                },
                {
                    "user_id": "Elizabeth C. Hudson",
                    "user_href": "/profile/Elizabeth-C-Hudson"
                },
                {
                    "user_id": "Pauletta J. Mifflin",
                    "user_href": "/profile/Pauletta-J-Mifflin"
                },
                {
                    "user_id": "Nellie D. Carder",
                    "user_href": "/profile/Nellie-D-Carder"
                },
                {
                    "user_id": "Delia D. Mikkelsen",
                    "user_href": "/profile/Delia-D-Mikkelsen"
                },
                {
                    "user_id": "Xiao Chen Ts'ui",
                    "user_href": "/profile/Xiao-Chen-Tsui"
                },
                {
                    "user_id": "Wen Lei",
                    "user_href": "/profile/Wen-Lei-23"
                }
            ]
        },
        {
            "author_info": {
                "name": "Lukasz Laniecki",
                "href": "/profile/Lukasz-Laniecki"
            },
            "answer_text": "Maybe trying desperately to get back the thing which you’ve lost is not the right answer. Maybe letting it go would be a better idea. Most people believe that people can have only one passion in their lives. That having a passion and losing it is the worst. That after something like that happened to you your life will never be as good as it was before. That it is a reason to become depressed or even end your life. But that’s the consequence of this common (erroneous in my opinion) belief that we can have only one passion. That’s not true. Why should it be true? Who said that we can have only one passion in life and based on what? I think it is bullshit that we can have only one passion in life. I believe we can have multiple passions. If we’re capable of developing passion for one thing we are capable of doing it again with a different thing. Only in order to develop that second, third or fifth passion we need to dump the idea that we can have only one passion in life. Based on what do I think that we can have multiple passions in our lives? I don’t know exactly. That’s just my belief. The idea that we can have only one passion in life is also just a belief. It’s based on nothing. Or at least those who have that belief don’t know exactly what it is based on. They believe it’s true because that’s the most common belief. Period. Of these two beliefs my is better. At least I won’t cry or want to kill myself when I will lose my passion. ",
            "date": "Answered August 9, 2019",
            "views": "556",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Anas Khalid",
                    "user_href": "/profile/Anas-Khalid-56"
                }
            ]
        }
    ]
}