{
    "title": "What 10 things make a good fanfiction? - Quora",
    "tags": [
        "Fanfiction Recommendations"
    ],
    "response": [
        {
            "author_info": {
                "name": "Barbara Rich",
                "href": "/profile/Barbara-Rich-22"
            },
            "answer_text": "There are a lot of things that do so, but let’s look at some: Write what you love. When I read a fanfiction, I want the passion the writer has for her fandom, the love he has for the characters and their world. If that shines through I can forgive a lot of flaws in the writing.Know the canon. If you are not familiar with the original source material, then you need to make yourself familiar with it before you write it. If the summary tells me the writer has never read/watched/listened to the source, I won’t bother with it.Do not make your characters OOC (Out-of-character) unless there is a very good reason for it, preferably one that fits the canon. (For example, there is a reason that “love spores” are popular in Star Trek fanfiction—they existed in the original source.) Otherwise, you should make your character fit as closely into canon as possible.I will not say “don’t write about original characters”. I will say that you should make your original characters in character for the world you have put them in. If you should choose to feature OCs from a world other than the setting, they have to learn to adapt. A character should have a reason for existing in the story.Pay attention to the technical things. Run your work through the spellchecker. Check the grammar and punctuation. Pay attention to things like line breaks, so the reader isn’t looking at a “wall of text”. Some readers are less patient than others with flaws in these things.Consider the readers you are hoping to attract. If you write M or X rated stories, you have a good idea of what they want. There are people who only want to read family-friendly fluff, and if those are the readers you want, it is likely that’s the sort of fic you like, so go for it. Maybe your favorite sub-genre of fanfic is hurt/comfort; it’s also the favorite of many others. I have found that if you have a friend in the fandom who likes many of the same tropes you do, write a gift fic for that friend and it is likely to become one of your most popular stories.Get a beta. Seriously, it’s the best thing to do. A friend can do it, but only if it is the type of friend who has the knowledge to find the flaws in your work and will be brutally honest when necessary. If all your friends do is to squee at everything you write, and tell you it’s perfect, then check and see if the archive where you post has a list of betas.Don’t be afraid to do the research. The internet makes it possible for you to check out a story’s details. You can easily find out the distance between Point A and Point B, or what kind of clothes were worn or what tech was used back in whatever year it is set in. Not doing it will make people call you out in reviews.Always be open to new ideas. If you can, take part in challenges and prompt-fests. Sometimes my best and most popular stories have been because a prompt pushed me to stretch my boundaries beyond my usual comforts zone.Once more, love your stories. Re-read them. Read the comments about them, and take constructive criticism in mind. You don’t really need to ret-con a story, but use it to make your next story better.",
            "date": "Answered February 9, 2020",
            "views": "496",
            "upvotes": " View 7 Upvoters",
            "upvoters": [
                {
                    "user_id": "Gonzalo Amorín",
                    "user_href": "/profile/Gonzalo-Amorín"
                },
                {
                    "user_id": "Zara Wasique",
                    "user_href": "/profile/Zara-Wasique"
                },
                {
                    "user_id": "Beryl Jade",
                    "user_href": "/profile/Snow-Jade-1"
                },
                {
                    "user_id": "Inari The Kitsune",
                    "user_href": "/profile/Inari-The-Kitsune"
                },
                {
                    "user_id": "Lara",
                    "user_href": "/profile/Lara-128"
                },
                {
                    "user_id": "Kenz Huynh",
                    "user_href": "/profile/Kenz-Huynh"
                },
                {
                    "user_id": "Stephanie Wise",
                    "user_href": "/profile/Stephanie-Wise-3"
                }
            ]
        },
        {
            "author_info": {
                "name": "Arya Evanstan",
                "href": "/profile/Arya-Evanstan"
            },
            "answer_text": "I’ve just started reading fan fiction on Wattpad, (until now I’ve only used Ao3 because I just love it so much), and I noticed how most of the fics I have read so far have the same or similar mistakes. There are fics like that on Ao3, but not nearly this many. Anyway, I decided to answer this question by addressing those issues. (I don’t read fics with OCs as main characters. I’m reading fan fiction, not a book. I want the characters I already love. Nothing against people who write it well or like it, I just don’t.) This is more like a list of things to remember when you’re writing fan fiction but whatever. It’s okay to just use the character’s name or pronoun, don’t constantly go into that whole, “the younger man,” or, “the taller boy,” business. It gets really annoying. There’s nothing wrong with repeating he, she, they, or just their name. I know it may feel repetitive when you’re writing it, (it has for me), but in the long run, it will be much better. Only use descriptions when they fit into the story, don’t just randomly throw them in when you think you’ve used names or pronouns too many times.Show don’t tell. I hate to say it, because it makes me feel like an annoying English teacher, but it’s actually really important. Rather than saying something like, “she was angry,” describe her body language, anger: clenched fists, grinding teeth, white knuckles, red face, etc. It makes the story much more compelling and overall just a better read.Space out your writing. No one wants to read a 20-line-long block of writing, you have to separate your writing so it doesn’t look like terms and conditions and then people will have a much easier time reading it.Start a new line or paragraph after dialogue. Please do not ever put the dialogue of multiple characters into the same paragraph. The only time when this could be okay is if they were twins or something and they finished each other’s sentences, but otherwise just don’t.Keep the characters in character. I hate reading a fan fic when the author just decided to change a character completely. If you’re writing about a character who never cries or shows emotion in canon, please don’t have them bawling their eyes out and screaming every gosh darn second. It’s okay if there’s a specific reason for it (eg: trauma, Stockholm syndrome, something normal, etc.) But otherwise don’t.Edit and proof read. I’m obsessed with words, I’m obsessed with grammar and spelling and I do make mistakes sometimes, but that’s because my brain edits the words I see, so sometimes I don’t even notice when I’ve accidentally missed a letter, but, no matter what, I always try. There’s nothing worse for me then reading a fic that changes tense or uses the wrong, “your.” If you have trouble with this, read your work out loud to yourself and it'll be much easier to notice. (I select the text and use the speak feature, because it’s easier for me that way.)Stay consistent. I never want to read something like, “I always wanted a sister,” only to see, “this is my little sister,” a few paragraphs later. I also hate it when someone suddenly changes their opinion or feelings on something with no apparent reason.Stop random overreactions. I read a fic that about once every paragraph there was a “he screamed,” or a, “he cried,” when nothing at all warranted any of this.If you’re using a thesaurus, don’t make it obvious. Okay, there’s no shame in using a thesaurus, I love a good word, and if you need a thesaurus to find one, that’s great because you’re just adding to your vocabulary. But I don’t want to be able to see it. Particularly if you’re looking for different words for “said.” I don’t want to be seeing any, “he vocalised,” or, “they defended,” or, “she interjected,” because, honestly, that sounds incredibly stupid.Don’t phonetically write out dialogue. I will not read, “ey dere ‘Arry what’re ya doin’ terday?” Just spell it properly and trust me to do the accent in my head. Writing like that makes it extremely annoying to read.Other tips: Please have some kind of substance in your work.There has to be some kind of problem or conflict. I know some people are just writing smut or whatever, but there should still be a climax, (pun intended.) I read a fic the other day that had no conflict, no problem, no climax, and literally nothing happened and I just felt disappointed that I ever read it. Use language features.Use similes, metaphors, personification, etc. I know it’s not a book, but it’s nice when people put in the effort. Keep your emotions at a realistic pace.I really hate it when a character is immediately obsessed and in love with another character after just, like, seeing them across the hallway. Please do not do this. This is part of the overreacting I was talking about. Get the historical or cultural feel right.If you’re story is based in 1957 and the main characters are gay or something, it wouldn’t be okay with everyone, it would probably be awkward, and there would probably be a lot of internal, or external, homophobia from one of the gay characters or something like that. That’s just an example but it’s the same for how POC or women were treated before. The same goes for location, if you’re American and your writing a Harry Potter fic, I don’t want to see any “trash cans,” or “moms,” when there should be, “rubbish bins,” and “mums,” because it’s really annoying. Keep your dialogue natural.Don’t repeat names all the time, this looks gross: “Hey Carol, what do you think of this?” “It’s great, Deborah.” “Thanks, Carol.” “That’s alright, Deborah.” Also remember that people interrupt each other, and make mistakes, and no one talks perfectly. People say stuff, “you know,” and, “like,” quite a lot. People also say stuff like, “me and James,” instead of, “James and I,” or use “who,” when they should use “whom,” or say, “I feel bad,” when it should be, “I feel badly,” but just make sure it fits the character. And if you’re having trouble with the word “said,” (which is a very common problem), just get rid of it all together. You just need the first one and then you can just structure the conversation in single lines dialogue, as long as it’s clear who is speaking. Like this excellent example: “Hey Sam, I am now speaking to you,” said Steve. “Yes, you are speaking to me.” See, no need for any he replied or he exclaimed. It’s all good. Dont put random shit in places it doesn’t belong.I was reading a fic the other day about the Beatles playing truth or dare. George, Paul and Ringo went into a different room and came back with, a wedding dress, a diamond necklace and high heels. Does this make any sense? No. Was this ever explained at all? No. Don’t do it, it’s terrible. Do some research.If theres a topic topic in your fic that you don’t know much, or anything, about, either avoid it or find out more so it can be accurate. It’s not hard to just type a few words into google and read and read a few articles. You’re already on the internet. If someone in a fic says something like, “his leg smells like grapes, that means it’s infected,” that better be true because if I ever get burnt and it starts smelling like grapes I will know it’s infected.  Edit: another one I recently thought of: Stress the right words.I recently read a Frostiron fic and it was very good other than the fact that the author stressed the wrong words. Stressing means using italics on a certain word so we know to pronounce it more loudly, clearly and slowly. It makes the point of the sentence clear. For example: “Why are you here?” Shows that the most important thing is that this particular person is here. “Why are you here?” Shows that the most important thing is that they’re in this particular place. So if you want to get a specific point across you need to make sure you stress the right word. Obviously, most sentences don’t have any stressed words, but when you do use them, make sure you do it right. (Another Edit: Apparently I forgot the word “emphasis” when I wrote that.) ",
            "date": "Updated June 1, 2020",
            "views": "31",
            "upvotes": " View 265 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Nicole Wong",
                    "user_href": "/profile/Nicole-Wong-291"
                },
                {
                    "user_id": "Abby Smith",
                    "user_href": "/profile/Abby-Smith-417"
                },
                {
                    "user_id": "Suriya Li",
                    "user_href": "/profile/Suriya-Li"
                },
                {
                    "user_id": "MiniSkittles",
                    "user_href": "/profile/MiniSkittles"
                },
                {
                    "user_id": "Malina Everfree",
                    "user_href": "/profile/Malina-Everfree"
                },
                {
                    "user_id": "Bella Catalina",
                    "user_href": "/profile/Bella-Catalina-1"
                },
                {
                    "user_id": "Colette De Laurel",
                    "user_href": "/profile/Colette-De-Laurel"
                },
                {
                    "user_id": "Dakota Harlow",
                    "user_href": "/profile/Dakota-Harlow"
                },
                {
                    "user_id": "Rebecca Owens",
                    "user_href": "/profile/Rebecca-Owens-123"
                },
                {
                    "user_id": "Joanne Molobeng",
                    "user_href": "/profile/Joanne-Molobeng"
                }
            ]
        }
    ]
}