{
    "title": "What are the best international pen pal websites? - Quora",
    "tags": [
        "Pen Pal",
        "Pens",
        "Website Recommendations"
    ],
    "response": [
        {
            "author_info": {
                "name": "Eivind Kjørstad",
                "href": "/profile/Eivind-Kjørstad"
            },
            "answer_text": "It’s been a while since I had need for using any of the websites, so this information may be a bit dated. But back when I last needed to go hunt for new penpals, I quite liked InterPals Penpals. It had tons of active members with a good spread both across geography, gender and age.Powerful search function that makes it fairly easy to find people that may be a good match for you.Low amounts of spam, and reasonable privacy-controls to keep away people you’re NOT interested in. (it’s a sad fact of life in international penpalling that especially if you’re a young first-world woman you’ll otherwise get a lot of messages from men in poorer countries who are trying to use the penpal-site as a dating-site)I have no clue whether or not it’s the best site though, there may well be others that work even better. But it’s served my needs well and I think unless the site has somehow deteriorated a lot in the last few years it’s likely to work well for you too. ",
            "date": "Answered October 18, 2017",
            "views": "156",
            "upvotes": " View 8 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Alaina DePaul",
                    "user_href": "/profile/Alaina-DePaul"
                },
                {
                    "user_id": "Your Local Loser",
                    "user_href": "/profile/Your-Local-Loser-2"
                },
                {
                    "user_id": "Isaac Dylan",
                    "user_href": "/profile/Isaac-Dylan-2"
                },
                {
                    "user_id": "Fydes Nyirenda",
                    "user_href": "/profile/Fydes-Nyirenda-2"
                },
                {
                    "user_id": "Katja Kaila",
                    "user_href": "/profile/Katja-Kaila"
                },
                {
                    "user_id": "Sven Williams",
                    "user_href": "/profile/Sven-Williams"
                },
                {
                    "user_id": "Sergey Dovhan",
                    "user_href": "/profile/Sergey-Dovhan"
                },
                {
                    "user_id": "Heather Jedrus",
                    "user_href": "/profile/Heather-Jedrus"
                }
            ]
        },
        {
            "author_info": {
                "name": "Clare Butcher",
                "href": "/profile/Clare-Butcher-10"
            },
            "answer_text": "I can recommend global pen-friends. I’ve used it for a while and it’s pretty safe because each profile is checked by a person which isn’t that common now. It’s really easy to fund friends on it because it’s for people who are both interested about looking for penpals. It’s really easy to use and has heaps of internet safety guides which is also good. ",
            "date": "Answered May 8, 2020",
            "views": "17",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Global Penfriends",
                    "user_href": "/profile/Global-Penfriends"
                },
                {
                    "user_id": "Your Local Loser",
                    "user_href": "/profile/Your-Local-Loser-2"
                }
            ]
        },
        {
            "author_info": {
                "name": "David Smith",
                "href": "/profile/David-Smith-8951"
            },
            "answer_text": "You can connect with others worldwide on the website/app Me We Too. It’s very fun. Members post/vote on mini polls - you share about yourself, your experiences, beliefs, etc. and others vote “me too”, “hmm”, or “not me” . After voting, it shows you who made the poll and who voted what. Then on your “We Circle” page, it shows you your connections, who you interacted with on the polls, who voted on the same polls as you. ",
            "date": "Answered July 31, 2020",
            "views": "997",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Laine Simone",
                    "user_href": "/profile/Laine-Simone"
                }
            ]
        }
    ]
}