{
    "title": "What are some ideas for a short film? - Quora",
    "tags": [
        "Short Film Ideas",
        "Short Films",
        "Ideas"
    ],
    "response": [
        {
            "author_info": {
                "name": "Gary Elmer",
                "href": "/profile/Gary-Elmer"
            },
            "answer_text": "Usually a short films' primary purpose is as a demo reel to highlight a directors skills in an area of filmaking they are interested in. So if a director loves horror and would like to direct some then a horror short is a good first step.  Same for comedy, drama, period pieces, westerns, thrillers, action adventure etc. It could be a director may like to try something outside their comfort range.   In any case a logical path is to first choose the genre of interest.  Secondly take an inventory of potential actors, locations costumes and props available.  Writing a short to use available materials is a lot more efficient than writing first and then trying to find everything.   So for instance you know an actor that would be good in a western, there is an old farm house, horses and a valley nearby and the owner is a relative.... And you like Westerns.   Kablam it's Western time  You love horrors, there ia an abandoned creepy house nearby.  You love sports, know a basketball player, have an old uncle who used to be a coach.  You get the idea.  Write to what resources you have easy access to and in a genre that interests you. Come up with a really engaging short story with unexpected twists for the audience.  If there are no surprises there is no story. If you are a bit weak on the writing side find a colaborator that you can bounce ideas off. I have found with regards to writing there are three types of people.  Random idea generators:  lots and lots of blue sky ideas.  Accelerators:  people that can jam with a concept and grow an idea.  Polishers:  people that can grasp the concept and then fine tune a story.   Good professional writers are able to use all three gears, the rest of us need help. Figure out what type of content you do best and get help with the other styles. Another key area for your script development is to consider what technical resources you have at your disposal.  So for instance you or a friend has a good camera and lights. (And knows how to use them) means that a night interior scene will likely look good.   If you have access to a not great camera with no lights then writing a story should likely favour exterior day scenes.   Or you know a good sound recordist with good gear will open up scenes with more dialog. Etc.  Write a short that you will have high odds of being able to shoot well. A final factor when considering your short content is how much time you have to shoot and edit your short.  You have only a portion of an afternoon?  Two people talking.  Or if you have a month of prep, 2 weeks to shoot it and 6 weeks to post it... Then the story could be more elaborate. Producing anything is an odds game.  With a massive blockbuster budget a script can call for virtually anything.  In the low budget short world certain words should be avoided.  Helicopter, Jet, car chase, explodes, operating room, nuclear facility, space craft, airport, lambourgini, $2,000 suit, etc.   Write to what you can do. ",
            "date": "Answered December 7, 2015",
            "views": "36",
            "upvotes": " View 15 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Madara Būmane",
                    "user_href": "/profile/Madara-Būmane"
                },
                {
                    "user_id": "Zam",
                    "user_href": "/profile/Zam-35"
                },
                {
                    "user_id": "Pradipna Lodh",
                    "user_href": "/profile/Pradipna-Lodh"
                },
                {
                    "user_id": "Cyrix",
                    "user_href": "/profile/Cyrix-2"
                },
                {
                    "user_id": "Jack Saunders",
                    "user_href": "/profile/Jack-Saunders-29"
                },
                {
                    "user_id": "Narendra Kumar",
                    "user_href": "/profile/Narendra-Kumar-415"
                },
                {
                    "user_id": "Patrícia De Abreu Castello Branco",
                    "user_href": "/profile/Patrícia-De-Abreu-Castello-Branco"
                },
                {
                    "user_id": "Emmanuel Mavely",
                    "user_href": "/profile/Emmanuel-Mavely"
                },
                {
                    "user_id": "Andrew Walden",
                    "user_href": "/profile/Andrew-Walden-7"
                },
                {
                    "user_id": "Darius Mena",
                    "user_href": "/profile/Darius-Mena"
                }
            ]
        },
        {
            "author_info": {
                "name": "Cory Lake",
                "href": "/profile/Cory-Lake-6"
            },
            "answer_text": "I would think that short films are like short stories - Incredibly difficult to do properly. In a feature film or novel, you have plenty of time to convey what you want, in the short form, you have to pack a great deal of information into every shot or page. It seams simple, but most find it very hard. For me, the best short stories or films have some sort of twist that really bindsides you and makes you want to read or see it again. Like a good magician, you must know how to use misdirection to make it look like a character’s actions mean “A” when, at the end, you find that it really meant “B”. Again, this is hard to do. To start, I would try to come up with common scenarios that you can turn on their heads. Situations where you can set the audience up so they expect one thing, but then deliver another. Please try to avoid the dour comment on the human condition or the crazy, art-house, student film with a person wearing a sheet standing on a goat in a canoe that is supposed to represent the loss of human empathy or something. Just tell a simple story - with a twist. Everyone likes to be fooled, and, if you can set it up to seem to be “A” while letting the “clever” ones figure out that it is really “B” until you hit them with the fact that it is really “C”, then you have scored a home run! Everyone who sees it will want to share it with friends so they can enjoy other’s reactions. Next thing you know, you’ve gone viral and Spielberg is calling. (If that happens, don’t forget about me!) Basically, brainstorm ideas where you say to yourself “Here’s the situation, BUT…..” The “BUT” should completely flip the situation around. As an example… I had a friend who had a raw talent for short stories. He wrote one which had a female babysitter getting a random call from a guy she didn’t know. She agreed to let him come over, They started making out…. (At this point I was shaking my head. I had read many of his other truly excellent stories and thought he had taken a hit to the skull). Then the guy whips out a machete and takes a swing! The girl dodges and runs. (Again, I shook my head…. but kept reading….) Turns out he was a serial killer who picked his victims by making random calls from burner phones and seeing who he could convince to invite him over. (Ok, kinda neat, but…… “meh”) As he is hunting the house for her, he finds the bodies of the family! She was a serial killer, too, who got her victims by answering ads for babysitting when the parents were desperate (Yes, reaching, but by this time the sheer silliness of it had me hooked) The story was actually very well written and had a further twist at the end. It was not his best work, but was pretty neat (and the first example that came to mind) For other examples, The Others & Sixth Sense come to mind. Both of these features could have been short films (especially The Others) (that is not a dis on the films…. I am simply saying they both could have worked as short films). The basic ideas are: “The house is haunted, BUT……” and “A kid is seeing a shrink because he can see dead people, BUT…..” For that matter, also watch The Other with Uta Hagen. (Somebody really needs to remake that!) Anyway, I’ve gone on long enough. Good luck! Let me know when you post your film to YouTube! ",
            "date": "Updated May 13, 2020",
            "views": "117",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Dani Sav",
                    "user_href": "/profile/Dani-Sav"
                },
                {
                    "user_id": "Prajwal Nayak",
                    "user_href": "/profile/Prajwal-Nayak-18"
                }
            ]
        }
    ]
}