{
    "title": "What are some good stories on mother and son relationships? - Quora",
    "tags": [
        "Mother-Son Relationships",
        "Motherhood",
        "Storytelling",
        "Creative Writing",
        "Relationships",
        "Mothers",
        "Writing"
    ],
    "response": [
        {
            "author_info": {
                "name": "April D. Bennett",
                "href": "/profile/April-D-Bennett"
            },
            "answer_text": "Days after my husband and I learned that our son, our only child, has tuberous sclerosis, we were contacted by another mom who had a fourteen year old son with the same disease. She was nice and kind. She went on to tell me about her son. He had never spoken, and still hasn’t to this day. He understood everything that was said to him, he just didn’t have the ability to process it and get words formed and out of his mouth. I enjoyed talking to her, if anything, her attitude was contagious. I knew before the call that I would love my son no matter what he accomplished. After this phone call my mind started spinning. I had to have a plan. What is the next step for my son. We enrolled him into a early intervention program, even if it was for just a few months, before me relocated to another state. Once we moved and got settled, I moved to the next step of my plan. I enrolled in classes at the local community college. In those classes I learned sign language. I was dead set on giving my son the tools to communicate with us (his parents) at any cost. It was glorious watching him soak up this language. He began to tell us what he wanted, more, finished, drink, cookie…etc. Nothing was sweeter to my ears…I mean eyes! Suddenly, after his second birthday, he just started talking! It was as if he was waiting to be an expert before he started. I didn’t really care, I was just thrilled he started talking. Now twenty-two years later, he hasn’t shut up! That’s ok, he is an amazing young man that is excelling at life at his own pace. I will forever be his biggest cheerleader and advocate! That is how my son and I roll! ",
            "date": "Answered October 22, 2019",
            "views": "301",
            "upvotes": " View 52 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Dag Robertson",
                    "user_href": "/profile/Dag-Robertson"
                },
                {
                    "user_id": "Sam Dsouza",
                    "user_href": "/profile/Sam-Dsouza-33"
                },
                {
                    "user_id": "Diane Jelf",
                    "user_href": "/profile/Diane-Jelf"
                },
                {
                    "user_id": "ER Powers",
                    "user_href": "/profile/ER-Powers"
                },
                {
                    "user_id": "Adnan Karimjee",
                    "user_href": "/profile/Adnan-Karimjee"
                },
                {
                    "user_id": "Mark Parklin",
                    "user_href": "/profile/Mark-Parklin"
                },
                {
                    "user_id": "Lance James",
                    "user_href": "/profile/Lance-James-24"
                },
                {
                    "user_id": "Mary Ann Tucker",
                    "user_href": "/profile/Mary-Ann-Tucker-6"
                },
                {
                    "user_id": "Jon Taverner",
                    "user_href": "/profile/Jon-Taverner"
                },
                {
                    "user_id": "Marc Griffies",
                    "user_href": "/profile/Marc-Griffies-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Arushi Vats",
                "href": "/profile/Arushi-Vats-4"
            },
            "answer_text": "Her son was crying badly tonight.The girl of his dreams had vanished from his life.Everyone was excited for his engagement especially him but things turned out upside down.His to be bride never appeared for the mega event.The daughters parents were asked in numerous questions about her disappearance.The real life appeared like a movie where the girl didn't turn up.People present there anticipated that she must have had a boyfriend and that could be the sole reason why she disappeared.He didn't believe in anyone and kept waiting for her,thinking she would appear. But she never did.Nobody had any clue where she would go,what happened to her.Days passed without any news of her.He began blaming himself for her disappearance.His mother couldn't take the emotional toll he was going through.The agony which was burning him inside tormenting his soul. His mother knew how badly he loved her so she began searching for the missing girl everywhere.Until after few days,she came to know that the girl was diagnosed with cancer recently and due to which she had committed suicide without anyone being aware of.She consoled his son.Motivated him to move on. When things became normal,one day his son asked, “Mom,why did you tell me the truth about her?If you had wanted you could have lied to me” “A lie could have wrecked your mind and soul if you would have got to know about it later on your own but the truth made you help become stronger.” “What important is how you face the reality,Tragedy occurs in everyone's lives but how you deal with it is important.Those consequences of the tragedy is in your hands,whether you want to stay in your past or push yourself to make a better future.” She said. “ Your love is truly unconditional mother,Thank you” He said “Oh dear!Enough of emotional talks,now get going already for your work.” She chuckled. ",
            "date": "Answered October 16, 2016",
            "views": "76",
            "upvotes": " View 10 Upvoters",
            "upvoters": [
                {
                    "user_id": "Subhankar Sen",
                    "user_href": "/profile/Subhankar-Sen-4"
                },
                {
                    "user_id": "Rahul Dhanuka",
                    "user_href": "/profile/Rahul-Dhanuka-4"
                },
                {
                    "user_id": "Priyanka Parhi",
                    "user_href": "/profile/Priyanka-Parhi-2"
                },
                {
                    "user_id": "Mee Singh",
                    "user_href": "/profile/Mee-Singh"
                },
                {
                    "user_id": "Devendra Sahoo",
                    "user_href": "/profile/Devendra-Sahoo"
                },
                {
                    "user_id": "Allwyn Fernandes",
                    "user_href": "/profile/Allwyn-Fernandes-42"
                },
                {
                    "user_id": "Crown Afrika",
                    "user_href": "/profile/Crown-Afrika"
                },
                {
                    "user_id": "Mahejabeen Kousar",
                    "user_href": "/profile/Mahejabeen-Kousar"
                },
                {
                    "user_id": "Faisu Basha",
                    "user_href": "/profile/Faisu-Basha"
                },
                {
                    "user_id": "Manish Joshi",
                    "user_href": "/profile/Manish-Joshi-211"
                }
            ]
        }
    ]
}