{
    "title": "What are some examples of rhetorical questions? - Quora",
    "tags": [
        "Rhetorical Questions",
        "Rhetoric"
    ],
    "response": [
        {
            "author_info": {
                "name": "Shiva Badola",
                "href": "/profile/Shiva-Badola"
            },
            "answer_text": "Rhetorical Questions with Obvious Answers Is the pope catholic? Is rain wet? You didn't possibly think I would say yes to that did you? Do you want to be a big failure for the rest of your life? Does a bear poop in the woods? Can fish swim? Can birds fly? Do dogs bark? Do cats meow? Do pigs fly? Is hell hot? Are you stupid? There is no point, is there? Is there anyone smarter than me? Can we do better next time? Do you want to be a success in this world? Is this supposed to be some kind of a joke? Are you kidding me? Do liars lie? Rhetorical Questions That Have No Answers What is the meaning of life? Why do we go on? What's the matter with kids today? There's no hope, is there? How much longer can this injustice continue? How many times do I have to tell you not to yell in the house? Why me? But who's counting? Who cares? Why bother? How should I know? Could I possibly love you more? When a Rhetorical Question Would be Asked Your girlfriend asks if you love her. You say \"Is the pope catholic?\" to suggest that it is obvious you love her. A parent is arguing with a child about the importance of good grades. The parent says \"Do you want to live at home in the basement for the rest of your life?\" Two men are having a disagreement in a bar. One says \"Do you want me to punch you in the face?\" A woman tells her husband she is pregnant and shows him the pregnancy test. He says \"Are you serious?\" A student fails to bring in his homework assignment. The teacher keeps him after class and says \"Can we do better next time?\" A boss is yelling at his staff member for a major mistake. He says \"Do you want to get fired?\" A child is asking for a very expensive toy. His parent says \"Do you think that money just grows on trees?\" A friend asks if you like hamburgers, which are your favorite meal. You say \"Is rain wet?\" Read more at Rhetorical Question Examples ",
            "date": "Answered July 28, 2016",
            "views": "10",
            "upvotes": " View 11 Upvoters",
            "upvoters": [
                {
                    "user_id": "Yash Raj Singh",
                    "user_href": "/profile/Yash-Raj-Singh-43"
                },
                {
                    "user_id": "Vaibhav Kashyap",
                    "user_href": "/profile/Vaibhav-Kashyap-78"
                },
                {
                    "user_id": "Yubhav Seth",
                    "user_href": "/profile/Yubhav-Seth"
                },
                {
                    "user_id": "Bratu Claudia Rozi",
                    "user_href": "/profile/Bratu-Claudia-Rozi"
                },
                {
                    "user_id": "Saurabh Singh",
                    "user_href": "/profile/Saurabh-Singh-109"
                },
                {
                    "user_id": "Katey Rozelle",
                    "user_href": "/profile/Katey-Rozelle"
                },
                {
                    "user_id": "Shubham Gupta",
                    "user_href": "/profile/Shubham-Gupta-109"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/Nice-Guy-35"
                },
                {
                    "user_id": "Aashirya Kumari",
                    "user_href": "/profile/Aashirya-Kumari"
                },
                {
                    "user_id": "Abhishek Gunawat",
                    "user_href": "/profile/Abhishek-Gunawat"
                }
            ]
        },
        {
            "author_info": {
                "name": "Donald Larter",
                "href": "/profile/Donald-Larter-1"
            },
            "answer_text": "Perhaps you’re thinking of the term rhetorical question, which is what a speaker asks an audience without expecting them to respond. As for a rhetorical statement, virtually every statement is in some sense rhetorical, since the person who utters the statement 1) wants someone to listen to what’s being said (whether an audience of one or a thousand and one) ; 2) is attempting to inform, inspire, and/or persuade someone of something; or 3) is initiating a dialog with someone and therefore wants and/or expects an interlocutor to respond in some way to what’s being said. Every statement comprises a selection from reality, a reflection of reality, a deflection from reality, and a distortion of reality. To the extent the statement is crafted for maximum effect, the statement will be more overtly rhetorical. I suggest, however, most people most of the time do not craft their statements for maximum effect, except perhaps when they want something out of someone! Some exceptions might include folks who are “natural” teachers, preachers, persuaders, inspirers, or entertainers. ",
            "date": "Answered September 4, 2016",
            "views": "9",
            "upvotes": " View 6 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Yash Raj Singh",
                    "user_href": "/profile/Yash-Raj-Singh-43"
                },
                {
                    "user_id": "Jackie Almeida",
                    "user_href": "/profile/Jackie-Almeida-6"
                },
                {
                    "user_id": "Eve Badía",
                    "user_href": "/profile/Eve-Badía"
                },
                {
                    "user_id": "Oun Kwon",
                    "user_href": "/profile/Oun-Kwon"
                },
                {
                    "user_id": "Richard Chiu",
                    "user_href": "/profile/Richard-Chiu-11"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/Margaret-FalerSweany"
                }
            ]
        }
    ]
}