{
    "title": "What part of speech is the word “who”? - Quora",
    "tags": [
        "Parts of Speech",
        "English Linguistics",
        "Speech",
        "Sentences (language)",
        "Learning English",
        "Vocabulary of the English Language",
        "Linguistics",
        "Grammar",
        "English Grammar"
    ],
    "response": [
        {
            "author_info": {
                "name": "Anil Bhosale",
                "href": "/profile/Anil-Bhosale-37"
            },
            "answer_text": "The word “who” is both an Interrogative pronoun and a Relative pronoun. It is in Nominative Case and is used for both singular and plural number 1) Who is there? / Who are you? ( Here, the word “who” is used to ask the questions, therefore, it is called an Interrogative Pronoun.) 2) He is the man who won the lottery. (Here, the word “who” is used to bring relationship between two sentences, therefore, it is called a Relative Pronoun.) The Relative Pronoun “Who” has different forms for Accusative Case and Genitive Case. They are; 1) Nominative Case - who 2) Genitive / Possessive Case - whose 3) Accusative / Objective Case - whom [These different cases are used for both singular and plural alike.] Examples: 1) This is the boy (or girl) who works hard. These are the boys (or girls) who work hard. 2) This is the boy (or girl) whose exercise is done well. These are the boys (or girls) whose exercises are done well. 3) Thisi is the boy (or girl) whom all praise. These are the boys (or girls) whom all praise. ",
            "date": "Answered April 1, 2020",
            "views": "40",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Kelly Pomeroy",
                    "user_href": "/profile/Kelly-Pomeroy-2"
                }
            ]
        },
        {
            "author_info": {
                "name": "Paulla Fetzek",
                "href": "/profile/Paulla-Fetzek"
            },
            "answer_text": "The word “who” is a pronoun. It takes the place of a person - either by specific name or general reference. Ex 1: Cara is running for the debate team. She’s someone who a lot of people think will get in. [The who here refers to Cara] Ex 2: Many people have many differences of opionion. Who’s to say they’re not all correct? [the who here refers to many people] All the best… ",
            "date": "Answered March 31, 2020",
            "views": "80",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Kelly Pomeroy",
                    "user_href": "/profile/Kelly-Pomeroy-2"
                },
                {
                    "user_id": "Doug Hughes",
                    "user_href": "/profile/Doug-Hughes-3"
                },
                {
                    "user_id": "Elaine Whinston",
                    "user_href": "/profile/Elaine-Whinston"
                }
            ]
        }
    ]
}