{
    "title": "What are some similes to describe a smile? - Quora",
    "tags": [
        "Similes",
        "Descriptions",
        "Poetry",
        "Literature",
        "Happiness"
    ],
    "response": [
        {
            "author_info": {
                "name": "Cheyne Allen",
                "href": "/profile/Cheyne-Allen-1"
            },
            "answer_text": "Here are a few dozen with attribution: The smiles of his dark-blue eyes sparkle like the sea when first lighted up by the rays of the sun. —Alciphron Smiled, as mountains smile to see the spring. —Ancient Ballad of Hindustan Her smiles were like the glowing sunshine. —Serbian Ballad Her smile was like a summer morn. —Robert Burns Smile as gay as th’ sun o’ th’ May. —Alice Cary Charming smiles thy beauteous face adorn,As May’s white blossoms gaily deck the thorn. —Thomas Chatterton Smiles … sweet as the flow’rs in bloom of spring array’d. —Thomas Chatterton A smile as fine as wine. —Frederick S. Cozzens ’Twould force a misanthrope to hang a smile upon his lip, as dewdrop on a thorn. —Michael Field Smile like the bloom of the morning. —Edward Octavus Flagg Smiles, like meteors of the night,Just give one flash of momentary light. —Walter Harte Smiles as thick on rosy lips as ripples on the sea. —Oliver Wendell Holmes A grim smile, like lion that has found a way of exit. —Victor Hugo Smile like morning gold. —Victor Hugo Her smile grateful as the dissolution of the ice. —Dr. Samuel Johnson Wan smiles flickered, like the northern dawn, across her worn cheeks’ ice-field. —Charles Kingsley He strove to clothe his agony in smiles,Which he would force up in his poor pale cheeks,Like ill-timed guests that had no proper dwelling there. —Charles Lamb The smiles which play on my cheek in public are to my heart as moonbeams falling on some rock of ice; they shine, but warm not. —Matthew Gregory Lewis Capacious … smile, like the exaggerated reflection of a concave mirror. —Samuel Lover A half smile, like the moonlight of laughter, dawned on her face. —George MacDonald Her smile as sunshine on a ripening land. —Gerald Massey Its smile is as a thankful hymn. —Gerald Massey Her smile—it was like the golden winePoured in the spirit, as in a cup. —Owen Meredith Thy smiles, like sunflowers in the golden light they love. —Henry Hart Milman Childhood … smiles, like glimpses of heaven. —Donald G. Mitchell Smile like sunlight in a rippling sea. —Lewis Morris Her smile is like the noon-splendor of a day of June. —James Whitcomb Riley As a meteor bright, As a comet bright,Was her smile of pearl and spray. —Francis S. Saltus How like the dewdrops on a drooping flower are smiles from gentle eyes. —John G. Saxe Smiles, which spread like radiance from the cloud-surrounded moon. —Percy Bysshe Shelley A half smile hovering round her happy lips like a bright butterfly around a flower. —Alexander Smith Smile … like sunshine opening through a shower in vernal skies. —Robert Southey A smileSweet as good Angels wear when they presentTheir mortal charge before the throne of Heaven. —Robert Southey Smile, it was like sunshine in a shady place. —Robert Louis Stevenson Crimson smile,Like seas hid by a meadow-land. —Trumbull Stickney Smiles more sweet than flowers. —Algernon Charles Swinburne A smile that was like sunrise on a sea strewn with wreckage. —Edith Wharton Her smile is as a listening child’sWho hears its mother’s call. —John Greenleaf Whittier A smile which cheered—like the breaking day. —John Greenleaf Whittier A smile as joyous, frank, and innocentAs that with which a babe awakes from sleep. —Sarah Williams Around the lips a smile played like the shadow of a silver cloud upon a sunlit stream. —James. C. Wilson A smile … as sleeps a sunbeam on a stone. —William Winter An innocent smile, like a sunbeam kissing a velvet rose. —William Winter ",
            "date": "Answered January 21, 2020",
            "views": "64",
            "upvotes": " View 5 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Marcus Lee",
                    "user_href": "/profile/Marcus-Lee-374"
                },
                {
                    "user_id": "Izzatul Najihah",
                    "user_href": "/profile/Izzatul-Najihah-1"
                },
                {
                    "user_id": "Germaine Ng Zhi En",
                    "user_href": "/profile/Germaine-Ng-Zhi-En"
                },
                {
                    "user_id": "Ruby Fitzgerald",
                    "user_href": "/profile/Ruby-Fitzgerald-6"
                },
                {
                    "user_id": "Christian Avery",
                    "user_href": "/profile/Christian-Avery-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Lillian Wood",
                "href": "/profile/Lillian-Wood-26"
            },
            "answer_text": "Her smile was bright and clear like white glassHer smile glowed like the moon, eerily beautifulI felt the warmth of her smile wash over me like the sun’s raysHer smile was eerie and haunting, like an image in a broken mirrorShe smiled like a cat playing with a mouse, and fear shot through my heartHer smile was refreshing, like spring rain on winter grassHer smile was crooked and dirty like the pirate ship she stepped off of",
            "date": "Answered October 10, 2020",
            "views": "631",
            "upvotes": "0"
        }
    ]
}