{
    "title": "What would you write to yourself? - Quora",
    "tags": [
        "Self-Awareness",
        "Creative Writing",
        "Writing Advice",
        "Writing",
        "Hypothetical Scenarios",
        "Psychology of Everyday Life",
        "Philosophy of Everyday Life",
        "Human Behavior"
    ],
    "response": [
        {
            "author_info": {
                "name": "Abhishek",
                "href": "/profile/Abhishek-Abhi-1352"
            },
            "answer_text": "Dear Abhi, Never feel alone i am with you and will support you forever Never trust anyone all are hypocrites , they have shown their true colors when you needed them I know their was a time when people , your classmates , even teachers laughed at you because you were too innocent just like nobita I know how bad you have felt that time , the way you were bullied by students 😓 the pain was unimaginable for me. I just want you say one thing Please don't be too innocent , never feel bad to shed your emotions Crying is not a sign of weakness - Having a beard or muscle never makes someone a man You are pure by heart , the way you help others through your inspirational articles or spread smile by cracking jokes(without even taking credit ) i really appreciate your initiative of uplifting others Be ready for future You will find cheaters ,haters , hypocrites everywhere beware of them You are really very talented & hardworking person i ever met . Feel free to share with me whenever you feel alone I will be available for you Remember one thing If no one believes you I believe in you. You are my star you will surely shine ❤️💙 Be strong 🤗 I am happy that you have improved a lot 🤗 Take care ",
            "date": "Answered June 25, 2020",
            "views": "213",
            "upvotes": " View 6 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Sreyan Pattnaik",
                    "user_href": "/profile/Sreyan-Pattnaik-1"
                },
                {
                    "user_id": "Bhaskar Vats",
                    "user_href": "/profile/Bhaskar-Vats-3"
                },
                {
                    "user_id": "Sathiya Lakshmi",
                    "user_href": "/profile/Sathiya-Lakshmi-20"
                },
                {
                    "user_id": "Anagha Sunny",
                    "user_href": "/profile/Anagha-Sunny-1"
                },
                {
                    "user_id": "Neha Singh",
                    "user_href": "/profile/Neha-Singh-7607"
                },
                {
                    "user_id": "Yasha Kamble",
                    "user_href": "/profile/Yasha-Kamble"
                }
            ]
        },
        {
            "author_info": {
                "name": "Perry Charles",
                "href": "/profile/Perry-Charles-1"
            },
            "answer_text": "Dear Little Perry, By the time you get this letter you’ll either be in your suicidal phase, or your depression phase. But I just want you to know something. Even though your struggling, and everything sucks, and you get bullied think positively. As mom would say: “There just jealous of you” so calm your ass down and don’t do it. Now you're probably thinking “They won’t know, only one person knows” well that one person will eventually call the cops to your house. Then you’ll go to a mental hospital, where their going to ask you all sorts of questions, and then make you leave. And even if you did do it, do you think of what you’d do to Melanie? She’s depressed too, but you killing yourself might just end her life as well. She’s your only best friends, your her only boy best friend who’s actually there for her. So you ending your life is a big no-no, and plus next year you’ll be considered a bit cooler than now. And sure you’ll probably not believe that but believe it, because I currently am loving my life and don’t want to disappear because you killed me. Or is it because I killed me? Either way don’t do it. Anyways I think this letter is pretty long, don’t you? My fingers are getting tired and I have to finish my homework for online classes. It feels good to know that you’ll get this letter and you’ll stop all this suicidal non-sense. Your Greatest Friend, Yourself ",
            "date": "Answered March 20, 2020",
            "views": "471",
            "upvotes": " View 6 Upvoters",
            "upvoters": [
                {
                    "user_id": "Rydia Shaw",
                    "user_href": "/profile/Rydia-Shaw-13"
                },
                {
                    "user_id": "Alyssa Shick",
                    "user_href": "/profile/Alyssa-Shick-1"
                },
                {
                    "user_id": "London Miscolci",
                    "user_href": "/profile/London-Miscolci"
                },
                {
                    "user_id": "Kristen Lang",
                    "user_href": "/profile/Kristen-Lang-13"
                },
                {
                    "user_id": "Ethan Wing",
                    "user_href": "/profile/Ethan-Wing-3"
                },
                {
                    "user_id": "Kong Thao",
                    "user_href": "/profile/Kong-Thao-11"
                }
            ]
        }
    ]
}