{
    "title": "What makes you feel happy and sad? - Quora",
    "tags": [
        "Developing and Maintaining Happiness",
        "Happiness",
        "Understanding Emotions"
    ],
    "response": [
        {
            "author_info": {
                "name": "Hemanth Akhil Kasturi",
                "href": "/profile/Hemanth-Akhil-Kasturi"
            },
            "answer_text": "Well, for most of the people who are in youth, falling in love might make you feel both happy and sad at few unstable situations. For grand old people, seeing their sons, daughters and grandchildren make money and move forward to live a modern life leaving them might make them happy and sad too. But for me, the case is different. I don’t know whether you people feel better with me or not. But, it is my point of experiencing few things in life. As a decent student of my college, I have always shown interest in my study of engineering. And I hope a lot to show that same interest further. But, I still get confused when I get to know that tomorrow is my exam and wtf am I writing here!? I feel that when I write, I remove the unwanted too. So…. In life, many things make you feel happy. Those stay as cute and sweet memories forever. But those which are sad are opt to be forgotten and need to got to know about taking bold decision to move forward. There is still one situation in my life, where I get to be confused to know whether I am happy or sad. In fact, from the question, I could say that I am both happy and sad, may be! FRIENDS are the most key elements of everybody’s life. Without this friendship, it would be like eating your dish without a plate. It would be like standing on the corner of a top of a topmost mountain and pondering about our existence. In my B.Tech. life, this word named FRIENDSHIP, has changed its domain and its characteristics. When I got to mingle with a group of people where one person was a topper girl, one was a decent girl, one was a make-up type girl, one was a sportsman, one was a flirt type guy and few other three guys. In total, there were 8 friends whom I gradually used to mingle with them. Our friends circle was too smart, jovial and an attractive one! As time passed by, one boy started to show interest in a girl in our group. Unfortunate or fortunate, whatever it might be, that guy was the closest of all to me and that girl was the closest of all girls to me. His interest towards that girl was quite good and appreciable, for she looked great in talent and behaviour. He seeked my helped to approach her. I helped him. (I don’t want to go to details much, since I don’t like writing essays here or in disclosing some facts!). That girl was so close to me that she started telling her secrets to me. In my mind, I felt her like my sister since was the 100% reflection of my own blood-related sister. The situation of her telling me secrets of her life was mistook by the guy who was closest to me as ‘she was interested in me’. He started to abandon me. When I got to understand his problem, I told him that his thoughts are not right. In a project, where we three were kept a group, I always abandoned myself from them, so that I could give some time to them to share their views and thoughts and talk more deeper. Time passed and the trick worked. Both were in good relation but I don’t know whether both of them are aware of their feelings or not. But one thing that happened here was that both of them were trying to abandon me and I surely got to know about it. I tried myself a lot to explain to them at various circumstances that their relation was a HAPPY one to me and I am NOT a jealous person in this matter. I really wanted to see them unite. But what made me sad was I need to sacrifice myself for their relation. Eventually, I came to know that I was being abandoned by not just two of them but by the whole group, I then came to understand that the closest-guy did some mischief. It is completely ok to do that! I am not feeling bad for that, but he didn’t even spoke to me once he started speaking to her. Has this guy USED me? Well, I leave it to the reader’s point of view. Now tell me, should I feel happy that my trick worked or should I feel sad, for I lost the world’s best friends of my life? Each and everyone were special to me! It was at this juncture that I came to understand about human behaviours. Then, I made myself a bold decision to not to speak to them never ever again. And until this day, I didn’t speak anything with them. When the decent girl asked me - “Why did you choose a way to leave everybody? Who will appreciate you when you will succeed?” - I answered one simple thing to her - “Thanks for your favour. I did choose a lonely way. If for you success is to receive appreciation from people around you, let it be! For me, success is rejuvenating my inner self. For me, success is satisfying my soul and telling it that all relations in this world are temporary and you (the soul) are permanent!” Remember reader, it takes a complete life to understand whom you need to relate yourself actually and know the reason for your existence. If you strive to know about it much faster, you would surely get it much faster. THINK! ",
            "date": "Answered April 19, 2017",
            "views": "21",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Sebastian Bekkersted Grobry",
                    "user_href": "/profile/Sebastian-Bekkersted-Grobry"
                }
            ]
        },
        {
            "author_info": {
                "name": "Manan Pandya",
                "href": "/profile/Manan-Pandya-34"
            },
            "answer_text": "It was raining. It had been for the past 20 hours. The streets were flooded. I was comfortably sitting on my couch watching it all on television until I hear my mom shout. She catches me off guard lying lazily. Instantly I'm reminded of the previous mistakes I've done in about all my lifetime and on goes a lecture. I had planned to enjoy the weather with a book and some coffee. Instead I was guilty tripped into doing daily chores. So I end up driving mom to a nearby supermarket as she wanted to buy some stuff. As I was sitting in the car, I saw an old man standing beside a banana cart with nothing but a plastic bag put on his head, protecting him from the torrential rain. He looked dejected. Nothing screams louder than the look of defeat on grown man's face. I don't know why but I felt a sudden urge to talk to him. I get out of the car and stand beside him. Me: Heavy rains today! The water crisis will be solved. Him: Yes. But it's a little too much. Many of us are troubled by it. I instantly regretted saying that. He was a daily worker and he was probably suffering huge losses due to the rain. Me: Yes. By the way can I get some bananas? Him: Sure take you pick. Aftet buying some I ask him why doesn't he go home in this bad weather. Him: What to do son. To tell you the truth, you are the first person to buy from me today. I still need to sell a few more so that I can feed my family. I was emotionally touched at this point. Here I was, just lazily sitting around in my comfortable home taking everything for granted while people suffered to even have basic necessities. I walk up to mom and ask her to buy some more bananas from that guy. The guy was genuinely relieved when he sold a few more to my mom. As I drive away from that place I notice him smiling. I was happy to have temporarily relieved him from that situation. I was humbled by the lesson life threw at me. We talk about our being hard but in all reality that is nothing compared to what hundreds of people face everyday. ",
            "date": "Answered July 15, 2017",
            "views": "31",
            "upvotes": " View 16 Upvoters",
            "upvoters": [
                {
                    "user_id": "António Viegas",
                    "user_href": "/profile/António-Viegas-6"
                },
                {
                    "user_id": "Gaurav Murali",
                    "user_href": "/profile/Gaurav-Murali-1"
                },
                {
                    "user_id": "Sena Guno",
                    "user_href": "/profile/Sena-Guno"
                },
                {
                    "user_id": "Dharmik Vasani",
                    "user_href": "/profile/Dharmik-Vasani"
                },
                {
                    "user_id": "Nirusha Nayak",
                    "user_href": "/profile/Nirusha-Nayak"
                },
                {
                    "user_id": "Dhruv Sachdev",
                    "user_href": "/profile/Dhruv-Sachdev-5"
                },
                {
                    "user_id": "Anubha Jose",
                    "user_href": "/profile/Anubha-Jose"
                },
                {
                    "user_id": "Dhairya Shah",
                    "user_href": "/profile/Dhairya-Shah-40"
                },
                {
                    "user_id": "Mounika Pochampally",
                    "user_href": "/profile/Mounika-Pochampally"
                },
                {
                    "user_id": "Rathin Kothiya",
                    "user_href": "/profile/Rathin-Kothiya-1"
                }
            ]
        }
    ]
}