{
    "title": "What method does I use to write 5,000 words a day? - Blogging And Marketing - Quora",
    "tags": [
        "Blog Writing",
        "Methods",
        "Creative Writing",
        "Blogging",
        "Writers and Authors",
        "Writing Advice",
        "Writing",
        "Wanting and Making Money",
        "Books"
    ],
    "response": [
        {
            "author_info": {
                "name": "Aamir Kamal",
                "href": "/profile/Aamir-Kamal-2"
            },
            "answer_text": "To Write 5,000 words every day, here is the template I use. This template will help you to write faster and longer content on a daily basis. Here how it works; On the very first day write 500 words.Every day, double the number of words you write.On the 5th day, you will achieve your 5,000 words a day mark.Stick with the ROUTINE.Let me tell you my story; When I started my own blog, most of the articles were just 300 to 400 words. If you are writing online then you might know that you can’t get ranked on Google with a post that has only 300–400 words. But, the thing to learn here is that “To Write” But now, I can easily write 3,000 to 5,000 words articles in a blog post. Everything comes to don’t quiet writing every day and continuous improvement. There are a lot of people who have this problem of not finding more words to add to their articles but the trick is to always look for new information, something that changes the reader's perspective about a certain topic. As Albert Einstein once said; “Once you stop learning, you start dying” I hope this will helps. ",
            "date": "May 27, 2020",
            "views": "142",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Mohammad Bhuiyan",
                    "user_href": "/profile/Mohammad-Bhuiyan-2"
                }
            ]
        },
        {
            "author_info": {
                "name": "Pepper Lowe",
                "href": "/profile/Pepper-Lowe-2"
            },
            "answer_text": "If you’re normally used to writing, for example, 1,000 words a day, you may want to consider working up to 5,000 gradually instead of tackling it all at once. It’s kind of like running. A lot of people who want to start running set really high and unrealistic goals, such as “I’m going to run 5 miles a day.” So on their first attempt, they find that it’s impossible to run more than 1 mile, and they end up frustrated and more likely to quit. To get used to writing a lot, you can practice by writing on platforms like this one. That way you can improve your speed in both writing and thinking ",
            "date": "May 26, 2020",
            "views": "118",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Aamir Kamal",
                    "user_href": "/profile/Aamir-Kamal-2"
                }
            ]
        },
        {
            "author_info": {
                "name": "Nina Moss",
                "href": "/profile/Nina-Moss-2"
            },
            "answer_text": "I personally would set a target to sit down one a day to write, starting with a minimum of 500 words. Make sure you have access to a variety of writing prompts for the days when the blank page seems to be winning, sometimes there is nothing worse than a blank page. Then you can increase the minimum number of words that you are writing ever 3 days by 100 words, but only use these as a minimum, if you are in the zone and really feeling the groove, with the words flowing onto the page like a majestic swan from you fingertips, then go with it until you feel like you want to stop. Make sure you celebrate the wins. Even if you don’t meet your target, celebrate something about the work you have done. If you don’t make your target one day, that’s fine. Forgive yourself and remember that tomorrow is a new day to try again. I hope this helps. ",
            "date": "May 26, 2020",
            "views": "97",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Aamir Kamal",
                    "user_href": "/profile/Aamir-Kamal-2"
                }
            ]
        }
    ]
}