{
    "title": "What was your experience with cocaine addiction? - Quora",
    "tags": [
        "Former Drug Addict",
        "Crack Cocaine",
        "Illicit Drug Addiction",
        "Cocaine",
        "Substance Abuse",
        "Drug Effects",
        "Addictions",
        "Recreational Drugs"
    ],
    "response": [
        {
            "author_info": {
                "name": "Rick Klugman",
                "href": "/profile/Rick-Klugman"
            },
            "answer_text": "It sucked! Major big time. George Carlin once said, “The only thing cocaine makes you wanna do, is do more cocaine”. I never understood its appeal, yet I kept shoveling that shit up my nose in ever increasing amounts. It started with me chasing the dragon of a methamphetamine high. Back in the late 80′s, you couldn't turn around without somebody shoving a straw up your nose and falling into a pile of it. I loved that stuff! It would make me feel ten feet tall and bulletproof. I was invincible on it. It was cheap, and plentiful. There was just one problem. What do you do when your sole supplier closes up shop and goes out of business? In the late 80s, the Pagan Motorcycle Club had a monopoly on meth in southeast Pennsylvania. So tight was their hold on the market, that even the mob wouldn't fuck with them. At some pont the Warlocks wanted a piece of that pie, and all hell broke loose. Gunfights in the street, clubhouses were getting burned to the ground. It was making Philly's Finest look really bad. Something had to be done, and it was. A multi-agency task force forced both clubs out of town. Where it was once so plentiful, now you couldn't buy a line of crank for love nor money. It completely dried up. The drug trade hates a vacuum. Enter cocaine. It wasn't as cheap, but it was plentiful. The weekends were never the same after that. Cocaine started showing up all over the place and it was all or nothing. So, being the addict that I was, I did it. It just made me paranoid so I would knock back a few beers to shave the edge off. And, this is the insanity of drug addiction, you keep doing the same thing over and over again, but expecting different results. I was convinced that the next line would not be as bad as the last, but it always was. I was already a functioning alcoholic at that point, but the coke kicked it into high gear. I was no longer 10 feet tall and bulletproof, I had become a slave to the cocaine. The only thing that mattered was the next line and how it was going to get it. So, in my infinite wisdom, I started selling it. How'd that work out for ya, Mr. K.? Not too good, thanks for asking. I had broken two of the major Commandments of drug dealing, I had become my own best customer. And was dealing on credit. I was now a thousands of dollars of debt to people who had no sense of humor. I stopped making my company’s bank deposits in an effort to catch up and was getting caught with my hands in the till, literally. These were also people whose last names ended in a vowel, with no sense of humor. Credit cards? As many as I could get, all maxed out. In what I can only define as divine intervention, I was told by two reliable sources that I was on my township's Police Department watch list. I was literally scared straight. What are the chances of a middle-class, Jewish white boy surviving in prison? With those credentials I wouldn't even be able to join a gang for protection. My wife also had my bags packed and asked me to leave. I had nowhere to turn. My life was shit. On May 20th, 1989 I held a going-out-of-business sale and hoped that it wasn't too late. What I couldn't snort, sell, or give away, I flushed. On May 21st, 1989 I attended my first 12-step meeting and attended at least one meeting a day without missing a day for the next four hundred some odd days. When my wife saw that I was making an honest effort to get clean, she allowed me to move back in. I laid everything on the line to my parents who lent me the money to pay off my dealers and bring the company till up to date providing I got and stayed clean. The credit cards had to wait. By my own account I left somewhere between $3-$5,000 out on the street. ",
            "date": "Answered March 10, 2019",
            "views": "47",
            "upvotes": " View 165 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Abigail Hoffman",
                    "user_href": "/profile/Abigail-Hoffman-13"
                },
                {
                    "user_id": "Puneet Negi",
                    "user_href": "/profile/Puneet-Negi-13"
                },
                {
                    "user_id": "Hemelton Matlonya",
                    "user_href": "/profile/Hemelton-Matlonya"
                },
                {
                    "user_id": "Pablo Esteban Aguilar Castro",
                    "user_href": "/profile/Pablo-Esteban-Aguilar-Castro"
                },
                {
                    "user_id": "Jason Black",
                    "user_href": "/profile/Jason-Black-258"
                },
                {
                    "user_id": "Spencer Byrne",
                    "user_href": "/profile/Spencer-Byrne-1"
                },
                {
                    "user_id": "Oliver Ashmore",
                    "user_href": "/profile/Oliver-Ashmore-2"
                },
                {
                    "user_id": "Akshay Thakur",
                    "user_href": "/profile/Akshay-Thakur-4"
                },
                {
                    "user_id": "Jasmine Prezeau",
                    "user_href": "/profile/Jasmine-Prezeau"
                },
                {
                    "user_id": "Dominic Schmitt",
                    "user_href": "/profile/Dominic-Schmitt"
                }
            ]
        },
        {
            "author_info": {
                "name": "Alex Adams",
                "href": "/profile/Alex-Adams-287"
            },
            "answer_text": "I was the archetypal coke head, out and partying, girls money a business. But it’s shallow, hollow fake and meaningless. I won’t lie there are good times, and my life is what it is. It gets to stage where you don’t want to party, you want to do coke alone, then feel like total shit for four days afterwards, convincing yourself you’ll never do it again then as you feel a bit better, off you go, it’s like being on a merry go round you can’t get off. The good thing is, when you come out of coke addiction, you can sort things out quite quick. It doesn’t leave that many lasting phycological effects, like I’ve seen with heroine or crack. So if you are struggling with coke then believe me, it’s worth getting off, there is def a light at the end of the tunnel. Be prepared to have a bit of a crap time of it for six weeks or so, fear, anxiety etc. It takes a little courage but it’s def worth it. It’s nasty shit really. ",
            "date": "Answered March 10, 2019",
            "views": "532",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Tom Eriksson",
                    "user_href": "/profile/Tom-Eriksson-10"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/The-griz-1"
                }
            ]
        }
    ]
}