{
    "title": "What are some of the most famous books written by Enid Blyton? - Quora",
    "tags": [
        "Enid Blyton (author)",
        "Book Recommendations"
    ],
    "response": [
        {
            "author_info": {
                "name": "Shruti Ganu",
                "href": "/profile/Shruti-Ganu"
            },
            "answer_text": "All these books are for slightly older children, say, ages 7 onwards, because that's when I began to read Enid Blyton. I may have left out a few things, but I wrote all this right iff the top of my head, and the length of the answer is sufficient to indicate how much I loved these books and how integral a part they were, of my growing-up years. I: THE ONES WITH CRIME SOLVING KIDS: 1)THE FAMOUS FIVE: It is a 21 book series about four cousins and their dog Timmy, who meet up every vacation and have an 'adventure'. They own an island and run into smugglers, goons, thieves and all kinds of criminals. Bravely solving crimes and always being on vacation, this lot was the envy of my childhood days. 2)THE SECRET SEVEN: This too, is a series of several books.It has a group of seven children who have a secret crime solving club. It takes a password to enter theimeetings and their main agenda is to solve local crimes. One of the members has a troublesome sister who adds to the fun. 3) THE FIVE FIND-OUTERS: They too, like the secret seven, solve local crimes. However, their modus operendi is to expise criminals by disguising themselves to get about.A nosy and egotistic cop called Theophilus Goon adds to the fun. 4)THE ADVENTURE SERIES: It is a 5-book series with five children, who go away on vacation and run into criminals, adventure, and danger. It is for slightly older children compared to the famous five (say 9-10 years +). The peculiarity is the presence of a parrot with the group. II:THE ONES SET IN BOARDING SCHOOLS: 1) ST.CLARE'S It's a series of books set in a boarding school called St.Clare's. The protagonists are the O'Sullivan twins, and their journey through boarding school, and all their experiences and misadventures are well-depicted. 2)MALLORY TOWERS It's quite similar to St.Clare's, except, here, the book revolves around a girl called Darrell Rivers, and the school has a saltwater swimming pool next to the sea. 3)THE NAUGHTIEST GIRL: This is set in a co-ed boarding school called whyteleaf and revolves around a rebellious girls called Elizabeth, who goes from being the Naughtiest girl in the school to a responsible young woman. ",
            "date": "Answered March 29, 2016",
            "views": "55",
            "upvotes": " View 7 Upvoters",
            "upvoters": [
                {
                    "user_id": "Charu Bhatnagar",
                    "user_href": "/profile/Charu-Bhatnagar-29"
                },
                {
                    "user_id": "Arkaraj Choudhary",
                    "user_href": "/profile/Arkaraj-Choudhary"
                },
                {
                    "user_id": "Ramya Soma",
                    "user_href": "/profile/Ramya-Soma-1"
                },
                {
                    "user_id": "Janine Blackburn",
                    "user_href": "/profile/Janine-Blackburn"
                },
                {
                    "user_id": "Laura Ru",
                    "user_href": "/profile/Laura-Ru-2"
                },
                {
                    "user_id": "Vishakha Zope",
                    "user_href": "/profile/Vishakha-Zope"
                },
                {
                    "user_id": "Rebecca Baldwin",
                    "user_href": "/profile/Rebecca-Baldwin-8"
                }
            ]
        }
    ]
}