{
    "title": "What should you do if Turnitin.com says that you had 100% plagiarism but you didn't copy anything from the internet? How would you explain that to your teacher? - Quora",
    "tags": [
        "Turnitin",
        "Plagiarism Detectors",
        "Academic Plagiarism and Cheating",
        "Plagiarism",
        "Teachers",
        "Teaching",
        "The Internet",
        "Hypothetical Scenarios",
        "Psychology of Everyday Life"
    ],
    "response": [
        {
            "author_info": {
                "name": "William Sager",
                "href": "/profile/William-Sager-2"
            },
            "answer_text": "You may not have copied text from the internet, but turnitin has found a 100% match. I doubt that turnitin is wrong, but it could have been that you copied something that was not “on the internet” (but since turnitin found it, then it probably is). Somehow there is a duplication. So you need to figure out how that duplication occurred. Turnitin will show the matching text and tell you where it came from. So if you want to protest innocence, you have to explain how this other text came about. It’s hard to imagine that you got exactly the same text (100% plagiarism) without copying something. The best case scenario is that some other student got your text, copied it, and turned it in first. That has happened in my classes. If the other student makes the same claim to innocence, it is impossible to tell who is truthful. In most universities, the student who gives the information to another student for the purpose of cheating is equally guilty. If your professor can’t tell, he or she may just say that you are both guilty. To prove your innocence, you must show that turnitin got it wrong (i.e., the evidence presented by turnitin is flawed) or that someone else stole your text. ",
            "date": "Answered June 7, 2019",
            "views": "21",
            "upvotes": " View 3 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Phillip Vassallo",
                    "user_href": "/profile/Phillip-Vassallo"
                },
                {
                    "user_id": "Reece Harvey",
                    "user_href": "/profile/Reece-Harvey-1"
                },
                {
                    "user_id": "Alex Simpson",
                    "user_href": "/profile/Alex-Simpson-211"
                }
            ]
        },
        {
            "author_info": {
                "name": "Jerry Lewis",
                "href": "/profile/Jerry-Lewis-10"
            },
            "answer_text": "If it’s 100%, you should have some idea about how that happened. One thing that hasn’t been suggested is did you submit the paper more than once. Depending on the settings, if you submitted the paper and it was evaluated by Turnitin, then submitted it again where you received the 100%, that would be an explanation. In that case, you should have a report from that previous submission, which you should show the teacher. Turnitin does show the sources for matches in the report, which you may have, and your teacher should have. If it is matching a submitted paper, it will show where the paper was submitted. If the paper were submitted at the same institution, it is possible that the teacher would be able to see who submitted it to which class, depending on Turnitin settings. If the paper were submitted elsewhere, that information would not be available. If you don’t have access to the report, you should request it, as well as asking where the matched information came from. ",
            "date": "Answered June 6, 2019",
            "views": "790",
            "upvotes": " View 3 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Bernard Glassman",
                    "user_href": "/profile/Bernard-Glassman-1"
                },
                {
                    "user_id": "Joe Smerdon",
                    "user_href": "/profile/Joe-Smerdon"
                },
                {
                    "user_id": "Nehaluddin Ahmad",
                    "user_href": "/profile/Nehaluddin-Ahmad-1"
                }
            ]
        }
    ]
}