{
    "title": "What's the hardest thing about writing poetry? - Quora",
    "tags": [
        "Writing Poetry",
        "Poems",
        "Poetry",
        "Creative Writing"
    ],
    "response": [
        {
            "author_info": {
                "name": "Lloyd Rees",
                "href": "/profile/Lloyd-Rees-7"
            },
            "answer_text": "Finding the objective correlative for the things you feel. I wrote a poem once where I compared my (not brilliant) marriage to a scalextric set. It worked in terms of the analogy of the pointlessness, tedium and occasional car crashes, but it wasn’t a very elegant metaphor. Poems should be perfectly crafted verbal devices, but also have many of the qualities of music. To answer your question: you can start with an image, a phrase or a feeling, but you need to simultaneously apply logic, emotion and an aesthetic sense to the crafting. It’s like swimming and climbing a mountain at the same time. ",
            "date": "Answered August 29, 2019",
            "views": "125",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Ian Colville",
                "href": "/profile/Ian-Colville-1"
            },
            "answer_text": "The hardest thing about poetry is an HB pencil or a metal biro tip or a plastic keypad key. The difficultest thing about poetry is rhyming with reason. I’m well aware that poems needn’t rhyme, but for many explorers of poetry, rhyming is important. It doesn’t have to be the-be-all-and-end-all, but if you’re into it, it’s important. For many others, it’s anathema, but that’s all right; there’s room for every taste - unless you’re a member of the thought police. Here’s the thing about rhyme; it is difficult. It’s easy enough to use a rhyming dictionary to find a list of rhymes for any word, but writing the right rhyme is not so easy. For some people, any old rhyme will do. If they have to corrupt the sense of the line or stretch the pronunciation to fit, or shift the words around (as in the use of anastrophe, the bastard hyperbaton) to get the rhyme to appear at the end, they remain carefree and content. To them, fair play. Finding the right rhyme is important. The right rhyme fits. The right rhyme makes sense. The right rhyme is rhythmic. The right rhyme means anti-rhymers won’t have a reason to criticise. The right rhyme means the rhyming word (wherever it appears) does not appear incongruous or forced, and does not elicit a groan from the reader (or listener). Practice it. It’s hard, but perseverance will be worthwhile. ",
            "date": "Answered April 20, 2018",
            "views": "388",
            "upvotes": " View 6 Upvoters",
            "upvoters": [
                {
                    "user_id": "George Lally",
                    "user_href": "/profile/George-Lally"
                },
                {
                    "user_id": "Olamilekan Adenusi",
                    "user_href": "/profile/Olamilekan-Adenusi"
                },
                {
                    "user_id": "Ray Sinclair",
                    "user_href": "/profile/Ray-Sinclair-2"
                },
                {
                    "user_id": "Sayyed Faisal Kamal",
                    "user_href": "/profile/Sayyed-Faisal-Kamal"
                },
                {
                    "user_id": "Sowmya",
                    "user_href": "/profile/Sowmya-231"
                },
                {
                    "user_id": "Ritu Dadheech",
                    "user_href": "/profile/ऋतु-दाधीच-Ritu-Dadheech"
                }
            ]
        }
    ]
}