{
    "title": "What are some good ways to write the beginning of a novel? - Quora",
    "tags": [
        "Novel Writing",
        "Writing Advice",
        "List Question"
    ],
    "response": [
        {
            "author_info": {
                "name": "Jody Lebel",
                "href": "/profile/Jody-Lebel"
            },
            "answer_text": "Where Do I Start? 12 Tips for a Great Beginning 1) Resist the temptation to start too early. Telling us about your character waking up, taking a shower and eating breakfast is not compelling reading. If your heroine is going to attend a party, begin the story as she enters the party not getting ready in front of a mirror combing her hair. Start the page at the first moment of conflict. Jump into your tale midstream. Also, avoid telling us what the character is wearing or eating or drinking unless it is important to the story or to character development. No one really cares, especially on the first few pages. 2) Choose a natural starting point and write your way into the story. A complicated tale may have many places it could start so pick the most interesting facet to begin. You need to hook your reader right to get the sale. If your story is about a man who is going to rob a bank, start with him handing the note to the teller. Don’t start with his problems in high school and how he married the wrong woman and how he recently got fired from his job and what let up to his decision to rob this bank. Those details are important and will flesh out your character, as well as show his motivation, but work them in a little at a time as back story. Avoid info dump; that is, flooding the reader with details all in one lump. 3) Choose your tense and point of view. Most readers are not aware of tense and POV but editors/agents are. Keep your writing smooth and consistent and try not to jump around. Although you will see well-known authors writing that way, they know what they’re doing. You want your readers to see the least amount of stitches in the fabric, so create as few seams as possible. 4) Don’t disappoint the reader by starting out with a bang and then going nowhere. You must fulfill your promise to the reader; the promise you gave him in that first sentence and paragraph. If this is purported to be a funny book, make it funny to the end. Don’t let it lose momentum or you’ll lose your reader. Also, if your opening is strange or misleading, you will have trouble living up to the expectation. Never cheat the reader. 5) Don’t get ahead of the reader. The story has to flow with a natural sequence. You know the neighbor is a vampire but you haven’t clued the reader in yet so they may get confused. Few readers will continue a story they can’t follow. 6) Don’t start out with overt terror or overly gruesome details. Feed gore in your story in little pieces. A little goes a long way here. If you start off strong, you will have to stay strong and most people won’t be able to stomach 80 thousand words of bloody mess and heart-stopping fear. 7) Avoid writing long setting descriptions. This is a common error for new writers. Describing the sky and the clouds and the sunset is not going to grab your reader. Save all that for the poetry books. Fill in the necessary information and get on with the story. 8) That goes double for starting off with a dream sequence. If the reader gets involved with the story and then finds out none of it was real, it was all a dream, he will feel cheated. 9) Start out with a strong character. First time novelists often try to lure the reader into the story by holding back the main character. Establish your main character’s situation right away. If you manage to get your reader to care about your hero/heroine, the story line really becomes secondary as the reader will follow those characters wherever the story takes them. Beloved characters can turn one book into a series. 10) Keep the reader guessing from the start. While you don’t want to confuse your reader, giving them a puzzle or unanswered question is very effective. They will keep reading to find the answer. 11) Avoid starting out with pages of dialogue. You must build a relationship between your character and your reader. That’s difficult to do through cold dialogue on the first page when the reader really doesn’t know the heart of who is speaking. Dialogue mixed with a bit of narrative works well as it reads quickly, and readers like white pages but not in the very beginning of your book. 12) Once you reach the end, revisit the beginning. The original story line often changes as the tale unfolds. A new opening line may be necessary to fit the revamped story. The first paragraph, and especially the first sentence, is one of the most important things in your book. Whole classes are dedicated to it. You need a hook in the first line, on the 3rd sentence or at the end of the first paragraph, and one at the end of page one. When a potential buyer is in the book store they are attracted to your cover and your title. Then they turn the book over and read the back cover. It better have a killer back-cover blurb. If they like that, they will begin to read the first page. You MUST hook them right then or they will put your book back on the shelf and go on to the next book. It can mean the difference between a sale or a no sale. Donald Maass suggests that the strongest hooks raise questions in the reader. Use one of these for the best results: •\tAction or danger •\tOverpowering emotion •\tA surprising situation •\tAn evocative description that pulls the reader into the story •\tIntroducing a unique character (just the introduction is not enough, they must be unique. •\tWarning for foreshadowing •\tSetting a tone or theme •\tShocking or witty dialogue •\tThe totally unexpected •\tRaising a direct question Your first sentence MUST contain one of the above to successfully hook your reader. Check out my e-book for more writing tips: Write Better Right Now: Creative Writing Tips http://amzn.com/B00IHIWUDC Only $1.99. ",
            "date": "Answered June 19, 2019",
            "views": "12",
            "upvotes": " View 10 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Manoj Gupta",
                    "user_href": "/profile/Manoj-Gupta-2822"
                },
                {
                    "user_id": "Kalth Kalth",
                    "user_href": "/profile/Kalth-Kalth"
                },
                {
                    "user_id": "Kandaswamy Chandrasekaran",
                    "user_href": "/profile/Kandaswamy-Chandrasekaran"
                },
                {
                    "user_id": "Inggrid Silli",
                    "user_href": "/profile/Inggrid-Silli"
                },
                {
                    "user_id": "Richard Weisenbachfeld",
                    "user_href": "/profile/Richard-Weisenbachfeld"
                },
                {
                    "user_id": "Sam Kay",
                    "user_href": "/profile/Sam-Kay-147"
                },
                {
                    "user_id": "James H. Jenkins",
                    "user_href": "/profile/James-H-Jenkins"
                },
                {
                    "user_id": "Anthony Fordham",
                    "user_href": "/profile/Anthony-Fordham-3"
                },
                {
                    "user_id": "Gordon Walker",
                    "user_href": "/profile/Gordon-Walker-12"
                },
                {
                    "user_id": "Armand Moyon",
                    "user_href": "/profile/Armand-Moyon-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Alycia Crane",
                "href": "/profile/Alycia-Crane-1"
            },
            "answer_text": "The first sentence of any novel has a big job: it has to hook the reader and pull them into the story. if it doesn’t do this, the reader will put the book down and we’ll have lost them. That’s a lot of pressure, right? So let’s take a look at some first sentences: Harry Potter and the Sorcerer’s Stone By J. K. Rowling Mr. and Mrs. Dursley of number four, Privet Drive, were proud to say that they were perfectly normal thank you very much. Throne of Glass by Sarah J. Maas After a year of slavery in the Salt Mines of Endovier, Celaena Sardothien was accustomed to being escorted everywhere in shackles and at sword point. Gone with the Wind by Margaret Mitchell Scarlett O’Hara was not beautiful, but men seldom realized it when caught by her charm as the Tarleton twins were. The Hunger Games by Susanne Collins When I wake up, the other side of the bed is cold. The Outsiders by S. E. Hinton When I stepped out into the bright sunlight from the darkness of the movie house, I only had two things on my mind: Paul Newman and a ride home. Anna Karenina by Leo Tolstoy Happy families are all alike; every unhappy family is unhappy in its own way. So here you see some examples of how these rather famous authors have pulled people into the story with their first sentence. 4 of the 6 have introduced the protagonist right away - 2 from the third person POV and 2 from the first person POV. Tolstoy sets the tone for the novel with his first sentence. You instantly know it’s not going to be a happy story with a bright ending. J. K. Rowling lets you know that the Dursleys are a no-nonsense type of family who are about to have their normalacy disrupted. So read a few first lines in some of the books that have most influenced you and ask yourself: “what is it about this line that pulls me in?” Then, try it yourself. Take out a notebook and a pencil or a pen and write out a first line several times. Write a new one each time. Practice is how you get better at the first line. ",
            "date": "Answered August 8, 2020",
            "views": "107",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Efrayim Bulka",
                    "user_href": "/profile/Efrayim-Bulka-1"
                }
            ]
        }
    ]
}