{
    "title": "What are some of the most beautiful love letters you've read (or written!)? - Quora",
    "tags": [
        "Love Letters",
        "List Question",
        "Love"
    ],
    "response": [
        {
            "author_info": {
                "name": "Sheetal Pandey",
                "href": "/profile/Sheetal-Pandey"
            },
            "answer_text": "This is an excerpt from the most beautiful letter I have found on love. How a girl that's truly,madly and deeply in love can pour her heart out for someone... It is indeed one incredible feeling.   ​ \"It rained here last night. I know it rained there, too. And while you sat there by the window looking at the rain falling to the ground, I stepped out in the rain for the very first time. A lot of firsts this year, I know. But it was a Wednesday and it's June and the earth smelled like everything I've ever wanted and I had to go out.  It's funny how I felt so much at that moment and forgot all about it by 2 PM next day when I was binge watching FRIENDS. And it's almost scary how I'm not scared about the thought of us anymore. I mean, a guy like you and a girl like me. You've always been too scared and I'm never sure. We were never one of those people who are just meant to be. We still aren't.  But underneath all my insecurities and all your fears, there's something that I've always known. Something that I never thought needed saying, for you to know. It's that I want you. On the nights when you taste like red wine on my lips and I melt like soft wax in your arms. On nights when we slip from each other's fingertips and land inside each other. I want you on days when all we are is a black polaroid picture in the bottom of your drawer underneath the pile of all the things you don't need. I want you on days when you are too much and on days when you aren't enough. I want your loud, your messy, your bloodshot eyes and your anger. I want the calm that follows. I want you when you you're covered in sweat and dust from all your adventures. I want you when you're as still as a night. I want you when you're a violent hurricane.  I want you when you feel like crying even though nothing's wrong. I want you when everything is wrong but you still don't cry. I want you when you feel like you can conquer the world and I want you when you're too broken to even get up. I want you when you break down on the bathroom floor crying and puking. I want you when you lie in your bed all day, contemplating.  I want you when you want to visit old thrift stores. I want you when you cook your brother's favorite dish even though you don't really like it. I want you when you spend hours reading a book. I want you when you get a migraine and can't read for days. I want you with that cigarette pressed between your lips. I want you when you listen to that Arctic Monkeys album over and over again. I want you, over and over again.  I want you whole. I want you in the mornings when you wake up confused, and tired. I want you when you drink your morning tea and read the newspaper absentmindedly. I want you when you tell lame jokes with a lopsided smile showing off that chipped front tooth. I want you when you tell me you love me. I want you when make me feel like you don't.    ​ I want you when you talk about climbing the Everest. I want you when you really do climb it. I want you on boring Thursdays when we have nothing left to do. I want you when you when we are too busy to say hello to each other for days. I want you in your old blue denim and your favorite orange T-shirt that is now too old. I want you with your deformities. I want with your perfections.  I want you, unaltered. I want you when your breath smells like cheap beer and your shirt, my favorite cologne. I want you with all your bruises and all your scars. I want your deepest cuts. I want you when you don't want yourself. I want it all. I want you.\" Written by- Shiza | Source: The Scribbled Stories | Image Source: Google ",
            "date": "Answered June 19, 2016",
            "views": "129",
            "upvotes": " View 27 Upvoters",
            "upvoters": [
                {
                    "user_id": "Pushkar Khedkar",
                    "user_href": "/profile/Pushkar-Khedkar-1"
                },
                {
                    "user_id": "Sudhir Yadav",
                    "user_href": "/profile/Sudhir-Yadav-145"
                },
                {
                    "user_id": "Alisa Steves",
                    "user_href": "/profile/Alisa-Steves"
                },
                {
                    "user_id": "Rishima",
                    "user_href": "/profile/Rishima-1"
                },
                {
                    "user_id": "Lalena Patricia",
                    "user_href": "/profile/Lalena-Patricia"
                },
                {
                    "user_id": "Mahi Shandilya",
                    "user_href": "/profile/Mahi-Shandilya-2"
                },
                {
                    "user_id": "Victoria Flores",
                    "user_href": "/profile/Victoria-Flores-130"
                },
                {
                    "user_id": "Amare Vita",
                    "user_href": "/profile/Amare-Vita"
                },
                {
                    "user_id": "Chhatrasal Aryal",
                    "user_href": "/profile/Chhatrasal-Aryal"
                },
                {
                    "user_id": "Anjali Sharma",
                    "user_href": "/profile/Anjali-Sharma-925"
                }
            ]
        },
        {
            "author_info": {
                "name": "Anoma Bhardwaj",
                "href": "/profile/Anoma-Bhardwaj"
            },
            "answer_text": "My love. Yes I love you! In this moment. While you make me feel this euphoric inside. Will I love you forever? I don't know. There will come a time, when a heap of bad moments will pile up, the moments which won't make me feel as crazy about you as I feel right now. And in that moment one of us might want to jump out of the wagon and ask for a refund. And if that one is you, trust me I'll do everything that I can to pull you right back in and remind you how worthy the ride was and still will be. But if I'm the one to be jumping, please pull me back too. Please make me feel special like you did when you told me you loved me when I could see no reason why. And like when you lifted my spirits up every fucking time I dropped down. Remind me how you were my rock solid support in the times I myself wanted to break up with me. Remind me how my mind went insane but my heart calmed down when I gazed into your eyes for more than three seconds. Remind me how ferociously I loved you! And what if even then it doesn't work out...what if even then one of us wants to jump off. Well if it does come to that, we will figure that out too, like we did with almost anything anew...We will get ourselves different rides and I will pray for your smooth journey like I know you will pray for mine. And just know that me not being in your wagon doesn't mean I would forget how beautiful the ride was. I wouldn't stop loving you, not now, not even then. Feelings may fade, our compatibility might not be as telepathic as it now, but know this, I will never stop caring or keeping you in my prayers and well wishes. I'll never stop loving you or respecting you, for you loved me once when even I couldn't do so and with so much ferocity that it sent me tumbling down and swept me off my feet all at the same time. With love, your love. ",
            "date": "Answered October 21, 2017",
            "views": "171",
            "upvotes": " View 36 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Samreen Khan",
                    "user_href": "/profile/Samreen-Khan-35"
                },
                {
                    "user_id": "Ankita Kumari",
                    "user_href": "/profile/Ankita-Kumari-332"
                },
                {
                    "user_id": "Anisha Sekhar",
                    "user_href": "/profile/Anisha-Sekhar-2"
                },
                {
                    "user_id": "Sam Jonga",
                    "user_href": "/profile/Sam-Jonga"
                },
                {
                    "user_id": "Nikita Agrawal",
                    "user_href": "/profile/Nikita-Agrawal-439"
                },
                {
                    "user_id": "Mrunali Patil",
                    "user_href": "/profile/Mrunali-Patil-36"
                },
                {
                    "user_id": "SAMARJEET SINGH",
                    "user_href": "/profile/SAMARJEET-SINGH-153"
                },
                {
                    "user_id": "Padma Soundarajan",
                    "user_href": "/profile/Padma-Soundarajan"
                },
                {
                    "user_id": "Kunal Parvaliya",
                    "user_href": "/profile/Kunal-Parvaliya"
                },
                {
                    "user_id": "Amritanshu",
                    "user_href": "/profile/Amritanshu-27"
                }
            ]
        }
    ]
}