{
    "title": "What are some exceptionally great one line poems? - Quora",
    "tags": [
        "English Poetry",
        "Poetry Analysis",
        "One-liners",
        "Novelists",
        "Poets",
        "Poems",
        "Poetry"
    ],
    "response": [
        {
            "author_info": {
                "name": "Rakeshnetha Ponna",
                "href": "/profile/Rakeshnetha-Ponna"
            },
            "answer_text": "I don't know whether they are exceptionally good or not but i wrote them give it a read. Suggest me any edits. And I'm sorry for my bad English.  Every time she says 'nothing, I'm fine' terror strikes my spine.Your diagonal looks takes my breath also your rejection.Dad your every disapproval smirk drowned me to other higher degree depression. Dad why it's not fine if I smoke? It's cool when you did isn't it?Worst day of a man to listen 'I should be fine with that?' From his mother and his son's.Every time she cringes and squeezes my hand seeing something, she makes my day. Overflowing-trashcan, rotten-pizza, cig-stinking room, clinking-bottles, unchanged- sheets, never ending-TV series #breakupeffects.Past-midnight, fished coins in all pants, lone-road, barkingdogs, 2cigs,1match, last puff. enough to die in peace. Badly need a hug n words I'm vth u. Bt love z just 100miles away. Stinkin pillow u r my hubby.When you stare straight at me and when you leave because I'm not responding my little heart gets angry bird soul and curses me for my hesitation.While you ignore your loved ones daily someone somewhere holds fabric of lost ones to heart to feel them around. That stone you throw out of disgust of defeat may break open trench to diamonds after your umpteen failures.It's unbearably painful to realise my darlz became my devil but its unavoidable. Finally some one liners in telugu Naku inka ascharyamey antha chinna momu antha pedda kallani yela mosthundo ani.Nalaka padithey oka pattana bayatiki raadey antha pedda aranyamlo daari marusthundo yemo papam. Yentha adrustam daniki?",
            "date": "Updated November 21, 2015",
            "views": "31",
            "upvotes": " View 9 Upvoters",
            "upvoters": [
                {
                    "user_id": "Reddi Sahu",
                    "user_href": "/profile/Reddi-Sahu"
                },
                {
                    "user_id": "Pavan Kumar Chennuri",
                    "user_href": "/profile/Pavan-Kumar-Chennuri"
                },
                {
                    "user_id": "Kumar Aditya",
                    "user_href": "/profile/Kumar-Aditya-143"
                },
                {
                    "user_id": "Neha Thakkar",
                    "user_href": "/profile/Neha-Thakkar-32"
                },
                {
                    "user_id": "Paritosh Parate",
                    "user_href": "/profile/Paritosh-Parate"
                },
                {
                    "user_id": "Radha Krishna",
                    "user_href": "/profile/Radha-Krishna-109"
                },
                {
                    "user_id": "Tharuninetha Ponna",
                    "user_href": "/profile/Tharuninetha-Ponna"
                },
                {
                    "user_id": "Arjun Patel",
                    "user_href": "/profile/Arjun-Patel-4"
                },
                {
                    "user_id": "Sunita Sampat",
                    "user_href": "/profile/Sunita-Sampat"
                }
            ]
        },
        {
            "author_info": {
                "name": "Vijayanarasimhan Karthikeyan",
                "href": "/profile/விசயநரசிம்மன்-கார்த்திகேயன்-Vijayanarasimhan-Karthikeyan"
            },
            "answer_text": "My answer will be from the ocean of Tamil literature: When someone says 'great one line poems' the only thing that comes to my mind is the famous work of a women poet, Avvaiyar, known as 'Aathichoodi'. This is a collection of one liners, arranged in alphabetical order (as per Tamil alphabet, called as 'Nedunkanakku'): The first line is:  அறம் செய விரும்பு [Intend to do right deeds]  The full text can be found here (with English translations): https://en.wikipedia.org/wiki/Aathichoodi These are intended to be taught to toddlers as their first text. The arrangement of lines in alphabetical order aids either way, to learn the text from the already learned alphabets and to learn example usage for these letters (like how they teach 'A for Apple' in English) There is also another book of the same format by the same Author, which serves as a next level text for those who have learned 'Aathichoodi'. This is called 'Konrai Vendhan' (all these names comes from the first words of the invocations these texts have) which has a slightly lengthier lines (in comparison to  Aathichoodi) which also in corporates 'edugai' (a Tamil Rhyme scheme) within lines. The first line is,  அன்னையும் பிதாவும் முன்னறி தெய்வம் [Father and Mother are the first known gods] Full text here (no translation available!):https://ta.wikisource.org/s/10c There are many similar works by later day poets, the Aathichoodi by Mahakavi Bharathiyar deserves a special mentions, for it teaches the child to be more brave and revolutionary (which are much needed at the time of India's independence struggle) Apart from these formal or written literature, Tamil also have an abundance of proverbs and adages which are all, in my opinion, very beautiful and meaningful one-liners. Few examples below: காக்கைக்குத் தன் குஞ்சும் பொன்குஞ்சுFor every crow, its own chick is golden (though it is actually black in color!) (For everyone, their stuff will be the best!) யானைக்கு ஒரு காலம் வந்தால் பூனைக்கு ஒரு காலம் வரும்If elephant has its time, a cat too will have its (Equivalent to 'Every dog has its day') ஆடத் தெரியாதவள் மேடை கோணல் என்றாளாம்She doesn't know to dance, but complains that the stage is not level (Accept your mistakes instead of finding fault with others) There are also adages describing the nature of seasons and months (according to Tamil calendar): ஆடிக் காற்றில் அம்மியும் பறக்கும்The wind during Aaadi (month) could even make the grinding stone fly (Aadi - mid-July to mid-August) புரட்டாசியில் மண்ணுருக பெய்யும், பொன்னுருக காயும்During Purattaasi, it will rain enough to 'melt' the soil, and shine enough to 'melt' the metals (Purattaasi will have a good share of rain and shine. Purattaasi - mid-September to mid-October) All these are in simple words, for they have originated and used among commoners, yet they have alliterations and rhymes showing how the language is beautifully handled even by commoners. So, from a poet or a common man, Tamil one-liners are always something to cherish. ",
            "date": "Answered November 18, 2015",
            "views": "42",
            "upvotes": " View 14 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Mark Joel",
                    "user_href": "/profile/Mark-Joel-2"
                },
                {
                    "user_id": "Aishwarya Ashok",
                    "user_href": "/profile/Aishwarya-Ashok-2"
                },
                {
                    "user_id": "Vibhasha Mathiazhagan",
                    "user_href": "/profile/Vibhasha-Mathiazhagan"
                },
                {
                    "user_id": "Bojarajan",
                    "user_href": "/profile/Bojarajan"
                },
                {
                    "user_id": "Lakshmikanth Balasundaram",
                    "user_href": "/profile/Lakshmikanth-Balasundaram"
                },
                {
                    "user_id": "Subashni Ravichandran",
                    "user_href": "/profile/Subashni-Ravichandran"
                },
                {
                    "user_id": "Harish Ga",
                    "user_href": "/profile/Harish-Ga-1"
                },
                {
                    "user_id": "Prasanna Vengatesan",
                    "user_href": "/profile/Prasanna-Vengatesan"
                },
                {
                    "user_id": "Vinod Shankar",
                    "user_href": "/profile/Vinod-Shankar-1"
                },
                {
                    "user_id": "Pratip Vijayakumar",
                    "user_href": "/profile/பிரதீப்-விஜயகுமார்-Pratip-Vijayakumar"
                }
            ]
        }
    ]
}