{
    "title": "What makes a book character feel real? - Quora",
    "tags": [
        "Charcter Creation",
        "Literary Characters",
        "Fiction Writing",
        "Novel Writing",
        "Literary Fiction",
        "Fiction",
        "Novels",
        "Fictional Characters",
        "Literature",
        "Character and Personality"
    ],
    "response": [
        {
            "author_info": {
                "name": "Ciel Shum",
                "href": "/profile/Ciel-Shum"
            },
            "answer_text": "detailed physical traits. When the text is so descriptive, it is very easy fo the readers to visualise the appearance of a character. Especially when there are specific words to indicate the location and position, like where exactly a mole is on the face or where the brows start and end, the readers are navigated to follow the writers path to create the character in mind.Vivid description of the characters action. Verbs help. And words to show the strength and extend. Same as the appearance, it is there for readers to visualise so that the character seems like right in front of their eyes.Relationships with others. A very real character has clear and mutually involved relationship. How the character thinks of another character and how they receive each other’s thoughts, how the character acts towards the other one, and how they respond and react back. This allows the readers to link the character to a real person in their own daily life, and thinking the character so familiar and may just appear in the next second.Give the character a valid and reasonable motive in whatever doing. This requires the writer to offer more background information of a character and the experiences had been encountered. Knowing the background of the character, the readers will understand the way the how the character behaves, and showing more sympathy towards the character, as they can even relate the character to themselves and add on more personal illustrational stories.",
            "date": "Answered July 24, 2020",
            "views": "103",
            "upvotes": " View 3 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Mike Solaris",
                    "user_href": "/profile/Mike-Solaris-1"
                },
                {
                    "user_id": "Serena Chuang",
                    "user_href": "/profile/Serena-Chuang-1"
                },
                {
                    "user_id": "Sarika Jarugumilli",
                    "user_href": "/profile/Sarika-Jarugumilli"
                }
            ]
        },
        {
            "author_info": {
                "name": "Ella Terry",
                "href": "/profile/Ella-Terry-7"
            },
            "answer_text": "Here are a couple of pointers I use when I am writing characters, and I think they are so helpful! 9 Steps to Developing Characters: Plan goals and motivators.What do the characters want at the end?The beginning?Why?Develop using conflict.Propel change via internal and external conflict.Drive development via emotion.How do the characters’ dominant emotions shape the ways they act?Give some character foils.A foil is when Character B is very different from Character A to show what Character A is or is not.Use secondary characters to develop key character flaws and strengths.Include reversals.How do unexpected turns of events shift characters’ possibilities and paths?Use action and dialogue.Show characters through an accumulation of gestures, deeds, and conversations.Show some acts against type.Sometimes people do things that aren’t typical of them--show contradictions.Show the characters’ impact.Changed circumstances--like how a move to a new city may change behavior.Show how the character changes and influences the environment and other characters.Balance static and complex types.Some characters may not develop much--mix static with more rounded types of characters",
            "date": "Answered July 21, 2020",
            "views": "145",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Euterpe Sage",
                    "user_href": "/profile/Euterpe-Sage"
                },
                {
                    "user_id": "Mike Solaris",
                    "user_href": "/profile/Mike-Solaris-1"
                },
                {
                    "user_id": "Dóra Pisztel",
                    "user_href": "/profile/Dóra-Pisztel"
                }
            ]
        },
        {
            "author_info": {
                "name": "Euterpe Sage",
                "href": "/profile/Euterpe-Sage"
            },
            "answer_text": "Positive and negative traits make a book character feel real. I have read some fiction stories where the main character is made perfect, meaning that they don’t make mistakes, everybody loves them, they’re usually very attractive and funny. Or, in a reverse way, the main character is going through a lot of hardships, everybody hates them, they’re not as attractive as others, mute and depressed. To make a real, relatable character you have to let them make mistakes, have imperfections in their personalities and looks, show both the good and bad aspects of their lives. Sometimes you have to let the main character be the villain, because in reality you’re not always right in other people’s eyes. ",
            "date": "Answered July 22, 2020",
            "views": "66",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Mike Solaris",
                    "user_href": "/profile/Mike-Solaris-1"
                },
                {
                    "user_id": "Dóra Pisztel",
                    "user_href": "/profile/Dóra-Pisztel"
                },
                {
                    "user_id": "Sope Oke",
                    "user_href": "/profile/Sope-Oke"
                }
            ]
        },
        {
            "author_info": {
                "name": "Ilka Jones",
                "href": "/profile/Ilka-Jones"
            },
            "answer_text": "It’s awful when people put a Mary Sue (walking, talking Barbie) character. Or a character based on themself (people aren’t aware of their flaws). Look at THG. Most of the characters have at least one major flaw or a few minor ones. That’s why we cried when they died. It gives them depth. I wouldn’t feel connected to someone if they were smart, funny, pretty, and anything anyone would want to be. Even in video games we tend to pick characters of love them more if they aren’t perfect. Overwatch demonstrates this. Most characters have been hurt at some point in their life or are absolutely insane. We know people that (on a smaller scale) are crazy or hurt, emotionally. So we feel more connected and love them more. ",
            "date": "Answered July 23, 2020",
            "views": "24",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Ash Dupuis",
                "href": "/profile/Ash-Dupuis-1"
            },
            "answer_text": "The short is answer is: Can you believe them? Like, do they feel like a real person? Are they three-dimensional, with emotions and conflicting opinions and desires and fears? The longer answer is: Can you imagine them in a situation and be able to predict how they’ll react to it? If you’ve followed a character for a while, say Harry Potter or Hercule Poirot or whoever these people are in Friends, do you feel like you know them the way you know your best pal from high school? If you’ve answered yes to either question, the characters are real. ",
            "date": "Answered July 21, 2020",
            "views": "107",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Euterpe Sage",
                    "user_href": "/profile/Euterpe-Sage"
                },
                {
                    "user_id": "Mike Solaris",
                    "user_href": "/profile/Mike-Solaris-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Kailey Baker",
                "href": "/profile/Kailey-Baker-21"
            },
            "answer_text": "Make them more than a word. Do you find it easy to describe them with only one or two adjectives? Can you label them as “smart” with that being their only quality? Or are they perhaps “friendly and kind”, and that’s it? You need to make your characters multidimensional. They can’t just be described with one adjective. They need to be kind and intelligent and introverted and anxiety-prone and abused and a million other things. They can’t just be one thing. ",
            "date": "Answered July 23, 2020",
            "views": "70",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Aditya Vishal",
                "href": "/profile/Aditya-Vishal-29"
            },
            "answer_text": "When the character is inspired by a common man, which we all have seen at least once in our life. Then the character feels somewhat real. Thanks for asking :) ",
            "date": "Answered July 21, 2020",
            "views": "53",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Mike Solaris",
                    "user_href": "/profile/Mike-Solaris-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Vien Phan",
                "href": "/profile/Vien-Phan"
            },
            "answer_text": "If they were developed, written and drawn from a place of experience and familiarity that evokes the sensation that who we are getting to know is real. ",
            "date": "Answered July 21, 2020",
            "views": "72",
            "upvotes": "0"
        }
    ]
}