{
    "title": "What are some interesting ideas for architectural thesis or dissertation topics? - Quora",
    "tags": [
        "Thesis Topics",
        "Theses and Dissertations"
    ],
    "response": [
        {
            "author_info": {
                "name": "Kirk Lenard",
                "href": "/profile/Kirk-Lenard"
            },
            "answer_text": "For many students, the ingenuity (or “interestingness”!) of the topic could be an impediment to their ability to finish up an academic career with a “successful” final project. In that case, choosing something conventional like “Low-income Housing” or “Creating a Sustainable Home for the Aging Third World Population” may be ideal. BUT, if you wish to choose something rewarding that you will look back on with pride, years from now after you’ve become a successful practicing architect, I’d suggest trying to think “outside the box”, so to speak. For which you can’t really seek “ideas” from others. You need to stop thinking conventionally, search deep inside to get an understanding of where your own passions lie, and think away, reading, writing down ideas, refining and discarding, until you get there…. I graduated from Architecture in the late 80’s during the early days of 3D modelling and was a keen adopter of that technology, but it made me very aware of the fact that architecture (and the experience of space) could become even more virtual and less “tangible” or physical over time. An earlier thesis I proposed was that 3d modelling could provide a virtual “architectural experience” without ever building anything. William Gibson’s Neuromancer was a popular book at the time, but in those days the technology just wasn’t there yet. It was long before Alex Roman’s film The Third & The Seventh which was made over 10 years ago but is still a “must watch” for me in terms of creating a convincing virtual space!  However, then, as still, I was desperate to build things, rather than just document. My final thesis project was “Ephemeral Architecture”. It posited that Architecture was more about “the experience of space” than about “the documentation of proposed buildings”. I proposed to create a physical experience of space for my final work, rather than the usual drawings. In the end I capitulated and produced drawings, as well as “an experience” but at least I had ambitions! (see in comments below for a better explanation of what “Ephemeral Architecture” meant). As a rule, architecture students live in a world of dreams, drawings, and unrealised projects, but I wanted to break through those restrictions and create an environment that appealed to all the juror’s senses, not just 2D visualization. I tried to choose a thesis subject that was current, highly conceptual, and close to my heart, rather than exploring say “low income housing, urban renewal, or environmentally friendly building” like many fellow students chose. This is not to say those are bad choices, just not always as conceptually challenging. A thesis should go way beyond the practical and should question “ideas” rather than just “practices”. Ideally students should explore the edge of what is being done, rather than just research what others are already doing. It may be the last chance you’ll get to be theoretically crazy… Luckily I can now say I look back on that final project with great pride. ",
            "date": "Updated November 6, 2019",
            "views": "151",
            "upvotes": " View 32 Upvoters",
            "upvoters": [
                {
                    "user_id": "Divya Vijla",
                    "user_href": "/profile/Divya-Vijla"
                },
                {
                    "user_id": "Anushree Khanna",
                    "user_href": "/profile/Anushree-Khanna-2"
                },
                {
                    "user_id": "Shalini Tripathi",
                    "user_href": "/profile/Shalini-Tripathi-55"
                },
                {
                    "user_id": "Nidhi Patidar",
                    "user_href": "/profile/Nidhi-Patidar-1"
                },
                {
                    "user_id": "Danielle Fernandez",
                    "user_href": "/profile/Danielle-Fernandez-62"
                },
                {
                    "user_id": "Oindrila Ghosh",
                    "user_href": "/profile/Oindrila-Ghosh-67"
                },
                {
                    "user_id": "Pallak Arora",
                    "user_href": "/profile/Pallak-Arora-1"
                },
                {
                    "user_id": "Vineet Kumar",
                    "user_href": "/profile/Vineet-Kumar-2236"
                },
                {
                    "user_id": "Lovejit Saka",
                    "user_href": "/profile/Lovejit-Saka-1"
                },
                {
                    "user_id": "Budi Joe",
                    "user_href": "/profile/Budi-Joe"
                }
            ]
        },
        {
            "author_info": {
                "name": "Robin Hubbard",
                "href": "/profile/Robin-Hubbard-6"
            },
            "answer_text": ".What would be a good , interesting thesis or dissertations topic in _______________? I get same question about thesis and dissertation topics from a variety of academic disciplines A great dissertation topic, project idea, or thesis statement is one that interest you,interest your advisor, andinterest your committee within the resources available to you.It is the process, apprenticeship of becoming a scholar, researcher, or credential professional that matters, not the topic. Do a literature review. It is part of the written thesis or dissertation (or an executive summary for a project) so it is not a waste of time. Use deductive reasoning to find a topic of interest. It needs to be personally interesting because you will be married to it for a long time — it’s like picking a spouse. Selecting the topic is an integral step of the process, taking a broad topic and narrowing it down. It wiil be the same process for research or project design. Start with https://scholar.google.com Do not forget trade association publications, white papers, government reports, and Non-governmental organization (NGO) - publications. Don't limit yourself. Most papers or books will end with research questions for further investigation. They will also point you to scholarly publications, researchers, or professionals that might not have occurred to you such as these examples about digital applications or creating an environmentally safe ecosystem. Look at trending topics for your discipline. Look at cross-disciplinary ideas such as architecture and brand marketing.  ImageSource: University of Notre Dame  Additional Information .What are the best thesis statements on _____? There is confusion between dissertation, thesis, and thesis statement.  What does the word thesis or thesis statement mean? For the the US, the short answer is a thesis or thesis statement is the main idea of a written work: information, research question, hypothesis, focus, argument, narrowed topic of an academic paper from primary school and beyond. In noneducational settings, the written work is called a “white paper” or “working paper”. Thesis is also defined as the the major written work cumulating in an American master's degree (30+ credit hours past a 120–140 credit hours for a bachelor's degree). Traditionally, American papers have this five-part structure. Introduction (thesis statement; preview; limited background)Supporting section #1 (LiteratureReview for Senior thesis, Senior Project, Master Thesis, PhD degree’sdissertation, Scholarly paper, White Paper, other post-secondary research papers)Supporting section #2 (Methods and/or Results for Senior thesis, Senior Project, Master Thesis, PhD Dissertation, Scholarly paper, White Paper, other post-secondary research papers)Supporting section #3 (Results, Findings, and Analysis for Senior thesis, Senior Project, Master Thesis, Dissertation, Scholarly paper, White Paper, other post-secondary research papers)Conclusions: (Summary, Implications, Recommendations, or Unresolved Issues)Disciplinary, departmental, and institutional format will vary somewhat. Creating a Thesis Statement | Purdue University Purdue OWL: Research Papers | Purdue University  ImageSource: mscatiereynolds.weebly81   Do a literature review. It is part of the written dissertation or thesis; therefore, it is not a waste of time. Use deductive reasoning to find a topic of interest moving from generic to specific. Two popular tevhniques are inverted pyramid, “zoom” or funnel. It needs to be personally interesting because you will be married to it for a long time — it’s like picking a spouse.  ImageSource: Upload and Share your PowerPoint presentations Selecting the topic is an integral step of the dissertation or thesis process, taking a broad topic and narrowing it down. Don't cheat yourself. Use https://scholar.google.com Most papers or books will end with research questions for further investigation.  ImageSource: Upload and Share your PowerPoint presentations Look for articles written in Journals,Conference Papers,published by University Presses,Government Reports,Research Institute papers,or published by universities or non-government organizations (NGOs)Trade Association & Journals are important for identifying current problemsLook for gaps in the literature: Finding a research topicReplicate published studies or find weaknessesPublic data sets19 Free Public Data Sets For Your First Data Science ProjectLinks to Data SetsData.gov (192,100 datasets)25+ free datasets for Datascience projects ImageSource: Association Directory - Trade Association - Directory of Associations  The process of developing a project idea, thesis or dissertation statement is just as important as the research, project, or written paper. ",
            "date": "Answered October 17, 2016",
            "views": "108",
            "upvotes": " View 6 Upvoters",
            "upvoters": [
                {
                    "user_id": "Minyao Xu",
                    "user_href": "/profile/Minyao-Xu-1"
                },
                {
                    "user_id": "Shubham Saini",
                    "user_href": "/profile/Shubham-Saini-402"
                },
                {
                    "user_id": "Pallak Arora",
                    "user_href": "/profile/Pallak-Arora-1"
                },
                {
                    "user_id": "Iswarriyaa Pushparaja",
                    "user_href": "/profile/Iswarriyaa-Pushparaja"
                },
                {
                    "user_id": "Karis Ling",
                    "user_href": "/profile/Karis-Ling"
                },
                {
                    "user_id": "Erik Hille",
                    "user_href": "/profile/Erik-Hille"
                }
            ]
        }
    ]
}