{
    "title": "What should I title my Phillips Exeter essay? - Quora",
    "tags": [
        "Phillips Exeter Academy"
    ],
    "response": [
        {
            "author_info": {
                "name": "Alex Brant-Zawadzki",
                "href": "/profile/Alex-Brant-Zawadzki"
            },
            "answer_text": "I would title it, “What I Can Offer To The Exeter Community” Don’t try and suggest you’re somehow more excellent than the other applicants. Most of the applicants are excellent. So what is it about you that makes you a valuable member of a community? How are you prepared to take advantage of all the opportunities Exeter offers? Try not to make any presumptions about what Exeter is, or what your experience will be like, and definitely don’t think of Exeter as simply a means to an end - that end being acceptance to a “good” college. And if you’re in a bad situation, don’t be ashamed to acknowledge that and detail all the ways Exeter can help you escape. Good luck, but if you don’t get in, don’t worry about it. You can be a successful happy person without going to an Ivy League college, and you can be a successful happy person without going to a top-tier boarding school. Although Exeter IS pretty spectacular and the resources are beyond compare. ",
            "date": "Answered August 1, 2016",
            "views": "1",
            "upvotes": " View 6 Upvoters",
            "upvoters": [
                {
                    "user_id": "Igor Gabriel",
                    "user_href": "/profile/Igor-Gabriel-21"
                },
                {
                    "user_id": "Kayra Cahayagan",
                    "user_href": "/profile/Kayra-Cahayagan"
                },
                {
                    "user_id": "Erika Lee",
                    "user_href": "/profile/Erika-Lee-45"
                },
                {
                    "user_id": "Lorenzo de Simone",
                    "user_href": "/profile/Lorenzo-de-Simone-4"
                },
                {
                    "user_id": "Katy Samba",
                    "user_href": "/profile/Katy-Samba-1"
                },
                {
                    "user_id": "Paul Cohen",
                    "user_href": "/profile/Paul-Cohen-31"
                }
            ]
        }
    ]
}