{
    "title": "What is a comma? - Quora",
    "tags": [
        "Commas",
        "Punctuation"
    ],
    "response": [
        {
            "author_info": {
                "name": "Frank Elliott",
                "href": "/profile/Frank-Elliott-5"
            },
            "answer_text": "Best used to separate meaningful entities that require at least mental separation, commas are useful bits of punctuation that can easily, be misused. In a list, the context is key, because what are called “style manuals” developed for publishing work such as writing newspaper stories or graduate research papers serve to explain the use of all such minutiae in considerable detail. I mention style because I think comma-separated lists included in legal pleadings generally omit the comma and add and before the final item: One, two, three, four and five.A very popular writing style is AP (Associated Press): One, two, three, four, five.If I’ve erred here in citing styles, please forgive me. The main purposes for commas are two: 1) as a decimal-point character in European locales, and 2) as a separator of meaningful phrases or list items in text. Do you suppose overuse of commas could be indirectly attributed to a fixation upon Euro-maths? The third usual purpose (in very wide use) is as a “delimiter” (data-separation code character) in many database-intensive computer programming contexts, whether in arrays[], command arguments, or formulaic code syntax itself. I’m a college-educated programmer, but I cannot even make a reliable guess which of the above code-related purposes is most-often used. ",
            "date": "Answered March 30, 2018",
            "views": "15",
            "upvotes": " Answer requested by Kristian Wood",
            "upvoters": [
                {
                    "user_id": "Sarah Madden",
                    "user_href": "/profile/Sarah-Madden-11"
                }
            ]
        },
        {
            "author_info": {
                "name": "A. Ahmed",
                "href": "/profile/A-Ahmed-13"
            },
            "answer_text": "The Punctuation Guide has a great, comprehensive section about commas. Here is a somewhat shortened (ha!) version. I still recommend checking out the original, though. Direct address When directly addressing someone, the person’s name or title should be set off with commas. We could not have done it without you, Lisa. Thank you, Governor, for your support. Dates When a date consists of the day of the month followed by the year, the day of the month should be followed by a comma. When the day of the week is provided before the month, the day of the week should be followed by a comma. The store closed its doors for good on Wednesday, October 15, 1958. When the date appears in the middle of a sentence, commas should appear both before and after the year. Her arrival on April 10, 1988, was considered a turning point for the company. No comma is used between the month and the year when they are the only two elements in the date. The store closed its doors for good in October 1958. The British style, sometimes used by American writers, reverses the month and date—and eliminates the need for a comma. Her arrival on 10 April 1988 was considered a turning point for the company. Geographic references Commas should be used to separate geographic elements, as in the examples below. The final geographic element should also be followed by a comma when it appears in the middle of a sentence. His family moved from Bristol, England, to Portsmouth, New Hampshire, when he was eight. The company is headquartered in Sydney, New South Wales, Australia. The listing comma In this usage, the comma separates a series of words, phrases, or independent clauses. Do not place a comma after the last item in the list (see fourth example below) unless the structure of the sentence otherwise requires it (see third example below, in which the comma after audience is required to separate an introductory dependent clause from the main clause). For your entree, you may choose vegetarian pasta, beef, chicken, or salmon. Jane will bring the food, Jose will bring the drinks, John will bring the music, and Jackie will bring the cops. With dignity, grace, and a tremendous empathy for his audience, he delivered the most moving eulogy. I am taking art history, Russian literature, microeconomics, and macroeconomics next semester. Note: The final comma is known as an Oxford comma or serial comma. Some writers omit it, but doing so can cause confusion. In the example immediately above, the serial comma makes it clear that the writer is taking two separate economics courses next semester. Omitting the serial comma makes this unclear. Is it one course covering both microeconomics and macroeconomics, or is it two separate courses? Even though not all sentences will be unclear with the omission of the serial comma, its consistent use is a good habit. Multiple adjectives that modify or describe the same noun When a noun is modified by more than one adjective, each of which independently modifies the noun, the adjectives should be separated by a comma. In this usage, the comma substitutes for the conjunction and. It was a long, noisy, nauseating flight. (It was a long and noisy and nauseating flight.) When an adjective or adverb is repeated for emphasis, a comma is required. This is a very, very violent movie. Setting off nonrestrictive or nonessential information I will give the document to my brother, Tom. (The writer has only one brother. The brother's name is nonessential and therefore set off with a comma.) Nathaniel Hawthorne’s novel The Scarlet Letter has been made into several movies. (Hawthorne wrote more than one novel.) As seen in the example above, when the nonrestrictive or nonessential information is found within, rather than at the end of, the sentence, it should be set off with a pair of commas. When the nonessential information comes at the end of the sentence, only one comma is needed. Nonessential explanations When an explanation or definition occurs as an appositive, it should be set off with commas. The building’s window placement, referred to by architects as fenestration, is among its most distinctive features. That and which These words are frequently misused. That serves as a restrictive pronoun and therefore does not take a comma. John’s cars that are leased are never kept clean. (In this case, the dirty cars are specifically those that John leased; John might have non-leased cars that are kept clean.) Which serves as a nonrestrictive pronoun and therefore requires a comma. John’s cars, which are leased, are never kept clean. (In this case, all of John’s cars are dirty. The fact that those cars are leased is not essential to the meaning of the sentence.) Interrupting elements When a nonessential word or phrase occurs in the middle of a sentence, it should be set off with commas. Your work has been, frankly, awful. The hotel, once we finally found it, was very nice. Introductory matter When a word or phrase occurs at the beginning of a sentence, a comma should usually separate it from the main clause. Yes, we expect to attend the Christmas party. In my opinion, the movie was more compelling than the book. ",
            "date": "Answered March 25, 2018",
            "views": "91",
            "upvotes": " View 1 Upvoter"
        }
    ]
}