{
    "title": "What are the best closings for a love letter? - Quora",
    "tags": [
        "Love Letters"
    ],
    "response": [
        {
            "author_info": {
                "name": "Chris Leslie",
                "href": "/profile/Chris-Leslie-20"
            },
            "answer_text": "Ohhh…wow!! Okay. something that would reference in how he/she makes you smile mention that every minute away makes you feel ____ and that whenever you’re together _____ Sometimes “I love you” is a great closer. (Just as long as you’ve told her before, unless this is when you’re going to say it) If it’s the first, DON’T put it in the ending, place it in the middle somewhere, BUT make it still stand out, maybe ALL CAPS. Write something that shows him/her your someone that they can always look to and know you’ll be there. Comfort is really the best way to warm the heart at the end of a love letter. Because you want to make him/her feel warm and fuzzy, just not too mushy or sappy. Hope that helped! Blogger/Writer @ RACCOON DADDY : Father, Husband, FAMILY, and Gaming ",
            "date": "Answered November 13, 2016",
            "views": "89",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Stellah Ulriksen",
                    "user_href": "/profile/Stellah-Ulriksen"
                },
                {
                    "user_id": "Maya Kacharava",
                    "user_href": "/profile/Maya-Kacharava"
                }
            ]
        },
        {
            "author_info": {
                "name": "Annabeth Chase",
                "href": "/profile/Annabeth-Chase-284"
            },
            "answer_text": "Aw, this is a cute question. Some possible closings you could use for a love letter (and keep in mind I’ve never actually wrote one, I’m just basing this off movies and books): (p.s: be sure to add your name after most of these, lol) Yours foreverAlways and foreverUnconditionally yoursMiss youWith all my loveYour love foreverXoxoHugs and kissesThinking of you alwaysYour girl/guy/wife/husband (depends on relationship)Te amoYour lovingOr the simplest but best one of all: I love youHope it helped <3 ",
            "date": "Answered August 27, 2020",
            "views": "11",
            "upvotes": "0"
        }
    ]
}