{
    "title": "What kind of revolution was the French Revolution? - Quora",
    "tags": [
        "Greek Revolution",
        "French Revolution",
        "Industrial Revolution",
        "History of France",
        "Revolution",
        "History of Europe",
        "France",
        "World History",
        "Politics"
    ],
    "response": [
        {
            "author_info": {
                "name": "Dan O'Hanlon",
                "href": "/profile/Dan-OHanlon"
            },
            "answer_text": "Your question was, “What kind of revolution was the French Revolution?”  Technically (it could be argued that) the French Revolution wasn’t a “revolution” at all. The word, “revolution” directly implies a return to what had been. But the French Revolution was hardly that. With at least equal, but in reality far more justification, it would be better called the “French Breakthrough” or the “French Progression” —for there’s your answer. But even that falls short, since the real accomplishment of the French Revolution was that it didn’t just concern—it didn’t just advance—the French. It advanced the whole of human society—out of feudalism. ",
            "date": "Answered July 1, 2019",
            "views": "239",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Patrick Earley",
                    "user_href": "/profile/Patrick-Earley-15"
                }
            ]
        },
        {
            "author_info": {
                "name": "John Sanford",
                "href": "/profile/John-Sanford-47"
            },
            "answer_text": "A disastrous one. The ancien regime was a mess that needed fixing/replacing. The Revolution though brought The Terror (look it up), and ended with EMPEROR Napoleon attempting to conquer the rest of Europe. The French Revolution was the template and inspiration for the Haitian Revolution. And the Russian Revolution, and by extension all the child revolutions of the Russian Revolution. The 18th century closed with two great revolutions. Most revolutionaries since then have taken their inspiration from one or the other. The French Revolution is so wonderfully romantic, flush with soaring ideals. Yet it and all of the revolutions it has inspired (directly or indirectly) have resulted in mass death. Choose wisely. ",
            "date": "Answered July 1, 2019",
            "views": "124",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Patrick Earley",
                    "user_href": "/profile/Patrick-Earley-15"
                }
            ]
        },
        {
            "author_info": {
                "name": "Lily Broome",
                "href": "/profile/Lily-Broome-1"
            },
            "answer_text": "Not a place to be if you were of noble birth and you wanted to keep your head on your shoulders. Madam guillotine was quickly able to relieve you of if. ",
            "date": "Answered July 1, 2019",
            "views": "39",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Patrick Earley",
                    "user_href": "/profile/Patrick-Earley-15"
                }
            ]
        }
    ]
}