{
    "title": "What was the housing like in Victorian times? - Quora",
    "tags": [
        "Victorian Houses"
    ],
    "response": [
        {
            "author_info": {
                "name": "Tim Restuvelli",
                "href": "/profile/Tim-Restuvelli"
            },
            "answer_text": "That is a difficult question to answer on several accounts. First, the period “Victorian” covers almost a century during which there were enormous demographic changes following the release of labour from agriculture into the burgeoing cities. Second, technology moved on to a very significant extent seeing the introduction of domestic gas and electricity. Third, there were large disparities in wealth and, consequently, housing between the rural poor, city poor, the burgeoning middle class, and the landed gentry (including, in the early part of the period, many drawing wealth from slavery and the sugar plantations and compensation (!) from the emancipation of their slaves. The National Trust properties (check out their website), so beloved of genteel British tourist in their own country, housed a tiny number of hugely rich individuals living in luxury served by a much larger number of domestic servants earning little money, living in sparsely furnished attics and, for the women, being dismissed when they married or “fell” pregnant. Many emergent middle class entrepreneurs and industrialists emulated the splendid homes of the landed gentry. The conditions for the industrial working class could be horrifying. Try reading Engels’ “Condition of the Working Class in England” (little wonder he became a Communist!) which provides an excellent and readable but dismal description of the Manchester mill workers’ conditions. Or you could read “The Ragged Trousered Philanthropist” for the conditions of painters and decorators in a British coastal town of the era. If you read “Tess of the D’Urbevilles” you’ll get an idea of rural poverty in Dorset in the early part of the period. London, as usual, was a place of huge contrasts. Splendid buildings were being put up (Kensington, Chelsea, Mayfair) yet the East End was a place of grinding poverty, lousy health, prostitution, crime and desperation. Interestingly, a unified, uniformed police service emerged at this time but it is difficult not to argue that their prime duties were to protect the property of the rich and manage a poverty-stricked underclass. If you get a chance visit the Welsh National Museum’s site in St Fagan’s (Cardiff) you will see and enter buildings of all periods that have been collected and reassembled on one site. (Welsh miners lived in appalling conditions in Victorian times and, by the time my grandfather moved there to become a collier in 1898, they had improved a little - but, in Merthyr Tydfil at least, not by much.) So the answer really is that housing ranged from the huge mansions of a very small number of people to the foul slums of a large number of people. However, industrialisation in the latter part of the period saw a growing number of people fighting their way out of poverty in a more stable working class. My personal view is that we, in Britain, are overawed by the splenour of the few in country mansion luxury and have forgotten, if we ever realised it, that almost all of us are descended from the huge majority whose Victorian existence was one of hard physical labour and a precarious domestic economy in overcrowded, unhealthy cities, punctuated by periods of destitution. (It is no surprise that labour unions emerged in the same period. With Uber, Amazon delivery drivers and others now experiencing the Victorian custom of zero-hours contracts, it is to be hoped that they will rise again soon!) ",
            "date": "Answered May 22, 2017",
            "views": "285",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Emily Haupt",
                    "user_href": "/profile/Emily-Haupt-10"
                },
                {
                    "user_id": "Nilsa Pena",
                    "user_href": "/profile/Nilsa-Pena"
                }
            ]
        }
    ]
}