{
    "title": "What are some unwritten social rules everyone should know? - Quora",
    "tags": [
        "Social Rules",
        "Unwritten Rules",
        "Social Dynamics",
        "Rules and Guidelines",
        "Manners and Etiquette",
        "Society"
    ],
    "response": [
        {
            "author_info": {
                "name": "Hiram Mason",
                "href": "/profile/Hiram-Mason"
            },
            "answer_text": "The list as known to an American man from the South, who is currently living in the North for his occupation: Unless you are addressing your young son, you don't talk to other men in the restroom.If possible, when in the men's restroom, at least one urinal space between men.A woman's worst enemy is another woman. ( Married men especially know what I'm talking about… your wife's biggest problem at work is that other woman she can't stand) Proof of point: Women worldwide, and in the U.S., are the major population. If they wanted to, they could out-vote men on everything. If they could stand each other and enough of each other long enough, men shouldn't be the predominant sex of politicians in republics and democracies, but they are.When men are together amongst themselves, they talk about all manner of things, especially the things you can't talk about anywhere else because it's “politically incorrect” or someone will get their feelings hurt, even if it is the truth. 90% of them think all that stuff is ridiculous and gotten out of hand anyway.If you're a woman in the workplace, unless you are truly being sexually harassed, threatened, or blatantly demeaned, being the one who goes to H.R. because of what one or more of the men where talking about (especially when you're not part of the conversation to begin with) because of bad words or something offended you, know that you accomplished nothing, except becoming the person they all agree they can't stand in the workplace. Now they're still going to say whatever, just while you're not around. You don't prove equality to men by making us treat you different. If you really wanted respect, you'd join in with us, and give as good as you got. Then they wouldn't pretend you're an equal, you'd BE an equal!In the U.S., you have the right to be insulted by what someone says as much as they have the right to say it. It's a two-way street.If you are a man, you ALWAYS hold the door open for women and the elderly.Almost every young (and that's the key word here) woman will tell every guy she talks to how she's “not like other woman”, apparently without any of them picking up on the irony that she's saying the same thing the last five women you spoke to at the gathering/party/event just told you.No matter how much a woman says that in this day and age men and women should be treated the same and equally, she still expects you to pay for the movie, activities, and dinner on dates. She will also expect you to open the door for her. Yes, the irony is palpable and it seems like a double standard, but do you want to argue the point or see how the date/relationship goes first?Even though the right to bear arms is a right granted in the Constitution, there are more firearms than people in the U.S., and if you added up all the hunters ALONE (don't include collectors, people who have weapons in the home for self-defense or other purposes, or people with handgun/carry permits), they still out number any other army in the world. Yet, there's always someone in the group somewhere that acts shocked and amazed when they see a person with a firearm like they don't know what country they're in.Always show your elders respect, no matter how old you are, especially if they're family.A lot of people say publicly that they don't like “old school” traditional men because they're relics of a past era. That is until the women date enough to complain they can't find a “good man” who'll treat them “right” or like a “woman”. Or they're tired of men who can't protect or provide for themselves, much less anyone else. For the hipster old boys, they need their help once they realize that the world can, not always but often does, kick your butt and real women don't want an old boy, they want a man. On the other hand, some people say it to fit in or be politically correct. Then everyone sits around wondering why divorce rates are over 50% and a lot of biological fathers aren't truly Dad's. Or why crazy nut jobs are going schitzo with guns on innocent people… the firearms were just as powerful and fast 40 years ago and a higher percentage of the populus carried then. Perhaps the problem isn't the firearms, perhaps it's the lack of traditional men and people being raised how to properly use and handle them safely.Hunting is often seen as taboo now days, and even though that's doesn't matter to most hunters, there are fewer hunters now than in my past. Hunting game has is part of a man's instict and has been with us since the beginning of Mankind. For those who try to deny this fact, realize that there is a reason humans have incisors and canines as teeth... they're not for wheatgrass or kale. Realize, too, that there are rules to hunting that true hunters follow: 1) you eat what you kill. 2) you don't take a pregnant doe. 3) you don't take a doe with two or three fawns following behind (A helpful hunting and driving tip most people seem to have forgotten, does give birth in sets of twins, sometimes triplets, though not the norm. So, if you see a doe cross the road with a fawn behind it, down go yet, wait for the second and possibly third fawn). 4) if you don't plan on eating what you kill, or giving it to someone who will, you have no business hunting. 5) a hunter uses as much as the kill as possible. (The head may stuffed as a trophy mount, but realize that the skin and such are mounted on foam, the meat is processed. The stuff you're eating called “head cheese” on a Ritz crackers is the brains. Often, if not mounted, the antlers are used to hunt in following seasons to mimick the sound of two bucks battling during mating season called “rut” to attract other deer… other bucks who may want to join the fray or defend territory, does to see who the winner is as a prospective mate.) These same rules apply to other game, such as boar, elk, moose, bear, etc. 5) if you're hunting at one of those special reserves that stock fowl, like quail or pheasant, with the wings clipped so they can't fly away, you're not hunting, you're just trying to stroke your ego.I have my young sons help me clean the game I've taken on a hunt. Why? Because I want to frighten them? NO! Three reasons: 1) It is a family tradition that males know how to hunt and prepare game I wish to pass down. 2) I believe it is a skill they should know. Even if, once adults, they should choose not to hunt for sport, I want them to know how to do these things in case it should become a necessity for whatever reason. 3) To hunt and clean game is to see and become acquainted with death first-hand. There is no nice, polite way to put this. However, when properly taught and in learning the lesson of death, they come to know what weapons do, up close and personally. The link and correlation between weapons, firearms and more ancient weapons like bows, and their lethal capabilities are firmly made and understood. I am left to wonder often, that if more children were introduced to these concepts in today's world, as they would have been in days not-so-far-passed, we might have less tragedies and accidents, as the power and implications of using a weapon would be firmly and inrevocably known and understood, instead of it being a far-flung notion barely grasped based in a modern lifestyle in which when something goes wrong, one simply hits the “restart” button or has more lives to play.Your parents are always going to try and give you advice, suggestions, or what they believe is a “better way” because no matter how old you get, you are still their child. Stand there and listen without disrespecting them. When you or they leave, consider their advice, but if you disagree, you're still an adult, do as you believe. You can do this without arguing or insulting them.A recent study and report from the Department of Defense found that roughly half (48%) of the U.S. Armed Forces are compromised of those from traditionally Southern States (they were even listed: Virginia, South Carolina, North Carolina, Georgia, Kentucky, Tennessee, Alabama, Mississippi, Arkansas, Texas, Missouri, and Florida.) When giving an analysis for why this should be, the Department of Defense listed many reasons, such as: familiarity with firearms, strong sense of national pride and patriotism, the practice of the more “traditional” family values which came with it an almost “built in morality that accepted a reality in which protecting others and their sense of 'right' may, at times, require the use of force, or even violence, against an adversary set upon the same” (to use the Department of Defense's own words), the practice of a more traditional family structure and hierarchy, usually patriarchal, that seems to make their adjustment and acceptance of the military hierarchy much more easy, a sense of obligation to serve one's nation and fellow citizens, and many other qualities. What I find interesting is that one of the parts of the country with the least as far as population should contribute the most. Moreover, its extremely intriguing that the reasons listed for this are very much similar to the characteristics other parts of the country poke fun at us for possessing. Another roughly 20% of the military is composed of either immigrants or the children of immigrants. I find this intriguing as well. This means that roughly 70% of our Armed Forces are composed of those regularly demeaned as either “backwards” or “un-American”. Perhaps, if these figures were more commonly known, the practice of thinking of Southerners as uneducated and useless, and immigrants as something to fear and keep away, might change rather quickly when Americans realize that a majority of those protecting their freedoms are the very people they ridicule, chastise, and belittle.I f you're a man, don't hug other men you don't know when you first greet them. Most of us don't like it!If the woman of the house in you're in prepares you a meal out of hospitality and kindness, eat it! No matter how much you don't like it. If you don't, you can hurt their feelings, insult them, and thereby insult the man of the house because you just made the person he cares for most upset.If you cuss out, yell at, threaten, try to intimidate, our blatantly disrespect a grown man, don't be surprised when you get punched. And after you do get punched, don't call the cops and also expect help. In a lot of states, such as the one down South I'm from and the one up North I'm currently living in, they have “Fighting Words” laws, whereby if another reasonable person finds what you said was to be meant as purposely antagonizing, derogatory, inflammatory with the intent to anger, or alluding to harming or defaming immediate family, then the person you said that to has every right to knock your loud mouth out.Never hit a woman. (Unless she's coming at you with a weapon or you've restrained yourself, but she's continued to assault you to the point of causing bodily injury) Yes, it may be another “double standard” based on what those screaming are saying abound men and women shouldn't be treated differently, but don't sacrifice your honor and morals as a man based on the loud mouth of a fool.It's okay to speak up to someone else if they are doing something agregious in public. ( Ex: don't just sit there with your mouth shut if you see a man verbally or physically abusing a woman. Ex: parents might spank children, but if you see a parent cold-cock them in the head, that's obviously excessive. Ex: if someone is belligerently drunk, aggressive, or inappropriately behaving in public toward other individuals)Most men truly are so simple that women over-think us. There isn't any other intent behind our statements. If we say we're hungry, it means we're hungry, not that we're upset dinner isn't made or something. If we say we're tired, it means we're tired, not that you're boring or uninteresting. When women ask us what we're thinking and we reply “nothing”, we really do mean that we're thinking about literally nothing. Yes, it's possible for us to do. Sometimes, its our favorite thing to think about.Most men are good at completing a lot of tasks, just one at a time. Unlike women, we suck at multitasking. If you insist we multitask, then don't be surprised when the result is a cluster and disastrous.If someone waves you through an intersection or let's you in front of them, you wave back as a thank you.Yes, that trucker in the semi is going to cut you off or pull out right in front of you. Yes, it's annoying. But 1) his rig is much bigger than your smart car and 2) do you really expect someone who has been by themselves for the last week (with only the company of other truckers who have been alone to talk to via CB radio) to be anything else but antisocial and a bit rigid?While both men and women are equally important and worthy of equal respect, that doesn't mean we were designed to do the same things. That's not an opinion, that's scientific, biological, and evolutionary fact.When on highways in neighboring states, drivers from the State of Illinois will drive next to each other in all lanes (even three and four lane wide highways) while going the same speed so no one else can pass.In a lot areas in the U.S., while on the interstate, the speed limit is the MINIMUM speed you should be going, especially if you're in the fast lane.If you see a cop hiding to catch people speeding, once you pass them, you blink your headlights 3 times to let on coming traffic know that there is a cop up ahead.Unless you are from the South, New York, Boston, or California DON'T try to use their accents and unique words/phrases. You just sound ridiculous and you are probably going to insult them because they may think your mocking or making fun of them.When traveling, don't make fun of regional or foreign customs and events. You WILL NOT succeed in getting them to change how they do things, but you WILL succeed in making yourself look like an uncooth a@#hole.Don't try and cut in line. You're not going to fool anyone else by trying to slip in, but you may upset someone enough to cause problems for yourself.Unless they're religious and doing it in Church before God, Americans don't bow or kneel to anyone. So if you're a Duke, Earl, or even a King or Queen, if you come here, don't expect it from us like you do from the people in whatever country you're from.When a funeral procession is passing you on the road, you pull over, take off your hat if you're wearing one, and wait AT LEAST until the hearse passes. It's just respect.You stand, remove your hat, and put your hand over your heart when the National Anthem is played. PERIOD. For most it's simple patriotism. However, even if you disagree with the government or current policy, it's also about honoring those who gave their lives for our country and freedom. So, even if it want to kneel during the National Anthem to make a statement, maybe you should stand up in respect of those who made the ultimate sacrifice so that you could have the freedom to disagree with your own government. If you insist on kneeling during the National Anthem, don't act or claim to be surprised when so many people see you, not as “making a statement”, other than a statement of disrespect and rudeness. You're free to thumb your nose at societal norms, but remember that the overwhelming majority of those in that society are free to think you're an idiot, to put it politely, for doing it.Making more money than everyone else doesn't make you better than everyone else. And since you chose to live in this country, remember it doesn't make your opinion more important than everyone else's. (Ex: on Election Day, the poorest citizen's vote counts as much time the richest citizen's)Just because our culture is permeated with sexual innuendo and adults (especially men) may think about sex a lot, does NOT mean anyone wants the details of your sexlife.If warranted, you may respectfully disagree with someone. Trying to shout someone down, making them feel small or stupid, or becoming irate because they don't think as you do is not respectfully disagreeing. It's being an ill-mannered jerk.When putting gas in your car at the station, no one else wants to hear your sound system. If you're the person with the music all the way up, with the windows down, and your woofers pounding out base, then realize that everyone is looking at you, not because you're “cool”, but because everyone wants to see who the disrespectful jerk with the horrible music is.Yes, relationships, especially marriages, are 50/50 as people say. However, those 50%’s aren't the same. We're meant to COMPLEMENT each other, not be clones of one another.Most people hate warriors until you're standing between the enemy and the gate.***Just to clarify, since messages I've received are from some who think I'm a crotchety conservative old man, I am only 35 years old. And, other than when it comes to family and personal morals/values, I am the farthest from conservative one could imagine. This is where I am: I'm all for progress. I just don't believe that it must come at the expense of who we are and where we come from. Progress for the sake of progress is not progress at all… it's continuing to drive forward without a destination and no map. Progress and advancement should come from the desire to achieve a known goal or overcome a common obstacle for the betterment of Man as a people, not simply to put more money and power in the hands of the elite, and unwise, few. Greed does not beget wisdom. Immense personal wealth concentrated in a small, selfish group does not help mankind as a whole. (I'm not saying that you cannot be welloff or have some nice things you desire.) I'm saying that there comes a point and time were more wealth is simply greed, narcissism, arrogance, selfishness, excess, vanity, self-indulgence, pride run amuck, and extreme material gluttony. Truly, what does any ONE person need with $112 billion all to themselves? (Jeff Bezos of Amazon) That's enough money for him to personally buy is own fleet of the new, and world's largest and most advanced, Gerald R. Ford aircraft carrier, which cost a mere $12.998 billion per unit in the 2018 fiscal year. And if he's economy shopping, he can get the Nimitz class aircraft carriers for a mere $4 billion per ship. REALLY, TRULY THINK ABOUT THIS: This one man has enough money to buy his own fleet of the world's largest, most advanced warships, and thus have a personal navy more powerful than most COUNTRIES on Earth possess, and still have BILLIONS TO SPARE! And why does a 21 year old need to be a billionaire, much less the world's youngest billionaire? (Kylie Jenner) There is no reason that THIS MUCH WEALTH should be concentrated in the hands of so few. Yet our society, composed of other Americans espousing the idea of equality, saw fit to bestow this vast wealth upon these other Americans, whether we realize it or not, creating a scenario of defacto inequality and a HUGE disparity. They can be rich, but this is the excess I eluded to earlier. When our teachers, police, firefighters, and other first responders like EMTs, paramedics, and ambulance drivers do not make a living wage, and struggle to provide from one day to the next, while also being the very people we entrust to educate our children, protect and safeguard our citizens and society, and to answer the call when our lives are LITERALLY on the line and in their hands, but Kylie Jenner can be the world's youngest billionaire because of her important societal role of… umm… uhh… let's see here… I'm drawing a blank… OH! Something to look at (?), then our society is off kilter and our principles have run of the rails. As another example, I believe, as an extremely proud and patriotic American, that there is no excuse whatsoever for ANY American to go hungry and without food. There is no excuse why ANY American should go without warm and proper clothing. If we are capable of making a 21 year old a billionaire for, it seems to me, no good apparent reason, or a computer programmer the 2nd richest man in the world (Forbes, Feb. 2019), and make a man who founded an online store for curiosities, trinkets, luxuries, or simply the convience of having our goods delivered to our doors, the richest man in the world with an ungodly sum of $112 billion (you know what, let me write it out in the long numerical form with all the zeroes so people can truly get the effect: $112,000,000,000.00), who are all Americans, created by Americans, by the way, then there is no reason we, as Americans, cannot make our great country hunger and poverty free as well!!! Hell, if the people I just referenced donated even a quarter of their money to such a cause, we'd be well on our way, and they'd still be insanely, stupid rich. For crying out loud, Pope Francis leads 1.3 billion Catholic Christians and the Queen Elizabeth II is the monarch and Head of State for an entire first world nation and the Commonwealth, yet they do not command the personal wealth of many of these single individuals! But apparently Ms. Jenner's ability to wear tight and revealing clothing, and successfully apply makeup seems to be far more important. (And don't get me wrong, she's an attractive young lady who's easy on the eyes, but so are an incalculable number of other American women who don't act as if you owe them something because they've ‘graced” you with their presence… so what's so special?) Hell, perhaps if she worked on how she presented herself, and simply acted and spoke as if she could carry on an academic, intellectual conversation with words larger than four or five letters, anything other than “look at me, I'm hot and so are my sisters\", I'd probably give her a little more leeway. ",
            "date": "Updated August 6, 2019",
            "views": "125",
            "upvotes": " View 89 Upvoters",
            "upvoters": [
                {
                    "user_id": "Kamerin Morales",
                    "user_href": "/profile/Kamerin-Morales"
                },
                {
                    "user_id": "Edgar Tagorda",
                    "user_href": "/profile/Edgar-Tagorda"
                },
                {
                    "user_id": "James Arthur",
                    "user_href": "/profile/James-Arthur-265"
                },
                {
                    "user_id": "Paula Slater",
                    "user_href": "/profile/Paula-Slater-14"
                },
                {
                    "user_id": "Johnathen Ramos",
                    "user_href": "/profile/Johnathen-Ramos-1"
                },
                {
                    "user_id": "Preetham Thelluri",
                    "user_href": "/profile/Preetham-Thelluri"
                },
                {
                    "user_id": "Kathleen O'c",
                    "user_href": "/profile/Kathleen-Oc"
                },
                {
                    "user_id": "Lynn Suzanne",
                    "user_href": "/profile/Lynn-Suzanne"
                },
                {
                    "user_id": "Mary Mimouna",
                    "user_href": "/profile/Mary-Mimouna"
                },
                {
                    "user_id": "Frances John",
                    "user_href": "/profile/Frances-John-7"
                }
            ]
        },
        {
            "author_info": {
                "name": "Phoebe Flessas",
                "href": "/profile/Phoebe-Flessas-1"
            },
            "answer_text": "Oh god, I’ll have a field day. Use your *bleep*ing indicators when driving. Nobody wants to crash.You see those lines in the parkin lot? That’s where one car goes. One. Which means you cannot take up two spaces or even three just because you choose to drive a mobile phallic compensator you inconsiderate asswipe.While I’m on the subject of parking - No you cannot just dump your car wherever you like if the parking lot is full and I don’t care if you think there’s enough space for my car to get out. I have a hammer in my boot and I will not hesitate to destroy your car for blocking me in.Before you leave the car after parking, always check: that you are not blocking anyone; that you are not parked so close to the other car that the driver cannot open his freakin door enough to get in; that you are not blocking any special needs passages or the bloody sidewalk, it’s there for pedestrians not your damn car.I don’t care if you ‘will only take five minutes’ or ‘picking up a child’ or any other excuse: you cannot turn a busy 2 lane street into single lane just because you can’t be arsed to walk from an actual parking spot.If you hear sirens whe driving, move out of their way. You can always afford to be a few mintes late. The fire truck/ambulance/police vehicle blaring at full power cannot.When the subway, inter-city train, bus or elevator arrives, for the love of god, step aside and let people get off before charging in. Otherwise getting an earf ullof vulgarity is your own damn fault.Old people: all the respect but please. If someone is looking tired as fuck and wearing headphones and yet glances at you as you seat yourself beside them, they are not inviting you to tell them your life story or vent and they certainly don’t care to hear whatever grievance you have with their generation.If you are going to invite known introverts and socially awkward friends to your child’s party, be a decent human being and give them a modicum of attention after the greeting. Talk to them. Encourage them to get talking with others. Don’t let them fade into the wall and wonder why the fuck you invited them in the first place.Old people again - respect is earned and charity cannot be forced. Nobody wants to give up their seat to an old bag shouting at them. No, you don’t deserve it more than them; some ‘kids’ today work more than you probably ever did and are under much more stress than you. Being polite costs you literally nothing, you condescending old farts.‘Not making a scene’ is never more important than the well-being of a fellow human being.Be kind, patient, polite and friendly with any and all service staff, salespeople and waiters in any place you visit. They will reciprocate.In movie theatres, please be quiet. People come to watch a movie, not listen to your gob.Stop bringing children in movies in huge gaggles you cannot control. Just don’t. It never works.",
            "date": "Answered April 28, 2017",
            "views": "2",
            "upvotes": " View 14 Upvoters",
            "upvoters": [
                {
                    "user_id": "Denise Mazzei",
                    "user_href": "/profile/Denise-Mazzei"
                },
                {
                    "user_id": "Lauren Cary",
                    "user_href": "/profile/Lauren-Cary-3"
                },
                {
                    "user_id": "Olivia Plumb",
                    "user_href": "/profile/Olivia-Plumb-5"
                },
                {
                    "user_id": "Benjamin Cat",
                    "user_href": "/profile/Benjamin-Cat-2"
                },
                {
                    "user_id": "Zetus Aquarittarius",
                    "user_href": "/profile/Zetus-Aquarittarius"
                },
                {
                    "user_id": "Jon Stendebach",
                    "user_href": "/profile/Jon-Stendebach"
                },
                {
                    "user_id": "Riley Smith",
                    "user_href": "/profile/Riley-Smith-562"
                },
                {
                    "user_id": "Nora James",
                    "user_href": "/profile/Nora-James-32"
                },
                {
                    "user_id": "Tess Rempel",
                    "user_href": "/profile/Tess-Rempel-1"
                },
                {
                    "user_id": "Srishti Sagar",
                    "user_href": "/profile/Srishti-Sagar-4"
                }
            ]
        }
    ]
}