{
    "title": "What makes people want to be writers? - Quora",
    "tags": [
        "Artwork",
        "Creativity",
        "Novels",
        "Writers and Authors",
        "Books"
    ],
    "response": [
        {
            "author_info": {
                "name": "Phrederick Hume",
                "href": "/profile/Phrederick-Hume"
            },
            "answer_text": "\"The great advantage of being a writer is that you can spy on people. You're there, listening to every word, but part of you is observing. Everything is useful to a writer, you see -- every scrap, even the longest and most boring of luncheon parties.\" -Graham Greene  For the sex. I mean, yeah, you walk into a bar and say you're a writer and they throw themselves at you. Right? No? Oh yeah. That's bar staff.  For the money. Cough. Sputter. Laugh maniacally. Even publishers have a hard time making money out of writing. The statical odds of becoming Stephen King or J.K. Rowling are ridiculous. No matter how good you are and how hard you work. If that were the reason it would be better off to pursue a dedicated career as a lottery player.   Everyone who has answered a question here on this website is a writer. To varying degrees, each of us knows the pleasure or struggle of crafting language, structuring the sound and semantics, into something that can bridge the void between two minds. Magic. Sharing thought, feeling, and making us all a little less alone. Some find it addictive. The desire to be a Writer starts somewhere in that magic and addiction. If you get hooked on it early enough in life, or maybe at the right time when you need it to express the extremes of love or grief, it isn't a question anymore of wanting to be a Writer. You are one. It is a vocation. Sometimes that feels like a blessing, sometimes like a curse. There are people who can take it or leave it. Many people here are like that. Maybe their interests are technical, social or pedagogical. They can craft good answers, and move on.  But some of us keep revisiting our answers all the time, altering a word here and there. When we have the time, we intensely scour through the questions posted for something we can really unleash all of our energy on. It is all we can do not to read every answer in the edit mode from the instinct to hone, tweak, practice. This need to practice it, this addictive nature of creation, is shared by all the other arts. You are a painter because for some reason you need to paint. You do. Maybe someone will pay you to paint their portrait, maybe they will buy something you have already done. Maybe not. So what? You have to paint, to keep creating, to keep practicing. You are compelled to get it right.  Because unlike paint, everyone uses language, the distinction between someone who writes something and \"a Writer\" is either meaningless or the absolute crux of the matter, depending on your perspective.  It is not so different from being an engineer or a doctor. You can be a person who happens to choose engineering as a profession, or you are an Engineer no matter what you do for a living;  tinkering, learning, improving, creating. (It may be that one of these addictions leads to others, there are painters who write very well, James Abbot MacNeil Whistler's The Gentle Art of Making Enemies comes to mind as do D.H. Lawrence's paintings).   Lawrence painting Whatever else we become, engineer or lawyer,  waiter, sommelier, teacher or venture capitalist specializing in high-tech startups; inside our heads we are scribbling. Every experience, each scene in our daily lives, each person we meet is being examined as literary fodder. How to write this? What would that person look like from another perspective, how to describe them? What is exactly, precisely, the right word for that?   (Randy Newman wrote a brilliant song for his ex wife. Many writers will recognize their own reflections in it. He sings of the regret he feels,  the emotion surges, and just as it is starting to peak, he  sings \"It is a little bit cold, for all those concerened, but I'd sell my soul--and your soul--for a song, so I pour my heart out\". That ironic self-regard coexisting with the sincerity and intensity of emotion is one of the weirdest things about being a Writer. And sometimes one of the hardest things for the people we love to live with. Which is why Randy put it in the song, which makes it ironic on so many levels.)   Randy Newman: very much a writer's musician.  There are so many different kinds of Writers, but maybe the only thing we share, that unites us, is that addiction to the magic. There are many reasons to write books. To communicate information. To teach. Because you have received a hefty advance from a publisher. But there is no other good reason to be a Writer. Some people start writing books for another reason, develop the addiction and then become Writers. Once you accept that you can not give it up, you will need to organize your life around it.  Some Writers are drawn to professions where they can write professionally, others not. Some teach. One of the greatest of the 20th century worked in a bank and another was an insurance executive.  A writer can be anything, and the range of personality, profession and lifestyle is vast. You can be a spy like Daniel Defoe or Ian Fleming. There are Edward R. Murrows, and who use their writing to find fact, separate propaganda from truth and inform. Orwellian essayists, memoirists, magical short story writers like Saki and Maugham. There are people who can write anything like Kipling . There are wry, Flamboyant Oscar Wilde types and seductive Théophile Gauthiers. Shavian world-reformers. And giant reclusive anatomists like Flaubert. Word-drunk world builders like Salmon Rushdie. Kerouacs, or Hunter S. Thompsons, that make some people say, \"Man I want to do that, I want to live like that amd write like that!\".  Writers that are rock stars living on the edge.  Hemmingway and Faulkner disciples battling it out for the soul of the American novel. There are the undefinable writers like Robert Pirsig or Douglas Hofstadter  occupying a space between science, philosophy and literature. That should be funded by think-tanks.   Science, Zen, Math, but above all literature There are Philip K. Dicks that work in record stores and Roger Zelaznys teaching romance languages while expanding the very limits of our imaginations.There are technical writers, and food journalists, and academic prose specialists. There are our fellow Quorans, some of whom are not only Writers but good ones, who brighten our day. There are the best of us all, the Poets, born to sing their hearts into our memories and change the very way we use language itself. If you are already one of us, you will know when the magic first started drawing you in, when you knew you had to have it, practice it, create it.  I expect for many of you, it starting something like this: Sitting in your grandmother's lap, her eyes sparkling, and her voice rising and falling, reading stories that started out, \"Once upon a time….\" Il était une fois, Es war einmal....    Your Bonus trivia for those who managed to read to the bottom of another of my long posts: What does Quora have in common with this: the Perfect Mousetrap opening from Elementary?    As Marc Bodnick's post Why is Quora so addictive? makes completely clear to me; Quora is being designed as the Perfect Writer-Trap. Thank you very much for asking, User! I really hope the answer pleases and informs. Other people are more qualified, but this is my take on it. Which may be a cop out, because all it fundamentally says is that some of us just don't have a choice. Reactions to my reflections or their own answers would be really interesting from: Mac Gander, User,Dave Cheng ",
            "date": "Answered December 2, 2013",
            "views": "35",
            "upvotes": " View 15 Upvoters",
            "upvoters": [
                {
                    "user_id": "Mallik Gurram",
                    "user_href": "/profile/Mallik-Gurram"
                },
                {
                    "user_id": "Jaime Fuhrman",
                    "user_href": "/profile/Jaime-Fuhrman"
                },
                {
                    "user_id": "Joanne Wong",
                    "user_href": "/profile/Joanne-Wong-14"
                },
                {
                    "user_id": "Sramana Dan",
                    "user_href": "/profile/Sramana-Dan"
                },
                {
                    "user_id": "Ankit Maloo",
                    "user_href": "/profile/Ankit-Maloo"
                },
                {
                    "user_id": "Dave Cheng",
                    "user_href": "/profile/Dave-Cheng"
                },
                {
                    "user_id": "Dinesh Dharme",
                    "user_href": "/profile/Dinesh-Dharme"
                },
                {
                    "user_id": "Siddharth Agarwal",
                    "user_href": "/profile/Siddharth-Agarwal-5"
                },
                {
                    "user_id": "Naveen Durgaraju",
                    "user_href": "/profile/Naveen-Durgaraju"
                },
                {
                    "user_id": "Jash Dholani",
                    "user_href": "/profile/Jash-Dholani"
                }
            ]
        },
        {
            "author_info": {
                "name": "Feifei Wang",
                "href": "/profile/Feifei-Wang-6"
            },
            "answer_text": "I don't want to be a writer. If given the choice, I'd rather NOT be a writer. I'd rather be a programmer or doctor or one of those cool STEM people. I'd rather tell people I'm a contributing member of  society and my existence has helped people in real, tangible ways. Then I could be proud of myself for actually making the world a better place. Why would anyone want to be a writer, indeed! It's such an embarrassment.  But, somehow, I end up writing. I used to be an artist, which is even worse. Writers only give out the vibe of being stupid, artists... oh, man don't get me started on artists. We are either crazy, or starving—most likely both—and if we're not we must be faking it, because everyone knows artists are crazy people.  I mean, I don't want to call myself writer except I really don't have other words to describe a person who writes average 3k-5k words daily telling a story that never really happened. I have a day job, I do. And I love my day job. But after I get off work, I go home, I sit down, and I write.  It sucks really. I can't tell people I'm writing because I know they'd probably secretly (or somewhat openly) give me that \"yeah right...\" look and think of me as a loser. And I don't get paid; most likely I'll never get paid for this. I don't have readers other than friends and family, which is in itself quite pathetic. And I constantly worry about my characters and my story line. I think about my scenes, dialogues and conflicts all the time. It is exhausting.  But I cannot not write it out. That's the thing about creative work in general I think. Drawing, writing, painting... It's this itch you have to scratch or you lay there in the middle of night and think about it. I once finished 10k-word count chapter at 4 am, laid in bed thinking about the next scene for 2 hours, jumped out of bed at 6 to get myself a coffee and continue writing until 9, and went to work. Of course I crashed pretty hard that evening, but that's the drive I get when there's something in my mind and I have to write it out.  I wish I was built differently. I really do. I feel that if I wasn't built this way my life would be a lot easier, a lot smoother, I might be happier. Then I remember the intense joy I feel when I draw or write—that euphoria that increases my heartbeat and gives me goosebumps. This is a drug and I'm fucking addicted. I don't care about what people call me... I just want to put words or pigment together and be happy. ",
            "date": "Answered July 21, 2015",
            "views": "89",
            "upvotes": " View 115 Upvoters",
            "upvoters": [
                {
                    "user_id": "Nixa Gh",
                    "user_href": "/profile/Nixa-Gh"
                },
                {
                    "user_id": "Valarie Ojiem",
                    "user_href": "/profile/Valarie-Ojiem"
                },
                {
                    "user_id": "Iris Hwang",
                    "user_href": "/profile/Iris-Hwang-2"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/Antiganee"
                },
                {
                    "user_id": "Jennifer Parker",
                    "user_href": "/profile/Jennifer-Parker-428"
                },
                {
                    "user_id": "Keertish Kumar",
                    "user_href": "/profile/Keertish-Kumar"
                },
                {
                    "user_id": "Vipul Singh Thakur",
                    "user_href": "/profile/Vipul-Singh-Thakur-7"
                },
                {
                    "user_id": "Thejasvi Kanuparthy",
                    "user_href": "/profile/Thejasvi-Kanuparthy"
                },
                {
                    "user_id": "Niraj Jani",
                    "user_href": "/profile/Niraj-Jani-4"
                },
                {
                    "user_id": "Linh Gray",
                    "user_href": "/profile/Linh-Gray"
                }
            ]
        }
    ]
}