{
    "title": "What is the word count for a 200 page novel? - Quora",
    "tags": [
        "Word Counts",
        "Novel Writing",
        "Book Writing",
        "Novels",
        "Writing"
    ],
    "response": [
        {
            "author_info": {
                "name": "Judy Gill",
                "href": "/profile/Judy-Gill-2"
            },
            "answer_text": "In North America, the standard used by editorial staff in figuring word count is 250 words per page, 10 words per line (using a 12 pt. font), 25 lines per page, with the page set for double spacing and no extra space between paragraphs. Hence, a manuscript (not a published book) of 200 pages is figured at 250 wpp x 200 pages = 50,000 words. Your computer count will be considerably different from this basic calculation and when I was under contract to several NA publishing houses, they weren’t at all interested in what I thought the word count was. They used their formula and that was that. I see in a sidebar on this page the question “Roughly how many pages would 50,000 words produce in a standard paperback format?” Look at any Mills & Boon or Harlequin romance novel packaged as a rack-sized paperback and you’ll have a fair idea of the size of book you’d get. Books of 50K to 75K will fit into that format. The differences will be in the font chosen by the House, the style of page—that is, does each chapter start half way down, does each chapter end with an empty page—and how many advertising pages will there be at the end of the book and how man blank pages at the beginning. The ultimate word-count of the book can determine if the dedication needs to be included on the copyright page or given its own page. ",
            "date": "Answered July 28, 2018",
            "views": "133",
            "upvotes": " View 6 Upvoters",
            "upvoters": [
                {
                    "user_id": "Raymond van Over",
                    "user_href": "/profile/Raymond-van-Over"
                },
                {
                    "user_id": "M. Valentine",
                    "user_href": "/profile/M-Valentine-5"
                },
                {
                    "user_id": "Kaylee Kolditz",
                    "user_href": "/profile/Kaylee-Kolditz-1"
                },
                {
                    "user_id": "Cooper Brodin",
                    "user_href": "/profile/Cooper-Brodin-1"
                },
                {
                    "user_id": "Rebecca Sontag",
                    "user_href": "/profile/Rebecca-Sontag-1"
                },
                {
                    "user_id": "Eric Supple",
                    "user_href": "/profile/Eric-Supple"
                }
            ]
        },
        {
            "author_info": {
                "name": "Michael Dellert",
                "href": "/profile/Michael-Dellert"
            },
            "answer_text": "That depends on the format. If it’s a standard manuscript page (~250 words per page), that’s ~50,000 words. But if it’s printed and bound, it depends on the trim size, the margins, the bleed, the gutter, the font size, the leading, and the kerning. Too many factors to provide a universal standard. For any particular book, you count the number of words in the line of a representative page, multiply by the number of lines on that page, and then multiply by 200. ",
            "date": "Answered April 26, 2019",
            "views": "13",
            "upvotes": " Answer requested by Marcy Meacham",
            "upvoters": [
                {
                    "user_id": "Aashay Mylapilli",
                    "user_href": "/profile/Aashay-Mylapilli"
                }
            ]
        },
        {
            "author_info": {
                "name": "Indra Neel",
                "href": "/profile/Indra-Neel-9"
            },
            "answer_text": "Hi Aashay, thanks for the A2A. Besides the font, it also depends on the dimensions. I can only give generalized answer here - there are an average of 32–33 lines per page and a common font size should give one 12-odd words per line, which gives one 390-odd words/page, which in turn would give one 78000-odd words in a 200-page book. Even millimeters of change, either increasing or decreasing the dimension of the book could have an impact. More words/line means a smaller font size, lesser words/line means a larger font size. So the maths involved here is open to debate. ",
            "date": "Answered June 5, 2017",
            "views": "44",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Daniel Dejsus Pertz",
                    "user_href": "/profile/Daniel-Dejsus-Pertz"
                },
                {
                    "user_id": "Lana Krumwiede",
                    "user_href": "/profile/Lana-Krumwiede"
                }
            ]
        },
        {
            "author_info": {
                "name": "J R Lankford",
                "href": "/profile/J-R-Lankford"
            },
            "answer_text": "There is an old formula from the days before word processors, when most typewriters produced Courier 12. With one inch margins, an 8.5 x 11 inch double spaced page contained an average of 250 words. So formatted, a 200 page novel contains about 50,000 words. This is still a rule of thumb in publishing ",
            "date": "Updated February 10, 2018",
            "views": "57",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Pratik Shelke",
                    "user_href": "/profile/Pratik-Shelke-7"
                }
            ]
        },
        {
            "author_info": {
                "name": "Hanadi Falki",
                "href": "/profile/Hanadi-Falki-1"
            },
            "answer_text": "It totally depends on the font you are using. But in general there are about 250-300 words per page. So a 200 page novel would be around 55,000–60,000 words. ",
            "date": "Answered June 5, 2017",
            "views": "34",
            "upvotes": " View 1 Upvoter"
        },
        {
            "author_info": {
                "name": "John Chapman",
                "href": "/profile/John-Chapman-103"
            },
            "answer_text": "That depends on the font size and page size of the book.An average novel is 80,000 words but again that depends on genre. Science fiction tends to be longer and romance shorter. ",
            "date": "Answered March 25, 2018",
            "views": "980",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Tasfia Zahin",
                "href": "/profile/Tasfia-Zahin-1"
            },
            "answer_text": "they gave you a page limit, write? Just write to the page limit. Let the words flow. ",
            "date": "Answered May 9, 2018",
            "views": "652",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Rebecca Forster",
                "href": "/profile/Rebecca-Forster-10"
            },
            "answer_text": "50,000 words ",
            "date": "Answered August 2, 2018",
            "views": "27",
            "upvotes": "0"
        }
    ]
}