{
    "title": "What are some of the best ideas to make a short film at home during these lockdown days? - Quora",
    "tags": [
        "Short Film Making",
        "Short Film Production",
        "Creative Ideas",
        "Independent Film",
        "Short Films",
        "Screenwriting",
        "Do It Yourself (DIY)",
        "Movie Production",
        "Movie Business and Industry"
    ],
    "response": [
        {
            "author_info": {
                "name": "Omesh Verma",
                "href": "/profile/Omesh-Verma-2"
            },
            "answer_text": "Write a one scene script. Character must be your family members only as considering law. Find some lighted places in your home. Light sources may be windows, doors, balcony or fully lighted room according to requirement. Take your mobile. Reherse with mobile two three times. Then shoot it patiently without jerking or shaking device. Dialogue must be clear to avoid noises. Take it in note. Laptop, pc or mobile editing software are many to edit. Edit, review, edit , review, edit, review until you are satisfied. Add back ground music which is available in the software itself or youtube provides it. Begining and end minutes or sevonds parts are for title and credits. Enjoy. ",
            "date": "Answered March 27, 2020",
            "views": "940",
            "upvotes": " View 2 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Gayatri Sharma",
                    "user_href": "/profile/Gayatri-Sharma-19"
                },
                {
                    "user_id": "Seripeli Bharath",
                    "user_href": "/profile/Seripeli-Bharath"
                }
            ]
        },
        {
            "author_info": {
                "name": "William Ward",
                "href": "/profile/William-Ward-50"
            },
            "answer_text": "Be creative with your story. A college buddy made a short about cooking an egg. The last egg in refrigerator was rotten. Cat used his shoe as a litter box. Fell down the stairs. Got tapped in a crosswalk. Store was out. A bus ride across town and back. Went to open the carton. Powder egg mix. Add milk. Refrigerator. No milk. Have fun with it Best wishes ",
            "date": "Answered March 27, 2020",
            "views": "592",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Avik Paul",
                    "user_href": "/profile/Avik-Paul-6"
                }
            ]
        }
    ]
}