{
    "title": "What makes a fiction novel 'good'? - Quora",
    "tags": [
        "Fiction Book Recommendations",
        "Science Fiction Books",
        "Literary Fiction",
        "Novel Recommendations",
        "Fiction",
        "Science Fiction (genre)",
        "Novels",
        "Book Recommendations"
    ],
    "response": [
        {
            "author_info": {
                "name": "Rachel Aicard",
                "href": "/profile/Rachel-Aicard"
            },
            "answer_text": "A well crafted and compelling story.Relatable, rounded characters, with reasons for behaving the way they do.A narrative style which is fitting to the novel, for me that means an invisible third person narrator (but that's subjective, Cold Mountain, is considered by many to be a \"good\" novel, and the third person narrative, written with an accent/dialect, I found so annoying that I couldn't read the book). If it's a first person narrator, then you should be able to hear the narrator's voice in your head (To Kill A Mockingbird is a good example of this).Nothing in the writing style that makes you hate it, again very subjective, so an example, Clive Cussler is reputed to tell a good story, by I wouldn't know because I am incapable of getting through the first page of his novels before throwing it away in disgust at the excess of adverbs, I loathe adverbs, and I feel that bad writers shove them in at every opportunity, while good writers carve more of them out with every draft.I also detest wordiness, for the sake of being wordy, (I'm more your Hemingway school than your Faulkner school) why use a long, complicated word, when a short, simple one cuts to the point - not because I don't have the vocabulary and have to go look in the dictionary (hey I'm an English teacher!) but because wordiness slows down the impact of the words. Which is not to say that there shouldn't be description, if it's appropriate, but description should immerse you in the setting, not alienate, (see Cider With Rosie, Watership Down or any Thomas Hardy novel).And last but not least, a good novel is so absorbing that you really don't want to read anything else (except a sequel) afterwards, you don't want to emerge from that world, in fact you're strongly tempted when you finish that last page, to turn right back to the beginning and start again. ",
            "date": "Answered August 30, 2015",
            "views": "25",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "David Liu",
                    "user_href": "/profile/David-Liu-370"
                },
                {
                    "user_id": "Au-Yang Siu Chung Donald",
                    "user_href": "/profile/Au-Yang-Siu-Chung-Donald"
                },
                {
                    "user_id": "Osiano Isekenegbe",
                    "user_href": "/profile/Osiano-Isekenegbe"
                },
                {
                    "user_id": "Matt Hill",
                    "user_href": "/profile/Matt-Hill-5"
                }
            ]
        },
        {
            "author_info": {
                "name": "Oliver Merrill",
                "href": "/profile/Oliver-Merrill"
            },
            "answer_text": "This is a very subjective question, meaning that almost any answer might be true for some individual.  I'll offer a few that (I'd like to believe) are universal criteria for a \"good\" novel.  Compelling Story - to me, this is the backbone of a novel. Without a compelling story, why write a novel? It should make me want to turn the pages.Relatable Characters - These are the people who make your story so compelling, so they're essential. Relatable means that the average reader can find something in common with them. So even if your hero has phenomenal cosmic powers, if they never make mistakes or doubt themselves, or have some other internal conflict, they are unlikely to carry 200+ pages of story. Balanced Writing - I had a hard time labeling this one. What I mean is that the writing should be neither too sophisticated nor too easy. This is a very difficult task particularly when writing a range of characters, but important to the ego of your readers.Detail - Some people think simple short sentences are the key to smooth writing, while others write long descriptive passages almost exclusively. Ideally you want to use both of these techniques, but take the time to add detail where it is necessary to further the story. This last bit requires the most artistry and exploration. These are the opinions of an amateur writer, but I hope they provide some insight! ",
            "date": "Answered May 11, 2015",
            "views": "19",
            "upvotes": " View 6 Upvoters",
            "upvoters": [
                {
                    "user_id": "David Liu",
                    "user_href": "/profile/David-Liu-370"
                },
                {
                    "user_id": "Adzka Mumtaz",
                    "user_href": "/profile/Adzka-Mumtaz"
                },
                {
                    "user_id": "Heidi Fischer",
                    "user_href": "/profile/Heidi-Fischer-13"
                },
                {
                    "user_id": "F.T. Zahra",
                    "user_href": "/profile/F-T-Zahra"
                },
                {
                    "user_id": "Jacques Dufeal Maurier",
                    "user_href": "/profile/Jacques-Dufeal-Maurier"
                },
                {
                    "user_id": "Christina Tang",
                    "user_href": "/profile/Christina-Tang-5"
                }
            ]
        },
        {
            "author_info": {
                "name": "Harshita Chamaria",
                "href": "/profile/Harshita-Chamaria"
            },
            "answer_text": "In one sentence- “good fiction should help you escape the reality you are already living” Fiction novel good for you may not be just as good for someone else, depending on the genre. Whether it is good or bad depends on your attention held by the novel. Some novels suck your attention and time such that you don't want to leave before getting done with it. The curiosity keeps you going on and on. If fiction evokes such level of attention from you..then it is indeed a good one! ",
            "date": "Answered August 9, 2017",
            "views": "328",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "David Liu",
                    "user_href": "/profile/David-Liu-370"
                },
                {
                    "user_id": "F.T. Zahra",
                    "user_href": "/profile/F-T-Zahra"
                }
            ]
        },
        {
            "author_info": {
                "name": "Agam Vohra",
                "href": "/profile/Agam-Vohra-1"
            },
            "answer_text": "The Time KeeperA Song of Ice and FireThe Lord of the RingsInheritance Cycle You can also sign up at Goodreads and rate the books you have already read  and it will provide you suggestions based on your taste. ",
            "date": "Answered May 11, 2015",
            "views": "762",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Reta Dawood",
                "href": "/profile/Reta-Dawood"
            },
            "answer_text": "Lord of the flies. ",
            "date": "Answered May 11, 2015",
            "views": "279",
            "upvotes": "0"
        }
    ]
}