{
    "title": "What should I do when I have no motivation to write? - Quora",
    "tags": [
        "Understanding and Maintaining Motivation",
        "Self Motivation",
        "Creative Writing",
        "Understanding Self-Improvement",
        "Writers and Authors",
        "Writing Advice",
        "Writing",
        "Self-Improvement",
        "Psychology of Everyday Life"
    ],
    "response": [
        {
            "author_info": {
                "name": "Rose Demica",
                "href": "/profile/Rose-Demica"
            },
            "answer_text": "Heya, thanks for the A2A. I've been struggling with this for the last few years, since falling chronically ill. I wasn't motivated, I couldn't be bothered, it was too hard. But I also gave in to any and every excuse. I wasn't in the mood to write, so I didn't. I was too tired, so I did something else. I won't say my new years resolution, because I suck at those, but my goal for this year was to get back in to writing properly. So every day, for one hour, I have to write. Even if its just sitting there staring at a blank screen. I figure the habit of it will help. AND IT HAS! I've had two new story ideas! My first in three years! I'm still not that motivated, I get up and the last thing I want to do is write. But I've stopped letting myself have excuses. Writing makes me happy, telling stories makes me happy, and motivated or not, I need to do it. So when you have no motivation to write, try anyway. If thats still too hard, then you could always go and analyse old work, or something you admire, teach yourself new things. The other day all I did was read old work and edit it. Probably shouldn't have counted, but it reminded me why I'm so excited about that particular story. Sometimes there is no motivation, just sheer stubborness that you're gonna do it anyway. But to give some ideas. Try figure out why you enjoy writing, sometimes thats a good kick start to keep writing. Look at old projects, or current ones. I find rereading re-inspires me, and excites me again. Figure out why you aren't motivated. Is there a scene thats not working how you want? Have you hit a road block? If you can figure out whats stopping you, you might be able to work around it. Try writing regardless. It's a lot harder, but sometimes getting in the habit is worth it. For me it has been, writing even when I don't feel like it has helped me get back to what I love. I hope this helps! Goodluck! ",
            "date": "Answered February 14, 2020",
            "views": "55",
            "upvotes": " View 2 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Deanna Reed",
                    "user_href": "/profile/Deanna-Reed-26"
                },
                {
                    "user_id": "Tausif Shaikh",
                    "user_href": "/profile/Tausif-Shaikh-44"
                }
            ]
        },
        {
            "author_info": {
                "name": "Mark Grimshaw",
                "href": "/profile/Mark-Grimshaw"
            },
            "answer_text": "Many writers have problems with motivation to write. If you have not motivation it may be useful to consider your wants and needs. From your general experiences consider the following: If you want or need something will you automatically be motivated, focused, committed and so on to achieve/obtain it?If you don’t want or need something will you automatically be motivated to make efforts towards achieving/obtaining it or will motivation, commitment, focus and so on likely be a problem?If you want something, even if faced with major challenges and hardships, you will be motivated to achieve/obtain it; if you don’t want it, you won’t be motivated. If you have no motivation to write it may be indicating something that needs exploring. Are you actually doing what you want to do? The mind is a complex thing and it could be what you think you want is not what you actually want: we are capable of self-deception. People are different, as indicated by the many different approaches to dealing with motivation; all of us do not have the same wants and needs. Your wants and needs may be influenced by a range of outside sources. These influences can lead to your thinking, incorrectly, that certain things are what you want and need. Problems with motivation may indicate a mismatch between what you think you want and what you actually want. People change in response to living their lives and their experiences. What you want now may not be what you want and need tomorrow, in a week, in a year and so on. Change is to be expected and accepted as is reviewing and adjusting your wants and needs accordingly. Motivation isn’t static For many people, motivation is not static over time but goes up and down. It does not stay at the same ‘level’ over time. For example, a lack of motivation could be a result of you being a bit tired, indicating a need to rest. At times, a lack of motivation can be helping rather than a problem to overcome. Motivation returns relatively easily after such periods of demotivation if you doing what you want to do. If regaining motivation is difficult, this difficulty may indicate a need to review what you are doing in relation to wants and needs. You will do things you don’t like to get something you want Working towards something wanted often involves doing things you don't particularly like. If you really want the end result motivation will return without much effort; even to do things you don't like. Again, if motivation does not return with minimal effort this may be indicating a need for review If wants and needs are imposed on you… If needs and wants are imposed on you, motivation, commitment, procrastination and the like will always be a problem. Sometimes we have no choice when it comes to things we need to do. In this case, we must accept the motivation problems this will give us. This acceptance can help as it’s obvious there is no ‘magic bullet’ for gaining motivation, no approach guaranteed to work for everyone. Searching online will show diverse views rather than indicate one approach that always works. If you don’t fully meet the wants and needs being imposed on you there will be consequences. As people and their situations are different it is up to you to make choices around meeting these wants and needs and accepting the consequences of those choices. If doing what you don’t want to do… If you are set on trying to write when you don’t want to write, or if the need to write is imposed on you, there are many different views about gaining and maintaining motivation. For example, I quickly picked up the following questions on Quora: What motivates you to write? 340+ How can I stay motivated to write? 140+ How do I motivate myself to write a book? 55+ Self-Improvement: How can I motivate myself to work hard? 2670+ answers  How do I stay motivated? 2470+  What are the best tricks to keep yourself motivated? 1340+  How do I motivate myself to study? 1130+  How exactly can I get out of this comfort zone by motivating myself? 380+ From searching Quora you will find many similar or related questions with a varying number of answers. Additionally, an online search will give you many more possibilities. It can be interesting and helpful to consider and question why there are so many different approaches to motivation, what this means for a person considering their own motivation and how much time a person should spend reviewing the vast amount of online information to find something that helps them. Hopefully the above will get you started. ",
            "date": "Answered January 20, 2020",
            "views": "132",
            "upvotes": " View 4 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Steven Black",
                    "user_href": "/profile/Steven-Black-113"
                },
                {
                    "user_id": "Mattie Mcdonalid",
                    "user_href": "/profile/Mattie-Mcdonalid-2"
                },
                {
                    "user_id": "Kevin Hall",
                    "user_href": "/profile/Kevin-Hall-413"
                },
                {
                    "user_id": "Tausif Shaikh",
                    "user_href": "/profile/Tausif-Shaikh-44"
                }
            ]
        }
    ]
}