{
    "title": "What makes JK Rowling such a good author? - Quora",
    "tags": [
        "J.K. Rowling (author)",
        "Children's and Young Adult Books",
        "Harry Potter (book series)",
        "Fiction",
        "Harry Potter (creative franchise)",
        "Writers and Authors"
    ],
    "response": [
        {
            "author_info": {
                "name": "George Guthridge",
                "href": "/profile/George-Guthridge"
            },
            "answer_text": "I have read the other comments with great interest, but must say this: The ones I have read so far are true of any really good writer of fantasy. They are all brilliant at creating worlds and are all hard-working, resilient, etc. But . . . as a professor (I have taught full-time for 44 years) I have taught Rowling’s work. Most of what she “invented” was invented long ago. Her writing is good but not brilliant. As Stephen King said, “Rowling never met an adverb she didn’t like.” It’s true. What Rowling did was apply business principles. She gave the potential audience what they wanted, rather than what as a writer she wanted just for herself (which is what most writers do, including me). Most young readers are nerds. That’s harsh to say, but I think it’s true. As a youngster, my primary interest was sports. My secondary was reading. But most of the students in my school who loved to read kept to themselves and would rather read than play football or tetherball. Rowling did something simple but BRILLIANT: She made the readers Wizards and everyone else Muggles. And I applaud her for it. But struggles? Sure, she had some. But they pale in comparison to what other writers have endured. Yes, she wrote the books while sitting in a fast food place and watching her baby. I admire her for that. But she had enough money coming in to be able to do it. L. Ron Hubbard, who went on to become a zillionaire by inventing Scientology, survived by trapping and eating city pigeons. Stephen King’s mother often went a day or more at a time without food so as a young adult he could have $5 to eat. There’s a bestselling writer of fantasy romances (sorry, I can’t remember her name) . . . I attended a romance writers conference once — I was thinking about writing some romances, at my wife’s request, but decided against it. She was the guest of honor. She told her life story, and my mouth fell open. Literally. I can’t go into all of it here, but she was so poor that she STOLE two stamps from her husband’s wallet (he became very angry with her) and sent her manuscript to a publisher. They were so poor that they could not afford the postage. It was to be her last attempt, after years and years of rejection slips. Now she’s a millionaire. As she said, “You can’t make this shit up. If you put it in a novel, no one would believe you.” ",
            "date": "Answered October 8, 2018",
            "views": "405",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Robert Jones",
                    "user_href": "/profile/Robert-Jones-1638"
                }
            ]
        },
        {
            "author_info": {
                "name": "Mia Richards",
                "href": "/profile/Mia-Richards-13"
            },
            "answer_text": "In my experience as a reader in the modern day world where anyone can self-publish a book on amazon and the overall percentage of books self-published in a year is about 65%, many writers are capable of coming up with a good idea, but only a few can execute them well. However, though JKR has produced some exceptional literature, she is not devoid of errors. Let’s start with some English Language-y features. The grammar and syntax is virtually flawless. Of course, some of that could have been edited in write up by publishers, but we’ve got to assume JKR was responsible as there are many books out there lacking this basic skill. Correct me if I’m wrong (if I may have missed an example that contradicts this), but JKR’s style of writing intrigued me as well. It used standard English, no elision or abbreviation, out of speech, reserving the more phonetics-y, spoken dialect for inside quotation marks, yet her use of sentence structure still made the text read conversationally for moments when Harry was thinking, etc. For a reader, the books read like a dream. There was only one sentence in one of the books that I’ve ever said was clumsy (though unfortunately I cannot tell you where it is). This sentence used the same word (I’ve got a feeling it was ‘hippogryff’, but seriously, don’t hold me to that) twice in one sentence, which isn’t nice to read. A good writer can always find a dozen diffeeent ways of saying a word to avoid this situation, but as only one slipped through JKR’s eagle-eyed editing process, we can forgive her. The world building was phenomenal. Hogwarts, the Ministry, Diagon Alley … all the spells, potions and traditions … and even foreign wizarding communities were touched upon in the original series. The wizarding world is up there with C.S. Lewis’s Narnia, Lewis Carroll’s Wonderland and J.R.R. Tolkien’s Middle Earth. Every detail was described, but not in an over the top or irritating way (I’m looking at you, Mortal Instruments) However, there are a few times JKR didn’t think about what she was doing, and these can be found in questions throughout Internet forums. How many students went to Hogwarts? Logically, since there are only five Gryffindor boys, it would make sense that there are also five Gryffindor girls and the same in the other three houses. That makes forty students in a year, and with seven years at Hogwarts, that means there should be two-hundred and eighty students at the school in total. However, JKR has replied to this question saying there are ‘thousands’ or students, which begs the question, why have we never seen more than ten students in a year in a house and if there are more Gryffindor boys in Harry’s year, why is their dorm labelled ‘first years’, etc., if there is another dorm of ‘first years 2’? Why do the students start school on a Saturday in OotP? This is a fact that the students go to school on a Saturday morning, and then the books pretend that timetabled day was a Monday from then on. The fifth Harry Potter book is set 1995–1996 and the Hogwarts Express always sets off on September 1st, with the welcome feast taking place in the evening, 1st September 1995 being a Friday. I have read the text over and over to find some sort of loophole that means it doesn’t state that the day they get their timetables is 2nd September, but there isn’t one. Seamus dresses at top speed next morning and left the dormitory before Harry has even put his socks on. ‘Does he think he’ll turn into a nutter if he stays in a room with me too long?’ asked Harry loudly, as the hem of Seamus’s robes whipped out of sight. ‘Don’t worry about it, Harry,’ Dean muttered, hoisting his schoolbag on to his shoulder, ‘he’s just …’ […] Professor McGonagall was now moving along the table handing out timetables. ‘Look at today!’ groaned Ron. ‘History of Magic, double Potions, Divination and double Defence Against the Dark Arts … Binns, Snape, Trelawny and that Umbridge woman all in one day!’ – Harry Potter and the Order of the Phoenix, Chapter Twelve ‘Professor Umbridge’, beginning page line of the chapter, quoted from Kindle. Why didn’t Harry see the Thestrals when he first arrived at Hogwarts or, at the very least, at the end of GoF? ‘For the plot’ is the only real answer to this. Harry did see his mother die when he was a year old, and regardless of the fact he was a baby and later forgot about this, it still happened and he acknowledges that in the books. This doesn’t bother me overly, but a lot of people do get wound up by the Thestrals. There are a few more questions like this flying about, easy to find if you google ‘Harry Potter plot holes’. JKR actually read back through her own book while she was writing it to make changes. You cannot bang out a first draft and expect it to be good. Writing takes time and most importantly editing. However, I said ‘book’, because she has claimed that she never read past work, meaning once she finished one book and moved onto the next, she wouldn’t look back at the previous. Now, this is both reasonable and a fatal error on JKR’s part. As a writer, I know it’s very difficult to go back over your own work and not want to change it. But, it is often necessary to the plot and characters to make sure where they are now is in keeping with the earlier portrayals and settings, or at least that the arc they are taking is realistic. This is where JKR messed up with HBP and DH versus Harry Potter books 1–5. When she originally devised the idea of Harry Potter (a story we all know of how she sat on a train when suddenly it came to her and she wrote everything down on napkins), she had everything planned out. Ron and Hermione would end up together because Hermione was a young JKR and Ron was a boy she used to have a crush on, and so she wrote the ending first and locked it away. Jump to OotP, and while there have been a few subtle indications to Ron and Hermione (though mostly Ron fancying her rather than the other way round), many readings, the cast and crew of the HP movies included, are left believing the story is progressing towards a Harry and Hermione ending. So far, they have been the closest throughout the books and some have argued that Hermione was often a better friend to Harry than Ron even, while Ron and Hermione in themselves were only really friends with each other through Harry, leaving Harry frequently in the middle when the fall out, while the same isn’t said for Ron or Hermione when Harry falls out with one of them. Instead, they side with Harry wholeheartedly and avoid speaking to the other. Then, in HBP, we are met with two unnecessary intro chapters before we get to Harry. We have seen an example of one of these in GoF, where instead of going to Harry upon the start of the book, we went to a man called Frank who was the groundskeeper of the Riddle house, and we ‘watch’ a scene of a Wormtail, reunited with weak Voldemort, and a man Harry does not recognise (as this is also a dream sequence, hence why we see it in a book written entirely from the title character’s perspective) who later turns out to be a character very crucial to the plot, David Tennant— I mean, Barty Crouch Jr. In HBP, we see two scenes that we shouldn’t, basically. Neither are from Harry’s perspective or dreams, but are there purely to waste two chapters of our time doing some ‘world set up’. Now, world set up in books, especially in the opening three chapters, will not be considered by publishers today because it is dull to read. But JKR was already established with Bloomsbury, and so at this point, she could literally write whatever she wanted. If it was Harry Potter, it would sell. And now we are at the part where, because JKR can do whatever she wants, she has decided she wants to pull the story arc, that has progressed naturally on its own for five books, back round to head towards her original ending that’s locked away somewhere. This results in Harry suddenly being infatuated with Ginny, who he’s never looked twice at before other than as a sister figure or an acquaintance, Ron and Hermione suddenly both being head over heels in love with one another but not telling anyone, and because there is now so much to alter to make everything fit and sort of make sense, Harry does not grieve for his godfather who was murdered in front of him before the summer, even though he spent an entire book mourning an older kid from his school he competed against in the Triwizard tournament and who beat him once at Quidditch. JKR is a phenomenal writer. However, as an author, she leaves a bit to be desired. While her writing will go down in history, many fans are already growing impatient with her for announcing ‘regrets’ and amending parts of her books through interviews and social media. If she had not said any of this, perhaps plot holes and arc alterations would be a lot less scrutinised, but I cannot see her stopping any time soon. Expect the annual regret of a character’s death again next year. ",
            "date": "Answered October 4, 2018",
            "views": "12",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Morgane Wright",
                    "user_href": "/profile/Morgane-Wright"
                },
                {
                    "user_id": "Luca Devalier",
                    "user_href": "/profile/Luca-Devalier"
                },
                {
                    "user_id": "Alexandra Brett",
                    "user_href": "/profile/Alexandra-Brett"
                },
                {
                    "user_id": "Michael G.Floyd",
                    "user_href": "/profile/Michael-G-Floyd"
                }
            ]
        },
        {
            "author_info": {
                "name": "Amir Waseem",
                "href": "/profile/Amir-Waseem-2"
            },
            "answer_text": "Here are some of J.K. Rowling’s personal traits that made her successful & such a good author ● J.K. Rowling is a dreamerShe has dreamt of being a novel writer since she knew what writers were, despite her parents’ opinion about it. J.K. Rowling dared to dream and never gave up on it. ● J.K. Rowling is goal-orientedShe focused on her goal to become a writer through all the adversities she experienced in her life. J.K. Rowling used to spend her time writing back when she was jobless. She maintained it by writing in her spare time when she had a job. ● J.K. Rowling is resilient She’s been through difficult times in her life. But she always managed to rise and move forward. The manuscript of the first Harry Potter book was rejected by 12 publishers before finally, a small publisher agreed to publish it. She mentioned that she wouldn’t stop until every single publisher turned her down, but she was often afraid that would happen. ● J.K. Rowling is disciplinedShe is a disciplined writer. She sets a schedule on when she does her writing and commits to it. ● J.K. Rowling is active towards ideas The idea about Harry Potter came when she was on a delayed train journey from Manchester to King’s Cross station in London. It was then, when the main characters of the story, Harry Potter, Ronald Weasley, and Hermione Granger, formed clearly in her mind. But it wasn’t until the next 6 years she finally finished and published the first book of the Harry Potter series. She didn’t stop merely on having ideas, she took action towards them. ● J.K. Rowling is strong-willedShe spent 6 years creating the entire plot of the Harry Potter story before finally came up with the first manuscript, Harry Potter and Philosopher’s Stone. She’s determined to work on her ideas despite her personal and financial issues at the time. ",
            "date": "Answered October 4, 2018",
            "views": "595",
            "upvotes": " View 7 Upvoters",
            "upvoters": [
                {
                    "user_id": "Johanna Liwag",
                    "user_href": "/profile/Johanna-Liwag"
                },
                {
                    "user_id": "Alexandra Brett",
                    "user_href": "/profile/Alexandra-Brett"
                },
                {
                    "user_id": "Mia Richards",
                    "user_href": "/profile/Mia-Richards-13"
                },
                {
                    "user_id": "Abhinaya Mary Koshy",
                    "user_href": "/profile/Abhinaya-Mary-Koshy"
                },
                {
                    "user_id": "Amir Khan",
                    "user_href": "/profile/Amir-Khan-2199"
                },
                {
                    "user_id": "Amir Ammu",
                    "user_href": "/profile/Amir-Ammu"
                },
                {
                    "user_id": "Mohd Waseem",
                    "user_href": "/profile/Mohd-Waseem-220"
                }
            ]
        }
    ]
}