{
    "title": "What are some common mistakes that students can make in their writing? - Quora",
    "tags": [
        "Writing Mistakes",
        "Common Mistakes",
        "Students"
    ],
    "response": [
        {
            "author_info": {
                "name": "Barbara Pavey",
                "href": "/profile/Barbara-Pavey"
            },
            "answer_text": "Writing clarity can be improved considerably by paying attention to sentence length. As a student myself I once heard an esteemed professor say that that when the content of a sentence is difficult and unfamiliar, 10 words per sentence is enough. When content is moderately familiar, allow 16 words. Only when content is very familiar, should we use about 24 words. This is not a rule, just a guideline, but a useful one; it requires us to count words until a feel for sentence length becomes automatic. As a reader of student work I have encountered sentences that run on to the length of a paragraph, making them really difficult to understand. There are examples in literature where a writer has deliberately used very long sentences, but this question is about student writing. In the case of one student whose marks were consistently low, it was clear in her written work that her sentences were long, and therefore difficult to disentangle in order to understand the meaning clearly. I asked her to punctuate them, but she could not see how to do that, so I asked her to read her sentence aloud, and where she took a breath, to put in a simple dividing line, like this: /. Then I asked her to change this to a full stop, and to start the next sentence with a capital letter. The tutorial took about half an hour, because I sat with her while she did the first few sentences, rather than just telling her to do it and sending her away. She understood the principle quickly, and could see how it made a difference to clarity. Her next essay gained a better mark simply because it was easier for her to express, and for a reader to understand, the points she wanted to make. ",
            "date": "Answered October 18, 2017",
            "views": "151",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Jacqueline San",
                    "user_href": "/profile/Jacqueline-San-3"
                }
            ]
        },
        {
            "author_info": {
                "name": "John Joss",
                "href": "/profile/John-Joss"
            },
            "answer_text": "Dozens of mistakes haunt writers. Errors in grammar, syntax and spelling are the most common. Failure to distinguish between words that are almost the same but have different meanings represents an endless trap—’affect’ vs. ‘effect’ is typical. ‘Near-miss’ word choice is more subtle and reflects vocabulary problems—languages are complex and finding precisely the right word (the French call it le mot juste) is essential in clear, fluent writing. The solution is to work hard, practice continually and edit punctiliously. There are no shortcuts to writing quality. . ",
            "date": "Answered February 6, 2020",
            "views": "65",
            "upvotes": "0"
        }
    ]
}