{
    "title": "What sound does ㅆ make when placed on the bottom of words? (ex: 있었) does it usually make the same sound or Is there no general rule to go by? I guess im asking for the batchim rule - Quora",
    "tags": [
        "Korean (language)",
        "Sound",
        "Linguistics",
        "Grammar"
    ],
    "response": [
        {
            "author_info": {
                "name": "Neky Choe (Kim Jinwon)",
                "href": "/profile/Neky-Choe-Kim-Jinwon"
            },
            "answer_text": "It’s related to the final sound rule, what you called batchim rule. Here, I want to call “batchim” as “consonant” for objectivity. —1— When a word ends with a consonant, then it can make only 7 sounds: ㄱ [k̚], ㄴ [n] ,ㄷ [t̚], ㄹ [l], ㅁ [m], ㅂ [p̚], and ㅇ [ŋ]. They’re called “representative sounds”. 밑 [mit̚] (underside, bottom) 꽃 [k͈ot̚] (flower) 옷 [ot̚] (cloth) As you see, no matter the final consonant is either ㄷ, ㅅ, ㅈ, ㅊ, ㅌ, ㅆ, or sometimes ㅎ, they all sound as [t̚]. So, “-었-” or “있-” itself is pronounced with the sound. —2— When a word with a consonant at the end meets another word beginning with a vowel that has a meaning, I mean, not something like a marker (postposition), ending, or suffix, then the representative sound of the former word is carried on the next vowel that it becomes a new consonant at the beginning. [k̚] becomes [g], [t̚] becomes [d], and [p̚] becomes [b] before a vowel. 옷 입어 → 옷 [ot̚]+입어 [ibʌ] → “오디버 [odibʌ]” 꽃 없어 → 꽃 [k͈ot̚]+없어 [ʌp̚s͈ʌ] → “꼬덥써 [k͈odʌp̚s͈ʌ]” 잎 위 → 잎 [ip̚]+위 [wi] → “이뷔 [ibʷi]” (When [w] meets a consonant before, then it fuses with the consonant like one sound.) 부엌 음식 → 부엌 [puʌk̚]+음식 [ɯmsik̚] → “부어금식 [puʌgɯmsik̚]” —3— When a word with a consonant at the end meets a grammatical morpheme like a marker, ending, or suffix with a vowel in the beginning, then the final consonant of the former word is intactly carried onto the vowel without changing into the representative sound. 옷이 → “오시 [oɕi]”, NOT “오디” 꽃을 → “꼬츨 [k͈otɕʰɯl]”, NOT “꼬들” 잎에 → “이페 [ipʰe]”, NOT “이베” “있었어” is, thus, pronounced like “이써써 [is͈ʌs͈ʌ]”. “-었-” is a grammatical ending for showing past form, and “-어” is a final ending. So, all the ㅆ sounds come out without changing into their representative sound. Korean has lots of pronunciation rules that it can be tricky for you to learn them. But as we can see they’re “rules”, they’re affordable or doable if you step forwards one by one. Hope it helps. :) ",
            "date": "Answered May 5, 2020",
            "views": "318",
            "upvotes": " View 15 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Meni Ken Roberts",
                    "user_href": "/profile/Meni-Ken-Roberts"
                },
                {
                    "user_id": "Miya Lin",
                    "user_href": "/profile/Miya-Lin-5"
                },
                {
                    "user_id": "Julia Moore",
                    "user_href": "/profile/Julia-Moore-216"
                },
                {
                    "user_id": "Krystal Jo",
                    "user_href": "/profile/Krystal-Jo-3"
                },
                {
                    "user_id": "Solomon Malekani",
                    "user_href": "/profile/Solomon-Malekani"
                },
                {
                    "user_id": "Shae Roberts",
                    "user_href": "/profile/Shae-Roberts-7"
                },
                {
                    "user_id": "Andi Roselund",
                    "user_href": "/profile/Andi-Roselund"
                },
                {
                    "user_id": "Hayne Kang",
                    "user_href": "/profile/Hayne-Kang"
                },
                {
                    "user_id": "Michael Negussie",
                    "user_href": "/profile/Michael-Negussie-1"
                },
                {
                    "user_id": "Kevin Eng",
                    "user_href": "/profile/Kevin-Eng-17"
                }
            ]
        },
        {
            "author_info": {
                "name": "Dong-Yoon Lee",
                "href": "/profile/Dong-Yoon-Lee"
            },
            "answer_text": "ㄷ,ㅌ,ㅅ,ㅈ,ㅊ are sounded as [t] when one of the consonant are ending consonant. So, 있었 is sounded as [it eot] primitively. However, 연음법칙(Thr rule for concatenation between consonants <-- I don't know official English translation of that.) dominately makes the final sound. So, the final sound is 이썻[isseot] (eo should be replaced by official symbol of linguistics.). In that case, first t takes a role of bonding sound between 있 and 었. Two syllables were concatenated by ending vowel of first syllable. ",
            "date": "Answered May 5, 2020",
            "views": "95",
            "upvotes": " Answer requested by Shae Roberts"
        }
    ]
}