{
    "title": "What letter should be removed from the alphabet? - Quora",
    "tags": [
        "Alphabets"
    ],
    "response": [
        {
            "author_info": {
                "name": "Jonathan Johnson",
                "href": "/profile/Jonathan-Johnson-41"
            },
            "answer_text": "And which alphabet do you propose to eliminate a letter from? There are hundreds of alphabets in use around the world. UTF is an attempt to create a universal alphabet. It can contain millions of “letters”. It is a work in progress. Really, you could remove this letter: 💩 — we got along just fine without it. ",
            "date": "Answered February 17, 2020",
            "views": "325",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Daniel Latimer",
                    "user_href": "/profile/Daniel-Latimer-8"
                },
                {
                    "user_id": "Krishnan(கிருஷ்ணன்)",
                    "user_href": "/profile/Krishnan-கிருஷ்ணன்"
                },
                {
                    "user_id": "Beatrix Messerschmidt",
                    "user_href": "/profile/Beatrix-Messerschmidt-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Richard Seed",
                "href": "/profile/Richard-Seed-1"
            },
            "answer_text": "Ah spelling reform. You have entered a minefield. My choices would be either k or c. If you want the hard k sound use one. For the soft sound s. Pat of the problem is that modern english has grown without a school of language or government attempts at reform so all sorts of oddities an similar remain. ",
            "date": "Answered September 7, 2019",
            "views": "46",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Mark Jones",
                "href": "/profile/Mark-Jones-203"
            },
            "answer_text": "Let’s assume your posted question is the proposition. We could easily dispense with Q and the QU cluster. Its pronunciation does not vary and can be replaced orthographically with K or KW. Words containing Q have no homophones that would create confusion if the word containing Q were spelled with K, creating a convergent spelling. Even if there were, you could likely find some combination of C, CW or CU that would differentiate the spelling. Would some words look funny? No kwestion about that. Thanks for the A2A. ",
            "date": "Answered February 17, 2020",
            "views": "173",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Dapen Clovis Nji",
                    "user_href": "/profile/Dapen-Clovis-Nji"
                }
            ]
        },
        {
            "author_info": {
                "name": "Yann Szwec",
                "href": "/profile/Yann-Szwec"
            },
            "answer_text": "in french k or c or q you may do the same sound with 3 letters y or i same thing v or w ",
            "date": "Answered September 7, 2019",
            "views": "57",
            "upvotes": "0"
        }
    ]
}