{
    "title": "What's good history Essay topic? - Quora",
    "tags": [
        "Essays",
        "Writing"
    ],
    "response": [
        {
            "author_info": {
                "name": "Tom Martin",
                "href": "/profile/Tom-Martin-160"
            },
            "answer_text": "Here is something I stumbled across when reading about German surface raider in world war I and II. Something fascinating happened that is worthy of study. Between 1916 or so and 1940, just 24 years, the shipping in the world went from being almost completely reliant on coal, with some sailing ships and a very few diesel or oil burning ships to primarily reliant on oil, with some coal and very, very few sailing ships. somehow, during a decade and a half, even in the midst of cultural and social upheaval, economic crisis, even in the most remote ports in the world, there was a shift from a huge reliance on coal to a huge dependence on oil! The infrastructure went from thousands of colliers to thousands of tankers in just two and a half decades. The ports went from having mountains of coal to enormous fuel tanks. The German raiders found adequate coal aboard the colliers they captured to keep going during their raiding, often securing so much coal that they scuttled ships they captured with high grade coal because they didn’t need it. Just twenty four years later, when a ship with valuable cargo was captured, but it was a coal burner, they often had to scuttle it because the odds of capturing a collier weren’t all that high. There were political and economic changes. Ships had much more range when using oil burners than with coal. Without focusing on the war, covering that period of change and how rapid it took place would provide fascinating niche reading, and it’s not something most teachers have ever seen or considered, and it could be very impressive. ",
            "date": "Answered February 4, 2017",
            "views": "15",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Megan Always",
                    "user_href": "/profile/Megan-Always"
                },
                {
                    "user_id": "Sean Moriarty",
                    "user_href": "/profile/Sean-Moriarty-12"
                }
            ]
        },
        {
            "author_info": {
                "name": "Helga Marselos",
                "href": "/profile/Helga-Marselos"
            },
            "answer_text": "If you like history you can find thouands of really interesting topics to write about. For example, from American History: Colonial America.Plymouth Colony.Massachusetts Bay Colony.Pequot War.King Philip's War.Slavery.Civil Rights Movement.Compromise of 1850Or from Egyptian history: Describe State Organization of Ancient Egypt.Society in Ancient Egypt.Work Organization in the Middle Kingdom, Ancient Egypt.Development of Ancient Egypt.American Discovery of Ancient Egypt.Gods and Religion of Ancient Egypt.Housing and Architecture of Ancient Egypt.Writing essays of this type is an enjoyable thing to do: there is no true or false opinion – all you have to do is to clearly present it and then support. Take a look at this page Writing A Good History Essay. TYou’ll find a lot of free samples of good history essays. ",
            "date": "Answered June 2, 2020",
            "views": "90",
            "upvotes": "0"
        }
    ]
}