{
    "title": "What are common violations of journalistic ethics in many news articles? - Quora",
    "tags": [
        "Journalism Ethics and Standards",
        "News Media",
        "Online Journalism",
        "News",
        "Newspapers",
        "Ethics"
    ],
    "response": [
        {
            "author_info": {
                "name": "Dan Tynan",
                "href": "/profile/Dan-Tynan"
            },
            "answer_text": "I question the assumption implicit here that most or even many stories have ethical violations built in. Broadly speaking, a journalist commits an ethical violation when he or she says something he/she knows is false or inaccurate, or presents a story as well balanced when in fact it pursues some kind of secret agenda, or has taken payment or accepted other favors to present a story in a particular light and has not disclosed said payment or favors. Those are clear ethical violations. They are pretty rare in my experience.  A more common lapse is to take shortcuts or gloss over certain aspects of a particular story in an effort to make it slide through the system more easily. Mostly that has to do with the time and space considerations (not enough time to research every nuance, not enough room to discuss them all). And a journalist may be hesitant to push for a story that has political ramifications for them personally, depending on how well they are insulated from office politics. To take an obvious example, Fox News is well known for making life difficult for employees who don't tow the line. I imagine it's harder for an arch conservative to work at a more liberal pub like the New York Times (see Miller, Judith). And there's always the problem of publishing something that will piss off advertisers. So the biggest sins of journalists are mostly those of omission. ",
            "date": "Answered October 5, 2014",
            "views": "31",
            "upvotes": " View 10 Upvoters",
            "upvoters": [
                {
                    "user_id": "Michelle Pilecki",
                    "user_href": "/profile/Michelle-Pilecki"
                },
                {
                    "user_id": "Lisa Gold",
                    "user_href": "/profile/Lisa-Gold-23"
                },
                {
                    "user_id": "Jean Rafenski Reynolds",
                    "user_href": "/profile/Jean-Rafenski-Reynolds"
                },
                {
                    "user_id": "Amanda Greaves",
                    "user_href": "/profile/Amanda-Greaves-8"
                },
                {
                    "user_id": "Alex Wu",
                    "user_href": "/profile/Alex-Wu"
                },
                {
                    "user_id": "Marc Bodnick",
                    "user_href": "/profile/Marc-Bodnick"
                },
                {
                    "user_id": "Kari DePhillips",
                    "user_href": "/profile/Kari-DePhillips"
                },
                {
                    "user_id": "Matt Nagel",
                    "user_href": "/profile/Matt-Nagel"
                },
                {
                    "user_id": "Alex Shapiro",
                    "user_href": "/profile/Alex-Shapiro-2"
                },
                {
                    "user_id": "Matthew Daneman",
                    "user_href": "/profile/Matthew-Daneman"
                }
            ]
        },
        {
            "author_info": {
                "name": "Ilana Halupovich",
                "href": "/profile/Ilana-Halupovich"
            },
            "answer_text": "I can give you an example of \"soft\" violation: Title: sportsman X failed. The fact: sportsman X took the second place (out of 20).A harder one: In spite of cease-fire, Israel fires on Gaza. The fact: Israel returns fire.A common violation is showing only part of the truth to suit your agenda. ",
            "date": "Answered October 5, 2014",
            "views": "993",
            "upvotes": " View 3 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Jon Baldwin",
                    "user_href": "/profile/Jon-Baldwin-4"
                },
                {
                    "user_id": "Harvey Cameron",
                    "user_href": "/profile/Harvey-Cameron"
                },
                {
                    "user_id": "Frank Dauenhauer",
                    "user_href": "/profile/Frank-Dauenhauer"
                }
            ]
        }
    ]
}