{
    "title": "What are some tactics that everyone can use in salary negotiations? - Quora",
    "tags": [
        "Negotiation Skills",
        "Salary Negotiation",
        "Negotiating Strategies",
        "Tactics",
        "Negotiation",
        "Salaries and Wages"
    ],
    "response": [
        {
            "author_info": {
                "name": "Dandan Zhu",
                "href": "/profile/Dandan-Zhu-2"
            },
            "answer_text": "As a headhunter since I was 23, I prep, coach, and lead negotiations between candidates and employers on a daily basis. Here are a few tactics you can utilize to your benefit in salary negotiations: #1. Be extremely likable from the outset and onwards. While this isn’t a direct “how-to” negotiate your salary pointer, this is a crucial differentiator between someone who is highly paid versus someone who isn’t. Knowing that interviewers have unconscious biases and are humans, you can leverage their emotions to YOUR benefit. What this means is that you step up your charm! Ask open questions to get your interviewer to open up. Use flattery. Get them to be YOUR advocate and want YOU to make it through. Make sure they like you more than your competition. This could be your ultimate leg-up. By simply being more sociable, interesting, conscientious, and empathetic, creating rapport and asking questions to your interviewer beyond just the normal work stuff, you’ll be making yourself more desirable. #2. Play offense: Plan and share your salary desires from the first conversation. I am NOT an advocate of holding cards close to the chest. I’ve seen those attitudes disrupt negotiations and make the candidate look super shady and immature. Any adult should know what money they want, would like to see, and wouldn’t want. Those are the 3 numbers you need to know yourself. It’s the Goldilocks combo: a. Highest/ideal target salary that will guarantee acceptance and refusal of counter. b. Median/average salary you know you can get. And c. The no-go number, aka don’t waste my time or I can’t live on less than X. Be pro-active and voice your needs and your views when it comes to money. Keep the door open but give a solid range. #3. Downplay money needs until later in the process. I’ve seen candidates strike themselves out of the game early on by going after a pie-in-the-sky number, being unlikable, and stubbornly/arrogantly professing statements like “if it’s not at X, don’t even come at me with those opportunities”. That is exactly how you can turn off useful connections from ever approaching you again. Instead, firmly state your desires however leave the door open. You’re better off networking and knowing of all the cool happenings in your industry instead of saying NO to yourself. When push comes to shove, and the employer falls in love with you, they’ll find a way to cough up that extra budget to hire you. Be smart by saying something to the effect of “well, ideally, I would be more motivated at X rate, however, your proposition sounds interesting. I wouldn’t mind discussing/networking however, my financial requirements are as they are. There won’t be too much room to be flexible, however I’m willing to be open-minded and always happy to network.” #4. Utilize counter-offers and competing offers. Like I said, there are no magic words to push an employer to pay above a necessary value for someone; businesses are for-profit, not charities. The only 2 things that could make a true difference is market competition: a. For those who are employed, always leverage the risk of counter-offers. Your firm will most likely try to retain you due to the astronomical costs retention issues create for businesses. Let future employers know that you’re expecting a counter, thus the offer would need to be in the X-range to make it compelling. b. For those who are unemployed or employed, line up as MANY offer opportunities as you can so you can start educating your employers on what other employers are willing to pay for your skillset, thus ensuring that you receive a similar offer to what the market is yielding. This requires you to market yourself effectively and line up multiple interview opportunities. Utilize LinkedIn by reaching hiring managers en masse; it’s a numbers game. #5. Utilize all the compensation components to try to rank offer values to make the optimal decision. Know all the different aspects of your compensation that is customary and valuable in your industry. Do you get free lunch, a 6% 401k match, unlimited vacation days, work-from-home as much as you please, and lots of other perks? If so, understand the true value of what it is you’re perhaps leaving behind. Your new salary should incorporate and account for all the lost perks of what you have in your current role. This is to minimize “buyer’s remorse”. Make sure you’re not just wowed by a big number and forgot to account for the lost perks as well as the comfortable work-life-balance. Some things are not monetary and being focused on the dollars and cents could actually make you more miserable in the long-run. Sometimes it’s better to stay in an comfortable environment that takes care of you mentally and fits into your stage of life. Don’t ever forget the holistic picture of your setup and regret your decision later. Lastly, #6. Don’t ever rely on your income to survive. As you progress through life, your goals should evolve. Instead of relying on income numbers to survive, become an investor. That way, you’ll be protected no matter which way the employment winds blow. To rely on a salary is to be tethered to the rat race. Whether you’re a CEO or entry-level, as long as you rely on your salary to live, you’ll always be at risk to the whims of others. Understand, decide, and push forward to become an investor. Be educated in how to have your money work for you. I hope these ideas will support you in approaching your job search and salary negotiation with the right mindset and attitude! ",
            "date": "Updated February 2, 2019",
            "views": "509",
            "upvotes": " View 459 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Abhiram GR Athreya",
                    "user_href": "/profile/Abhiram-GR-Athreya"
                },
                {
                    "user_id": "Atharva Gupta",
                    "user_href": "/profile/Atharva-Gupta-3"
                },
                {
                    "user_id": "Mujahid Omer",
                    "user_href": "/profile/Mujahid-Omer"
                },
                {
                    "user_id": "Bogdan Meseșan",
                    "user_href": "/profile/Bogdan-Meseșan"
                },
                {
                    "user_id": "Asad Shaikh",
                    "user_href": "/profile/Asad-Shaikh-5"
                },
                {
                    "user_id": "Rajan Bhandari",
                    "user_href": "/profile/Rajan-Bhandari-35"
                },
                {
                    "user_id": "Vamshi Krishna",
                    "user_href": "/profile/Vamshi-Krishna-3458"
                },
                {
                    "user_id": "Louisa Miu",
                    "user_href": "/profile/Louisa-Miu"
                },
                {
                    "user_id": "Daniel Kahn",
                    "user_href": "/profile/Daniel-Kahn-8"
                },
                {
                    "user_id": "Maxim Tanevskiy",
                    "user_href": "/profile/Maxim-Tanevskiy"
                }
            ]
        },
        {
            "author_info": {
                "name": "Daniel King",
                "href": "/profile/Daniel-King-5"
            },
            "answer_text": "What are some tactics that everyone can use in salary negotiations? Abraham Lincoln once said, “Give me six hours to chop down a tree and I will spend the first four sharpening the axe.” Think of salary negotiations as the tree. Even if your axe is dull, there are techniques you can use to cut the tree faster. But if you want to supercharge your results, I believe you must sharpen your axe. Sometimes, preparation matters more than what you do in the room. There are some great tactical answers from writers like Chris Voss that cover what you should do during the negotiations. I’ll focus on the how and why of preparation – sharpening the axe. Here are three ways you can prepare for salary negotiations: Deep research on the company, deep research on the personalities involved, and charisma development.  Deep Research on the Company Most people ask for a higher salary because they want more money. You need to flip your mindset so that you’re focused squarely on the company’s needs. To do this, you need to determine their problems. This is a challenge. Most companies’ websites are useless since they talk about why the company is awesome. You need to go deeper. Think of yourself as a private investigator or a spy looking to gather intelligence. Ask yourself: What are some big problems the company is experiencing? You can start with Google research and if it’s a public company, look for what financial journalists like and dislike about the company. For a super deep dive, public disclosure documents are useful. These documents disclose a lot about a company’s internal operations. In order to offer their shares to the public, companies are legally required create these documents. If you’re in the US, EDGAR is where you’ll find disclosure documents. A 10-K form will give you a very good sense of a company’s operations. If you’re in Canada, try SEDAR.  If it’s a private company, it will be harder to find juicy information. You’ll have to organise informational interviews. An informational interview is a conversation in which you speak with a current or former employee of the company. Find these employees on LinkedIn. Write them an email in which you say that you’re exploring a career with their company and you’d love to ask them a few questions and it will only take 15 minutes. More people will meet with you if you’re able to get warm introductions. Give them your quick 15-30 second bio and then ask them what they like about their job. Then ask them what is challenging about it. Listen carefully and ask follow-up questions. Meet with a few different employees and you should have a sense of some of the company’s true challenges. Brainstorm solutions. Even if they’re small, you’re headed in the right direction. Now test those solutions in further informational interviews with the same people or new people. If they like the idea, great! If not, go back to the drawing board. Best to go into the negotiations with good ideas. If you want to radically increase your negotiating leverage, start implementing the solution. A client of mine was applying for a direct response copy-writing job and was looking for a major salary increase. She produced a sales letter to sell one of the company’s products. Then she ran a few Facebook ads and drove web traffic to the letter and sold a few products for them. Needless to say, she had A TON of leverage in the salary negotiations. This won’t always be possible but here is one last way to truly supercharge your results: If you can tie a dollar value to the problem and the solution, you can ask for part of the money the company will earn by implementing that solution. If the problem is costing the company $500,000 and you can solve it, there’s a good chance they will pay you at least an extra $100,000 to solve it. Deep Research on the People Involved Now that you are an expert on the company, it’s time to become an expert on the people involved in the negotiation. If you don’t know who will be on the other side of the table, ask. Once you know who they are, see if they have a social media presence. The things they write can reveal who they are. What are their interests? If they tweet about their love of the Chicago Bears and you love the Bears, that’s a good thing to know. More importantly, you want to understand their negotiating style. Crystal Knows is a tool for applying the DISC personality assessment. It suggests there are four major behavioral tendencies. Using data from all over the internet, Crystal can give you a reasonably reliable sense of someone’s personality. Let me illustrate why this is key for salary negotiations. I was interviewing for a sales role with a well-known Silicon Valley company. The third interview was a 1 on 1 conversation with a team leader who was extremely data-focused. I’d been running my own business and selling services and he wanted to know all of my company’s marketing and sales metrics. I was blindsided. I stumbled a bit and was able to think of some of them. But that interview would have been much smoother had I known about his personality in advance. Don’t make the same mistake I did. Some people will want plenty of data to justify granting you a higher salary. Other people will make the decision on a more emotional basis. Best to know who you’re dealing with so you can prepare accordingly.  Develop Your Charisma Regardless of who you’re dealing with, the more charismatic you are, the better. People treat charismatic people well. Some good news: Charisma can be learned like most other skills. I’m not an expert so some good writers to read on this subject are Olivia Fox Cabane and Derek Loudermilk but here are three ways to improve your charisma that have worked for me in negotiations. Posture The better your posture, the more confident you appear. The better your breathing and the more in control you’ll feel. In short, you convey high status. Humans are social creatures and are very sensitive to status. If the other side thinks of you as a higher value prospect, they’ll want you more and will pay a higher price. I’ve used the Alexander Technique to improve my posture. It’s about unlearning harmful behaviors that have long weakened our postures, like excessive sitting, slouching and carrying backpacks. I suggest you look for a practitioner in your area. Facial Expressions I recommend a smile and good eye contact. A smile indicates that you’re happy to be there. Eye contact conveys that you are focused and involved in the conversation. It’s hard to argue with the importance of a smile and eye contact but we often forget to do these things. Like with most habits, try to create one new habit at a time. Best not to try to create a whole bunch simultaneously. Make a note in your calendar to practice in front of the mirror and in conversations and these habits will become second nature in no time. Presence Do some people make you feel anxious? Do you ever feel as if when they speak, they don’t think about what they plan to say next? This is not what you want people to perceive when negotiating a higher salary. You want them to see you as confident and in control. To improve your presence, there are two simple things you can do: A simple daily meditation practice in which you improve your focus and sense of calm. I like the approach in this article. Pick a single focus and dwell on it for five or ten minutes a day. An easy starting point is the space between your eyebrows. Close your eyes and focus on it. If you find your mind drifting, gently return to your focus. Do this for a few weeks and you’ll feel more in control of each moment. You’ll also find you’ll become more comfortable with silence. Second, you’ll want to use the silence to think. Don’t feel as if you are obligated to fill every moment of silence with speech. When asked a question in negotiations or any other context in which you’re not immediately sure what to say next, take a second and reflect before answering. Your answers will be better, and you’ll convey confidence and control. Zig Ziglar said that “Sales is the transfer of emotion.” If you’re not confident and charismatic in negotiations, you’ll fail to sell yourself. Conclusion If you do deep research on your target company and discover solutions to their problems, if you know the personalities of the people with which you’ll be negotiating and if you develop your charisma, you’ll be exceptionally well-prepared to succeed in salary negotiations. ",
            "date": "Answered August 15, 2018",
            "views": "2",
            "upvotes": " View 5 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Mohamed Rifnas",
                    "user_href": "/profile/Mohamed-Rifnas-17"
                },
                {
                    "user_id": "Cindy K. Sari",
                    "user_href": "/profile/Cindy-K-Sari"
                },
                {
                    "user_id": "Mohammed Ibrahim",
                    "user_href": "/profile/Mohammed-Ibrahim-804"
                },
                {
                    "user_id": "Afsar Khan",
                    "user_href": "/profile/Afsar-Khan-402"
                },
                {
                    "user_id": "Amit",
                    "user_href": "/profile/Amit-1649"
                }
            ]
        }
    ]
}