{
    "title": "What are some examples of good writing? - Quora",
    "tags": [
        "Creating Writing Advice",
        "Creative Writing",
        "Literature",
        "Writing Advice"
    ],
    "response": [
        {
            "author_info": {
                "name": "Lance Jencks",
                "href": "/profile/Lance-Jencks"
            },
            "answer_text": "WALT WHITMAN As I lay with my head in your lap, Camerado, the confession I made I resume—what I said to you in the open air, I resume. I know I am restless, and make others so; I know my words are weapons, full of danger, full of death, for I confront peace, security, and all the settled laws, to unsettle them; I am more resolute because all have denied me than I ever could have been hadall accepted me. Dear Camerado! I confess I have urged you onward with me, and still urge you, without the least idea what is our destination, or whether we shall be victorious, or utterly quell’d and defeated. WILLIAM FAULKNER I decline to accept the end of man. It is easy enough to say that man is immortal simply because he will endure: that when the last dingdong of doom has clanged and faded from the last worthless rock hanging tideless in the last red and dying evening, that even then there will still be one more sound: that of his puny inexhaustible voice, still talking. I refuse to accept this. I believe that man will not merely endure: he will prevail. He is immortal, not because he alone among creatures has an inexhaustible voice, but because he has a soul, a spirit capable of compassion and sacrifice and endurance. The poet’s, the writer’s, duty is to write about these things. It is his privilege to help man endure by lifting his heart, by reminding him of the courage and honor and hope and pride and compassion and pity and sacrifice which have been the glory of his past. The poet’s voice need not merely be the record of man, it can be one of the props, the pillars to help him endure and prevail. MARK TWAIN He ketched a frog one day, and took him home, and said he cal'klated to edercate him; and so he never done nothing for three months but set in his back yard and learn that frog to jump. WILLIAM SHAKESPEARE How tender ’tis to love the babe that milks me.I would, while it was smiling in my face, have plucked my nipple from its boneless gums,and dashed its brains out. ",
            "date": "Answered September 11, 2019",
            "views": "635",
            "upvotes": " View 2 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Wayne Weiss",
                    "user_href": "/profile/Wayne-Weiss-1"
                },
                {
                    "user_id": "Alexander Gonzalez",
                    "user_href": "/profile/Alexander-Gonzalez-261"
                }
            ]
        },
        {
            "author_info": {
                "name": "Paul Pasquale",
                "href": "/profile/Paul-Pasquale-1"
            },
            "answer_text": "1, A favorite of many: Our revels now are ended: These our actors—, As I foretold you—, were all spirits and Are melted into air, into thin air; And, like the baseless fabric of this vision, The cloud-capp’d towers, the gorgeous palaces, The solemn temples, the great globe itself, Yea, all which it inherit, shall dissolve And, like this insubstantial pageant faded, Leave not a rack behind: we are such stuff As dreams are made on, and our little life Is rounded with a sleep. — The Tempest, Act 4, Scene 1 2. Right now I’m re-reading The Great Gatsby after having been challenged by a friend to “prove” Fitzgerald is a great writer. I accepted that challenge and Fitzgerald will emerge triumphant. Here is a sample passage (online source —The Great Gatsby, by F. Scott Fitzgerald. — Adelaide ebooks. Edu — believes it to be in the public domain) Nick, the narrator, is reasonably successful, but he still aches with uncertainty and loneliness: I took dinner usually at the Yale Club — for some reason it was the gloomiest event of my day — and then I went up-stairs to the library and studied investments and securities for a conscientious hour. There were generally a few rioters around, but they never came into the library, so it was a good place to work. After that, if the night was mellow, I strolled down Madison Avenue past the old Murray Hill Hotel, and over 33rd Street to the Pennsylvania Station. I began to like New York, the racy, adventurous feel of it at night, and the satisfaction that the constant flicker of men and women and machines gives to the restless eye. I liked to walk up Fifth Avenue and pick out romantic women from the crowd and imagine that in a few minutes I was going to enter into their lives, and no one would ever know or disapprove. Sometimes, in my mind, I followed them to their apartments on the corners of hidden streets, and they turned and smiled back at me before they faded through a door into warm darkness. At the enchanted metropolitan twilight I felt a haunting loneliness sometimes, and felt it in others — poor young clerks who loitered in front of windows waiting until it was time for a solitary restaurant dinner — young clerks in the dusk, wasting the most poignant moments of night and life. Again at eight o’clock, when the dark lanes of the Forties were five deep with throbbing taxi-cabs, bound for the theatre district, I felt a sinking in my heart. Forms leaned together in the taxis as they waited, and voices sang, and there was laughter from unheard jokes, and lighted cigarettes outlined unintelligible gestures inside. Imagining that I, too, was hurrying toward gayety and sharing their intimate excitement, I wished them well. 3. A stunning stylist as well is George Eliot. Read even random passages from Middlemarch. 4. Then there are the heartbreaking passages from Catcher in the Rye. 5. And Huckleberry Finn. And … and … and… 6. How about the drama at about page 100 of Howard Fast’s April Morning? ",
            "date": "Updated September 22, 2018",
            "views": "983",
            "upvotes": " Answer requested by Paul Yermish"
        }
    ]
}