{
    "title": "What's the easiest way to write a News Article? - Quora",
    "tags": [
        "News",
        "Journalism"
    ],
    "response": [
        {
            "author_info": {
                "name": "Bernie Dowling",
                "href": "/profile/Bernie-Dowling"
            },
            "answer_text": "What's the easiest way to write a news article is a question a good journalist should never ask. Surely you are inquiring about the best way to write a news report.I have been a journalist for a long time and when I was learning the ropes I was told to write a news story in the form of an inverted pyramid. All the important stuff is at the top of the pyramid and as it goes down the information becomes less valuable. So the busy sub-editor can cut from the bottom.The news story should always explain who, what, when and where and often they are in the lead paragraph.Also when you are telling a news story, you are offer telling it backwards. Two people rushed to hospital  after emergency services arrived at  the scene of a car accident.Finally I like to tell one story in a article so as not to confuse the reader. A secondary aspect to the main story can go in a shorter supplement called a sidebar. ",
            "date": "Answered December 1, 2015",
            "views": "217",
            "upvotes": " View 3 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Siddhi Tamrakar",
                    "user_href": "/profile/Siddhi-Tamrakar-2"
                },
                {
                    "user_id": "雪坤 赵",
                    "user_href": "/profile/雪坤-赵"
                },
                {
                    "user_id": "RiDeepya Shrestha",
                    "user_href": "/profile/RiDeepya-Shrestha"
                }
            ]
        },
        {
            "author_info": {
                "name": "Adam Storrier",
                "href": "/profile/Adam-Storrier"
            },
            "answer_text": "First of all  - get to the point. Answer the 5Ws + H (How, What, When, Who, Why, Where) in the first few paragraphs. Then you can expand into more detail in the other paragraphs.  Keep to the point and write at about an eighth grade level if at all possible. Most readers only skim the article and many are not at a reading level above 8th grade, so it is important that skimmers or those with reading diffiuculties are able to understand the work. Also, I would read articles to see an example of the style they use. Never use possessive adjectives (mine, my or ours) as you are writing as a looking down 3rd person, as if you didn't exist. Be clear with who you are referring to -- unless in the same sentance as the person's name or supposed identity (even if it is \"the suspect\" or \"the witness\") don't use him or her as it may confuse readers. ",
            "date": "Answered December 1, 2015",
            "views": "107",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Siddhi Tamrakar",
                    "user_href": "/profile/Siddhi-Tamrakar-2"
                }
            ]
        }
    ]
}