{
    "title": "What's the best way to become a good writer? - Quora",
    "tags": [
        "Writers and Authors"
    ],
    "response": [
        {
            "author_info": {
                "name": "Iain MacMaolain",
                "href": "/profile/Iain-MacMaolain"
            },
            "answer_text": "Obviously, there are the mechanics. As someone already posted, writers hate to see errors. This also brings up a solid truth about writing: you won’t see your errors. The creative process is separated from the editing process (right brain/left brain) so don’t try to edit while you write, but also have someone who can edit your papers. They don’t need to do anything but circle areas that don’t flow or catch them up for some reason. But learn to proofread and edit your work. Great writing comes out of editing, not first drafts. Get experiences. I know this sounds trite, and I’m sorry for that. I’ve been trying to write since I was 18 or 19 years old, and have never been able to stick with it each day. Now, at 49, I have a lot of experiences to draw on and have tons of adventures I can use in my writing. I’m not saying you need to wait until later in life. I’m somewhat introverted, so it took me time. Get out and experience what you want to write about. I have a good friend, who has written several books now, tell me how he bought a particular type of gun. A CZ75. It doesn’t matter what type of gun, but the reason he purchased it is his main character uses this gun as his weapon of choice. The author, my friend, has never shot one before. So he can’t describe the gun first hand. His experience will change that, and I know the next book will have a good section about the experience of handling and shooting a CZ75. And the last suggestion is one you probably already know. Write every single day. The only way you get good at anything is with focused practice. So you need to practice a lot and give yourself a lot of time. What have you done and become great at quickly? Good luck, and you will find that other writers are your best friends. ",
            "date": "Answered February 9, 2018",
            "views": "14",
            "upvotes": " View 11 Upvoters",
            "upvoters": [
                {
                    "user_id": "Selcris Camello",
                    "user_href": "/profile/Selcris-Camello"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/Missy-305"
                },
                {
                    "user_id": "Jayasree Goparaju",
                    "user_href": "/profile/Jayasree-Goparaju"
                },
                {
                    "user_id": "Sada Ahmed",
                    "user_href": "/profile/Sada-Ahmed"
                },
                {
                    "user_id": "Cailin Jeffers",
                    "user_href": "/profile/Cailin-Jeffers"
                },
                {
                    "user_id": "Jens Wirdenius",
                    "user_href": "/profile/Jens-Wirdenius"
                },
                {
                    "user_id": "Liang Zikai",
                    "user_href": "/profile/Liang-Zikai"
                },
                {
                    "user_id": "Sam Fledmin",
                    "user_href": "/profile/Sam-Fledmin"
                },
                {
                    "user_id": "Gururaj",
                    "user_href": "/profile/Gururaj-42"
                },
                {
                    "user_id": "William Hull",
                    "user_href": "/profile/William-Hull-9"
                }
            ]
        },
        {
            "author_info": {
                "name": "M. Vincent Holguin",
                "href": "/profile/M-Vincent-Holguin"
            },
            "answer_text": "The path between a new writer and a good one looks nothing like an arrow; the maze forces all pen holders to retrace their steps from time to time. Let’s think in terms of a point system. Say that a good writer has 100 writing points, and a beginning writer has 0 (most beginners would have at least a few points, but let’s not ignore those at the back of the class; they may have the best view of the chalkboard). Those who have 0 points should not ask, “What one thing can I do to gain 100 points?” They should instead ask, “What one hundred things can I do to gain 1 point each?” Even without knowing the answer, their pondering that question will imitate the mindset of good writers. Writing has endless facets, all of which perhaps no one person could master. Now let’s say that great writers have 200 writing points. Good writers who have 100 points now understand that they should ask, “What ten big things can I do to gain 10 points each?” And they may know the answer; they have done perhaps all of those things already, and they would now need only redo them. And redo. And redo. In this very imperfect points system, if you get ten times better at one thing, you’ve gained 10 points. Below is a Lucky 7 List of things you can do to earn many points each. With repetition, of course. (You good to great writers might find the List a nice refresher course, but you might also learn a new trick in thing number 6 that I first heard about from the linguist, Anne Curzan [she’s awesome, and I highly recommend her books]. . . . Oh, but watch our for thing number 2; that salesman doesn’t have a crooked bow tie.) Read books on writing. I recommend Mastering the Craft of Writing by Stephen Wilbers. Study that book until you know it inside out. But you should read all of the best books on writing while understanding that they each have some weaker advice in certain places. Do not take their words as dogma; take them as advice for experimentation. And don’t decide on any rules for your own writing until neither your heart nor head have any doubt that you are a good writer with enough experience to understand the consequences of such rules.Get into the readers’ minds to realize that unclear language takes many forms, then painstakingly clean yours (but don’t be afraid to experiment and take risks). Strangers cannot know the way you think, so they have no shorthand for understanding you; your pen must force them to understand. Kindly. The way their hearts force blood to flow through their veins. And because the phrase “kindly overselling” rarely fits with reality, don’t oversell your readers without straightening out your bow tie and putting on the charm. But mostly, don’t oversell them. That means make every word count. Keep the word count of your every statement as low as you can because your readers’ time counts for as much as anything can. And do not repeat yourself. I repeat, do not repeat yourself. Unless you do so for rhetorical beauty. And remember that you can repeat something new. Yes, brand new. By using a word or phrase differently this time. Or by making an extended metaphor, which simulates repetition with reminders of the base metaphor. Keep adding reminders that do more than remind. If you can add actual repetition to your extended metaphor, all the better. But in prose writing, try and keep the meaning apparent for most of the metaphors you create; with extraordinarily rare exceptions, all good prose writing has one thing in common: clarity, clarity, clarity.Know that you must rewrite most every sentence. To quote Robert Graves, “There is no such thing as good writing. Only good rewriting.” Develop an eye for finding weaknesses in language. Do not be satisfied with a sentence you’re crafting until it forces you to.Rework the whole of the story you’re telling (and you’re telling a story in any kind of writing) until each of its parts complements all others. Knowing where your story is going helps you prevent it from contradicting itself. Vigorously outline your book, or essay, or whatever. And know that outlining your work will do the opposite of harm its spontaneity; improvisation improves with awareness. But remember to break this rule once in a while at least.Use no adverb unless it changes the meaning of your statement. (Loosening the knot of this rule will indeed unbind your writing hand. But don’t cut the rope and risk injuring the hand it’s tied to.) When did you fail?” vs “When did you fail romantically?” The adverb “romantically” limits the latter question. Fine tuning your language helps readers hear it; sometimes, opening it up can help them see your overarching themes. Learn to recognize the infrequent occasions on which you should expand the meaning of a statement. But generally speaking, the pen works as a metaphor for itself: The finer its point, the less ink it uses. Yet sometimes the sharp tip can poke the reader. Speaking of which, did you miss the weaknesses present in the example questions? Both “When did you fail?” and “When did you fail romantically?” assume that the reader has failed. That assumption will likely hold true in either case, as all of your readers will be the imperfect creatures known as human beings. But, man’s imperfection often prevents him from seeing his own failings; readers might not appreciate your assuming their ever having failed. Also, your youngest readers may never have failed romantically. And so, both of those questions may go too small for your readers to see their relevance. “Have you ever failed?” and “Have you ever failed romantically?” would be less assumptive alternatives. Still, an assumptive question can work when you know exactly why it will. Writing questions is an artform; trial and error will teach you vastly more about asking them than instruction will. The best advice I can give on the subject is this ironic mantra: Before presenting them to anyone else, ask yourself questions about your questions. And pay special attention to modifying words; questions are particularly prone to rogue adverbs. Just remember to use your adverbs conscientiously. (What would removing the adverb do to that last sentence?) “He sprinted quickly.” That sentence made me ill to write it; “sprint” means to run at full speed, and “quickly” means with speed. The sentence says this: “He ran at full speed with speed.” Yuck! If the sprinter has already been established as a slow moving person who is now running faster than his normal speed, a sentence like this would talk better: “He sprinted with feet faster than his own.” As you may have noticed, that sentence contains no adverb. An interesting way to call the man slow might be a sentence like this: “He sprinted slowly.” It arguably has an oxymoron in it, but an oxymoron can help the magician do his craft. Or it can suffocate the rabbit inside the hat. Remember, practicing will make the trick perfect. Our trick-sentence technically says this: “He ran at full speed slowly.” I would advise against such a statement in most cases. But if, for example, your readers already know that the sprinter has a bad knee, I would say go for the magic. Take a risk. The strange wording might work peculiarly well if his bad knee had a sad story behind it. Now your readers might feel sympathy for the man. Especially if he were running scared from something similar to what caused his injury. Even under these circumstances, you might choose a more traditional way of calling the man slow. And you get to, writer, because you are the chooser of your own words. But whatever choices you make, don’t make them lazily. Truly, your gut instinct can lead to brave choices, but using your reflexes requires alertness. So write vigorously. With all your wit. Don’t expect your readers to give you all of their attention if you don’t give them all of yours. And lastly, the foremost point herein thing number 5 can be summed up with the greatest three words from Strunk and White’s The Elements of Style: “Omit needless words.”Learn and use the “known-new contract,” which is a method for choosing a good subject for a new sentence. (The advice for this answer will ignore compound and complex sentences, and so it is not an extensive exploration of the known-new contract.) The known-new contract (KNC) has three methods: constant, derived, and chained. Each of them helps your readers follow what you’re saying. Every full sentence has a subject and a predicate. The subject is what the sentence is about; the predicate says something about the subject. “The cat jumped.” “The cat” is the subject, and “jumped” is the predicate. But let’s say that sentence followed this one: “The taller building was built before the shorter one.” . . . Why on earth would the other sentence follow that one? Cats do not jump because a bigger building was built before a shorter one. Here is where the logic behind the KNC steps in. The constant method of the KNC is when the subject of one sentence becomes the subject of the next. “The cat jumped.” For that to work as a new sentence (not the first in a paragraph) in the constant method, the subject of the previous sentence must also have been “The cat.” Take these two sentences: “The cat saw the cucumber. The cat jumped.” This sequence of sentences works for the constant method of the KNC because the side-by-side sentences have a common subject. A pronoun to replace “the cat” in the second sentence would also have qualified as a constant-method subject—and it would have sounded better. Remember also that reordering your words rarely switches subject and predicate. “The cat saw the cucumber. Five feet in the air she went!” “She” remains the subject despite much of the predicate coming first. And personally, I find that the reordering in this case made for a fun sequence of sentences. But you don’t need to go talking like Yoda all the time. A good idea that is not. The derived method of the KNC is when the subject of the new sentence is a subset of the previous one. “The cat saw the cucumber. Her back arched.” “Her back” is a subset of the cat because it is part of her. “The cat saw the cucumber. Her claws unsheathed.” The claws are a subset of the cat; the sequence qualifies as the derived method of the KNC. (There is a trick that makes a subset out of almost anything, but to avoid overloading you, I’ll save that cheat code for a future answer.) And the chained method of the KNC is when the subject of the new sentence is taken from the predicate of the previous one. “The cat saw the cucumber. The cucumber was green and bumpy.” Part of the previous sentence’s predicate, “the “cucumber,” became the next sentence’s subject. “The cat saw the cucumber. The cucumber stood its ground.” Again, the new sentence’s subject, “the cucumber,” came from the previous one’s predicate. Readers can easily follow writing that skillfully uses any of these three methods—without having to reread. As stated, the advice on the KNC herein is basic. Because you should learn the basics first. But one more important thing, you can use any of the three methods for any new sentence. For instance, you can use the chained method for a sentence that follows one that used derived or constant method. You can use any method in tandem with either of the others. In fact, you probably should not use only one method for a long paragraph—particularly not with chained method; the paragraph could end too far from where it started. But once in many blue moons, you might want your paragraph to run a marathon. In these cases, I would say go for it as long as you know what you’re going for.Before choosing a verb, figure out which of the three types of verbs it should be: active, passive, or stative. (Just as I did in thing number 6, I use the often inaccurate term “subject of a sentence” herein number 7; I believe that this entire answer is more accessible for its use of that quasi-misnomer.) An active verb occurs when the subject of a sentence is the agent (or “doer”) of its verb (yes, active verbs constitute the “active voice,” but as the idea of “voice” disregards stative verbs, choosing to class verbs into “types” instead of “voices” creates less confusion). “John threw the ball.” “John” is the subject. “Threw” is the verb. John, the subject, was the one who did the throwing. And so, the verb is active. A passive verb occurs when the subject of a sentence is the object of its verb. “The ball was thrown by John.” “The ball” is the subject. “Thrown” is the verb. But the ball, the subject, did not do the throwing, so it is not the agent of the verb; it was the thing that was thrown, so it is the object of the verb. And so, the verb is passive. And a stative verb occurs when the verb is not an action verb, but a state of being verb—or rather, a form of “be.” “John is tall.” John, the subject, isn’t doing anything. The sentence has no action verb; it has the state of being verb “is.” And so, the verb is stative. (However, if we made the “is” a helping verb, the verb could become active or stative. “John is growing tall.” The “is” in that sentence works only as a helper for “growing.” And so, the verb of the sentence—technically a verb phrase—is active. When two verbs are right next to each other, they sometimes function as one unit.) If not used well, a stative verb can make a sentence dull. In place of the example sentence with the stative verb, I would suggest a “show don’t tell” alternative with an active verb—something like this: “John hit his head on the top of the doorway.” (Such a sentence implies that John is clumsy as well as tall. The “show don’t tell” rule often results in added meaning. Also, it reminds you to prove things to your readers rather than preach to them. For instance, instead of telling the readers that your character is tough, you have him get shot in the leg, yet not fall down.) But you can make a stative verb exciting by having it express a bigger idea. “She is my happiness. And that is an understatement.” Neither of those two sentences (and you certainly can start a sentence with “and”) make a boring statement. “She is the murderer of her children.” Such a state of being has automatic intrigue. Make your state of being verbs big when you can. Remember, mindfully choose every verb. That means choose what you want it to accomplish. And sometimes, verbs can’t accomplish much without help from the words around them. Such can be the case with passive verbs, also. You might have heard not to use the passive voice, but passive verbs, which are the only ingredient in the passive voice, do very well in several situations. For instance, they often shine when you want to illustrate victimization. “Tara was punched in the eye by a man three times her size.” “Tara,” the subject didn’t do the punching, but that’s the point; she didn’t do anything to deserve what happened to her. Only the most insensitive writer would insinuate otherwise. And the passive verb keeps the attention on Tara—not her assailant. You would certainly keep Tara as the subject if the man who punched her was an unknown person whom you wouldn’t talk about again. But under some sets of circumstances, having the assailant be the subject of the sentence could be a better choice. Whenever your sentence has a victim—or anything resembling one—you have to ask whether the victim or the perpetrator should be the focus. Whichever you think the immediate focus should be should also be the subject of the sentence—in the majority of circumstances. But remember to write clearly—at all times—and understand that the passive voice, when used injudiciously, can harm the clarity of your language. Here’s a quote by Bertrand Russell to remind you to never sacrifice clarity: “Clarity above all.” Finally, active verbs work best for most sentences; you want action. People like people who do things. People sometimes like victims, but they always like victims who pick themselves off the ground and do something about their situations; active verbs add vigor to your storytelling. Your instinct should be to use an active verb. And your mindful considerations—of which there could be one or several—will either confirm or reject that instinct.Thank you for reading. Happy writing. ",
            "date": "Updated October 28, 2020",
            "views": "149",
            "upvotes": " View 134 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Daisy Non",
                    "user_href": "/profile/Daisy-Non"
                },
                {
                    "user_id": "Humii Osman",
                    "user_href": "/profile/Humii-Osman"
                },
                {
                    "user_id": "Momenul Ahmad",
                    "user_href": "/profile/Momenul-Ahmad"
                },
                {
                    "user_id": "Ghanshyam Sharma",
                    "user_href": "/profile/Ghanshyam-Sharma-290"
                },
                {
                    "user_id": "Aditya. Babun",
                    "user_href": "/profile/Aditya-Babun"
                },
                {
                    "user_id": "Christabella Masukume",
                    "user_href": "/profile/Christabella-Masukume"
                },
                {
                    "user_id": "Linda Lewis",
                    "user_href": "/profile/Linda-Lewis-34"
                },
                {
                    "user_id": "Guyton Jingle",
                    "user_href": "/profile/Guyton-Jingle"
                },
                {
                    "user_id": "Chae Yang",
                    "user_href": "/profile/Chae-Yang-3"
                },
                {
                    "user_id": "Arti Upadhyay",
                    "user_href": "/profile/Arti-Upadhyay-23"
                }
            ]
        }
    ]
}