{
    "title": "What might be the reason for feeling that no one you ever talk to can connect with you in the way you feel you need? How do you find someone who can? Could it be you more than other people in some way, and if so, how do you change that? - Quora",
    "tags": [
        "Loneliness",
        "Understanding Emotions",
        "Social Advice",
        "Emotions",
        "Understanding Human Behavior",
        "Dating and Relationships",
        "Interpersonal Interaction",
        "Human Behavior",
        "Life and Living"
    ],
    "response": [
        {
            "author_info": {
                "name": "Tracey Anderson",
                "href": "/profile/Tracey-Anderson-72"
            },
            "answer_text": "The answer here is expectation…how possibly of all the unique combinations of responses you have a preconceived expectation of a particular connection To me this is your issue…preconceived expectation is restricting you from accesses you're not yet aware exist and they're setting up the others you encounter to be a shut out because their behaviors don't match your what actually is fantasy Close the preconceived doors and open the possibilities doors….. you'll free yourself to learn so much and to experience so much greater that is real, here and now Participate in activities of value to you to improve others lives and of adventure…not necessarily hang gliding but perhaps an art class, something that requires an opening of You to learn Preconceived is a box without a lid….it may make You feel safe but You're trapped Open Yourself to a life without a lid ",
            "date": "Answered February 3, 2020",
            "views": "37",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Nathan Hudson",
                    "user_href": "/profile/Nathan-Hudson-10"
                }
            ]
        },
        {
            "author_info": {
                "name": "April Rodriguez",
                "href": "/profile/April-Rodriguez-52"
            },
            "answer_text": "It’s hard to make real connections with people. Even harder in Today’s society where everyone is disposable. No one ever wants to get to know somebody. It’s not you. You will find that person who gets you. It just may take some time. It’s estimated that someone has to go on 30 first dates before finding someone. Friendships that’s longer. Don’t lose hope. That’s why they say your lucky if you have a few good friends. Remember that Jesus loves you and is your best friend. He’s waiting to hear from you and totally gets you.😉 ",
            "date": "Answered January 31, 2020",
            "views": "75",
            "upvotes": " Answer requested by Tucker Jones"
        }
    ]
}