{
    "title": "What would you want to tell your best friend? - Quora",
    "tags": [
        "Friendship"
    ],
    "response": [
        {
            "author_info": {
                "name": "Isha Suthar",
                "href": "/profile/Isha-Suthar-4"
            },
            "answer_text": "Dear Deepansh Yadav, Dear Bestie, there are no words that can show my love for you. I just want you to know that I wouldn’t have transformed into the person I am today if I hadn’t met you. You are always there for me in my moments of sorrow and you are always the wall I can lean on. Thank you for your unconditional love and support. You are so protective and caring and I will never forget that. Thank you for every piece of good advice, every tear that you share with me. I won’t be able to thank you enough for everything that you do for me to help me feel better. I know that life will try to send us on different paths but I want you to know that I will never forget you. I will always be close to you and even if we go to different colleges or if life separates us in any other way, I will always stay in touch with you. Because, truth be told, you are the Meredith to my Yang. Without you, my life wouldn’t make any sense. And you know what? I think God sends an angel to each of us to protect us and to be with us for better or worse. I guess for me that person is you. No matter what happens, you will always be my person. You will always be the sun after the rain and the person I call first when something bad happens to me. Also, you will always be the one I will call first to share my happiness with. Because that is what you are—my other half, my soulmate, the brother I never had. You are the person who finishes my sentences, the one who sees when something is wrong with me even if I don’t say anything. I know that I will have many friends in my life but my love for you is eternal. I promise you that I will always be there for you, like you are always there for me. I will try to participate in your life as much as possible and no matter whether I get married or have kids, I will never forget about you. Don’t think that another person can replace you in my heart because that is impossible. I want you to know that I will be there for you whenever you need me, just like you are there for me when I need you. I will never forget how you embraced me when everyone else abandoned me. I will keep that memory in my heart forever. And when I think about the things I want to accomplish in my life, I always picture you standing next to me. You will be my partner in crime. You will be the one standing next to me when I get married, holding my bouquet. You will be the ‘uncle’ to my kids. And most of all, you will always be my person. I just want you to know that I love you to the moon and back and I can’t wait to make so many more wonderful memories with you. With love,Your Bestie Isha Suthar  ",
            "date": "Answered September 22, 2020",
            "views": "839",
            "upvotes": " View 6 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Kk Ss",
                    "user_href": "/profile/Kk-Ss-56"
                },
                {
                    "user_id": "Ajay Kumar (AJ)",
                    "user_href": "/profile/Ajay-Kumar-AJ-26"
                },
                {
                    "user_id": "Miguel Malfabon",
                    "user_href": "/profile/Miguel-Malfabon"
                },
                {
                    "user_id": "Wendy Kim",
                    "user_href": "/profile/Wendy-Kim-63"
                },
                {
                    "user_id": "Kashish Rajput",
                    "user_href": "/profile/Kashish-Rajput-62"
                },
                {
                    "user_id": "Deepansh Yadav",
                    "user_href": "/profile/Deepansh-Yadav-11"
                }
            ]
        },
        {
            "author_info": {
                "name": "Val Johnson",
                "href": "/profile/Val-Johnson-52"
            },
            "answer_text": "W.J. Barry I can't tell you much because she moved when we were sixteen. We met at age thirteen and were friends because our Dads were friends, we all attended church together. We were the loner odd balls because we didn't party like other teens did, in the booming mining town back in the wild seventies. There was many church events we attended throughout the week and also on weekends. We also attended picnics with her family and her family would also attend our family's special occasions and events. So we spent time at school together and most evenings together, so we were close best friends. She moved away and returned back a married woman with three toddlers. I was also married, one kindergarten and one baby. Of course we reunited our close friendship once again for about ten years until her husband's work brought them to live somewhere else. We're connected via Facebook, we chat once in an odd while but our bond is close and strong that we're comfortable with our relationship. Nothing can break our strong connection. We don't keep in touch on a regular basis but when we chat it's like time doesn't make a difference. We learned basic sign language alphabets via my encyclopedia. We did this to have private conversations and of course criticizing classmates, other students and staff. All the teachers knew we communicated by sign language, always after we were done our work. The teachers were impressed with us using sign language alphabets to communicate. My bestfriend and I were capable of getting really good grades but being typical teens we thought whatever! Therefore always had time to chat while our classmates finished the task at hand. Of course being scolded for giggling or reacting to what was said. My fondest and funniest memory is during grade eight exams. Back in the mid seventies, all of high school wrote exams in the gym and because we we're such close friends we we're separated one row apart , she sat one seat back from me because the teachers, four of them, thought we might cheat. I thought how dare they think of a Christian teen like that, sheesh! Anyways! On with the memory. It was required you stay one hour, no matter when you finished your exam. My bestfriend was quicker than I was, about five or ten minutes. My bestfriend asked one of the teachers if we could communicate by signing, yes our pencils were removed so we couldn't change or add to answers, fair enough. Well gym full of students probably two hundred high school students grades eight up to grade twelve and I couldn't spell weird, deep sigh! So I'm spelling, wired, weerd, werude… my bestfriend is killing herself laughing because she can't understand what I'm trying to spell. A teacher goes over to my bestfriend to quietly chastise her, my friend was never one to comply so suggested go over and help her spell the word. Teacher comes over and asks what word I'm trying to spell, so I tell the teacher, teacher spells it out for me. I finally spell weird and my bestfriend falls off her chair, rolling on the floor laughing, of course we're immediately asked to leave a whole fifteen minutes early from the exam gym. As we're leaving, we're killing ourselves laughing because it was so funny! I think we rolled around the field laughing for sometime. Good times. So I can't tell you much about my bestest friend in the whole wide world but our bond is close and strong. This summer we're finally meeting after about thirty years. ",
            "date": "Answered May 1, 2019",
            "views": "26",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "William J. Barry",
                    "user_href": "/profile/William-J-Barry"
                }
            ]
        }
    ]
}