{
    "title": "What tips can you give for writing personal statements? - Quora",
    "tags": [
        "Personal Statements",
        "Writing Advice"
    ],
    "response": [
        {
            "author_info": {
                "name": "Charlie Mason",
                "href": "/profile/Charlie-Mason-26"
            },
            "answer_text": "Personal statements are all about selling yourself, and university is all about self improvement. With these things in mind, here are a few tips. Be Boastful.Include your achievements and skills, and show them in the best possible light. Don’t be afraid to exaggerate a little, but keep it honest and truthful. Done a DofE? Say so. Even if you’ve not fully completed it, it shows a willingness to get involved and to go beyond the bear necessities required of you. Great qualities in a university student. Show An Interest.Say what you want to learn, and why you want to learn it. If you have an idea of the career you’d like to embark upon after graduating, say so. Room For Improvement.Is there something you’d would like to be better at? Say so. Universities don’t expect you to be perfect, and they’d have no interest in you as a student if you were. Show that you’re aware of your weaknesses and want to improve upon them. It’s often much more impressive to universities than being an ubermensch. Don’t Ramble On.Be concise, nobody wants to read a 10 page essay of your life story when they have 10,000 other essays to go through as well. Don’t be afraid to explain things, but trim the fat and get straight to the point.Also, edit. Nothing is as detrimental to a personal statement as bad spelling and/or grammar. If you can’t be bothered when you stand to gain a place at uni, why would you when your place is secured? Don’t give them reason to ask that question. Hope this helps some, good luck. ",
            "date": "Answered October 14, 2017",
            "views": "207",
            "upvotes": " View 5 Upvoters",
            "upvoters": [
                {
                    "user_id": "James Fogge",
                    "user_href": "/profile/James-Fogge"
                },
                {
                    "user_id": "Naomi Kerseybrown",
                    "user_href": "/profile/Naomi-Kerseybrown"
                },
                {
                    "user_id": "Victoria Baker",
                    "user_href": "/profile/Victoria-Baker-38"
                },
                {
                    "user_id": "Cassandra Sullivan",
                    "user_href": "/profile/Cassandra-Sullivan-2"
                },
                {
                    "user_id": "Martha Lancaster",
                    "user_href": "/profile/Martha-Lancaster"
                }
            ]
        }
    ]
}