{
    "title": "What are some examples of poems with 4 stanzas and 4 lines? - Quora",
    "tags": [
        "Poets",
        "Poems",
        "Poetry"
    ],
    "response": [
        {
            "author_info": {
                "name": "Tim Floto",
                "href": "/profile/Tim-Floto"
            },
            "answer_text": "Emily Dickinson wrote quite a few in 4 stanza/ 4 lines each… Emily Dickinson (1830–86). Complete Poems. 1924. Part One: Life V GLEE!the great storm is over! Four have recovered the land; Forty gone down together Into the boiling sand. Ring, for the scant salvation! Toll, for the bonnie souls,— Neighbor and friend and bridegroom, Spinning upon the shoals! How they will tell the shipwreck When winter shakes the door, Till the children ask, “But the forty? Did they come back no more?” Then a silence suffuses the story, And a softness the teller’s eye; And the children no further question, And only the waves reply. ",
            "date": "Answered November 16, 2016",
            "views": "245",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Lizza Marie Vargas",
                    "user_href": "/profile/Lizza-Marie-Vargas"
                },
                {
                    "user_id": "Lynne Appino",
                    "user_href": "/profile/Lynne-Appino"
                },
                {
                    "user_id": "Tarsha Adams-Hurse",
                    "user_href": "/profile/Tarsha-Adams-Hurse"
                },
                {
                    "user_id": "Akhil Nair",
                    "user_href": "/profile/Akhil-Nair-155"
                }
            ]
        },
        {
            "author_info": {
                "name": "Edwin El-Mahassni",
                "href": "/profile/Edwin-El-Mahassni"
            },
            "answer_text": "(My own work. Sorry for formatting, can’t work out the spacing). A Jungian Odyssey Several years ago, I went into the sea, full of wonder, wanting to explore; to learn what I could see, reflections emerging from the seafloor. At first, it was all so peaceful, frolicking in a nautical realm; a paradise so blissful, everything was gentle and calm. But the many monsters quickly came, from the deep, seeking me out; craving attention and some fame, thoughts loudly began to shout. But today I am filled with peace, the terrors are feeling cheated; at the bottom, resting with unease, my internal foes for now defeated. ",
            "date": "Answered March 11, 2019",
            "views": "71",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Lizza Marie Vargas",
                    "user_href": "/profile/Lizza-Marie-Vargas"
                }
            ]
        }
    ]
}