{
    "title": "What are some best practices for fiction writers creating diverse characters, and avoiding tokenism? - Quora",
    "tags": [
        "Fiction Writing",
        "Fiction",
        "Creative Writing",
        "Fictional Characters",
        "Writers and Authors",
        "Writing Advice"
    ],
    "response": [
        {
            "author_info": {
                "name": "Jalen Williams",
                "href": "/profile/Jalen-Williams-30"
            },
            "answer_text": "From my experience, when I’m writing a story, there will only be maybe 1–4 characters that I really care about, and the rest of the characters are embedded in the plot for the main characters to interact with. The way I diversify my cast of characters for main characters is a lot different than how I deal with it for the more peripheral ones. I’ll talk about the latter first. I do this a lot: I need a character for something (I don’t want to say merely just as a plot device. Honestly, I’m thinking of a character of even lesser importance). Let’s say the main protagonist lives in swanky apartment complex, and each morning when she leaves for work, she says hi to the doorman. She’s not just going to say “hi, doorman,” she knows the guy. So I’ll give him a name— “Jim.” I’ll call him “Jim.” Why? It was the first name to pop into my head. Don’t really care what Jim looks like. Don’t care about his background or if he has a wife and kids. He’s just Jim. More often than not, I’m imagining Jim as a white male. And this is the same for “Anna” on the fourth floor in Accounting, or “Dave” at the gym. It’s often just a default. It almost seems cheap, but thinking outside the box for how you name those peripheral characters will force you to think about who these people could possibly be and take time to describe them more and bring them to life. Maybe instead of “Jim,” “Anna,” “Dave,” think: “Antoine,” “Marisela,” “Yi.” Diversity in the peripheral is easy. Now, diversity among the main characters is sometimes where you run the risk of “tokenizing” a character. The way to avoid this might surprise you, though. The best way to avoid making a token character (besides just eliminating diversity altogether), is to just not try so hard to nail a personality you think is characteristic of any particular race or nationality. Let them be the people they would have been if everyone in your story was blue or green. Since we don’t know what a blue or green person would act like, then it’s totally up to the writer to determine how his or her character should behave. Apply this same line of thinking to non-blue/green people. The only exception to this is if race is an important theme in your story. Then you have much more work to do, considering now you will be dealing with the constant interplay of a character’s self-image, his or her perceptions, and how he or she acts in the world in accordance with the former two, and all the flaws and struggles that come along with all those things. I hope this was helpful to you! ",
            "date": "Answered January 8, 2017",
            "views": "311",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Pascal Gorter",
                    "user_href": "/profile/Pascal-Gorter"
                },
                {
                    "user_id": "Nicole B. Dotzenrod",
                    "user_href": "/profile/Nicole-B-Dotzenrod"
                },
                {
                    "user_id": "Nick Travers",
                    "user_href": "/profile/Nick-Travers-2"
                },
                {
                    "user_id": "Anand Silodia",
                    "user_href": "/profile/Anand-Silodia"
                }
            ]
        },
        {
            "author_info": {
                "name": "Delaney Smith",
                "href": "/profile/Delaney-Smith-11"
            },
            "answer_text": "Put the character first, and their traits second. For example, your protagonist is a dragon-slaying warrior, who also happens to be gay. The easiest way to write diverse characters is just to treat them like people. Just write people. Everybody is a person, so all your characters are going to be people too, regardless of their race or sexual orientation or gender identity, etc. If you treat your diverse characters the same as you would treat a “non-diverse” character, you’ll easily avoid token characters. ",
            "date": "Answered January 9, 2017",
            "views": "185",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Emmanuel J. Alzol",
                    "user_href": "/profile/Emmanuel-J-Alzol"
                },
                {
                    "user_id": "Pascal Gorter",
                    "user_href": "/profile/Pascal-Gorter"
                },
                {
                    "user_id": "Nicole B. Dotzenrod",
                    "user_href": "/profile/Nicole-B-Dotzenrod"
                },
                {
                    "user_id": "Joe Smith",
                    "user_href": "/profile/Joe-Smith-1350"
                }
            ]
        }
    ]
}