{
    "title": "What are some great things to write lyrics about? - Quora",
    "tags": [
        "Songwriting",
        "Song Lyrics",
        "Songs",
        "Writing"
    ],
    "response": [
        {
            "author_info": {
                "name": "L. E. Miller",
                "href": "/profile/L-E-Miller"
            },
            "answer_text": "I like to write about experiences in my life, or things that make me passionate/evoke strong emotions. Often, if a subject feels very personal, I’ll indirectly talk about it with metaphors or other poetic language. I also like to reference famous lines in works of literature or pop culture. For example, one of my first songs was sort of a retelling of the Garden of Eden story. The chorus states what I think about it: “Whether in sunshine or whether in rain/Knowledge is better than Eden again.” Another way I come up with song lyrics is just running with silly ideas I have. I’ve written a song about feeling left out as a Rogue in Dungeons & Dragons, a love song filled with Shakespeare references, and even a rap song entitled “Holes in my Underwear”. My best advice is to let the ideas flow and record them all in some way: paper and pencil, word processor, the Voice Memo feature on a smartphone, whatever you like best. No idea is too dumb to write down, and no lyric is too clunky to explore. I find it hard to follow that piece of advice sometimes, but I’m always trying my best. ",
            "date": "Answered May 9, 2019",
            "views": "125",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Jon Baldwin",
                "href": "/profile/Jon-Baldwin-4"
            },
            "answer_text": "I play in an Americana band. We do songs about the bottle, serial killers, the Devil, the dustbowl, and the Ludlow Colorado massacre. Anything that's part of the American experience, though maybe with a cynical view and the worst possible outcome. It's fun to take the experiences we know, and twist them just a little for a slightly darker veiw. Good luck, and have fun with it! ",
            "date": "Answered September 27, 2017",
            "views": "29",
            "upvotes": "0"
        }
    ]
}