{
    "title": "What Elements Would Make a Good Self Insert Fanfiction? - Quora",
    "tags": [
        "Fanfiction",
        "Literature"
    ],
    "response": [
        {
            "author_info": {
                "name": "Dixie Conley",
                "href": "/profile/Dixie-Conley"
            },
            "answer_text": "A self-insert character should be: Realistic, with flaws and faults. Their reactions should be unfeigned and natural. In other words, if you have a girl from the 20th century set down in the The Lord of the Rings, she should not have magical powers, be instantly the darling of everyone or have superb archery and sword fighting skills.As unknowledgeable of the plot as the other characters. There are some self-inserts that work well with the SI knowing the plot up until the point where they were inserted into the story, but those stories acknowledge that this knowledge becomes less and less useful as changes are made. The SI should not share the author’s omniscience.Facing their own challenges and obstacles. There’s nothing worse than a SI who dismisses all difficulties with a wave of her dainty hand.A foil for the other characters. The best self-inserts I’ve read have caused dilemmas for the other characters just by existing.Funny or amusing. While the very best SI I know of isn’t either, most of the SIs I’ve liked have made me laugh, either by their ‘fish out of water’ behavior or their quirks.",
            "date": "Answered October 29, 2016",
            "views": "35",
            "upvotes": " View 19 Upvoters",
            "upvoters": [
                {
                    "user_id": "Harold Muniz",
                    "user_href": "/profile/Harold-Muniz-1"
                },
                {
                    "user_id": "Pepper Pepper",
                    "user_href": "/profile/Pepper-Pepper-31"
                },
                {
                    "user_id": "Audrey Claire Sem",
                    "user_href": "/profile/Audrey-Claire-Sem"
                },
                {
                    "user_id": "Maria Echica",
                    "user_href": "/profile/Maria-Echica"
                },
                {
                    "user_id": "Yannis Benazra",
                    "user_href": "/profile/Yannis-Benazra"
                },
                {
                    "user_id": "El Juego",
                    "user_href": "/profile/El-Juego-1"
                },
                {
                    "user_id": "Amanda Labelle",
                    "user_href": "/profile/Amanda-Labelle-7"
                },
                {
                    "user_id": "Akira Wolfe",
                    "user_href": "/profile/Akira-Wolfe"
                },
                {
                    "user_id": "Derek Griffiths",
                    "user_href": "/profile/Derek-Griffiths-5"
                },
                {
                    "user_id": "Kenz Huynh",
                    "user_href": "/profile/Kenz-Huynh"
                }
            ]
        },
        {
            "author_info": {
                "name": "Sierra Balleisen",
                "href": "/profile/Sierra-Balleisen-1"
            },
            "answer_text": "Characterization. Especially characterizing you and characterizing the main characters of the work.A real story line. Not the same one as the original work, a real story line of your own unless the entire premise is that you do what the main character did, but better.Length. Most people don’t care about a self-insert fanfic that’s 2k. If you want people to notice it (I assume that’s why you asked), you need to write a long work.Generally good writing. If you have good grammar and spelling, and you understand the original work, your work is more likely to be appreciated.",
            "date": "Answered July 9, 2020",
            "views": "730",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Harold Muniz",
                    "user_href": "/profile/Harold-Muniz-1"
                },
                {
                    "user_id": "Pepper Pepper",
                    "user_href": "/profile/Pepper-Pepper-31"
                }
            ]
        }
    ]
}