{
    "title": "What percentage of PhD students fail their thesis defence? - Quora",
    "tags": [
        "PhD Thesis",
        "Ph.D. Students",
        "Theses and Dissertations",
        "Academia",
        "Graduate School Education"
    ],
    "response": [
        {
            "author_info": {
                "name": "Jan Christian Bernabe",
                "href": "/profile/Jan-Christian-Bernabe"
            },
            "answer_text": "Usually Ph.D. candidates, after consultations with their dissertation chair or other members of their dissertation commitee, will schedule their defense under the assumption that they (1) have finished their dissertation; (2) their committee, especially their chair has read the completed final draft; and (3) they are told that they are ready to defend their work. I say “usually” because they are instances when students will fall off their dissertation chairs’ radars. Some doctoral students do tend to avoid communications with their advisors while “writing” their dissertations. It’s a common affliction grounded possibly in denial, feeling like you’ve not written enough, or even just feeling like you don’t know what the hell you’re doing and you don’t want to let your chair or even your committee know that. Dissertation chairs, as you can imagine, have so many other academic commitments, dissertation advisees, committees, projects, and so forth. If you’re not on top of your communications game with your dissertation chair, be forewarned, many of them will not take time out of their busy schedule to track you down. That’s not their job, really. Bottom line: avoid practicing avoidance. Update your chair regularly, even if you’ve written zero pages the last time you checked in. They need to know you’re still alive, thinking, and possibly writing. This is all to say that there might be some Ph.D. candidates that will schedule their defense without any substantive input about their work from their chair or committee thinking (foolishly) that they’ll be able to pass and then are surprised that they don’t. But more egregiously, in my opinion, are the dissertation chairs that will allow candidates to proceed even if they haven’t had any meaningful discussions about the work of the students. Advisors know better than to allow a Ph.D. candidate to schedule a defense when the work isn’t really finished or if the work is subpar. They have stakes in the successes of their advisees and, I would hope, would want their students to get tenure track jobs or postdoctoral fellowships (academia is all about pedigree after all). Remember, your committee has to read your finished dissertation before your defense, so they’ll know beforehand the quality of work and should tell you if you’re ready to defend it. To get back to your question: I’m not sure there are sources that say “X” percentage of Ph.D. candidates fail their defense. There is data on how many doctoral students don’t complete their degree (I don’t know how granular the data is—whether it’s broken down by specific reasons). But in my experience and from anecdotal evidence, not passing one’s dissertation defense is rare. Not all dissertation chairs are that unforgiving, even when they haven’t kept in touch with their advisees during the dissertation process. There are many doctoral departments that have checks in place that make it really hard to fail your defense. For example, if a student has done everything right, has communicated with their advisors, has written their dissertation, and has scheduled their defense. But on the day of the defense, they have a freak out moment or blank during the examination (it’s been know to happen). Usually, the committee or the department will allow the student to reschedule. Failing a dissertation defense if it happens, let’s say, when a Ph.D. candidate has done everything right like keeping in constant communications with your advisor and committee members, having everyone sign off on your defense date, and not receiving any negative criticism to the work that they’ve submitted to them before the defense, I suspect, may be related to something more malicious on your committee’s part. That would be a very odd scenario. If that happens, it does no one—students or advisors—any good. And honestly, what a waste of time for everyone. Before you schedule your dissertation defense, you should have a good sense of how everyone on the committee is feeling about your work. You need to communicate with your chair if you have any doubts. From my experience, your chair or committee should never sign off on a defense date if they don’t think you are ready. ",
            "date": "Updated May 11, 2018",
            "views": "614",
            "upvotes": " View 91 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Brett Elkins",
                    "user_href": "/profile/Brett-Elkins-1"
                },
                {
                    "user_id": "Katelin Ten",
                    "user_href": "/profile/Katelin-Ten"
                },
                {
                    "user_id": "William James",
                    "user_href": "/profile/William-James-399"
                },
                {
                    "user_id": "Sudais Asif",
                    "user_href": "/profile/Sudais-Asif"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/Arthur-Curb"
                },
                {
                    "user_id": "Anindita Roy",
                    "user_href": "/profile/Anindita-Roy"
                },
                {
                    "user_id": "Korki Buchek",
                    "user_href": "/profile/Korki-Buchek"
                },
                {
                    "user_id": "Marie",
                    "user_href": "/profile/Marie-970"
                },
                {
                    "user_id": "Shubham Jain",
                    "user_href": "/profile/Shubham-Jain-466"
                },
                {
                    "user_id": "Tyler Buividas",
                    "user_href": "/profile/Tyler-Buividas"
                }
            ]
        },
        {
            "author_info": {
                "name": "Michael Barnes",
                "href": "/profile/Michael-Barnes-354"
            },
            "answer_text": "Interestingly, a quick search did not yield any readily available data. That might be an avenue for future research—even a worthy dissertation topic! #irony #metameta My hypothesis, confirmed anecdotally by numerous sources, is that outright “failure” of a dissertation defense is *extremely rare. Probably in the worst case, low single digits (1–3%) and potentially less than that (<1%). This is interesting because on the form that professors (committee members) sign is a check-box that includes the “fail” option: PassRe-DefendFailYet, despite constituting 1/3 (~33%) of choices, if “failure” is selected in less than 3% of defenses, that represents a major, disproportionate reduction. Failure is underrepresented at just 3% compared to 33%. The odds seem—quite literally—ever in your favor! However, this makes sense when you consider: Most PhD programs have qualifying exams that assess a student’s readiness to advance to candidacy, which is a status conferred only to those who are approved to pursue their dissertation.My PhD program held a proposal defense, which was a proactive, mini-defense by which time I was expected to have written the first 3 chapters of my dissertation (intro, theory, methodology). This was helpful because more than 50% of my dissertation was inked and validated by my committee even before the data collection process had passed the pilot stage!Most PhD students are expected to have published rigorous, peer-reviewed work in a respectable journal prior to the dissertation defense; the dissertation is just an (often elongated), solo version of these types of studies.The committee is often chosen because they have co-authored, or co-presented with the student, or otherwise are familiar with the student’s body of work. Hence they expect the recent past success to be replicated.The chair especially, and the committee as a whole, often list this “service” on their CV, and this is often a component of their evaluation for tenure. So, a failed defense would be a stain on everyone’s record, or at least a colossal waste of time.The chair and committee often have to sign off on a form just to *schedule the defense date; the form implies a final draft has been shared and reviewed.The chair and committee will confer privately at the very beginning of the actual defense; my assumption is, here is a chance to take a quick poll to see if everyone recommends to proceed, otherwise the defense can be rescheduled politely, and largely ‘off the record’Another choice on the form is “re-defend” which would (probably) feel horrible to see checked, but which technically falls short of failing.Taken all together this means: students the professors deem “unready” will not reach the defense stage. <<<Barriers like those listed above collectively ensure that professors do not hear a defense unless there is a high probability of success (97–99%+), and even the very day of the defense, there are possible “outs” that can stave off failure for another day! However, while rationally this may be helpful to some, emotionally knowing you could, with the swipe of a pen, *fail*, instills a strong and palpable instinct of fear. As well, if the professors know (probably) they will approve you, and if you suspect they might have, in their rushed schedules, skimmed rather than close-read as many as 300+ pages, they may opt to ‘give you a rough time’ with questioning. It may be a form of ‘good-natured’ hazing, but coming from formerly (hopefully) friendly faces, might create the notion that your work is unusually weak! So prepare yourself rationally—PhD candidates—but do not be surprised to be thrown off emotionally, during this strange rite of passage. Note: I would like to see hard, quantitative evidence of actual passage rates. For U.S. public universities (or private universities receiving public funds) there should be documentation subject to “freedom of information” disclosures, so a bear perhaps but not too difficult a research project (or dissertation!) awaits. ",
            "date": "Answered May 19, 2018",
            "views": "68",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Andrew Lewis-Smith",
                    "user_href": "/profile/Andrew-Lewis-Smith-1"
                },
                {
                    "user_id": "Waka Broady Ganamo",
                    "user_href": "/profile/Waka-Broady-Ganamo"
                }
            ]
        }
    ]
}