{
    "title": "What’s the most interesting article you have read or written and why? - Quora",
    "tags": [
        "Reading Articles",
        "News Articles",
        "Academic Papers",
        "Journalism",
        "Reading",
        "Writing",
        "Book Recommendations",
        "Books"
    ],
    "response": [
        {
            "author_info": {
                "name": "Skip Maloney",
                "href": "/profile/Skip-Maloney"
            },
            "answer_text": "It was a long time ago, but I was assigned to write an article for a local weekly newspaper in the Plymouth, MA area. The article was to be about the local high school’s tennis team, which until that time, had been known for its dismal record. In this particular year, they hired a new coach, a woman, who happened to have a couple of sons on the team. For a variety of different reasons, they improved tremendously in this first year with a new coach, and I set out to find out what had caused the sudden change. As a matter of research, I decided to play an official tennis match with one of the coach’s sons (the senior), just to get a feel for his play and the game itself. Up to that point in time, I had never played an actual game of tennis, let alone a full match, but I got out there. And predictably, as the first set progressed, got my ass kicked, six ways to Sunday. The match continued, and as it did, I started making points here and there. Not a lot and not with any degree of consistency, but I noticed something as the match continued. When I began, even in that short span of time to improve, not only in the basic skill set of hitting a tennis ball, but in the strategic preparation for a ball I knew would be coming back at me, my mind set about the match underwent something of an alteration. And the more I played, the better I was getting. It was nowhere near enough to beat this kid, who was considerably younger than me at the time (I’m guessing I was nearing 30, and he was 17), but I noticed as I continued to play that I was believing in my abilities a little more, which, in turn, made me more confident, each time I stepped to the baseline to either serve of prepare to receive one. As I wrote the article and delved into the details of the team’s history and the specifics of their new-found abilities, I made the observation that once they started winning, that alone brought a significant change. I told the story of my game with the senior player in italics and the rest of it in regular type, using my fortunes in my first-ever tennis match, describing my steady improvement and the way in which that improvement worked on my head, which prompted further improvement. In telling my own story (of the match), I highlighted the team’s improvement, which, they themselves tended to agree, emerged, in part, from a feeling that they’d developed that they could, for the first time in the team’s history, improve and actually win matches. And they did. ",
            "date": "Answered February 2, 2020",
            "views": "94",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "William Vietinghoff",
                "href": "/profile/William-Vietinghoff"
            },
            "answer_text": "I wrote an article for Air & Space magazine in 2013 explaining how the “Incredible Facts” about the Space Shuttle Main Engine were created. I was asked by the Communications Department of Rocketdyne in 1977 to come up with some facts, in simple terms, about the engine’s great power. I did. I wrote about sixteen “facts”. I thought they would appear in a few places, then disappear, but over the years I discovered they were being quoted continuously on television, in books, newspapers, magazines, and on the internet. Here is the link to the Air & Space article: https://www.airspacemag.com/space/space-shuttle-engines-just-the-stats-239729/ ",
            "date": "Answered February 2, 2020",
            "views": "42",
            "upvotes": " Answer requested by Rabi Khanal"
        }
    ]
}