{
    "title": "What is your review of Risk (game)? - Quora",
    "tags": [
        "Risk (game)",
        "Board Games",
        " Reviews"
    ],
    "response": [
        {
            "author_info": {
                "name": "Sandeep Goyal",
                "href": "/profile/Sandeep-Goyal"
            },
            "answer_text": "★★★★★ Right from the college, I love playing strategy based games e.g. Age Of Empires. I have a passion for board games. This game was my introduction to the world of strategic board games. And I must say, I loved it.  We got this game when some of my very good friends came to US on a business trip. One of friend suggested this game, as he was crazy about this game in his college. Classic Risk was what he had played and what he knew how to play. However we decided to play the newer version, just to give it a try.  The game is  really amazing. Every aspect of it requires planning. Your initial troops placement is very decisive. The way you make allies requires lot of thought as well. You need allies as you can't play against everyone. You have to plan your attack. Things become more fun when probabilities come into the play. Your one ninja warrior sometimes kill an entire army, and that is the most satisfying feeling.  In all, me and my friends loved this game. We had many night outs playing this game. We even bought the XBox game. Though I haven't played it recently, but will love to play again sometime. ",
            "date": "Answered March 6, 2013",
            "views": "32",
            "upvotes": " View 12 Upvoters",
            "upvoters": [
                {
                    "user_id": "Leah Gerlitz",
                    "user_href": "/profile/Leah-Gerlitz"
                },
                {
                    "user_id": "Vo Nghi Nguyen",
                    "user_href": "/profile/Vo-Nghi-Nguyen"
                },
                {
                    "user_id": "Alexander Godefroy",
                    "user_href": "/profile/Alexander-Godefroy"
                },
                {
                    "user_id": "Muhammad Areez",
                    "user_href": "/profile/Muhammad-Areez"
                },
                {
                    "user_id": "Ankit Khetrapal",
                    "user_href": "/profile/Ankit-Khetrapal-3"
                },
                {
                    "user_id": "Shreyes Seshasai",
                    "user_href": "/profile/Shreyes-Seshasai"
                },
                {
                    "user_id": "Brien Colwell",
                    "user_href": "/profile/Brien-Colwell"
                },
                {
                    "user_id": "Kah Keng Tay",
                    "user_href": "/profile/Kah-Keng-Tay"
                },
                {
                    "user_id": "Chelsea LaSalle",
                    "user_href": "/profile/Chelsea-LaSalle"
                },
                {
                    "user_id": "Don van der Drift",
                    "user_href": "/profile/Don-van-der-Drift"
                }
            ]
        },
        {
            "author_info": {
                "name": "Surya Van De Merwe",
                "href": "/profile/Surya-Van-De-Merwe"
            },
            "answer_text": "“What is your review of Risk (game)?” It’s not very good. The amount of luck is too important, it is not very well balanced (having Australia is a huge advantage) and it takes too long. 4/10 If you like this kind of game, try one of the following Nexus ops: build units and fight each other with dice in a mercifully short, action packed gameImperial: Risk with an economic aspect added and no luck factor",
            "date": "Answered November 21, 2019",
            "views": "123",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Hazel Booth",
                    "user_href": "/profile/Hazel-Booth-5"
                }
            ]
        }
    ]
}