{
    "title": "What are explanatory paragraphs? What are some examples? - Quora",
    "tags": [
        "Paragraphs",
        "English Grammar Writing Advice",
        "Writing Advice",
        "Grammar"
    ],
    "response": [
        {
            "author_info": {
                "name": "Ellison Walcott",
                "href": "/profile/Ellison-Walcott"
            },
            "answer_text": "An explanatory paragraph is a paragraph that explains an idea and informs the reader. For example if an essay is cause and effect or the comparison and contrasting of ideas. For cause and effect - that involves an action that causes something to occur and the result of that action. What events happen to create other events. Think about a character in a story and what propels that character to take the path s/he does. For comparison and contrast - this reveals similarities and differences in characters, places, things, events or ideas. The opening sentence of each of these types of paragraphs introduces the idea that will be explained. Below are illustrations of each of these concepts. Compare and contrast examples: What characteristics distinguish the hero-like tendencies between the TV characters Rosewood and Lucifer? They are both paired with strong women who are police and have romantic feelings. Simple thesis: Three characteristics that distinguish the hero-like tendencies for TV characters Rosewood and Lucifer are emotion, ego and philosophy of life. Cause and effect examples: What causes the character Martin Riggs in the TV show Lethal Weapon to often take dangerous risks? Martin Rigg’s life has made him a character who is both self-destructive, but also the good hearted hero, who will step into life threatening situations for those who need him and that he cares about. There are several events in his life that have caused his approach. Three of them are: his abusive childhood, his military service and training and the death of his wife. What are the effects on those around him of how he perceives life and moves through events as a police detective? ",
            "date": "Answered January 18, 2018",
            "views": "118",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Shweta Chauhan",
                    "user_href": "/profile/Shweta-Chauhan-236"
                },
                {
                    "user_id": "Krstina Krstina",
                    "user_href": "/profile/Krstina-Krstina"
                }
            ]
        },
        {
            "author_info": {
                "name": "Sokratis Kalyvopoulos",
                "href": "/profile/Sokratis-Kalyvopoulos-1"
            },
            "answer_text": "An explanatory paragraph informs the reader on a particular subject. It provides the reader with information regarding the topic of the written piece. Explanatory paragraphs are instructions to a product or are found in school textbooks. There are a few different types of explanatory paragraphs, the most common being paragraphs that inform, paragraphs that explain the cause and effect of something, or paragraphs that compare or contrast a topic.A writer should focus on presenting the reader with factual information while remaining objective. Most explanatory paragraphs are written in third person, but using first person is also acceptable, depending on the subject the written piece is about.  ",
            "date": "Answered September 21, 2016",
            "views": "188",
            "upvotes": " View 6 Upvoters",
            "upvoters": [
                {
                    "user_id": "Austin Wu",
                    "user_href": "/profile/Austin-Wu-36"
                },
                {
                    "user_id": "Rj Doromal",
                    "user_href": "/profile/Rj-Doromal"
                },
                {
                    "user_id": "Krstina Krstina",
                    "user_href": "/profile/Krstina-Krstina"
                },
                {
                    "user_id": "Adnan Saleem",
                    "user_href": "/profile/Adnan-Saleem-42"
                },
                {
                    "user_id": "Kristi Palko",
                    "user_href": "/profile/Kristi-Palko"
                },
                {
                    "user_id": "Kleandro Koka",
                    "user_href": "/profile/Kleandro-Koka"
                }
            ]
        }
    ]
}