{
    "title": "What are some unique ideas for a 10 year wedding anniversary gift for my husband? - Quora",
    "tags": [
        "Romantic Gift Giving",
        "Romantic Gifts",
        "Anniversaries",
        "Gift Giving",
        "Gifts",
        "Marriage Advice",
        "Marriage",
        "Relationship Advice"
    ],
    "response": [
        {
            "author_info": {
                "name": "Priyanka",
                "href": "/profile/Priyanka-1300"
            },
            "answer_text": "Congratulations…!!! You may already have some memories of all those years you have celebrated together. Write 10 letters, which may include stories, memories of each year with photos, some incidents, places you have visited, any funny moment that you remember, any activity that you have completed together/achievements, task from kids life, any awkward moment, any incident where you feel he love you so much or some romantic memory or when you wanted to hug him, etc. It will be great to write the things you like in him while travelling or when he helped you in one of the situation, . Those may be some little memories or efforts by him, but after reading it he may get happy. We always mention the things which hurt us in past, but we rarely mention which make us smile or love. For eg. 1. If any moment you were sick and he helped you to cook food and you wished if there could have been any kitchen utensil/machine which would have reduce his work, you can gift that now:) , else any recipe with step by step and qty mentioned as per the available material at your home hand written by you. 2. Any trip you enjoyed together, were not able to afford/forget any gadgets that would be a very helpful during that trip, gift it now(if you still don’t have it). Else, any place you always wanted to visit with him, but it didn’t happened buy/plan that tour. Those 10 years will never come back, the moment and the memories, the way you enjoyed it, what was your favorite etc. write all those, it will help to build up your relation more. Materialistic gifts may not be that lovable as compared to your hand written notes. You can attached a gift which may be related to that moment or memory with each letter. Select 10 different places at your home, where you can keep those 10 different letters and gifts. Edits are welcome :) ",
            "date": "Answered August 2, 2018",
            "views": "533",
            "upvotes": " View 2 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Anusha Chirra",
                    "user_href": "/profile/Anusha-Chirra-1"
                },
                {
                    "user_id": "Shaik Mubarak Basha",
                    "user_href": "/profile/Shaik-Mubarak-Basha-1"
                }
            ]
        }
    ]
}