{
    "title": "What is your take on premarital sex? - Quora",
    "tags": [
        "Premarital Sex",
        "Relationships and Sex",
        "Adult Dating and Relationships",
        "Sex"
    ],
    "response": [
        {
            "author_info": {
                "name": "Andrea Ferro",
                "href": "/profile/Andrea-Ferro"
            },
            "answer_text": "I'm not married and I'm not virgin. I guess that already sets the stage for “what's your take on premarital sex?” I do not plan to marry, but a few things I'm quite sure about: ifever I'll consider marrying, it will not be with a girl I am not very intimately connected with, and that includes sex. It's irrelevant if she was or wasn't virgin when we first did it, but if she has had no other experience beyond me (either before or after me), I'll be a little worried. Obviously if I love her (and I assume that's the case, since we are under the premise I'm considering marrying her) I'd eventually marry her even if I'm “the only one”, but I’d definitively prefer her to have had some experience with other men too. And, of course, that she is still sure she actually wants me :-p ",
            "date": "Answered August 3, 2016",
            "views": "805",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Michael Joe",
                    "user_href": "/profile/Michael-Joe-16"
                },
                {
                    "user_id": "Patil Arunkumar",
                    "user_href": "/profile/Patil-Arunkumar"
                }
            ]
        },
        {
            "author_info": {
                "name": "Louis Cohen",
                "href": "/profile/Louis-Cohen-1"
            },
            "answer_text": "It’s an absolutely critical part of becoming an adult. Sex is such an important part of any long term relationship that couples planning to marry had better make sure that they have compatible sexual desires. There is of course absolutely nothing wrong/immoral/sinful about safe consensual premarital sex. And BTW, one cause of unrest in the Middle East is lots of young men full of testosterone and a shortage of sexual partners. So instead of having happy sex, they adopt fanatic causes and take up guns and explosives. ",
            "date": "Answered August 1, 2016",
            "views": "585",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Faisal Aburemsh",
                    "user_href": "/profile/Faisal-Aburemsh-1"
                },
                {
                    "user_id": "Cheryl Lightfoot",
                    "user_href": "/profile/Cheryl-Lightfoot"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/ALT-7"
                }
            ]
        }
    ]
}