{
    "title": "What are some good 'adult' children's books? - Quora",
    "tags": [
        "Children's and Young Adult Books"
    ],
    "response": [
        {
            "author_info": {
                "name": "Esther Finzi",
                "href": "/profile/Esther-Finzi"
            },
            "answer_text": "I can recommend the books I have read that helped me to build parenting and teaching skills as a parent and as a teacher. \"Between Parent and Child\"- by Haim Ginott, which talks about how to converse with children for better communication. Easy read!\"P.E.T - Parenting Effectiveness Training\" by Thomas Gordon which teaches \"clean communication\" and problem solving techniques.”Children the Challenge” by Rudolf Dreikurs”How to Talk is Kids Will Listen?” by Adele Faber & Elaine MazlishYou may also read the work done by the psychologist, Andrew Shatté. He developed a theory about raising resilience children to become a thriving adult. Hope you find my recommendation helpful. Good luck! ",
            "date": "Answered February 25, 2020",
            "views": "178",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Maggie Christy",
                    "user_href": "/profile/Maggie-Christy-2"
                }
            ]
        },
        {
            "author_info": {
                "name": "Maggie Christy",
                "href": "/profile/Maggie-Christy-2"
            },
            "answer_text": "Children’s books which adults might enjoy: Prince of Butterflies by Bruce CovilleWhere the Sidewalk Ends by Shel Silversteinpretty much anything you, yourself enjoyed as a child or young teenBooks for adults about child rearing and education any of the Love and Logic booksThe Nurtured Heart Approach by Howard GlasserAdult books which children might enjoy Anything the child shows an interest in, that a loving adult is willing to read first and discuss with the child.",
            "date": "Answered March 1, 2020",
            "views": "24",
            "upvotes": " Answer requested by Miranda James"
        }
    ]
}