{
    "title": "What are some of the best fictional worlds? Why? - Quora",
    "tags": [
        "Fiction",
        "Science Fiction (genre)",
        "Creative Writing",
        "Novels",
        "Literature",
        "Book Recommendations",
        "Books"
    ],
    "response": [
        {
            "author_info": {
                "name": "Michael Soareverix",
                "href": "/profile/Michael-Soareverix"
            },
            "answer_text": "#1. The Cosmere (by Brandon Sanderson). What Brandon Sanderson has created deserves to be called a World. It is not a country, or a continent, or even a planet. It is a massive area spanning several solar systems, with incredibly diverse magic systems. There are actually several series that take place in the Cosmere: Mistborn, The Stormlight Archive, Elantris, Warbreaker and a few smaller worlds that haven’t been explored in depth. I want to be clear: I am not ranking these worlds in size, I’m ranking them in quality, and Sanderson has done an unbelievable job. If you like fantasy, you will absolutely love these books.  #2. The Name of the Wind/The Wise Man’s Fear (unnamed world) by Patrick Rothfuss. This world… it’s incredible. The detail put into this series, by one guy, is astounding. It feels like a place that actually exists, somewhere that hundreds of stories have taken place in. It has one of the best magic/mythology systems I’ve ever come across and it’s really only rivaled by Sanderson. If Patrick Rothfuss wrote more than a book every five years, I think he’d be more famous than Tolkien. His worldbuilding is that in-depth.  #3. Star Wars. Just… wow. There is so much more than what happens in the movies. This is a universe that spans hundreds of novels, most of them pretty good. I came across this revelation when I went to the Star Wars wiki and ended up spending days just reading through obscure planets with obscure wars and obscure characters. Probably the closest we’ve come to creating a real, fictional universe. The only downside is that there isn’t a guarantee of quality and there is a massive split in the community over diverging timelines: Legends vs Disney. Out of everything Star Wars related, I 100% recommend the Netflix show “The Clone Wars.” Do yourself a favor and watch it. It is the perfect example of how to give a world depth.  #4. Rick and Morty. This world is absolutely fascinating, and you’ll find yourself thinking about it a lot. In a multiverse where everything that could be possible is somewhere possible, there is a infinite potential. It’s nowhere near the consistency of other fantasy/sci-fi worlds but it’s built that way on purpose. Wacky, but the creativity sets up for something truly fascinating.  #5. RWBY by Monty Oum. This is one of the most cleverly designed world’s I’ve ever seen, and perfectly fitted for the series. In a world with infinite creeping evil lurking on the edges, it showcases the best/worst of humanity and sets up a fascinating dynamic. I am a fan.  Bonus: Gravity Falls. Comparatively, a tiny world, but well specialized to the show. The way it is slowly built up while remaining in the real world at large is one of the best examples I can give of selected worldbuilding. Too often, writers try to make their world bigger than everyone else’s; Gravity Falls is a reminder that it doesn’t need to be.   That was probably more effort than I should have put in, given my likelihood of making a popular post, but there are a lot of creative writers here on Quora who I think will find this helpful. Personally, I am also a writer, and if I’d had some of these examples earlier to roll around inmy mind, I might have been able to get started a bit sooner. ",
            "date": "Updated April 18, 2019",
            "views": "57",
            "upvotes": " View 53 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Lucy Yue",
                    "user_href": "/profile/Lucy-Yue-1"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/Ellarree-Enigma"
                },
                {
                    "user_id": "Michael Thibodeaux",
                    "user_href": "/profile/Michael-Thibodeaux-12"
                },
                {
                    "user_id": "Cole Smith",
                    "user_href": "/profile/Cole-Smith-82"
                },
                {
                    "user_id": "Johnathan Tronathan",
                    "user_href": "/profile/Johnathan-Tronathan"
                },
                {
                    "user_id": "Anarta Poashan",
                    "user_href": "/profile/Anarta-Poashan"
                },
                {
                    "user_id": "Jamie Stark",
                    "user_href": "/profile/Jamie-Stark-29"
                },
                {
                    "user_id": "Edward Conway",
                    "user_href": "/profile/Edward-Conway"
                },
                {
                    "user_id": "Gabriel Poteet",
                    "user_href": "/profile/Gabriel-Poteet"
                },
                {
                    "user_id": "Jezebel Cruz",
                    "user_href": "/profile/Jezebel-Cruz"
                }
            ]
        },
        {
            "author_info": {
                "name": "Joshua Millins",
                "href": "/profile/Joshua-Millins"
            },
            "answer_text": "Completely opinionated and subjected to my peculiar logic. The Wheel of Time. By Robert Jordan may his memory be eternal. Influenced extensively by Tolkien. His world is possibly one of if not best fleshed out fantasy world I've yet still read to this day. The staggering level of detail showcased his immense love of building and crafting just for the sake of it. Valdemar Saga. By Quora's own Mercedes R. Lackey. Another composer that laid such detail into the fabric of her creation if it gets a portal I'm immigrating! The mercenary guild is hiring still right? Though I'll skip hanging out with the companions. I’d look horrid in white! The Green rider series. By Kirsten Britain. This is a peculiar one with some interesting elements. It piqued my interest because it's so mundane with hints and tidbits beyond the borders shown. But so little extra given as it's rather new and very slow. Similar timeline to got on the writer speed. Warhammer 40,000. Gamesworkshop. Now, this is just over the top derp factor. But it had consistency and at least attempted some balance. Until the Wardian Heresy happened…. No more shall be spoken. But mostly just for the Derp is why I like it. For me, it’s always been about the details. How the world works, how well are the various cultures integrated, if magic is present did its laws be consistently upheld. Was the usage by characters at least plausible or did it go from Zero to Heroin 1 hours time? It's the primary reason I dislike G.R.R Martin. He has no real consistency in his series beyond wow factor and making the most horrid of a situation. 700 feet high that's not insubstantial at one hundred and some less than the battleship U.S.S Iowa. That's the height of his mythic wall. Which is also over 300 miles long. Next to no cities except in a few inconvenient places which outside of modernity couldn't happen without impressive engineering ...maybe magic? Armies and ships without logistics that maintain themselves and let's not touch anything else or ill rant longer than a goat. I do not find a liking to most urban fantasies for a similar reason. The interweaving has always been jagged and in some ways, it makes a contradiction of what's written or what should be perceived. Well, that's my list. If you have anything I may like put a link to it in the comments. Oh I apologize to Michael Soareverix who asked this several months ago. Quora is being difficult again. ",
            "date": "Answered March 27, 2019",
            "views": "446",
            "upvotes": " View 4 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Daniel Gregory",
                    "user_href": "/profile/Daniel-Gregory-41"
                },
                {
                    "user_id": "John Jr Kitchings",
                    "user_href": "/profile/John-Jr-Kitchings"
                },
                {
                    "user_id": "Cody Colburn",
                    "user_href": "/profile/Cody-Colburn"
                },
                {
                    "user_id": "Isaac Utovac",
                    "user_href": "/profile/Isaac-Utovac"
                }
            ]
        }
    ]
}