{
    "title": "What is your favorite book and favorite author? - Quora",
    "tags": [
        "Favorites",
        "Writers and Authors"
    ],
    "response": [
        {
            "author_info": {
                "name": "Christopher Dumas",
                "href": "/profile/Christopher-Dumas"
            },
            "answer_text": "Book God Emporor of Dune (Dune Chronicles #4) By Frank Herbert Goodreads: God Emperor of Dune (Dune Chronicles, #4) Amazon: God Emperor of Dune (Dune Chronicles, Book 4): Frank Herbert: 9780441294671: Amazon.com: Books Metadata: It's the middle book between the first triology of the Dune Saga and the unfinished (by the original author, that is) second. I have a review of this book on Goodreads, but I'll paste it here for convenience. I've edited the Goodreads review to be more up to date with my thoughts for the occasion. Review This was a very interesting book indeed. The writing is classic Herbert, with stilted yet fun to read dialogue and sometimes weird turns of phrase. It recovers a lot of the mystery of the first book, especially in world building as Leto's new empire unfolds. Although some might dock it for being largely static and preach-y for the first half, that didn't bother me at all. In fact, Leto II was so interesting that I honestly could have read an entire book of him talking. The Stolen Journals are on my TBR list now... However, there were some Not Great aspects to this book. Firstly, after the midpoint we switch largely to other characters and they all act like hormonal teenagers (that's actually an insult to teenagers). Worse, no one seems to understand how long term plans work; except maybe Siona who has a random character change in the last parts of the book and decides to carry on the God Emperor's plan. Secondly, sometimes it really felt like Herbert went too far in making Leto overly circuitous in his speech. Thirdly, I think the mystery of the Golden Path and the enemies of humanity is really interesting and should have been played up more. [This is more just a criticism of all the Dune books including and following Children of Dune.] I really love this book, though, in spite of it's flaws. Leto II is probably the most interesting, conflicted, and alien character I've ever read about, and it really lends new depth to the story and meaning to the Golden Path. The exploration of what being a mental colony organism would be like, combined with presence, is truly amazing; what's more, Leto's understanding of politics and religion are fascinating and play out very well in the world of the book. Seeing an entirely new yet strangely familiar culture and planet is massively rewarding. Parts of this book have stayed with me much more than Dune or Dune Messiah did. What's more, even though I disagree with the other characters in the book and what they ultimately decided to do, it does make sense. I've seen and known and talked to people with similar overarching beliefs in the real world. Perhaps if Herbert had been less focused on the romantic plot he could have developed their philosophies more and it would've felt more satisfying. Overall, the first half of the book was an intriguing and captivating quasi-religious exploration of a society built for long term planning. The second half was a somewhat unsatisfying conclusion and devolved into the operatic once too many times. Edit: On further thought, Leto's almost Platonistic dialogues in the first half of the book, and the way they explore his political philosophy (as well as his more general philosophy) with such poetic sensibilities and often subtlety, really propel this book into whole new levels of profundity. And it's not simply Leto's preaching, either: the narrative itself both confirms and denies various parts of Leto's thought in a very satisfying interplay. Moreover Herbert's success in making an omniscient tyrant a sympathetic, even tragically heroic, character--while still keeping some moral ambiguity--is quite simply a literary tour de force. Also, upon reflection my initial reaction to the actions of the characters might not be justified--I still feel that it is, but I might be biased by the fact that I was siding with Leto so much without even really noticing that I was. All this considered, God Emperor actually finds its way to the top of my sci-fi list: IT IS MY FAVORITE SCIENCE FICTION BOOK EVER. I don’t say that lightly either: I actually haven't had a \"favorite\" sci-fi book before because I was suspending judgement until I found something \"worth\" the title; a book so good I probably wouldn’t have to change my favorite pick again. But this book satisfies that. One of the interesting things, too, is how GEoD really ties up and shows the final result and most extreme consideration of the themes of the previous books: predestination, prescience, charismatic leadership, religion. Conclusion I’m a naturally pretentious person and somewhat of a showoff, so if I wasn’t particularly interested in being truthful, I could say my favorite book is David Copperfield, The Count of Monte Cristo, Les Miserables, The Iliad, The Aenead, Crime And Punishment, The Brothers Karamazov, Don Quixote, The Tale of Two Cities, or any of the other objectively great works of literature that I’ve read—but although I can see their merits might outweigh GEoD (although perhaps not by a very great margin for some of these) I cannot claim that I like them better. Or that they stuck with me more. Burn me at the stake if you want but I stand by this pick. Author As far as ability, consistent output, and enjoyment, I'd have to say Herbert. But Dostoyevsky is a close second. Don't even mention Tolstoy to me in the comments. I'll beat you to death with a feather. ",
            "date": "Updated January 10, 2020",
            "views": "655",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Franklin Veaux",
                "href": "/profile/Franklin-Veaux"
            },
            "answer_text": "My favorite author is Terry “Pterry” Pratchett, followed closely by Iain M. Banks and Richard Morgan, with Glen Cook and Vernor Vinge taking honorable mentions. My favorite book is…a tossup. Until about two weeks ago, I would have said Use of Weapons by Iain M. Banks, but now, I’m not so sure. It’s either Use of Weapons or Woken Furies by Richard Morgan. ",
            "date": "Answered November 6, 2019",
            "views": "26",
            "upvotes": " View 95 Upvoters",
            "upvoters": [
                {
                    "user_id": "James Griffith",
                    "user_href": "/profile/James-Griffith-58"
                },
                {
                    "user_id": "Dylan Chester",
                    "user_href": "/profile/Dylan-Chester"
                },
                {
                    "user_id": "Brian N Tran",
                    "user_href": "/profile/Brian-N-Tran"
                },
                {
                    "user_id": "Cyrus Pacht",
                    "user_href": "/profile/Cyrus-Pacht"
                },
                {
                    "user_id": "Thomas Weaver",
                    "user_href": "/profile/Thomas-Weaver-10"
                },
                {
                    "user_id": "Callum Sutherland",
                    "user_href": "/profile/Callum-Sutherland-3"
                },
                {
                    "user_id": "Jonathan Trueman",
                    "user_href": "/profile/Jonathan-Trueman"
                },
                {
                    "user_id": "Nithish Kumar S",
                    "user_href": "/profile/Nithish-Kumar-S-9"
                },
                {
                    "user_id": "Kaiya Mudge",
                    "user_href": "/profile/Kaiya-Mudge-2"
                },
                {
                    "user_id": "Jason Cobb",
                    "user_href": "/profile/Jason-Cobb-12"
                }
            ]
        },
        {
            "author_info": {
                "name": "Mercedes R. Lackey",
                "href": "/profile/Mercedes-R-Lackey"
            },
            "answer_text": "My favorite author is Charles de Lint. But my favorite book is Gaudy Night by Dorothly L. Sayers. ",
            "date": "Answered November 6, 2019",
            "views": "511",
            "upvotes": " View 26 Upvoters",
            "upvoters": [
                {
                    "user_id": "Greg Edwards",
                    "user_href": "/profile/Greg-Edwards-78"
                },
                {
                    "user_id": "Gia Daniel",
                    "user_href": "/profile/Gia-Daniel"
                },
                {
                    "user_id": "Jai Carter",
                    "user_href": "/profile/Jai-Carter-11"
                },
                {
                    "user_id": "Lord Anthony",
                    "user_href": "/profile/Lord-Anthony-6"
                },
                {
                    "user_id": "Vix Clarke",
                    "user_href": "/profile/Vix-Clarke"
                },
                {
                    "user_id": "Alexander Draganov",
                    "user_href": "/profile/Alexander-Draganov"
                },
                {
                    "user_id": "Nathan Beard",
                    "user_href": "/profile/Nathan-Beard-6"
                },
                {
                    "user_id": "Clay Elam",
                    "user_href": "/profile/Clay-Elam"
                },
                {
                    "user_id": "Mary Nelson",
                    "user_href": "/profile/Mary-Nelson-4"
                },
                {
                    "user_id": "Hal Dellinger",
                    "user_href": "/profile/Hal-Dellinger-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Serena Powell",
                "href": "/profile/Serena-Powell-1"
            },
            "answer_text": "THE BOOK OF NIGHT WOMEN by Marlon James. It explores in depth the everyday lives of black slaves, and genetics and mixed race and intra slavery hatred. The predatory behavior of the slave males toward the slave women, sanctioned and encouraged by the master’s manager, is exposed. The slave women meet at night and the reason is fascinating. These women carry real scars such as a missing breast and plow rows in the skin along the back and belly and get up every day to work. The action remains mostly with house workers rather than the field ones. Those slaves come across as walking dead to me. The punishments are barbaric given by men who are savage. But one or two of those woman will rescue and hide a child from terror and earn an uneasy trust from the master overseers. Temporarily. Nothing remains the same from day to day. And the white men need comfort and safety from each other and their own women. It is a world upside down, scary and the horror is told in a hard honest way and without pathos. At my suggestion my book club will discuss in a few days and I am wide eyed with awe and respect and humility. ",
            "date": "Updated December 30, 2019",
            "views": "577",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Betül Keribet",
                    "user_href": "/profile/Betül-Keribet"
                },
                {
                    "user_id": "Brittany Elise",
                    "user_href": "/profile/Brittany-Elise-21"
                },
                {
                    "user_id": "Abhinay",
                    "user_href": "/profile/Abhinay-38"
                }
            ]
        },
        {
            "author_info": {
                "name": "Balthazar Sforza-Krasinski",
                "href": "/profile/Balthazar-Sforza-Krasinski"
            },
            "answer_text": "Guns Germs and Steel by Jared Diamond. The Historian by Elizabeth Kostova. Angelology by Danielle Trussoni. Old Path White Clouds by Thich Nhat Hanh. The Heart of The Buddha’s Teaching by Thich Nhat Hanh. His Dark Materials (trilogy) by Philip Pullman. The Pillars of the Earth, World Without End & A Column of Fire by Ken Follet. The Vampire Chronicles & The Lives of the Mayfair Witches by Anne Rice. The Empress by Meg Clothier. The King by Kader Abdolah. Unveiled by Cherry Mosteshar. Persepolis by Marjane Satrapi. ",
            "date": "Answered May 5, 2018",
            "views": "500",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Ikra Dahir",
                    "user_href": "/profile/Ikra-Dahir"
                },
                {
                    "user_id": "Karen Naikar",
                    "user_href": "/profile/Karen-Naikar"
                },
                {
                    "user_id": "Magnus De Braganza-Lucyanowski",
                    "user_href": "/profile/Magnus-De-Braganza-Lucyanowski"
                },
                {
                    "user_id": "Carly Jolan",
                    "user_href": "/profile/Carly-Jolan"
                }
            ]
        },
        {
            "author_info": {
                "name": "Giovanni Hojeije",
                "href": "/profile/Giovanni-Hojeije"
            },
            "answer_text": "My taste and preferences are in constant metamorphosis, though somethings never change. I can't say that those will be my favorites forever but at least for now: Books: The Book Thief: As pointed out, it shows life in death’s perspective, it shows youth innocence and its all very touching and with beloved characters, it portrays an History lesson as well;The Alchemist: Brazilian writer Paulo Coelho takes us to an amazing journey to learn how to appreciate the beauty of whats around us and more;Harry Potter: Many underestimate it, for me - one who have grown up reading/watching it - it was a true life lesson since it portrays true friendship, it shows you its ok to get help and that we have to face our fears;Author: Yanko Tsvetkov: Yanko Tsvetkov did - and I hope he is still doing - an amazing job with Atlas of Prejudice, my favorite atlas ever. For me he is super well travelled, intellectual and I have learned so much from him. His atlas is full of history, politics, humor, demographics and it might be very hard to understand. Also an amazing designer;J.K. Rowling: The woman who created the world of my dreams.;Leo Tolstoi: I might not know enough of him but Anna Karenina was enough to fall in love which such deep romance;Kiera Kass, Matthew Quick and Veronica Roth also gave me much to read!See more about Atlas of Prejudice and Yanko Tsvetkov: Atlas of Prejudice http://alphadesigner.com/about/ ",
            "date": "Updated June 12, 2018",
            "views": "4",
            "upvotes": " View 7 Upvoters",
            "upvoters": [
                {
                    "user_id": "Frank Dauenhauer",
                    "user_href": "/profile/Frank-Dauenhauer"
                },
                {
                    "user_id": "Prerna Pant",
                    "user_href": "/profile/Prerna-Pant"
                },
                {
                    "user_id": "Rupinder Sandhu",
                    "user_href": "/profile/Rupinder-Sandhu-19"
                },
                {
                    "user_id": "Ayesha",
                    "user_href": "/profile/Ayesha-450"
                },
                {
                    "user_id": "Swetha",
                    "user_href": "/profile/Swetha-168"
                },
                {
                    "user_id": "Ahmad Kadan",
                    "user_href": "/profile/Ahmad-Kadan"
                },
                {
                    "user_id": "Harper Pizel",
                    "user_href": "/profile/Harper-Pizel"
                }
            ]
        },
        {
            "author_info": {
                "name": "Robyn Campbell",
                "href": "/profile/Robyn-Campbell-6"
            },
            "answer_text": "Besides myself? :-) Favorite book is Black Beauty and favorite author is Anna Sewell. Anna Sewell wrote a book for vets. It became one of the most popular children’s novels ever. She had no idea she had written a novel. She was paid $20.00. She died five months after it was published. The book led to greater treatment of horses. With more than 50 million copies sold in 50 languages, Black Beauty is one of the most popular books in HISTORY. Here are some other books in the 50 million range include Charlotte’s Web, The Catcher in the Rye, Anne of Green Gables, The Da Vinci Code and all of the Harry Potters. ",
            "date": "Answered May 26, 2018",
            "views": "382",
            "upvotes": " Answer requested by Brendan Cadogan",
            "upvoters": [
                {
                    "user_id": "Sheri Fresonke Harper",
                    "user_href": "/profile/Sheri-Fresonke-Harper"
                }
            ]
        },
        {
            "author_info": {
                "name": "Scott Smith",
                "href": "/profile/Scott-Smith-275"
            },
            "answer_text": "Robert Anson Heinlein. But fave book? That isn’t possible because what I’m reading is the book I love right then and there.. I bet there are others like me. There is an author they love more than others, but asking them to pick a favorite book is like asking which organs they’ll donate first. The fun thing about reading is that you can love a certain author, but… there are tons of other books out there that grab you and won’t let go. ",
            "date": "Answered December 23, 2017",
            "views": "146",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Linda A Robinson",
                "href": "/profile/Linda-A-Robinson-1"
            },
            "answer_text": "Unfortunately I do not have just one author or favorite book. I have a couple of favorites within a genre, or within a particular author’s body of work. For spiritual authors, I like Karen Armstrong and Thomas Merton. For science fiction authors (note, I don’t read too much of it): Ursula LeGuinn For stories about ordinary people: the late and great Chicago journalist, Studs Terkel FYI: I read mostly non-fiction and a lot of articles in peer-reviewed journals. Right now I am reading two, history books written by Nash. I generally like reading biographies. Thanks for the A2A. ",
            "date": "Answered January 9, 2018",
            "views": "308",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Mingyun Seo-Bang",
                    "user_href": "/profile/Mingyun-Seo-Bang"
                },
                {
                    "user_id": "Stacey Frady",
                    "user_href": "/profile/Stacey-Frady"
                }
            ]
        },
        {
            "author_info": {
                "name": "Krenda Seiler",
                "href": "/profile/Krenda-Seiler"
            },
            "answer_text": "I have two Favorites. First is ‘Ignited, by Corrine Jackson.’ Second is ‘P.S. I like you you, by Kasie West.’ Kasie West help me get by with middle school. I loved reading her books. Then with High school I love reading Corrine Jackson’s book series. Btw if your into zombies, I suggest reading Zombie Waltz by Lynn Main. Its a very good story with love and action. Just an suggestion. ",
            "date": "Answered February 18, 2019",
            "views": "123",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Nikki Heat",
                "href": "/profile/Nikki-Heat-5"
            },
            "answer_text": "The Catcher in the Rye by J.D. Salinger One of my favorite books! The hero-narrator of The Catcher in the Rye is an ancient child of 16, a native New Yorker named Holden Caulfield. Through circumstances that tend to preclude adult, secondhand description, he leaves his prep school in Pennsylvania and goes underground in New York City for three days. The boy himself is at once too simple and too complex for us to make any final comment about him or his story. Perhaps the safest thing we can say about Holden is that he was born in the world not just strongly attracted to beauty but, almost, hopelessly impaled on it. There are many voices in this novel: children’s voices, adult voices, underground voices — but Holden’s voice is the most eloquent of all. Transcending his own vernacular, yet remaining marvelously faithful to it, he issues a perfectly articulated cry of mixed pain and pleasure. However, like most lovers and clowns and poets of the higher orders, he keeps most of the pain to, and for, himself. The pleasure he gives away, or sets aside, with all his heart. It is there for the reader who can handle it to keep. ",
            "date": "Answered November 30, 2018",
            "views": "339",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Teleri Ferch Nyfain",
                "href": "/profile/Teleri-Ferch-Nyfain"
            },
            "answer_text": "Ursula LeGuin - Left Hand of Darkness Jane Austen - Pride and Prejudice Terry Pratchett - just about any of his Disc World novels China Mieville - City and the City ",
            "date": "Answered May 14, 2019",
            "views": "220",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Stacey Frady",
                    "user_href": "/profile/Stacey-Frady"
                }
            ]
        },
        {
            "author_info": {
                "name": "Hannah Karlsson",
                "href": "/profile/Hannah-Karlsson-4"
            },
            "answer_text": "Rick Riordan. I don’t have a favorite book or series, every single one (of the ones I’ve read) is amazing! ",
            "date": "Answered May 14, 2019",
            "views": "58",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Rnesme Brown",
                    "user_href": "/profile/Rnesme-Brown"
                }
            ]
        },
        {
            "author_info": {
                "name": "Betül Keribet",
                "href": "/profile/Betül-Keribet"
            },
            "answer_text": "Favorite book : IT, or The Picture of Dorian Gray. Favorite author: Stephen King, and Maxime Chattam. ",
            "date": "Answered May 17, 2020",
            "views": "91",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Rowan Elisabeth Creech",
                    "user_href": "/profile/Rowan-Elisabeth-Creech"
                }
            ]
        },
        {
            "author_info": {
                "name": "Marguerite Ellis",
                "href": "/profile/Marguerite-Ellis"
            },
            "answer_text": "The House of the Spirits  by Isabel Allende: Magda Bogin In one of the most important and beloved Latin American works of the twentieth century, Isabel Allende weaves a luminous tapestry of three generations of the Trueba family, revealing both triumphs and tragedies. Here is patriarch Esteban, whose wild desires and political machinations are tempered only by his love for his ethereal wife, Clara, a woman touched by an otherworldly hand. Their daughter, Blanca, whose forbidden love for a man Esteban has deemed unworthy infuriates her father, yet will produce his greatest joy: his granddaughter Alba, a beautiful, ambitious girl who will lead the family and their country into a revolutionary future. The House of the Spirits is an enthralling saga that spans decades and lives, twining the personal and the political into an epic novel of love, magic, and fate. ",
            "date": "Answered May 1, 2016",
            "views": "492",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Suhani Shandilya",
                "href": "/profile/Suhani-Shandilya"
            },
            "answer_text": "My Favourite novel Is The Diary OF A Young Girlby Anne Frank 2nd The Alchemist by Paulo Ceolho 😍😍😍😍😍😍 Bye! ",
            "date": "Answered December 26, 2019",
            "views": "82",
            "upvotes": " View 1 Upvoter"
        },
        {
            "author_info": {
                "name": "Lucas McMahon",
                "href": "/profile/Lucas-McMahon-1"
            },
            "answer_text": " My favorite book is one that I read recently by the Swedish writer Frederik Backman. The title of the story is Bear Town, which is the name of the town where the story takes place.  BearTown is a small secluded community in rural Sweden, with an entire economy and lifestyle that surrounds the amateur hockey organization.  Although it was written in Swedish, it was translated beautifully into English and earned a spot on the NYTimes bestsellers list. It has all of the aspects of the kinds of stories I really enjoy, sports, mystery, and coming of age, combined beautifully into an incredibly fast paced and enjoyable story. Seriously, I couldn't put the book down. ",
            "date": "Answered May 26, 2018",
            "views": "458",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Dhwani Swadia",
                "href": "/profile/Dhwani-Swadia"
            },
            "answer_text": "By \"OTHER\" I am assuming you mean Indian authors who are not that well known. So here are some books that come to mind: The Sleepwalker's Guide to Dancing by Mira JacobVoices of the Silent Creek by Vikkas Arun PareekBucket List of a Traveloholic by Sarika PanditFraudster by RV Raman",
            "date": "Answered April 18, 2016",
            "views": "279",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Mark Fudemberg",
                "href": "/profile/Mark-Fudemberg"
            },
            "answer_text": "Book is Toni Morrison's Song of Solomon Author is Philip Roth ",
            "date": "Answered November 30, 2017",
            "views": "72",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "L. Stewart Hearl",
                "href": "/profile/L-Stewart-Hearl-1"
            },
            "answer_text": "Good Omens by Sir Terry Pratchett and Neil Gaiman. ",
            "date": "Answered July 14, 2018",
            "views": "92",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Karen M Temple",
                "href": "/profile/Karen-M-Temple"
            },
            "answer_text": "Dont have one. I never was an avid reader. ",
            "date": "Answered December 8, 2017",
            "views": "84",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Shane Evans",
                "href": "/profile/Shane-Evans-37"
            },
            "answer_text": "The Thief of Always by Clive Barker. ",
            "date": "Answered May 28, 2018",
            "views": "122",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Keith Kiekebusch",
                "href": "/profile/Keith-Kiekebusch"
            },
            "answer_text": "The Wall by John Hersey  ",
            "date": "Answered May 23, 2018",
            "views": "109",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Palok Das",
                "href": "/profile/Palok-Das-2"
            },
            "answer_text": "dan brown.. the vincy code and inferno ",
            "date": "Answered May 5, 2018",
            "views": "98",
            "upvotes": "0"
        }
    ]
}