{
    "title": "What's your biggest relationship turn-off? - Quora",
    "tags": [
        "Turn-Offs",
        "Relationships",
        "Romance (love)",
        "Self-Improvement",
        "Social Advice",
        "Love",
        "Relationship Advice",
        "Dating Advice"
    ],
    "response": [
        {
            "author_info": {
                "name": "Mike Tatreau",
                "href": "/profile/Mike-Tatreau"
            },
            "answer_text": "It really comes down to one thing for me—not feeling a connection with my partner. I’ve been happily married for the past 21 years, but I remember dating other women before I met my wife. The girls I had been with were pretty and they were nice, but there was just something off between me and them. The things they talked about seemed petty and foolish to me, and they exhibited attitudes and behaviors that I didn’t approve of. And when I shared my thoughts and feelings with them, I felt like I was wasting my breath. They weren’t interested in learning who I really was, and they didn’t seem to care about things like that. It’s funny how our minds work. There seems to be a lot of people who are like me. We don’t really know what we’re doing when we’re dating. We are all just floundering—responding to attraction, and hoping for the best. We tend to hold on to the person that we are seeing. We’re not sure of how we really feel about them, or how they feel about us—and at the same time, we don’t want to hurt them. But even in the midst of all that uncertainty, our instincts are screaming at us. If only we would listen to them. In my case, I instinctively knew that I didn’t want to introduce any of the girls I had been dating to my family. I felt an unease whenever I considered the idea, and even embarassment—like I was ashamed to be with them. This should have been my cue to end those relationships, but I wasn’t listening. I continued on until things ultimately fell apart. But things were completely different when I met the girl who became my wife. I felt a strong connection with her right from the start, and she felt the same with me. I felt sure about her, and I was proud to have her by my side. I felt no reservations when I introduced her to my family, and they all loved her. One of the great things about having a deep and strong bond with the person you are in a relationship with is; that it causes you to overlook the little things that you would normally think are turn offs. ",
            "date": "Answered March 17, 2017",
            "views": "61",
            "upvotes": " View 34 Upvoters",
            "upvoters": [
                {
                    "user_id": "Kaye S. Jones",
                    "user_href": "/profile/Kaye-S-Jones"
                },
                {
                    "user_id": "Aleksa Keserin",
                    "user_href": "/profile/Aleksa-Keserin"
                },
                {
                    "user_id": "Sydney Hawi",
                    "user_href": "/profile/Sydney-Hawi"
                },
                {
                    "user_id": "Leez Dee",
                    "user_href": "/profile/Leez-Dee"
                },
                {
                    "user_id": "Tim Ruhlen",
                    "user_href": "/profile/Tim-Ruhlen"
                },
                {
                    "user_id": "Bridget Kline",
                    "user_href": "/profile/Bridget-Kline-5"
                },
                {
                    "user_id": "Saani Rose",
                    "user_href": "/profile/Saani-Rose"
                },
                {
                    "user_id": "Averma",
                    "user_href": "/profile/Averma-5"
                },
                {
                    "user_id": "Hayden Marzon",
                    "user_href": "/profile/Hayden-Marzon"
                },
                {
                    "user_id": "Ritu Chaudhary",
                    "user_href": "/profile/Ritu-Chaudhary-45"
                }
            ]
        },
        {
            "author_info": {
                "name": "Anitha Kalaiselvi",
                "href": "/profile/Anitha-Kalaiselvi"
            },
            "answer_text": "Here it comes… My biggest relationship turn off in any relationship… It is… When people point out or try to remind me that I am a woman or girl or female and define me/my character/personality Honey, I understand you want to go far and high in your career but you have to understand our culture. I might allow?! my future wife to work for a while but after that I would want her to quit her job, take care of our baby, my parents, me and our home. After all you are a woman and you know it makes us guys happ….blah blah blah (Hello??? My eardrums signals service not available on brain screen)Are you watching marvel movies? I never knew girls watch stuffs like that. Me: I love these series. Them: Oh stop it! you are giving company to your cousin? I know you would be bored, after all you are a girl (Seriously???)The way you dress up is quite modern but do you think your husband or his family would allow?! you to wear stuffs like these when you are married? Me: Why would they be bothered of my clothes? Them: Because you are woman and they would have expectations… (Urgh!!!)What are you doing? Me: Fixing my system as I tried to format my ‘c drive.’ Them: That’s a dumb thing you did. Me: Yup, realized that already and hence am fixing it now. Them: That’s why you should not do stuffs that your brain cannot do. Women, you are all so dumb….. (Stop it! Mr Born Genius. Could you not see my raised eyebrows? And guess what I have actually done fixing my system and it works properly once again)What are you doing? Me: Reading book. Them: You do stuffs like that? What are you reading? Romance? 50 shades of grey? You guys love only stuffs like that don’t you? (Do you even know anything about reading books?)How long will it take for you to get ready? Me: Give me 20 minutes. Them: Oh stop lying, you guys always say that but would take 5 hours anyway. After all you are a girl… (Guess what? Am not going out with you)Girl, do you not know how to blush? Maybe you should learn to act like a woman… (Error 404)Why do you come out so strong. We guys would like it if you are a bit more feminine and sweet and….. (I have no idea, what in the world made you think I would be attracted to you)This could go on and on but I will stop my rant here. On summary, Sexism and Gender bias is a immediate turn off for me in any relationship and whether it be against male, female or any gender neutral people. I have been living in my body as a woman, feeling as a woman, and breathing as a woman/girl since I was born. My evolution has been in line with, Child, juvenile, girl, woman and aiming to become a nice, cool lady in my next decade of adult life. I do not have to act like a women for you to make sure I am one (And I have no idea how to act like one as I am ALREADY ONE). Moral: Like people for who they are, love people for who they are, be friend with people for who they are. Nobody has to please or impress you to be with you and stop defining people based on gender. (P.S. Bonus bad cheesy turn off line,Him: What’s a craziest thing you wanna do in your life?Me: I don’t know. Maybe (saying something stupid)?!Him: Do you want to know the craziest thing I want to do? It’s that I want to eat the food you prepare, everyday!Me: Blink! Blink! Blank stare! Uhm…unintelligible mutter (Mind voice: Joey and Anitha do not share food) ",
            "date": "Updated January 1, 2020",
            "views": "51",
            "upvotes": " View 10 Upvoters",
            "upvoters": [
                {
                    "user_id": "Saani Rose",
                    "user_href": "/profile/Saani-Rose"
                },
                {
                    "user_id": "Kris",
                    "user_href": "/profile/Kris-987"
                },
                {
                    "user_id": "Anurag Gogoi",
                    "user_href": "/profile/Anurag-Gogoi-12"
                },
                {
                    "user_id": "Karthik Raj Raviraj",
                    "user_href": "/profile/Karthik-Raj-Raviraj"
                },
                {
                    "user_id": "Prateek Lata (प्रतीक लाटा)",
                    "user_href": "/profile/Prateek-Lata-प्रतीक-लाटा"
                },
                {
                    "user_id": "Arun",
                    "user_href": "/profile/Arun-2112"
                },
                {
                    "user_id": "Alok",
                    "user_href": "/profile/Alok-156"
                },
                {
                    "user_id": "Devyani Singh Chandel",
                    "user_href": "/profile/Devyani-Singh-Chandel"
                },
                {
                    "user_id": "Palak Gandhi",
                    "user_href": "/profile/Palak-Gandhi-3"
                },
                {
                    "user_id": "N. B. Tyagi",
                    "user_href": "/profile/N-B-Tyagi"
                }
            ]
        }
    ]
}