{
    "title": "What are examples of writing in third person? - Quora",
    "tags": [
        "English Writing",
        "Creative Writing",
        "Writing"
    ],
    "response": [
        {
            "author_info": {
                "name": "Rebekah Artman",
                "href": "/profile/Rebekah-Artman"
            },
            "answer_text": "There are a couple different types of 3rd person, but the simplest answer to your question is it’s third person if you’re using he, she, they, them, him, her, etc. Quincy lugged his suitcase to the car, swung it into the trunk, and slammed the lid down. That’s the simplest example I can come up with. As I said, though, there are different kinds: 3rd person limited and 3rd person objective. Third person limited bears much resemblance to first person, the difference being that you’re using he, she, they, and so on instead of I and we. What the character sees, hears, tastes, touches, does, experiences, feels, etc. is all you can write. Third person objective is using he, she, they, etc. without getting into the person’s head—none of what they’re thinking or feeling. Third person limited: Quincy lugged his suitcase to the car, swung it into the trunk, and slammed the lid. The car idled in the driveway. Why did he have to go on this miserable trip? It was bad enough his boss, Ricky, was sending him away for three days, but he’d miss Logan’s play too. He raised his gaze to the porch, and his shoulders slumped. Janie stood against the banister, eleven year old Logan by her side. The boy’s chin quivered, but he squared his shoulders and stood straighter. Quincy could only imagine what he must be thinking. Notice that Quincy doesn’t know for sure what his wife or son are thinking, though he may have an idea. Third person objective: Quincy lugged his suitcase to the car, swung it into the trunk, and slammed the lid. The car idled in the driveway. He raised his gaze to the porch, and his shoulders slumped. Janie stood at the banister, eleven year old Logan by her side. The boy’s chin quivered, but he squared his shoulders and stood straighter. The second is a rough example, but hopefully it gets the point across. There’s not as much information in the second example, but that information could be conveyed effectively through dialogue. The point is that in the second example, the reader has no idea what any of the characters are thinking or feeling, unless it’s stated by the external speech or by actions. Hope that helps! ",
            "date": "Answered April 17, 2018",
            "views": "44",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Rahul Raghuraman",
                    "user_href": "/profile/Rahul-Raghuraman"
                }
            ]
        },
        {
            "author_info": {
                "name": "Edward Conway",
                "href": "/profile/Edward-Conway"
            },
            "answer_text": "1st person: I wrote this answer. I know what I am thinking, and my views on this, and 1st person allows me to communicate these as if I were telling the story with a limited internal point of view. The benefit is that 1st person can make the narrator seem closer or more connected to the reader, as their feelings and thoughts are an open book. Diaries are inherently 1st person examples.  2nd person: You asked a question. Unless you are standing next to me, 2nd person is awkward, as your natural response to being told that you did something in a story is for you to deny it. 2nd person is difficult, and you rarely use it outside of a few select situations, like the Choose Your Own Adventure series.  3rd person: Some anonymous person posted this question on Quora. I would refer to them by their names, as my point of view is outside of them, but lacking their names I would use catchall words like \"they\". The majority of history books, documentaries, and fiction such as Lord of the Rings, Harry Potter, Adventures of Huckleberry Finn, etc. use 3rd person. It is simpler than 2nd person, and less personally attached than 1st person in general because the narrator is seen as observing the events, rather than giving their personal experience of those events. ",
            "date": "Answered August 8, 2015",
            "views": "4",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Korey Daniel",
                    "user_href": "/profile/Korey-Daniel"
                },
                {
                    "user_id": "Charalampos Koundourakis",
                    "user_href": "/profile/Charalampos-Koundourakis-1"
                }
            ]
        }
    ]
}