{
    "title": "What is your review of Upwork? - Quora",
    "tags": [
        "Upwork",
        " Reviews"
    ],
    "response": [
        {
            "author_info": {
                "name": "Michael Platz",
                "href": "/profile/Michael-Platz-2"
            },
            "answer_text": "It is widely known that fraudulent freelancers post their services on Upwork. Such has been reported in multiple web articles, multiple yelp reviews, and multiple complaints on the better business bureau website among other platforms. Unlike Facebook, a site that is attempting to remove fake accounts, harmful content, and misinformation, Upwork not only refuses to reprimand and eliminate fraudulent businesses on their platform, they create an environment that supports such frauds. They do so by, among other steps, 1) creating an unreasonably finite window of opportunity to dispute a claim, 2) removing themselves from involvement in any dispute between a freelancer and a customer, 3) instructing their customer service team to facilitate toxic interactions with customers that complain, and 4) involving themselves in transactional payments by customers' banks in order to prevent customers' banks form reversing charges for fraudulent business. One could only imagine why a company such as Upwork would want fraudulent businesses to flourish on their platform. An observation of Upwork's payment scheme eliminates any further imagination. The greater the amount of fraudulent business on their platform that remains unaccounted for, the greater the revenue for Upwork. Importantly, it is the fact that the fraudulent business is unaccounted for that permit's greater revenue for Upwork. Typically, when vendor is fraudulent, a customer has the recourse to halt and reverse payments from his or her bank, and report that vendor to authorities that ultimately reprimand and prevent further fraudulent behavior by the vendor. As widely reported on yelp posts and on reviews of Upwork's service elsewhere, Upwork's customer service is itself a fraud in that their goal is not resolve issues for customers rather their goal is to forcefully impose their stringent terms of service in order prevent any disturbance to their continued revenue stream, regardless of the outcome for the customer. Further, Upwork prevents any intervention from one's bank even when the reversal of payments is appropriate. Further, Upwork allows fraudulent businesses that have been on their platform for a number of months to expunge reviews critical of the vendors' service. As a result, fraudulent businesses flourishes, unsuspecting new customers continue to pay fraudulent companies, and Upwork gains the associated fees. Similar to the experience on Upwork of the many of the reviewers here and elsewhere, I was the victim of a fraud on Upwork and, needless to say, the Upwork customer service team was not only unhelpful, but attempted, forcefully, to end and undermine my complaint in order to facilitate continued service from their fraudulent vendor. Fortunately, the fraudulent vendor is currently in a lawsuit and has been unable to scam further unsuspecting customers, however, unfortunately, I have spent the last 5 months disputing the fraudulent transactions with my bank, only because Upwork has been fighting hard to prevent keep the vendors' fraudulent business afloat. As noted elsewhere in these reviews, it is unsurprising that Upwork's stock price has declined sharply from $20.99 after their IPO in October 2018 and $22.72 in February 2019 to $14.66 today, despite the fact that the S&P 500 peaked to its highest position since the beginning of the index, yesterday. I imaging the company is going to continue to fail because a business model based on fraud and a lack of customer service may be successful in the short run but cannot be successful in the long run. ",
            "date": "Answered October 29, 2019",
            "views": "46",
            "upvotes": " View 7 Upvoters",
            "upvoters": [
                {
                    "user_id": "Manuel Salceda",
                    "user_href": "/profile/Manuel-Salceda-1"
                },
                {
                    "user_id": "David Miller",
                    "user_href": "/profile/David-Miller-798"
                },
                {
                    "user_id": "Alastair Acheson",
                    "user_href": "/profile/Alastair-Acheson"
                },
                {
                    "user_id": "Gloria Richardson",
                    "user_href": "/profile/Gloria-Richardson-23"
                },
                {
                    "user_id": "Amanda Oliveira",
                    "user_href": "/profile/Amanda-Oliveira-29"
                },
                {
                    "user_id": "David Brown",
                    "user_href": "/profile/David-Brown-170"
                },
                {
                    "user_id": "Ewan McDonnell",
                    "user_href": "/profile/Ewan-McDonnell"
                }
            ]
        },
        {
            "author_info": {
                "name": "Steve Heidebrink",
                "href": "/profile/Steve-Heidebrink-1"
            },
            "answer_text": "Run! A majority of the clients are micro businesses. You won’t realize this until after you are hired for the most part. They don’t have money and you will spend a significant amount of your time talking to them unpaid. They say “U.S. Jobs”. These are clients looking for US talent. Well guess what, non-US people are finding a away to get into this platform and appear as US talent. I have people that reach out to me and request to use my Upwork account to bid on jobs as me. They’re out there. Upwork is client-first. They don’t care about the freelancer and will side with the client. Real Examples: I was hired by a client who then complained about the time I logged for when I was on the phone with him.Upwork rejected some of my hours I logged due to “inactivity” per their Terms & Conditions. You know what, when you’re trying to code something you aren’t coding non-stop sometimes you need to think.I completed a job so fast the client immediately changed the terms and added to the scope. I was screwed.I started a job and it was going really well until I had to consume their API. Their API did not work. I was screwed.Upwork is an interesting business model however I have no idea if they are profitable. I know a majority of people who work there are not US. I’m guessing they use offshore in order to lower their expenses. This platform probably works if you’re micro freelancer yourself. If you are deep into enterprise consulting with companies that have money to spend it’s a completely different animal then what I’m seeing here. I love helping people and that drew me to Upwork. You know what? Those clients want help however they’re not willing to pay market rates to get it done. They show little to no value for your time unless you’re cheap and Upwork won’t uphold your value as well. ",
            "date": "Answered February 19, 2020",
            "views": "14",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Parmeshawar Admane",
                    "user_href": "/profile/Parmeshawar-Admane"
                },
                {
                    "user_id": "David Miller",
                    "user_href": "/profile/David-Miller-798"
                },
                {
                    "user_id": "Mike Poznanovich",
                    "user_href": "/profile/Mike-Poznanovich"
                }
            ]
        }
    ]
}