{
    "title": "What would you do if your terminated employee asked for a letter of recommendation for other job seeking? - Quora",
    "tags": [
        "Recommendation Letters",
        "Human Resource Management",
        "Employees",
        "Workplace and Professional Etiquette",
        "Human Resources",
        "Job Searches",
        "Jobs and Careers",
        "Survey Question"
    ],
    "response": [
        {
            "author_info": {
                "name": "Mary Rhoads",
                "href": "/profile/Mary-Rhoads"
            },
            "answer_text": "Well, first of all, if you were their boss but you're not the owner of the company, check your company's policies. If you work for a large company there's a good chance you're not allowed to say anything other than to confirm job title and dates of employment. It's probably not worth risking your own job by violating this policy no matter how much you loved or hated this particular subordinate. If you're a business owner, or if you're a middle manager at a company that does allow you to give actual references: Give a good reference if you were happy with the person's performance but they had to be laid off for business reasons which had nothing to do with them.If they were fired for poor performance, your safest bet is to just confirm job title and dates of employment. (And tell the new company that this is a blanket policy, even if it isn't.) You should do this even if you personally disliked them and/or are still angry about their poor performance. It's just not worth the risk of lawsuit to get “revenge” on a fired employee by giving them a bad reference. If you have trouble accepting this, just remind yourself that this person is out of your hair now. And finally, if you're thinking that you somehow “owe” the new hiring manager a heads-up that the person was a bad performer, you just don't. It's their responsibility to vet their job candidates, not yours. Also, just because the person was a bad fit for the job in which they reported to you doesn't necessarily mean they'll be a bad fit for a different job with a different boss. (The one exception to this last part? If you personally know the new hiring manager and want to preserve your relationship with them, give them an honest opinion “off the record,” meaning in person or on the phone, not in writing.)If they were fired for cause (meaning, unethical/illegal behavior or gross violations of company policy) either ask your boss/company HR department for guidance, or if you're the owner, ask your lawyer for advice.",
            "date": "Answered January 21, 2020",
            "views": "60",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Philip Klossner",
                "href": "/profile/Philip-Klossner"
            },
            "answer_text": "Nothing, since my employer doesn’t allow letters of recommendation. Up to five years ago, any such request had to go to HR, who could say yes (conditionally) or no. If they said yes, you had to give the letter to HR and Legal for review. If both approved, you could send it out. After that, no letters by anyone no matter what for or the conditions you were leaving under. That also applies to grad school … which effectively prevents anyone working here from going to a grad school that requires employer and/or supervisor letters of recommendation. My sending a letter would result in termination and if there were any consequences, I might be sued. Those who could sue me: the employer you went to, my employer for allowing a recommendation that was (allegedly) false and you when you get fired from your new job because you didn’t live up to the recommendation I gave you. But what if it was allowed? The big question there would be “why were you fired and how does that impact other employers?” Suppose you’re fired for not showing up on time a lot. Most employers care about that so even if you have many good traits, how can I recommend you? You’re likely to show up late on your next job, they too will fire you and that will reflect on me. Now on the other hand, if that’s your only bad habit and I know the employer asking places little to no emphasis on when you clock in or out, different story. I might consider it too if you had a thin skinned manager who called expressing any opinion insubordination. It’s a fine line but if I think all you did was to offer progressive suggestions in a proper business manner, I might recommend you. That would be because I truly believed you were fired by a manager who could take no comments other than his own. ",
            "date": "Answered January 24, 2020",
            "views": "489",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Valerie Ng",
                    "user_href": "/profile/Valerie-Ng-29"
                }
            ]
        }
    ]
}