{
    "title": "What was Norman Mailer's greatest strength as a writer? - Quora",
    "tags": [
        "Norman Mailer (author)",
        "Novelists",
        "Creative Writing",
        "Writers and Authors",
        "Literature",
        "Writing Advice"
    ],
    "response": [
        {
            "author_info": {
                "name": "David Graham",
                "href": "/profile/David-Graham-149"
            },
            "answer_text": " Credit: peem5ter: Norman Mailer, April 27, 2005 | CC BY-NC-SA 2.0 Norman Mailer was a clear thinker. That was his greatest strength as a writer, especially when he turned his hand to nonfiction. Mailer studied aeronautical engineering at Harvard. The habits of mind he acquired there laid the foundation for his lapidary prose style. The textbooks say that if you can think clearly you can write clearly. But clear thinking doesn’t just manifest itself in clear prose. Writing is a craft, and like any craft, you have to work at it. By all accounts, Norman Mailer worked at his craft like a man possessed. It helped, of course, that he had off-the-charts intelligence (Mailer graduated from Harvard at twenty, if that tells you anything). And brash genius that he was, he wrote with brio. Two books Mailer wrote in 1968 reinvented journalism. These were The Armies of the Night and Miami and the Siege of Chicago, both still rivetingly readable after fifty years. Mailer was with Robert Lowell, Dwight Macdonald and other intellectuals protesting the Vietnam war in that famous October 21, 1967 march on the Pentagon. Here’s Mailer describing what happens once he’s busted and finds himself confined in the back of a truck with a fellow detainee who just happens to be an American Nazi. Mailer and the Nazi face off, get in a staring contest, hurl insults at each other and are about to start throwing punches when the law enters the picture: But now a tall U.S. Marshal who had the body and insane look of a very good rangy defensive end in professional football—that same hard high-muscled build, same coiled spring of wrath, same livid conviction that everything opposing the team must be wrecked, sod, turf, grass, uniforms, helmets, bodies, yes even bite the football if it will help—now leaped into the truck and jumped between them. “Shut up,” he said, “or I’ll wreck both of you.” He had a long craggy face somewhere in the physiognomical land between Steve McQueen and Robert Mitchum, but he would never have made Hollywood, for his skin was pocked with the big boiling craters of a red lunar acne, and his eyes in Cinemascope would have blazed an audience off their seat for such gray-green flame could only have issued from a blowtorch. Under his white Marshal’s helmet, he was one impressive piece of gathered wrath. Speaking to the Marshal at this point would have been dangerous. — Norman Mailer, The Armies of the Night: History as a Novel, The Novel as History (New York: New American Library, 1968), pp. 143-144 And here’s Mailer describing Hubert Horatio Humphrey making his speech at the 1968 Democratic National Convention: He spoke with the innocent satisfaction of a drop of oil sliding down a scallion. Of course, Hubert was no vegetable. He was the drugstore liberal. You had better believe it. He knew who had asthma and who had crabs. It is important to locate him in the pharmacopeia. Back of that drop of oil, he was an emollifacient, a fifty-gallon drum of lanolin—“We are and we must be one nation, united by liberty and justice for all, one nation, under God, indivisible, with liberty and justice for all. This is our America.” He was like honey from which the sugar had been removed and the saccharine added, he was a bar of margarine the color of make-up. He had the voice of a weeper, a sob in every arch corner and cavern of his sweet, his oversweet heart; he was pious with a crooning invocation of all the property of sentiment, he was all the bad faith of twenty years of the Democratic Party’s promises and gravy and evasion and empty hollers. He was the hog caller of the mountain and the pigs had put him in—he would promise pig pie in the sky. — Norman Mailer, Miami and the Siege of Chicago: An Informal History of the Republican and Democratic Conventions of 1968 (New York: World Publishing Company, 1968), pp. 223-224 There’s never been another American novelist or reporter who could write as vividly as that. ",
            "date": "Answered September 10, 2019",
            "views": "376",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Michele Shipley Klika",
                    "user_href": "/profile/Michele-Shipley-Klika"
                },
                {
                    "user_id": "Jonathan Keiler",
                    "user_href": "/profile/Jonathan-Keiler-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Brian Good",
                "href": "/profile/Brian-Good-6"
            },
            "answer_text": "He had the strength of his voice, which was magnificent. When he asserted something, you knew he believed it, and he made you believe it. Just now it occurs to me his uncredited influence in what became Gonzo journalism. ",
            "date": "Updated September 29, 2019",
            "views": "32",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Clinton Moore",
                    "user_href": "/profile/Clinton-Moore-28"
                }
            ]
        }
    ]
}