{
    "title": "What would your personal heaven and hell be? - Quora",
    "tags": [
        "Heaven and Hell",
        "Religion and the Afterlife",
        "Hell",
        "Heaven",
        "Afterlife",
        "Death and Dying",
        "Hypothetical Scenarios",
        "Religion",
        "Life and Living"
    ],
    "response": [
        {
            "author_info": {
                "name": "Sabri Shahin",
                "href": "/profile/Sabri-Shahin"
            },
            "answer_text": "We do not have much information about the afterlife. God will reward us for obedience, repentance, and good deeds God will forgive the sins of the obedient believers We do not know about what God has prepared for the righteous obedient people All what is mentioned in the scripture are just examples of eternal youth and unlimited happiness There are verses to teach us that the heaven will be as wide as a universe There are many verses to teach us that people will be very happy there There are more verses to teach us that people will get whatever they wish There are more verses to teach us that people will not get bored and that they will not wish to change to any other environment Just think about the rich people who are willing to spend fortunes to stay young, attractive, and healthy Just think of the unlimited capabilities of the God who has created such a miraculous universe; do you think it is difficult for him to make an everlasting happiness as he promised? We have been warned that the good and the bad will be judged; all the deeds are recorded It will be very easy and very happy day for the obedient believers It will be a very sad and difficult time for the disbelievers and the wrongdoers God wants us to witness our own test results in order to admit that we have been fairly rewarded according to our faith and our deeds Qur’an 27:83-85 is a scene from the hereafter, when we are asked ‘what else have you been doing?’. ‘When they ˹finally˺ come before their Lord, He will ask ˹them˺, “Did you deny My revelations without ˹even˺ comprehending them? Or what else have you been doing?” The sentence will be carried out against them for the consequence of their wrongdoings and they will not be able to utter a word’. 28:65-66 is also a scene from the hereafter to warn those who reject the Prophets. ‘And on that Day He will call unto them, and will ask: \"How did you respond to My messengers?\" but all arguments and excuses will by then have been erased from their minds, and they will not [be able to] obtain any [helpful] answer from one another’ The following are some scenes from the judgement day as recorded in Qur’an chapter 45 45:21 Do the evil doers think that We shall hold them equal with those who believe and do good deeds, and that their lives and deaths shall be alike? Bad is their judgment! 45:24 The disbelievers say: \"There is nothing but the life of this world? We live and die; nothing but time destroys us.\" In fact, they have no knowledge concerning this. They are merely guessing. 45:28-34 explain a scene from the hereafter; people will be rewarded for their deeds; all deeds are recorded. ‘You shall see every nation on its knees. Every nation shall be summoned to its book of record, and Allah will say: \"Today you shall be rewarded for your deeds. This book of Ours speaks about you with the truth. Surely We have recorded all your deeds.\" As for those who believed and did righteous deeds, their God will admit them into His mercy. That will be a glorious achievement. But as to those who disbelieved, Allah will say: \"Were My revelations not recited to you? But you showed arrogance and became a people of criminals\". It will be said: \"Today We will forget you as you forgot the meeting of this Day of yours! Hellfire will be your home and none will be there to help you’ Qur’an 33:67-68 is a scene from the hereafter to teach that those who follow the arrogant leaders will be misled. 23:64-66 is a scene from the hereafter to warn those who prefer to live a luxury life ignoring God’s message. ‘But as soon as We seize their elite with torment, they start to cry for help. We shall say: \"Do not cry for help this Day, for surely from Us you shall receive no help’. 46:20 is a scene from the hereafter to warn the arrogant people who did not obey but chose to enjoy a luxury life. ˹Watch for˺ the Day ˹when˺ the disbelievers will be exposed to the Fire. ˹They will be told, ˺ “You ˹already˺ exhausted your ˹share of˺ pleasures during your worldly life, and ˹fully˺ enjoyed them. So Today you will be rewarded with the torment of disgrace for your arrogance throughout the land with no right, and for the transgressions you committed.” That is similar to the wisdom taught by Jesus in Luke 16:25 17:14 is a scene from the hereafter teaches that each person will validate his records of his deeds. 32:12 is a scene from the hereafter to warn those who fail to do good deeds. ‘If only you could see the wicked hanging their heads ˹in shame˺ before their Lord, ˹crying: ˺ “Our Lord! We have now seen and heard, so send us back and we will do good. We truly have sure faith ˹now˺!” 34:25-26 teach that everyone will be judged for his deeds only (not for the mistakes of fathers or others). ‘Say: \"Neither shall you be called to account for whatever we may have become guilty of, nor shall we be called to account for whatever you are doing.\" Say, “Our Lord will gather us together, then He will judge between us with the truth. For He is the All-Knowing Judge.” 34:34 warns the people who have wealth and authority because those are usually the first people to reject the prophets. ‘Whenever We sent a warner to a society, its elite would say, “We truly reject what you have been sent with.” 35:37 is a scene from the hereafter to explain the conditions of the disobedient who wish to go back to life to do good deeds (although they are granted enough time to demonstrate their behavior). “Therein they shall cry for help: \"Our God! Get us out, from now on we shall do good deeds and shall not repeat the ones we used to do\". The response will be: \"Did we not give you lives long enough so that he who would, could take a warning? Besides, someone did come to warn you. Now taste the fruit of your deeds, here there is no helper for the wrongdoers.\" 39:59-61 is a scene from the hereafter to warn the arrogant who deny the signs and revelations. ‘Not at all! My revelations had already come to you, but you rejected them, acted arrogantly, and were one of the disbelievers.” On the Day of Judgment you will see those who lied about Allah with their faces gloomy. Is Hell not a ˹fitting˺ home for the arrogant? On the contrary, Allah will deliver the righteous to their place of salvation. No harm shall touch them, nor shall they ever grieve.’ Qur’an 39:71-74 After the Judgement, the Unbelievers will be driven to hell in groups. When they reach there, its gates will be opened and its keepers will say: \"Did there not come to you messengers from among yourselves, who recited to you the revelations of God and warned you about the meeting of this Day?\" \"Yes,\" they will answer. But at that time the sentence of punishment would have been already announced against the unbelievers.\" It will be said to them, “Enter the gates of Hell, to stay there forever.” What an evil home for the arrogant! And those who were mindful of their Lord will be led to Paradise in ˹successive˺ groups. When they arrive at its ˹already˺ open gates, its keepers will say, “Peace be upon you! You have done well, so come in, to stay forever.” They will say: \"Praise be to Allah Who has truly fulfilled His promise and gave us this land to inherit, now we can live in paradise wherever we like.\" How excellent will be the reward for the righteous? As recorded in Qur’an 52:35-36 disbelievers will be asked: ‘Were they created without a Creator? Or were they their own creators? Or did they create the heavens and the earth? In fact, they have no firm belief’ The following answers include the details: https://www.quora.com/What-are-Gods-greatest-teachings/answer/Sabri-Shahin https://www.quora.com/How-do-we-know-our-purpose-of-existence-in-this-world/answer/Sabri-Shahin https://www.quora.com/What-makes-us-happy-in-our-lives/answer/Sabri-Shahin https://www.quora.com/What-are-some-life-philosophies-that-cut-across-all-cultures/answer/Sabri-Shahin https://www.quora.com/What-are-the-differences-between-the-Holy-books-of-different-religions-Do-all-of-them-promote-love-humanity/answer/Sabri-Shahin https://www.quora.com/If-God-is-loving-and-caring-why-does-evil-and-suffering-still-exist/answer/Sabri-Shahin ",
            "date": "Answered May 4, 2019",
            "views": "239",
            "upvotes": " Answer requested by Johnathan Clover",
            "upvoters": [
                {
                    "user_id": "Joseph Reilly",
                    "user_href": "/profile/Joseph-Reilly-17"
                },
                {
                    "user_id": "TheFilmingGamer",
                    "user_href": "/profile/TheFilmingGamer-1"
                },
                {
                    "user_id": "Joyce Roberts",
                    "user_href": "/profile/Joyce-Roberts-60"
                }
            ]
        },
        {
            "author_info": {
                "name": "Alexander Todd",
                "href": "/profile/Alexander-Todd-10"
            },
            "answer_text": "Well, I do have my own theory on what happens after we die, and I’ve never publicly shared it before. I suppose now is as good a time as any. That being said, this is just my own personal theory. We can’t know for sure what happens after we die until we actually do, so this is just me speculating. Anyway… I’m not religious, so I don’t believe in any place people ‘go to’ when I die. However, the Law of Conservation of Energy states that energy cannot be created or destroyed, so surely something happens… I do think that when the body stops working, the mind (said un-destroyable energy) won’t know what to do. It’s not receiving any more sensory input, so it outputs just that. Nothing. Or at least, what the mind thinks nothing is (which is a whole other thing oh god my brain). It’s a failsafe, if you will. And it’ll be like that for a very long time (though you’ll probably not have any concept of time here anyway). At some point, you may realize that you’re still technically aware, that you still exist, and that you’re existing within your own consciousness. You can’t see, hear, smell, taste, or feel, but you’re still able to think. You’re just in a void, existing. But that sucks. It’s boring. To quote the great Bill Wurtz from his fantastic, history of the entire world, i guess video, “Forget this. I wanna be something. Go somewhere. Do something. I want things to change. I want to invent time and space, and I know it's possible because everything is here, and it probably already happened. I just don't know when to start… and that's exactly when it started.” You’ll realize that, because you’re all there is now, that you still have thought, and can think of something. As your mind has absolutely no sensory input (and wants sensory input), it takes whatever you thought of and sort of ‘hallucinates’ it into existence, though because there isn’t anything there anymore, that ‘hallucination’ becomes ‘real’. You’ll be able to invent time and space, as it didn’t exist before. You’ll be able to invent matter, as it didn’t exist before. You can create laws of nature and physics, physical senses, life itself, anything. Everything. To put it in terms that makes it easier for me to not spiral into an endless loop of fascination with this theory, you’ll basically be able to create your own everything. As you’re the creator of your personal everything, you’ll be able to control everything, including yourself, to an infinite degree. To make it sound like I’m not totally insane, basically, your mind won’t be able to cope with dying, so it just kinda sits there until you realize you still exist, where your mind is all like, “Woah, yeah dude, we still kinda exist.”, and you can think of stuff, and your mind is all like, “Welp, I don’t have anything else to sense, so I guess that’ll do.”, and makes it real. You essentially get your own everything and can do whatever you want with it forever. Have fun. Alternatively, by this theory, people that do believe in some place to go after you die actually go there when they die. It’s real for them. ONCE AGAIN, THIS IS MY OWN PERSONAL THEORY (And I don’t know of anyone else who shares the same theory as me.). …actually, if you have your own theory, post a comment about it. I’m fascinated with this stuff. ",
            "date": "Answered May 1, 2019",
            "views": "12",
            "upvotes": " View 3 Upvoters"
        }
    ]
}