{
    "title": "What's the easiest way to publish a novel online? - Quora",
    "tags": [
        "Book Publishing",
        "Publishing",
        "Novels"
    ],
    "response": [
        {
            "author_info": {
                "name": "Jewel Parago",
                "href": "/profile/Jewel-Parago"
            },
            "answer_text": " Your question sounds rushed. Publishing isn’t difficult as much as it can be confusing because there are so many choices. Publishing well, requires knowledge and planning. Publishing fast, is simply choosing an online site and following their prompts. This method will likely not prove beneficial in the long run because several important choices weren’t made. What kind of choices, well do you give away your distribution rights by using a free ISBN from the online company, do you know the right categories and tags to select where your book will be sold, how does your book compare to others in the same categories, and so much more. What is your marketing plan and have you created your author platform. I see so many authors simply upload their books without proper planning believing it will simply sell because its available online. Your book will be completing with roughly five million others books currently in print. How is your book going to get noticed in such a large sea of books? Are you considering a print format, an ebook or others? The choice of how you publish will determine where your book can be sold. I see other authors suggest Kindle, but is that really best? If so, which Kindle platform, Kindle Direct or Kindle Select? Select is exclusive meaning your book can’t be sold anywhere other than Amazon. Yes it pays 70% instead of 35% on Direct and gives you 5 free days per quarter, but it doesn’t begin to stack up to Ganxy. Most authors have no clue about Ganxy, or that it pays 90%, has no exclusivity, unlimited free days at your will, plus gives you the email addresses or your customers and so much more. The worst thing you can do is to rush into publishing before creating a sound plan. There is much to understand and your choices will directly affect how your book performs. ",
            "date": "Updated August 28, 2018",
            "views": "23",
            "upvotes": " View 3 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Ritesh Sharma",
                    "user_href": "/profile/Ritesh-Sharma-563"
                },
                {
                    "user_id": "Mudassir Jowher",
                    "user_href": "/profile/Mudassir-Jowher"
                },
                {
                    "user_id": "Ryan Monahan",
                    "user_href": "/profile/Ryan-Monahan-14"
                }
            ]
        },
        {
            "author_info": {
                "name": "Salahuddin Elmur",
                "href": "/profile/Salahuddin-Elmur"
            },
            "answer_text": "Online publishing I don't have experience in publishing field but i guess the easiest way is make a blog and start writing there after you get a number of audience you will find a publishing house for your novel . Another way : there is a lot of free publishing house online to publish your book just sign up and publish [1] [2] [3]    Footnotes[1] Light Switch Press, the free book publisher[2] Blurb[3] Online Self Publishing Book & eBook Company",
            "date": "Answered June 29, 2016",
            "views": "15",
            "upvotes": "0"
        }
    ]
}