{
    "title": "What are some ideas of things to post on your personal Instagram? - Quora",
    "tags": [
        "Instagram Account Services",
        "List Question",
        "Photographs"
    ],
    "response": [
        {
            "author_info": {
                "name": "Amit Thakur",
                "href": "/profile/अमित-ठाकुर-Amit-Thakur"
            },
            "answer_text": "If you're looking for easy Instagram Post Ideas then this post is packed with them. I've got 30 Easy Instagram Ideas that will make your engagement soar and help you decide what to post on Instagram. Instagram is booming, there's no doubt. And when it comes to engagement, it's THE platform to consider for most businesses and industries. Take a day and you've got your Instagram content calendar sorted and scheduled — happy days! Instagram 30 content ideas for bloggers 1. Morning Routines 2. Record a tutorial 3. Share a micro-video 4. Share and image of your workplace 5. Give to your audience some laugh 6. Who is your inspiration follow them 7. Your favorite, food, hobbies, restaurants, travel destinations. 8. Any DIY projects ( like if you are a fashion blogger you can share 10 ways to style a t-shirt with traditional wear ) 9. High-quality social media graphics 10. Host a challenge 11. Follow small reach #tag when you are just a startup 12. Share a memes 13. Share your life experiences 14. Talk about society problems 15. Engage with your audience 16. Support small pages 17. Use proper grid 18. You can use the same preset for every picture 19. Feature other stories 20. Use a poll ( like intermittent fasting / regular eating ) for weight loss you will get lots of engagement and audience perspective also 21. Ask me anything 22. Share holiday and nation related post-show love to the nation 23. Your schedules 24. Share your hacks, creativity, talents. It might be anything 25. Share giveaway 26. Take opinions and feedbacks 27. Your success and failure. 28. Quotes related to life, success, hard work. 29. Your house tour 30. Your favorite products ( skincare, haircare, makeups, tools, hacks, photography ideas, Follow me for Social media tips & Hacks RegardsAmit Thakur ",
            "date": "Answered June 5, 2020",
            "views": "18",
            "upvotes": " View 5 Upvoters",
            "upvoters": [
                {
                    "user_id": "Cam Allen West",
                    "user_href": "/profile/Cam-Allen-West"
                },
                {
                    "user_id": "Sandhya Bhadauria",
                    "user_href": "/profile/Sandhya-Bhadauria-3"
                },
                {
                    "user_id": "Teckmovers Solutions",
                    "user_href": "/profile/Teckmovers-Solutions"
                },
                {
                    "user_id": "Aya Abou Zahr",
                    "user_href": "/profile/Aya-Abou-Zahr"
                },
                {
                    "user_id": "Dhruv Grover",
                    "user_href": "/profile/Dhruv-Grover-11"
                }
            ]
        },
        {
            "author_info": {
                "name": "Charley Carlin",
                "href": "/profile/Charley-Carlin"
            },
            "answer_text": "Personal Instagram -- For your personal Instagram, the next questions is what interests you, what is your age group, are all your followers to be personal as well? If you are doing personal only with personal friends, then you life is what you would be sharing, people, friends, pets, your hometown area, etc. If you are still in school, then your friends, your school, your interests. If you interest is cars, post cars, if your interest is poetry, post poems. Your instagran is the flavor of you. If food is your life, then post food!  I take pictures, crop them to fit Instagram and post away.  For me pictures from the zoo and pictures of sunsets have been popular.  Create a personal hashtag, and add hashtags to connect with your intended audience.  For me I use #charleytravels for some examples of my take.  There is no wrong answer. Challenge yourself to take and post a picture every day or so and see where it leads you. The world has interesting shots everywhere. ",
            "date": "Answered March 17, 2016",
            "views": "58",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Yal Takahashi",
                    "user_href": "/profile/Yal-Takahashi"
                },
                {
                    "user_id": "Lucy Summers",
                    "user_href": "/profile/Lucy-Summers-3"
                }
            ]
        }
    ]
}