{
    "title": "What are some of the greatest unsolved mysteries of all time? - Quora",
    "tags": [
        "Unsolved Mysteries"
    ],
    "response": [
        {
            "author_info": {
                "name": "Archit Sharma",
                "href": "/profile/अर्चित-शर्मा-Archit-Sharma"
            },
            "answer_text": "Geoglyphs. Geoglyphs are large artworks constructed by ancient civilizations on grounds. The actual size and structure of many of geoglyphs only becomes clear from air. Still the modern world is unaware about actual purpose of geoglyphs and about their creators. These impressive sites trigger intriguing debates about their true meaning and purposes. The question is who and why created these gigantic representations that too with extreme precision. The Amazon Geoglyphs:- These amazing geoglyphs were revealed during the deforestation in the 1970s amidst the large tropical rainforests of the Brazilian Amazon in the area near Rio Branco. These perfect geometric shapes (squares, octagons, circles, rectangles and ovals) cover hundreds of meters. It is believed that they were created as trenches during the war against the Bolivians. In the early 2000s, it was most commonly suggested that they were foxholes. American writer Charles C. Mann, in his book titled “1491” on the Americans before the arrival of Columbus, suggests that the forests of Amazon, which were considered pristine, may have been inhabited by large populations. Researchers support that they date back 1,000 to 2,000 years and were of great ceremonial importance. Nazca lines of Kazakhstan:- Google Earth traced More than 50 geoglyphs of different shapes and sizes in Northern Kazakhstan, Central Asia, similar to Nazca Lines of Peru. Made of earthen mounds, with a diameter from 90 to 400 meters, these enormous geoglyphs have attracted interested among the scientific community. What’s more, a massive swastika was discovered among them. Paracas Candelabra:- It is a mysterious and giant ground drawing etched on the sloping hill at Pisco bay in Peru. The geoglyph shows resemblance with candlestick and so it is called as ‘The candelabra of Andes’. It was created by cut the soil into the depth of two feet using stones. It is 595 feet tall and can seen from 12 miles out to the sea. So many local people believe that it could be sign of sailors. But the real purpose of this geoglyph remains unknown. Archaeologists believed that paracas cendelabra dated to 200 BC. Because pottery found near this site has been carbon dated to 200 B.C. The Uffington White Horse:- The Uffington White Horse, which was revealed close to the ancient Ridgeway path, is one of the most famous hill figures in Britain. Its lines, created with white chalk bedrock represent a horse or a dragon and is believed to date back to 11000 BC. It is likely that the tribe who created the White Horse once lived within an Iron Age hill fort. The figure represents either King Alfred, goddess Epona, worshiped by the Celts, or even the dragon killed by St George. The Atacama Giant:- In the Atacama Desert, west of the Andes, over 5000 geoglyphs cover a wide area across parts of Peru, Chile, Bolivia, and Argentina. These geometric shapes, human and animal figures are believed to have been created by the Tiwanaku and the Incas. They played an important role to the transportation network among the civilizations of South America, indicating where salt flats, water sources and animal fodder could be found. Among these geoglyphs, the so-called “Atacama Giant”, also known as “Cerro Unitas”, dominates the desert. This enormous figure with square head and long legs has been recorded as the largest known geoglyph in the world. Nazca Lines:- It features hundreds of geoglyphs ranging from simple lines to very complex figures. The site is situated in Nazca desert in Peru and recognized by UNESCO as a world heritage site in 1994. The site include many animal and plant figures such as monkeys, spiders, humming birds, killer whales, sharks,lizards and phytomorphic shapes like flowers and trees. The animal and plant figures comes under biomorph category and figures on plain comes under geogplyhs. There are 900 geogphys in total within the site includes straight lines, triangles, circles and spirals. These lines are created by brushing away the pebbles and exposing the white colored sand under the surface of desert. Scientists believed that Nazca lines were created between 400 and 650 AD by people from Nazca culture. Nazca lines are still persevered because of isolation of the site. The actual purpose of Nazca lines remains unclear. There are many theories speculated over the purpose of Nazca lines. Archaeologists believed that Nazca lines are intended to point places on distant horizon such as Sun and other celestial bodies. The Works of Old Man:- Stretching from Syria to Saudi Arabia, thousands of ancient geoglyphs built from stone stretch across the desert plains. Known as the “works of old men”, some display a kite-like structure while others have wheel-like designs. Similar to the Nazca Lines of Peru, they come in a wide variety of shapes and sizes, with much diversity between structures. The geoglyphs are virtually invisible to those on the ground, but can be easily discerned by those flying overhead. The local Bedouins refer to them as the “works of old men” but have been unable to provide further insights into their creators. They cover far more area than the Nazca Lines of Peru, and are believed to be much older. (The Nazca Lines are believed to date back to between 400 and 650 AD). They were first noted by RAF Flight Lt. Percy Maitland in 1927. In a journal called “Antiquity” he reported that he saw the structures over Harrat-ash-sham lava field, while he was flying an airmail route across Jordan. Blythe Intaglios:- In 1931, pilot George Palmer first discovered the so-called “America’s Nazca Lines”, also known as Blythe Intaglios, while flying over the Colorado Desert. These six figures were created by local tribes who inhabited the area around the Colorado River. Their age was initially estimated to be 450 to 2,000 years, but newer research from Berkeley University dates them around 900 AD. According to locals, the human representations were created to honor Mastamho, the Creator of Earth and all life, while the animals represent Hatakulya, one of two mountain lions/persons. The Cerne Abbas Giant:- Also known as the ‘Rude Man’ is an enormous hill figure 120 feet long and 180 feet high carved in chalk bedrock located in Dorset, England. Researchers suggest that it is much earlier than Iron Age. Several theories have been supported on this representation of a naked man wielding a club: it is either the giant Greek-Roman god Hercules, a pagan symbol or a Danish giant. According to folklore, the giant had magical properties and would help women enhance fertility. ( Failed to find a censored version.) Sajama Lines:- In Western Bolivia, thousands and thousands of perfectly straight paths are etched into the ground over a period of 3,000 years by indigenous people living near the volcano Sajama. It is unknown exactly when or why they were constructed, but they remain a mystery, as it is hard to imagine how the construction of something of such magnitude could pre-date modern technology. The Sajama lines cover an area of approximately 22,525 square kilometers, or 8,700 square miles. They are perfectly straight lines, formed into a web or network. Each individual line is 1-3 meters, or 3-10 feet wide. The longest lines measure 20 kilometers, or 12 miles in length. They were etched into the ground by scraping vegetation to the side, and scouring away dark surface material consisting of soil and oxidized rock, to reveal a light subsurface. Thanks for reading. footnotes:- Nazca Lines of Kazakhstan: More Than 50 Geoglyphs Discovered The puzzling case of the Atacama Giant Land Carvings Attest to Amazon’s Lost World The “Works of the Old Men” in Arabia: remote sensing in interior Arabia Paracas Candelabra of Peru The Mystery of the White Horse of Uffington Nazca Lines: Mysterious Geoglyphs in Peru Blythe Intaglios: The Impressive Anthropomorphic Geoglyphs of the Colorado Desert Cerne Abbas Giant The unknown origins of the incredible Sajama Lines of Bolivia ",
            "date": "Answered September 9, 2018",
            "views": "8",
            "upvotes": " View 42 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Dawn Dunphy",
                    "user_href": "/profile/Dawn-Dunphy"
                },
                {
                    "user_id": "David Alterman",
                    "user_href": "/profile/David-Alterman-1"
                },
                {
                    "user_id": "Tara Santistevan",
                    "user_href": "/profile/Tara-Santistevan"
                },
                {
                    "user_id": "Wilburblack .",
                    "user_href": "/profile/Wilburblack"
                },
                {
                    "user_id": "Rebecca Siguenza",
                    "user_href": "/profile/Rebecca-Siguenza-2"
                },
                {
                    "user_id": "Hello",
                    "user_href": "/profile/Hello-2224"
                },
                {
                    "user_id": "Rebeca Mio",
                    "user_href": "/profile/Rebeca-Mio"
                },
                {
                    "user_id": "Ossamah Farhi",
                    "user_href": "/profile/Ossamah-Farhi"
                },
                {
                    "user_id": "Kyle Sheq",
                    "user_href": "/profile/Kyle-Sheq"
                },
                {
                    "user_id": "Fred Feinberg",
                    "user_href": "/profile/Fred-Feinberg"
                }
            ]
        },
        {
            "author_info": {
                "name": "Sivararamakrishnan (சிவராமகிருஷ்ணன்)",
                "href": "/profile/Sivararamakrishnan-சிவராமகிருஷ்ணன்"
            },
            "answer_text": "Here we go. Did Hitler try to make bomber UFOs? Did Hitler come up with a crackpot scheme to bomb London and New York with UFOs? It sounds bizarre, but there is now evidence to suggest that the Nazis came very close to succeeding in building some kind of hi-tech, anti-gravity aircraft with vertical take-off capabilities. There were even sighting of a UFO over the Thames in 1944, while others are convinced the 1947 Roswell Incident was actually a disastrous attempt by the US to test out Nazi designed flying saucers.  What was the CIA-sponsored MKUltra programme? As recently seen on Netflix’s Wormwood, MKUltra was set up during the Cold War to research and develop materials that could be used to control human behaviour – basically, how to do mind-control. It was run covertly through universities, hospitals, prisons and drug companies who used their patients and inmates as non-consenting guinea pigs. While a government investigation in 1975 revealed a lot about MKUltra, the vast majority of official records relating to it were destroyed in 1973 on the orders of the CIA’s then-Director, Richard Helms… We may never know the lengths it went to and the damage it caused.  Who was the man in the iron mask? Immortalised by Alexandre Dumas, The Man in the Iron Mask was a prisoner in Paris’ Bastille prison from 1698 until his death in 1703. His face was always hidden but he was treated with the utmost respect by his jailers. So who was he? The most popular theories suggest that he was someone related to the French king of the time, Louis XIV, who would call his legitimacy into question – his twin brother, older brother, or even his real father. That his identity remains uncertain to the modern day is testament to the French crown’s ability to keep its silence.  Was Lizzie Borden a murderer? On 4th August 1892 Andrew and Abby Borden were brutally bludgeoned to death in their home in Massachusetts. Their daughter Lizzie, a quiet Sunday School teacher, was arrested on circumstantial evidence and after only an hour of deliberation, the jury acquitted her. Whether this means Lizzie was innocent or not, we’ll never know, but her defenders have pointed to several other potential killers including her uncle, illegitimate brother, scorned lover and even the local doctor. Whatever happened in that house that day, someone got away with murder.  What does the Shugborough Inscription mean? The inscription found on a monument at Shugborough Estate in Staffordshire has perplexed some of the most brilliant crptologists. One of the most popular theories is that it relates to a secret kept by the Priory of Sion, descendants of the Knights Templar and guardians of the holy grail (the ones from The Da Vinci Code by Dan Brown). Another theory suggests it is simply a private dedication from one member of the family to another. Whatever the case, no one, not even Darwin (who was captivated by the mystery) can solve it.  Who killed the Black Dahlia? The unsolved murder of Elizabeth Short in 1947 is one of the most famous cold-cases of the 20th century. Elizabeth was a 22-year-old waitress found brutally and clinically murdered in a park in California. The case became a media furore when her supposed killer wrote to the Los Angeles Examiner and sparked a queue of cranks and attention-seekers purporting to be the killer. Over the decades suspects have risen and fallen in popularity, with an LAPD detective even pointing the finger at his father. With the passage of time and decaying evidence it seems unlikely the crime will ever be solved.  Was Mercy Brown a vampire? Mercy Brown was a young girl who died from tuberculosis in New England in 1892. She was exhumed along with her mother and sister who has also died from the disease in 1892 when her father was told a sinister spirit may be at work on his family. When Mary’s body was brought to light it did not show any signs of decomposition, despite being buried for two months. Her skin was well preserved, her hair and nails had grown and she even had liquid blood; even more weirdly her body was said to have moved positions in the grave. While science has tried to explain it, no theories have succeeded completely – perhaps Mercy was, as suggested at the time, a Vampire child, sucking the life out of her family?  Do the Men in Black really exist? Since the 1940s rumours have abounded in the USA about the mysterious Men In Black, always linked to supposed UFO sightings and investigations. They have become part of our popular culture, and yet there is growing support for the theory that MIB legend is part of a hugely complex web of deceit by the US government. Their aim, according to theorists, is not to persuade people that aliens don’t exist but to add another layer to the UFO folklore to distract from the real truth behind UFO sightings, that are all part of government conspiracies.  What’s the truth behind the 1995 alien autopsy video? 1995 promised to be a huge year for UFO enthusiasts, with the release of a video purporting to show a real-life alien autopsy. Over one billion people watched the shadowy 17 minute long video in which a non-human entity was dissected. The film’s producer Ray Santilli claimed it was original footage he found among 22 reels of film harboured by a retired military cameraman for over 40 years. In 2006, he admitted he had made the film with a model-maker, but insists it is an exact reconstruction of the film he saw, which had disintegrated so much it was unusable, apart from a few scenes used in the 1995 film. Whatever the truth, it doesn’t look like Santilli – the only person who can ever know – will tell us.  What’s with the severed feet of the northwest seaboard? The Salish Sea is a waterway that runs from British Columbia in Canada to the north of Washington State, USA. Between August 2007 and May 2014 over 10 dismembered feet – still in their socks and shoes – washed up somewhere along this stretch of sea. While nobody can prove it, it is thought that they are the feet of drowned cadavers. Whose feet remains the question.  What was going on with the Majestic 12? In the mid-1980s a series of astonishing documents, apparently leaked from the US government, were made public. They claimed that US President Harry Truman had set up ‘Operation Majestic 12’ - a 12-man committee ordered to work undercover and cover up the ‘Roswell Incident’ (a supposed UFO-crash landing in 1947), utilising the technology that had fallen into US hands as a result, and to manage future extra-terrestrial engagement. While most are convinced it was all a hoax, theories remain as to why the US government went to such lengths to discredit the rumours, with some even suggesting it was to divert public attention from the real truths that could have come to light.  Will the CIA Kryptos code ever be broken? The sculpture ‘Kryptos’ stands at the centre of the CIA grounds at Langley, Virginia. Designed by Jim Sanborn it is adorned with four coded messages – each fiendishly difficult to break. Three have been decoded (though this took years instead of the weeks Sanborn predicted) but the fourth is yet to be cracked – a task made even more difficult by a number of deliberate typographical errors. Sanborn has set up an official website where possible solutions can be verified but for now even the world’s pre-eminent intelligence experts are confounded.  Why did people dance themselves to death? In July 1518 a woman known as Frau Troffea took to the streets of Strasbourg and started to dance maniacally. A week later, she had been joined by 100 people and within a month there were four times as many who began to collapse from exhaustion – a large number died. Weirdly, there had been at least 10 comparable incidents documented since the 14th century, all of which noted that the participants seemed to be reluctant to dance or unable to control their affliction. Illness, mass hysteria and evil possession have all tried to explain the Dancing Plague away but the reality is we will never know what caused it.  Is the Flying Dutchman real? The Flying Dutchman – a spectral ship fated it sail the seas for all eternity – has become rooted in naval folklore since it was first supposedly sighted in the 17th century. Many think it is simply a myth conjured up in the minds of old sea dogs, designed to both entertain and terrify. However, sightings as recently as the 20th century have persuaded others that the ghost ship really exists.  Who is the Mothman? The Mothman is one of the more famous urban myths, reworked and popularised in print and on screen. However, the story has its roots in a number of apparently genuine sightings reported over the course of a year in West Virginia, of a human-like huge-winged figure with red eyes. The sense of bewilderment and fear caused by The Mothman climaxed with a tragic accident that killed 46 people. Was it an instance of mass hysteria? Was it the work of a cruel practical joker? Or was there really a creature whose appearance forewarned of impending doom?  Is there really a beast of Bodmin Moor? Since 1983 there have been at least 60 reported sightings in the West Country of a large catlike animal, of a type not indigenous to the UK. Descriptions of the Beast tally strongly, but the official line is that no such creature exists, but a growing body of evidence - including unexplained livestock mutilations, photos and videos - would suggest there really is something out there. We just don’t know what.  Where is Frederick Valentich? In October 1978 a would-be hot-shot pilot, Frederick Valentich, was on a training flight when he radioed Melbourne air traffic control to report an unidentified flying object (a literal UFO) speeding through the sky above him. Valentich was asked to identify the other aircraft and replied “It isn’t an aircraft. It is…” when all contact was lost. No trace of him has been found. Theories about what happened range from tragic accidents, suicide, alien abductions and UFO attacks, fuelled by a suppressed investigation report. Ultimately however, we’ll never know what happened.  Can humans really spontaneously combust? Spontaneous human combustion is when a person bursts into flames despite the apparent absence of an external heat source. Often used in film and fiction, many suggest that in reality victims succumb to something called the ‘wick effect’ (too gross to explain here). However, there is growing evidence to suggest that spontaneous human combustion can in fact occur with over 200 cases reported worldwide. It was even given as the cause of death by a highly experienced coroner at an inquest in Ireland in 2011. If it is real (and no one knows the answer to this), we also crucially don’t know HOW it happens.  Why was Lee Harvey Oswald murdered? In 1963 Lee Harvey Oswald assassinated US President John F. Kennedy. Oswald was initially depicted as a lonely Communist sympathiser, but it is now widely accepted that he was part of a bigger conspiracy to kill the President. At the heart of this is the mysterious figure of Jack Ruby, who shot Oswald soon after his arrest. Ruby’s links to organised crime have only fuelled the conspiracy-theory fire but no one knows why he did it for sure. Ruby himself even said: “Everything pertaining to what’s happening has never come to the surface… The people who had so much to gain, and had such ulterior motive for putting me in this position I’m in, will never let the true facts come above board to the world.”  Did Moscow cover up the deaths of numerous members of their space programme? At the height of the Cold War everything between the USA and the Soviet Union was a battlefield – most famously the space race. While the USSR had been leading since 1957, America finally won when they put Neil Armstrong on the Moon in 1969. However, there have long been rumours that two earlier attempts by the Russians ended in tragedy and a government cover-up, started by a pair of Italian brothers who claim they listened in on extraordinary episodes including at least three occasions where they heard astronauts dying in space. With the lengths taken by both the White House and the Kremlin to preserve secrecy at the height of the Cold War we may never know the truth.  Courtesy : shortlist Happy Reading… ",
            "date": "Answered February 12, 2019",
            "views": "142",
            "upvotes": " View 38 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Chris Spangler",
                    "user_href": "/profile/Chris-Spangler-24"
                },
                {
                    "user_id": "Anabil H. Kashyap",
                    "user_href": "/profile/Anabil-H-Kashyap"
                },
                {
                    "user_id": "Dani LeBlanc",
                    "user_href": "/profile/Dani-LeBlanc"
                },
                {
                    "user_id": "SHRADDHA SINGH STUDENT VK",
                    "user_href": "/profile/SHRADDHA-SINGH-STUDENT-VK"
                },
                {
                    "user_id": "Kartika Oktafianti",
                    "user_href": "/profile/Kartika-Oktafianti"
                },
                {
                    "user_id": "Gautam Balamurali",
                    "user_href": "/profile/Gautam-Balamurali"
                },
                {
                    "user_id": "George Griffin Powers",
                    "user_href": "/profile/George-Griffin-Powers"
                },
                {
                    "user_id": "Spurthi Puri",
                    "user_href": "/profile/Spurthi-Puri"
                },
                {
                    "user_id": "Harsh Raj",
                    "user_href": "/profile/Harsh-Raj-1351"
                },
                {
                    "user_id": "Devra Schreiber",
                    "user_href": "/profile/Devra-Schreiber"
                }
            ]
        }
    ]
}