{
    "title": "What's the best example of President Obama engaging in ginned up rhetoric? - Quora",
    "tags": [
        "Rhetoric",
        "Barack Obama (politician)",
        "Politics of the United States of America"
    ],
    "response": [
        {
            "author_info": {
                "name": "Susan Lowry Lamb",
                "href": "/profile/Susan-Lowry-Lamb"
            },
            "answer_text": "While running he demonized sales people on an incentive trip.  Calling them executives ruining the economy.  Said people met a quota of sales to earn this trip.  It's common in sales.  It's considered to be income, and it's no different than anybody else's paycheck coming home.  Had the company ripped said trip they could have been sued over wage theft.  Had they canceled the trip and given the cash value they'd have spent more on lost deposits to hotels, etc. etc.  I have no doubt the President understood this prior to his demonizing.  It was an example of him wishing to use populist rhetoric. ",
            "date": "Answered March 10, 2015",
            "views": "59",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Nina Crespi",
                "href": "/profile/Nina-Crespi"
            },
            "answer_text": "Ginned up rhetoric means to enliven, excite or enthuse. All politicians do this. In Obamas case, I'd say a great example was after he accused opponents of moving the goal posts on border enforcement. “Maybe they’ll need a moat,” he said sarcastically. “Maybe they want alligators in the moat.” Read more at: http://www.nationalreview.com/article/267122/demagoguery-101-charles-krauthammer ",
            "date": "Answered March 7, 2015",
            "views": "88",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Clay Crocker",
                    "user_href": "/profile/Clay-Crocker"
                }
            ]
        }
    ]
}