{
    "title": "What are formal letters? - Quora",
    "tags": [
        "Writing Letters",
        "Letters (mail)"
    ],
    "response": [
        {
            "author_info": {
                "name": "John Tracy Lazaro",
                "href": "/profile/John-Tracy-Lazaro"
            },
            "answer_text": "Formal letter is a request for something that is meaningful to you. It’s like talking to a higher being asking for important something with respect. Direct to the point, not hurting, not offensive, not too personal. It’s an introduction of yourself since you are a stranger to them, make it short but not too short. Tell them what they need to know but not what you wanted to share. Instead of going from place to place which is time consuming and you really wanted to do it at the same time … write a formal letter ! It’s like “What’s in your brain we can accommodate?” “Are you an Architect? Tell Me about your records”.Since you are not there personally, we do the formality of writing! God Bless ",
            "date": "Answered November 19, 2018",
            "views": "56",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Muhammad Sarim Siddiqui",
                    "user_href": "/profile/Muhammad-Sarim-Siddiqui"
                }
            ]
        },
        {
            "author_info": {
                "name": "Alan Markow",
                "href": "/profile/Alan-Markow"
            },
            "answer_text": "You can find templates for creating a formal letter in Microsoft Word or other word processors or within Google Docs. However, here are a few key requirements. First, if you’re not using a letterhead, then your name and address should appear at the top. It can be centered, or justified right. Either way, a justified right date should appear below name and address. Below address on the left side of the page is the name, title and address of the recipient. Below this information, put in a space and write your greeting, e.g., “Dear Mr. So and So”, Dear Jamie, or even To The Hiring Manager, or To the Head of Customer Service. At the bottom of the letter, after a space and justified left is your closing. You can choose any number of possibilities, but I prefer Yours truly. Sincerely is sometimes appropriate. If the letter is formal, you wouldn’t use Your friend, or anything personal. Put several lines between Yours truly and your name. The extra space is to allow room for your signature. Put it in an envelope, put on a stamp and mail it. By the way, for formal letters it is far better to type the address on the envelope rather than hand write it. ",
            "date": "Answered June 21, 2018",
            "views": "456",
            "upvotes": "0"
        }
    ]
}