{
    "title": "What would you use beyond Grammarly to ensure you write better? - Quora",
    "tags": [
        "Grammarly (company)",
        "Grammarly (product)",
        "Creative Writing",
        "Sentences (language)",
        "Writing Advice",
        "Grammar",
        "English Grammar",
        "Writing",
        "English (language)"
    ],
    "response": [
        {
            "author_info": {
                "name": "Michelle DeWitt",
                "href": "/profile/Michelle-DeWitt-1"
            },
            "answer_text": "A professional editor. Many will use Track Changes in Word, so you can view what was changed and see queries/suggestions. You will take this knowledge with you to your next project. Not to self promote, but to help you see how editing can affect writers, I have had two clients note: “She didn't leave a stone unturned, and her comments and recommendations have made me a better writer” and \"You have taught me so much about writing. When I write a sentence now, I stop and think, ‘What would Michelle ask me about this sentence?’” ",
            "date": "Answered May 18, 2020",
            "views": "28",
            "upvotes": " Answer requested by Jovanna Recine"
        },
        {
            "author_info": {
                "name": "Paul Larkin",
                "href": "/profile/Paul-Larkin-9"
            },
            "answer_text": "how to write better = while Grammarly is excellent, occasionally it does get it wrong. There a few writing books that help with grammar and punctuation. It is always nice to be independent of an on-line service and to know why you are correct. “The only Grammar Book you’ll ever need” by Susan Thurman, helps you to produce writing that is clear, concise and grammatically correct. “Eats, Shoots and Leaves - the zero tolerance approach to punctuation” by Lynne Truss. This is a bestseller that is a clear guide to punctuation and an entertaining text for all those interested in better writing. ",
            "date": "Answered May 19, 2020",
            "views": "20",
            "upvotes": " Answer requested by Jovanna Recine"
        }
    ]
}