{
    "title": "What term describes a poem’s word choice? - Quora",
    "tags": [
        "Poetry Analysis",
        "Writing Poetry",
        "Descriptions",
        "Poems",
        "Poetry",
        "Creative Writing",
        "Literature",
        "Vocabulary of the English Language",
        "Writing"
    ],
    "response": [
        {
            "author_info": {
                "name": "Ian Colville",
                "href": "/profile/Ian-Colville-1"
            },
            "answer_text": "Word choice refers to the words a poet chooses to use. So an appropriate term could be just that – word choice, with the emphasis on choice as every word counts (we're constantly told). Words are building materials from which the poet constructs h[is/er] poem, so another appropriate phrase could be choice of material(s). Words may be chosen for their connotation and meaning, so there's another phrase that might cause you to think of the subtleties created by word choice. Other aspects to think of: are the words mostly specific or general; concrete or abstract? Carefully chosen words have a label, which is diction. I guess that's the word/phrase you need. Strong, concrete diction ensures a poem imparts the desired effect; conveys the intended information or meaning. ",
            "date": "Answered October 2, 2020",
            "views": "42",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Shana Chen",
                    "user_href": "/profile/Shana-Chen-3"
                }
            ]
        },
        {
            "author_info": {
                "name": "Denis Martindale",
                "href": "/profile/Denis-Martindale"
            },
            "answer_text": "Sometimes it’s all about the elegance of eloquence. Sometimes it’s about alliterations. Sometimes it’s about creating an acrostic style poem. Sometimes it’s just a preference, or some word that turns up that seems just right. Sometimes it’s the number of syllables that controls the possible choices we can make. Sometimes it’s Grammarly telling us the word choice is not exactly helpful. So whatever we started off with is still up for grabs. : We can update here and there, and move verses around, just as I did a little while ago. I noticed something unusual about the first draft and realised I could use that. So I rearranged the verses to make that new idea happen, and really appreciated the extra time spent on doing something brand new. Word choice is not always the first choice. So we need to be open to developments we can see if we take a little more time editing and improving on what we wrote. : denismartindale—(co)—(uk) : ",
            "date": "Answered September 30, 2020",
            "views": "63",
            "upvotes": "0"
        }
    ]
}