{
    "title": "What are some ways to end an essay with a good and solid conclusion? - Quora",
    "tags": [
        "Conclusion",
        "Essays",
        "List Question"
    ],
    "response": [
        {
            "author_info": {
                "name": "Lindsay Welsh",
                "href": "/profile/Lindsay-Welsh-1"
            },
            "answer_text": "This is a good question. Writing conclusion is one of the hardest parts about composing an essay. The closing paragraph of your written piece should make the whole story complete and logical. That’s why it’s important to finish your paper strong. But before you start writing conclusion, there is one important thing to keep in mind. Conclusion is often confused with summary. Although there is a slight difference between the two notions but it does exist and influences the final result. While summary brings together all the ideas previously mentioned in the text, conclusion gives an answer to the unresolved questions. Here you are the first way to end your essay – answer the main question or suggest the solution to the issue you’ve been discussing in the text.Another way to end your essay strong is to give the readers food for thought. You may develop specific ideas into general ones or suggest the audience using your findings in practice.Closing the final passage on a positive note is also a good and efficient idea. Tell a joke or write an encouraging topic-relevant quote.Posing questions also works well. It makes your essay intriguing and close to the readers. It may also help you summarize your ideas and come up with a new understanding of them.You may also invite your readers to take action or warn them if your raise important issues in your essay.No matter what way you choose, remember to make your conclusion brief and topic-relevant. \u0004 ",
            "date": "Answered July 1, 2016",
            "views": "39",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Dodi Anderson",
                    "user_href": "/profile/Dodi-Anderson-1"
                },
                {
                    "user_id": "Brayden Klish",
                    "user_href": "/profile/Brayden-Klish"
                },
                {
                    "user_id": "Allen Thompson",
                    "user_href": "/profile/Allen-Thompson-8"
                },
                {
                    "user_id": "Mary Evans",
                    "user_href": "/profile/Mary-Evans-44"
                }
            ]
        },
        {
            "author_info": {
                "name": "Rishabh Khurana",
                "href": "/profile/Rishabh-Khurana-41"
            },
            "answer_text": "The ending i.e conclusion of any essay is as important as the opening i. e introduction. Conclusion is something without which topic can not be considered as complete topic. It should be written in an appropriate way . Now the question is what to write in conclusion…. There are number of things with which topic can be concluded that are written below: Your conclusion wraps up your essay in a tidy package and brings it home for your reader.Your topic sentence should summarize what you said in your essay . statement This suggests to your reader that you have accomplished what you set out to accomplish.Do not simply restate your essay statement, as that would be redundant Rephrase the thesis statement with fresh and deeper understanding .Your conclusion is no place to bring up new ideas.Your supporting sentences should summarize what you have already said in the body of your essay If a brilliant idea tries to sneak into the final paragraph, you must pluck it out and let it have its own paragraph in the body, or leave it out completely .Your topic for each body paragraph should be summarized in the conclusion Wrap up the main points .Your closing sentence should help the reader feel a sense of closure.Your closing sentence is your last word on the subject; it is your “clincher” Demonstrate the importance of your ideas Propel your reader to a new view of the subject End on a positive note .Your closing sentence should make your examiner glad they read your essay.Good Luck! ",
            "date": "Answered April 20, 2017",
            "views": "26",
            "upvotes": " View 15 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Donna Williams",
                    "user_href": "/profile/Donna-Williams-238"
                },
                {
                    "user_id": "Sergejs Ivanovs",
                    "user_href": "/profile/Sergejs-Ivanovs-1"
                },
                {
                    "user_id": "Pratikhya Sasmal",
                    "user_href": "/profile/Pratikhya-Sasmal-1"
                },
                {
                    "user_id": "Nishtha Dhingra",
                    "user_href": "/profile/Nishtha-Dhingra-10"
                },
                {
                    "user_id": "Shivani",
                    "user_href": "/profile/Shivani-441"
                },
                {
                    "user_id": "Ashish Antil",
                    "user_href": "/profile/Ashish-Antil-15"
                },
                {
                    "user_id": "DK Mandal",
                    "user_href": "/profile/DK-Mandal-10"
                },
                {
                    "user_id": "Abhishek Yadav",
                    "user_href": "/profile/Abhishek-Yadav-1834"
                },
                {
                    "user_id": "Nivea Sharma",
                    "user_href": "/profile/Nivea-Sharma-3"
                },
                {
                    "user_id": "Vipul Gupta",
                    "user_href": "/profile/Vipul-Gupta-365"
                }
            ]
        }
    ]
}