{
    "title": "What will happen to Adobe Flash dependent web sites and games after support ends next year? - Quora",
    "tags": [
        "Flash Development",
        "Flash Games",
        "Adobe Flash Player",
        "Adobe Flash",
        "Adobe Systems (company)"
    ],
    "response": [
        {
            "author_info": {
                "name": "Mike Milpot",
                "href": "/profile/Mike-Milpot"
            },
            "answer_text": "I think Flash has been disabled in Chrome (what I’m running) for quite some time. When I go to a site that uses Flash I see the plugin gray box in the flash box. And I’m not even sure about that, because it seems to be that Flash has been irrelevant for like 5+ years now. No professional sites have used it since then.But, I do recall all those game sites, and a lot of games were very cute. It’s sad to see all that effort not being immediately accessible anymore. So much creative work. Some of those games I’ve seen rematerialize in remakes in Android apps. Like sidescrollers with cars with suspensions having to drive across a 2D landscape, stuff like that. ",
            "date": "Answered January 4, 2019",
            "views": "34",
            "upvotes": " View 5 Upvoters",
            "upvoters": [
                {
                    "user_id": "Emmanuel Martínez",
                    "user_href": "/profile/Emmanuel-Martínez-12"
                },
                {
                    "user_id": "Lily Weisz",
                    "user_href": "/profile/Lily-Weisz-1"
                },
                {
                    "user_id": "Patrick Johnston",
                    "user_href": "/profile/Patrick-Johnston-74"
                },
                {
                    "user_id": "Nolan Willow",
                    "user_href": "/profile/Nolan-Willow"
                },
                {
                    "user_id": "Britt Tolbert",
                    "user_href": "/profile/Britt-Tolbert"
                }
            ]
        },
        {
            "author_info": {
                "name": "Alessandro Castiglione",
                "href": "/profile/Alessandro-Castiglione-1"
            },
            "answer_text": "Websites will just adapt to the change. They will rework their applications in order to run with Javascript instead of the old and clunky Flash. Maybe some games or animations will be lost, but this is it. I’m sorry since I have fond memories of playing Flash games, but it’s the ultimate truth. Something will be lost in the transition and left behind. ",
            "date": "Answered September 6, 2019",
            "views": "825",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Cindy Davis Burke",
                    "user_href": "/profile/Cindy-Davis-Burke"
                }
            ]
        }
    ]
}