{
    "title": "What's the secret of writing a great travel story? - Quora",
    "tags": [
        "Travel Writing"
    ],
    "response": [
        {
            "author_info": {
                "name": "Henry Vaughan",
                "href": "/profile/Henry-Vaughan-11"
            },
            "answer_text": "Purpose. Writing skill notwithstanding, the best travel stories always have some kind of mission behind them. They set out with a goal and accomplish something. Average travel writers tend to pick a spot and just wander around it forever, learning a lot but not really accomplishing much. In Dark Star Safari, Theroux was on a mission to retrace his journey through Africa. He reconnected with many of his old friends and was able to offer up many fascinating comparisons, showing “how it used to be.” He talked about being young and idealistic and how much he had changed in the years since. It was fascinating. People have this idea that wandering around aimlessly in another country automatically counts as having an adventure. Maybe. But if you want a story worth telling, you have to actually do something. Otherwise you're just on vacation. Love a woman. Face demons. Fight a battle. Change yourself. Pour into something. Overcome insurmountable obstacles. Do something. ",
            "date": "Answered February 9, 2018",
            "views": "215",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Jerri McInerney",
                "href": "/profile/Jerri-McInerney"
            },
            "answer_text": "If you have not travelled, you do not write on traveling. So, you need to have actually traveled, the more trips, the more places, the more people you interact with gives you a trove of information to write from. Going places with various types of people who act in different ways, visiting places with unique cultures you have no previous knowledge of, using many ways of transport, all matter. The secret is variety of experiences to draw stories from. ",
            "date": "Answered February 15, 2018",
            "views": "110",
            "upvotes": "0"
        }
    ]
}