{
    "title": "What are some of the best ways to non-monetarily reward and recognize employee performance? - Quora",
    "tags": [
        "Employee Rewards",
        "Employee Recognition",
        "Employee Performance",
        "Human Resource Management",
        "Human Resources",
        "Management",
        "Understanding Self-Improvement",
        "List Question"
    ],
    "response": [
        {
            "author_info": {
                "name": "Alex Grande",
                "href": "/profile/Alex-Grande"
            },
            "answer_text": " At Recognize - Social employee recognition & rewards we help a lot of companies create a non-monetary reward program. Recognize’s philosophy from the beginning was to provide a non-monetary program. We believe if staff are begging for gift cards and bonuses, then you need to pay staff more! Ways to recognize and reward staff: Give badges to staff symbolic of great work and behaviors at your company without any monetary aspect tied to them.Use an above & beyond program to have staff vote for employees of the quarter in specific attributes, such as innovation or safety.Gamification suggests Status, Access, Power, and Stuff (SAPS) for ways to motivate players.Status: job title or additional job titles, such as Innovation Strategist.Access: Access to a special parking spot, conferences, or take the boss’s office.Power: Power to make a special decision or be apart of a committee that makes the organization better.Stuff: Considered the most expensive and least effective in gamification is giving stuff or cash.Give rewards that are non-monetary. In Recognize, you can create any kind of reward you want. Popular rewards are paid time off and donate to charity.Recognize generates award certificates based on recognition and has a hall of fame of the top employees across time period and across badges (symbolic of company values). Companies love to print the award certificates and putting them on the wall.Recognize has a kiosk mode for those social employee recognitions. Company’s use that in their lobbies or breakrooms.A few of our customers at Recognize look at the points staff earn in Recognize, and have the top earners each month get together for a cooking class and drinks afterwards. In Recognize, points can be monetary or they can be non-monetary. It is your decision.Probably one of the most popular ways right now is the charity aspect. Staff feel good for being recognized and they feel even better that they can then give to charity for doing good work. Read our 101 employee recognition and rewards ideas from monetary to non-monetary. ",
            "date": "Updated March 28, 2018",
            "views": "403",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Jay Kang",
                    "user_href": "/profile/Jay-Kang-18"
                }
            ]
        },
        {
            "author_info": {
                "name": "Tejas Thakkar",
                "href": "/profile/Tejas-Thakkar-1"
            },
            "answer_text": "Recognising a job well done and rewarding hard work is key to keeping morale and motivation high. When an employee or team achieves outstanding results, big or small, it’s time to say thank you to reward and recognize their great work. Following are the few things companies should do to recognise and reward employees for their hard work: One of the best ways to reward employees for their hard work is to simply give them the opportunity to work the way they want to workTry to make the rewards more personal and meaningful by investing some extra time to get to know your employees on a personal level. This will help in keeping the fire of motivation burning long and strong within your employeesTeam members work very closely with each other and if they are encouraged often by praising and recognizing their efforts then the mood of the organisation can stay positive and productivity will flourish. In simple terms, enhanced teamwork can come as a result of recognition for team performanceEmployee Appreciation and Recognition Ideas ",
            "date": "Answered January 6, 2018",
            "views": "106",
            "upvotes": "0"
        }
    ]
}