{
    "title": "What are ethical issues in data mining? - Quora",
    "tags": [
        "Ethical Issues",
        "Data Mining",
        "Ethics"
    ],
    "response": [
        {
            "author_info": {
                "name": "Orhan Karsligil",
                "href": "/profile/Orhan-Karsligil"
            },
            "answer_text": "There are many. Some are purely ethical some are technical and some are borderline illegal or violate regulations. A few examples: Years ago Netflix had a challenge for machine learning (more than 10 years ago I believe). They wanted scientist to find new ways for their recommendation engine. They anonymized people’s ratings of movies and zip codes if I remember it correctly. So you could compare someone else’s ratings with this data and then recommend other movies that they might like. That challenge kicked off a new era of machine learning and data science. One unintended consequence was that people merged it with other databases (facebook, imdb, geolocation data and their personal data) and were able de-anonymize some of the people in the data set.Lesson: Controlling the data you release ( anonymizing etc) is not enough.Biostatistical analysis of clinical trial data is a heavily regulated task. Every analysis must be prescribed and approved/documented before data is released for analysis. You cannot look at data and then do your analysis. This is designed to avoid bias. This also prevents fishing for patterns. Correlations and causality get mixed up during most post-hoc analyses. But posthoc analysis is needed to design the next clinical trials. One ethical issue that comes up is what happens if you find patterns in the data that hints towards a problem with the drug (safety, toxicity, efficacy). The pattern might be a fluke, it might not be. Investigating every patterns is very costly, so sometimes people brush “unwanted” patterns under the carpet. Most of the times that is not a problem since the pattern is not real, but sometimes a real signal is ignored and people get harmed.Lesson: If you are going to do post/ad hoc analysis you cannot ignore the patterns you find. You have to investigate negative results as aggressively as the positive ones.Insurance companies collect data from many different sources. They merge them in many different ways to calculate risk (expected lifespan, weather patterns for farming insurance, car accidents etc). They then calculate premiums based on that risk. The better/more data they have the better can they price the risk and the more they can manage their profits. When/if DNA analysis companies start selling anonymized data to insurance companies they will be able to include it into their risk analysis. There will be a lot of biases, a lot of mistakes. On average nothing will change but there will be biased shifts in premiums in subgroups.Lesson: If your data belongs to a subgroup even if you do not share every characteristics of that subgroup you might be negatively impacted.Bias is introduced at every level (selection, confirmation etc). People recommending that humans should be involved in decision making process should also note that people have the most bias. Errors happen of course and some are more obvious then others but humans are permanently biased. They create algorithms that are biased too. Microsoft’s chat bot that became racist, or HR resume/candidate screening applications that discriminate based on age/gender etc are some of the many examples.Lesson: It is really hard to avoid bias. It is rather easier to develop techniques/checks to identify it. Critical thinking should be a mandatory class.Humans are not good with probability. There is this famous case in California about a woman who lost two kids to SIDS (they died during their sleep) When she lost the first child it was argued that the chances of this happening is 1/8000. When her second child died from the same cause as well the court argued that two children dying from the same symptom is 1/8000 x 1/8000 a very slim chance. Expert’s testimony indicated that because of this very low probability this happening the mother must be guilty. This whole discussion would not happen if they knew what probabilities meant. Obviously those events were not independent. Other than their mother as cause for their death the kids also shared similar genetic makeup and that made them susceptible to SIDS.Lesson: People need to learn probability well before making sense of data mining results.Correlation does not mean causality. Kids with bigger thumbs read better, but not because their thumbs are bigger but because they are older. Villages with more stokes on chimneys have more babies but not because stokes bring the babies but because larger villages have more babies and larger villages have more chimneys. In simple examples it is very easy to spot these kind of spurious correlations but when data gets larger, connections become more complex and algorithms used become more opaque it is hard to detect them. Then you hear claims like interest rates cause inflation.Lesson: Always question causality vs correlation.There is no easy cure for these problems. Better education, better tools, better regulation and best practices over time might make the issue less troublesome. GDPR (consent driven use of data) for example is a good way to prevent some misuses of data. I predict there will be a lot of misery due to data mining before anything is done about it (Weapons of Math Destruction is an interesting book about these and similar problems ) ",
            "date": "Answered October 13, 2018",
            "views": "55",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Piyush Thaware",
                    "user_href": "/profile/Piyush-Thaware"
                },
                {
                    "user_id": "Prathamesh Khare",
                    "user_href": "/profile/Prathamesh-Khare-1"
                },
                {
                    "user_id": "Alexey Smirnov",
                    "user_href": "/profile/Alexey-Smirnov-12"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/Sri-958"
                }
            ]
        },
        {
            "author_info": {
                "name": "David Hall",
                "href": "/profile/David-Hall-594"
            },
            "answer_text": "Any kind of data is the property of a person or some other entity, such as a company or organisation. Data mining, as the term may suggest in contexts where ethical issues may arise is the collection, or mining, of data for its potential commercial value. That data may be personally identifyable information about ourselves that could be used for activities such as the sale of targeted advertising, or the data could be valuable commercial intellectual property of a company or business. In both cases, data is being collected for purposes that we do not genuinely give consent for the data being collected to be used for. We may tick a check box on a web page stating we consent to whatever the conditions of use of the website are, but genuinely almost everybody would not give consent to our personal information being used to target us with advertising, and genuinely not give consent to receiving spam emails if giving consent to these were not conditional on receiving some other service. I suppose targeted advertising and targeted spam could be considered in the same ethical context as broadcast and print media advertising. In and of themselves, targeted ads are not much of an ethical concern if a company with which you have an established business relationship is using information about the business relationship they have with you to market their products to you. That kind of thing has been happening since long before the advent of Internet data mining. Traditional advertising is impersonal. It has no connection to any individual. It simply repetitively spews out the message to the masses hoping to catch a fish, so to speak. But the ethical concern is that personal information about us is being collected for its resale value. Companies, and I use the examples of facebook and Google, are collecting masses of information about us and we don’t really know what other companies that information is being shared with. Much of that data could contain sensitive information about us an individual, which maybe could be found if someone decided to go looking. We know that Google and facebook can not control data that they have collected about us once it has been released into the wild. We don’t know what other companies are collecting the data, by web scraping, that facebook is publishing about us. Today, huge amounts of personal data is being traded for serious money. We don’t even really know if that data has any genuine commercial value. Advertising is a weird beast. It works by repetition, not by hitting the bullseye. We see thousands of products each day that we might like but choose not to buy. Target advertising is probably likely to be much the same. We may see heaps of targeted ads each day, we are not going to respond to all of them, if indeed we respond to any online ads. We tend to just ignore them mostly. Targeted advertising is expensive, it needs to work if the mined data is to be commercially valuable. The most successful advertising sells a brand association, not products. Think of ads from some of the most successful companies, like McDonalds. They portray imagery, lifestyle and experiences. They rarely hard sell hamburgers. ",
            "date": "Answered December 24, 2019",
            "views": "14",
            "upvotes": "0"
        }
    ]
}