{
    "title": "What are some good examples of a formal letter? - Quora",
    "tags": [
        "Writing Letters"
    ],
    "response": [
        {
            "author_info": {
                "name": "Claude Baudoin",
                "href": "/profile/Claude-Baudoin-1"
            },
            "answer_text": "Let’s assume that by “formal letter” we mean a letter written to someone in an official capacity, someone who has some authority over something you care about, like a request to a company executive or someone in an administration; or, conversely, a letter written to an applicant or a student to convey an official decision of some importance. I think there are several aspects to such a letter, perhaps more than what you were just thinking about in your question: Appearance: the letter is well formatted, preferably typed and printed on a computer. The date, name and address of the recipient, name of the sender, her/his contact information, and handwritten signature appear in all the proper places, which vary by country.Language: the grammar is perfect, there are no misspellings, sentences are complete, abbreviations and contractions are not used (“do not” instead of “don’t”, etc.)The body of the letter starts with a salutation: “Dear Mr. Johnson,” or “Sir/Madam,” or similar. If the recipient has a title (Hon., Dr., Prof., etc.) it is used. The correct title is more important in certain cultures than in others (Spain and Latin America, Italy, Germany in particular). Certainly not something like “Hello”.The letter then explains the reason why it is being sent, provides relevant information, and concludes with what the recipient is expected/requested to do, or what the sender commits to do. All of this as concisely as possible, but clearly, and divided into nice paragraphs of a few lines each. Often, one offers in the conclusion to provide more information, to have a phone conversation to clarify anything that might require it, etc.The letter ends with a closing salutation, something like “Yours sincerely,” “Best regards,” “Thank you in advance for your attention to this matter,” etc. Some countries and languages have typical formulas to use there, such as “I beg you, dear Sir, to believe in the expression of my distinguished consideration” (don’t laugh, this is the literal translation into English of a typical concluding sentence in a French formal letter), or “I remain attentive to your orders” (typical ending of a Mexican Spanish letter).Formality has evolved over time. For example, that convoluted French ending is less and less used. Instead, it is more and more acceptable to end with just “Distinguished salutations,” which is still quite formal, or “Cordially,” which is more casual but still polite and doesn’t imply (as it might sound to you) a fake presumption of closeness to the recipient. You may have only been asking about points 3 and 5. You have to think of the entire impression it will make on the reader — not just the salutations. ",
            "date": "Answered March 27, 2018",
            "views": "24",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Shreya Srivastava",
                    "user_href": "/profile/Shreya-Srivastava-423"
                }
            ]
        },
        {
            "author_info": {
                "name": "Mark Hasleton",
                "href": "/profile/Mark-Hasleton"
            },
            "answer_text": "Mr Baudoin's answer is a good one. I would add that When we start the letter with Dear sir or Dear madam , we finish it with Yours faithfully ; when we start with Mr/Ms + surname it's yours sincerely ; and when we start with the person's first name , we finish with something less formal such as ‘ regards' or ‘cheers ‘ . ",
            "date": "Answered January 5, 2019",
            "views": "206",
            "upvotes": "0"
        }
    ]
}