{
    "title": "What type of writing is journal writing? - Quora",
    "tags": [
        "Diaries and Journals",
        "Writing Advice"
    ],
    "response": [
        {
            "author_info": {
                "name": "Michael Gorman",
                "href": "/profile/Michael-Gorman-12"
            },
            "answer_text": "We get the term: Journalist from this root word of ‘journal’, back in the old days it became a convention to keep a daily account of one’s travels, experiences, to record your experiences and the events of your daily life. Being a ‘diary writer’, this evolved over time to becoming a professional practice. This is how newspapers began, with journal writers becoming popular and contributing to magazines, and broadsheet news organisations; it was a way for writers who were skilled in different areas to present their work. Over time, newspapers and magazines began to employ journal writers as being regular contributors to their publications, and ‘Mastheads’ of teams of writers, and their editors became the accepted convention. A Journal is a daily account, a daily recording of observations, analysis, and thoughts. The origins of journal writing form the history of journalism. So we can see that the profession of journalism evolved out of this daily keeping of journals for different professions, and subject areas. The development of journal writing evolved into a craft, an accepted way of presenting different accounts for different subjects. Today, with the WWW, we have a much more accessible medium for publication; people who have a talent for writing, and who might be skilled in various areas can present their work directly to the reading/watching public, and the public can decide if they choose to accept their work, or not. The gatekeepers of journal writing have been effectively bypassed. We can see that journalism has undergone a significant change, what you choose to read and listen to is your own affair, so it is with journal writing which has grown into forms we recognise today as: BloggingVloggingPodcastingAll of these ‘new’ types of media production are forms of journalising. New Journalism ",
            "date": "Answered October 15, 2020",
            "views": "42",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Michael J. McFadden",
                    "user_href": "/profile/Michael-J-McFadden"
                },
                {
                    "user_id": "Roksana Parvin Yasmin",
                    "user_href": "/profile/Roksana-Parvin-Yasmin"
                }
            ]
        },
        {
            "author_info": {
                "name": "Donna Williams",
                "href": "/profile/Donna-Williams-238"
            },
            "answer_text": "If you mean an individual’s own personal journal, the type of writing would most likely be narrative (about your day) or personal (your feelings about something). Why not study famous journals of this type, such as Anne Frank’s and see what they do? ",
            "date": "Answered October 15, 2020",
            "views": "12",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Roksana Parvin Yasmin",
                    "user_href": "/profile/Roksana-Parvin-Yasmin"
                }
            ]
        }
    ]
}