{
    "title": "What are some good examples of 'fight with oneself'? - Quora",
    "tags": [
        "Understanding Romantic Relationship Dynamics",
        "Fighting",
        "List Question",
        "Important Life Lessons",
        "Understanding Human Behavior",
        "Philosophy of Everyday Life",
        "Human Behavior"
    ],
    "response": [
        {
            "author_info": {
                "name": "Suryasis Hirok Paul",
                "href": "/profile/Suryasis-Hirok-Paul"
            },
            "answer_text": "Man is akin to white light ,though he is supposed to be singular and indivisible he is actually a myriad of several colors.Several colors superimpose to make up a personality. Any kind of superposition necessarily leads to conflicts. So in daily life we do arrive at many crossroads where there is a “fight with oneself”. I will dish out some real life examples rather than delving into impractical philosophical bedlam. 1.Addictions Be it smoking or drinking . With every puff you breathe in or gulp you take in you have to kill a soul yearning not to do it. We often tend to ignore the inner voices and go ahead with fun and frolic. 2.Women You see a damsel across the street. You think about an approach. You weigh the pros and cons. Something within you tells you that she is awesome. Then suddenly there is another voice which tells you that she is way beyond your league. You know it may go horribly wrong. But then you also tell yourself “No risk ,no gain”.Now its your call really. (I often take a chance . But that is a different story.) Situation 2 : She is clearly not into you. But you like her like hell. You strike up a conversation. Befriending her is not too difficult as she is naturally jovial.You should not be talking to her at all. It is vile . Now that you have befriended her and she has maintained her stand.You don’t understand whether to persist or let go. Situation 3: There are two women. The one who likes you and the one whom you find awesome. And between them you are torn. 3.Career You want to be a writer or scriptwriter or bureaucrat or a lead for a famous band. Your idea of an awesome life does not even loosely fit in with a 9–5 IT job. Yet there is a money-whore within you that says otherwise. You know what I am talking about,don’t you ? 4.Leap of Faith Your son comes up to you to tell that he does not want to continue in an IT job. He says he is interested in other better things in life and he needs your support. You are well aware that this is something your son is meant to do. But you are also well aware his path is one beset with difficulties. You have seen failures in life (Failures because you chose an off-beat career ). People with no real capability are doing so much better in their lives than you. Would you take a leap of faith ?? 5.The Evil Mind Wait !!! What is this girl up to ?? She ain’t my girl anyway. I am not supposed to be sent the pics which I am being sent. Inside you there is an animal yearning for carnal desires. It says that you should not be caring about your friend or her girl . After all that is survival of the fittest. Yet each time you decide to resort to moral bestiality , you remember the good times that you and your friend had spent. The moments of camaraderie that you had shared. You are left stranded between moral and natural compulsions. 6. Self-explanation Its the start of a year. You decide that you would do something about your physical fitness. You decide that you would consider running seriously. You would wake up 6 AM in the morning and start your day by running. The alarm bell rings the next day , and voice is heard. “It’s too early man.You don’t earn money by loosing tummy fat. Do you ? Yesterday was a hard day . You have to be active for the rest of the day. Be generous to yourself.”By the time you realize that the voice has drowned it’s already 10 AM! At all such moments of weakness one can resort to listening to their conscience . There are many voices that may be heard , if we care . But there is one particular still small voice that is always calling clear and true. Take time to listen ,have courage to obey. ",
            "date": "Answered October 20, 2016",
            "views": "16",
            "upvotes": " View 14 Upvoters",
            "upvoters": [
                {
                    "user_id": "Kannan Nadar",
                    "user_href": "/profile/Kannan-Nadar-1"
                },
                {
                    "user_id": "Anwesha Chakraborty",
                    "user_href": "/profile/Anwesha-Chakraborty-27"
                },
                {
                    "user_id": "Grw",
                    "user_href": "/profile/Grw-1"
                },
                {
                    "user_id": "Naseer",
                    "user_href": "/profile/Naseer-16"
                },
                {
                    "user_id": "Ram K Reddy",
                    "user_href": "/profile/Ram-K-Reddy"
                },
                {
                    "user_id": "Ravi Garg",
                    "user_href": "/profile/Ravi-Garg-3"
                },
                {
                    "user_id": "Alka Majhi",
                    "user_href": "/profile/Alka-Majhi"
                },
                {
                    "user_id": "Soumik Bhattacharyya",
                    "user_href": "/profile/Soumik-Bhattacharyya-1"
                },
                {
                    "user_id": "Atal Fan",
                    "user_href": "/profile/Atal-Fan"
                },
                {
                    "user_id": "Pallabi Mandal",
                    "user_href": "/profile/Pallabi-Mandal-2"
                }
            ]
        },
        {
            "author_info": {
                "name": "Venkat Nadapana",
                "href": "/profile/Venkat-Nadapana"
            },
            "answer_text": "Thoughts I'll tell you four of the best sayings on \"thoughts\" that I have come across before moving onto the actual question. I shall add more of these later.    What lies behind us and what lies in front of us pales in comparison to what lies within us - Waldo Emerson Today's thoughts build tomorrow's dreams.  Whatever the mind can cconceive, it can achieve - Napoleon Hill Man is made or unmade by himself. In the armoury of thought he forges one weapons by which he destroys himself - James Allen On an average day, the average person thinks 60,000 thoughts. Out of these 60,000 thoughts 95% of them are the same ones you thought the day before. This is what is Limited thinking. But in my case, I call it negative thinking.  Most of my thoughts on a daily basis varies from the ground level to the sun and beyond kind of thoughts and out of these, about 40-50% are negative or bad thoughts, where they sap out all energy or life out of me. These lead to a lot of stress and uneasiness which takes a great deal of effort to overcome.  So, this, for me is my biggest fight with myself scenario, and I do it everyday. My trick now is simple: Do not think thoughts that are negative or disempowering for it can suck your energy out. Instead, think of the good things that happened yesterday, think about the position you are in, that you're better off than someone less fortunate. Friends, family, your pet or it can be anything. Focus only on your positive dreams and what you want in life and you will see a great change in your life. You will get what you want in life, no doubt about that. Just Make this a habit.  Every time a negative thought seeps into your mind, quickly replace it with a good thought, a thought that can energize you and motivate you. You cannot afford the luxury of even one negative thought for it can lead you to nowhere or even ruin you. For every negative thought, you attract something negative into your life. Its a simple \"law of attraction\". What you think, you get.  As for me, I'm a long long way from my destination of mastering my mind's thoughts. It's a gradual process. But I know I will get there, eventually.  Thanks! ",
            "date": "Answered July 2, 2015",
            "views": "16",
            "upvotes": " View 6 Upvoters",
            "upvoters": [
                {
                    "user_id": "Madhuri Gadhave",
                    "user_href": "/profile/Madhuri-Gadhave-1"
                },
                {
                    "user_id": "Ujjwal Dalmia",
                    "user_href": "/profile/Ujjwal-Dalmia"
                },
                {
                    "user_id": "Kiran Yakkala",
                    "user_href": "/profile/Kiran-Yakkala"
                },
                {
                    "user_id": "Kanna Venkata Raghavendra Karthik",
                    "user_href": "/profile/Kanna-Venkata-Raghavendra-Karthik"
                },
                {
                    "user_id": "P. Monalisha",
                    "user_href": "/profile/P-Monalisha"
                },
                {
                    "user_id": "Subbu Naidu",
                    "user_href": "/profile/Subbu-Naidu"
                }
            ]
        }
    ]
}