{
    "title": "What are some of the best psychological thriller novels? - Quora",
    "tags": [
        "Thriller (genre)",
        "Lists of Novels",
        "Book Lists",
        "Novel Recommendations",
        "Novels",
        "List Question",
        "Book Recommendations"
    ],
    "response": [
        {
            "author_info": {
                "name": "Shishir Kaul",
                "href": "/profile/Shishir-Kaul-1"
            },
            "answer_text": "The Silence of the Lambs by Thomas Harris Even if you've already seen the movie, you must read the book. It's simply a masterpiece.   Gone Girl by Gillian Flynn I've been a Flynn fangirl since Sharp Objects came out in 2006 and I will read anything, literally anything, she puts out next. I bet even her grocery lists are dark and twisted.  Rebecca by Daphne du Maurier Haunting and atmospheric, this gothic novel is a psychological thriller classic.  I Know What You Did Last Summer by Lois Duncan Of course Lois Duncan, the Queen of teen thrillers, has to be on this list!  Defending Jacob by William Landay A chilling psychological thriller about a lawyer whose 14-year-old son is accused of murder. You won't be able to put it down, and then you won't be able to get it out of your head.  Shelter by Harlan Coben I could have chosen any of Harlan Coben's thrillers, I've loved them all. He is the master of the twist. But I went with Shelter, his first foray into the world of YA.  A Simple Plan by Scott Smith Three men stumble upon the wreckage of a small plane, a dead pilot, and a bag full of four million dollars. In deciding to keep the money, the three embark on a plan that, as the twists unravel, becomes anything but simple.  Before I Go To Sleep by S.J. Watson Another novel that plays with memory. The heroine wakes each morning with amnesia...and no idea who she can trust. See it before the movie (starring Nicole Kidman) comes out next month!  Shutter Island by Dennis Lehane With its 1954 setting in an isolated hospital for the criminally insane, this book will make you question reality.  See Jane Run by Joy Fielding Jane finds herself standing on the street, dress drenched with blood, pockets full of money, and her memory...completely blank. I read this book is one sitting back in 1991 and it has stuck with me as one of my favorites. ",
            "date": "Answered October 29, 2016",
            "views": "88",
            "upvotes": " View 21 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Ravikanth Garimella",
                    "user_href": "/profile/Ravikanth-Garimella-2"
                },
                {
                    "user_id": "Hande Gokbas",
                    "user_href": "/profile/Hande-Gokbas"
                },
                {
                    "user_id": "Meesam Naqvi",
                    "user_href": "/profile/Meesam-Naqvi-7"
                },
                {
                    "user_id": "Neeramitra Reddy",
                    "user_href": "/profile/Neeramitra-Reddy"
                },
                {
                    "user_id": "Sidharth Sabat",
                    "user_href": "/profile/Sidharth-Sabat"
                },
                {
                    "user_id": "Gaurav Muley",
                    "user_href": "/profile/Gaurav-Muley"
                },
                {
                    "user_id": "Harshitha Bandaru",
                    "user_href": "/profile/Harshitha-Bandaru-2"
                },
                {
                    "user_id": "Casey Bates",
                    "user_href": "/profile/Casey-Bates-3"
                },
                {
                    "user_id": "Madhuri Vadla",
                    "user_href": "/profile/Madhuri-Vadla-4"
                },
                {
                    "user_id": "Chelly Tavar",
                    "user_href": "/profile/Chelly-Tavar"
                }
            ]
        },
        {
            "author_info": {
                "name": "Mitul",
                "href": "/profile/Mitul-19"
            },
            "answer_text": "The psychological thriller, a sub-genre of thriller books that explores the psychology of its characters, who are often unstable. What makes a thriller psychological is that the most important questions of the story are about the minds and behavior. Psychological thriller books often incorporate elements of mystery and include themes of crime, morality, mental disease, drug abuse, multiple realities or a dissolving sense of reality, and unreliable narrators. Here is a list of hair-raising psychological thriller books that are perfect for anyone who wants to mess with their mind. The Woman in the Window by A.J. FinnPublication Year: 2018 The Woman in the Window is intoxicating, dark, and simply unputdownable. A J Finn’s debut novel is placed in current day, gentrified Harlem, New York City, where Dr. Anna Fox spends her day in her five-story townhouse drinking Merlot, spying on her neighbors, and mixing pills to numb her thoughts. She has theories and pseudo-storylines for her neighbors, each one being unique and different in their own way. When she is not photographing and spying on her neighbors, Anna watches famous black and white movies to pass the time and regularly checks in with her daughter and husband, who she recently has separated from. Anna suffers from agoraphobia, preventing her from leaving the confines of her house and limiting her ability to experience the real world effectively. Her hours, days, and weeks are consumed by fear and curiosity. When her new neighbors move in across the park from her house, Anna is intrigued at their anonymity. As she begins to investigate the story of her new neighbors, something horribly goes wrong. Anna witnesses something that shouldn’t have happened—or did she? The Woman in the Window breaks away from the mold of some of the more recent psychological thriller books that have been sprouting out more and more. This type of psychological thriller really gets you in the mindset of Anna’s psyche without throwing everything at you at once. Behind Closed Doors by B.A. ParisPublication Year: 2016 The book begins with an interesting way to introduce ourselves to the Angel, Jack and Grace, a couple with little time married, but perfect in every way. Perfect house well decorated, attentive and affectionate husband and wife, the perfect hosts, the food cooked to perfection by Grace, who is thin but not deprived even of dessert. So much perfection is suspicious. The guests are two couples, one known to Jack, Diane and Adam, the other is new to the neighborhood, Esther and Rufus. From the beginning Esther doubted of so much perfection and it was wonderful that someone could do it, since everyone, Diane the first, adored all the perfection of the couple. Perhaps what sets this one apart from many other psychological thriller books is that the author does not rely on gratuitous violence to either advance the plot or put the reader on edge. That is not to say that the fear is not real, because it is, very much so. Here though the source of this fear lay more in psychological manipulation and physiological deprivation. The Girl on the Train by Paula HawkinsPublication Year: 2015 This book has all the elements of a modern whodunit: a missing woman, adultery, an unreliable narrator and unlikable characters. There is also a train, which is a nice homage to Agatha Christie and Alfred Hitchcock. Three women, three men, connected through marriage or infidelity. Each is to blame for something. But only one is a killer in this nail-biting, stealthy psychological thriller about human frailty and obsession. The story is told through the eyes of Rachel, Megan and Anna, but mostly through Rachel’s in alternating chapters. Rachel commutes on the train everyday and the story centers around homes and people she sees out the window. I mean, after all, Rachel used to live on that street and can see her old house as she passes by. She makes up stories about these people’s lives, enough to even give them names. Rachel is what one may refer to as a “hot mess” and her life is a mystery. This book is full of flawed characters and it was really hard to know which ones to trust. If you like to read well written psychological thriller books, you won’t regret picking this page turner and plot driven book. Gone Girl by Gillian FlynnPublication Year: 2014 Gone Girl is as much a character study as an out-and-out thriller. The married couple at the center of the story, Nick and Amy, are as vivid as any real-life Nick and Amy. The narrative unfolds half in Amy’s voice and half in Nick’s. This technique not only allows for a full portrait of both characters but draws out suspense very nicely–and Gone Girl is a highly suspenseful story. Particularly impressive is how manipulative Gillian Flynn is, asking her reader to feel a variety of ways toward her characters. It’s not often that feelings toward characters change so utterly. The plot is very tightly organized–strikingly so–and punctuated with dozens of crucial not-so-little details. All the while, Gillian Flynn kept manipulating as often as possible. Most notably, in one pivotal moment, the story transforms from a mystery-thriller unfolding in a straightforward manner to an inverted mystery that turns everything on its head. Gone Girl is one of the best psychological thriller books you can get your hands on. Dark Places by Gillian FlynnPublication Year: 2009 Dark Places tells the story of Libby Day, the only survivor of the massacre that killed her mother and two sisters 25 years ago. Her testimony threw the blame on her then 15 year old brother Ben, who got sentenced to life in prison. However, the involvement of a freelance group of people interested in the murders starts throwing doubt on Ben’s guilty verdict and they drag Libby in, to try and uncover the truth. The story alternates between the present day, when Libby is in her 30s and has been living a shiftless life, and the day before the murders in 1985. In the present, Libby meets a group of true crime enthusiasts who think Ben is innocent, and she agrees to track down some people from her hometown and ask them about what really happened that night. The flashback chapters tell the story from both Ben’s and the mother’s point of view. Shutter Island by Dennis LehanePublication Year: 2003 Shutter Island is a creepy psychological mystery thriller by Denis Lehane, and book will have your skin crawling long after you finish it. This book is full of twists and turns and really packs a punch. The year is 1954. U.S. Marshal Teddy Daniels and his new -partner, Chuck Aule, have come to Shutter Island, home of Ashecliffe Hospital for the Criminally Insane, to investigate the disappearance of a patient. Multiple-murderess Rachel Solando is loose somewhere on this barren island, despite having been kept in a locked cell under constant surveillance. As a killer hurricane bears relentlessly down on them, a strange case takes on even darker, more sinister shades–with hints of radical experimentation, horrifying surgeries, and lethal countermoves made in the cause of a covert shadow war. No one is going to escape Shutter Island unscathed, because nothing at Ashecliffe Hospital is remotely what it seems. Then She Was Gone by Lisa JewellPublication Year: 2018 Ellie Mack went missing 10 years ago. Her mother, Laurel has never given up hope of finding her. Ellie was fifteen years old, full of life. The world was, in fact, her oyster. No one knew what happened to Ellie. The police have never found a trace of her. Now, Laurel Mack’s life is very different: her marriage fell apart years ago and her relationship with her remaining children is tenuous. Somehow, she meets Floyd – a devastatingly handsome man and she is immediately swept off her feet. Then Laurel is introduced to his little girl: Poppy, and she is dumbfounded to discover that Poppy bears a striking resemblance to Ellie, her Ellie. Laurel begins questioning everything and those questions take her on a dangerous path, one she never envisioned. What unfolds thereafter is brilliant, stunning and packs one heck of an emotional punch. Lisa Jewell’s Then She Was Gone is a phenomenal psychological thriller that will keep you enthralled throughout. Into the Darkest Corner by Elizabeth HaynesPublication Year: 2007 Into The Darkest Corner by Elizabeth Haynes is a great psychological thriller about an abusive relationship that occurred in the past. Four years ago Cathy fell for Lee who is equal parts good looking, intense, and charming. From that point on her life slowly turns into hell. We meet Cathy in the present, four years after her time with Lee. She’s basically a mess with severe obsessive compulsive disorder stemming from a trauma we have yet to discover. Cathy adheres to a strict routine of going to work and coming home with much of her free time spent checking and re-checking her apartment for breaches in security. Alternating chapters take us back to the past, four years ago and we slowly witness the events that brought Cathy to this point in her life. The tension mounts both in the present and in the past as the chapters tick on by. Lee exacts psychological terrors on Cathy as well as physical, making her a wreck little by little. Behind Her Eyes by Sarah PinboroughPublication Year: 2017 Behind Her Eyes by Sarah Pinborough is everything I look for and more in a psychological thriller books. It is menacing, chilling and gripping in equal measure. The characterisation is absolutely spot on, and the plot is just stellar. We meet Louise, a single mum who on a night out meets the charismatic David. They steal a kiss and leave it there until she next goes into work. David turns out to be her new boss. Next we meet Adele, David’s enigmatic and startlingly beautiful wife. A woman who on the surface appears to have everything yet underneath gives the impression that much is wrong. Louise for one reason or another finds herself entangled between the couple and much of the book revolves around this. The tension is palpable and Pinborough does well eking out the psychological thriller aspect. In a Dark, Dark Wood by Ruth WarePublication Year: 2015 In a Dark, Dark Wood by Ruth Ware is a psychological thriller about friends who get together to celebrate the “ho den” (bachelorette party) of Clare at an old cottage in the woods. A few still get together regularly: good friends Clare, her best friend Flo, Melanie and their friend Tom and the other invitees, who haven’t seen Clare in years: Nina and Nora. And no one except for Clare and Nora know what happened 10 years ago, which effectively broke up their friendship. This weekend however, Flo has plans to make Clare’s ho den the best weekend of her life and won’t let anyone or anything ruin it. Little does she know, nothing is within her control. Within a matter of hours, both Nina and Nora regret their decision to attend but can’t escape, much to their chagrin. If only the shocking revelation that Clare is marrying Nora’s childhood sweetheart, James (who Nora can’t seem to get over), was the most important thing she should be worried about. The setting (glass house in the woods, my worst nightmare) as well as the writing made it atmospheric and creepy, the characters made the story really come to life and the unreliable-narrator-aspect was handled very well. ",
            "date": "Answered June 24, 2020",
            "views": "14",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Anushree Saha",
                    "user_href": "/profile/Anushree-Saha-42"
                }
            ]
        }
    ]
}