{
    "title": "What is the use of a content delivery system? - Quora",
    "tags": [
        "Content Delivery Networks (CDNs)",
        "Computer Networking"
    ],
    "response": [
        {
            "author_info": {
                "name": "Eileen Winston",
                "href": "/profile/Eileen-Winston-1"
            },
            "answer_text": "Content Delivery Network is generally known as CDN, which is nothing but the network that provides users with alternative server nodes so that they can download resources faster. It has been seen that static content such as images as well as JavaScript take long time to download. These nodes help in downloading this static content faster. CDN uses nodes, which are located in different parts of the world. When a person located in one part of the world asks for certain information, the same is fetched from the nearest node of that network (i.e. from a localised node) and not from the main server that is located in another part of the world.  An example will help you understand the matter lucidly. Suppose, there is a person working from his laptop in Ireland. Now, suppose the main server of that person’s hosting provider is located in the USA. In normal circumstances the data or content would have been fetched from the server that is located in the USA. It would have taken a lot of time. However, when the same is fetched from a localized server, say located in London, then the information will be delivered to the end user at a significantly faster pace. This is one of the main reasons why you should use CDN or Content Delivery System. Other beneficial aspects for you to use CDN include – Availability of different domainsPre-cached filesData centers are distributed, leading to faster delivery of contentHigh capacity infrastructure is availablePerformance gets boosted significantly and at the same time the arrangement drives down costAvailability of analytics",
            "date": "Answered July 19, 2017",
            "views": "11",
            "upvotes": " View 7 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Manish Kumar",
                    "user_href": "/profile/Manish-Kumar-4644"
                },
                {
                    "user_id": "Utkarsh Sharma",
                    "user_href": "/profile/Utkarsh-Sharma-220"
                },
                {
                    "user_id": "Shivam Singh",
                    "user_href": "/profile/Shivam-Singh-100"
                },
                {
                    "user_id": "Samy Sweet",
                    "user_href": "/profile/Samy-Sweet"
                },
                {
                    "user_id": "Abhay Pratap Singh",
                    "user_href": "/profile/Abhay-Pratap-Singh-185"
                },
                {
                    "user_id": "Mark Andrew",
                    "user_href": "/profile/Mark-Andrew-85"
                },
                {
                    "user_id": "Kratika Kashyap",
                    "user_href": "/profile/Kratika-Kashyap-2"
                }
            ]
        }
    ]
}