{
    "title": "What's the best proofreading software for writers? I need to proofread 500,000 words in less than 4 hours? - Quora",
    "tags": [
        "Editing/Proofreading",
        "Writing, Publishing, Writing Tools",
        "English Editing, Proofreading, Substantive Editing, Writing",
        "Proofreading and Content Editing",
        "Proofreading Services",
        "Writing Tools",
        "Writers and Authors"
    ],
    "response": [
        {
            "author_info": {
                "name": "Judy Gill",
                "href": "/profile/Judy-Gill-2"
            },
            "answer_text": "MS Word’s “Read Aloud” function. Go to Review, click to open it, then look to the left and click on “Read Aloud.” You can choose the voice (male or female) you want to hear, and the speed at which the voice reads each word. This will help you pick up on typos such as dropped “ed” for a word that should be in past tense, dropped “s” for plurals, awkward sentences, commas where no comma is needed, places where you might have forgotten to put a period between sentences. But really, 500K words? What are you proofing? War and Peace? In 4 hours? That’s asking a lot of any proofreader. I just took about three days proofing a 100K word manuscript, but of course, that included the times when I had to turn off the reading and make corrections or adjustments, cook and eat meals, make another cup of coffee or six, as well as sleep, shower, and walk to the supermarket for provisions. ",
            "date": "Answered October 4, 2020",
            "views": "324",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Thomas P. Buehner",
                    "user_href": "/profile/Thomas-P-Buehner"
                },
                {
                    "user_id": "Noah Faggard",
                    "user_href": "/profile/Noah-Faggard"
                }
            ]
        },
        {
            "author_info": {
                "name": "Timothy Ellis",
                "href": "/profile/Timothy-Ellis-4"
            },
            "answer_text": "500k words? In 4 hours? Proofreading? Sorry, it can’t be done. There is no software known which can adequately replace a professional proofreader, or even some of the better beta readers. Proofreading takes time, and multiple passes. And how long depends on how fast a person can read, and still check every single word and the flow of them. Short-cutting the proofing stage is just asking for reviews saying the book desperately needs editing. Even if its not a book, but something else, you don’t need someone putting down the contents because of the number of goofs in it. The reality is, software puts a lot of the goofs in, in the form of auto-correct. Proofing is designed to find these, as well as ones not seen by the software. With 500k words, I’d expect the first proofing read to take 5 to 10 days at 8 hours a day each, and need about 6 passes to ensure you get all the obvious goofs. Anyone suggesting proofreading a 60k book can be successfully done in 4 hours is either a professional author making 7 figures a year, or has no idea what they’re talking about. Not even the best writers or editors can edit 500k words in 4 hours. And software as I said, is likely to create more errors than it fixes. And miss all of the important ones. ",
            "date": "Answered October 4, 2020",
            "views": "65",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Thomas P. Buehner",
                    "user_href": "/profile/Thomas-P-Buehner"
                }
            ]
        }
    ]
}