{
    "title": "What topic should I cover in an ethics essay? - Quora",
    "tags": [
        "Essay Writing Help",
        "Essays",
        "Writing Advice"
    ],
    "response": [
        {
            "author_info": {
                "name": "Sue Bell",
                "href": "/profile/Sue-Bell-58"
            },
            "answer_text": "Writing an ethics paper can present some unique challenges. For the most part, the paper will be written like any other essay or research paper, but there are some key differences. An ethics paper will generally require you to argue for a specific position rather than simply present an overview of an issue. Arguing this position will also involve presenting counterarguments and then refuting them.  SOURCE:https://justdomyhomework.com/blog/ethics-essay-writing-tips Finally, ensuring that your reasoning is valid and sound and citing the appropriate sources will allow you to write an ethics paper that will satisfy any critic.Here are some topics that you should consider: Would You Speak Up If You Heard an Ugly Ethnic Statement at a Party Filled With Popular Kids?Should Assisted Suicides Be Allowed for Terminally Ill Patients?Would You Tell If You Saw a Friend Cheating on a Test?Should Politics and Church Be Separate?Should a Student's Ethnicity Be a Consideration for College Acceptance?Should Companies Gather Information About Their Customers?Should Teens Have Plastic Surgery? SOURCE:https://www.ibe.org.uk/student-essay-competition/74/53 Would you tell if you saw a popular kid bullying?Would You Speak Up If Your Friend Abused an Animal?Should News Stories Slant Toward What People Want to Hear?Would You Tell If Your Best Friend Had a Drink at the Prom?Should Football Coaches Be Paid More Than Professors?",
            "date": "Answered November 2, 2018",
            "views": "220",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Joshua Resnek",
                "href": "/profile/Joshua-Resnek"
            },
            "answer_text": "The main consideration to be covered in an ethics essay is this: am I qualified because of the way I think and act in my own life to write about anything having to do with ethics? Before I investigate another ethics I must investigate my own. The topic to be covered in an ethics essay? How qualified am I to comment about ethics? ",
            "date": "Answered November 15, 2016",
            "views": "52",
            "upvotes": "0"
        }
    ]
}