{
    "title": "What makes a biography compelling to read? - Quora",
    "tags": [
        "Biographies",
        "Writing"
    ],
    "response": [
        {
            "author_info": {
                "name": "Cristina Hartmann",
                "href": "/profile/Cristina-Hartmann"
            },
            "answer_text": "The way I figure it, you need three things to make a biography compelling: (1) the reader must be interested enough; (2) the subject matter must be interesting enough; and finally (3) the writing must be interesting enough.Since both (1) and (2) are a given, I’ll focus on (3). Biographies are tricky. You have to create a cohesive and engrossing narrative out of the many, many small events that makes up a person’s life. It has to be somehow more than just recounting such tedious facts. So … how to do that? It should begin with the questions that the biography asks (and answers). Let me present you with three biographies that I found fascinating (and I’m a finicky biography reader). they took very different approaches and answer different questions about there subjects Who is the Person?: The Literary Approach When I picked up Reluctant Genius: The Passionate Life and Inventive Mind of Alexander Graham Bell by Charlotte Gray, I was surprised to find that it read like a novel. Gray writes much like an omniscient narrator in a novel, creating a vivid and complete portrait of a man who changed the face of telecommunications and deaf education. She goes into great detail into Bell’s temperamental (but still sweet) nature and his intense relationship with his wife. An excerpt describing Bell’s frustrated efforts at courting his wife-to-be, who belonged to the upper crust of Boston society: In an effort to dampen Alec’s hopes, Mrs. Hubbard summoned him to Cambridge and read him passages from Mabel’s letter. Although Gertrude meant well, it was a cruel thing to do, and it sent Alec into a fury of despair. “Don’t know what is best to do—quite distressed about it—as such dislikes have a tendency to be permanent,” he noted in his diary. His head ached, and he tossed and turned through the sultry August nights. This is a very successful example of an biographer answering the basic question of Who is Alexander Graham Bell? What did he do? Gray answers these questions in a descriptive and engaging way (which was only made possible by the author’s skill and good use of first-person sources). This approach works quite well here because Bell is a very interesting man in his own right. Gray could afford to skimp a bit on historical context here, as Bell’s persona is enough for a book. Why Did They Become so Influential?: The Contextual Approach Some biographies are more about the times than just the person. Jeff Guinn’s 2017 Road to Jonestown: Jim Jones and the Peoples Temple was one such book. Guinn spends most of his time describing the historical context that influenced Jim Jones’s rise to prominence as a firebrand activist campaigning for racial and social equality and his transformation into a mentally unstable cult leader that orchestrated one of the biggest mass suicide in history. An excerpt describing why some wealthy white Bay Area residents flocked to Jim Jones’s church to assuage their guilt and anger over the persistent racial and social strife of the 1970s: For the first time, Jones regularly attracted professionals whose salaries were, by previous Temple standards, astronomic—college professors, successful attorneys, business owners or managers as well as line workers and minimum wage employees. The turbulent times had much to do with it—at every social and economic level, Americans were discontented with escalating racial strife and the increasingly unpopular Vietnam War. Jones challenged visitors to stop talking about problems and actually do something to make America better—Peoples Temple was the way. And when eager, relatively well-heeled applicants arrived in Redwood Valley, they were offered the opportunity to immerse themselves in the effort, often by producing the pink slips for their very nice cars, or the diamond necklace and earrings bequeathed by a beloved grandmother. The Road to Jonestown asks the question that’s a bit more than Gray’s basic biographical question: Why was Jim Jones so successful as a social activist? Why did so many people follow him? What went wrong and got everyone to drink the Flavor-AId? Guin answers these questions with copious historical and cultural analyses. i doubt the basic biography approach that worked in Reluctant Genius would’ve worked here. Jim Jones himself is actually much less interesting than what he created: a church that championed (and to some degree, achieved) racial integration in such turbulent times before becoming a radical socialist cult. It is the Peoples Temple itself that is at the heart of the biography. What Happened Next? The Legacy Approach The Immortal Life of Henrietta Lacks by Rebecca Skloot is an unusual biography. The titular Henrietta is dead for most of the biography (perhaps I should call it biography-cum-historical nonfiction). Instead of focusing on Henrietta’s short life, Skloot tells us more about how Henrietta’s death affected science as her HeLa strain became the foundation of many scientific innovations … and her family. She also manages to incorporate her own story of finding Henrietta’s family and her growing personal relationship with them, revealing how her children grew more impoverished and troubled after Henrietta’s death. An excerpt where Henrietta’s daughter muses about her long-dead mother and what she would’ve thought about her legacy: I’ve tried to imagine how she’d feel knowing that her cells went up in the first space missions to see what would happen to human cells in zero gravity, or that they helped with some of the most important advances in medicine: the polio vaccine, chemotherapy, cloning, gene mapping, in vitro fertilization. I’m pretty sure that she—like most of us—would be shocked to hear that there are trillions more of her cells growing in laboratories now than there ever were in her body. Skloot answers a question rarely answered in biographies: What happened after they die? What happened to their family? This is a rather provocative question, as Henrietta’s only claim to fame is her cell line called HeLa. But Skloot’s focus on her family brings forth a fresh story about how a tragic death of a mother enriched science but left a family impoverished and motherless. A compelling biography can’t just be written well. It has to answer the right questions. Some, such as Reluctant genius can get away with answering the basic question of “Who was the person? What did they do?” Others must do more. It is often the latter that make the most fascinating biographies. ",
            "date": "Answered April 9, 2018",
            "views": "28",
            "upvotes": " View 33 Upvoters",
            "upvoters": [
                {
                    "user_id": "Mohan Lal Dhingra",
                    "user_href": "/profile/Mohan-Lal-Dhingra-1"
                },
                {
                    "user_id": "John George",
                    "user_href": "/profile/John-George-251"
                },
                {
                    "user_id": "David Caune",
                    "user_href": "/profile/David-Caune"
                },
                {
                    "user_id": "Daniel Weaver",
                    "user_href": "/profile/Daniel-Weaver-34"
                },
                {
                    "user_id": "Frank Douglas",
                    "user_href": "/profile/Frank-Douglas-12"
                },
                {
                    "user_id": "Vikneswaran",
                    "user_href": "/profile/Vikneswaran-5"
                },
                {
                    "user_id": "Anubondem Buban-Ngu",
                    "user_href": "/profile/Anubondem-Buban-Ngu"
                },
                {
                    "user_id": "Jay Yadawa",
                    "user_href": "/profile/Jay-Yadawa"
                },
                {
                    "user_id": "Jatinder Singh",
                    "user_href": "/profile/Jatinder-Singh-100"
                },
                {
                    "user_id": "Ocean Jade",
                    "user_href": "/profile/Ocean-Jade"
                },
                {
                    "user_id": "Adam Gerow",
                    "user_href": "/profile/Adam-Gerow"
                },
                {
                    "user_id": "Ann Litz",
                    "user_href": "/profile/Ann-Litz"
                },
                {
                    "user_id": "Miguel Valdespino",
                    "user_href": "/profile/Miguel-Valdespino"
                },
                {
                    "user_id": "Mallika Mathur",
                    "user_href": "/profile/Mallika-Mathur"
                },
                {
                    "user_id": "Yashaswini Joshi",
                    "user_href": "/profile/Yashaswini-Joshi-1"
                },
                {
                    "user_id": "Keerthana Sankar",
                    "user_href": "/profile/Keerthana-Sankar-5"
                },
                {
                    "user_id": "Daniel Ly",
                    "user_href": "/profile/Daniel-Ly"
                },
                {
                    "user_id": "Tilly Wilson",
                    "user_href": "/profile/Tilly-Wilson-3"
                },
                {
                    "user_id": "James McLean",
                    "user_href": "/profile/James-McLean-1"
                },
                {
                    "user_id": "Leah Earl",
                    "user_href": "/profile/Leah-Earl"
                },
                {
                    "user_id": "Holly Root-Gutteridge",
                    "user_href": "/profile/Holly-Root-Gutteridge"
                },
                {
                    "user_id": "Simon Hayes",
                    "user_href": "/profile/Simon-Hayes-3"
                },
                {
                    "user_id": "Geetendra Abhinav",
                    "user_href": "/profile/Geetendra-Abhinav"
                },
                {
                    "user_id": "Krishna Janaswamy",
                    "user_href": "/profile/Krishna-Janaswamy"
                },
                {
                    "user_id": "Swetha",
                    "user_href": "/profile/Swetha-384"
                },
                {
                    "user_id": "Heather Stark",
                    "user_href": "/profile/Heather-Stark-6"
                },
                {
                    "user_id": "Ritesh Pratap Singh",
                    "user_href": "/profile/Ritesh-Pratap-Singh-1"
                },
                {
                    "user_id": "Paul Ryberg",
                    "user_href": "/profile/Paul-Ryberg"
                },
                {
                    "user_id": "Pratik Deshpande",
                    "user_href": "/profile/Pratik-Deshpande-24"
                },
                {
                    "user_id": "Erica Friedman",
                    "user_href": "/profile/Erica-Friedman"
                },
                {
                    "user_id": "Caroline Zeller",
                    "user_href": "/profile/Caroline-Zeller-2"
                },
                {
                    "user_id": "Hugo Quinonez",
                    "user_href": "/profile/Hugo-Quinonez-1"
                },
                {
                    "user_id": "Stephanie Vardavas",
                    "user_href": "/profile/Stephanie-Vardavas"
                }
            ]
        },
        {
            "author_info": {
                "name": "Anna Demers",
                "href": "/profile/Anna-Demers"
            },
            "answer_text": "Thank you for asking. My answer might not be as intellectual as the ones shared so far. What makes a biography compelling to read? I became infatuated with Ernest Hemingway. Why? He and I share the same birthday. Yep… that is it. For some unknown reason, he resonated with me. At school we had to read one of his books: For Whom The Bells Tolls. I then read as much as I could about what he wrote and about his life. Articles in the newspapers, etc. I even went to Cuba to visit his house and his boat and I also visited the hotel, Ambos Mundos, room 511 when he was inspired and lived sort of like a hermit in the room where he sequestered himself to write some of his famous works. The youtube video below gives you a tour of his hotel room. With the help of the family, the room was converted to a ‘museum’ where his typewriter and some of his belongings are there for people to visit. The tour of the room starts at around 1.05 minutes or so.  The video below shows the visit to his home named Finca Vigia, meaning \"lookout house\". Finca Vigia is located in the small, working-class town of San Francisco de Paula, Cuba. We could not go into the house but we could look through the windows and look at all of his home where time stood still it seems.  Oh the memories… Also, we had a tour of his watering holes. THAT was such a hoot. To be able to sit at the same place in this beautiful little pub overlooking the sea where he would have chats with men coming back for their day of fishing. He would listen as they shared his story and he was then inspired to write the book: Old Man And The Sea. So…. when I resonate with a writer, I do get a little obsessed. I also have others where I did pretty much the same thing. Ann Rice is an other writer I obsessed about. I read every one of her books. From the Mayfair Witches to the vampire series to the trillogy she wrote under a pen name, A. N. Roquelor. That trilogy is all about BDSM and it is amazing and so much better than the shades of ‘boring’ grey. lol I travelled to New Orleans to actually be on the streets she described with such eloquence in her series with the Mayfair Witches. I fell in love with New Orleans through her writing and once I got there, I could so relate and it was an amazing experience. Why did I obsess about her? She and I share the same first name… Yea… I know… There is not a whole lot of sophistication in my choices. There are others and I do not wish to bore anyone so I’ll leave it at that. ",
            "date": "Answered March 21, 2018",
            "views": "376",
            "upvotes": " View 4 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Margaret Weiss",
                    "user_href": "/profile/Margo-Weiss-1"
                },
                {
                    "user_id": "Brian Fey",
                    "user_href": "/profile/Brian-Fey"
                },
                {
                    "user_id": "Christine Leigh Langtree",
                    "user_href": "/profile/Christine-Leigh-Langtree"
                },
                {
                    "user_id": "James Pross",
                    "user_href": "/profile/James-Pross"
                }
            ]
        },
        {
            "author_info": {
                "name": "M Bergeron",
                "href": "/profile/M-Bergeron"
            },
            "answer_text": "I’d say the most important factor for a biography to be compelling is the person it’s written about to have lived as interesting a life as possible. As humans we are drawn to the struggle yet we long for triumph in the face of difficult situations. The more difficult the situation is, the bigger the triumph. This is why fictional stories are so entertaining. A compelling biography will read almost like a work of fiction, with the main character seeming almost larger than life while facing challenging situations and triumphing over them. These challenges and triumphs help shape this real person into the type of person who is worth writing a biography about. An interesting life, sprinkled with achievements from a real person who seems larger than life is what really makes a compelling biography. ",
            "date": "Answered March 20, 2018",
            "views": "171",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Sapphires Thann",
                    "user_href": "/profile/Sapphires-Thann"
                },
                {
                    "user_id": "Anna Demers",
                    "user_href": "/profile/Anna-Demers"
                },
                {
                    "user_id": "Tanja Subotić",
                    "user_href": "/profile/Tanja-Subotić"
                },
                {
                    "user_id": "Matthew Gordon",
                    "user_href": "/profile/Matthew-Gordon-7"
                }
            ]
        },
        {
            "author_info": {
                "name": "Tom Byron",
                "href": "/profile/Tom-Byron"
            },
            "answer_text": "Original Question: What makes a biography compelling to read? Personal details, behind the “veil” events, how and why you ended up accomplishing success, or why you failed. It should be personal and relatable. Exciting. Part serious. Part humorous. Use facts and dates, name names (without violating confidences) and help the reader understand what you faced in life. “How you did it”, as the book that Dr. Frederick Frankenstein found in his grandfather’s laboratory. “Young Frankenstein”. Throw in a photo or two. From here.  To here.  I’ve been writing a lot in these last 6 years and as questions about life &etc come up I relate events. My method is a mad as Dr. Frankenstein’s—I’m compiling my story. Mainly for my heirs. Mainly to see if I can. I enjoy reading about the what’s how’s why’s who’s and when’s of people. It helps explain the entire purpose of life—or the futility of life. Your choice after you read a great biography. ",
            "date": "Answered March 15, 2018",
            "views": "276",
            "upvotes": " View 4 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Saurabh Sanyal",
                    "user_href": "/profile/Saurabh-Sanyal-1"
                },
                {
                    "user_id": "Brian Fey",
                    "user_href": "/profile/Brian-Fey"
                },
                {
                    "user_id": "Sohail Ahmed",
                    "user_href": "/profile/Sohail-Ahmed-7"
                },
                {
                    "user_id": "James Prell",
                    "user_href": "/profile/James-Prell-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Ana Ramen",
                "href": "/profile/Ana-Ramen"
            },
            "answer_text": "They actually happened to real people! This makes them relatable and more compelling. ",
            "date": "Answered March 15, 2018",
            "views": "21",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/Leo-Proctor"
                }
            ]
        },
        {
            "author_info": {
                "name": "Nicholas Klacsanzky",
                "href": "/profile/Nicholas-Klacsanzky-1"
            },
            "answer_text": "Showcases a great personal journey. Shows us how human a person is and how they can rise above themselves. ",
            "date": "Answered April 18, 2014",
            "views": "274",
            "upvotes": "0"
        }
    ]
}