{
    "title": "What are short stories for various disciplines that provide an understanding of a core concept(s)? - Quora",
    "tags": [
        "Mechanical and Electrical Engineering",
        "Physical Chemistry",
        "Design",
        "Mechanical Engineering",
        "Electrical Engineering",
        "Chemistry"
    ],
    "response": [
        {
            "author_info": {
                "name": "Shreya Khurana",
                "href": "/profile/Shreya-Khurana-2"
            },
            "answer_text": "I came across this story recently which is based upon the butterfly effect and the chaos theory. It's named A Sound of Thunder and it's written by Ray Bradbury. I also got to know that it is the most re-published science fiction story up to the present time (and since 1984). I'll give you a brief plot summary. The story begins in the future, in which the time machine has been invented but is still very temperamental. A hunter named Eckels pays to go traveling back into the past on a guided safari to kill a Tyrannosaurus rex.  As the party waits to depart they talk about the recent presidential elections in which an apparently fascist candidate, Deutscher, has just been defeated by the more moderate Keith, to the relief of many concerned.  When the party arrives in the past, Travis (the hunting guide) and Lesperance (Travis’s assistant) warn Eckels and the two other hunters, Billings and Kramer, about the necessity of minimizing the events they change before they go back, since tiny alterations to the distant past could snowball into catastrophic changes in history. The hunters must stay on a levitating path to avoid disrupting the environment and only kill animals which were going to die within minutes anyway. Despite his earlier eagerness to begin the hunt, Eckels loses his nerve at the sight of the Tyrannosaurus. Travis tells him he cannot leave, but Eckels panics and veers off the path. The two guides kill the dinosaur, and shortly afterward the tree that would have killed the T-Rex lands on top. As soon as it is over Travis quickly finds Eckels and sees by his muddy boots that he did in fact fall off the path. Travis threatens to leave Eckels in the past unless Eckels removes the bullets from the dinosaur’s body, as they cannot be left behind. Eckels obeys, but Travis remains furious, threatening on the return trip to shoot him. Upon returning to the present, Eckels notices subtle changes. English words are now spelled strangely, people behave differently, and, worst of all, Deutscher has won the election instead of Keith. Looking through the mud on his boots, Eckels finds a crushed butterfly, whose death was apparently the cause of many changes. He frantically pleads with Travis to take him back into the past to undo the damage. Travis raises his gun, and there is a sound of thunder. To read the full story, visit A Sound of Thunder. ",
            "date": "Answered May 31, 2014",
            "views": "393",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Erik Halberstadt",
                    "user_href": "/profile/Erik-Halberstadt"
                },
                {
                    "user_id": "William Hardaway",
                    "user_href": "/profile/William-Hardaway"
                },
                {
                    "user_id": "Shreya Smita",
                    "user_href": "/profile/Shreya-Smita"
                }
            ]
        }
    ]
}