{
    "title": "What was the worst typo you've seen in a published work? - Quora",
    "tags": [
        "Typographical Errors"
    ],
    "response": [
        {
            "author_info": {
                "name": "Richard Nathan",
                "href": "/profile/Richard-Nathan-1"
            },
            "answer_text": "In Mel Blanc’s autobiography (co-written with Philip Bashe) entitled “That’s Not All, Folks,” Blanc talks about a routine he used to perform on Jack Benny’s radio program (and later on the Jack Benny television program). Blanc played a Mexican character named Sy, who, with very few exceptions, would only say the word “Si”- or another one syllable word that started with the letter “s.” Here is the book’s description of one sketch. According to the book, Mel played both Sy and his son Thomas, but I’m not sure that is accurate. It would have been funnier if an actual child had played Thomas. At the beginning of this part of the sketch, Sy uncharacteristically speaks in complete sentences. It is necessary for the set up. See if you can spot the typos. BEGINNING OF TRANSCRIPT: Sy: I’d like you to meet my six-year-old son, Thomas. Jack: Oh, hello, Thomas. Sy: He’s learning to be a musician. He does a wonderful act on the stage with his sister. Jack: So, you’re a musician, eh, Thomas? Thomas: Si. Jack: Do you have an act? Thomas: Si. Jack: With your sister? Thomas: Si. Jack: What’s her name? Thomas: Sue. Jack: Sue? Thomas: Si. Jack: What do you do in the act? Thomas: Saw. Jack: Saw? Thomas: Si. Jack: Who do you saw? Thomas: Sue. Jack: Sue? Thomas: Si. Jack: Now, wait a minute! Someone put you up to this! Who was it? Sy: Me. Jack: You? Sy: Si. END OF TRANSCRIPT. The obvious typo appears not once, but twice. “Musician” should be “magician.” Magicians saw women in half. Musicians do not saw women in half. At least not usually, in my experience. I also suspect that the line “Who do you saw?” Should have been “What do you saw?” “What do you saw?” makes the answer funnier. The second worst typo I have ever seen was in the famous “Wicked Bible,” where the word “not” was accidentally left out of the “Thou shalt not commit adultery” commandment. I believe I saw a copy of the Wicked Bible in an exhibition at the Folger Shakespeare Library in Washington D.C. Wicked Bible - Wikipedia That’s quite a typo, but it is not as great as having a musician saw a woman in half. ",
            "date": "Answered September 2, 2018",
            "views": "346",
            "upvotes": " View 5 Upvoters",
            "upvoters": [
                {
                    "user_id": "Stevie Jachymiak",
                    "user_href": "/profile/Stevie-Jachymiak-1"
                },
                {
                    "user_id": "Marva Dasef",
                    "user_href": "/profile/Marva-Dasef"
                },
                {
                    "user_id": "Oscar Beveridge",
                    "user_href": "/profile/Oscar-Beveridge-2"
                },
                {
                    "user_id": "Sourabh",
                    "user_href": "/profile/Sourabh-154"
                },
                {
                    "user_id": "Selena Palmer",
                    "user_href": "/profile/Selena-Palmer-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Erica Friedman",
                "href": "/profile/Erica-Friedman"
            },
            "answer_text": "I had a favorite book as kid, by a science fiction writer my father loved. When he was publishing, he was as popular as Heinlein and Asimov, but time has been less kind to him and his name has faded from popular memory, although he is in the Science Fiction Hall of Fame and has received many honors. (Or, I should say, he had faded until this week when he said something racist about a ground-breaking Hugo winner. Old men really need to keep their yaps shut. Thanks, asshole, for being a dick. Robert Silverberg was a humongous dick the week I wrote this answer. He deserves to be called out.) Robert Silverberg wrote a book called Starman’s Quest, that I read a thousand times over, when I was a child. It wasn’t a kid’s book, but I read whatever Dad read. And he liked Silverberg. The edition I had had one massive error towards the end. It’s so bad that it reverses the entire meaning of the book and it enraged me as a kid to the point that I crossed out the incorrect word and wrote in the correct one. It just drove me crazy, even though I understood that it was a typo and I was capable of recognizing what word needed to be there. Could. NOT. Stand. It. So I fixed it. Probably ruined any monetary worth the book, which is a first edition, might ever have had. But I wasn’t thinking about that and it doesn’t matter Here is a much nicer and less-defaced copy of the book I read to the point where the pages cracked under my fingers.  ",
            "date": "Updated November 29, 2018",
            "views": "850",
            "upvotes": " View 19 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Erik Hille",
                    "user_href": "/profile/Erik-Hille"
                },
                {
                    "user_id": "Daniel Helman",
                    "user_href": "/profile/Daniel-Helman"
                },
                {
                    "user_id": "Bart Loews",
                    "user_href": "/profile/Bart-Loews"
                },
                {
                    "user_id": "Alexander Fortier",
                    "user_href": "/profile/Alexander-Fortier"
                },
                {
                    "user_id": "Hector Marmolejos",
                    "user_href": "/profile/Hector-Marmolejos"
                },
                {
                    "user_id": "Will Engel",
                    "user_href": "/profile/Will-Engel-1"
                },
                {
                    "user_id": "Joe Wezorek",
                    "user_href": "/profile/Joe-Wezorek"
                },
                {
                    "user_id": "Barbara Brugger",
                    "user_href": "/profile/Barbara-Brugger"
                },
                {
                    "user_id": "Charles Monia",
                    "user_href": "/profile/Charles-Monia"
                },
                {
                    "user_id": "Beth Goldowitz",
                    "user_href": "/profile/Beth-Goldowitz"
                }
            ]
        }
    ]
}