{
    "title": "What are some female characters written by a male writer moments that made you go 'This guy is so out of touch with women'? - Quora",
    "tags": [
        "Female Characters in Fiction",
        "Fiction",
        "Moments",
        "Creative Writing",
        "Fictional Characters",
        "Writers and Authors",
        "Literature",
        "Gender Differences",
        "Writing",
        "Books"
    ],
    "response": [
        {
            "author_info": {
                "name": "Benjamin Telford",
                "href": "/profile/Benjamin-Telford"
            },
            "answer_text": "In the fantasy series by Patrick Rothfuss, The Kingkiller Chronicles, we get to hear the life story of Kvothe, a magician, musician, adventurer, and child prodigy. Kvothe essentially narrates his own life story - and is willing to talk three days straight about it. Whoever the woman is in Kvothe’s aural history, they suck. They absolutely suck. This is a book series that’s become notorious for an 11 chapter sex scene. At this point of the story, Kvothe, a 15 year old virgin, bumps into a sex fairy in the forest who has legendarily killed every man she has ever had sex with. Luckily, Kvothe is so special and awesome at sex, he manages to fuck as though his life depends on it. Over the course of 11 chapters, he astonishes her with his amazing passion and poetry (read; porking), impresses her with his “great” lyrics for the new song he’s writing about her, and manages to make her feel jealous when his poetry is kind of mean about her appearance, because mystical, ethereal forest ladies are a petty, catty folk. Ultimately he gets off Scot free, and now his sexual prowess levels are through the roof, just from this one weekend of hanky panky. He walks into a pub the next day, and the sexy barmaid with freckily boobs he previously met immediately can tell he is no longer a virgin; she must have got a wiff of virility from his post coital fumes. Once that’s over and done with, Kvothe fucks his way through university. He at one point describes women as being like musical instruments to be played, and he preempts the reader by saying, “if you think that sounds sexist, you aren’t a musician”. Fuck you Kvothe. Kvothe apparently lives in a world where every woman he meets is sexually attractive. I don’t think he’s ever met a woman over 30. They also think he is infinitely awesome and want to bang him on sight. This despite him being a barely pubescent nerd who is ostensibly “bad at talking to women”. His adventures take him to the land of Ademre, a maternal society where everyone is a kung fu kicking warrior, including the women. They also practise casual sex as a cultural standard, which is super convenient for Kvothe, in that he was in real danger of having to be respectful to women. He still finds it necessary to explain pregnancy to them though, because this society of powerful women is of course too stupid to have noticed how it relates to sex. Figures. There are other female characters. He has a college friend who has nice big tits. There is also a mentally ill, barefoot, waifish, manic pixie dream girl who lives in the sewers. She pops up to say something cute and quirky, then goes back down the drain whenever she’s done her bit. It’s like stumbling across Josh Whedon’s teenage journals. I’ve saved the worst for last though. Over the two books written in this series, a god awful number of pages are spent with Kvothe talking about his unrequited love for Denna. Denna is a Breakfast at Tiffany’s sorta prostitute, sorta high class debutante. Kvothe has a really unhealthy, “nice guy” approach to the relationship, in that he is very very possessive about her, and believes as long as he keeps being really nice to her without actually making a move, he’ll eventually win her over. In the meantime he slags off her other suitors, fawns over her from the shadows, constantly compliments her, whilst secretly resenting all her life decisions for not involving him more. Denna is constantly changing her job, name, and location, making it hard for Kvothe to keep track of her. I feel like there is a very obvious message that Kvothe isn’t picking up. Just get that injunction, Denna! Now, had Kvothe only been this huckster type character who has been bullshitting about everything, including his sexual conquests, this might have at least been tolerable as a book series, but Instead we are encouraged to treat him as this ever awesome male insert figure. If he is an unreliable narrator, it's been several thousand words too late for Patrick Rothfuss to clarify the fact. ",
            "date": "Updated March 4, 2020",
            "views": "468",
            "upvotes": " View 792 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Cambria Rose",
                    "user_href": "/profile/Cambria-Rose-3"
                },
                {
                    "user_id": "Harsh Shahu",
                    "user_href": "/profile/Harsh-Shahu-14"
                },
                {
                    "user_id": "April Wilson",
                    "user_href": "/profile/April-Wilson-25"
                },
                {
                    "user_id": "Maryam Shamsi",
                    "user_href": "/profile/Maryam-Shamsi"
                },
                {
                    "user_id": "David Nguyen",
                    "user_href": "/profile/David-Nguyen-238"
                },
                {
                    "user_id": "Faranah Oraille",
                    "user_href": "/profile/Faranah-Oraille"
                },
                {
                    "user_id": "Amy Baldwin",
                    "user_href": "/profile/Amy-Baldwin-66"
                },
                {
                    "user_id": "Andi Sat",
                    "user_href": "/profile/Andi-Sat"
                },
                {
                    "user_id": "Chris Martyn",
                    "user_href": "/profile/Chris-Martyn"
                },
                {
                    "user_id": "Scarlet Rose",
                    "user_href": "/profile/Scarlet-Rose-131"
                }
            ]
        },
        {
            "author_info": {
                "name": "Joyce Wagner Sullivan",
                "href": "/profile/Joyce-Wagner-Sullivan"
            },
            "answer_text": "That sentiment is basically how I feel about every woman written or yet unwritten by Stephen King, whether in book for or television adaptation. They are utterly unbelievable. Under the Dome was pretty bad, I had to shut it off because the female characters were painfully unbelievable. If I didn’t know Stephen King had a wife and daughter, I would wonder if he had ever met a woman or girl in his life. Other moments that always get me - uncriticized violence against women by war veteran protagonists. I should probably start by explaining that I am a female veteran, and I spent a few years in an MFA program for video and digital media but did not finish. My focus was on how people remember war through storytelling. I spent a lot of time watching movies about war from different countries in different eras. I ended up doing most of my research for my thesis on movies that were produced after the US occupation of Vietnam. Here are a couple of examples that stuck in my brain, even though it’s been almost 10 years: In the 1978 film The Deer Hunter, there is a scene in which the characters are at a wedding reception. A man gropes another man’s girlfriend. Instead of defending her, her boyfriend hits her. And then everything just continues as normal. It’s never ever resolved. Female characters have no agency in this three hour bro-down, they are basically props. In Oliver Stone’s born on the Fourth of July, the protagonist Ron Kovic (based on a real person) is shown assaulting a sex worker in Mexico. The impact on the woman is never addressed whatsoever, and it’s presented as a symptom of PTSD and de-emphasized or erased his responsibility for his action. Another example is the Hurt Locker - not because of a specific female character but because of the overall lack of them. Ironically, the film was directed by a woman (Katherine Bigelow). But if you were to watch it, you would believe that there were no women in the US military, and certainly none who deployed to Iraq. Another interesting twist is that people in the US who were never in the military praised its authenticity, while those who deployed to Iraq and Afghanistan found it rather ridiculous in general. The reason that is relevant is because it creates a perception that women veterans don’t exist in the US. This has a very tangible impact, as resources and support for women veterans are severely lacking. Veterans make up about 25% of the homeless population in the US. A disproportionate number are women, and their numbers are increasing rapidly because of their experiences following deployments to Iraq and Afghanistan. There are already too few homeless shelters for women, and too few for veterans. Those for veterans are usually only for men. There very few shelters specifically for women veterans. The ones that exist usually don’t allow children, and many homeless veterans are single mothers. So when Katherine Bigelow didn’t even show women soldiers in the background I was like “WOW. This person is out of touch with women - especially women veterans.” She was given the stamp of supposed authenticity. She has played a huge role in the way people in the US imagine the war in Iraq. And she plays a huge role in why people imagine it without women. ",
            "date": "Answered June 15, 2020",
            "views": "11",
            "upvotes": " View 22 Upvoters",
            "upvoters": [
                {
                    "user_id": "Victoire Smith",
                    "user_href": "/profile/Victoire-Smith-1"
                },
                {
                    "user_id": "Cambria Rose",
                    "user_href": "/profile/Cambria-Rose-3"
                },
                {
                    "user_id": "April Wilson",
                    "user_href": "/profile/April-Wilson-25"
                },
                {
                    "user_id": "Stars Are Forever",
                    "user_href": "/profile/Stars-Are-Forever"
                },
                {
                    "user_id": "Tzivia Adler",
                    "user_href": "/profile/Tzivia-Adler"
                },
                {
                    "user_id": "Misaki Mei",
                    "user_href": "/profile/Misaki-Mei-36"
                },
                {
                    "user_id": "Jean Willow",
                    "user_href": "/profile/Jean-Willow"
                },
                {
                    "user_id": "Averma",
                    "user_href": "/profile/Averma-5"
                },
                {
                    "user_id": "Wydianne Van Megen",
                    "user_href": "/profile/Wydianne-Van-Megen-2"
                },
                {
                    "user_id": "Alex Psymthe",
                    "user_href": "/profile/Alex-Psymthe"
                }
            ]
        }
    ]
}