{
    "title": "What makes the Victorian period a unique period in literature? - Quora",
    "tags": [
        "Victorian History",
        "British Literature",
        "Victorian Era (1837-1901 AD)",
        "Literature",
        "Books"
    ],
    "response": [
        {
            "author_info": {
                "name": "Paula DeMichele",
                "href": "/profile/Paula-DeMichele-1"
            },
            "answer_text": "This period covered the years from 1837, the accession of Queen Victoria, to her death in 1901. This is a very long time. And not “what”, but “who” makes it unique - some of the greatest stylists of the English language were writing. Fiction: Charles Dickens - not just for great characters/plots and use of the English language, he was a major force to reform British child labor laws. Thomas Hardy - Far From the Madding Crowd and many other novels and poetry. Marianne Evans aka George Eliot - Middlemarch and other novels - the first female novelist acknowledged as a great writer. She still is. Rudyard Kipling - an undeservedly discounted author. See Plain Tales from the Hills and any of his short stories. He was one of the greatest short story craftsman in the English language. And his language is not dated. Robert Louis Stevenson - Treasure Island and other novels. Non Fiction: Thomas Carlyle and William Hazlitt - two of the greatest essayists in the English language - see Hazlitt’s essay “Gusto”. John Ruskin - Stones of Venice. His art theories are discounted now but this book is still a masterpiece about the architecture of Venice. And for its use of the English language. Poetry: Gerard Manley Hopkins - one of the greatest innovators of the English language and poetic form who led into modern 20th century poetry,. William Butler Yeats - still considered the greatest Irish poet Robert Browning - especially the dramatic monologues Christina Rossetti Drama: Oscar Wilde - A Woman of No Importance, Lady Windermere’s Fan and other plays which are still staged in all English speaking countries. Plays that make some of the best theater experiences around. Gilbert and Sullivan operettas. Gilbert was really a rather vicious satirist of the British empire and upper class - they were just too self-satisfied and complacent to see what he was doing, until Ruddigore (a pun - ruddy gore), which got him banned from theaters. Quite a bit was unique when you add it all up - and that’s without all the social and legal reforms that took decades to get. ",
            "date": "Answered April 19, 2020",
            "views": "65",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Iulia Halatz",
                    "user_href": "/profile/Iulia-Halatz"
                },
                {
                    "user_id": "Thomas Packer",
                    "user_href": "/profile/Thomas-Packer-5"
                }
            ]
        },
        {
            "author_info": {
                "name": "Lynn Oddy",
                "href": "/profile/Lynn-Oddy"
            },
            "answer_text": "It isn’t particularly unique. There was an increase in volume of publications most of which were dire. Many 18th century classics are assumed to be Victorian because they were republished then. Prior to the 18th century there was very little literature published so the Victorian period is seen as the peak of English literature. The 20th century has produced a similar vast amount of publications and we’re only beginning to sort the classics from the dross. ",
            "date": "Answered April 19, 2020",
            "views": "28",
            "upvotes": "0"
        }
    ]
}