{
    "title": "What symbols are in The Great Gatsby? - Quora",
    "tags": [
        "The Great Gatsby (2013 movie)",
        "The Great Gatsby (1925 book)",
        "Literature of the United States of America",
        "Literary Analysis and Criticism",
        "Symbolism",
        "Symbols"
    ],
    "response": [
        {
            "author_info": {
                "name": "Darian Jones",
                "href": "/profile/Darian-Jones"
            },
            "answer_text": "Luckily, I took an AP English Literature class, and The Great Gatsby was one of the books that we focused on. There is a lot of symbolism within the text, most of it having to do with morality and the 1920's. Keep in mind that Gatsby was a book about that era, focusing primarily on the darker side that hid beneath the glitz and glamour. For those of you reading who have not read the story, it may contain some spoilers!   Jay Gatsby: The Character himself is representative of the American Dream. He starts out trying to pursue the American idea of success in order to woo the sweetheart of his youth, Daisy. But what started out simple quickly took a turn for the worst. His love for Daisy led him to change his identity and do whatever was necessary to achieve his wealth and status. This shows how the American Dream, which was started out as a good intention, was eventually perverted in the 20's. When he dies, this represents the death of the American Dream, an Ideal once treasured by many.The Green Light:  This has a few interpretations. When the light is glowing, Gatsby is reaching toward it with longing. This represents not only Gatsby's dream for the future, but also everyone's. Everyone was striving for the wealth and wonderment of the 20's in much the same way that Gatsby was striving to win back Daisy no matter what. East Egg/West Egg: . East Egg is what was known as \"old money\". These were the people that had inherited wealth. Aristocracy and good taste were reflected in them. \"New Money\" were the people of West Egg. They were those that had recently found riches in the booming economy, or illegal dealings, of the Jazz age. They were often associated with garishness and gaudy things. This fits into the greater theme of East and West sensibilities.The geography in the story is representative of Eastern and Western sensibilities. The West was often seen as more honest and virtuous. The Eat was seen as immoral. Valley of Ashes: The Valley of Ashes was a dumping ground filled with pollution. The people here were not as well off as their Long Island counterparts. This was a huge symbol of the darkness beneath the facade. In between all of the gaudiness, parties, and money was the decay, hidden by the city and the Eggs. The Billboard: In the Valley of Ashes, a billboard depicts  a faded pair of eyes eerily watching over everyone. This is often interpreted as God, society, or another power just watching as the world spiraled down into immorality. The fading may symbolize God's fading presence in the lives of the people at the time. Owl Eyes: His character is noted for his resemblance to the aforementioned billboard. He is kind of an extension of the eyes seen there. One thing I find interesting is that he was the only person attending Gatsby's funeral. So the eyes of the billboard (God) watch as the American Dream comes to an end.Parties: The Jazz Age was a time when people partied without restraint. It highlights people's perception of the 20's vs. the reality of it. The nights began beautifully, but ended in drunkenness and fighting. Weather: The weather in several scenes helped established the tone of some situations. For example, the rain in the scene where Gatsby meets Daisy again reinforces the awkwardness of their meeting. Also, the heat in the climax where the big argument happens creates an atmosphere of tension. Rain is also the backdrop of Gatsby's funeral.Clock:  Although minor, the broken clock in the room when Gatsby and Daisy meet up for the first time shows how time has stopped for Gatsby. He cannot forget the past, or let go of it, either.Yellow Rolls Royce: Gatsby's car represents money, particularly new money. It is definitely flashy and over the top. Ironically, Myrtle Wilson is run over and killed by the one thing she desired most: money.Violence:  In the story, violence is used as a process to show the decline in society as a whole. The acts of violence gradually worsen, as did the virtues of the population.  These are just the ones I can think of right now, but there is plenty of symbolism in The Great Gatsby. Even the title makes Gatsby sound like an illusionist or a performer, which is true to a certain extent. (One more!) I hope this helps!   Check out some of Fitzgerald's other titles!  ",
            "date": "Answered October 10, 2013",
            "views": "39",
            "upvotes": " View 122 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Connor Walker",
                    "user_href": "/profile/Connor-Walker-107"
                },
                {
                    "user_id": "Irakli Mikadze",
                    "user_href": "/profile/Irakli-Mikadze-2"
                },
                {
                    "user_id": "Nguyen Duc Long",
                    "user_href": "/profile/Nguyen-Duc-Long-2"
                },
                {
                    "user_id": "Yue Wang",
                    "user_href": "/profile/Yue-Wang-448"
                },
                {
                    "user_id": "Sheridan Povedano",
                    "user_href": "/profile/Sheridan-Povedano"
                },
                {
                    "user_id": "Isaac Jason",
                    "user_href": "/profile/Isaac-Jason-8"
                },
                {
                    "user_id": "Sami",
                    "user_href": "/profile/Sami-617"
                },
                {
                    "user_id": "Chantal Hardy",
                    "user_href": "/profile/Chantal-Hardy-3"
                },
                {
                    "user_id": "Asim Khan",
                    "user_href": "/profile/Asim-Khan-183"
                },
                {
                    "user_id": "Jeanine Larmour",
                    "user_href": "/profile/Jeanine-Larmour"
                }
            ]
        },
        {
            "author_info": {
                "name": "Elise Miller",
                "href": "/profile/Elise-Miller-16"
            },
            "answer_text": "Ts Elliot and F Scott Fitzgerald both wrote about “wasteland” people. The symbols reinforce the negligence of Dasy and Tom, Gatsby’s misguided aspiration of wealth and belief that wealth will win Daisy and make him more important when he is viewed as “nouveau riche” and tacky by Daisy and Tom. Daisy kills Tom’s lover, a poor woman who runs out to stop the Rolls Royce (belongs to Gatsby) why is then assassinated by Hazel’s husband who seekss revenge for his wifes’s careless muder. Daisy and Tom just keep on oblivious to the human heartache and destruction in their wake. I have not read this book for 20 years, but I have rad it 3 times. I have read “To Kill a Mockingbird 3 or 4 times and wish I could see the new play. Classic, great literature bring you back time and again, and each time the reader gleans a new “AHA moment”! “ 4 times and would love to see the new ",
            "date": "Answered June 4, 2019",
            "views": "16",
            "upvotes": "0"
        }
    ]
}