{
    "title": "What is the worst plot twist you've seen? - Quora",
    "tags": [
        "Plot Twists",
        "Worst Case Scenarios",
        "Plot (narrative) ",
        "The Worst Thing",
        "Movie Story and Plot Themes",
        "Movies"
    ],
    "response": [
        {
            "author_info": {
                "name": "Sasha Wulf",
                "href": "/profile/Sasha-Wulf"
            },
            "answer_text": "There’s two, but I’ll start with the older one so you don’t get spoiled. Note, the films in question are Indiana Jones and the Kingdom of the Crystal Skull and Godzilla: King of the Monsters. Let’s start with Kingdom of the Crystal Skull, the redheaded stepchild of the franchise.  The plot: Dr. Jones teams up with his buddies and newfound son to battle some Communists in a race to a ridiculous finale that was well deserving of the original title “Indiana Jones and the Saucer Men from Mars” The twist: Jones’s bumbling sidekick, Mac, is revealed to be a double agent working for the soviets about ten minutes in. Then about halfway through the film he proclaims he was a double agent for the CIA. Oh wait, nevermind, then later it’s revealed he’s been a spy for the KGB the whole time! Shocker! Why it sucks: Mac is a character I don’t know who is introduced in this corny “hey this is worse than that one time” manner that instantly translates to “my buddy here is a good pal who would never betray me”. Mac is treated as though he’s the secret traitor in hiding but the problem is I don’t know him. It’s not like it’s Marion or Short Round or someone who I’m already familiar with. No, it’s some new offhand character who is blatantly going to be a traitor. Not to mention it’s way too stupid and complex. Jones points out at the end that Mac is a “triple agent” after counting the betrayals on his fingers. If a plot twist is so overdone that a main character counts the amount of times you’ve pulled it, you need to reevaluate your narrative. In that same vein, it’s time to talk about Godzilla. Sorry big guy, sun’s getting real low on these corny twists.  The plot: A scientist uses a sound machine to wake up a bunch of monsters who fight. Godzilla wins. The twist: Vera Farmiga’s Emma turns out to be a traitor for the eco-terrorist villains of the film. Why it sucks: Two words: character motivation. Emma’s motivation for working for the bad guys to wake up monsters is to return the world to a primordial state wherein humans become the subservient species to these kaiju beasts because that’s what her dead son would want. Her son who is dead because of Godzilla’s wanton destruction of San Francisco mind you. Her motivation makes no sense and the twist is hardly interesting anyways. It’s just a way to make her more unlikable for whatever reason. ",
            "date": "Answered June 4, 2019",
            "views": "87",
            "upvotes": " View 31 Upvoters",
            "upvoters": [
                {
                    "user_id": "Luthfia Fajriani",
                    "user_href": "/profile/Luthfia-Fajriani"
                },
                {
                    "user_id": "Sage Coleman Johnson",
                    "user_href": "/profile/Sage-Coleman-Johnson-1"
                },
                {
                    "user_id": "Aaron Ludwig",
                    "user_href": "/profile/Aaron-Ludwig-2"
                },
                {
                    "user_id": "Peter D'Agata",
                    "user_href": "/profile/Peter-DAgata"
                },
                {
                    "user_id": "Zachary Yochum",
                    "user_href": "/profile/Zachary-Yochum-3"
                },
                {
                    "user_id": "Vaibhav Samant",
                    "user_href": "/profile/Vaibhav-Samant-1"
                },
                {
                    "user_id": "Wendell Sasaki",
                    "user_href": "/profile/Wendell-Sasaki"
                },
                {
                    "user_id": "Frank Mosby",
                    "user_href": "/profile/Frank-Mosby"
                },
                {
                    "user_id": "Pontus Rudholm",
                    "user_href": "/profile/Pontus-Rudholm"
                },
                {
                    "user_id": "Christine Shultz",
                    "user_href": "/profile/Christine-Shultz-3"
                }
            ]
        },
        {
            "author_info": {
                "name": "Jerry Ruth",
                "href": "/profile/Jerry-Ruth-3"
            },
            "answer_text": "Star Wars, the last Jedi. The plot device where Finn and Rose go to the planet to find a hacker. They spend 30 minutes of screen time only to be captured in the end. The plot was not advanced in the slightest by this side trip. ",
            "date": "Answered May 30, 2019",
            "views": "172",
            "upvotes": " View 8 Upvoters",
            "upvoters": [
                {
                    "user_id": "Abhishek Hariharan",
                    "user_href": "/profile/Abhishek-Hariharan-3"
                },
                {
                    "user_id": "Tyler Fuerst",
                    "user_href": "/profile/Tyler-Fuerst"
                },
                {
                    "user_id": "Jackson Thompson",
                    "user_href": "/profile/Jackson-Thompson-41"
                },
                {
                    "user_id": "Mattia Rastelli",
                    "user_href": "/profile/Mattia-Rastelli"
                },
                {
                    "user_id": "Cyrit Selves",
                    "user_href": "/profile/Cyrit-Selves"
                },
                {
                    "user_id": "Jamarian Cleveland",
                    "user_href": "/profile/Jamarian-Cleveland-2"
                },
                {
                    "user_id": "Mannan Rajani",
                    "user_href": "/profile/Mannan-Rajani"
                },
                {
                    "user_id": "Gabriella Jacobs",
                    "user_href": "/profile/Gabriella-Jacobs-7"
                }
            ]
        }
    ]
}