{
    "title": "What are some good spelling hacks? - Quora",
    "tags": [
        "English Spelling",
        "Spelling",
        "Tips and Hacks for Everyday Life",
        "List Question"
    ],
    "response": [
        {
            "author_info": {
                "name": "Lidia Stanton",
                "href": "/profile/Lidia-Stanton"
            },
            "answer_text": "I’ve drawn a series of 200 comical cartoons to help anyone remember tricky to spell English words (British English), including homophones (words that sound the same but are spelled differently) and pairs of words that somehow ‘go together’. When you smile, or laugh out loud, a strong semantic association is formed in your brain based on robust neural connections, which will help you recall the tricky spelling in future. Check some of these out:      * The 200 tricky spellings in the book are: Confusing pairs of words: accept vs. except, adapt vs. adopt, affect vs. effect, assure vs. reassure, ensure vs. insure, bored vs. board, brake vs. break, coffee vs. instead, committee vs. commission, complement vs. compliment, desert vs. dessert, emigrate vs. immigrate, flour vs. flower, hair vs. hare, hole vs. whole, lose vs. loose, necessary vs. occasionally, peace vs. piece, physiology vs. psychology, principal vs. principle, pronounce vs. pronunciation, quiet vs. quite, stationary vs. stationery, tall vs. talk, than vs. then, their vs. there vs. they’re, too vs. two, wear vs. where, weather vs. whether, who’s vs. whose, witch vs. which, your vs. you’re, advice vs. advise, licence vs. license, practice vs. practise. Tricky everyday words: accident, achieve, address, answer, anxiety, appear, architect, argument, awkward, bargain, beautiful, beginning, believe, biscuit, brain, brilliant, broccoli, calendar, Caribbean, cemetery, debt, different, embarrass, engineer, equipment, exaggerate, excellent, familiar, February, foreign, fortunate, friend, garage, hiccup, homeowner, honour, irresistible, island, issue, jealousy, leather, leisure, library, message, money, pavilion, people, possesses, queue, raspberry, receive, recover, restaurant, sausage, scissors, special, surface, together, tomorrow, touch, vicious, village, watch, Wednesday, weird, wrap. Tricky formal/academic words: accommodate, amiable, apparent, ascertain, assassinate, atheist, business, capability, challenge, commitment, definite, dilemma, discipline, environment, fluorescent, foreseeable, gist, glossary, government, graffiti, grammar, heritage, hierarchy, immediately, independent, knowledge, liaison, management, manoeuvre, medieval, misspell, mnemonic, noticeable, occurred, opportunity, parallel, parliament, persistent, pharaoh, physician, prejudice, privilege, professor, propaganda, publicly, recommend, research, schedule, separate, significant, success, thesaurus, vacuum, villain. Unfortunate words within words: dysfunctional, execute, ghost, pharmacy, resource, slaughter, theatre, therapist, toddler. Reference: Stanton, L. (2016) 200 Tricky Spellings in Cartoons. Visual Mnemonics for Everyone. US: Create Space Publishing Platform. Available at: Visual Mnemonics for Everyone: Amazon.co.uk: Lidia Stanton, Harry Stanton: 9781532962103: Books ",
            "date": "Answered June 18, 2016",
            "views": "38",
            "upvotes": " View 19 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Marie Lyn",
                    "user_href": "/profile/Marie-Lyn-5"
                },
                {
                    "user_id": "Mark Stammer",
                    "user_href": "/profile/Mark-Stammer-3"
                },
                {
                    "user_id": "David Rupp",
                    "user_href": "/profile/David-Rupp"
                },
                {
                    "user_id": "Marlene Fischer",
                    "user_href": "/profile/Marlene-Fischer-1"
                },
                {
                    "user_id": "Sushi Soma",
                    "user_href": "/profile/Sushi-Soma"
                },
                {
                    "user_id": "Mia Pisacane",
                    "user_href": "/profile/Mia-Pisacane"
                },
                {
                    "user_id": "Jordan Jay",
                    "user_href": "/profile/Jordan-Jay-17"
                },
                {
                    "user_id": "Not Interested",
                    "user_href": "/profile/Not-Interested-97"
                },
                {
                    "user_id": "Malky McEwan",
                    "user_href": "/profile/Malky-McEwan"
                },
                {
                    "user_id": "Rohit",
                    "user_href": "/profile/Rohit-2114"
                }
            ]
        },
        {
            "author_info": {
                "name": "अमित चौहान (Amit Chauhan)",
                "href": "/profile/अमित-चौहान-Amit-Chauhan"
            },
            "answer_text": "The three golden things to do- Read, Write and Speak a lot. I mean to say read paper/magazine/blogs/Quora/Post a lot...and when your eyes starts itching then read again and take your revenge...read billboard/read road posters/read bus,auto posters/read just read soon you will find that you are able to learn a lot new words and now you are able to distinguish between correct words and wrong words.Take words as a picture/image, more the images you see more you will remember. So just explore more.Use extensions in chrome [any dictionary], use auto spelling check in MS word.Keep a pocket dictionary with you ...always. And when doubt arises for any word then just check and correct on spot. Now lets move to Speaking part.As till now you have read a lot [I assume] and probably gain some knowledge .But it's of very less benefit if you not utilize in your general speaking.Use that word in your sentence and whenever you use it just spell that word in your mind[you can murmur also]...and woahh!!!..you are now one less word that is mistake free. Come on man , just try it. I know we all do a lot of reading[again I assume] and many do speaking also but the thing that we forget to do is the Writing part.Guys there is a writer hidden in each of us,believe me and start writing whatever you have done in your entire day in one diary or start a blog writing and keep on checking the errors you performed while writing and correct those on spot [as in writing in MS word of in internet a red line will appear showing a spelling mistake ,we usually right click-->correct-->move on but we seldom try to memorize or remember our mistake thinking \"Auto correct hain na\"[auto correct is already there] and just procrastinate this small part of learning. P.S- You can also write the mistaken words in a chit[piece of paper] and keep it in your pocket so that whenever you see it you get your mistake. I hope the answer helps.Note - Sorry for my English, you know I am also learning.  :-) ",
            "date": "Updated August 2, 2015",
            "views": "37",
            "upvotes": " View 21 Upvoters",
            "upvoters": [
                {
                    "user_id": "Francis E.J",
                    "user_href": "/profile/Francis-E-J"
                },
                {
                    "user_id": "Indarjit Singh",
                    "user_href": "/profile/Indarjit-Singh-7"
                },
                {
                    "user_id": "Tribhuwan Sinha",
                    "user_href": "/profile/Tribhuwan-Sinha-4"
                },
                {
                    "user_id": "Nahana Mohamed",
                    "user_href": "/profile/Nahana-Mohamed-1"
                },
                {
                    "user_id": "Keerthana Aswathi",
                    "user_href": "/profile/Keerthana-Aswathi"
                },
                {
                    "user_id": "Shanta Singh",
                    "user_href": "/profile/Shanta-Singh-26"
                },
                {
                    "user_id": "Vimla Bhol",
                    "user_href": "/profile/Vimla-Bhol"
                },
                {
                    "user_id": "Shrikant Khade",
                    "user_href": "/profile/Shrikant-Khade-13"
                },
                {
                    "user_id": "Nina Swami",
                    "user_href": "/profile/Nina-Swami"
                },
                {
                    "user_id": "Ayush Srivastava",
                    "user_href": "/profile/Ayush-Srivastava-728"
                }
            ]
        }
    ]
}