{
    "title": "What are some of the best books to read about African history written by African authors? - Quora",
    "tags": [
        "Reading Lists",
        "History of Africa",
        "Book Lists",
        "Writers and Authors",
        "List Question",
        "Reading",
        "Book Recommendations"
    ],
    "response": [
        {
            "author_info": {
                "name": "David Hermanson",
                "href": "/profile/David-Hermanson-1"
            },
            "answer_text": "I would strongly suggest the works of V.Y. Mudimbe, beginning with his best known work, The Invention of Africa : Gnosis, Philosophy and the Order of Knowledge, Bloomington (USA) , Indiana University Press 1988.  You might follow it with his The Idea of Africa, African Systems of Thought, Bloomington, Indiana University Press, 1994. Most of his work is in French, including a number of fascinating novels. Perhaps a third of his work has been translated to English. Valentin recently retired from Duke University, his page there can be found at Program in Literature: People. His wikipedia listing here: V. Y. Mudimbe is good, but as usual for Wikipedia contains a few inaccuracies. He was born in the Belgian Congo (now the Democratic Republic of the Congo) but had to flee that country in 1979 because of his opposition to the corruption of the regime of Mobutu Sese Seko.  In Paris (both before and after his exile) he was a colleague and interlocutor with Michel Foucault. After a brief stay in France, he was invited to come to Haverford College in the U.S.  Since then he's taught at several other universities, until his recent retirement from Duke. ",
            "date": "Answered November 2, 2015",
            "views": "23",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Mihigo Rugamba",
                    "user_href": "/profile/Mihigo-Rugamba"
                }
            ]
        },
        {
            "author_info": {
                "name": "Robert McCann",
                "href": "/profile/Robert-McCann-6"
            },
            "answer_text": "You would need to go country by country.  Having said that in there are two Kenyan historians who do not generally agree on much but have written widely about Africa and are recognised the world over: The late Ali Mazrui, whose obituary gives a flavour of his workAli Mazrui, Scholar of Africa Who Divided U.S. Audiences, Dies at 81  And Bethwell Allan Ogot ",
            "date": "Answered June 24, 2015",
            "views": "18",
            "upvotes": " View 5 Upvoters",
            "upvoters": [
                {
                    "user_id": "Zwakele Ngwenya",
                    "user_href": "/profile/Zwakele-Ngwenya"
                },
                {
                    "user_id": "Allan Bahati",
                    "user_href": "/profile/Allan-Bahati-1"
                },
                {
                    "user_id": "David Hermanson",
                    "user_href": "/profile/David-Hermanson-1"
                },
                {
                    "user_id": "Freeya Joy",
                    "user_href": "/profile/Freeya-Joy"
                },
                {
                    "user_id": "Tawani Anyangwe",
                    "user_href": "/profile/Tawani-Anyangwe"
                }
            ]
        }
    ]
}