{
    "title": "What should my first blog post be? - Quora",
    "tags": [
        "Blog Posts",
        "Blogging Tips and Hacks",
        "Blogging Advice!",
        "Blogs"
    ],
    "response": [
        {
            "author_info": {
                "name": "Ben Podgursky",
                "href": "/profile/Ben-Podgursky"
            },
            "answer_text": "June 12, 2010. Hello World! Hey everyone! I’ve decided to give this blogging thing a try. I’m going to try to stick to a routine of posting every Sunday with cool new COBOL programming hacks! Stay tuned!  June 24, 2010. COBOL hacking, Part 1 Whew, so that took longer than I thought — writing a post a week is hard! But here’s my first post; a guide to building your first responsive webapp in COBOL! I’ll talk through the motivations here, and then get into the meat in part 2. Read on!  December 3, 2015. Giving this blog another try. New llama! So, you know, life happened, and every week turned into two weeks, turned into… never. But I’m giving it another try, with a new focus — my new pet llama! In this post, I talk about shearing my first llama. Next week, we’ll go over tasty llama recipes! Stay tuned!  Crickets  Don’t sweat what you should write for your first post. Don’t sweat the second, or the third. The most important thing you can build is a habit of writing. Blog don’t die until you stop writing, and only you control that. Habit means getting something out on a regular cadence. That could be a week (ambitious), every two weeks, or even every month. But keeping yourself to a schedule is critical. So don’t sit there and over-optimize what to write for your first, second, third, or fifth post. Find something interesting to you, and write it. Then find another thing, and write it. Over time, you’ll hopefully find a topic that really strikes a cord with a readership, and keeps people coming back. Or maybe there’s a topic you’re just really into. The feedback, and your own response to writing the content, will help you focus in on the topics you care about. But focus and quality are the second and third most important things to worry about when getting into writing. The first is consistency — get something out, now. Stop thinking. Stop over-planning. Just start writing. ",
            "date": "Answered June 7, 2020",
            "views": "392",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Sandra Rose",
                    "user_href": "/profile/Sandra-Rose-121"
                },
                {
                    "user_id": "Tim Mensch",
                    "user_href": "/profile/Tim-Mensch"
                },
                {
                    "user_id": "Sidharth Raja",
                    "user_href": "/profile/Sidharth-Raja"
                }
            ]
        },
        {
            "author_info": {
                "name": "Ankur Sahu",
                "href": "/profile/Ankur-Sahu-1"
            },
            "answer_text": "I have very recently started writing blog posts after creating a blog site using wordpress. My first post was about a common Indian problem which is ‘pissing in public’. The idea of writing about it came to my mind when i saw 2 guys pissing in public. This is when i decided i’m going to write about it and once i sat down to write, loads of other ideas came to my mind. You can read my first post here - http://www.allstuffindian.com/why-we-should-encourage-pissing-in-public/ I personally think it doesn't matter what your first blog post is about. You won't even have much traction on your first blog post. You will have to work hard towards bringing visitors to your blog and then it will start to matter. All that matters initially is, what you are thinking while writing it and how are you putting it in words. If you’ll keep waiting for the right topic to start with then you will just be wasting an opportunity. ",
            "date": "Answered October 18, 2016",
            "views": "219",
            "upvotes": "0"
        }
    ]
}