{
    "title": "What are some plot twist ideas? - Quora",
    "tags": [
        "Plot Twists",
        "Plot (narrative) ",
        "Movie Story and Plot Themes"
    ],
    "response": [
        {
            "author_info": {
                "name": "Selva Mubhash",
                "href": "/profile/Selva-Mubhash"
            },
            "answer_text": "Time travel story, A mysterious machine appears suddenly and found by government officials. They took the machine to their research centre to know what it is. Somehow the people in the nation got all these news from media. There were conspiracies that it is a time machine. Lot of people wanted to see it. But the machine was fully secured in their base and nobody except authorized scientist can only enter. Our protagonist is a guy who recently lost his family in accident. So when he came to know about that machine he thought may be if it is a time machine he could go back in time and save his family. So with all his effort he managed to breach the security and found his way to the machine. It looked like a time machine but no one tried to use it because anything can happen. But he had nothing to lose and used the machine and set the time and date as the same day his family got killed. It worked and he was back in time to save his family. But all he could remember was they were driving on a highway and all of a sudden another car along the road hits his car sideways. He went to his house. But the family already left. He stole a car and proceeds to the highway at max speed. He found the car and gained speed.he reached the car and looked into that car. THAT WASNT HIS WIFE, THAT WASNT HIS FAMILY, but the past him was driving the car and talking to the women next to her and smiling at the kids in back seat. Our guy from the future was in shock after seeing that. With all of a sudden his tire got blast he loses the control of the car, this car rams sideways with that car(which had the past him and family) THAT TIME MACHINE PUT HIM IN ANOTHER PARALLEL UNIVERSE. ",
            "date": "Answered September 9, 2020",
            "views": "160",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Ava Erickson",
                    "user_href": "/profile/Ava-Erickson-19"
                }
            ]
        },
        {
            "author_info": {
                "name": "Jin Laakso",
                "href": "/profile/Jin-Laakso"
            },
            "answer_text": "I can give some ideas. Man is forced to fight against aliens in an army, only to realise that the aliens were the good guys all along.A girl spends her time saving turtles by clearing ocean from plastic. However, it is later revealed that is was just the cover and she was secretly an undercover agent whose job was to inspect underwater.Kid sets an adventure to find Santa. Visits North Pole and sees White-bearded old man dead with a note in hand, that tells the kid to be next Santa since he was destined to be ONE.Group of scientists try to get out of universe to see what’s beyond. Only to find that entire thing is a simulation with another group of human scientists that must be made by another group of scientists…so on and so forth.Police tries to to find the missing man. They find the corpse of the man in the refrigerator within his own house, but he lives alone. It’s found that an homeless woman lived in the attic of the house and sneaked during midnight to get food. Man saw her and she killed him.",
            "date": "Answered November 26, 2019",
            "views": "264",
            "upvotes": " View 253 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Ahona Arunima",
                    "user_href": "/profile/Ahona-Arunima"
                },
                {
                    "user_id": "Mackenzie Xue",
                    "user_href": "/profile/Mackenzie-Xue"
                },
                {
                    "user_id": "Catherine Navarro",
                    "user_href": "/profile/Catherine-Navarro-19"
                },
                {
                    "user_id": "Allie Toombs",
                    "user_href": "/profile/Allie-Toombs"
                },
                {
                    "user_id": "Ella Zieber",
                    "user_href": "/profile/Ella-Zieber"
                },
                {
                    "user_id": "Naomi Van den Berghe",
                    "user_href": "/profile/Naomi-Van-den-Berghe"
                },
                {
                    "user_id": "Ethan Chan",
                    "user_href": "/profile/Ethan-Chan-160"
                },
                {
                    "user_id": "Jorge Cavazos",
                    "user_href": "/profile/Jorge-Cavazos-4"
                },
                {
                    "user_id": "Allen King",
                    "user_href": "/profile/Allen-King-32"
                },
                {
                    "user_id": "Satara Bradford",
                    "user_href": "/profile/Satara-Bradford"
                }
            ]
        }
    ]
}