{
    "title": "What are some good fanfiction sites? - Quora",
    "tags": [
        "Fanfiction"
    ],
    "response": [
        {
            "author_info": {
                "name": "Raegan Stanley",
                "href": "/profile/Raegan-Stanley"
            },
            "answer_text": " I wasn't going to answer this question because there already were answers, but then I read the answers and decided I had more information to offer. I’ve seen so many recommendations on this topic in the past, and none of them ever really did them justice, so I’m going to pretty much go crazy and put as much of my knowledge and experience as possible into one extremely long post with everything you need to know. And feel free to let me know you have any questions, specific or general. I’ll be mostly talking about Wattpad - Stories You'll Love, Archive of Our Own, and FanFiction, as those are the only ones that are actually any good, in my personal opinion. Because they are the only ones I like, they are also the only ones I really know much about, except for a very short stint on Quotev.So really, the best site to use depends on what you want it for and what you value in fanfiction. To read fanfictionQuality of ContentThe best site for quality, as far as grammar, spelling, and writing style is hands down Archive of Our Own (AO3), which has been mentioned by other Quorans in previous answers. AO3 has been the most consistent site I've seen so far in terms of grammar and spelling. Second place goes to FanFiction due to the beta-reading program they have, though I've seen people on other sites mention their beta readers as well. CommunityIf you are looking for a site that has a strong community of people who dole out comments, votes, and positive affirmation, Wattpad is the winner. The method Wattpad uses for commenting in the app allows readers to comment on specific parts, lines, words, and paragraphs of any given part of a story, and you can read other people's comments quite easily without having to exit the story or lose your place in the chapter. You can also reply to other readers’ comments, and you are actually encouraged to do so. What was one reader commenting on a particular line they liked or making a reference to another fandom can spiral into a conversation between as many as dozens of readers that goes on for over 100 replies. That is a kind of community I haven't come across on across any other site. Easy of useIf you'd like to be able to easily move between fandoms, filter search results by a relationship, tag (description), rating, fandom, character, or warning, it's super easy to do that on AO3, which is a big part of why so many people love it. Wattpad is hard to really navigate or narrow your search options, and FanFiction doesn't have near as many options. You can also reorder search results by number of reads, kudos, word count, date published, date updated, etc. AO3 is by far the easiest fanfiction site to navigate, as far as I've seen. Sites like Wattpad and Quotev don't even compare, though I still would rate Wattpad high above Quotev. FanFiction comes in second place, in my experience. Best appLots of fanfiction reading sites have apps in order to facilitate easier reading. In my experience, Wattpad has the best app over all. The AO3 app isn't worth the download as it doesn’t even have all of the fics on there and it is way more complicated that the website, and it is much easier to just read AO3 on a browser on your phone, laptop, tablet, or other device. Fanfiction.net is the only other app I've ever noticed to be easier than a browser on a phone or tablet, so it takes second place this round. On a latpop, though, always use the website. Available fandomsSome fandoms are more common on different sites. Twilight and Harry Potter each have a huge presence on FanFiction, whereas I've noticed AO3 to be the best place for Marvel, DC and Anime related fandoms. Wattpad is good for OCs (original characters) and reader inserts (though I definitely don't recommend reader inserts. Not my cup of tea). AO3 and Wattpad have a higher percentage of slash/homosexual content, whereas FanFiction is, as far as I can tell, primarily straight ships or no ships. You can find slash/homosexual content of FanFiction but it isn't nearly as common or prevalent. Availability of ContentWattpad requires an account to use the site at all. AO3 is mostly available to guests, though authors can make their works invisible to anyone without an account (most don't, but it happens). FanFiction also seems to be mostly, if not entirely, open to guests, but authors have the ability to restrict the reviews (comments) of guests. All in all, I'd say AO3 wins this one as far as availability to those who don't want to make an account. Ease of use of an accountFor those of you who would like an account, some sites are more accommodating than others. Wattpad, which requires an account for all users, is mostly easy to use, and allows for things like a profile picture, a bio, reading lists, and other cool features. You can post messages to your profile and choose whether you want Wattpad to notify your followers of your message. Again, commenting is easier. You can add books to your private library, archive them so you can find them later, or add them to your public reading lists to share them with your followers and anyone who visits your profile. People who follow you can see in their notifications section what stories you are voting for and commenting on, what updates you post for stories you write, and eat you add to your reading lists. It's very interactive, more so than other sites I've seen. Private messaging is easy to use on this site as well, but you don't have to make it private in order to message someone. You can just post straight to their profile if you'd prefer. Wattpad rarely sends emails: only really when someone you follow posts a message to their board and asks Wattpad to notify their followers. Unlike the other sites I’ve talked about, Wattpad also has original stories, so if you ever want a break from fanfiction, there are lots of options. I’ve only indulged in original work of Wattpad a few times, but it has been mostly decent quality and usually some pretty original plots and characters. AO3 does not require an account to use for the most part, though I highly recommend it. You have a main pseudonym (shortened to pseud) and you can add additional pseuds as well. While there aren't really profile bios, there are profile pictures and and a list of fandoms you're a part of if you write and post any fics. You can bookmark your favorite works and subscribe to works and other users, which is like following them. I like the way comments are handled even better than on any other site. You have an inbox that shows any reply to a comment you made, who the reply is from, and what story and chapter the comment was on. If you click on the reply, it will show you the thread so you don't have to try and remember how the conversation had gone or what your comment was in the first place. You can also save a particular search so you don’t have to recreate your desired filter settings later. FanFiction is the most confusing of the three I've really talked about, at least for me. The app is mostly useless for anything other than reading on the go, and it works a bit better if you have an account. I haven't really noticed many benefits of having an account other than being able to post your own works or offer to beta for others (though there are requirements to do so, including having posted a certain number of works). I only really use FanFiction to post my own works, and sometimes I'll read a fic here or there, so I only really have an account so I can post things. You don't really need one, but it is nice to get email alerts for when you follow/favorite a story or author. I have an account for all three, and I recommend doing so if you really want to read or write a lot of fanfiction. It's only necessary for Wattpad, but any of them do have benefits of having the account, especially if you like the platform and use it often. I will say though, be careful about creating a Ffn account. While you can delete a Wattpad or AO3 account, there is no way to delete a Ffn account. The best you can do is change your username, password, and email to something you’ll never remember and then ditch the app and delete any memorized passwords your computer may have saved. I didn’t know about this when I created my first Ffn account, so I like to warn people about it ahead of time. Level of customization featuresIn addition to search engines, there are other kinds of features that you might want to customize. AO3 wins this round hands down. You can customize the story format, you can download works that you really like in various formats, you can adjust how much of the fic’s descriptions, tags, or warnings you see, you can set up a warning for any mature or explicit rated fics, you can set it up to see the whole work at once or chapter by chapter (the whole work at once is good for things like plane rides where you have to be in airplane mode for a long time), and so on and so forth. You can also adjust what you get emails about in order to stay as informed or as uninformed as you like. Wattpad and FanFiction don’t even come close. So as you can see, AO3 wins most of these categories. I’m sure you can see by now why most people favor it. I do as well, though I have accounts at Wattpad and FanFiction for a few reasons. Wattpad because I appreciate the community, FanFiction because there are so many authors and fics that are only there and no where else because a lot of people didn’t venture out past Ffn (FanFiction). The main reason I have an account for all three, however, is because I post my own works on all three in order to reach more readers and get more feedback. So, of course, there are different reasons to prefer different platforms if your intentions are for writing fanfic instead of only reading it. The question didn’t seem to specify, so I’ll just elaborate further anyway. 2. For Writing Complexity of actually posting worksAs far as loading your works goes, you’d probably prefer it to be as uncomplicated as possible. I like AO3 and Wattpad for this one. FanFiction is just difficult. You have to load the document you wrote the work on (and they only accept certain document formats), scroll through a long list of fandoms so you can choose the right one, design your story details, and then select which document you want to choose. You have to load each chapter as a separate document, so be prepared to scroll through a long list if you write long fics or a lot of oneshots. You also have to load images through a separate section of the account, and you can only have 10 images plus the number of works you have posted. Some of the fandoms you can choose from don’t have characters, and in those cases you can’t specify what characters are in your story in order to attract attention. The method of signifying which characters are in a relationship is also annoying, and there are a lot fewer options describing your story in order to attract readers. My favorite is AO3 in this category because, while slightly more time consuming that Wattpad, it is way more detailed, very straight forward, and works really well for attracting readers. Wattpad falls in the middle. It’s easy to do, but it doesn’t really help with getting attention for your fics. Getting readersAs already sort of mentioned in the previous category, some platforms are better for attracting readers to your fics than others. AO3 is better for attracted readers who specifically like or are specifically looking for fics like the one you’ve written. Just like the search engine is the most detailed and easy to navigate, the fic descriptions are the most detailed and make it easier for readers to locate your fic. They can narrow down the search as much as they want, or they can make it more vague, and your fic is bound to show up in lots of different filters. You can use tags to let more readers know what’s in your fic and what it’s about, and this helps readers find it better too. Ffn is good for getting a lot of general reads from people who might not have been looking for a fic specifically like yours but read it out of curiosity. The search engine, while more specific that Wattpad, is a lot more general than AO3. While you can choose specific fandoms, sub-genres, characters, and pairings, that’s about it. People will see your fic in the general list of works that fits their general search, and maybe they’ll read it and maybe they won’t. You’ll get reads, but not necessarily from people who actually like your stuff. Wattpad is kind of a mess on this front. You can still make tags, but searching for those tags is a lot more difficult than it is on AO3. It can be very difficult for new fics without any readers or votes to attract attention, and this has to do a lot with the difficult navigation that was already discussed. In fact, the easiest way to attract attention for your works is to read other people’s fics that are similar to yours and comment a lot. Be funny or clever, make friends with other commentators, follow them, and hope they follow you back and notice that you’ve written fics that are a lot like stuff they’ve already read and liked. Once you get more of a following, the momentum will sort of snowball over time. You could also try self-promotion in comment sections, where you shout from the rooftops that you also have a fic, but that mostly just comes across as desperation. Tracking TrafficThe only reason I use Ffn, other than the fact that a lot of other people use it so there are a lot of readers to reach, is that Ffn actually does a good job of keeping track of how many readers you get every month, what countries they’re from, how many of those reads are for which story, how many reviews, favorites, and follows you’ve gotten for each story, how many people have viewed your profile, and more. They have some pretty nifty bar charts in the traffic section that I like to look at to get an idea of any progress I’ve made. For example, I’ve gotten 600 views since Wednesday (it’s Monday now), and almost 400 of those views have come from the USA, whereas only 43 from the United Kingdom. Wattpad has something similar, I think. I found it one time on accident, but I’ve never been able to find it since. I actually just went and looked, but I couldn’t find it on the website or the app. I might be blind, or I might just not be tech savy, but either way, that’s saying something about the ease of use of that particular feature. Honestly, my favorite platform for this category is still AO3. Ffn has a good one, but I still feel like AO3 does better. Instead of telling me where my readers are from or how many I get on a given day of the month, it tells me how my fics do standing up next to each other on a bar graph, how many subscriptions, hits, kudos, comment threads, and bookmarks I’ve gotten over time and on each of my fics. It tells me my total word count over all, and the word count for each of my fics. It categorizes my works by fandom for easy comparison or you can just view them all in order by most hits, kudos, subscriptions, etc. The data given by AO3’s statistics is much more relevant and useful than the information given by Ffn, and it’s much easier to navigate and sort through. You can also customize the way it gives you the information and what information it gives you, unlike Ffn. Actually doing the writingWattpad wins this one. For Ffn, you upload the documents as a whole before you post them. It’s arduous and unnecessarily difficult, and it makes editing difficult and tedious. You can’t do much from the app at all. Also, it automatically names chapters “Chapter 1”, “Chapter 2”, etc. Any actual chapter name would have to be part of the document you loaded. For AO3, you have to type it all up into a word box or just copy and paste it in there. It isn’t condusive to writing things as you go, and saving and posting drafts is a bit more of an ordeal than it should be. I have no idea if you can do this from the app or not, mostly because I had the app for about 5 minutes before I decided it was useless, but even if you could it wouldn’t be worth it unless you do all your writing on your phone. Even then, it would still just be easier to copy it from where you do your writing and then paste it into a browser. Wattpad, on the other hand, was practically built for writing the story with the platform itself. On both the website and the app, it is really easy to create a work, create chapters, save drafts, edit drafts, post drafts, reorganize the order of chapters, change or edit the titles of chapters, etc. It can keep up with a very large number of stories, and each story can have up to 200 parts/chapters. It’s incredibly easy to do bold, italics, underline, and change the word alignment. It also keeps track of your word count as you go, though I’ve noticed it to be slightly off here and there when I copy over my stories into word documents in order to keep writing when I’m offline. It’s insanely easy to write with Wattpad, both in app and on the website, and that is actually where I do all my writing, though I keep a copy in a word document on my laptop. The fact that the website and app sinc means that you can start a story on your laptop at home and then continue it during your lunch break at work or whenever you have a spare minute. When you get back home, there is no hassle to open it up on your laptop again and continue where you left off on your phone. It’s easy, it’s accommodating, and it’s efficient. It’s part of why I keep coming back to Wattpad even when I get tired of a lack of grammar or a lack of stories in the fandom I want. NotificationsAO3 and Ffn both heavily rely on emails to inform you of anything. Wattpad, however, is actually really good at notifying you through the app. I use my personal email for most everything, and that includes fanfiction platfroms, so I get really tired of getting a new email every time someone favorites one of my stories of Ffn. AO3 does a good job of sending an email with all of your kudos for a whole day or week at one time instead of sending you a new email everytime. Ffn hasn’t caught on to that. Also, outside of the Wattpad app, the apps don’t do squat. I go an email 30 minutes ago about a story on Ffn that got favorited, and the Ffn app hasn’t said a thing. In fact, I’ve never gotten a single notification from the Ffn app. I’m not even sure it does notifications. On the otherhand, I just got a notification on my phone that one of my stories on Wattpad got a vote, at the same time that the website on my laptop browser got a notification about it. If you prefer emails to app notifications, AO3 is your best option. Otherwise, Wattpad rocks. The only area in which Wattpad doesn’t excel in this category is notifying you about comments. Ffn will send you an email for every review you get, and AO3 will do the same thing for every comment. Wattpad will give you a notification about a private message, vote, or if your story gets added to a reading list, but it often forgets to notify you about comments on your story. Before I figured this out, I got over a dozen comments that I didn’t reply to because I didn’t even know they were there. I still think Wattpad wins here though. Getting feedback from readersWattpad wins this one, but only because of the kind of culture that each platform has as far as expectations from comments and whatnot. For Wattpad, readers can vote for as many chapters as they want, they can comment on any particular part of the story/chapter, or they can just comment at the end. Sometimes you get lots of comments because readers are commenting on your story, or sometimes that community we talked about takes off and they’re all having their own conversation in the comments section of your story. I’ve had a really nice girl PM me because she loved one of my stories, and now I actually have her email and we were pen-pals for a little bit after PMing for forever, and I still send her emails sometimes just to see how she’s doing. On AO3, you can only give kudos once per story, and comments are an end-of-chapter sort of thing. Any comments you get are directed to you, because there isn’t the same kind of community on AO3 as there is on Wattpad. There have been times where I got super awesome comments that went on forever and ever (I really love those) that sparked conversations that could go on for a dozen replies, and then there have been times where I got one word comments like, “Cool,” or, “Nice,” that I had a hard time finding a reply to other than, “I’m glad you liked it.” I have, however, had a person or two hit me up on tumblr to remind me how great they thought one of my stories was. I don’t have tumblr anymore, but that was a really cool experience, since I never took up anybody else’s offers to chitchat on the social media platform. Ffn is a lot like AO3 in this category. There’s a limit to how many times you can favorite a story, and comments are called reviews so I’m sure you can figure out how that goes. AO3 deals with comments in a better, easier to answer and keep track of format, but that’s the only real difference there. So there it is. I could probably go into even further detail, add more categories, or sum up all the pros and cons of each one yet again, but I think this has gone on long enough. I would definitely recommend to anyone to get an account for each of the three sites, whether they want to just read or start writing too. Each has it’s own pros and cons, and there is more to them than what I could get into one Quora answer. Don’t just take my word for it either. Try them all out and decide for yourself which one is best or if you like them all. If you made it this far, may God truly bless you, because I am almost certain I’d have given up a long, long time ago. ",
            "date": "Answered August 1, 2017",
            "views": "195",
            "upvotes": " View 49 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Arianna Caldwell",
                    "user_href": "/profile/Arianna-Caldwell-2"
                },
                {
                    "user_id": "Ayay Ayiris",
                    "user_href": "/profile/Ayay-Ayiris"
                },
                {
                    "user_id": "Eswar Chand",
                    "user_href": "/profile/Eswar-Chand-21"
                },
                {
                    "user_id": "Monique Cao",
                    "user_href": "/profile/Monique-Cao"
                },
                {
                    "user_id": "OnyX Rae",
                    "user_href": "/profile/OnyX-Rae-1"
                },
                {
                    "user_id": "Peggy Carter",
                    "user_href": "/profile/Peggy-Carter-69"
                },
                {
                    "user_id": "Lara Terpetschnig",
                    "user_href": "/profile/Lara-Terpetschnig"
                },
                {
                    "user_id": "Gayatri P",
                    "user_href": "/profile/Gayatri-P-32"
                },
                {
                    "user_id": "Ambar Tiwari",
                    "user_href": "/profile/Ambar-Tiwari-8"
                },
                {
                    "user_id": "Charlotte Sophie",
                    "user_href": "/profile/Charlotte-Sophie-3"
                }
            ]
        },
        {
            "author_info": {
                "name": "Hildegunn Urdahl",
                "href": "/profile/Hildegunn-Urdahl"
            },
            "answer_text": "Original question: What are the best sites for discovering new fanfiction? Depends on what you mean by ‘new fanfiction’. If you mean ‘newly posted’.. well - you can check out various sites and which ones were last updated. The main issue with http://ff.net is that its a massive a archive and the overall quality is.. extremely varied (some authors are absolutely gems while others can barely spell). There’s a limited tag system but with the older stories you may not find a lot of them simply because they were posted before it was implemented. Its also incredible hard to use the search function to search for specific stories (unless you remember the author/title and either or both remain the same (I usually just google it and see if a specific author/story pops up). On the plus side if you do find a good author the stories said author favorited can be brilliant (even those that don’t post may have good stories on their favorite lists and if you then check out the favorited stories of authors on such lists.. you can literary get a little ‘lost’ as you look trough such lists) and the C2’s can even make it easier to look for specific stories.. but don’t count on finding all of them within such. Personally I add stories I want to follow and check up on to my own private C2 (as in I don’t have a specific type of stories I add) which makes it fairly easy to see if some of them have been updated. With AO3 the tag system can be a little out of control.. but overall it does work fairly well (the AO3 team do work on streamlining the tags but its a work in progress since its a growing archive in all ways). The overall quality of the stories are far higher on AO3 than on ff.net.. likely in part due to potential new members either having to find a code or add themselves to a waiting list for them to get an account. There’s also a spelling program on the site that do help weed out the worst mistakes as well. If you use it you should be aware that the rating is overall lower than what I’d expect at other sites and there’s also no limits to what an author are allowed to post (and unlike with http://ff.net there’s no ‘purges’ to remove stories they don’t want on the site). I find that AO3 can be absolutely brilliant when you want a specific type of stories within a specific fandom (or crossover for that matter) and as such its my ‘go to’ for that. Livejournal and dreamwidth also has various journals of authors and fandom search journal. And while the popularity of LJ has faltered a bit (the site was bought by someone in Russia and the disclaimer you sign to get an account is not the English translation but the Russian original).. well.. its still alive and well. Search groups can be absolutely brilliant .. though it does depend on whether the admins has added a decent tagging system (if they haven’t trying to navigate just to find stories people have asked for can be a nightmare), and also how active the group is (some are basically dead essentially while others are alive and well and really good). You can also search for lists of recs within a fandom. The main issue with the ones outside of archives (where the favorite stories are also posted on the sites) is that the links may no longer work (some stories may be deleted, sometimes the link was changed, sometimes the author has changed his or her name, sometimes the author has moved to a new site+.. the newer it is the more reliable its likely to be if its basically a ‘copy/paste’ type rec lists). .. But there’s still a lot of good stories that can be found this way. .. I usually just google such and take it from there (‘recs fandom theme/other’ is how you search.. like recs Harry potter gen or recs hp Harry!abused, recs severitus (stories where Snape is Harry’s guardian, mentor or father) and so on and so on (I stuck to one specific fandom but you get the general idea. Often times you may even find C2 lists this way instead of having to go through all of the ones on http://ff.net within the specific fandom). Depending on the fandom you are reading you may also find archives only dedicated to said fandom (do keep in mind that it may or may not be active though). Or even authors that has also started such archives or just has their own where only they can post. Or authors that has a webpage for their stories (usually ones who already has a following since its pretty hard for readers to find them otherwise) .. In general I recommend you save the stories you want to reread. While its usually fine.. sometimes an author may choose to delete some or all of their stories, or an entire archive may be down, or (as has also happened) an entire domain may go down overnight with all those who had posted there loosing everything they’d added unless they had a copy somewhere else). ",
            "date": "Answered October 8, 2018",
            "views": "59",
            "upvotes": " View 3 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Tony Jamie Gordon",
                    "user_href": "/profile/Tony-Jamie-Gordon"
                },
                {
                    "user_id": "Harsh Patel",
                    "user_href": "/profile/Harsh-Patel-63"
                },
                {
                    "user_id": "Anna Vale",
                    "user_href": "/profile/Anna-Vale-2"
                }
            ]
        }
    ]
}