{
    "title": "What are examples of magic powers? - Quora",
    "tags": [],
    "response": [
        {
            "author_info": {
                "name": "Robert Gillespie",
                "href": "/profile/Robert-Gillespie-17"
            },
            "answer_text": "The best example that I can think of is the Chinese art of Kung Fu, both the Shaolin Temple Buddhist version and the Wudang Mountain Taoist version. One is open to alignment with primordial forces, cosmic energy, the elements, animal spirits, Ch’i and forms like the mathematics of dance — anything that favors centered, dynamic, explosive power. One trains to build reflex — a musical level of intuition to movement. One trains to build resilience, suppleness, flexibility and strength. A legend is told about the name Shaolin which means small pine. A young man who wanted to learn kung fu went to the Buddhist monastery. He was given a small pine tree and a small calf and told to observe the following routine and that after 4 years he would have kung fu: Each day, 4 times an hour, pick up the calf then jump over the pine tree. The monks of course intended this as a joke, a lesson in humility. The monks were somewhat surprised when a much larger version of this same man showed up 4 years later having followed through with their instructions. Wisely, they immediately appointed him Grandmaster in charge of teaching kung fu and named the temple Shaolin in his honor. In any event, true magic operates reliably in the real world. People who have mastered kung fu have talent that at the very least seems like magic. This magic can come to your defense if needed — it kicks some serious behind. ",
            "date": "Answered February 12, 2017",
            "views": "902",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Noam Winter",
                "href": "/profile/Noam-Winter"
            },
            "answer_text": "There are no actual magic powers, but there are laws of nature not yet accepted by science as factual. Mind affects matter, and is also affected by it. Is this magical? Science calls this family of concepts quantum theory. Is focusing intently on a goal and bringing it into physical manifestation, by working toward it a form of magic? How about when the right connections and opportunities seem to naturally appear to support that goal, is that magical? If your goal is to dominate nature, there is no magic. If your goal is to recognize and use laws if nature in a way that you can be in service to others while also science your goals, then the world is filled with that kind of magical opportunity. Is there psychic phenomenon, yes, parapsychology indicates there is. Is there telepathy, again there is indication of that. Can we interact with animals and plants in ways not commonly accepted, shamans study this ask the time, as do yogis, magicians ( not the ones who use trickery for entertainment), and as mystics do. But it's all natural, nor supernatural. ",
            "date": "Answered February 20, 2017",
            "views": "611",
            "upvotes": "0"
        }
    ]
}