{
    "title": "What are some metaphors that describe your life? - Quora",
    "tags": [
        "Philosophy of Life",
        "Metaphors",
        "Storytelling",
        "Creative Writing"
    ],
    "response": [
        {
            "author_info": {
                "name": "Zhe Yu Ng",
                "href": "/profile/Zhe-Yu-Ng-1"
            },
            "answer_text": "Life is like tasting different kind of food. Some food are just tasty as their appearance while some are not. However, some food might not have nice appearance, but they are scrumptious. This is how we meet someone else in our lives. Some people are good looking, they know how to dress up well, but deep down they have bad personalities. For example, they are arrogant, selfish, dishonest and so on. In contrast, some people might look like bad guys, perhaps they have tattoos that scared others. However, deep down inside they are kind-hearted, always willing to lend a helping hand to others. So, you will never truly know a person unless you try to understand them through communication but not your own judgements or other rumours about them. Do not judge a book by its cover. Next, life is like having a glass of drink. There are so many kind of drinks. For example, water, cola, and beer. The type of drinks represent personalities. Some people are just like a glass of water. They are pure, innocent, naive. You are able to see through them because they do not have anything to hide, there are no secrets. They just don’t hold back anything. Sometimes you might even know what they are going to do. Some people are just like a glass of cola. They are always energetic, well known for their success in life and they have good reputation. However, you can’t really get in touch with them, just like Mark Zuckerberg, Micheal Jordan, and Bill Gates. You know who are they, but most probably you will not meet them in person in your entire life. Some people are like a glass of beer. It is good to have beer in our lives, but excessive consumption is just simply bad for our health. So, a person could have both good and bad personalities. They are party animals, good at socializing, have lots of friends. However, they don’t really want to be successful in their lives. They just want to have fun. They take no responsibility. After a long time, you know that they might be stumbling blocks if you are trying to achieve goals in your life. You know that this would be a toxic relationship if you continue to befriend with them. So, choose your friends wisely. Finally, life is a journey. What would you do when you are travelling? You enjoy the views, capture every moment, create memories. Live your life in that way too. Observe what is happening around you, whether it is good or bad. Feels it. Feels them. Your heart is not made of iron, it has feelings. It is a gift from God. So don’t restrict yourself. Don’t be scared to get hurt, you will be hurt anyway, everyone does. When you were a kid, what is the secret that help you to learn to cycle? You were not afraid of falling down. That’s right! What is the worst thing when you fall down? You only get hurt. So are you going to lie down on the floor for your entire life? No! You will get up and move on! Even kids know this. How ridiculous it is when we had grown up, we are so afraid to take risks. Braveness is fading. But it shouldn’t end up in that way. So, learn how to get up when you fall. Take risks in your life, live in the way that you are supposed to live. Dream big. Keep in your mind that every ending is another new beginning. For example, if you are going from point A to point B. You thought that point B is an end. It should be, but not really. This is because point B can connect you to point C. So, point B is an end, but it is a beginning too. Be an optimist, see the beauty in your life. Alright, that’s all for now. I’m sorry if i had digress from the subject. By the way, these are my own opinions, just to share it with you guys. Have a nice day :) ",
            "date": "Answered September 19, 2017",
            "views": "42",
            "upvotes": " View 5 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Fiabe Xbse",
                    "user_href": "/profile/Fiabe-Xbse"
                },
                {
                    "user_id": "Rigopoula Tsambou Talarantas",
                    "user_href": "/profile/Rigopoula-Tsambou-Talarantas"
                },
                {
                    "user_id": "Pooja Rani",
                    "user_href": "/profile/Pooja-Rani-64"
                },
                {
                    "user_id": "Mimi Izhar",
                    "user_href": "/profile/Mimi-Izhar"
                },
                {
                    "user_id": "Sue Griffin",
                    "user_href": "/profile/Sue-Griffin-7"
                }
            ]
        },
        {
            "author_info": {
                "name": "Emily Payton",
                "href": "/profile/Emily-Payton-20"
            },
            "answer_text": "My mind is a newborn, squealing in my arms. Babies are wonderful. They see the world with fresh eyes. Every new moment, the mundane events that form our everyday, is wonderful to a baby. Nothing is normal yet. Nothing is expected. Babies are awed, terrified, delighted by sensation. They feel everything so much. It’s a beautiful innocence, made all the more poignant when you consider what babies are. They’re miracles, life formed from two cells, an entire consciousness created from nothing. They’re biology made magical. They’re chemicals made human. I think it’s incredible. No wonder their parents love them. These masterpieces of nature, wonderful and wondrous in equal measure. Like those babies, my newborn feels. Relentlessly, without provocation or direction. It is a miracle, absorbing the world and melting it down into its component sensations, boiling them up into emotions. My newborn is precious, a masterpiece of evolution, a gift that I accept with total humility. Like a doting mother, I feel with it. I never want to see it hurt. I never want to see it whither. I never want to hear its suffering. But I swear to motherfucking Christ. If it doesn’t stop screaming I will throw it out the fucking window. Seriously, shut the fuck up. It is four in the fucking morning. You have been crying all night. I need to be up for work at seven. Let me sleep, goddammit. Ok, now we’re in public. People are here. People with their own newborns, staring at us. Stop it, you’re making a scene. No, don’t, don’t do that. No— they’re looking. Why the fuck are you crying again? I just want to go out. I just want to go out and have a normal time with the normal mothers and their normal newborns. I love you and all, but please shut up. Please just let me go. Are you seriously crying again? You have literally nothing to cry about. I know other people have trouble with their newborns too. I know every mother has been through this once, and they’ve all come out the other side. The newborn learned to sleep, and it learned to control itself, with a bit of routine and tough love. I know it’ll happen for me too. But right now— I just want my newborn to fucking stop. My mind is a newborn baby. I love it, but sometimes I’d very much like to leave it at home. ",
            "date": "Answered October 25, 2019",
            "views": "33",
            "upvotes": " View 13 Upvoters",
            "upvoters": [
                {
                    "user_id": "Palakea Godinohsyo Ni",
                    "user_href": "/profile/Palakea-Godinohsyo-Ni"
                },
                {
                    "user_id": "Lena Sparcino",
                    "user_href": "/profile/Lena-Sparcino-1"
                },
                {
                    "user_id": "Ellie Wolfie",
                    "user_href": "/profile/Ellie-Wolfie"
                },
                {
                    "user_id": "Neeharika Shrivastava",
                    "user_href": "/profile/Neeharika-Shrivastava"
                },
                {
                    "user_id": "Talia T.C. Pavoca",
                    "user_href": "/profile/Talia-T-C-Pavoca"
                },
                {
                    "user_id": "Mlrm ,",
                    "user_href": "/profile/Mlrm"
                },
                {
                    "user_id": "Erin Leonard",
                    "user_href": "/profile/Erin-Leonard-13"
                },
                {
                    "user_id": "Lavy Hime",
                    "user_href": "/profile/Lavy-Hime"
                },
                {
                    "user_id": "Orlando Fiol",
                    "user_href": "/profile/Orlando-Fiol-1"
                },
                {
                    "user_id": "Aleksandra Yurukoska",
                    "user_href": "/profile/Aleksandra-Yurukoska"
                }
            ]
        }
    ]
}