{
    "title": "When using parentheses, where does the question mark go? - Quora",
    "tags": [
        "Parentheses",
        "Question Marks",
        "Punctuation"
    ],
    "response": [
        {
            "author_info": {
                "name": "Jarrad Harries",
                "href": "/profile/Jarrad-Harries"
            },
            "answer_text": "Inside, if the entire question is parenthetical; outside if the parenthetical clause is ancilliary information to the question. Examples are probably easier to understand: “Does the question mark (used to indicate a query in written English and many other languages) go inside or outside the parentheses (specifically when writing an English sentence)?” - Question mark outside parentheses because the information enclosed is not a complete question. “Writing a question in English requires a certain knowledge of phrasing, structure and punctuation (e.g. should the question mark appear inside or outside the parentheses?) in order for the result to be unambiguous to the reader.” - Question mark inside parentheses because the entire question is parenthetical. And yes, for the avoidance of doubt, the same applies when there is a parenthetical question within another question: “Does writing a question in English require a certain knowledge of punctuation (e.g. should the question mark appear inside or outside the parentheses?) in order for the result to be unambiguous to the reader, or will native readers understand anyway?” Finally, I would say: use parentheses sparingly, as they can be pretty confusing and slow down comprehension. I wouldn’t have written any of the above examples using them, had I not been trying to illustrate my answer! ",
            "date": "Answered March 18, 2020",
            "views": "72",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "George Trosper",
                    "user_href": "/profile/George-Trosper"
                },
                {
                    "user_id": "Mohammed Saiful Alam Siddiquee",
                    "user_href": "/profile/Mohammed-Saiful-Alam-Siddiquee"
                },
                {
                    "user_id": "Marcia Hopkins",
                    "user_href": "/profile/Marcia-Hopkins"
                },
                {
                    "user_id": "Jim Lipscomb",
                    "user_href": "/profile/Jim-Lipscomb"
                }
            ]
        },
        {
            "author_info": {
                "name": "Carolyn McMaster",
                "href": "/profile/Carolyn-McMaster-1"
            },
            "answer_text": "In U.S. English, a question mark goes inside a parenthesis if the question is contained within the parentheses and outside if the larger sentence not contained in the parentheses is the question. ",
            "date": "Answered March 18, 2020",
            "views": "15",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Marcia Hopkins",
                    "user_href": "/profile/Marcia-Hopkins"
                }
            ]
        }
    ]
}