{
    "title": "When Trump expresses empathy, why does he need to read a teleprompter? - Quora",
    "tags": [
        "Teleprompters",
        "Empathy",
        "Emotional Intelligence",
        "Reading",
        "Understanding Emotions",
        "Donald Trump (politician, business person)",
        "Emotions",
        "Psychology of Everyday Life"
    ],
    "response": [
        {
            "author_info": {
                "name": "Alex Denethorn",
                "href": "/profile/Alex-Denethorn"
            },
            "answer_text": "Donald Trump doesn’t express empathy. Let’s be clear on that: he’s a narcissist, at the heart of it, and when he does overtly offer a sympathetic comment, it’s rarely a sincere one. It’s not a surprise that 99% of his comments in a positive vein are written by somebody else, and you can tell that by the language used. He has to read from a teleprompter on those occasions because he’s not speaking from the heart, and not expressing his own views. He’s articulating what he’s been advised to say, but not in his own words and never with any real heart behind them. Trump’s sociopathic in his behavioural patterns. For example, look at his comments on Covid-19 deaths, when the US his 100,000 deaths: \"We have just reached a very sad milestone with the coronavirus pandemic deaths reaching 100,000. To all of the families & friends of those who have passed, I want to extend my heartfelt sympathy & love for everything that these great people stood for & represent. God be with you!\" Now look at his unscripted comments when interviewing with Axios, on 3rd August: “They are dying. That’s true. And you – it is what it is. But that doesn’t mean we aren’t doing everything we can. It’s under control as much as you can control it.” No sympathy there. No empathy for the victims, or for their families. When talking to President Bolsonaro about whether he was concerned about the virus: “No, I’m not concerned at all. No, I’m not. No, we’ve done a great job.” Again, no acknowledgement of the damage caused or the lives taken. It’s clear from most of his comments that Donald Trump simply doesn’t care about the lives of the American people. As long as he’s fine, it’s all good. The reason he has to use a teleprompter is because when expressing sympathy or sorrow, the sentiments and the words are not his own. He’s simply not capable of that feeling. It is what it is. ",
            "date": "Answered October 17, 2020",
            "views": "56",
            "upvotes": " View 612 Upvoters",
            "upvoters": [
                {
                    "user_id": "Lonnie Drew",
                    "user_href": "/profile/Lonnie-Drew"
                },
                {
                    "user_id": "Nanci Hamilton",
                    "user_href": "/profile/Nanci-Hamilton-5"
                },
                {
                    "user_id": "Robert L Hill",
                    "user_href": "/profile/Robert-L-Hill"
                },
                {
                    "user_id": "Lorraine Stephen",
                    "user_href": "/profile/Lorraine-Stephen-3"
                },
                {
                    "user_id": "Lars Falk",
                    "user_href": "/profile/Lars-Falk-5"
                },
                {
                    "user_id": "Kevin Kazemian",
                    "user_href": "/profile/Kevin-Kazemian"
                },
                {
                    "user_id": "Harry Roberts",
                    "user_href": "/profile/Harry-Roberts-92"
                },
                {
                    "user_id": "Iono Sama",
                    "user_href": "/profile/Iono-Sama"
                },
                {
                    "user_id": "Gregg Fuller",
                    "user_href": "/profile/Gregg-Fuller-4"
                },
                {
                    "user_id": "Clarence Elledge",
                    "user_href": "/profile/Clarence-Elledge"
                }
            ]
        },
        {
            "author_info": {
                "name": "Reinhard Lohmann",
                "href": "/profile/Reinhard-Lohmann"
            },
            "answer_text": "Trump has no such things as “empathy!”, he doesn’t even know what this is. Everyone who DOES have can see this when he acts as if he cares for anybody except him. When he says things like “I feel sorrow for …”, or things like that, you can clearly see that he hasn’t the slightest idea what he is talking about. That is the reason why somebody else have to write those sentences down for him. ",
            "date": "Answered October 17, 2020",
            "views": "54",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Clarence Elledge",
                    "user_href": "/profile/Clarence-Elledge"
                },
                {
                    "user_id": "François Léonard",
                    "user_href": "/profile/François-Léonard"
                },
                {
                    "user_id": "Johnna Kay Zwernemann",
                    "user_href": "/profile/Johnna-Kay-Zwernemann"
                },
                {
                    "user_id": "Janell Rasgon",
                    "user_href": "/profile/Janell-Rasgon-1"
                }
            ]
        }
    ]
}