{
    "title": "When you just feel like writing, what do you write about? - Quora",
    "tags": [
        "Creative Writing",
        "Writing Advice",
        "Writing"
    ],
    "response": [
        {
            "author_info": {
                "name": "Jordan Yates",
                "href": "/profile/Jordan-Yates-4"
            },
            "answer_text": "I think it’s important to separate writing into two categories: product-focused and process-focused. That’s not to say that everything you write won’t have both. You should always be looking both at what you’re doing and what you end up with. But sometimes it’s important to ignore the final product and just… write. Focus on the process. How your thoughts connect to one another, how you’re feeling that day. In my stage movement class, we call it “taking inventory of yourself”. Take inventory of you on that day. How are you? What’s on your mind? Don’t worry about writing something good. Don’t worry about it making sense. Focus on where the words are coming from. Is it harder than usual to write? Easier? Why? When I feel like writing and I don’t have anything in particular that I’m dying to work on, I default to poetry. Poetry, to me, is what happens when you flip your insides out. Ignore punctuation. Ignore proper sentences. Ignore quality. Vomit onto the page. The topic might come from something I see out the window. It might come from something my dog is doing. It might (and often does) come something I happen to be wondering about at the moment. I try to look at the world around me and go, “What if?” I wrote this one the other day after reading a question on Quora that was something like “Where did you think babies came from when you were a kid?” I didn’t have a real answer, but it made me think… what if babies were like IKEA furniture? So I wrote it, just because someone had to so it may as well have been me. I used to believe that babies came in shipping crates. Little plastic baggies full of painted toes And sculpted noses Boxes of parts and tiny hearts Hooked up to batteries that give them their beat. Corkscrew arms and snap-on legs Polished marble eyeballs And pulsing wires and metal shards For brains. I now know that babies are born From the equally mechanical process of fucking But I have to wonder if “some assembly required” Is the way of the future. Imagine swapping out your broken legs New batteries for a broken heart Spare bags of fingers in your desk drawer. Perhaps Theseus knew the secret to immortality all along. It’s not good. It’s not edited. It just… is. Sometimes I write for you and sometimes I write for me. I write because I can. I write because, why not? Because seeing how my words come together is a good way of taking inventory of myself that day. When I just want to write and have nothing to write about, I write about nothing. I write about everything. I write about babies in shipping crates. The subject doesn’t matter. What matters is that I do it. ",
            "date": "Answered September 5, 2017",
            "views": "37",
            "upvotes": " View 57 Upvoters",
            "upvoters": [
                {
                    "user_id": "Sheri Fresonke Harper",
                    "user_href": "/profile/Sheri-Fresonke-Harper"
                },
                {
                    "user_id": "Neha Srinivasula",
                    "user_href": "/profile/नेहा-श्रीनिवासुला-Neha-Srinivasula"
                },
                {
                    "user_id": "John Paul D. San Diego",
                    "user_href": "/profile/John-Paul-D-San-Diego"
                },
                {
                    "user_id": "William Smith",
                    "user_href": "/profile/William-Smith-921"
                },
                {
                    "user_id": "Mahamat Issa",
                    "user_href": "/profile/Mahamat-Issa"
                },
                {
                    "user_id": "Abhay Patil",
                    "user_href": "/profile/Abhay-Patil-69"
                },
                {
                    "user_id": "Nisha Mayank (निशा मयंक)",
                    "user_href": "/profile/निशा-मयंक-Nisha-Mayank-निशा-मयंक"
                },
                {
                    "user_id": "Karishma George",
                    "user_href": "/profile/Karishma-George-1"
                },
                {
                    "user_id": "Rebecca Baldwin",
                    "user_href": "/profile/Rebecca-Baldwin-8"
                },
                {
                    "user_id": "Skylar Sharer",
                    "user_href": "/profile/Skylar-Sharer"
                }
            ]
        },
        {
            "author_info": {
                "name": "Elke Weiss",
                "href": "/profile/Elke-Weiss"
            },
            "answer_text": "I write my stories. I always have characters running around my head, and plots and thoughts. In fact, I will die with many untold stories, even if I write in all my free time, since I always have ideas. Here’s what I’m working on now, besides my novel. It’s a play about a Hasidic father and his mathematician son, based on the story of the Peaucellier–Lipkin linkage - Wikipedia. **The Straight Line ** A small office, decorated with diplomas and books. sitting in a large armchair is son, a handsome young professor. he is dressed in neat clothing. he appears nervous. door is closed. Knock Son: Come in. Father enters. He is a rabbi. bearded and suited. tall and dignified. Father: My son, is that you? I didn’t recognize you. (does not sit down) Son: That’s always been the problem. (motions for him to sit) Father: You always had a quick wit. (Still doesn't sit) Son: I got it from you. (Rising to stand to meet his height) Father: I wish you had gotten other things from me as well. (Looks at his bare head sharply) Son: No. Papa, no. Father: Out of respect for me? Son: One minute and already making demands? Father: A request for common courtesy. I expect nothing less from you Son: A compliment? I’ll treasure it Father: I didn’t come here to be insulted. I came to talk. (pause) And to listen. Son: May I offer you something to drink? Father: It’s fine. (Will still not sit down) Son: Are you sure? I would like a drink myself. I’m feeling parched. Let me get you something. Father: When did you become such a homebody? Son: It takes my mind off things (has begun pacing around the desk) Father: There’s no need for you to be nervous. I just want your company. Son: Nervous? I feel like I should remove my shoes, for the ground I walk on now is holy. (Father reaches out to Son and Son shies away) Father: How I wish that would be true. To leave exile and fulfill your mission. (Father is heartbroken) Son: Is that why I’m feeling heavy of speech? (bitter) Father: Perhaps. I hope so. For God to call you... (Father is clearly at a loss for words) Son: He won't. Long and uncomfortable pause. Son: Please, let me make you some tea? At least that’s realistic Father: It’s not needed. I really don’t need anything Son: Because I’m a heretic Father: I would prefer to talk. Please, let’s talk. Son: How about ice water in a plastic cup? Even I know that is kosher. Father: It’s really fine. I really would prefer not to eat Son: Will my unholy touch make it unkosher? Father: No, but your anger will make it bitter Son: I’m bitter. You’re bitter. The water has nothing to do with it. Father: Fine. Some plain water. Son: Thank you. (*Son gets a pitcher from the side. Father looks around room at diplomas. He looks miserable*) Father: A lot of degrees and awards Son: Indeed. But without rabbinical ordination it means nothing to you. (Hands him the water. Takes a glass for himself and sips it definitely) Father: You broke my heart. I don’t lie to you. (makes a loud blessing and sips) Son: I have played out this conversation a million times in my mind. I went through every possible permutation and combination of what you would say and what I would say and I still find myself searching for the right words to tell you that this discussion is closed. ",
            "date": "Answered August 27, 2017",
            "views": "23",
            "upvotes": " View 10 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Precedence Rathabane",
                    "user_href": "/profile/Precedence-Rathabane"
                },
                {
                    "user_id": "Jordan Yates",
                    "user_href": "/profile/Jordan-Yates-4"
                },
                {
                    "user_id": "Ido Reif",
                    "user_href": "/profile/Ido-Reif"
                },
                {
                    "user_id": "S Harish",
                    "user_href": "/profile/S-Harish-24"
                },
                {
                    "user_id": "Ayu Nazrah",
                    "user_href": "/profile/Ayu-Nazrah"
                },
                {
                    "user_id": "Anna Vale",
                    "user_href": "/profile/Anna-Vale-2"
                },
                {
                    "user_id": "Kris Meyer",
                    "user_href": "/profile/Kris-Meyer-7"
                },
                {
                    "user_id": "Yichen Wang",
                    "user_href": "/profile/Yichen-Wang-36"
                },
                {
                    "user_id": "Delaney Natale",
                    "user_href": "/profile/Delaney-Natale"
                },
                {
                    "user_id": "Akansha Mukherjee",
                    "user_href": "/profile/Akansha-Mukherjee-1"
                }
            ]
        }
    ]
}