{
    "title": "When can you call yourself an author? - Quora",
    "tags": [
        "Writers and Authors",
        "Writing"
    ],
    "response": [
        {
            "author_info": {
                "name": "Feifei Wang",
                "href": "/profile/Feifei-Wang-6"
            },
            "answer_text": "When? I don’t know. It seemed the only socially acceptable answer is “never.” I mean, think about it, can anyone (short from established writers like Stephen King or GRRM) call themselves an “author” without being ridiculed? Have you heard anyone talk about their writing “career” and the books they may or may not have published without relentless self-deprecation? There are 100 thousand different facebook Memes talked about loser writers and their miserable lives. And 100 thousand more advice about how you better be humble before you get to the level of JK Rowling. I don’t think we live in a society that people are allowed to be proud of writing, to take it seriously, to feel passionate about it, to see it as a vocation instead of a pastime hobby. I think this goes to all types of art, may it be painting, photography, knitting, sewing, carpentry, model-making, playing instruments, singing, dancing. And god-forbid, if you tell people, “I’m a poet,” wait for the jokes and chuckles and eye-rolls. I, through sheer luck, had published a book.  It’s printed on paper, bonded, with my name on it. I said, “sheer luck,” not because I think I don’t deserve being published by a major publishing house in China. But instead, I truly believe being published is like winning the lottery. It’s all about luck, has nothing to do with your writing skill. The success of your book, alas, also had nothing to do with your writing skills. It has everything to do with how the publisher promotes your book or if the theme is trending at the moment. The Chinese book market is all about runaway successes. And I was told by my editor that the publisher would not promote my book because of the theme (Italian Renaissance) being too niche. They even asked if I could keep the plot and change the setting from the Italian Renaissance to Fantasy China (which was trending). And I had seriously thought about it and decided not to. It’s a historical novel based on solid research. I can’t just switch the setting and still make it work. In the end, the publisher let me know they will only print about 20K copies, and I should be grateful that I’m not required to purchase 10K copies to cover the publisher loses. Despite all that, I’m proud of this book. I had been thinking about this story since I was in college ten years ago. I started the story as a 3 part short story series, expended to a 10 part short story series, eventually grew into a full-length novel. I’m perhaps one of the few artists out there who didn’t have stage 4 terminal imposter syndrome, and I know I can write well (at least in Chinese). And I have no shame when I say “I’m proud of this story, I love this story, I have put a lot of effort in this story, and it is above average compared to other published books.” And in my excitement, I wrote a review myself, as myself. It was a kind of a joke. I made it clear in my review that I’m the author of this book, and I read it many times (which is true, I did read it many times). I hope people enjoy reading it as well. At the time, I didn’t think much of it. What’s wrong with being proud of my work? I didn’t try to skew the review score of my book (which is a thing in China, you could hire a bunch of people to create a bunch of sockpuppets accounts and give high ratings to your book). I don’t have the money or time to do any of that. It’s just my review of mine. After all, I thought at the time, what’s one review against hundreds and hopefully thousands? OMG, the backlash I got from that two-sentence quick joke. People came in droves giving my book 1-star rating, just because they absolutely can not accept an artist being happy and proud of their work. Most of them never read the book and never intended to (as they explicitly stated in their reviews). They’re here, giving my book 1-star reviews because: how dare I to be happy about my work! How dare I give my book a 5 star and a big smile. I had to be put down a notch. I had to lower my head and know my place. I have to tell everyone I suck, my book sucks, and I’m a loser living a miserable life, come to have pitty at me oh my all-powerful readers. I never removed my happy review of my own book. I’m happy with it. I’m an author. If you want to beat me down because you can’t take it that people are satisfied with their creativity and their labor, that’s on you, not on me. So back to the question, when can you call yourself an author? When you can be proud of who you are, regardless of what the rest of the world says. ",
            "date": "Updated September 4, 2019",
            "views": "8",
            "upvotes": " View 224 Upvoters ",
            "upvoters": [
                {
                    "user_id": "AcruxmIdjit",
                    "user_href": "/profile/AcruxmIdjit"
                },
                {
                    "user_id": "Stephen Bowling",
                    "user_href": "/profile/Stephen-Bowling-5"
                },
                {
                    "user_id": "Jacob Nsa",
                    "user_href": "/profile/Jacob-Nsa"
                },
                {
                    "user_id": "Yize Wang",
                    "user_href": "/profile/Yize-Wang-1"
                },
                {
                    "user_id": "Anastasia Starostina",
                    "user_href": "/profile/Anastasia-Starostina"
                },
                {
                    "user_id": "Charity Melchor-Stophel",
                    "user_href": "/profile/Charity-Melchor-Stophel-1"
                },
                {
                    "user_id": "Taylor Sun",
                    "user_href": "/profile/Taylor-Sun"
                },
                {
                    "user_id": "Chrys Jordan",
                    "user_href": "/profile/Chrys-Jordan"
                },
                {
                    "user_id": "Aimee Mohammad",
                    "user_href": "/profile/Aimee-Mohammad"
                },
                {
                    "user_id": "Matt McGuire",
                    "user_href": "/profile/Matt-McGuire"
                }
            ]
        },
        {
            "author_info": {
                "name": "Roland Bartetzko",
                "href": "/profile/Roland-Bartetzko"
            },
            "answer_text": "You can call yourself an author: when you have received at least twenty five rejection emails from different publishing houses.when you feel shitty because you haven’t written anything meaningful today.when your day job suffers because you are constantly thinking about your book projects. (let them say you are lazy, you know better!)when you have at least ten drafts of five different book projects in your computer. You can call yourself an author when you know how it feels to get this kind of mail. when you like to hang around with all the other ‘losers’ who have written several books but haven’t published anything and maybe never will. These are your soulmates.when you shit-talk successful authors. (No, it’s not jealousy, they really suck!)when you are ready to continue living your miserable life because you think that this is the way a true author must live. No great work of literature has ever been created without suffering.when, despite all the misery, you wouldn't want to change with anyone else in the world, for no price.",
            "date": "Answered August 21, 2019",
            "views": "96",
            "upvotes": " View 366 Upvoters ",
            "upvoters": [
                {
                    "user_id": "AcruxmIdjit",
                    "user_href": "/profile/AcruxmIdjit"
                },
                {
                    "user_id": "Theo Reos",
                    "user_href": "/profile/Theo-Reos"
                },
                {
                    "user_id": "Alena Němcová",
                    "user_href": "/profile/Alena-Němcová-2"
                },
                {
                    "user_id": "Thomas Andre Saldaña",
                    "user_href": "/profile/Thomas-Andre-Saldaña"
                },
                {
                    "user_id": "Helgi Briem",
                    "user_href": "/profile/Helgi-Briem"
                },
                {
                    "user_id": "James Wylf",
                    "user_href": "/profile/James-Wylf"
                },
                {
                    "user_id": "Akiro Laxus",
                    "user_href": "/profile/Akiro-Laxus"
                },
                {
                    "user_id": "Teddy Bear",
                    "user_href": "/profile/Teddy-Bear-353"
                },
                {
                    "user_id": "Aryan Soman",
                    "user_href": "/profile/Aryan-Soman"
                },
                {
                    "user_id": "Ulysses Evans",
                    "user_href": "/profile/Ulysses-Evans-3"
                }
            ]
        }
    ]
}