{
    "title": "When should I use 'is there any' or 'are there any' in English? - Quora",
    "tags": [
        "Learning English Grammar",
        "English as a Second Language (ESL)",
        "Learning English",
        "Grammar",
        "English Grammar"
    ],
    "response": [
        {
            "author_info": {
                "name": "Simon Watkins",
                "href": "/profile/Simon-Watkins-18"
            },
            "answer_text": "Is there any hope? Are there any hopes? Is there any soup? Are there any soups? Are there any rooms, Is there any room? Is there any rice? Is there any sand? Are there any sheep? Is there a sheep. Is there any mutton? Use any when you are using a plural noun. Use is when you are using a singular noun. When you are using an uncountable noun or mass noun. Note that there are countable forms of such nouns. (We have two soups, vegetable and mulligatawny. The different coloured sands of the Isle of Wight. The rices of the word.) though they tend to be rare. Sheep are countable it just happens that the plural and the singular are the same. If we were talking about a single sheep we would not use any we would specify a sheep. Using any implies the plural ",
            "date": "Answered June 26, 2019",
            "views": "76",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Swendyheart",
                    "user_href": "/profile/Swendyheart"
                },
                {
                    "user_id": "Bùi Hoàng Hải",
                    "user_href": "/profile/Bùi-Hoàng-Hải"
                }
            ]
        },
        {
            "author_info": {
                "name": "Trina Molnar",
                "href": "/profile/Trina-Molnar-1"
            },
            "answer_text": "It would depend on what follows, namely, either a singular noun or a plural noun. Eg. 1 — Is there any bread? is there any food? is there any cheese? (= all singular nouns) Eg. 2 — Are there any customers? are there any books? are there any burgers? (= all plural nouns) A counter-intuitive example, however, is this one: Is there any money? = because “money”, as a noun, is usually a singular form, even though you *can* count it — but when you *do* count it, you count it with “dollars” or “cents” as the unit of measurement — the only people who really use the plural form “monies” are economists or stock-brokers. I hope that helps! ",
            "date": "Answered June 26, 2019",
            "views": "88",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Rachey Bee",
                    "user_href": "/profile/Rachey-Bee"
                },
                {
                    "user_id": "Metehan Deniz",
                    "user_href": "/profile/Metehan-Deniz"
                },
                {
                    "user_id": "Bùi Hoàng Hải",
                    "user_href": "/profile/Bùi-Hoàng-Hải"
                }
            ]
        }
    ]
}