{
    "title": "When writing, what is a good way to bring a dead character back to life without making it seem cheesy or cheap? - Quora",
    "tags": [
        "Resurrection",
        "Death and Dying",
        "Life and Living"
    ],
    "response": [
        {
            "author_info": {
                "name": "Anne Brown",
                "href": "/profile/Anne-Brown-19"
            },
            "answer_text": "I’ve read a lot of books over my lifetime, and can’t think of a single one (fiction) that ever featured the return or resurrection of a dead person that didn’t end up sounding cheesy. It’s the plot of half the soap operas, or used to be very popular. One cheap device in movies I eventually got to be fond of was the epidemic of amnesia in classic movies, especially movies from the 40’s. As a kid, I often suspected my family of having amnesia. Better to maintain quality by using a more practical reason for a person to go away for a while, and return to wherever. Since as far as I know of, there’s only one resurrection that’s widely believed in, even if not scientifically, don’t crumb up your writing with easy solutions. Good luck. ",
            "date": "Updated December 17, 2017",
            "views": "590",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Pat Hatch",
                    "user_href": "/profile/Pat-Hatch-3"
                }
            ]
        },
        {
            "author_info": {
                "name": "Matthew Gordon",
                "href": "/profile/Matthew-Gordon-7"
            },
            "answer_text": "There are two ways to do this. Set your story in a world where coming back to life is normal. This works especially well if certain causes of death are necessary to properly kill people, e.g.: the beheading requirement in Highlander.Go so over the top with the cheesiness that the audience buys it. This takes more nuance than you’d think but becomes a lot of fun in a hurry. Think of movies like Scream or Drag Me to Hell.",
            "date": "Answered December 16, 2017",
            "views": "357",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Affan Ali",
                    "user_href": "/profile/Affan-Ali-10"
                }
            ]
        }
    ]
}