{
    "title": "When do you say “grew up” or “have grown up” or “have been growing up” in English? - Quora",
    "tags": [
        "Speaking English",
        "Growing Up",
        "Learning English",
        "English Grammar",
        "Writing"
    ],
    "response": [
        {
            "author_info": {
                "name": "Simonetta Raymon-Barker",
                "href": "/profile/Simonetta-Raymon-Barker"
            },
            "answer_text": "I was born in Europe but grew up in the U.S. Or. I grew up in the countryside, but now live in the City.You have grown up so much. The last time I saw you, you were a mere toddler.. Or. I have grown to love you so very much.I have been growing up and becoming more responsible ever since I became a father. ( in the process of)I have had to grow up very fast ever since I joinned the military service .Growing up is so very hard to doWhen I grow up, I want to explore the world.Children should show respect towards grown ups. ( Their elders)When are you going to grow up and take responsibility for your actions ? Does this help ?",
            "date": "Answered February 12, 2020",
            "views": "45",
            "upvotes": " View 3 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Vivek Sharma",
                    "user_href": "/profile/Vivek-Sharma-1624"
                },
                {
                    "user_id": "Cherry Del Rosario",
                    "user_href": "/profile/Cherry-Del-Rosario-3"
                },
                {
                    "user_id": "Torben Dietrich",
                    "user_href": "/profile/Torben-Dietrich-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Sarah Bowman",
                "href": "/profile/Sarah-Bowman-28"
            },
            "answer_text": "When do you say “grew up” or “have grown up” or “have been growing up” in English? The first two phrases (grew up and have grown up) are in the past and are used differently than “have been growing up.” Here are sentences using these phrases. I grew up in the 1960s during the last years of the Vietnam War and the years leading up to the Moon Landing.That being the case, I would have grown up reading headlines about the Vietnam War and stories about space travel.Having just turned sixteen, Anna retorted, “Dad, I have been growing up for a long time now. When will you trust me with boys?”",
            "date": "Answered August 22, 2020",
            "views": "26",
            "upvotes": "0"
        }
    ]
}