{
    "title": "When writing, how can I make sure my characters have different voices? - Quora",
    "tags": [
        "Voice Acting",
        "Voice"
    ],
    "response": [
        {
            "author_info": {
                "name": "Philip Song",
                "href": "/profile/Philip-Song-4"
            },
            "answer_text": "Original Question: How can I make sure my characters have different voices? Edit: If this was actually for writing purposes and not voice acting, I apologize. I should’ve remembered not to assume based on tags; this question showed up in my feed because it’s tagged with “voice acting” and “fictional characters”. The only part of my answer that still applies is that “personality counts”. One thing writers and actors share, is knowing what, why and how characters should sound like to portray them faithfully. At the same time, as an artist you should portray these characters in your own way. Maybe what you see as ‘generic’, others see as your signature style. (Thanks to Will Ewing for pointing this out) Short answer: Don’t do different voices until you master your own voice first. Personality does count (the key to voice acting is acting). Long answer: This is something I see all the time in online voice acting. Many of these people focus more on how many voices they can do rather than how well they can act. As a result, many of these voices sound dull and unnatural. Hate to break it to you, but nowadays, doing different voices is not so special anymore because almost everyone can do different voices. Instead, learn to shout, inflect and emote with your own voice first, before you start expanding your vocal range. The acting ability will transfer over to your other voices and your characters reads will sound more natural. “If you can just focus on the acting, then the rest will come” (Troy Baker) ",
            "date": "Updated November 15, 2019",
            "views": "214",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Samuel Han",
                    "user_href": "/profile/Samuel-Han-14"
                },
                {
                    "user_id": "Ana Miau",
                    "user_href": "/profile/Ana-Miau-1"
                },
                {
                    "user_id": "Elizabeth Penrose",
                    "user_href": "/profile/Elizabeth-Penrose-1"
                },
                {
                    "user_id": "Brice Eppic",
                    "user_href": "/profile/Brice-Eppic"
                }
            ]
        },
        {
            "author_info": {
                "name": "Chase Bivens",
                "href": "/profile/Chase-Bivens-1"
            },
            "answer_text": "Personality does count. So do speech patterns and thought processes and voice tone. Like, comparing a rich and sheltered aristocrat with a country bumpkin. Each is going to have their own way of talking, thinking, acting, etc. Like the aristocrat is going to be formal and proper. Whereas a country bumpkin is going to be incredibly casual and unpolished. Another thing to note, is the words they use to talk. That will come from background, upbringing, and education level. Probably the biggest thing, is to already have the sound of their voices in your head. In a non-crazy way, of course. ",
            "date": "Answered January 28, 2017",
            "views": "100",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Elizabeth Penrose",
                    "user_href": "/profile/Elizabeth-Penrose-1"
                },
                {
                    "user_id": "Brice Eppic",
                    "user_href": "/profile/Brice-Eppic"
                }
            ]
        }
    ]
}