{
    "title": "When writing a book series, how do you decide when to end one book and start the next? - Quora",
    "tags": [
        "Book Series",
        "Novel Writing",
        "Book Writing",
        "Creative Writing",
        "Writing Advice",
        "Writing"
    ],
    "response": [
        {
            "author_info": {
                "name": "Will Greenway",
                "href": "/profile/Will-Greenway-1"
            },
            "answer_text": "When writing a book series, how do you decide when to end one book and start the next? Unless you are really experienced and already know (approximately) how long it will be, better to write until the end. You have to find spots that become “candidates” for break points. You will then need to modify scenes to create a “tail out” section for the end of one book. Then modify the opening scene of the next book so it all feels planned out. Your goal, is to make next book somewhat accessible to a reader that has not read the first book. I generally do a “what has come before” kind of section that summarizes the previous book. This is a tactic to encourage re-reading. As a general rule, when a book starts getting over 100k words I start looking for places to break it.  ",
            "date": "Answered July 30, 2020",
            "views": "93",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Alex Wilson",
                    "user_href": "/profile/Alex-Wilson-693"
                }
            ]
        },
        {
            "author_info": {
                "name": "Carrie Cadwallader",
                "href": "/profile/Carrie-Cadwallader"
            },
            "answer_text": "It would depend on the type of series you’re writing. In a series like The Dresden Files, The Southern Vampire Mysteries, or Dan Brown’s Robert Langdon books, each book has its own distinct plot. There’s a beginning, middle and end of each mystery Harry Dresden or Robert Langdon investigates. Even if there’s an overall plot arc that takes place over multiple books, the plot of each book is distinct and it’s easy to see where the story starts and stops. In other series, there may be a natural break point. Like Harry Potter has a new book for each school year, or The Hunger Games first two books break after that year’s game. In others, where the story of each book is more entangled, you have to find that break point. The Fellowship of the Ring ends when the Fellowship breaks up. A Game of Thrones ends with major turning points for Ned Stark, Daenerys and Jon Snow that are going to change the entire direction of their stories. Each book has its own internal arc that serves the larger story. ",
            "date": "Answered July 30, 2020",
            "views": "92",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Ben Coco",
                    "user_href": "/profile/Ben-Coco-3"
                },
                {
                    "user_id": "Mike Sweeney",
                    "user_href": "/profile/Mike-Sweeney-135"
                },
                {
                    "user_id": "Margaret Carter",
                    "user_href": "/profile/Margaret-Carter-2"
                }
            ]
        }
    ]
}