{
    "title": "When did you actually make money out of your blog? - Quora",
    "tags": [
        "Make Money Blogging",
        "Blog Monetization",
        "Blog Traffic",
        "Bloggers",
        "WordPress",
        "Blogs",
        "Blogging",
        "Making Money Online",
        "Wanting and Making Money"
    ],
    "response": [
        {
            "author_info": {
                "name": "Mike Good",
                "href": "/profile/Mike-Good-4"
            },
            "answer_text": "So I have been blogging for a very long time, but the last researched blog that makes me monthly money to this day is one created in 2008. Back in 2003ish to probably 2007 there was this classified website that you could pay $9.99 a month for unlimited webpage postings. The good marketer or online money maker would do 10 to 15 ads a day. These now gurus were doing 75 to 150 ads of 250–400 words between 5 am-8 am every morning, then their regular daily routine. It took 18 hours just to write 30 great ads. Finally, I did make it to the 75 mark after 4 months and one of my best days was $8k+, but averaged around $300 a day. That was an insane amount of work for $300 a day! What did do is teach me raw copywriting and making effective ads. After the blog in ’08 I found this online group of ad and copy guys that were big time to me…. they use to make fun of me and my work until this $5,000 sales letter contest came up. It had grammar issues, but it was so unique they surprisingly used anyway. I was totally shocked when that check came in the mail and pleasantly surprised when my group threw money at me to show them my simple technique. Fast forward to today: Sell ad copyHelp tiny businesses get up and running onlineTake groups of 20–200 and show them how to combine their efforts to make money onlinePeople pay my small team to go over courses to remove the fluff for themSell domains and sitesResearch for new bloggersSell rough outline of course creators or my team doesPartner with people 70/30 in their favor to run my blogsAnyhow excuse any errors doing a lot at one time, best wishes! ",
            "date": "Answered July 13, 2020",
            "views": "67",
            "upvotes": "0"
        }
    ]
}