{
    "title": "When did it become common to write sympathetic villains? - Quora",
    "tags": [
        "Villains",
        "Fiction",
        "Fictional Characters",
        "Literature",
        "Writing"
    ],
    "response": [
        {
            "author_info": {
                "name": "Alexander Nachaj",
                "href": "/profile/Alexander-Nachaj"
            },
            "answer_text": "Since forever. Having relatable villains rather than parodies can make for good storytelling that raises questions about good and evil, right or wrong, etc. Go back to ancient literature and you’ll see plenty of this. In the West, Greek and Roman epic poems and plays often had morally grey characters for both protagonists and antagonists. The same when you jump over to Medieval stories (look at the Arthurian legends, everyone has a good motivation for what they are doing) and Renaissance plays like Shakespeare. Heck, Milton even made Satan a sympathetic, tragic figure. Making villains much more like evil cut-out,, I suspect, really only happened more recently in a widespread way. The earliest consistent examples I can think of would be in early 20th century pulp and noir novels (and likely in early penny dreadfuls). While some are more complex, many have very by the numbers plots and clear cut good guys / bad guys - often to exaggeration (looking at you Mickey Spillane). This trend got carried into early comic books to an extent as well. ",
            "date": "Answered July 31, 2020",
            "views": "221",
            "upvotes": " View 6 Upvoters",
            "upvoters": [
                {
                    "user_id": "George Corley",
                    "user_href": "/profile/George-Corley"
                },
                {
                    "user_id": "Marcus Gilchrist",
                    "user_href": "/profile/Marcus-Gilchrist-3"
                },
                {
                    "user_id": "Steven Haddock",
                    "user_href": "/profile/Steven-Haddock"
                },
                {
                    "user_id": "Dai McClymont",
                    "user_href": "/profile/Dai-McClymont"
                },
                {
                    "user_id": "Ilya Taytslin",
                    "user_href": "/profile/Ilya-Taytslin"
                },
                {
                    "user_id": "Ronit Pinto",
                    "user_href": "/profile/Ronit-Pinto-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Harold Cohn",
                "href": "/profile/Harold-Cohn-1"
            },
            "answer_text": "This my person opinion. If you have a weak heart read no further! When the American male became a wimp! The American hero used to be strong. Now he is wimp. This probably happened in the 1960’s with the hippies and the protest against the Vietnam War. The hippies standard saying was “Make love; not war!. And that they did. I had a one year in country tour in Vietnam aboard the USS Hartnett County, LST 821 in the Mekong Delta. The worse thing about the war was we had first class boatswain who was in love with Annette Funicello on the “ Micky Mouse CLUB”. So, for the next four month the movie of the day was Annette Funicello in “BEACH PARTY BINGO”. WAR IS HELL! BINGO! Harold ",
            "date": "Answered July 31, 2020",
            "views": "105",
            "upvotes": "0"
        }
    ]
}