{
    "title": "When, approximately, was the sword invented? - Quora",
    "tags": [
        "Sword Fighting",
        "Swords",
        "Invention and Inventions",
        "Weapons"
    ],
    "response": [
        {
            "author_info": {
                "name": "George Bertram",
                "href": "/profile/George-Bertram-3"
            },
            "answer_text": "From a brief search, the earliest sword ever found was from around 3300bc. I suspect it would have been around for a while before then, but that’s the oldest one found. Interestingly, a very rough and inaccurate calculation of dates and ages from the bible makes the first mention of a sword in that book from (very approximately) 4000bc, in the area that is now (probably, disputedly) Iran. (PDF) The collapse of 4th millennium centralized system at Arslantepe and the far-reaching changes in 3rd millennium societies ",
            "date": "Answered October 29, 2018",
            "views": "143",
            "upvotes": " Answer requested by Jordan Clarke-Bonhomme"
        },
        {
            "author_info": {
                "name": "Keith Allum",
                "href": "/profile/Keith-Allum"
            },
            "answer_text": "Other answers assume, very reasonably, the question implies a metal sword. However, given the abundant evidence of flint microliths - the stone age equivalent of the razor blade - I strongly suspect they are far, far older but that no physical or other evidence survives. It takes little imagination to progress from the club to one studded with stone edges set into gouged channels with resin/ From there the flattened paddle-like form of the Aztec and similar sword-clubs requires no imagination at all, as all it requires is time, suitable materials, imagination and improved ergonomics, as our ancestors were every bit as creative and resourceful as we are, they just lacked our many of advantages, not being able to find out how to make a lethally-sharp composite sword by watching a how-to channel on YouTube… ",
            "date": "Answered September 22, 2019",
            "views": "82",
            "upvotes": "0"
        }
    ]
}