{
    "title": "Where can you learn how to write poems? - Quora",
    "tags": [
        "Writing Poetry",
        "Poems",
        "Poetry",
        "Creative Writing",
        "Seeking Question"
    ],
    "response": [
        {
            "author_info": {
                "name": "Rick Leverton",
                "href": "/profile/Rick-Leverton"
            },
            "answer_text": "Oh, my dear, you learn to write poems when you have learned to listen to your soul. You learn to write poems when you explore w-h-a-t all the world around means to you.. defines you.. changes you. You learn to write poems when those walking in and out of your life, carelessly strum against the strings of your heart. You learn to write poems when your most hidden scars bristle with sharp tinglings as your fingertips gently brush over, and trace along the outlines. Where do you learn? I would say where is not as important as how. You learn by exploring. And you can explore anywhere. Practice. Practice everyday. Let it consume you. Write a hundred attempts before you fall in love with your first piece. And then write a hundred more. Write them in your head, on the way to school or work, while your eating.   Don't study the greats, until you've discovered yourself. Don't be afraid to develop your own style. Look to forums, and clubs, but be weary of false praise (feel-good praise). Do you want to grow? Unfortunately that requires taking a hard look at the mistakes you've made in your piece. Release yourself from the rising urge of defensiveness; a hard critique is not insulting you - it's showing you where you need improvement. Listen carefully to your peers, and especially the people that are many levels above you. They're taking their own time to help you, to show you where you need improvement, so be respectful. If the critique feels overly harsh, push that feeling aside and find the truth of what is being said. Look at peer examples. Look at critiques of peer examples. Are peers growing as a writers, or are they stagnant in their dismissive attitude?  Don't be afraid to rework something. But save all those drafts. Sometimes you might work on something for a month, and other times you feel satisfied with a few hours of work. Flush, flush, flush! Write random stuff - stream it from your subconsciousness.. pages at a time. Explore it. Don't be afraid of what comes out - don't censor yourself. Work with word play. Don't limit yourself to existing/popular meter and rhyme. Explore the sonics of words... and how they fit in your mouth.. how they roll off the tongue.. how they ride on the back of your breath. Stay away from a thesaurus, in the beginning, and over all. Force yourself to think, instead of turning to ready made answers. Explore words that stand out to you, in every day material, works, books, and speeches. Often the most beautiful of things are put together with the most simplest of words. But on the other side of that token, explore the texture of words you normally don't use in your everyday life or conversation. Words like: inconstant or incandescent - how do they sound? Play with phrases.. \"drunk with future promise and fortitude\". Finally, whatever you do.. don't tell us about something - describe it to us! Show me, dammit. Show me.  Poetry tends to be mostly confessional in material, so don't be surprised if most of your stuff is about yourself. It's easiest to write from what we know best, what we can feel, and what is intimate. As you become more comfortable with constructing poetry, try new perspectives and new subjects. The best place for source material, is talking with other people. Get them to talk, to open up, and just listen. I mean, really listen to what they're saying. A lot of times, when we talk, there tends to be a lot of bullshit, excess, hot air, that comes out. Learn to listen and pick out what they're really saying. It's not hard to get people to open up, but don't dominate the conversation. Let them do the talking, and only offer dialog that moves them along. This is how you learn about people. And when you learn about people, you can write about people. The personas you create in your work will have more dimensions to them.   Oh, and one more thing - imagination. You have it. Use it. Use it everywhere and on everything. Use it in your style, your word choice, your flow, etc. Use it, to think outside the box. Experiment, experiment, experiment. Everyone starts out in the box; the goal is to get beyond it. Climb out and see what other people's boxes look like. Decorate yours with crayons and colors. You get the idea.. hopefully. ",
            "date": "Updated March 28, 2016",
            "views": "12",
            "upvotes": " View 13 Upvoters",
            "upvoters": [
                {
                    "user_id": "Janna Montalbo",
                    "user_href": "/profile/Janna-Montalbo-1"
                },
                {
                    "user_id": "Shailendra Meena",
                    "user_href": "/profile/Shailendra-Meena-18"
                },
                {
                    "user_id": "Helen Lim",
                    "user_href": "/profile/Helen-Lim-34"
                },
                {
                    "user_id": "Shreyas Dambal",
                    "user_href": "/profile/Shreyas-Dambal"
                },
                {
                    "user_id": "Nikita Agarwal",
                    "user_href": "/profile/Nikita-Agarwal-62"
                },
                {
                    "user_id": "Ajay Zapadiya",
                    "user_href": "/profile/Ajay-Zapadiya-1"
                },
                {
                    "user_id": "Mahak Mehta",
                    "user_href": "/profile/Mahak-Mehta"
                },
                {
                    "user_id": "Eliana Mugar",
                    "user_href": "/profile/Eliana-Mugar"
                },
                {
                    "user_id": "Saumya Shukla",
                    "user_href": "/profile/Saumya-Shukla-17"
                },
                {
                    "user_id": "Lilie Diaz",
                    "user_href": "/profile/Lilie-Diaz"
                }
            ]
        },
        {
            "author_info": {
                "name": "Arpan Khosla",
                "href": "/profile/Arpan-Khosla"
            },
            "answer_text": "I think Rhymly is one such Android App that can help you write poems! Try us out on Google PLay store: Rhymly- Anybody Can Rhyme - Apps on Google Play Rhymly is a one-stop content tech platform that helps budding creative writers search rhymes & meanings of Hindi words, create original couplets while rhyming on the fly, discover & share talented writers & also get themselves featured on the app every day. We help Poets, Shayars, Songwriters, Rappers, ad agencies, jingle writers, etc.save a lot of time on their art pieces, break their writer's block, create more & a better quality of content & concentrate only on creativity while leaving the Vocabulary part to us. Our unique proposition is that we cover the entire process of short content rhyming, writing, storing, sharing & discovering on a single platform & a creative writer doesn’t need to go to multiple platforms for all these things. Some of our product screenshots:    Find & review us on Google PLay store: Rhymly- Anybody Can Rhyme - Apps on Google Play ",
            "date": "Answered May 26, 2018",
            "views": "125",
            "upvotes": "0"
        }
    ]
}