{
    "title": "Where can I learn how to write a blog? - Quora",
    "tags": [
        "Blog Writing",
        "Seeking Question",
        "Blogs",
        "Blogging"
    ],
    "response": [
        {
            "author_info": {
                "name": "Michael Gorman",
                "href": "/profile/Michael-Gorman-12"
            },
            "answer_text": "Something of a strange question. Where can I learn how to write a blog? We have to firstly address what you mean by ‘blog’, people who have something to offer, who possess skill and expertise, or at the very least great interest in a topic/subject/area tend to write blogs. Academics, journalists, writers, subject specialists. If you are interested in writing, in general. We also have a distinction between 3rd party/public blog sites, and fully independent self hosted blogs. For instance I work exclusively with independent publishers. You cannot really learn how to write a blog, you firstly have to have something worthwhile to present. For my people, the people who have a serious, and long term objective in building their blog/media company we have two distinct aspects: The IT, and technical demands of producing your blog, cPanel management, content management systems, cloud hosting, security and maintenance.Content production. Writing, subject development, video, audio and text production/presentation.So you have to determine what it is you want to present, and then choose which media platform you are going to select. In my opinion the only truly valuable platform is the one you privately own; nobody can dictate what you publish, or how you express it. If you already write, or if you already have expertise, you can produce a blog, there is no need to blog if you have nothing to offer. ",
            "date": "Answered April 29, 2019",
            "views": "158",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Jonathon Joseph",
                "href": "/profile/Jonathon-Joseph-4"
            },
            "answer_text": "There are many different silos when it comes to “writing a blog”. Each one has it’s own set of challenges, and there is a lot of information out there (for free) on the internet when it comes to completing each phase. Getting started First you need to pick your niche (topic). If this part doesn’t come easily to you, you might want to stop right there. It will be very important later on that your niche is something that BOTH entertains you and has an audience. Next you need to find a domain name that fits your niche. I suggest using GoDaddy for this part. Once you have your domain, you’ll want to get set up on Wordpress and pick your THEME (this is how your blog will look). Once all of these steps are completed, you officially have a blog. But this is just the beginning. Driving traffic This is the key component right here. Unless you are able to drive traffic to your website, you might as well just set yourself up with a journal in Microsoft Word. Driving traffic involves social media marketing, networking, and SEO (Search Engine Optimization). Again there is a lot of information out there on all these topics. Happy researching! Stay the course The biggest key is this: all of this stuff takes time!! You will likely have no traffic to your site in the early days. Many get discouraged at this phase and walk away. If you enjoy what you’re doing, stick with it! If you’re not enjoying the process itself, blogging probably isn’t for you. Take care! -JJ ",
            "date": "Answered March 22, 2020",
            "views": "81",
            "upvotes": "0"
        }
    ]
}