{
    "title": "Where are heaven and hell located? - Quora",
    "tags": [
        "Hell",
        "Heaven",
        "Afterlife"
    ],
    "response": [
        {
            "author_info": {
                "name": "Barry Blatt",
                "href": "/profile/Barry-Blatt-1"
            },
            "answer_text": "According to the Muggletonians heaven is about six miles above the surface of the Earth. They had analysed the Old Testament carefully and reconstructed the old Israellite conception of the universe -  As far as they were concerned the sky was a solid ceiling and heaven lay above it. They issued an edict against ballooning in the early 18th century, warning against bumping into it. Hell is in fact the surface of the Earth after the Day of Judgement, which in their opinion would involve God putting out the sun and stars and everyone being resurrected. They concluded that bodies of people will lay in their graves undisturbed until that day, when the Muggletonians would be transported to heaven leaving the unbelievers behind to suffer in darkness. In the words of Thomas Tomkinson, a leading figure in the sect after the deaths of the prophets Muggleton and Reeve, it’s founders - \"in which darkness they shall hear one another's doleful cries and cursed blasphemies, but shall never see one another's dreadful faces; neither can they stir from the place of their resurrection having bodies as heavy as lead and as black as pitch.\" Pretty grim eh? The Muggletonian interpretation of scripture was never exactly popular, but their Biblical scholarship and research was impeccable in their own opinion at least, and they’d lay a curse on you if you dared suggest they might be a little crack brained. It’s as good an explanation as any I’ve heard from a theologian, and at least the Muggletonian interpretation has the merit of eschewing windy and vague speculation about undetectable ‘spirit realms’ and souls that existed separate from the body and stuck solidly to a materialist interpretation of the Bible. Now where is Valhalla? And where is Hades? And what about the Bardo Thodol and that weird tunnelly bit between incarnations? Or Duat, where Thoth weighs hearts against a feather of Ma’at and feeds those too heavy with cares to Ammit the Devourer of Souls? ",
            "date": "Answered August 19, 2017",
            "views": "66",
            "upvotes": " View 23 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Art Abshire",
                    "user_href": "/profile/Art-Abshire"
                },
                {
                    "user_id": "Lee Zarras",
                    "user_href": "/profile/Lee-Zarras"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/Sheree-Hammond-3"
                },
                {
                    "user_id": "Eric Henderson",
                    "user_href": "/profile/Eric-Henderson-53"
                },
                {
                    "user_id": "Rick Fox",
                    "user_href": "/profile/Rick-Fox"
                },
                {
                    "user_id": "Arnez Bridges",
                    "user_href": "/profile/Arnez-Bridges"
                },
                {
                    "user_id": "Jude Ramnarine",
                    "user_href": "/profile/Jude-Ramnarine"
                },
                {
                    "user_id": "Leong Chuan Cheok",
                    "user_href": "/profile/Leong-Chuan-Cheok"
                },
                {
                    "user_id": "David Grosvenor",
                    "user_href": "/profile/David-Grosvenor-6"
                },
                {
                    "user_id": "Liz Laranja",
                    "user_href": "/profile/Liz-Laranja"
                }
            ]
        },
        {
            "author_info": {
                "name": "C Ale Saume",
                "href": "/profile/C-Ale-Saume"
            },
            "answer_text": "They are concepts that are going to be as real as you want them to be Heaven and hell are religious concepts that they do not exist, never in the history of humanity has anyone been able to confirm with real evidence that these places exist, When someone returns from heaven or hell with the due evidence verifiable by impartial groups, then there, and only there, we must start to worry a little. The Bible is an invention of people, with the sole purpose of being able to control people who were ignorant, the facts of the Bible must be seen as the interpretation of natural facts that could not be explained 2,000 or more years ago, do not let yourself be manipulated . All the religions of the world are human inventions, some of them include the concepts of heaven, paradise, hell, limbo, etc., depending on which of the intolerance clubs (religions) you join, are you going to have one of those things, all or none You see, there are many religions in the world, there are also many gods, if you ask a Christian, he will tell you that Christianity is the only true religion, the same will happen if you ask a Catholic, Jew, Muslim , etc., The arrogance of religions is one of the things that I move me away from them the most, Half of my family is Catholic and the other half is Jewish, for my profession (I was professor of anti-terrorism in the military academy) I had to study many religions, it is known that the greatest misfortunes in humanity have been caused by religious beliefs, so I think I have some knowledge in what I am saying. Why is one god more important or real than the other? Why is the Christian god real and Zeus or Thor are not? They are concepts created by man, the sad thing is that there is no way to prove with verifiable evidence any of those gods, We true atheists, we do not say that a god does not exist, we only say that in view of the evidence provided by the different groups that claim their existence, which lacks verifiable evidence, the existence of these gods is highly unlikely. Religions and the existence of a god was the way they had in ancient times to try to explain what they did not understand, for example, if we could go back 2000 years, and go to Galilee, it would be super interesting to ask the supposed Jesus to explain to us why that the sun does not come out at night, ask him what is lightning or thunder, they were natural phenomena that they could not understand at that time, therefore it was easier to attribute these phenomena to something or someone divine, in this way the discussion ended immediately , no one in antiquity would have dared to question a religious belief, would have been exposed to very severe penalties, exile, public ridicule, prison, and even death, we have countless examples of people who dared to think a little bit differently. example Galileo Galilei, he was an extremely intelligent person, he is the father of what we know today as \"Astronomy\", he was an engineer, a mathematician, etc. He, through his observations realized that the planets, all the planets, revolved around the sun, only because he discover this he was accused of heresy, and he almost lost his life, you see, at that time the thought that the idea that prevailed was that Earth was the center of the universe, created by a god, and that everything else revolved around the Earth, when discovering that this was not true, the whole doctrine of the church fell apart. Read, study the true history of your beliefs and the history of the bible, as it was created and written by people more than 300 years after the supposed death of Jesus, draw your own conclusions based on the evidence provided, When you study and investigate impartially about religious beliefs, you will realize that the concepts of heaven and hell are just another fictional story. ",
            "date": "Answered July 31, 2020",
            "views": "435",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Art Abshire",
                    "user_href": "/profile/Art-Abshire"
                },
                {
                    "user_id": "Joseph Reilly",
                    "user_href": "/profile/Joseph-Reilly-17"
                }
            ]
        }
    ]
}