{
    "title": "Where have Quora's popular writers gone? - Quora",
    "tags": [
        "Famous Quora Writers",
        "Quora Writers",
        "Popular Quorans",
        "Fame and Mass Popularity",
        "Writing"
    ],
    "response": [
        {
            "author_info": {
                "name": "Feifei Wang",
                "href": "/profile/Feifei-Wang-6"
            },
            "answer_text": "At 75K followers, I could consider myself a “popular writer\" on Quora. I’m still here, but a lot less active nowadays, for a few reasons. The biggest reason I feel less motivated to write on Quora is that Quora as a platform had changed over the years to the worse. It's a combination of a few factors, including: Inefficient, opaque, unfair admin actions against me and other writers I like.Rampant harassment, spam, vandalism left unchecked.Quora would seemingly purposefully pick my more controversial answers to promote in their Quora digest. Meaning, they would use my answers as clickbait to get angry outside users to sign up to Quora so that they get to spill their hate in my answers. They're getting garbage new users at my expense.Quora kept pushing out gimmicky features nobody asked for, yet refuse to make improvements on essential features (like the search function, duplicate questions, filters).Quora had switched its focus from “creating a great platform to share knowledge” to “how do we funnel more new users to our website.\" And because of this policy change, they had placed new user acquisition over quality improvement for existing users.The partner program had destroyed my motivation to answer questions. I don't know if any of the questions are genuine. Many times I've responded to a question only to find out it's nothing but a series of spam questions that the questioner didn't even follow. I feel cheated. I don't want to spend my time and energy to provide answers to spam questions just so some douchebag could make a penny.I think the last point is probably the final straw for me. And there are other things. People I like, people who write about critical things, didn't get followers. While people (usually young, handsome, straight, white, supposedly “nerdy\" men) who write garbage answers, joke answers, offensive answers, become popular because people think their stupid catchphrases are funny. And every year, Quora gives out their TW title. And every time I blocked a user with “TW 2018” on their credential, I realized Quora wanted to promote a different kind of writer than me and people I consider to be very worthy of TW. I'm not welcomed here. The content I enjoy reading is not welcomed here. I looked around at other so-called high profile “popular” users, only to realize that I've blocked 70% of them. As for the remaining 30%, about half are one-shot celebrity accounts with zero content update for years, about 1/3 are feel-good writers who write about their white upper-middle-class life filled with Instagram filtered travel pictures, luxury living, startup/investment advice for millionaires, 10 things to make you happy, what every woman should know before they hit 30… All that life-coach mumbo jumbo. And every one of those answers got over 5K upvotes. And don't get me started on the disgusting “Quora fan club,\" with questions like “Why <insert Quora popular writer> is so awesome?” How does that contribute to knowledge sharing?! I'm not salty. It's not about how they get upvotes, and I don't. It's not about comparing me to them. It's about what kind of content is pushed to my feed, what kind of people I interact with, and what type of environment I put myself in. Quora's opaque algorithm is most definitely pushing certain content to its audience. And since front-page real estate is limited, the “chosen ones\" by Quora would get more visibility, more upvotes. That's why “10 things you must know before 30” can get over 1K upvotes because Quora is purposefully pushing this type of content to its audiences. Before 2015, Quora was a social-platform. It provided a safe space for people to create content and share ideas. Ideas and content with more upvotes usually get more visibility (this is not without its faults). Quora after 2015 is a media platform. It cultivates certain types of content and content providers and pushes their chosen rhetoric to its audiences. Quora had effectively become a better, more sophisticated version of Buzzfeed. And for me, all of a sudden, even with my very cultivated Quora Feed which I read through every day, I found very few interesting things worth reading, even less worth answering. And from time to time, I found high-quality answers from great writers, well-researched answers that cover critical social issues, only to see those answers have less than 100 upvotes, and the writer has a less than 1K followers; while this other “top writer\" could generate over 1K upvotes by merely repeating his ridiculous “copyrighted” catchphrase for the 10 thousandth time or write about what they eat for lunch. It makes me question the company I keep and the value of my time spent on Quora. Since about 2015, I've been feeling isolated on Quora by the platform, and the content providers they want to attract. And I've kept telling myself that I stick around for my friends. I've been lucky that I made a few good friends from Quora. It's a lot of fun reading their answers. But beginning with 2018, that sense of isolation and being cast aside, being treated like a pariah, had become more and more prominent. And I have a lot of other more meaningful personal projects I want to do. I realized all of the time I spent on Quora, all the content I wrote over the years, I'm making money for Quora while neglecting my creative projects. So I decided to cut back my time to spend on this website and do something more meaningful instead.  Update: I want to talk a bit more about Quora admin and how the Quora platform had become more and more toxic for me. It’s been a common practice for Quora admin to silence the harassment complaints instead of dealing with it. I recently become the target of an anonymous user attack. The person had posted a string of questions similar to this and provide insulting answers.  Harassments and insults are a normal part of my Quora experiences. I’ve been told by the Admin that I shouldn’t engage, I just report and block. And I did. And the harassment never stopped. Every day I get on Quora, every day I block people because I was attacked. I used to have a blog called “Quora cesspool”, where I took screenshots of all the harassment and insults I get and post them. I don’t say anything about it, just what they post in public, I take a screenshot and post them on my blog. There’s no privacy issue since their comments and attacks are already in public space. I do it not to shame anyone (as I said, they post a public comment, they’ve already shamed themselves). But rather, I keep these screenshots because it is important for people being abused and bullied to keep a record. Because people wouldn’t believe how much BS I got. Quora promptly shut that blog down and slapped me with an edit lock. I was told that I can not take a screenshot of what’s already public comments and repost it. Things got worse since then. But I kept my head down. I just block and report. like a good little soldier, obey the rules. And then this anonymous person came up and they had posted a string of insulting questions and answers. Something I can not block. Something I saw every day when I check my notification. So I posted their answers (insults) because at least some of them are kind of funny. Admins, who have allowed this person to harass me for over a week, all of sudden send me a message:  So obviously, Quora admins care more about silencing the victims than removing the insulting content, edit lock/ban the harasser. And this is me, someone who had been with Quora since 2012, someone with over 70K followers, a content provider, the 1% users (as in 1% rule (Internet culture)). I don’t want special treatment. But from a business perspective, the 1%-content creators are the most valuable assets of any content driven website. And Quora couldn’t even bother to create a better environment for what sustains their website. They’d rather have more garbage new users, more gimmicky features nobody gives a shit about, more Patrons who making money on MY content… They’d rather ask me to shut the fuck up, than ban a cyberbully. The thing about Internet Harassment is that these things take a toll. It’s not about one insult or one threat. It’s about all of them, all the time, every day. Every day the first thing I do on Quora is to read comments and block people. There isn’t one single day where I don’t block people. And after I cut through all that crap, I would then read answers, answer questions. It takes a toll. I’m quite busy for the month of November, I’m doing NaNoWriMo (and other stuff). I don’t come to Quora that often. And I found my mood getting better. I’m more peaceful, less irritated. Not reading insults and threats every day has that effect on people I guess. I still like Quora, I have made so many good friends here. But… well, I’ve said enough already. ",
            "date": "Updated February 14, 2020",
            "views": "698",
            "upvotes": " View 3.6K Upvoters ",
            "upvoters": [
                {
                    "user_id": "Ellen Vrana",
                    "user_href": "/profile/Ellen-Vrana"
                },
                {
                    "user_id": "Kate Rothwell",
                    "user_href": "/profile/Kate-Rothwell"
                },
                {
                    "user_id": "Leila Thomas",
                    "user_href": "/profile/Leila-Thomas-11"
                },
                {
                    "user_id": "Emma Polman",
                    "user_href": "/profile/Emma-Polman"
                },
                {
                    "user_id": "Subiksha Venkat",
                    "user_href": "/profile/Subiksha-Venkat-4"
                },
                {
                    "user_id": "Victoire Smith",
                    "user_href": "/profile/Victoire-Smith-1"
                },
                {
                    "user_id": "Kenneth Mark Hopkins",
                    "user_href": "/profile/Kenneth-Mark-Hopkins"
                },
                {
                    "user_id": "Wydianne Van Megen",
                    "user_href": "/profile/Wydianne-Van-Megen-2"
                },
                {
                    "user_id": "Sury Franklin",
                    "user_href": "/profile/Sury-Franklin"
                },
                {
                    "user_id": "Lincoln Jung",
                    "user_href": "/profile/Lincoln-Jung"
                }
            ]
        },
        {
            "author_info": {
                "name": "Jon Mixon",
                "href": "/profile/Jon-Mixon-1"
            },
            "answer_text": "I was in rehab for a while, but now I'm back. No…I'm lying. I actually was out campaigning for Donald Trump, who is possibly the greatest president that country has ever seen. Sorry, that's a lie too. Both parts. Basically, I'm still here. While I have quit a few times and I have also threatened to quit, like an alcoholic after a bad breakup, I fell off of the wagon. In my heyday I used to be a somewhat popular individual on this site. However, I suspect that the following limited my popularity, and drove down my readership: My churlish and childish threats to quit the site - I lost a lot of credibility when I didn't walk it like I talked it.My lack of respect for certain people involved in the #metoo movement - I stated that I thought Rose McGowan and Asia Argento were full of shit and time has proven me to have been correct. That stance,however, cost a number of fragile readers who were angered that I dared to question those luminaries.My complete lack of respect for Donald Trump and his presidency - I used to have a number of conservative followers on here who dumped me (Hard to type this with tears hitting my keyboard) because I expressed my opinions about how incompetent and criminal that I thought he is. Since again I have been proven to be correct, I can only hope that some of those people will do everyone a favor and actually read something informative before they vote the next time.What seems to be an informal boycott by South Asian Quora members - Not certain if it was my answering questions which referenced media sources from the region that did it, or if it was my questioning why so many mediocre and terrible answers from the region received STAGGERING numbers of upvotes. When a lame story about a guy allegedly talking with his son (In screenplay format, no less) gets 50k upvotes, the system is broken, or it's being gamed. Perhaps it's both.My responses to my comments are apparently not deferential enough - I guess I am supposed to be impressed that someone has taken an hour to respond to my answer by crafting a verbose and incoherent narrative. It seems that I am also supposed to cheer when some genius declares for the 1,000th time that I “forgot\" something that was actually used in several other answers. And finally, I guess that my habit of deleting comments from people who take their criticism a little too far, or who forget that I'm not be paid to acknowledge their bullsh*t, has cost me some fans.C'est la vie. I was/am a “popular writer\" on here. Despite my empty threats to quit, I'm still here and I guess that I'll remain until they make me leave or until I'm banned from Internet usage as part of my plea agreement, whichever comes first. ",
            "date": "Updated January 24, 2020",
            "views": "5",
            "upvotes": " View 167 Upvoters",
            "upvoters": [
                {
                    "user_id": "Eleanor Ortiz",
                    "user_href": "/profile/Eleanor-Ortiz-8"
                },
                {
                    "user_id": "David Muccigrosso",
                    "user_href": "/profile/David-Muccigrosso"
                },
                {
                    "user_id": "Shmuel Newmark",
                    "user_href": "/profile/Shmuel-Newmark"
                },
                {
                    "user_id": "Andrew Steiner",
                    "user_href": "/profile/Andrew-Steiner-27"
                },
                {
                    "user_id": "Anna Cara",
                    "user_href": "/profile/Anna-Cara-6"
                },
                {
                    "user_id": "Alyssa Shick",
                    "user_href": "/profile/Alyssa-Shick-1"
                },
                {
                    "user_id": "John Reed",
                    "user_href": "/profile/John-Reed-280"
                },
                {
                    "user_id": "Steffi Weavers",
                    "user_href": "/profile/Steffi-Weavers"
                },
                {
                    "user_id": "Tim Faulkner",
                    "user_href": "/profile/Tim-Faulkner-5"
                },
                {
                    "user_id": "Jessica Massie",
                    "user_href": "/profile/Jessica-Massie"
                }
            ]
        }
    ]
}