{
    "title": "Where can I hide a love letter in my house? - Quora",
    "tags": [
        "Love Letters",
        "Letters (mail)",
        "Writing Advice"
    ],
    "response": [
        {
            "author_info": {
                "name": "Nishtha Gupta",
                "href": "/profile/निष्ठा-गुप्ता-Nishtha-Gupta"
            },
            "answer_text": "That's an interesting question, I must say! :p Well, I have always been a pro at hiding things so I think I'm capable to answer your question. Also I am an experienced person coz I had done a similar thing yet alone the fact that I was caught red handedly in the act, and unfortunately it was not a ‘love' letter, hahaha! ;) Coming back to your answer, let me narrate to you a ‘step by step' guide on how you can achieve your goal “Mission Prempatra ko kar do choomantar”😎💌 1. Firstly, you'll have to do an audit of your house! 2. You will have to select the places least likely to be visited by your parents/siblings. 3. Make a list of all the shortlisted locations and do a quality/ safety check. 4. For trial purpose, keep one of your mother's or your siblings most valuable possession hidden with you. 5. If you want to go by the longer route, check how many days it takes them to recall the thing on their own. But, if you prefer shortcuts, which is also the recommended way, just make them recall it. You will have to be careful while doing this step otherwise they will become obvious that you have hidden it. =_= 6. Make the plot all clear and choose some very obvious locations for them to find their valuables. Just check if they could reach to your secret location. 7. Quietly observe the locations where they search for their items. Tick the locations off your shortlisted list if you had included them to become your secret sites. 6. Note down the most and the least likely of them to get approached. Also see how long it takes for them to reach there; it will help in changing the place time to time, for better results. 7. If you are lucky, you will find at least one place where the possession could not be searched for. 9. Jot down the top locations and rate them based on ‘least likely to most likely- to be approached'. 10. At last, take God's name and keep your letter at the top-secret location (at your own risk) :| P.S. If you have already shown the letter at home, there's no point hiding it, you will anyway have to bear the consequences but if that's not the case you will have to do real hard work XD Speaking based on my personal experience, Indian mothers are the ‘real life Sherlock Holmes ki behenein' (Sherlock Holmes' sisters) who can see beyond what is visible. So, while doing your audits, be more careful to observe the complete spectrum of vision of your mother twice (just to confirm, you know)! Bonus: Some common places to hide can be- your old books which even you have forgotten about, below the pile of scattered clothes in your wardrobe, behind the poster on your wall or if you don't find anywhere else, you can also keep it below your self-esteem and inside your heart! With best wishes and more power, ❤️ Nishtha ^_^ P.P.S. : This was an answer for a good laugh and it should be considered for the same usage only. (Janhit me jaari) ",
            "date": "Answered October 16, 2020",
            "views": "94",
            "upvotes": " View 3 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Enosh Collins",
                    "user_href": "/profile/Enosh-Collins"
                },
                {
                    "user_id": "Alone Harsh",
                    "user_href": "/profile/Alone-Harsh"
                },
                {
                    "user_id": "Priyanka",
                    "user_href": "/profile/Priyanka-773"
                }
            ]
        },
        {
            "author_info": {
                "name": "Aarti Jangid",
                "href": "/profile/Aarti-Jangid-25"
            },
            "answer_text": "There are some ways by which you can hide your love letters . 1- In your wardrobe which no one opens rather than you like in locker of wardrobe . 2- you can click picture of your love letter and create and separate new folder of it . You can hide somewhere so that you don't need to see them in physical ,if you wanna see you can see in your phone . 3- you can create simple album of it and hide it somewhere ,so that you get all the letter at one place only .this will help you hide only the album not the all messup of letters. 4- As we live in digital world ,I think we rarely give love letter to each other ,you can tell them write all the things in message and you can keep that message's screenshot to get relief from this hiding problem . I hope this will help you .. If you like do like and share and upvote for me.. ",
            "date": "Answered October 16, 2020",
            "views": "13",
            "upvotes": " Answer requested by Alone Harsh"
        }
    ]
}