{
    "title": "Where do you use your visualization, and how does it help you in life? - Quora",
    "tags": [
        "Creative Visualization",
        "Visualization",
        "Data Visualization",
        "Imagination",
        "Important Life Lessons",
        "Self-Improvement",
        "Psychology of Everyday Life",
        "Philosophy of Everyday Life",
        "Life and Living"
    ],
    "response": [
        {
            "author_info": {
                "name": "Preshita Kudtarkar",
                "href": "/profile/Preshita-Kudtarkar"
            },
            "answer_text": "I visualize everything. Every single thing that I want I visualize and I get it. I started practicing the laws of the universe and since then I have been happier and more content with my life. Visualizing your dreams lets the universe know that you want it. And the more you think about the more universe see’s how bad you want it. That’s just how the universe works and it’s wonderful. Apart from this visualizing what I want and thinking about having it makes me feel so better. It lifts my mood. I feel peaceful and happy thinking that whatever I want is being prepared for me right now while I sit here and think about it. It helps me in life to not worry about my future and live in the moment. Cherish this days. Cause I don’t have to worry about my future. Have a wonderful day. ",
            "date": "Answered December 9, 2019",
            "views": "78",
            "upvotes": " Answer requested by Manish Sawant"
        },
        {
            "author_info": {
                "name": "Narayana Srikanth Reddy",
                "href": "/profile/Narayana-Srikanth-Reddy"
            },
            "answer_text": "I don't use visualisation, visualisation uses me It helps in seeing things from different perspectives and bringing in clarity Either you have a visual or you don't You can't force it According to me you cannot imagine the unimaginable It's just unimaginable period ",
            "date": "Answered December 9, 2019",
            "views": "22",
            "upvotes": "0"
        }
    ]
}