{
    "title": "Where can I sell my film script? - Quora",
    "tags": [
        "Movie Scripts",
        "Screenwriting",
        "Movie Production",
        "Movie Business and Industry"
    ],
    "response": [
        {
            "author_info": {
                "name": "Robert Tobin",
                "href": "/profile/Robert-Tobin"
            },
            "answer_text": "That’s like asking: how can I win an Olympic gold medal. Really. It’s damn near that hard to do. And that complicated. But in simplest terms, here’s what you do: first, you write at least ten feature film screenplays, because it takes that many scripts on average before you actually sell one, but that’s only if you rewrite and rewrite and rewrite each script until they’re the best they can be, and only if you never submit a first or second or even third or fourth script to any producer. Why? Because your scripts are not likely to be very good at that stage in your career, and if you submit a substandard script to a bunch of producers, you can kiss your career goodbye, because it’s a small community and you’ll be branded a substandard screenwriter and no-one will want to take your calls, much less your scripts. Here’s how you can tell when you’re ready to submit a script to the actual film industry (that means producers or film execs): if the script you want to submit has consistently made at LEAST the semi-finals of major competitions. When you do reach that stage in your writing career, subscribe to IMDB or (even better) IMDB Pro. Use the search facility to find producers who have produced your kind of scripts in the last ten years. Create a brilliant logline, a great synopsis, and an even better pitch letter. Send the pitch letter to the appropriate producers (not every producer in IMDB gives contact info, but many do). If they invite you to submit your script, do so. And while you’re waiting for a response, start your next script. Good luck. ",
            "date": "Updated February 15, 2019",
            "views": "8",
            "upvotes": " View 17 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Preston Abbey",
                    "user_href": "/profile/Preston-Abbey-1"
                },
                {
                    "user_id": "Hannah Benavides",
                    "user_href": "/profile/Hannah-Benavides-1"
                },
                {
                    "user_id": "Erfan Yaali",
                    "user_href": "/profile/Erfan-Yaali"
                },
                {
                    "user_id": "Gene Tallarico",
                    "user_href": "/profile/Gene-Tallarico"
                },
                {
                    "user_id": "Tyler Durden",
                    "user_href": "/profile/Tyler-Durden-681"
                },
                {
                    "user_id": "Xpert Jerry",
                    "user_href": "/profile/Xpert-Jerry"
                },
                {
                    "user_id": "Dipesh Baral",
                    "user_href": "/profile/Dipesh-Baral-13"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/Holy-Writer"
                },
                {
                    "user_id": "Ankur Singh",
                    "user_href": "/profile/Ankur-Singh-1893"
                },
                {
                    "user_id": "Lawal Mohammed",
                    "user_href": "/profile/Lawal-Mohammed-17"
                }
            ]
        },
        {
            "author_info": {
                "name": "Dan Hoffmann",
                "href": "/profile/Dan-Hoffmann-1"
            },
            "answer_text": "This is unfortunately a question that comes up, quite often because there are no good answers for it. People in the film industry such as myself and Lisa Clemens will tell you, time and time again that Screenplays aren’t really sold. It’s a mistake to think so. Today, Studios as well as Independent companies contact writers and commission them to write a screenplay, based on a story that the producers came up with or optioned. Look, I work in the industry and have done so for the past many years and if there were any other way to ‘sell’ your script, I would tell you. But I feel obligated to tell you about how the real industry works, in spite of all those that make a living from telling hopeful screenwriters,that they can sell their scripts. Today, the best you can hope for is to use your spec script as a calling card to show what you can do. And hopefully one day, you will land a job as a screenwriter based on your spec scripts, but when you do ( and I hope you will) then you can be sure that they will ask you to write someone else’s story because that is how it works. Yes, there are still a very few spec scripts being sold. But these are all sold by writers who are already established screenwriters. I had hoped to be the bearer of better news. ",
            "date": "Answered March 26, 2018",
            "views": "37",
            "upvotes": " View 6 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Angel Mihov",
                    "user_href": "/profile/Angel-Mihov"
                },
                {
                    "user_id": "Doris Yankson",
                    "user_href": "/profile/Doris-Yankson"
                },
                {
                    "user_id": "Walt Oxer",
                    "user_href": "/profile/Walt-Oxer"
                },
                {
                    "user_id": "Tyler Durden",
                    "user_href": "/profile/Tyler-Durden-681"
                },
                {
                    "user_id": "Waldon Volpiceli Alves",
                    "user_href": "/profile/Waldon-Volpiceli-Alves"
                },
                {
                    "user_id": "Bill Scott",
                    "user_href": "/profile/Bill-Scott-131"
                }
            ]
        }
    ]
}