{
    "title": "Where can I get good and affordable ink pens? - Quora",
    "tags": [
        "Fountain Pens",
        "Ink"
    ],
    "response": [
        {
            "author_info": {
                "name": "Abhishek Banerjee",
                "href": "/profile/Abhishek-Banerjee-86"
            },
            "answer_text": "The terms affordable and good are very relative. An affordable pen may or may not be good. It's your writing preference and budget which will decide the pen's price to performance ratio. I've listed below some options for you to choose your first Fountain Pen ( I'm assuming you're new to fountain pens ) : William Penn stores across the country are a great place to explore and try new pens. You can choose from their wide range of pens. You must look for their starter/beginner fountain pens as they are the cheapest (₹2000–5000).Amazon: You can buy fountain pens from Amazon. I'm not suggesting Flipkart/Snapdeal because I've had bad experiences with them including fake pens being sold for a premium price. Amazon sells Fountain Pens from almost all the brands available in India and at pretty decent prices. You can also buy the pens you shortlisted at William Penn from Amazon at better prices. Afterall, discounts are great :peBay: If you want to buy some Chinese fountain pens, then eBay is a great place to buy them. They are dead cheap and give pretty good performance.Local Stationary Shops: Not to forget our beloved stationary shops. Most of them have some good Fountain Pens at cheap rates. But try to stay away from Flair Inky and similar pens. You could try the Camlin Elegante and Camlin Trinity.I hope this helps. Happy Writing!! ",
            "date": "Answered May 9, 2017",
            "views": "324",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Mithu",
                    "user_href": "/profile/Mithu-8"
                },
                {
                    "user_id": "Parth Shekokar",
                    "user_href": "/profile/Parth-Shekokar"
                }
            ]
        },
        {
            "author_info": {
                "name": "Rohan Bhogle",
                "href": "/profile/Rohan-Bhogle"
            },
            "answer_text": "The ink pens are making a comeback :) You can find good starter ink pens, which are quite affordable, in almost any stationery shops nowadays. Here you will find all local brands like Flair, Camlin and Parker, and the pens will be mostly cartridge ones. These are reliable, no-fuss writers. If you want to further explore the fountain pen world, head to Fort area in Mumbai. Here you will find old players of the fountain pen world like Mitha Pen Mart, Shukla Pen Co. And Apsara Pens. They start from afforfable pens like Jinhao and Hero and go right up to Visconti, Pilot, Sailor and Mont Blanc. Here you get to hold and feel the pens so that you can find one which suits you. Happy exploring and happy writing :) ",
            "date": "Answered May 10, 2017",
            "views": "140",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Parth Shekokar",
                    "user_href": "/profile/Parth-Shekokar"
                }
            ]
        }
    ]
}