{
    "title": "Which author earns the highest royalty on the book? - Quora",
    "tags": [
        "Royalties",
        "Book Publishing",
        "Royalty",
        "Publishing",
        "Writers and Authors",
        "Literature",
        "Writing",
        "Salaries and Wages",
        "Book Recommendations"
    ],
    "response": [
        {
            "author_info": {
                "name": "Vishal A",
                "href": "/profile/Vishal-A-56"
            },
            "answer_text": "Royalty/author profit is the amount one gets on the sale of each book. Royalty might or might not be a direct percentage of the MRP (Maximum Retail Price) of the book. Quite often, I hear this doubt from writers - How much royalty would I get for my book? How much is this royalty amount as compared to what traditional publishers offer? In case of publishing an ebook, one gets royalty as a percentage of the Selling Price one fixes. For example, we have 35% and 70% royalty on the selling price on Kindle. Or say, 45% of the selling price is what you would get on Google Play. Ebooks do not have any upfront cost as in the case of print books – printing cost, packaging, shipping, etc. The percentage commission of the publishing platform is their margin for facilitating the entire set-up to authors. In the case of printed books, printing costs, packaging, shipping costs are incurred while selling them apart from the commission of the e-commerce platforms that enable online selling of the printed books. So the profit that remains after deducting all these costs goes to the author. This method of calculating royalty is prevalent in self-publishing. In traditional publishing, royalty is a fixed percentage – say 8% of the MRP. On the basis of the above comparison, I can definitely say that self-published authors receive more royalty as compared to traditionally published authors. If you are looking to self publish your book in that case BecomeShakespeare is the best option to consider. ",
            "date": "Answered July 23, 2020",
            "views": "12",
            "upvotes": "0"
        }
    ]
}