{
    "title": "Which is the best platform for writing about anything online? - Quora",
    "tags": [
        "E-Commerce"
    ],
    "response": [
        {
            "author_info": {
                "name": "Mark Shainblum",
                "href": "/profile/Mark-Shainblum-1"
            },
            "answer_text": "If you want to share your fiction or non-fiction online, there are a number of good options. Wattpad: Wattpad - Stories You'll Love - There’s a whole community and ecosystem here, and though I’ve never used it, I’ve heard good things about it.Medium dot com: Basically a very sophisticated blog platform in the format of a slick online magazine. It’s a really good (no pun intended) medium for sharing your writing online because it’s easy to use and your stories are formatted and presented professionally, so people take it more seriously. You can even create “magazines” of your own with content from multiple writers. Medium – Read, write and share stories that matterIf you’re writing fanfiction (that is, stories based on existing media franchises like movies, TV shows or novel series), FanFiction dot net is one of the best places to post. FanFictionYou can set up your own blog on sites like WordPress.com: Create a free website or blog or Blogger.com - Create a unique and beautiful blog. It’s easy and free or create a self-hosted blog on your own website.There are other outlets listed in this article, but it dates back to 2014, so some of the entries may be obsolete by now. 14 Free Platforms To Share Your Short Stories Online — Epic Brand Storytelling ",
            "date": "Answered February 3, 2018",
            "views": "453",
            "upvotes": " View 5 Upvoters",
            "upvoters": [
                {
                    "user_id": "Latagia Copeland-Tyronce",
                    "user_href": "/profile/Latagia-Copeland-Tyronce"
                },
                {
                    "user_id": "Yvette Thomas",
                    "user_href": "/profile/Yvette-Thomas"
                },
                {
                    "user_id": "Daniel Densus",
                    "user_href": "/profile/Daniel-Densus"
                },
                {
                    "user_id": "Nicole Ballard",
                    "user_href": "/profile/Nicole-Ballard"
                },
                {
                    "user_id": "Sujata Tripathi",
                    "user_href": "/profile/Sujata-Tripathi-2"
                }
            ]
        },
        {
            "author_info": {
                "name": "Shruti Singh",
                "href": "/profile/Shruti-Singh-2293"
            },
            "answer_text": "There are a huge number of platforms, apps, guest posting websites, and website builders that provide the facility for showcasing your content and putting it up online. However, they do not provide the required exposure and neither do the talented writers get rewarded. I recently found an app online named Kalaathon - which is a virtual stage for people who wish to share their talent and also stand a chance to get awarded with exciting cash prizes up to Rs. 5000 on a weekly basis! Kalaathon is a talent network where you can create amazing content and showcase it to a massive community that share similar interests. There are a lot of artists in the world that goes unnoticed. You can showcase your writings, quotes, poems, shayaris, etc. through pictures as well as videos in your voice. Not only will you get the required exposure for your content but also you can participate in contests, win amazing cash prizes, and also get featured online! You can download the app from Kalaathon - Best Talent Sharing App - Apps on Google Play. For more information, you can visit their website Win Cash Prizes Online! Cheers! I hope you find this helpful! :) ",
            "date": "Answered June 29, 2020",
            "views": "155",
            "upvotes": " View 6 Upvoters",
            "upvoters": [
                {
                    "user_id": "Casagear Home",
                    "user_href": "/profile/Casagear-Home"
                },
                {
                    "user_id": "Arpita Gulyani",
                    "user_href": "/profile/Arpita-Gulyani-1"
                },
                {
                    "user_id": "Jessica Woodson",
                    "user_href": "/profile/Jessica-Woodson-17"
                },
                {
                    "user_id": "Henry Jurk",
                    "user_href": "/profile/Henry-Jurk-38"
                },
                {
                    "user_id": "Hostirap",
                    "user_href": "/profile/Hostirap"
                },
                {
                    "user_id": "Arpita Gulyani",
                    "user_href": "/profile/Arpita-Gulyani"
                }
            ]
        }
    ]
}