{
    "title": "Which one is older, Sumerian cuneiform script or Egyptian hieroglyph? - Quora",
    "tags": [
        "Egyptian Hieroglyphic",
        "Cuneiform Script",
        "Egyptian Hieroglyphs",
        "Sumerian (language)"
    ],
    "response": [
        {
            "author_info": {
                "name": "Ismail Hamdy",
                "href": "/profile/Ismail-Hamdy"
            },
            "answer_text": "Cuneiform was developed by the ancient Sumerians of Mesopotamia c. 3500-3000 BC. The cuneiform script was developed from primitive writing in the late 4th millennium BC. Mesopotamia's \"Primitive literacy\" period spans roughly the 35th to 32nd centuries. The first documents unequivocally written in Sumerian date to the 31st century at Jemdet Nasr. That is, as far as I know, the oldest mentioned date of the appearance of Cuneiform. Hieroglyphs emerged from the preliterate artistic traditions of Egypt. For example, symbols on pottery from c. 4000 BC have been argued to resemble hieroglyphic writing. Primitive hieroglyphic symbol systems develop in the second half of the 4th millennium BC, such as the clay labels of a Predynastic ruler called \"Scorpion I\" ( Naqada IIIA period, c. 33rd century BC). The first full sentence written in hieroglyphs so far discovered dates from the Second Dynasty (28th or 27th century BC). So all in all, I’d say hieroglyphs were older, as primitive writing had appeared before Cuneiform. But maybe Cuneiform developed faster. ",
            "date": "Answered February 24, 2017",
            "views": "58",
            "upvotes": " View 16 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Christina Elsa Philip",
                    "user_href": "/profile/Christina-Elsa-Philip"
                },
                {
                    "user_id": "Ahmed Ibrahim-Ovic",
                    "user_href": "/profile/Ahmed-Ibrahim-Ovic"
                },
                {
                    "user_id": "Orchestro Group",
                    "user_href": "/profile/Orchestro-Group"
                },
                {
                    "user_id": "Kriston Scott",
                    "user_href": "/profile/Kriston-Scott"
                },
                {
                    "user_id": "Mark Wagdy El-Magrisy",
                    "user_href": "/profile/Mark-Wagdy-El-Magrisy"
                },
                {
                    "user_id": "Walter Smyth",
                    "user_href": "/profile/Walter-Smyth"
                },
                {
                    "user_id": "Brent Buchholz",
                    "user_href": "/profile/Brent-Buchholz"
                },
                {
                    "user_id": "Not Smiley",
                    "user_href": "/profile/Not-Smiley"
                },
                {
                    "user_id": "Georg Meng",
                    "user_href": "/profile/Georg-Meng"
                },
                {
                    "user_id": "Michael Pfister",
                    "user_href": "/profile/Michael-Pfister-5"
                }
            ]
        },
        {
            "author_info": {
                "name": "Ananthasegaram Rajasegaram",
                "href": "/profile/Ananthasegaram-Rajasegaram"
            },
            "answer_text": "Ancient sumerian / Summer Cuniform was older, it Period was over 3000, B.C. < Mesopotina / Akkadian / ur uniforms were older, Sumerian Cunifrom came later, ancient Period, the people should have problems in reading the cuniform, For. example- Sumerian Cunifom- < Supa Paka Neri-Supam Pakam Neri- Eelam Tamil>- in English-. Good Page / Side Law-, in these -< Neri / Law> well how to fallow the rules, But I don't think they had fallow it. ¨ Later- Sumerian / Egyptian build characters/ drawings / drawings that people can understand , same period, Cartoon drawing also made by Egyptians, Day to days their drawings seem to progress, The people also fallow the hieroglyphic signs, for example- < Hittite Civilization , eelam Civilization , Pho En icing Civilization , Hurian Civilization also fallow their drawing of -hieroglyphic signs. ( Man- Al ) ( Two men - Al-l,l,), in English you say men, but Ancient Sumerian point as -Al+l +l, it is little bit difficult to understand , By the way - Mayan Logografic also similar Practical, 1- Pakkal- Daytime / Afternoon , In sumerian hieroglyphic - Show the Sun in Tablet, < that mean we should think it is afternoon / daytime,>, Different people use different methods of their ideas, so, Cuniforms were difficult to read- En- Ra- Va- Ni - Pa r, -Ca nn- U da- < in English- My King is coming look through your eye, >, So, Egyptian hieroglyphic sign better to understand came latter, . ",
            "date": "Answered September 15, 2020",
            "views": "115",
            "upvotes": "0"
        }
    ]
}