{
    "title": "Which authors have the most interesting past before becoming an author? - Quora",
    "tags": [
        "Indian Authors and Writers",
        "Novelists",
        "Creative Writing",
        "Novels",
        "Writers and Authors",
        "Literature",
        "Writing",
        "Book Recommendations",
        "Books"
    ],
    "response": [
        {
            "author_info": {
                "name": "Mark Chandos",
                "href": "/profile/Mark-Chandos"
            },
            "answer_text": "I was a tinker tailor soldier spy before I became an epic poet in Italy. I was a German and French Linguist as a soldier. Went to the Military language school twice at Monterey California. Was sent back the University to pick up two degrees at full pay. Went to 2 flight schools in the glorious American south where good ol boys live. Was made an Officer pilot of helicopters and Airplanes in Italy and Arabia. While Commander of an Aviation unit in Italy and deployed my Helos to Norway above the arctic circle. Commander of Aviation company at Ft Bragg ..deployed to Suadi Arabia. Later, was a foreign military officer in Belgium, Luxembourg, Paris, Rome, Bonn. I was like a bull in a china closet in Europe. I spoke their language. No girl had a chance when I got my eyes on her. Drove sports cars with a girlfriend in every capital for 10 years. My last four years I was the officer in charge of training new NATO countries in Eastern Europe. Was in a different capital each week…Poland, Latvia, Lithuania, Estonia, London, Paris,…wore out 4 diplomatic passports. Wore out many young girls. Worked 2 years in Lisbon Portugal (where I went to Afghanistan) as a NATO contractor after ret from the military. Then I was done! I retired at age 47 in my house in Italy. See Ihad this thing I was working on for 30 years. Had to sell the penthouse apt in Stuttgart Germany due to rising taxes and regulations. Thats socialism baby! Its was a Good run for a young man….maybe too good…(I got spoiled) and now I could execute the plan I made when I was 17..to be the world’s greatest poet. (secretly working on it over the years) Now you can see it all come back in linguistic meters and magic see kosmoautikon.com ",
            "date": "Answered April 7, 2020",
            "views": "88",
            "upvotes": " Answer requested by Adam Bucklee"
        }
    ]
}