{
    "title": "Which are the best love story novels? - Quora",
    "tags": [
        "Love Stories",
        "Novel Recommendations",
        "Novels",
        "Romance (love)"
    ],
    "response": [
        {
            "author_info": {
                "name": "Ackansha Deoli",
                "href": "/profile/Ackansha-Deoli"
            },
            "answer_text": "There are many but I will name the latest. It is called THE HISTORY OF LOVE and it is by NICOLE KRAUSS. I am highlighting my favorite paragraphs from the book so you can get an idea about its beauty. “Once upon a time there was a boy. He lived in a village that no longer exists, in a house that no longer exists, on the edge of a field that no longer exists, where everything was discovered and everything was possible. A stick could be a sword. A pebble could be a diamond. A tree a castle. Once upon a time there was a boy who lived in a house across the field from a girl who no longer exists. They made up a thousand games. She was Queen and he was King. In the autumn light, her hair shone like a crown. They collected the world in small handfuls. When the sky grew dark they parted with leaves in their hair. Once upon a time there was a boy who loved a girl, and her laughter was a question he wanted to spend his whole life answering.” “And though you were grown up by then, you felt as lost as a child. And though your pride was broken, you felt as vast as your love for her. She was gone, and all that was left was the space where you’d grown around her, like a tree that grows around a fence. “For a long time, it remained hollow. Years, maybe. And when at last it was filled again, you knew that the new love you felt for a woman would have been impossible without Alma. If it weren’t for her, there would never have been an empty space, or the need to fill it.”  “Of course there are certain cases in which the boy in question refuses to stop shouting at the top of his lungs for Alma. Stages a hunger strike. Pleads. Fills a book with his love. Carries on until she has no choice but to come back. Every time she tries to leave, knowing it’s what has to be done, the boy stops her, begging like a fool. And so she always returns, no matter how often she leaves or how far she goes, appearing soundlessly behind him and covering his eyes with her hands, spoiling for him anyone who could ever come after her” “He died in a tree from which he wouldn’t come down. “Come down!” they cried to him. “Come down! Come down!” Silence filled the night, and the night filled the silence, while they waited for Kafka to speak. “I can’t,” he finally said, with a note of wist-fulness. “Why?” they cried. Stars spilled across the black sky. “Because then you’ll stop asking for me.” ",
            "date": "Answered March 8, 2017",
            "views": "162",
            "upvotes": " View 16 Upvoters",
            "upvoters": [
                {
                    "user_id": "Ruby",
                    "user_href": "/profile/Ruby-18"
                },
                {
                    "user_id": "Abhishek Sharma",
                    "user_href": "/profile/Abhishek-Sharma-5984"
                },
                {
                    "user_id": "Anshita Dubey",
                    "user_href": "/profile/Anshita-Dubey-2"
                },
                {
                    "user_id": "Anil Anke",
                    "user_href": "/profile/Anil-Anke"
                },
                {
                    "user_id": "Hassan Khan",
                    "user_href": "/profile/Hassan-Khan-318"
                },
                {
                    "user_id": "Rahul",
                    "user_href": "/profile/Rahul-1471"
                },
                {
                    "user_id": "Bhaskar C. Sharma",
                    "user_href": "/profile/भास्कर-च-शर्मा-Bhaskar-C-Sharma"
                },
                {
                    "user_id": "Sachin Yemul",
                    "user_href": "/profile/Sachin-Yemul"
                },
                {
                    "user_id": "Ravi Shankar",
                    "user_href": "/profile/Ravi-Shankar-757"
                },
                {
                    "user_id": "Swastika Verma",
                    "user_href": "/profile/Swastika-Verma-4"
                }
            ]
        },
        {
            "author_info": {
                "name": "Rishabh Naresh Goel",
                "href": "/profile/Rishabh-Naresh-Goel"
            },
            "answer_text": "I love reading love stories and here are a few favorites of mine. A) Paper Towns by John Green: Have you ever felt that the one you love is perfect? Like sheer perfection, nothing more, nothing less. Then this book is for you. This is John Green’s best work according to me. I know The fault in our stars is more famous but I like this one better (Having read all of them).Favorite quote: That's always seemed so ridiculous to me, that people want to be around someone because they're pretty. It's like picking your breakfast cereals based on color instead of taste.  B) The History of Love by Nicole Krauss: This book. I have no words to describe how amazingly beautiful it is. The quotes. The writing. All the three narrators make you feel for them. Though it does not quite close very well I feel, but this is a book I have read over and over again. Just because of the beauty of Nicole’s writing.Favorite quote: And if the man who once upon a time had been a boy who promised he'd never fall in love with another girl as long as he lived kept his promise, it wasn't because he was stubborn or even loyal. He couldn't help it.  C) The Princess Bride by William Goldman: Written in a fairy-tale style, this book will make you feel, make you cry and sometimes even want to punch the author in the face (Just because of the hardships the characters go through). If you want to feel like a kid again, read this book. You will not be disappointed.Favorite quote: Do I love you? My God, if your love were a grain of sand, mine would be a universe of beaches.  D) The Time Traveler's wife by Audrey Niffenegger: So Henry and Clare are no ordinary couple. They have known each other since Clare was six and Henry was thirty-six, and were married when Clare was twenty-three and Henry thirty-one. Impossible but true. You probably won’t remember much about this book after you finish reading it. But you will definitely remember how this book made you feel.Favorite quote: There is only one page left to write on. I will fill it with words of only one syllable. I love. I have loved. I will love.  Hope this helped. :) ",
            "date": "Answered May 29, 2016",
            "views": "124",
            "upvotes": " View 33 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Aarthi M",
                    "user_href": "/profile/Aarthi-M-84"
                },
                {
                    "user_id": "Ruby",
                    "user_href": "/profile/Ruby-18"
                },
                {
                    "user_id": "Viswash Mehta",
                    "user_href": "/profile/Viswash-Mehta"
                },
                {
                    "user_id": "Ranonymous",
                    "user_href": "/profile/Ranonymous-2"
                },
                {
                    "user_id": "Archit Narayan",
                    "user_href": "/profile/Archit-Narayan-3"
                },
                {
                    "user_id": "Manjusri Sakthi",
                    "user_href": "/profile/Manjusri-Sakthi"
                },
                {
                    "user_id": "Sandip Patel",
                    "user_href": "/profile/Sandip-Patel-53"
                },
                {
                    "user_id": "Farooq Ahmed",
                    "user_href": "/profile/Farooq-Ahmed-42"
                },
                {
                    "user_id": "Heena Anjum",
                    "user_href": "/profile/Heena-Anjum-4"
                },
                {
                    "user_id": "Yatender Rawat",
                    "user_href": "/profile/Yatender-Rawat-4"
                }
            ]
        }
    ]
}