{
    "title": "Which fictional book character can you relate to the most? - Quora",
    "tags": [
        "Fiction",
        "Fictional Characters",
        "Reading"
    ],
    "response": [
        {
            "author_info": {
                "name": "Amie Greenaway",
                "href": "/profile/Amie-Greenaway"
            },
            "answer_text": "Well, I hope that nobody takes this answer as being offensive in any way, but I would say Scarlett O’Hara from the book and movie Gone With The Wind. The reason I’m a bit worried about someone maybe taking offense is because I know that the book deals with slavery, and not in the most enlightened way. That is far from the main focus or subject of the book, however. Much of the novel and movie is set during the Civil War, so some discussion of slavery is inevitable. OK, that being said, I always very much admired Scarlett, because she never gave up and never stopped pursuing her goals. She was very flawed and didn’t realize until the end that she had really been in love with Rhett for a long time, not Ashley. Ashley was never a good match for her, because he was weak in a fundamental way. Scarlett was selfish and manipulative, but she knew it and owned it. She was extremely determined to survive and become a successful businesswoman after the war was over, and she did. She was also always loyal to her family, even those she intensely disliked. She worked harder than anyone to provide for all of her relatives. She had a close, loving relationship with both of her parents also. Even after she had been publicly humiliated by untrue rumors that she was having an affair with Ashley, she still had the courage to go to the large party and face everyone with her head held high. At the end of the book/movie, Rhett announces that he no longer cares about her and is leaving her. She’s devastated, but the last scene shows that she is determined to win him back, and she is confident that she’ll be able to do it. Maybe I also relate to Scarlett because I was born in Georgia and lived there as a child. Maybe because I am also half Irish like her. Maybe because I used to be a terrible flirt with the boys too! Finally, perhaps because I have been through extremely tough times and have had to fight for myself like her. I am a very determined person, too.  ",
            "date": "Answered April 3, 2018",
            "views": "25",
            "upvotes": " View 19 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Dick Graes",
                    "user_href": "/profile/Dick-Graes"
                },
                {
                    "user_id": "Jodi Boynes",
                    "user_href": "/profile/Jodi-Boynes"
                },
                {
                    "user_id": "Nyakim Nyuon",
                    "user_href": "/profile/Nyakim-Nyuon"
                },
                {
                    "user_id": "Denise Dennison",
                    "user_href": "/profile/Denise-Dennison-3"
                },
                {
                    "user_id": "Lidia Korzeniowska -Góra",
                    "user_href": "/profile/Lidia-Korzeniowska-Góra"
                },
                {
                    "user_id": "Anne",
                    "user_href": "/profile/Anne-1144"
                },
                {
                    "user_id": "Anastasia Waters",
                    "user_href": "/profile/Anastasia-Waters"
                },
                {
                    "user_id": "Donnie Hill",
                    "user_href": "/profile/Donnie-Hill-3"
                },
                {
                    "user_id": "Sandra Meyer",
                    "user_href": "/profile/Sandra-Meyer-17"
                },
                {
                    "user_id": "Christina V. Oderschvank",
                    "user_href": "/profile/Christina-V-Oderschvank"
                }
            ]
        },
        {
            "author_info": {
                "name": "Max Woodcock",
                "href": "/profile/Max-Woodcock"
            },
            "answer_text": "As much as some people would like to believe otherwise, I believe that every single person can relate at least partially to one or more of the several diverse characters in the novel Lord of the Flies. The book is an exceptional allegory, with each of the boys representing not only a type of personality, but also an aspect of our society. I will elaborate on this with some of the main characters. Ralph:  Ralph is the first of the boys to prioritise order after the plane crash. He assembles all of the boys and establishes the need for rules, as well as asserting his authority. As a result of his confidence, natural leadership and just reasoning, Ralph is elected chief of the boys and gives the orders to the rest of the boys. Ralph represents humanities instinct for civilisation and order. Piggy:  Piggy is without doubt the smartest and most rational of the boys on the island. His cleverness leads to many innovative ideas that help the boys in their efforts to survive and be rescued. However, due to his unfortunate physical appearance and “nerdy” personality, he is immediately bullied and neglected by the group, being seen as inferior and on the bottom of the social hierarchy. Piggy represents the scientific, rational aspect of society. Jack:  Jack is essentially the antagonist of the novel. His rough, often mean personality gets him elected as the leader of the hunters, however he is power hungry and big headed, and eventually challenges Ralph for total leadership and control over the group. Jack is essentially the bully in the group. As time on the island passes, Jack’s primal instincts emerge, as he becomes increasingly manipulative, barbaric and savage. Jack’s character is antithetical to Ralph’s, as he represents the primal instincts of human society. Simon:  Simon is the most morally “good” character in the novel. He is shy and sensitive, but is at all times kind, caring and selfless, especially towards the littluns’ (younger kids), who are often mistreated by most of the older boys. Simon’s personality doesn’t change as time passes on the island, justifying that his actions and personality are inherent as opposed to something that has been forced upon him by society. Simon represents a natural goodness in society. In summary, I personally believe that I can relate to Piggy’s reasoning and scientific personality, being a science enthusiast myself, but also to Ralph’s confidence and leadership, as I have a bad habit of assuming that I know what’s best in many situations rather than being more open-minded and collaborating with those I’m working with. I also hope that I am morally kind and selfless like Simon, and strive for this to be the case. ",
            "date": "Answered December 9, 2016",
            "views": "21",
            "upvotes": " View 8 Upvoters",
            "upvoters": [
                {
                    "user_id": "Dick Graes",
                    "user_href": "/profile/Dick-Graes"
                },
                {
                    "user_id": "Marcus Gilchrist",
                    "user_href": "/profile/Marcus-Gilchrist-3"
                },
                {
                    "user_id": "Ryan Newman",
                    "user_href": "/profile/Ryan-Newman-52"
                },
                {
                    "user_id": "Pilar Cidre",
                    "user_href": "/profile/Pilar-Cidre"
                },
                {
                    "user_id": "Vishnu Prakash",
                    "user_href": "/profile/Vishnu-Prakash-91"
                },
                {
                    "user_id": "Daniel Fitton",
                    "user_href": "/profile/Daniel-Fitton-2"
                },
                {
                    "user_id": "Mia Piper",
                    "user_href": "/profile/Mia-Piper-2"
                },
                {
                    "user_id": "Bennett W. Nelson",
                    "user_href": "/profile/Bennett-W-Nelson"
                }
            ]
        }
    ]
}