{
    "title": "Which is the famous book of Chetan Bhagat? - Quora",
    "tags": [
        "Chetan Bhagat (author)",
        "Literature",
        "Fame and Mass Popularity",
        "Book Recommendations"
    ],
    "response": [
        {
            "author_info": {
                "name": "Akram Ishtiyaq",
                "href": "/profile/Akram-Ishtiyaq"
            },
            "answer_text": "I remember As a Teenager My First English novel was ‘Three Mistakes of my life‘. I was not very good at English language that time and someone suggested me this novel as it is written in simple English language so it was not so hard to begin with. After Completing this I became a regular reader of Chetan bhagat’s fiction and after him I came to know about a big world of books (fiction-non fiction / Good reads) . Not only this the hunger & love for reading made me work in a book store (cross word in Mumbai - My First job when I landed to the city) Here are some of his famous novels (books) Here we go 👇 Story set-up is in my HomeTown Varanasi. Revolution 2020 next Chetan Bhagat book to be adapted for film. After the phenomenal success of Kai Po Che!, Disney UTV is producing a movie based on another of author Chetan Bhagat's bestseller Revolution 2020 - and has roped in Raj Kumar Gupta to direct the screen adaptation of the novel.  Now a motion picture with the Same name.  Now a motion picture - Kay Po che, Sushant Singh Rajput, Amit Sadh's debut film.  Now a motion picture with the same name Half girlfriend  Amir Khan & Kareena Kapoor Khan's film ‘3 Idiots' Directed by Rajkumar Hirani is Based on this Novel.  Hope some production house or studio will soon anounce to produce a film on this.  Now a Motion picture ‘ Hello ‘  This will also going to become a motion picture Sooner or later.  Hope you like the answer. Stay blessed Thanks 😊 ",
            "date": "Answered July 24, 2020",
            "views": "16",
            "upvotes": " View 10 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Jatin Dingria",
                    "user_href": "/profile/Jatin-Dingria"
                },
                {
                    "user_id": "Vishavjeet Gumber",
                    "user_href": "/profile/Vishavjeet-Gumber"
                },
                {
                    "user_id": "Sarthak Dang",
                    "user_href": "/profile/Sarthak-Dang-3"
                },
                {
                    "user_id": "Smart Tech Info",
                    "user_href": "/profile/Smart-Tech-Info-1"
                },
                {
                    "user_id": "Rimtha Fabin",
                    "user_href": "/profile/Rimtha-Fabin-1"
                },
                {
                    "user_id": "Ayan Zubair",
                    "user_href": "/profile/Ayan-Zubair-1"
                },
                {
                    "user_id": "Naina",
                    "user_href": "/profile/Naina-391"
                },
                {
                    "user_id": "Varshashree Iyemperumal",
                    "user_href": "/profile/Varshashree-Iyemperumal"
                },
                {
                    "user_id": "Satyaban Debnath",
                    "user_href": "/profile/Satyaban-Debnath"
                },
                {
                    "user_id": "Nawaldeep Pradhan",
                    "user_href": "/profile/Nawaldeep-Pradhan-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Nikita Soni (Njkinny)",
                "href": "/profile/Nikita-Soni-Njkinny"
            },
            "answer_text": "I would rate Chetan Bhagat Books in the below order The Girl in Room 105Two StatesThe Three Mistakes of My lifeOne Night at the Call CenterOne Indian GirlRevolution 2020Five Point SomeoneHalf Girlfriend",
            "date": "Answered July 10, 2020",
            "views": "239",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Raj Nakar",
                    "user_href": "/profile/Raj-Nakar"
                }
            ]
        }
    ]
}