{
    "title": "Which is better for learning how to improve creative writing, 'fictional novels' or 'none fictional novel'? - Quora",
    "tags": [
        "Fiction Writing",
        "Novel Writing",
        "Novel Recommendations",
        "Fiction",
        "Creative Writing",
        "Novels",
        "Writing Advice",
        "Writing",
        "Book Recommendations"
    ],
    "response": [
        {
            "author_info": {
                "name": "Douglas Boulter",
                "href": "/profile/Douglas-Boulter"
            },
            "answer_text": "Not sure what you are asking. A fictional novel would be a novel that doesn’t actually exist. Assuming you have a typo and in the second part mean a non-fictional novel, then that would be a novel that actually exists. All novels are fiction. That is a part of the definition of the word. So if you are asking about a piece of non-fiction writing versus a piece of fiction writing — well it would depend on the author and the subject on which (s)he is writing. It also depends on what area of creative writing you are wishing to improve. Good writing is good writing and bad writing is bad writing. You can learn a lot from both of them. The thing to do is to read everything with a critical eye. Figure out what you like and what you dislike about the writing of each author. Try to emulate the things that you like and to avoid the things you do not like. I have found that seeing things that I don’t like in the writing of others sensitizes me to that aspect in my own writing — and I work to change that. In my opinion, the best method to improve your writing is to read a lot and to critique what you read. If you like something — a sentence, a paragraph, a description, a way of showing the characteristics of a character, note it and then decide why you like it. Same thing if you don’t like something. Once you recognize what you like and what you don’t like, and why you like or don’t like it, you’ll be more able to either emulate or avoid the same things in your own writing. It also doesn’t hurt to have a trusted person to give their opinion on what you write — we tend to call these people ‘beta-readers’. They point out what works for them and what doesn’t. I’ve written over a dozen novels, and I’ve found all of the above to be helpful. The other thing is to keep writing. One learns by doing. You can have all of the ‘teaching’ that you can stand, know all the theoretical plusses and minuses, but still be unable to write anything worthwhile. Practice may not make perfect, but it certainly helps. Don’t be afraid to “fail”. Failure in writing isn’t actual failure, it is just practice which will show you where you need to improve. My first attempt writing a short novel was so filled with errors that I would hesitate to show it to anyone. A lot of bad writing — to say the least. But with each successive attempt at creative writing, I found I knew more, could write more easily and better. So, read a lot — both fiction and non-fiction. Read with the intent of figuring out what works for you and what doesn’t. Write a lot. You will get better if you continually strive to do your best. Your best will get better — with or without feedback from another person as long as you give yourself feedback. That self-feedback usually occurs by re-reading your works some time after it has been completed. As I read my own early works, I sometimes cringe. But I had done my best at that time. I got better. I hope I still am improving. Good luck with your writing. ",
            "date": "Answered September 29, 2020",
            "views": "127",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Ilana Halupovich",
                    "user_href": "/profile/Ilana-Halupovich"
                },
                {
                    "user_id": "Pat Brown",
                    "user_href": "/profile/Pat-Brown-10"
                },
                {
                    "user_id": "Susan Green",
                    "user_href": "/profile/Susan-Green-244"
                },
                {
                    "user_id": "Harikirtan Das Worlu",
                    "user_href": "/profile/Harikirtan-Das-Worlu"
                }
            ]
        },
        {
            "author_info": {
                "name": "Dale Denton",
                "href": "/profile/Dale-Denton-1"
            },
            "answer_text": "Novels are, by definition, fiction, so I don’t think you asked your question correctly. I think you’re trying to distinguish between fiction and non-fiction as far as improving your creative writing. I will cast my vote for fiction. First, you are in some way creating your entire world since all of the characters in this world are totally of your imagination, even if you place it totally within the real world as-is. Chances are that unless you are writing about an place that you are intimately familiar with, you will be making up at least some things about the location. In my case, I’ve set my story in a real location, though not one I’ve been to (though I’m somewhat familiar with the general area), and based around 40 years ago, so I am not even trying to pretend to show the real town. Instead, I’m using my imagination to create what a small town might look like in that area in 1978 and going from there. I don’t have any real need to care if the diner in the town is really called George’s or Yum or Marie’s, nor what the name of the school might be. I’ll simply name them as I wish to create them. I may even change the name to something fictional simply to completely take it out of the “real” world setting. When you’re dealing with non-fiction, your creativity is limited. You are working with facts. A textbook is non-fiction, as is a biography or other documentary, so while you are still working with word choices and how to write it, you don’t have the creativity you do with fiction. You have some literary license or artistic expression, but not much. Historical novels can bridge the gap. While the novel I was talking about in theory takes place 40 years ago in a “real” town, it doesn’t qualify as a historical novel. I’m not dealing with any historical event (aside from the general timeframe), and I’m not really even dealing with the town in a real sense. Historical novels usually involve at least the location and the timeframe, and in many cases involve specific historical events, whether that be the American Revolution, Jack the Ripper, the Opium Wars, et al. With these, you have to be true to facts of the timeframe, and to the facts of the specific historical events within your novel. That said, I do have to be mindful that my novel is in 1978. No cellphones, no PacMan, no designer jeans (Levi’s and Wranglers, mainly), no personal computers, video games were very simple games and many tvs were still large pieces of furniture. No VCRs, let alone DVDs or CDs. 8-tracks and cassettes were the name of the game. The phone company owned your phones for the most part. Those are some of my limitations, and what I get to play with, which makes it easier to isolate my characters, too. ",
            "date": "Answered October 5, 2020",
            "views": "49",
            "upvotes": " View 2 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Ilana Halupovich",
                    "user_href": "/profile/Ilana-Halupovich"
                },
                {
                    "user_id": "Michael Watson",
                    "user_href": "/profile/Michael-Watson-388"
                }
            ]
        }
    ]
}