{
    "title": "Which are some of the best mystery movies? - Quora",
    "tags": [
        "Mysteries",
        "Movie Lists",
        "Best of X",
        "Movie Recommendations"
    ],
    "response": [
        {
            "author_info": {
                "name": "Shriram Ramesh Iyer",
                "href": "/profile/Shriram-Ramesh-Iyer"
            },
            "answer_text": "Thanks for the A2A. Make sure that you are checking out the entire list.  Black Swan (2010) ​  ​Nina Sayers is a dancers with a New York City ballet company. She is dedicated to her art and her craft but lacks confidence. She is also pressed on by her domineering mother, also a ballerina in her youth, who gave up dancing when she got pregnant with Nina. Nina seems to achieve her goal when the company's artistic director Thomas Leroy selects her as the lead in their new production of Swan Lake. Leroy is honest however in telling her that while he has no doubt she can handle the role of the white swan, he's not sure she can handle the role of the black swan. Adding to her self-doubts is the arrival of a new dancer, Lily, who seems ideally suited to playing the black swan. To succeed, Nina will will have to transform herself into something she has never been.  Shutter Island (2010)   ​Federal Marshall Teddy Daniels and his new partner Chuck Aule travel to a government-run mental institution for the criminally insane on Shutter Island, near Boston, when there is a report that one of the prisoners has gone missing. Daniels has his own reasons for wanting to get to the island and carries baggage of his own. He is still traumatized from what he saw when his army unit liberated one of the Nazi concentration camps at the end of World War II and is still haunted by the more recent death in a fire of his wife. The head of the hospital, Dr. John Cawley, treats him alright but others give the agents a less than warm reception. Daniels particularly wants to find out what is going on in one of the wards, reserved for the most serious offenders. As Daniels begins to peal away the layers of deceit, it becomes obvious that not all is as it seems.  The Others (2001)   ​It's nearing the end of the Second World War and Grace Stewart lives with her photosensitive children in a large and silent house. After her previous servants went missing, Grace accepted the offers of work from three new servants. Since these three have entered the home, strange events occur, and Grace begins to wonder if it's her sanity getting the better of her or if there is something much more in the house with them.  The Usual Suspects (1995) ​  ​Police investigating an exploded boat on a San Pedro pier discover 27 bodies and $91 million worth of drug money. The only survivors are a severely burned and very scared Hungarian terrorist and Verbal Kint, a crippled con-man. Reluctantly, Kint is pressured into explaining exactly what happened on the boat. His story begins six weeks earlier with five criminals being dragged in by New York police desperate for suspects on a hijacked truck and ends with the possible identification of a criminal mastermind.  The Green Mile (1999)   ​It's just another normal day on the Green Mile for prison guard Paul Edgecomb. That is until huge John Coffey is sent there. Unlike the hulking brute that Coffey looks like, he is in fact kind at heart. Whilst watching over Coffey, Edgecomb learns that there is more to Coffey than can be seen.  Gone Girl (2014)   ​Nick and Amy Dunne are a couple living in a small town in Missouri. Nick calls the authorities when she goes missing but something is off about his behavior. Is he hiding something? Is he sad or distraught enough? While the police continue their investigation, Nick is battling a media frenzy and the people who believe his innocence is dwindling by the minute.  Minority Report (2002)   ​In the year 2054 A.D. crime is virtually eliminated from Washington D.C. thanks to an elite law enforcing squad \"Precrime\". They use three gifted humans (called \"Pre-Cogs\") with special powers to see into the future and predict crimes beforehand. John Anderton heads Precrime and believes the system's flawlessness steadfastly. However one day the Pre-Cogs predict that Anderton will commit a murder himself in the next 36 hours. Worse, Anderton doesn't even know the victim. He decides to get to the mystery's core by finding out the 'minority report' which means the prediction of the female Pre-Cog Agatha that \"might\" tell a different story and prove Anderton innocent.  Kiss Kiss Bang Bang (2005)   ​Mistaken for an actor, small-time crook, Harry Lockhart, finds himself in the midst of the Hollywood community. Hes paired up with private detective \"Gay Perry\" to get some training for his role, but things begin to get weird when they witness a real murder.  Basic Instinct (1992)   ​Former rock star and San Francisco nightclub owner Johnny Boz is found murdered in his bed. Detective Nick Curran is assigned to the case; he has a history of alcoholism and drug abuse although he is clean now. The prime suspect is Catherine Tramell, an attractive and manipulative novelist who had been seeing Boz for a while. Police psychiatrist Beth Gardner (who happens to be Nick's ex-girlfriend) is brought in on the case when it is discovered that Boz's murder was copied directly from one of Catherine's novels. Nick starts to get too involved and everyone seems to be a suspect.  Se7en (1995)   ​This thriller portrays the exploits of a deranged serial-killer. His twisted agenda involves choosing seven victims who represent egregious examples of transgressions of each of the Seven Deadly Sins. He then views himself as akin to the Sword of God, handing out horrific punishment to these sinners. Two cops, an experienced veteran of the streets who is about to retire and the ambitious young homicide detective hired to replace him, team up to capture the perpetrator of these gruesome killings. Unfortunately, they too become ensnared in his diabolical plan....  The Prestige (2006) ​  ​Two magicians who used to be partners' battle over years in order to create a flawless method for the ultimate disappearing trick, \"the Transported Man\", turns into an informal war between them and soon, they will do anything to be able to preform the trick sooner and better than the other; which as time passes makes their friends and loved ones get away from them and little-by-little destroys their lives until they eventually succeed to preform the trick- each by a very different way.  Zodiac (2007)   ​A serial killer in the San Francisco Bay Area taunts police with his letters and cryptic messages. We follow the investigators and reporters in this lightly fictionalized account of the true 1970's case as they search for the murderer, becoming obsessed with the case. Based on Robert Graysmith's book, the movie's focus is the lives and careers of the detectives and newspaper people.  The Sixth Sense (1999)   ​ Malcolm receives an award on the same night that he is visited by a very unhappy ex-patient. After this encounter, Crowe takes on the task of curing a young boy with the same ills as the ex-patient. This boy \"sees dead people\". Crowe spends a lot of time with the boy (Cole) much to the dismay of his wife. Cole's mom is at her wit's end with what to do about her son's increasing problems. Crowe is the boy's only hope.  Memento (2000)   ​Memento chronicles two separate stories of Leonard, an ex-insurance investigator who can no longer build new memories, as he attempts to find the murderer of his wife, which is the last thing he remembers. One story line moves forward in time while the other tells the story backwards revealing more each time.  The Girl with the Dragon Tattoo (2011)   ​This English-language adaptation of the Swedish novel by Stieg Larsson follows a disgraced journalist, Mikael Blomkvist (Daniel Craig), as he investigates the disappearance of a wealthy patriarch's niece from 40 years ago. He is aided by the pierced, tattooed, punk computer hacker named Lisbeth Salander (Rooney Mara). As they work together in the investigation, Blomkvist and Salander uncover immense corruption beyond anything they have ever imagined.   Inception (2010)   ​Dom Cobb is a skilled thief, the absolute best in the dangerous art of extraction, stealing valuable secrets from deep within the subconscious during the dream state, when the mind is at its most vulnerable. Cobb's rare ability has made him a coveted player in this treacherous new world of corporate espionage, but it has also made him an international fugitive and cost him everything he has ever loved. Now Cobb is being offered a chance at redemption. One last job could give him his life back but only if he can accomplish the impossible-inception. Instead of the perfect heist, Cobb and his team of specialists have to pull off the reverse: their task is not to steal an idea but to plant one. If they succeed, it could be the perfect crime. But no amount of careful planning or expertise can prepare the team for the dangerous enemy that seems to predict their every move. An enemy that only Cobb could have seen coming.  L.A. Confidential (1997)   ​Three detectives in the corrupt and brutal L.A. police force of the 1950s use differing methods to uncover a conspiracy behind the shotgun slayings of the patrons at an all-night diner in this lush tribute to tough film noir crime films. Based on the multi-layered James Ellroy novel.  PS: This list is based on the films I have seen and its my personal favourite. ",
            "date": "Answered October 28, 2015",
            "views": "623",
            "upvotes": " View 85 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Kilambi Srinivasan",
                    "user_href": "/profile/Kilambi-Srinivasan"
                },
                {
                    "user_id": "Ashish Kharb",
                    "user_href": "/profile/Ashish-Kharb-4"
                },
                {
                    "user_id": "Jake Rocco Dolan",
                    "user_href": "/profile/Jake-Rocco-Dolan"
                },
                {
                    "user_id": "Rezoana Rahman",
                    "user_href": "/profile/Rezoana-Rahman"
                },
                {
                    "user_id": "Kasi Lakshman Karthi Anbumony",
                    "user_href": "/profile/Kasi-Lakshman-Karthi-Anbumony"
                },
                {
                    "user_id": "Sahana Khan",
                    "user_href": "/profile/Sahana-Khan"
                },
                {
                    "user_id": "Shivam Patil",
                    "user_href": "/profile/Shivam-Patil-1"
                },
                {
                    "user_id": "Babar Cheema",
                    "user_href": "/profile/Babar-Cheema-1"
                },
                {
                    "user_id": "Prasanna Kumar",
                    "user_href": "/profile/Prasanna-Kumar-347"
                },
                {
                    "user_id": "Korey Daniel",
                    "user_href": "/profile/Korey-Daniel"
                }
            ]
        },
        {
            "author_info": {
                "name": "Divyanshu",
                "href": "/profile/Divyanshu-83"
            },
            "answer_text": "**Knives Out** The story is about a famous crime novelist who is found dead at his estate. This happened just the day after his 85th birthday. The inquisitive and nonchalant Detective Benoit Blanc is somehow selected to conduct the investigation and find the reason and the person behind Harlan's unexpected death. *WHERE TO WATCH *: iTunes and Google play movies  **Den of Thieves** The most successful bank robbery crew in the city has planned a heist. They are going to rob the Federal Reserve Bank where they will be facing off the elite unit of the LA Country Sheriffs' department. *WHERE TO WATCH *: iTunes and Google play movies  **Blade Runner 2049** The premise is set 30 years after the first Blade Runner. The future is filled with bioengineered human beings and normal human beings. K ( new blade runner) is a part of the LAPD and he gets to know about a secret that can determine the faith of the replicants and human beings. *WHERE TO WATCH *: Amazon Prime. iTunes and Google play movies  **Prisoners (2013)** Keller Dovers has to put his life in danger as he gets to know that his 6-year-old daughter and her friend are kidnapped. He is devastated by the situation but he has to pull himself together to uncover the truth. *WHERE TO WATCH *: Amazon Prime, iTunes and Google play movies  **The Ring** It seemed like just another urban legend: A recording filled with nightmarish images, leading to a phone call foretelling the viewer's death in exactly seven days. This seems like a practical joke, However four teenagers exactly 7 days after watching the video met their faith. Newspaper reporter Rachel Keller found the video and watched it. Now she has only 7 more days *WHERE TO WATCH *: Netflix  Below are some of the excellent horror movies that you can watch on Amazon Prime and Netflix. **Hold the Dark** *WHERE TO WATCH *: Netflix  **The Wicker Man** *WHERE TO WATCH *: Netflix  **Minority Report** *WHERE TO WATCH *: Netflix  **Under the Skin** *WHERE TO WATCH *: Netflix  ***Blow the Man Down*** *WHERE TO WATCH *: Amazon Prime  ***Blue Velvet*** *WHERE TO WATCH *: Amazon Prime  ***The Commuter*** *WHERE TO WATCH *: Amazon Prime  ***Cruel Intentions*** *WHERE TO WATCH *: Amazon Prime  ***you Were Never Really Here*** *WHERE TO WATCH *: Amazon Prime  ***Midsommar*** *WHERE TO WATCH *: Amazon Prime  ***Mississippi Burning*** *WHERE TO WATCH *: Amazon Prime  ***High Life*** *WHERE TO WATCH *: Amazon Prime  ",
            "date": "Answered May 23, 2020",
            "views": "843",
            "upvotes": "0"
        }
    ]
}