{
    "title": "Which article is used before “students”? - Quora",
    "tags": [
        "Articles (grammar)",
        "Grammar"
    ],
    "response": [
        {
            "author_info": {
                "name": "Andy Champlain",
                "href": "/profile/Andy-Champlain"
            },
            "answer_text": "You can have a plural noun like ‘students’ with no article (‘zero article’) when your sentence carries the meaning ‘all students’, as in “Students have one main job, and that is to study.” Since you can’t put ‘a’ or ‘an’ before a plural noun, you can’t say “a students” in any situation. You could and would say ‘the students’ if the students you’re talking about are known by the listener/reader. As in “The students in my class come from many other countries”; because I’m defining the students as the ones “in my class”, I use the definite article ‘the’. You could also use other determiners (not ‘articles’, specifically), such as ‘some’, ‘any’, ‘no’, ‘all’; these determiners are called ‘quantifiers’. Other determiners you could use include ‘these’ and ‘those’ (demonstrative determiners) and the possessives, like “my students”, “our students”, (and “your”, “his”, “her”, “their”, and “whose”) I think the answer you’re looking for though, is the. ",
            "date": "Answered December 9, 2019",
            "views": "14",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Divya Nair",
                    "user_href": "/profile/Divya-Nair-164"
                },
                {
                    "user_id": "Elizabeth Henderson",
                    "user_href": "/profile/Elizabeth-Henderson-40"
                },
                {
                    "user_id": "Kate Moore",
                    "user_href": "/profile/Kate-Moore-149"
                }
            ]
        },
        {
            "author_info": {
                "name": "Ahmed Razzaq",
                "href": "/profile/Ahmed-Razzaq-8"
            },
            "answer_text": "Definite article ‘the’ can be used for the word ‘students’ if they have been mentioned before or we exactly know what students we are talking about. Indefinite article cannot be used because the word is plural. ",
            "date": "Answered April 30, 2018",
            "views": "262",
            "upvotes": "0"
        }
    ]
}