{
    "title": "Which are some names of fictional countries? - Quora",
    "tags": [
        "Hypothetical Countries",
        "Names and Naming",
        "Fiction",
        "Fictional Characters"
    ],
    "response": [
        {
            "author_info": {
                "name": "Corwyn Berthier",
                "href": "/profile/Corwyn-Berthier"
            },
            "answer_text": "Hmmm, that is actually a hard question because fictional country names come in multiple varieties. It’s our world, but we have created a country with certain characteristics but drawn from various aspects of some real country.It’s fantasy or sf, and as such the countries invented can be damned near anything.I usually prefer #1, and would choose “Ruritania.” The name was invented by Anthony Hope for his books The Heart of Princess Osra and The Prisoner of Zenda, but it has since become a useful general term. Ruritania - Wikipedia ",
            "date": "Answered July 9, 2019",
            "views": "373",
            "upvotes": " View 6 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Michael Sebree",
                    "user_href": "/profile/Michael-Sebree-1"
                },
                {
                    "user_id": "Richard Anthony Scales",
                    "user_href": "/profile/Richard-Anthony-Scales"
                },
                {
                    "user_id": "Callum Sutherland",
                    "user_href": "/profile/Callum-Sutherland-3"
                },
                {
                    "user_id": "Lars Skøtt",
                    "user_href": "/profile/Lars-Skøtt"
                },
                {
                    "user_id": "Andrew Weill",
                    "user_href": "/profile/Andrew-Weill"
                },
                {
                    "user_id": "Gerald Pierson",
                    "user_href": "/profile/Gerald-Pierson"
                }
            ]
        },
        {
            "author_info": {
                "name": "Ernie Black",
                "href": "/profile/Ernie-Black-3"
            },
            "answer_text": "There are so many to choose from! From my own series The Masks of Llyra, I pick Wiriath (ancestral home of Shapers) and Cymmril (home of the Sisters of Xelos). While not a country (actually a part of the country of Torba), the island of Llyranar, home of the Sisters of Llyra is also a favorite. In fantasy and science fiction, I favor Le Guin’s Orsinia and Atuan, Tolkien’s Eriador, Asimov’s Trantor and Aurora, Lem’s Solaris, and Doctor Who’s Gallifrey. From Marvel comics, Latveria (ruled by Dr Doom) has always had the resonance of a real Baltic nation. In DC comics, Markovia has similar verisimilitude in name. And two classics, although not countries per se: William Faulkner’s Yoknapatawpha County, MS and Lewis Carroll’s Wonderland. ",
            "date": "Answered July 9, 2019",
            "views": "190",
            "upvotes": " View 2 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Darrell Blank",
                    "user_href": "/profile/Darrell-Blank"
                },
                {
                    "user_id": "Chris Henderson",
                    "user_href": "/profile/Chris-Henderson-58"
                }
            ]
        }
    ]
}