{
    "title": "Which sentence below is grammatically correct? - Quora",
    "tags": [
        "English Language Writing Advice",
        "English Sentence Writing Advice",
        "English Grammar Writing Advice",
        "English Sentences",
        "Sentences (language)",
        "Writing Advice",
        "Grammar",
        "English Grammar"
    ],
    "response": [
        {
            "author_info": {
                "name": "Mike Mendis",
                "href": "/profile/Mike-Mendis"
            },
            "answer_text": "The basic sentence structure involved in this case is: \"X has Y count for Z.\" The form of the word \"count\" is the bare infinitive, that is, the infinitive without \"to.\" (The infinitive is <to + VERB>.) This structure is based on an even more basic structure: X has Y do Z. Notice that the form is \"do Z\" (not \"did Z\"). This is the bare infinitive form. The formula is used to express the idea that someone makes someone else do something (or be something). Here are two examples: The teacher had the students write an essay in class. (Not: \"wrote\")My mother has me clean my room every Sunday. (Not: \"cleaned\")Notice that the bare infinitive in this construction is active. That is, the students write the essay, and I clean my room. If we use the \"-ed\" form (the past participle), the action is passive. Compare these two sentences: My father had the painters paint our house. (bare infinitive = active)My father had our house painted. (past participle = passive)In the first sentence, the bare infinitive (\"paint\") is used because the painters did the action of painting the house (active). In the second sentence, the past participle (\"painted\") is used because the house was painted by the painters (passive). In your example, if we use \"counted,\" the past participle (\"-ed\") form gives that part of the sentence a passive meaning, that is, somebody counts nothing for something, so, nothing is counted for something. However, the sentence wants to say that nothing counts for something—in the active voice.  The active voice construction, \"X counts for Y,\" is an idiomatic expression, but the passive voice construction, \"X is counted for Y,\" is not used idiomatically. Therefore, in this case, the second sentence would be incorrect, even though there is nothing wrong with the grammar. Others have tried to correct other parts of the sentence. Those corrections are, actually, not necessary, so I will not comment on them. ",
            "date": "Answered July 26, 2015",
            "views": "13",
            "upvotes": " View 3 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Adeniyi Tomiwa",
                    "user_href": "/profile/Adeniyi-Tomiwa-1"
                },
                {
                    "user_id": "Henry Hernández",
                    "user_href": "/profile/Henry-Hernández"
                },
                {
                    "user_id": "Utsav Sachdeva",
                    "user_href": "/profile/Utsav-Sachdeva"
                }
            ]
        },
        {
            "author_info": {
                "name": "Martha S. Lyon",
                "href": "/profile/Martha-S-Lyon"
            },
            "answer_text": "QUESTION: Which sentence below is grammatically correct? summer! to do nothing,and have it count for somethingsummer! to do nothing,and have it counted for somethingDespite Mr. Mendis’s comprehensive explanation, the answer is merely a matter of present tense v. past tense of the verbs and intended meaning of the term count. CORRECT: Summer: to do nothing and have it count [as][for] something. to do nothing references doing nothing in the present;have it count references the doing nothing in the present as counting for or as something in the present.INCORRECT: Summer: to do nothing and have it counted for or as something. the doing of nothing in the present cannot be counted in the past for or as something.POSSIBILITY: If counted is being used to reference the actual counting — 1, 2, 3, 4 — of each do-nothing experience, there’s room to argue that the second sentence is acceptable, because it implies each experience is added to a numbered list of experiences for a specific purpose. However, most good writers would find a better way to say that. ",
            "date": "Answered July 13, 2018",
            "views": "346",
            "upvotes": "0"
        }
    ]
}