{
    "title": "Which are the best universities in Canada for creative writing? - Quora",
    "tags": [
        "Learning About Creative Writing",
        "Creative Writing",
        "Writing"
    ],
    "response": [
        {
            "author_info": {
                "name": "Muhammad Asif",
                "href": "/profile/Muhammad-Asif-520"
            },
            "answer_text": "In this world which is rapidly growing, Creative Writing has been known as one of the well-known and famous study disciplines around the globe. The creative writing education involves different theories and methods of stating emotions, thoughts, and feelings through their innovative writing skills. In that education, students learn how to develop the components of plot development, fiction, and character building. Plus, after graduation students may serve as play writers, screenwriters, journalists and fiction writers. If you consider yourself as one of those students, who are willing to put their talent in creative writing but you are not aware of the fact that where to begin then we have provided a list of Best Universities in Canada for Creative Writing as per 2017 rankings.  Here are the following Best Universities in Canada for Creative Writing as per the ranking of 2017 along with their programs: 1: Toronto Film School (Advanced Diploma Writing for Film & TV Diploma) 2: Concordia University Montréal (B.A. Creative Writing) 3: the University of Victoria, British Columbia (B.A. Writing) 4: University of Toronto (Bachelor Writing and Rhetoric (minor)) 5: B.A. Professional Writing and Communication (Honours) 6: University of British Columbia (B.A. Creative Writing) 7: University of Alberta (B.A. Creative Writing) 8: Dalhousie University (B.A. Creative Writing) 9: University of Winnipeg (B.A. English) 10: University of Regina (B.A. Creative Writing (English)) If anyone asks you about the Best Universities in Canada for Creative Writing, then you can tell them quickly just by looking at this ranking list.  With respect to PWC program (Professional Writing and Communication), which contains the principles of communication mixed with modernized and classical rhetoric via usage in professional surroundings and conventional theory. Communication is handled by PWC as interdisciplinary and socially setting. Its Communication Honors and Professional Writing programs of BA aims at the communication based on genuine research. ",
            "date": "Answered November 8, 2017",
            "views": "45",
            "upvotes": " View 6 Upvoters",
            "upvoters": [
                {
                    "user_id": "Huda Lhm",
                    "user_href": "/profile/Huda-Lhm"
                },
                {
                    "user_id": "Vandini Sharma",
                    "user_href": "/profile/Vandini-Sharma"
                },
                {
                    "user_id": "Charles Rolston",
                    "user_href": "/profile/Charles-Rolston-1"
                },
                {
                    "user_id": "Yash Agarwal",
                    "user_href": "/profile/Yash-Agarwal-755"
                },
                {
                    "user_id": "Kotaro Teramoto",
                    "user_href": "/profile/Kotaro-Teramoto"
                },
                {
                    "user_id": "Ayesha Fatima",
                    "user_href": "/profile/Ayesha-Fatima-68"
                }
            ]
        }
    ]
}