{
    "title": "Which is the best way to learn to speak and write English for beginners? - Quora",
    "tags": [
        "Learn to Speak English Courses",
        "English for Beginners"
    ],
    "response": [
        {
            "author_info": {
                "name": "Vilas Swadi",
                "href": "/profile/Vilas-Swadi"
            },
            "answer_text": "My guide lines are india specific and focussed on for whom English is a second language. Comprehension (understanding), reading, writing and speaking / narration are all interconnect or inter-dependent with respect to any language. I have another question. How good is your fluency in your mothertongue or any other language. Because all of us have migrated to English at a later years as our academic pursuit exposed us to English. This is where we became aware of virtues associated with learning English. We still have the mother tongue as our base language. Many of us think in mother tongue and translate the thoughts in to English. Only in case of professional sphere we do not use our mother tongue. The reason is the professional knowledge was delivered to us in English and we internalized it in English so we reproduce it in English. Any way I will give you a generalised English language improvement plan. You may trim it to suit your needs. There isn't any easy way to learn any language. Whatever may be your linguistic background it does not influence your learning ability. With respect to English and your 1st language there could be some similarities and dis-similarities between English and your mother tongue or 1st language.. But it is so with any two languages. Make a beginning and assess the speed of progress. You can devote requisite amount of time. It is a hard work and will need persistent efforts. If you are willing to take this path then please read on. Be proud of your linguistic background. Your emotional quotient resides your vernacular / 1st language. STEP - 1 Try and build proficiency in vernacular language. This sounds weird???~ Profiency of vernacular language forces you to look for appropriate words in the new language you learn. Besides in the initial stages everyone forms a sentence in the vernacular language he is comfortable with and translates it to ENGLISH. STEP - 2 Know the Common Ground across languages Capabilities of Imagination / structuring a narration / relevance of tenses and such other concepts get transposed from the 1st language to the new language you learn. In this case it is English. STEP - 3 Learning any language has following components. 1 - Grammar 2 - Vocabulary 3 - Comprehension ability 4 - Narration / Composition Close look at the above topics Grammar - Syntax + Tenses हिंदी syntax मैं बससे स्कूल जाता हूँ। subject + adverb + object + verb मराठी syntax मि शाळे ला बसने जातो। Subject + object + adverb + verb Alternative syntax मि बसने शाळे ला जातो। Subject + adverb + object + verb English syntax I go to the school by the bus. Subject + verb + object + adverb Make a notes of variance in the syntax of different languages. Common theme across the language. The verb indicates / denotes the tense of the sentences. Vocabulary - Meaning + Usage Adverb usage of the word tense She became tense after receiving the phone call. Adjective usage of the word tense The police conducted a flag march to deter the tense mob. Abstract noun use of the word tension Everyone has to deal with tension in evryday life. All metals possess varying degrees of tensile strength. A factor common to all languages is the verb denotes the tense of the sentence. Comprehension - Ability to understand written / spoken Narration / Composition - Ability to Express thoughts / Opinions + Structure the narration written or spoken Take a hard look and find out which of above needs to be strengthened. If you need help in grammar then I wish to suggest you to seek help or join tuition class. It will save time. Of course you can do it on your own. But it will need more time. STEP - 4 Read novels / Short Stories /Essays. Reading will help you internalize linguistic skills, improve vocabulary. I can suggest a few books. Many of the titles mentioned below have been re- written in simple language. Choose the level you are comfortable with Tomswayer - Mark Twain Jungle Book -Rudyard Kipling My India - Jim Corbet Malgudi Days - R. K. Narayan Wings Of Fire - A.P.J. Abdul Kalam Robinson Crusoe Gulliver's Travels Twenty Thousand Leagues Under The Sea -Jules Verne Around The World In 80 Days - Jules Verne Pride and Prejudice - Jane Austin Tale of Two Cities - Charles Dickens Sherlock Holmes Ashenden -Bernard Shaw Pavilion of Women - Pearl's Buck Oxford's Reading Circle Series Check books by following authors Jonathan Swift James Herriot Bertrand Russell Ravindranath Tagore Sudha Murty Ruskin Bond Arundhati Roy Chetan Bhagat Earnest Hemingway Edgar Allen Poe Keep out academic / science / technology books. They have very small literary footprint and do not help in linguistic sphere. STEP - 5 Take a note of the sentences that appeal to you or you find interesting. Pay attention to the construction. Similarly note the new words along with their usage. Usage modifies the meaning of the words. Example This book is a shade better than other books. The lawyers arguments exposed shades of hypocrisy. “Wait for me in the tree shade, after you come out of the tuition class”, said my mother. The lamp shade fell off due to turbulent wind. The artist has used shading strokes to create third dimension. STEP - 6 Word game - How many words can you find with 'eat' letter combination. Heat / neat / seat / beat / peat / treat / meat / sweat / cheat / death / threat / create/ wheat great / ….?. Try your luck with different letter combination. 'ust' Dust / Just / Trust /Burst / Must / Lust / Crust / Gusts / Custard /Bust ….??? Coin more challenges like only verbs and see how many you can find. Words with similar themes Danger / risk / endanger / perilous / Pernicious / Precarious Try and use the words in meaningful sentences. Challenging words which look similar but have different meaning. Discreet / Discrete - Wave / Waive - Stare / Stair You will have to struggle with such words to internalize. STEP - 7 Choose a simple topic of your interest or a simple story. Write three to four paragraphs. Read them and see if you can improve the narration. Search for more appropriate words. As you practice choose a bit difficult topic and continue. Example - I take the dog for a walk every day in the evening. Some times It ease the dog. I walk through the streets and go round the same locality. The dog realises the trick. It protests by barking playfully at me. I ignore the dog and continue to walk. The gets angry. It slumps down to the ground and refuse to move. I talk to the dog nicely. I cajole it. It gets up and leads me through streets to the ground. I throw the ball and the dog retrieves it. I ride the cycle then it follows me. Here I play a different trick. I pretend to fall to the ground. I close my eyes and do not move. The dog tries to wake me up with its paws. I refuse. It gets on my chest and licks me all over. I ignore it. It becomes sad and confused. It starts to moan. I get up. It helps happily. STEP - 8 Stand before the mirror and narrate / speak about some topic without referring to written text. If you can get an audience then get it. Speak with your colleagues / friends as often as you can. Watch documentaries with sub titles. Watch TV News Channels /Discussions Read news paper editorials Journalism is a field with vast spectrum. You will have to decide the specific area you want to work like politics, socialogy, crime reporting, sports, theater, performing arts, films and TV international issues, science and innovation, and gain knowledge in that specific area. Write on any topic of your interest and publish it in digital media or approach newspapers for publication. As far as technical writing is concerned you need to be precise. You must be well versed with scientific terminology. Example - speed / velocity + Heat /Temperature / Calories you most know the scientific definitions. It is a hard work but the results will surprise you. Now being selfish …. You may take a look at my short stories series in English in digital format - Titled as “INDIAN FLAVOUR SHORT STORIES” @ AMAZON/ Books/ e-books /KINDLE READER VERSION ",
            "date": "Answered November 2, 2018",
            "views": "117",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Sumit Negi",
                    "user_href": "/profile/Sumit-Negi-221"
                }
            ]
        },
        {
            "author_info": {
                "name": "Rankine Gajendra",
                "href": "/profile/Rankine-Gajendra"
            },
            "answer_text": "I have some tips 1.Read English news paper. 2.watch English news on YouTube or on TV. 3.Write short story in English. 4.Talk to friend in English,In Starting You faces problem,but it will do continues for 2 months.You feel something change in my communication skills. 5.Use mixed language like Hindi and English both at a time.You will definitely Learn. 6.check pronunciation on google translate or other app that you have already download in your phone. 7.Watch interviews of every stars in english. It is available on YouTube. 8.Daily do something like learn about area of interest. I am learning about technology and Graphikdesign, Textildesign, etc... As per interest learn in http://English.it may easily find in directly google search engine. 9.Speak anything loudly and try to check pronunciation becz it is more important. 10.Make group on WhatsApp and talk to friends in English. 11.Listen English song and check english lyrics after You realize that this types of sentence using in this songs.its like a simple words. 12.Watch Bollywood award shows. And the last but not least 13.Watch Short Prank videos/based on social issues in English. Easily you will find on YouTube. You see different-different channels are available. You choose correct or high rating videos which does not contain any types of vulgar or other things that you have not interested then Find another channel. 14.Talk to yourself in front of mirror. Any type of mistakes …give me suggestion #Read and upvote if you thing these are valuable tips.otherwise click downvote. Happy Chhath Puja!! ",
            "date": "Answered October 25, 2017",
            "views": "831",
            "upvotes": " View 11 Upvoters",
            "upvoters": [
                {
                    "user_id": "Sumit Negi",
                    "user_href": "/profile/Sumit-Negi-221"
                },
                {
                    "user_id": "Hiba Ahmed",
                    "user_href": "/profile/Hiba-Ahmed-65"
                },
                {
                    "user_id": "Pradumn Dhakad",
                    "user_href": "/profile/Pradumn-Dhakad"
                },
                {
                    "user_id": "Ravi Rai",
                    "user_href": "/profile/Ravi-Rai-179"
                },
                {
                    "user_id": "Keshav Bhardawaj",
                    "user_href": "/profile/Keshav-Bhardawaj"
                },
                {
                    "user_id": "Paras Mal",
                    "user_href": "/profile/Paras-Mal-8"
                },
                {
                    "user_id": "Dalpat Singh Rajput",
                    "user_href": "/profile/Dalpat-Singh-Rajput-1"
                },
                {
                    "user_id": "RAHUL KADWASRA",
                    "user_href": "/profile/RAHUL-KADWASRA"
                },
                {
                    "user_id": "Ravi Ranjan Kumar",
                    "user_href": "/profile/Ravi-Ranjan-Kumar-209"
                },
                {
                    "user_id": "Shreya Kumari",
                    "user_href": "/profile/Shreya-Kumari-91"
                }
            ]
        }
    ]
}