{
    "title": "Which are some favourite lines from poems? - Quora",
    "tags": [
        "Poems",
        "Poetry"
    ],
    "response": [
        {
            "author_info": {
                "name": "Jezebel Cruz",
                "href": "/profile/Jezebel-Cruz"
            },
            "answer_text": "Rage, rage against the dying of the light This line from the villanelle, “Do not go gentle into that good night” by Dylan Thomas, is my favorite line from poetry. It’s been my gentle reminder of how one should not succumb into the seductive peace of death but instead, rage for the beauty of life. As a depressed person, this speaks volumes of what I wished I believed in. Many people come to me and tell me that life is precious, and that I shouldn’t waste in a quick death. And that sucks to hear. Because in all of my experiences, I know that life is beautiful and magnificent. I’ve seen it and felt it and experienced it. But you ask if you know that life is like that, why do you still want to die? Because I’m frankly tired. I don’t feel anything often. I’m tired of feeling empty and not knowing what I’m feeling. I wonder if I’m faking my emotions or genuinely feeling joy. I lost contact with differentiating what is real in my emotions and what is not. I’m tired of fucking up my life. I’ve seen myself hurt so many people because of the choices and actions I make. And no matter how much I try to do the right thing where everyone is happy and safe, they end up hurt and it crushes me everytime. I’m tired of being so confused about life and death. Whether it’s all worth it of one side and the other. Not knowing which is the right choice and the choice that will make me truly happy. I’m tired of losing people. Of hurting them and being abandoned. People say so empty words of reassurance but fail to commit at the end. I’m tired of being lonely. Of staring that floor in the darkness of my room. Waiting for someone to text or call me. I want someone to care about me in their own choice and not feel obligated to do so. To love me and accept me. To hang out with me. To be the first choice! But no one will. I’m tired of being a failure. Being defeated by the lack of motivation and the potential to be better. I am incompetent. I am weak at so many things. Poetry, writing, archery - these things I love doing, I lack the skills to be great at them. I am not knowledgeable. I am not anything worth being. And that is why Dylan Thomas’s line resonates within me. So many people rage and here I am, giving up so easily. People are not so fortunate and here I am still living, wishing she was dead. A husk of a human. I wish to have that rage - that drive. But I don’t. I love this poem not because I relate to the poem, but because it is something I strive for. Something that I wish still sparked something in my heart. Something that I wish galvanizes me into a refresh of life. I want to rage, rage against the dying of the light. I want to not go gentle into that good night. I want to live! ",
            "date": "Answered February 20, 2019",
            "views": "954",
            "upvotes": " View 8 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Rissy Sandra",
                    "user_href": "/profile/Rissy-Sandra"
                },
                {
                    "user_id": "Omar Verdi",
                    "user_href": "/profile/Omar-Verdi"
                },
                {
                    "user_id": "Kevin Eret",
                    "user_href": "/profile/Kevin-Eret"
                },
                {
                    "user_id": "Karen Carmichael",
                    "user_href": "/profile/Karen-Carmichael-7"
                },
                {
                    "user_id": "Joseline Csw",
                    "user_href": "/profile/Joseline-Csw-1"
                },
                {
                    "user_id": "Eva O’ Sullivan",
                    "user_href": "/profile/Eva-O-Sullivan-1"
                },
                {
                    "user_id": "Prince Manay Bora",
                    "user_href": "/profile/Prince-Manay-Bora"
                },
                {
                    "user_id": "Navyaa Manda",
                    "user_href": "/profile/Navyaa-Manda"
                }
            ]
        },
        {
            "author_info": {
                "name": "Maya Kaiser",
                "href": "/profile/Maya-Kaiser"
            },
            "answer_text": "There is a woman who lived in my house, a few years ago, before I met my husband. She looks just like me. She has a lot of the same habits, some of the same friends. She even has the same name. But she isn’t me. That woman never married. She never forgot who she was. Some time after I left my husband, I looked in the mirror and didn’t recognize myself. I felt free, for the first time in years. But I was floating, weightless, into the unknown. When I think back to that moment, I think of a line from Derek Walcott’s poem, Love After Love: “You will love again the stranger who was your self.” Each rift, each heartbreak, makes us into strangers to ourselves. Strangers that we must learn to love, all over again. ",
            "date": "Answered September 28, 2017",
            "views": "29",
            "upvotes": " View 32 Upvoters",
            "upvoters": [
                {
                    "user_id": "Jiya Singh",
                    "user_href": "/profile/Jiya-Singh-38"
                },
                {
                    "user_id": "Gill Bullen",
                    "user_href": "/profile/Gill-Bullen"
                },
                {
                    "user_id": "Arthur Friedley",
                    "user_href": "/profile/Arthur-Friedley"
                },
                {
                    "user_id": "Christa Swanson",
                    "user_href": "/profile/Christa-Swanson"
                },
                {
                    "user_id": "Claudio Faria",
                    "user_href": "/profile/Claudio-Faria"
                },
                {
                    "user_id": "Haraprasad Maguluri",
                    "user_href": "/profile/Haraprasad-Maguluri"
                },
                {
                    "user_id": "Vinayak Iyer",
                    "user_href": "/profile/Vinayak-Iyer-17"
                },
                {
                    "user_id": "Neda",
                    "user_href": "/profile/Neda-72"
                },
                {
                    "user_id": "Akhil Pamburayam",
                    "user_href": "/profile/Akhil-Pamburayam"
                },
                {
                    "user_id": "Uma Rajanna",
                    "user_href": "/profile/Uma-Rajanna"
                }
            ]
        }
    ]
}