{
    "title": "Which ink is used in a ballpoint pen? - Quora",
    "tags": [
        "Ball Point Pens",
        "Ballpoint Pen",
        "Ink"
    ],
    "response": [
        {
            "author_info": {
                "name": "Rahul Ganguly",
                "href": "/profile/Rahul-Ganguly-4"
            },
            "answer_text": "I honestly wonder in the age of search engines, why we ask these questions. Modern ballpoint pens feature many variations in formulas. The average ballpoint pen’s ink is made up of tiny particles of pigment particles suspended in a solvent made up of oil or water and other additives. The colors are derived from dyes, such as eosin, which is used in red pens. Other substances, such as benzyl alcohol are added, which creates a quick-drying ink. Polymers are added to stabilize and disperse the pigment without settling down or sinking in the solvent. Additionally, fatty acids may be added for lubrication. ",
            "date": "Answered November 8, 2019",
            "views": "147",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Prashant Sinha",
                    "user_href": "/profile/Prashant-Sinha-300"
                }
            ]
        },
        {
            "author_info": {
                "name": "Arjun Madan",
                "href": "/profile/Arjun-Madan-14"
            },
            "answer_text": "Basically, ball point ink is oil based. Yeah, not your regular oil, but you know, some sort of oil used in chemistry. That sort of oil. All ballpoint inks, no matter what, will surely be made of oil mixed with dye and some water. This makes ballpoint inks viscous. It is due to this viscosity that you have to put pressure on the ballpoint pen in order to write. It is due to this composition of ink that ballpoint inks don't evaporate or dry out . Oil in that ink acts as a lubricant. ",
            "date": "Answered November 7, 2019",
            "views": "83",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Prashant Sinha",
                    "user_href": "/profile/Prashant-Sinha-300"
                }
            ]
        }
    ]
}