{
    "title": "Which is correct, 'this is my newly-found career choice' or 'this is my new-found career choice'? - Quora",
    "tags": [
        "English Grammar Writing Advice",
        "English Sentences",
        "Career Choices",
        "Sentences (language)",
        "Learning English",
        "Grammar",
        "English Grammar"
    ],
    "response": [
        {
            "author_info": {
                "name": "Paddy Cosgrove",
                "href": "/profile/Paddy-Cosgrove"
            },
            "answer_text": "Which is correct, \"this is my newly-found career choice\" or \"this is my new-found career choice\"? Dear Harikirtan, I don’t mean to prevaricate but I believe either would pass muster if they were spoken, (or perhaps I mean ‘pass unnoticed’). Personally, I feel, there is more sense of movement with the expression “newly-found” and since it is obviously about ‘change’ itself, it would feel to me to carry more weight. Certainly though, the adjective ‘newfound” is all one word, as a rule, is all one word and possibly this is why I find it less emphatic. I hope you are happy, well and SAFE. You are the future of our World. ",
            "date": "Answered October 5, 2020",
            "views": "43",
            "upvotes": " Answer requested by Harikirtan Das Worlu"
        },
        {
            "author_info": {
                "name": "Charles L McClenon",
                "href": "/profile/Charles-L-McClenon"
            },
            "answer_text": "My old style guide — A Dictionary of Contemporary American Usage, 1957 says, “The form new may be used as an adjective to qualify a noun. Either form may be used to qualify a participle. New is preferred with short familiar words, as in new laid eggs, new born child or new baked bread. Newly is preferred with longer less familiar words, newly discovered pride, newly furnished rooms. But I’m not sure that was good advice when when they wrote it. In a different dictionary, I find “newly baked bread” as an example of the use of ‘newly’. I do find dictionary entries for “newfound” as a single word, non hyphenated. Likewise, in a “newborn child”, ‘newborn’ is one word, usually without a hyphen. . The only compound word I find based on ‘newly’ is ‘newlywed’., and no hyphenated uses. I think you can choose between “my newly found career choice” and “my newfound career choice.” No hyphens in either. ",
            "date": "Answered October 13, 2020",
            "views": "34",
            "upvotes": " Answer requested by Harikirtan Das Worlu"
        }
    ]
}