{
    "title": "Which is David McCullough's best book? - Quora",
    "tags": [
        "David McCullough (author)",
        "History Books",
        "Writers and Authors",
        "Book Recommendations"
    ],
    "response": [
        {
            "author_info": {
                "name": "James Keenley",
                "href": "/profile/James-Keenley"
            },
            "answer_text": "Which is David McCullough's best book? I have read all of David McCullough’s books to date, from “The Johnstown Flood” through “The Wright Brothers.” And I’m eagerly looking forward to reading “The Pioneers,” when it comes out in May. I would recommend all of McCullough’s books, but if forced to pick just one as his “best,” I’d pick:  “John Adams” is s full-realized, compulsively readable, flesh-and-blood portrait of our second president, who played many key roles in the foundation of the United States. Yet, while his name is known to most Americans, few Americans actually know much about him. Adams was a fascinating and complex man, and McCullough does an amazing job of bringing Adams to life, presenting him in context and as a fully-realized human being. It’s little wonder that the book spent close to a year on national bestseller lists, including several months in the #1 spot. ",
            "date": "Answered March 5, 2019",
            "views": "628",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Pat Hollingsworth",
                    "user_href": "/profile/Pat-Hollingsworth-2"
                }
            ]
        },
        {
            "author_info": {
                "name": "Tom Corcoran",
                "href": "/profile/Tom-Corcoran-2"
            },
            "answer_text": "That’s a tough call. I haven’t read all of his books but I intend to do so. In no particular order: The Path Between the Seas was very good. With McCullough’s writing it feels like you are there observing the building of the Panama Canal. The Great Bridge also puts you in a position of watching the Brooklyn Bridge getting built. His love of research shines through everything McCullough writes and this is no exception. My favorite is The Johnstown Flood. So realistic you feel like you are tumbling down the mountain with the unfortunate victims. ",
            "date": "Answered March 5, 2019",
            "views": "522",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Mary Moore",
                    "user_href": "/profile/Mary-Moore-616"
                },
                {
                    "user_id": "James Keenley",
                    "user_href": "/profile/James-Keenley"
                }
            ]
        }
    ]
}