{
    "title": "Which are the top 5 Hindi novels, story books, Shayari or poem collections that one must read? - Quora",
    "tags": [
        "Munnawar Rana",
        "Munshi Premchand (Hindi: मुंशी प्रेमचंद)",
        "Indian Literature",
        "Novel Recommendations",
        "Novels",
        "Literature",
        "Hindi (language)",
        "Book Recommendations"
    ],
    "response": [
        {
            "author_info": {
                "name": "Akhil Gupta",
                "href": "/profile/Akhil-Gupta-8"
            },
            "answer_text": "I am glad someone asked this question here. It is not easy to find Hindi literature enthusiasts on social platforms. Being a Hindi literature lover, it is difficult for me to select only five and leave so many other good books. Here is my highly recommended list of top 5 from different genres: 1. Gunaahon Ke Devta (Dharamvir Bharti) : This is the best love story you will find till date and during reading you will find yourself with water in your eyes. This is also best gift people recommend for Valentine's Day. 2. Godan (Munshi Premchand) : First lets go through the means of \"Godan- the gift of a cow made by a pious Hindus to a brahman at the time of death\". Premchand had an amazing skill of story telling and Godan is the best example of that. The novel offers a broader picture of humanity, evenly presented social criticism and how social traditions can affect human life. 3. Raag Darbari (Shrilal Shukla) : A satire based on sociopolitical power struggle of 1950s. One of the best satire book till date! 4. Chandrakanta Santati (Devaki Nandan Khatri) : All those who spent there childhood during late 90s will never forget the epic show of Chandrakanta. But here I am talking about Chandrakanta Santati, a series of books based upon the lives of sons of Chandrakanta. All those who are big fan of J.K Rolling's Harry Potter will surely enjoy this series and may even find it better than Harry Potter. Go read this one! Note: Even if someone has not read Chandrakanta, he can still enjoy Chandrakanta Santati. only a brief introduction of Chandrakanta characters is required which is easily available online. Chandrakanta (novel)  5. Nirmala (Munshi Premchand) : First published in 1928, Nirmala is something which will force you to cry many times during reading. The story is about a young girl married to elderly husband and clearly Munshi Ji wrote it with a social reform thinking. Worth Reading!! There are many other brilliant novels which you can read but if you have any interest in Hindi literature and wanna start reading then blindly pick Munshi Premchand and i bet you will not be disappointed. Before I post my answer a recommendation for Hindi Poetry lovers - Rashmirathi by Ramdhari Singh Dinkar. A poetry dedicated to Karna - the son of unmarried queen Kunti. Happy Reading! ",
            "date": "Answered May 9, 2015",
            "views": "875",
            "upvotes": " View 126 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Mangal Murti Likhitkar",
                    "user_href": "/profile/Mangal-Murti-Likhitkar"
                },
                {
                    "user_id": "Deep Shikha",
                    "user_href": "/profile/Deep-Shikha-441"
                },
                {
                    "user_id": "ANOJ KUMAR",
                    "user_href": "/profile/ANOJ-KUMAR-255"
                },
                {
                    "user_id": "Abhijeet",
                    "user_href": "/profile/Abhijeet-278"
                },
                {
                    "user_id": "Lalith Chandra",
                    "user_href": "/profile/Lalith-Chandra-7"
                },
                {
                    "user_id": "Fgh Tyu",
                    "user_href": "/profile/Fgh-Tyu"
                },
                {
                    "user_id": "Padmanabh Mishra",
                    "user_href": "/profile/Padmanabh-Mishra-8"
                },
                {
                    "user_id": "Abhay Aher",
                    "user_href": "/profile/Abhay-Aher-2"
                },
                {
                    "user_id": "Prashant Kumar",
                    "user_href": "/profile/Prashant-Kumar-896"
                },
                {
                    "user_id": "Kumarpal Parmar",
                    "user_href": "/profile/Kumarpal-Parmar-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Rohit Mishra",
                "href": "/profile/Rohit-Mishra-4"
            },
            "answer_text": "Some of the best books I have read are in Hindi. Without restricting myself to 5, will mention all those that one should read as and when one can -  1. Tumhare Liye - by Himanshu Joshi  This takes you to that era of Nainital when the city was still beautiful and not commercialized. The amazing narration of the beauty of the city with its lakes, in winters of north India, when clubbed with an innocent love story makes it one of the best books I have read. Just 152 pages and you will never be the same. 2. Radhey - Ranjeet Desai  A book on karna, from how he saw everything and dealth with it. The introduction, first 4 pages, is so-so powerful, that you will get up only after you have finished reading it. Shows the internal duels of Karna with self. 3. Mrityunjaya - by Shivaji Sawant  Another book on karna and Mahabharata - but takes everyone into account- their reasons and their point of view. One of the best written books. Will drive you to tears.. especially when karna talks about his brother and where krishna comes in to talk to him. 4. Raag Darbari  by Shri Lal Shukl and Kaashi ke Assi by Kashinath Singh   One of the best satires i have read till date. You will roll on the book laughing... Both the books were suggested to me by the book shop at Prithvi theatre and i owe them for these :) 5. Somnath and Vaishali ki Nagarvadhu - by Acharya Chatursen     No one can be better than Achara Chatursen at writing a fictional story on a historical backdrop. Will keep you glued till the book ends... A lot of characters and a lot of parallel plots, but all converging to one mega end. The most amazing thing about the writer is that it takes no more than a paragraph for him for character building and it is etched in your memories for long-long time. 6. Tamas - by Bhishm Sahni  A very peculiar way of narrating stories when clubbed with the backdrop of independence era and communal riots that accompanied it, makes for a perfect recipe for a lump in the throat by the time you finish it. 7. Swami by Ranjeet Desai  This is a most popular historic novel with literary credibility written by Ranjit Desai. The novel comprises of the political life, bravery and personal life of Madhavrao Peshwe. This is among the few novels which have depicted the history and literature in Marathi. 8. And of course, Godan by Premchand Most of the books are award winning and need a read to understand why so. Out of these, Swami, radhey and Mrityunjay are originally in Marathi but have been dubbed in many languages. ",
            "date": "Answered September 24, 2014",
            "views": "309",
            "upvotes": " View 34 Upvoters",
            "upvoters": [
                {
                    "user_id": "Hamari Baari",
                    "user_href": "/profile/Hamari-Baari"
                },
                {
                    "user_id": "Abhay Aher",
                    "user_href": "/profile/Abhay-Aher-2"
                },
                {
                    "user_id": "Priyanka Mishra",
                    "user_href": "/profile/Priyanka-Mishra-15"
                },
                {
                    "user_id": "Saurav Karmakar",
                    "user_href": "/profile/Saurav-Karmakar-20"
                },
                {
                    "user_id": "Pratiksha Tiwari",
                    "user_href": "/profile/Pratiksha-Tiwari-74"
                },
                {
                    "user_id": "Shubham",
                    "user_href": "/profile/Shubham-667"
                },
                {
                    "user_id": "Aparna Gupta",
                    "user_href": "/profile/Aparna-Gupta-179"
                },
                {
                    "user_id": "Prashant Chouksey",
                    "user_href": "/profile/Prashant-Chouksey-2"
                },
                {
                    "user_id": "Jatin Sigh",
                    "user_href": "/profile/Jatin-Sigh"
                },
                {
                    "user_id": "Pradeep Vishnubhatla",
                    "user_href": "/profile/Pradeep-Vishnubhatla"
                }
            ]
        }
    ]
}