{
    "title": "Who likes American Horror Story and why? - Quora",
    "tags": [
        "American Horror Story (TV series)",
        "Horror Stories",
        "Horror (genre)"
    ],
    "response": [
        {
            "author_info": {
                "name": "Zack Grogan",
                "href": "/profile/Zack-Grogan"
            },
            "answer_text": "I enjoy it on a season-by-season basis. That being said, there are certain reasons I do or don't enjoy certain seasons. Things I like- The show is often very good at imagery and the production values are solid.It’s fun to watch as a soap opera and trying to guess what will happen next week is always interesting.Solid acting from a strong cast that plays many different roles! Watching people play wildly different roles from season to season is great.Some parts of it are actually scary. I found a good part of Murder House to be quite creepy for some reason! In many ways I don’t think they’ll ever surpass the first season.Things I didn’t like as much- Some of the writing feels forced and sometimes it seems like people do things that are very out-of-character in the show to get to a desired plot point. The latest season, Cult, was very guilty of this in my opinion.The pacing can be a little off. Some episodes seem like they have little forward movement in the story, where others take leaps and bounds. It feels strange when this becomes very noticeable.Although I don’t have a problem with the political aspects of the show, sometimes it feels forced to the point of being a thinly veiled message rather than a story involving multiple realistic characters. Cult also dropped the ball here.The side plots can be interesting and fun, but without a central theme tying them together they just run all over the place. Asylum was terribly guilty of this- between Bloody Face, the aliens, the devil possessing Sister Mary Eunice, the Nazi doctor, and Sister Jude’s moral ambiguity, what could have been an interesting plot became a jumbled mess that was impossible to satisfyingly conclude.I’ll watch it, but I’m a very season-by-season watcher. Honestly, most people are probably in the same boat. With so many different seasons, it’s kind of difficult to like them all. I still need to watch Hotel and Roanoke, the former of which I hear is excellent, and the latter terrible. Who knows though, I might have a different opinion after seeing it for myself. ",
            "date": "Answered December 20, 2017",
            "views": "11",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Tony Gray",
                    "user_href": "/profile/Tony-Gray-135"
                },
                {
                    "user_id": "Zoe Zoe",
                    "user_href": "/profile/Zoe-Zoe-167"
                },
                {
                    "user_id": "Emily Fisher",
                    "user_href": "/profile/Emily-Fisher-32"
                }
            ]
        },
        {
            "author_info": {
                "name": "Dale Thomas",
                "href": "/profile/トーマス-デール-Dale-Thomas"
            },
            "answer_text": "I have only seen the first two seasons. I keep trying to get around to watching more, but there’s never enough time. It’s alright. Not the best thing I have seen, but it is generally well written, has fresh ideas, great casting, good acting, and good production values. I think it does go on for too long. I would like the seasons to tell the same story in, say, six episodes. I feel there is too much fluff and unnecessary detours. It does drag on a bit. But overall I would say it is worth watching. ",
            "date": "Answered October 20, 2017",
            "views": "847",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/Miguel-Ángel-MF"
                },
                {
                    "user_id": "Yohan Launay-Lee",
                    "user_href": "/profile/Yohan-Launay-Lee"
                }
            ]
        }
    ]
}