{
    "title": "Who is more professional, BTS or Blackpink? - Quora",
    "tags": [
        "Professionals",
        "BLACKPINK",
        "K-Pop Idols",
        "BTS (K-pop group)",
        "K-Pop"
    ],
    "response": [
        {
            "author_info": {
                "name": "Bailey Lm",
                "href": "/profile/Bailey-Lm"
            },
            "answer_text": "Do you expect me to say that one is way more better than the other and start fanwars? I’ll gladly not do so. I think both are great at whatever they do and say, we all are talented in our own ways and saying one person is way more talented than the other person just, isn’t cool you know? They’re both very hard-working and professional groups, and deserve the fame and recognition they have in the present. I’m not saying only BTS and Blackpink are the professional ones because they’re certainly not the only ones. We have TON TON of groups who’ve worked hard to get to where they’re now and I feel like some of them deserve the fame that BTS and Blackpink have. Mamamoo are four hard-working women that have great stage presence and they deserve the fame that Blackpink have. I’m not saying that that Blackpink don’t have stage presence and don’t deserve the fame because they certainly do, I’m just saying that Mamamoo deserves to be more recognized just like BTS and Blackpink. Of course, there are more groups who are hard-working and professional but Mamamoo just really caught my eye and I just wanted to state on how they also are very talented. Anyway, back to BTS and Blackpink, please don’t start fanwars between the two because it’s very unnecessary and childish. Both are hard-working groups and fighting on who’s better is hella stupid and just stop doing it because you’re going to get nothing out of it except make new K-pop fans or non-K-pop fans seem that this place is toxic and full of fanwars when it’s not, really. In conclusion, stream ice cream and dynamite or else mona lisa is going to come to you’re house and blast awesome screen awesome camera in your ear, kay? ",
            "date": "Answered September 14, 2020",
            "views": "251",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Maddie Hernandez",
                    "user_href": "/profile/Maddie-Hernandez-19"
                },
                {
                    "user_id": "Hamedah Badmus",
                    "user_href": "/profile/Hamedah-Badmus"
                }
            ]
        },
        {
            "author_info": {
                "name": "Shridhar Baghel",
                "href": "/profile/Shridhar-Baghel-1"
            },
            "answer_text": "What do you want me to do? To wage a fanwar. Everyone is professional because it's there profession at the first position and they have proper labels like BigHit and YG entertainment. None of them use headphones to record voice neither phone to make MV. ",
            "date": "Answered September 9, 2020",
            "views": "705",
            "upvotes": " View 13 Upvoters",
            "upvoters": [
                {
                    "user_id": "Melissa Army",
                    "user_href": "/profile/Melissa-Army-2"
                },
                {
                    "user_id": "Lhouise Jjang",
                    "user_href": "/profile/Lhouise-Jjang"
                },
                {
                    "user_id": "Balladserpents",
                    "user_href": "/profile/Balladserpents"
                },
                {
                    "user_id": "Kristin Huynh",
                    "user_href": "/profile/Kristin-Huynh-3"
                },
                {
                    "user_id": "Kim Seok-Jinnie",
                    "user_href": "/profile/Kim-Seok-Jinnie-2"
                },
                {
                    "user_id": "Enjie Zhang",
                    "user_href": "/profile/Enjie-Zhang-1"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/Kpopfan123"
                },
                {
                    "user_id": "Satheesan Mk",
                    "user_href": "/profile/Satheesan-Mk-1"
                },
                {
                    "user_id": "Alessandra Lopez",
                    "user_href": "/profile/Alessandra-Lopez-18"
                },
                {
                    "user_id": "Kazumi Hatake",
                    "user_href": "/profile/Kazumi-Hatake"
                }
            ]
        }
    ]
}