{
    "title": "Who are the best writers on Quora in 2020? - Quora",
    "tags": [
        "2020 (year)",
        "Writers and Authors"
    ],
    "response": [
        {
            "author_info": {
                "name": "Himanshu Bharti",
                "href": "/profile/Himanshu-Bharti-46"
            },
            "answer_text": "I’ve been quite active on Quora for 2 years now and read a lot of readers here. To be honest, some writes only relevant answers with solid rationale by their soul & heart while on the other hand, some writes only irrelevant answers which doesn’t provide any value to the readers here. I believe this simply violates the policies of Quora. It is now being treated as a photo sharing platform just to earn views & ‘virtual’ followers. As you have asked about the best writers on Quora only in 2020, I think these reputed & respected writers mentioned below are ‘evergreen’. They are adding values every year to the entire Quora community by their answers. I love reading their answers based on their rich experiences from all the spheres of life. Some maestros which I would like to mention here are: Awdhesh Singh (अवधेश सिंह) SirRajan Singh SirAmitabha Tripathi SirBalaji Viswanathan (பாலாஜி விஸ்வநாதன்) SirGopalkrishna Vishwanath SirHector Quintanilla SirKalpit VeerwalSaranya Ravichandran Ma’amI would urge other readers to read their answers & you will gain some great knowledge from all fields in life. ",
            "date": "Answered June 19, 2020",
            "views": "109",
            "upvotes": " View 2 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Deeksha Bharti",
                    "user_href": "/profile/Deeksha-Bharti-20"
                },
                {
                    "user_id": "Gopalkrishna Vishwanath",
                    "user_href": "/profile/Gopalkrishna-Vishwanath"
                }
            ]
        }
    ]
}