{
    "title": "Who is the next David Foster Wallace? - Quora",
    "tags": [
        "David Foster Wallace (author)",
        "Non-Fiction Books",
        "Non-Fiction",
        "Fiction",
        "Literature"
    ],
    "response": [
        {
            "author_info": {
                "name": "JJ Merelo",
                "href": "/profile/JJ-Merelo"
            },
            "answer_text": "I am almost sure there will be no next David Foster Wallace. He's unique in many ways, all of them positive. However, there might be other writers that can come close to him: I really like Jasper Fforde. Even if he's less purely literary and more fantasy-oriented, reading him is like looking at the whole mechanism of narrative being turned upside down. Plus he's much funnier than DFW, and doesn't write 1000-page doorstoppers.On the other hand, I also like the McSweeney's literary journal in general. It's published regularly, if publishing stuff in a head-shaped box can be called general. If there's a next DFW, he'll probably write there.Did I mention I also write novels, and although they'll be never translated into English (maybe I'll do it when I go into my old age) and don't even come close to DFW, I might be one of the few, if not the only, Spanish novelist who's read (and enjoyed) Infinite Jest? ",
            "date": "Answered January 14, 2011",
            "views": "11",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Joe Hamilton",
                    "user_href": "/profile/Joe-Hamilton-1"
                },
                {
                    "user_id": "Kawaii Me",
                    "user_href": "/profile/Kawaii-Me"
                }
            ]
        },
        {
            "author_info": {
                "name": "Steve Davis",
                "href": "/profile/Steve-Davis"
            },
            "answer_text": "There really can't be a \"next David Foster Wallace.\" If someone is going to be a great writer, they'll be known by their own name & for their own work. An up & coming writer won't be the next David Foster Wallace any more than DFW was the next Wendell Berry. That said, there are some writers with similar styles. One example is a blogger who writes under the name Samuel Snodgrass for \"Why There are No Girls in San Francisco.\" http://whytherearenogirls.blogspot.com/ It's observing life from a very different angle than Wallace, but his observational acuity and style seem similar to me. ",
            "date": "Answered December 2, 2010",
            "views": "14",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Brian Howard",
                    "user_href": "/profile/Brian-Howard-41"
                },
                {
                    "user_id": "Wendy Tiger Balsam",
                    "user_href": "/profile/Wendy-Tiger-Balsam"
                },
                {
                    "user_id": "David Cole",
                    "user_href": "/profile/David-Cole"
                }
            ]
        }
    ]
}