{
    "title": "Who would write your biography the best? - Quora",
    "tags": [
        "Biographies",
        "Best of X",
        "Writers and Authors"
    ],
    "response": [
        {
            "author_info": {
                "name": "Yojji Peterson",
                "href": "/profile/Yojji-Peterson"
            },
            "answer_text": "I want you to write my biography. I’m not joking…listen. I have (at this moment) less than a thousand answers on Quora. In those answers (of varying quality) I touch on burning issues like Soup, Childbirth, Childhood, Adolescence, Music, Aging, Nostalgia, Thrift Stores, Art, Death, Sex, Love, Disappointment, Facial Hair…the list goes on and on. It’s all (or mostly) there. I’ve left out a few key things…but professional biographers often have less to work with. I have no idea what it all means. I don’t pretend to be a noteworthy person. I could be anybody. Get some 3x5 cards and jot down some notes… It doesn’t matter if you upvote my answers or not. Arrange the cards in an order that makes sense. I can do the same for you. We can shuffle cards…I don’t care. Synthesize it into something. Burroughs used the cut-up method…I like 3x5 cards. It’s how I outline. Make drawings if you like. This is your baby - I’m giving it to you. I get a final review. I would expect it to be inaccurate and distorted at points. I want to see what you can do with my life. I’m dead curious. ",
            "date": "Answered April 18, 2019",
            "views": "567",
            "upvotes": " View 31 Upvoters",
            "upvoters": [
                {
                    "user_id": "Ruth Gabrick",
                    "user_href": "/profile/Ruth-Gabrick"
                },
                {
                    "user_id": "Nayana Bhat",
                    "user_href": "/profile/Nayana-Bhat-3"
                },
                {
                    "user_id": "James Johnson",
                    "user_href": "/profile/James-Johnson-682"
                },
                {
                    "user_id": "Helena Brown",
                    "user_href": "/profile/Helena-Brown-31"
                },
                {
                    "user_id": "Nhi Truong",
                    "user_href": "/profile/Nhi-Truong-18"
                },
                {
                    "user_id": "Stan Hanks",
                    "user_href": "/profile/Stan-Hanks"
                },
                {
                    "user_id": "Susan Biddlecomb",
                    "user_href": "/profile/Susan-Biddlecomb"
                },
                {
                    "user_id": "Somnk Mox",
                    "user_href": "/profile/Somnk-Mox"
                },
                {
                    "user_id": "Meghan Finley",
                    "user_href": "/profile/Meghan-Finley"
                },
                {
                    "user_id": "Michael Duncan",
                    "user_href": "/profile/Michael-Duncan-30"
                }
            ]
        },
        {
            "author_info": {
                "name": "Mita Munshi",
                "href": "/profile/Mita-Munshi"
            },
            "answer_text": "Online will be the best platform for writing  a biography better. Sometimes , my elder sister uses an website and she describes the site as a  friendly one and  also useful. I have checked this site also and found them very smart and virtual. You better check their service list .Help with Writing a Biography ",
            "date": "Answered May 2, 2015",
            "views": "123",
            "upvotes": "0"
        }
    ]
}