{
    "title": "Who are the authors involved in the history of the English language? - Quora",
    "tags": [
        "History of the English Language",
        "English Linguistics",
        "Literature",
        "Language",
        "English (language)"
    ],
    "response": [
        {
            "author_info": {
                "name": "Steve Bett",
                "href": "/profile/Steve-Bett-1"
            },
            "answer_text": "Here is Kip Wheelers answer to a more sensible question: A variant of Which languages have influenced English, and how? Even before Old English existed as a separate language, its grandfather language back in Europe had already been influenced by Latin. West Germanic had several Latin loan words dealing with roads, trade, and warfare all before 455 BCE.A very small smidgin of Celtic loanwords influenced the Anglo-Saxons in the first few generations after they conquered the island. Most of these were toponyms, but the words crag, anchorite, bin, and possibly cross and ass (“ass” in the sense of the body-part, as opposed to “ass” in the sense of animal, which was borrowed separately from Latin asinus). There were also some originally-Latin-but-passed-into-Celtic-languages words, which the Anglo-Saxons borrowed indirectly via Celtic intermediaries at this time. [We won’t really get a full flood of Celtic influence until about 700 years after that.]The next big influence was Latin from Benedictine monks who came in 597 A.D. to convert the people of Kent, starting a multi-century process of Latin loanwords—many of them theological, but many others dealing with household items, names of exotic animals and herbs, and scholarly knowledge. That intensified after the Cluniac reforms and a second wave of missionaries showed http://up.In the late 700s and early 800s, Scandinavian influences were key. Old Norse-speaking pirates raided, settled in, and traded with the Anglo-Saxons. Words like freckles, gang, skiff, skull, sky, and window were borrowed at this time. However, even bigger than the loanwords, the Old Norse speakers had incompatible declensions with Old English, but often had cognates for the main stem of each word. This meant that, because of compatible vocabulary but incompatible syntax-markers, the slow process of Old English losing declensions started. (The process wouldn’t finish until after the Norman Invasion, but this loss of declensions helped make the language much more analytic, like Modern English, in which word-order conveys more meaning than endings stuck on adjectives and nouns).The biggest influence of all is arguably that of French. First, the invasions of the Norman French in 1066. Massive, massive, massive influx of Romance language in subsequent centuries, peaking in the 1300s and 1400s [see John Cowan’s comment below], and loss of dual pronouns, and alterations in spelling to match French conventions such as the digraph [ow] or [ou] to indicate certain vowel sounds.There are big changes between 1400–1450, particularly in our long vowels in the Great Vowel Shift (GVS). However, those changes may be homegrown evolution rather than a change triggered by foreign http://languages.In the Renaissance, with improvements in nautical technology, the compass, and better maps and charts and ship design, trade with Europe and exploration of the New World leads to increasingly diverse sources of vocabulary. We pick up words like cannibal from the Indies, chocolate (ultimately from the Aztecs but via Spanish and then French), grotto and volcano from Italian, and many, many more from Dutch, German, and elsewhere, a process of borrowing that continues for the next 400 years through British Colonialism, where we pick words from India and the Middle East. ",
            "date": "Answered September 2, 2020",
            "views": "24",
            "upvotes": " Answer requested by Charmaine Dela Cerna",
            "upvoters": [
                {
                    "user_id": "Anne Percy",
                    "user_href": "/profile/Anne-Percy"
                },
                {
                    "user_id": "Cathy Buchanan",
                    "user_href": "/profile/Cathy-Buchanan-2"
                },
                {
                    "user_id": "Michael Baker",
                    "user_href": "/profile/Michael-Baker-457"
                },
                {
                    "user_id": "Paul Irving",
                    "user_href": "/profile/Paul-Irving-3"
                },
                {
                    "user_id": "Michael Durcan",
                    "user_href": "/profile/Michael-Durcan-1"
                },
                {
                    "user_id": "Judith Watson",
                    "user_href": "/profile/Judith-Watson-4"
                },
                {
                    "user_id": "John Bartram",
                    "user_href": "/profile/John-Bartram"
                },
                {
                    "user_id": "Nikki Hayman Johns",
                    "user_href": "/profile/Nikki-Hayman-Johns"
                },
                {
                    "user_id": "Richard Larkin",
                    "user_href": "/profile/Richard-Larkin-9"
                },
                {
                    "user_id": "Joe Devney",
                    "user_href": "/profile/Joe-Devney"
                }
            ]
        },
        {
            "author_info": {
                "name": "Gill Bullen",
                "href": "/profile/Gill-Bullen"
            },
            "answer_text": "Well, we could start with the unknown authors of works like Beowulf and go on from there; about the first author whose name we know is probably a Saxon monk and schoolmaster called Ælfric. Then we go on, through Chaucer, Shakespeare, Donne and Milton… all involved in making the history of the English language. Except that I don't think that's what you're trying to ask. If what you really mean is “What are the names of some authors to look out for, if I want to know about the history of the English language?” then the obvious name is David Crystal, who is an absolute guru on the subject. Bill Bryson has an excellent little book called “Mother Tongue: the English Language,” and Simeon Potter has quite a good one. Start with Bill Bryson and David Crystal, though. Now look, OP, you've been here 17 hours, and posted 9 peculiar Questions, of which this is the most nearly a sensible one. Welcome to Quora, but please don't go on like this. Or we'll all just Block and Mute you! ",
            "date": "Answered August 30, 2020",
            "views": "567",
            "upvotes": " View 21 Upvoters "
        }
    ]
}