{
    "title": "Who are the prettiest Bollywood actresses? - Quora",
    "tags": [
        "Specific Indian Actors and Actresses",
        "Bollywood Actors and Actresses",
        "Attractiveness and Attractive People",
        "Bollywood",
        "Celebrities"
    ],
    "response": [
        {
            "author_info": {
                "name": "Jagannath Sahoo",
                "href": "/profile/Jagannath-Sahoo-43"
            },
            "answer_text": "Pretty Well the word pretty means many things in the dictionary : (Of a person, especially a woman or child) attractive in a delicate way without being truly beautiful.used ironically to express annoyance or displeasure.And Bollywood owns many of the pretty face of India but prettiest are few and these few are listed below: DEEPIKA PADUKONE  Is an Indian Beautiful and talented actress, she work in many movies of Bollywood as the leading role she is one of the highest paid Indian actress of Bollywood in 2016, she was badminton good player as well before she came to film industry she gave good attention to badminton, she was born on fifth of the January 1986. Her father was also a badminton player and she get inspire from her father. She made her entrance in film industry with her first film name Om Shanti Om with Shah Rukh Khan, after that she worked in her new film name Love Aj Kal in that movie she was looking more confident and gorgeous as well according to her acting and of her grace she is outstanding.  She has been modeling appearances in print and television advertising campaigns for Liril, Close-Up toothpaste and Limca, receiving many prestigious modeling offers, including brand ambassadorship of the Jewels of India, an annual jewelery exhibition. She hit the international scene when Maybelline made her their new international cover-girl face.  At the fifth annual Kingfisher Fashion Awards, for Indian models and designers, she was awarded the title of Model of the Year. Shortly after wards, she was chosen as one of the models for the Kingfisher Swimsuit Calendar for 2006, thus cementing her reputation as a supermodel. She also bagged two trophies at the Idea Zee F Awards in 2006 - female Model of the year (Commercial Assignments) and Fresh Face of the year.    KATRINA KAIF  Gorgeous stunning Katrina Kaif she is the tallest and beautiful actress of Indian film Industry, there is allot of demand of Katrina Kaif as she has many hit films everyone wants to do work with Katrina Kaif as she is a talented actress, Salman khan was the man who introduce Katrina Kaif in Bollywood, he gave much attention to Katrina Kaif which made her successful in film industry in 2003 she started her film career her first film was a big flop, after that she came as supporting role with Salman khan in Maine Pyar Kyun Kiya? In 2005. She also remained touch with media because of her relationship with Salman Khan. Katrina Kaif is one of eight siblings, 7 girls and 1 boy, from a mother who is a Caucasian of British Nationality, and a father who was formerly from Kashmir, India, but who has since acquired British citizenship. Her mother is now re-settled in Chennai (formerly known as Madras), the Capital of the state of Tamil Nadu in India. She spent subsequent years in Hawaii, and then in London, Britain, She started modeling accidentally when she was in Hawaii at the tender age of 14, when she was approached for a jewelry campaign. Thereafter she continued modeling in London.  Continuing to model was the reason she got her break in a Bollywood movie Boom (2003) offered by none other than film-maker Kaizad Gustad. She was flooded with modeling assignments the minute she set her foot on Indian soil, especially with her innocent expressive face, hour-glass figure, and drop-dead gorgeous looks. Professionally she started off as a model with photographer Atul Kasbekar, and upon being accepted, she received offers from LG, Cola, Fevicol, Lakme, & Veet. It was the Lakme commercial that got her noticed. She retained Matrix as her Manager to accept work on her behalf and at the price she deserved.  Adorned with soft gorgeous looks, she is not easily intimidated, but admits that she is very emotional, sensitive, and concerned about her privacy, Almost an incurable romantic, she prefers to wear comfortable non-revealing clothes when at home, hates to do her hair, and above all dislikes make-up. Admitting to being lonely in the beginning, but now has several friends who she can hang out with.     SHRADDHA KAPOOR  Shraddha Kapoor one of the talented and famous actress of India these days she is also new beautiful star of Indian film industry she made everyone happy with her work in her films in which she play the leading role. She is the daughter of one of the famous and talented actor name Shakti kapoor,everyone get impressed with her work and with her beauty she looked more charming and beautiful in Aashiqui 2, now days she is also working for different brands she is also a very good dancer which is a plus point for her.  Shraddha Kapoor is an Indian film actress. Prior to making her cinematic debut, she took up theatre studies at Boston University, but dropped out after her first year to begin her acting career. She made her screen debut in the 2010 drama fictional Teen Patti for which she earned a nomination for the Filmfare Best Female Debut. The following year, she received appreciation and the Stardust Searchlight Best Actress Award for her role in the teen drama Luv Ka The End. She rose to prominence for her portrayal as Arohi Keshav Shirke in the 2013 romantic musical Aashiqui 2, which emerged as her first commercial success venture in which she gained positive acclaims and numerous nominations including the Filmfare Award for Best Actress.         Image source: Google images Writings: various websites ",
            "date": "Answered August 2, 2017",
            "views": "46",
            "upvotes": " View 7 Upvoters",
            "upvoters": [
                {
                    "user_id": "Thanusree Boddepalli",
                    "user_href": "/profile/Thanusree-Boddepalli-1"
                },
                {
                    "user_id": "Kevin Anderson Leong",
                    "user_href": "/profile/Kevin-Anderson-Leong"
                },
                {
                    "user_id": "Tushar Mitra",
                    "user_href": "/profile/Tushar-Mitra-12"
                },
                {
                    "user_id": "Abhinav Srivastava",
                    "user_href": "/profile/Abhinav-Srivastava-309"
                },
                {
                    "user_id": "Vaibhav Mishra",
                    "user_href": "/profile/Vaibhav-Mishra-441"
                },
                {
                    "user_id": "Abhishek Chaurasia",
                    "user_href": "/profile/Abhishek-Chaurasia-8"
                },
                {
                    "user_id": "Sanaya Singh",
                    "user_href": "/profile/Sanaya-Singh-5"
                }
            ]
        },
        {
            "author_info": {
                "name": "Lillian Shroff",
                "href": "/profile/Lillian-Shroff"
            },
            "answer_text": "Beauty definitely lies in the eyes of the beholder. Beauty is unexplained. Whoever you find gorgeous, I may not find them gorgeous. So, these are my ideal kind of women. Also, I will add women who are not in the Bollywood Industry as I can’t resist not adding them to this list! It’s a long list so brace yourself! But you’ll get what beauty is for me :) South Indian Women (Kerala, Karnataka, Tamil Nadu, Telangana & Andhra Pradesh Natives) Pooja Hegde (Starred in Housefull 4 opposite Akshay Kumar, Kriti Sanon, Kriti Kharbanda, Riteish Deshmukh & Bobby Deol)  Aishwarya Rai Bachchan  Vidya Balan  Rekha  Jaya Prada  Anusha Sampath (Starred in Kabir Singh as Keerti)  Anushka Shetty (Was in Baahubali 2 as the lead herone; Famous South Indian Actress)  Samantha Akkineni (Famous South Indian Actress)  Anisha Alla Reddy (Starred in Arjun Reddy as Keerti)  Genelia Deshmukh  Asin (Former Bollywood Actress; Starred in Housefull 2 & Ghajini)  Nazriya Nazim (South Indian Actress; Starred in Malayalam film Bangalore Days opposite Dulquer Salmaan)  Parvathy (South Indian Actress; Starred in Qarib Qarib Single opposite Irrfan Khan)  Nithya Menon (South Indian Actress; Debuted in Bollywood with Mission Mangal)  Roshmitha Harimurthy (Miss Universe India 2016)  Shreya Rao Kamavarupu (Miss India Andhra Pradesh 2018)  Aditi Rao Hydari  Tabu  Nayanthara (South Indian Actress; Was part of Katrina Kaif’s Kay Beauty Campaign)  Bhavana Durgam Reddy (Miss India Karnataka 2018)  Sandhya Raju (Kuchipudi [Indian Classical Dance Form from South India] dancer from Hyderabad, Telangana, India)  Keerthy Suresh (South Indian Actress going to debut in Bollywood opposite Ajay Devgn in Maidaan)  North Indian Women (Delhi, Punjab, Himachal Pradesh, Madhya Pradesh, Uttar Pradesh, Uttarakhand, Haryana natives) Kareena Kapoor Khan  Priyanka Chopra Jonas  Anushka Sharma  Taapsee Pannu  Katrina Kaif (Though she is Half English)  Sonam Kapoor Ahuja  Sara Ali Khan  Mona Singh (Indian TV Actress; Starred in 3 Idiots as Kareena’s older sister)  Divyanka Tripathi (Indian TV Actress)  Anita Hassanandani (Indian TV Actress)  Neha Dhupia Bedi  Fatima Sana Shaikh  Sanya Malhotra  Radhika Madan (Going to star in Angrezi Medium opposite Irrfan Khan & Kareena Kapoor Khan)  Yami Gautam  Parineeti Chopra  Juhi Chawla  Deeksha Seth (Starred in Lekar Hum Deewana Dil opposite Armaan Jain)  Shraddha Kapoor  Shalini Pandey (Going to debut in Bollywood opposite Ranveer Singh apparently; Starred in Arjun Reddy opposite the main hero Vijay Devarakonda; was the lead heroine of Arjun Reddy)  Preity Zinta  Neetu Singh  Kiara Advani  Kriti Sanon  Kriti Kharbanda  Jonita Gandhi (Bollywood Singer)  Neeti Mohan (Bollywood Singer)  Sunidhi Chauhan (Bollywood Singer)  Esha Gupta  Anna Kler (Miss India Punjab 2018; I used to hate her because she was associated to someone I hate.. .But after seeing her in Miss India, I started liking her)  Gayatri Bhardwaj (Miss India Delhi 2018; Miss United Continents India 2018)  Meenakshi Chaudhary (Miss India Haryana 2018; Miss Grand International runner-up 2018)  Manushi Chhillar (Miss World 2017; Miss India Haryana 2017)  Aditi Hundia (Miss Supranational India 2018)  Raveena Tandon Thadani  Twinkle Khanna  Neha Kakkar (Bollywood Singer)  Nimrit Ahluwalia (Chhori Sardani Lead Actress; Miss India Manipur 2018; She is a Punjabi ethnically)  Bhavna Jain (Miss India Bihar 2018; Though she is North Indian)  Aashna Gurav (Miss India Goa 2018; Though she is North Indian)  Shriya Saran  East Indian Women (Bihar, Jharkhand, Chhattisgarh, West Bengal, Odisha, Manipur, Tripura, Mizoram, Meghalaya, Arunachal Pradesh, Assam, Sikkim & Nagaland natives) Sonakshi Sinha  Bipasha Basu Singh Grover  Mouni Roy (Starred in Made in China opposite Rajkumar Rao)  Sumona Chakravarti (Kapil Sharma Show)  Sushmita Sen  Sayantani Ghosh (TV Actress)  Mouli Ganguly (TV Actress)  Rani Mukherjee  Jaya Bachchan  Kajol  Shreya Ghoshal (Bollywood Singer)  Sayantika Banerjee (Bengali Film Actress)  Subhashree Ganguly (Bengali Film Actress)  Rituparna Sengupta (Bengali Film Actress)  Mimi Chakraborty (Bengali Film Actress)  Koushani Mukherjee (Bengali Film Actress)  Nusrat Jahan (Bengali Film Actress)  Rukmini Maitra (Bengali Film Actress)  Payel Sarkar (Bengali Film Actress)  Prarthana Sarkar (Miss India West Bengal 2018)  Monisha Sen (Miss India West Bengal 2018 Finalist)  West Indian Women (Maharashtra, Gujarat, Goa & Rajasthan natives) Madhuri Dixit Nene  Alia Bhatt  Prachi Desai (Starred in Rock On! Opposite Farhan Akhtar)  Sagarika Ghatge (Starred in Chak De! India opposite Shahrukh Khan)  Daisy Shah  Sakshi Tanwar (Indian TV Actress; Starred in Dangal as Aamir Khan’s wife)  Amruta Khanvilkar (Starred in Raazi opposite Alia Bhatt)  Urmila Matondkar  Radhika Apte  Hamel Patel (Gujarati influencer from USA)  Kaushal (Gujarati Influencer from UK)  Mithila Palkar (Starred in Karwaan opposite Irrfan Khan & Dulquer Salmaan; Lead actress of Netflix Series Little Things)  Ileana D’Cruz (Starred in Barfi! Opposite Ranbir Kapoor, will star in upcoming film Pagalpanti opposite Anil Kapoor & John Abraham)  Anushka Luhar (Miss India Gujarat 2018)  Stefy Patel (Miss India Jharkhand 2018; Though she is Gujarati ethnically; South Indian Film Actress)  Non-Indian Women (Women who are not Indian ethnically) Jacqueline Fernandez (Sri Lankan-Malaysian who was born in Sri Lanka and was raised around the world as she kept on moving; She starred in Salman Khan film Kick opposite Salman Khan)  Sajal Ali (Pakistani Actress; She starred in Mom with late Sridevi)  Mahira Khan (Pakistani Actress; She starred in Raees with Shahrukh Khan)  Nargis Fakhri (German-Pakistani mix born and raised in the West; Starred in Rockstar opposite Ranbir Kapoor)  I’m sure there are other beautiful women out there from all Desi zones and out of the Desi zones… Just that I can’t find them ",
            "date": "Updated November 23, 2019",
            "views": "254",
            "upvotes": " View 22 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Mick Berry",
                    "user_href": "/profile/Mick-Berry-6"
                },
                {
                    "user_id": "Saleem Pasha",
                    "user_href": "/profile/Saleem-Pasha-34"
                },
                {
                    "user_id": "Raman Jeet Kaur",
                    "user_href": "/profile/Raman-Jeet-Kaur-2"
                },
                {
                    "user_id": "Aravindakshan K.K A.N",
                    "user_href": "/profile/Aravindakshan-K-K-A-N"
                },
                {
                    "user_id": "Khushi.B",
                    "user_href": "/profile/Khushi-B-26"
                },
                {
                    "user_id": "Jayant Khot",
                    "user_href": "/profile/Jayant-Khot-1"
                },
                {
                    "user_id": "Raajit J. Singh",
                    "user_href": "/profile/Raajit-J-Singh"
                },
                {
                    "user_id": "Beverly Oliver",
                    "user_href": "/profile/Beverly-Oliver-8"
                },
                {
                    "user_id": "Antonio Bellido",
                    "user_href": "/profile/Antonio-Bellido-2"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/TR-KRISHNAN-2"
                }
            ]
        }
    ]
}