{
    "title": "Who are considered the best writers in English Literature? - Quora",
    "tags": [
        "English Literature",
        "Writers and Authors"
    ],
    "response": [
        {
            "author_info": {
                "name": "Zach Steinour",
                "href": "/profile/Zach-Steinour"
            },
            "answer_text": "Thanks for the A2A. So, this is a really​ hard question to answer, for many reasons. I studied a huge array of periods and movements within Enlish literature in pursuit of my degree. Do I have the formidable task of choosing from all of the authors from c. 700 - 1000 CE (the earliest estimates for the composition of Beowulf), all the way through 2017? If that's the case, I'm at a loss. You might consider works that fall in the so-called “Canon\" of English literature for clues, where you'll find names like Chaucer, Shakespeare, Marlowe, Bronte, Wilde, Shelley, and many more throughout​ history. But that doesn't really answer the question in terms of one overarching “best” writer in English. Additionally, are we talking poetry? Fiction? Essay? Biography? You see where I'm going…it’s complicated. If you'll permit me, I'll narrow it down to the area in which I more or less specialized while in school. Specifically, the modernist movement of the late nineteenth and early twentieth centuries. Here, our selection narrows, very slightly. You'll find names like Woolf, O'Neil, Lawrence, and Joyce, to name a few. As an American, more specifically as an American who grew up primarily in the South after moving to Georgia at a young age, I'll nominate William Faulkner as my personal favorite author of the period. His gritty examination of the post-bellum southern States paints a real picture of how a specific group of people experience loss (The Unvanquished), the search for identity (Absalom! Absalom!) , and the processes of living and dying (As I Lay Dying). His prose is dense; sometimes bordering on obtusely difficult, requires real study, but is also quite rewarding when you figure him out. Yes, a lot if the racial aspects of his work, including realistic racist violence, is uncomfortable, but it should be. It's very important to make ourselves uncomfortable from time to time so we keep challenging uncomfortable subjects. I chose Faulker because reading his work changed me as a reader and as a person, and opened me to the idea that sadness, despair and discomfort could be beautiful in their own way. I highly recommend Faulkner and his contemporary southern writers to anyone looking for a perspective that I think reached its peak in the 1920s and 30s in the American South. Cheers! ",
            "date": "Answered April 11, 2017",
            "views": "12",
            "upvotes": " View 7 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Sono Khan",
                    "user_href": "/profile/Sono-Khan-16"
                },
                {
                    "user_id": "Ming Adrian",
                    "user_href": "/profile/Ming-Adrian"
                },
                {
                    "user_id": "Bob Jamison",
                    "user_href": "/profile/Bob-Jamison-3"
                },
                {
                    "user_id": "Arturo Méndez",
                    "user_href": "/profile/Arturo-Méndez-6"
                },
                {
                    "user_id": "Joseph Byington",
                    "user_href": "/profile/Joseph-Byington"
                },
                {
                    "user_id": "Tracy Thompson",
                    "user_href": "/profile/Tracy-Thompson-32"
                },
                {
                    "user_id": "Phoebe Flessas",
                    "user_href": "/profile/Phoebe-Flessas-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "John Smith",
                "href": "/profile/John-Smith-7562"
            },
            "answer_text": "This is so incredibly subjective, I'm not even sure where someone would begin assembling a list for you. I'm going to assume that you mean literary authors and not genre fiction which is an entirely different beast. Among academic circles, one of the most common novels you'll hear mentioned is Ulysses by James Joyce. It's considered not only one of the more difficult novels to read and understand, but forgoes any resemblances of typical storytelling for a somewhat chaotic style of narrative. On the other hand, for satire and pure hilarity it's hard to argue with Joseph Heller’s Catch-22 being possibly the funniest book ever written. Between the zany characters, absurdist situations, and deadpan delivery of dialogue it's hard to think of a better example. Then you have a more traditional novel like The Great Gatsby. This doesn't so much play with the structure of narrative or humor but instead explores motifs of the 1920’s through somewhat straight foreword narrative. All in all, there are too many amazing novelists to be covered in one quora reply and my summarization doesn't even begin to scratch the surface. You could look at the modern library’s greatest literary novels of all time as a starting point. The national book award will also give you a better scope of who is out there both past and present regarding prestigious authors. ",
            "date": "Answered July 25, 2016",
            "views": "416",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Luis Mason",
                    "user_href": "/profile/Luis-Mason-2"
                },
                {
                    "user_id": "Frank Asbury",
                    "user_href": "/profile/Frank-Asbury-1"
                },
                {
                    "user_id": "Jan Layton",
                    "user_href": "/profile/Jan-Layton"
                }
            ]
        }
    ]
}