{
    "title": "Who invented the ballpoint pen? - Quora",
    "tags": [
        "Industrial Design",
        "Product Design of Physical Goods",
        "Pens",
        "Inventors"
    ],
    "response": [
        {
            "author_info": {
                "name": "MD Robin",
                "href": "/profile/MD-Robin-60"
            },
            "answer_text": "Ballpoint Pen History – Who Invented Ballpoint Pen?  Ballpoint pen is a pen that has, as its name says, ball at its point which rotates when dragged across the writing surface and leaves behind ink that comes from the reservoir of the pen. Ball at the point can be of different diameter and can be made of brass, steel, or tungsten carbide. It is today the most widespread writing instrument and has literally changed the way we write. Trying to invent a pen which can write on leather, a tanner John J. Loud invented the first ballpoint pen and patented it in 1888 in America. This pen had a small steel ball which was placed so it could not fall out nor fall in but it still could rotate freely. This invention was not commercially viable and could not be used for writing. Because of that patent lapsed in time.After that, many tried to improve on the design but did not deliver the ink evenly or overflow and clog the pint. In the early 20th century, László Bíró, a Hungarian newspaper editor, tried to make a pen that would dry quickly and without smudges. He noticed that ink used in newspaper printing dried quickly so he and his brother György, who was a chemist, started experimenting on a workable pen. They combined viscous ink and ball-socket mechanism to make a ballpoint pen that would not allow for an ink to dry out in pen but it would still leave the mark behind when used. The first working ballpoint pen was presented at Budapest International Fair in 1931. They filed for patents in France and Britain in 1938. In 1941 Bíró brothers and a their friend, Juan Jorge Meyne fled to Argentina and opened there Bíró Pens of Argentina - factory that made ballpoint pens and sold them in Argentina as “Birome”. This ballpoint pen was licensed and made in Britain as a “Biro” for RAF aircrews which used it at high altitudes (fountain pens used to leak ink when used too high).  After the Second World War, others tried to sell their ballpoint pens but with limited success. Milton Reynolds saw a ballpoint pen when he was on a business trip to Buenos Aires in 1945 and, when he returned to America, redesigned it so he could obtain an American patent. His ballpoint pen, manufactured in his Reynolds International Pen Company and called “Reynolds Rocket” was the first commercially successful ballpoint pen. It was sold under the ad that said that it won’t need refilling for 15 years. Gimbels department store in New York City sold few thousand ballpoint pens just in one week. Eversharp Co., a maker of mechanical pencils, also made their own pen and started selling it. Britain saw its first commercially successful ballpoint pen in the same year made by Miles Martin Pen Company. Market soon became saturated and Reynolds’ company folded in early 1950s. At the same time, Paper Mate pens started manufacturing and distributing their own pens in Canada by changing to their new ink formulas. Also, Parker Pens released The Jotter which used tungsten-carbide textured ball in its point and was cheaper which resulted in several millions sold pens in just a first year. Ballpoint pens started to take over the world. But that was a bad time for Eversharp Co. whose pen division was sold to Parker Pens and later folded completely. ‘50s were also time when Marcel Bich (later shortened his name to Bic) licensed ballpoint pen from Bíró and started manufacturing his pens according to Bíró’s design. His ballpoint pens are now recognized across the world. ",
            "date": "Answered November 16, 2018",
            "views": "27",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Rajiv Vasudev",
                "href": "/profile/Rajiv-Vasudev-1"
            },
            "answer_text": "The first working ballpoint pen was presented at Budapest International Fair in 1931. They filed for patents in France and Britain in 1938. In 1941 Bíró brothers and a their friend, Juan Jorge Meyne fled to Argentina and opened there Bíró Pens of Argentina - factory that made ballpoint pens and sold them in Argentina as “Birome”. This ballpoint pen was licensed and made in Britain as a “Biro” for RAF aircrews which used it at high altitudes (fountain pens used to leak ink when used too high). Trying to invent a pen which can write on leather, a tanner John J. Loud invented the first ballpoint pen and patented it in 1888 in America. This pen had a small steel ball which was placed so it could not fall out nor fall in but it still could rotate freely. This invention was not commercially viable and could not be used for writing. Because of that patent lapsed in time. After that, many tried to improve on the design but did not deliver the ink evenly or overflow and clog the pint. In the early 20th century, László Bíró, a Hungarian newspaper editor, tried to make a pen that would dry quickly and without smudges. He noticed that ink used in newspaper printing dried quickly so he and his brother György, who was a chemist, started experimenting on a workable pen. They combined viscous ink and ball-socket mechanism to make a ballpoint pen that would not allow for an ink to dry out in pen but it would still leave the mark behind when used. [1] Footnotes[1] History of Ballpoint Pens",
            "date": "Answered November 14, 2018",
            "views": "14",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Manish Kumar",
                    "user_href": "/profile/Manish-Kumar-15975"
                }
            ]
        }
    ]
}