{
    "title": "Who is a better writer, Chetan Bhagat or Sudeep Nagarkar? - Quora",
    "tags": [
        "Modern Writers",
        "Sudeep Nagarkar",
        "Romantic Novels",
        "Chetan Bhagat (author)",
        "Indian Authors and Writers",
        "Novels",
        "Writers and Authors",
        "Writing Advice",
        "Writing"
    ],
    "response": [
        {
            "author_info": {
                "name": "Shouvik Banerjee",
                "href": "/profile/Shouvik-Banerjee-2"
            },
            "answer_text": "It depends on what type of books you prefer. Sudeep Nagarkar writes romance while Chetan Bhagat writes fiction that has romance as one of the elements. For me personally, Chetan Bhagat will always be someone I admire from the bottom of my heart and I’m a guy who likes reading Salman Rushdie, Amitav Ghosh, Garcia Marquez, and Haruki Murakami if you’re wondering about my literary “tastes”. Whatever Mr. Bhagat’s literary qualification may be, he is a trendsetter in Indian writing, a feat that very few have been able to achieve, and there can never be another like him. Let me explain. Before 2005, i.e., before Chetan Bhagat became a household name, young India was invested mostly in western fiction. In India, there was barely any writer who was writing in simple English that the youth could connect to. Then Chetan Bhagat arrived and changed the game. Every young reader between 17 - 27 began consuming Mr. Bhagat’s content like a hungry barati at an Indian wedding. He made his way to the hearts of both readers and non-readers alike. I have seen the entire collection of Mr. Bhagat's books at houses where English literature never had any presence. And that to me was fascinating. Today, almost every new romance writer has a readymade reader base thanks to the road Chetan Bhagat has made. I’m not taking away any credit from the romance writers. Authors like Ravinder Singh, Preeti Shenoy, Durjoy Dutta, and Sudeep Nagarkar have earned the respect of fans and are celebrated best-selling authors in their own right. But one must not forget how the change in the readers’ mindset took place. ",
            "date": "Answered May 24, 2019",
            "views": "11",
            "upvotes": " View 7 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Anjishnu Choudhury",
                    "user_href": "/profile/Anjishnu-Choudhury-2"
                },
                {
                    "user_id": "Priyanka Mane",
                    "user_href": "/profile/Priyanka-Mane-43"
                },
                {
                    "user_id": "Sandhya Lakshman",
                    "user_href": "/profile/Sandhya-529"
                },
                {
                    "user_id": "Prakhar Dubey",
                    "user_href": "/profile/Prakhar-Dubey-12"
                },
                {
                    "user_id": "Yuvraj Mishra",
                    "user_href": "/profile/Yuvraj-Mishra-18"
                },
                {
                    "user_id": "Soham Dey",
                    "user_href": "/profile/Soham-Dey-47"
                },
                {
                    "user_id": "Koushik Kumaran",
                    "user_href": "/profile/Koushik-Kumaran-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Adwitiya Dixit",
                "href": "/profile/Adwitiya-Dixit"
            },
            "answer_text": "I won’t comment on their writing styles and compare the two based on their skills as a writer. No matter how they write, the two of them have managed to gather an audience for themselves that loves their work. Chetan Bhagat’s latest novel was a crime thriller so that’s something new that tips the scale in his favor. However, between the two I will say Chetan Bhagat is the better writer. The reason for that purely comes from the fact that Chetan Bhagat not only influenced a whole bunch of new authors in our country and spawned wannabes all over our nation, Chetan Bhagat also inspired a whole generation to read novels again. I believe he is solely responsible for reviving novel reading in India for the Y generation and millennials have a lot to thank him for. He is the founding member of India’s new literary scene. Based on just that, I will always say Chetan Bhagat is a better writer. ",
            "date": "Answered July 1, 2019",
            "views": "294",
            "upvotes": " Answer requested by Yuvraj Mishra"
        }
    ]
}