{
    "title": "Who is your ultimate bias in BTS? - Quora",
    "tags": [
        "BTS (K-pop group)"
    ],
    "response": [
        {
            "author_info": {
                "name": "Huajin Li",
                "href": "/profile/Huajin-Li"
            },
            "answer_text": "It would have to be Min Yoongi. Here’s why I love him~  Many people, when they first see Yoongi, they see a person who sleeps all day, is lazy, and acts like a grandpa. That’s what I saw first too, but that’s not true. He may sleep a lot, and act old, but there’s a reason behind all that. He is one of the quiet people in BTS, but there is one place where he talks a lot: in his lyrics. When he is always sleeping, it is because he had stayed up late at night working on songs and writing lyrics. In my opinion, he works the hardest and even produces most of the music for the group. Whenever he goes somewhere with BTS, he would bring his notebook with him and keep working. In his lyrics is where we can see all of him. Recently, he opened even more to his fans in his mixtape. It talked about the condition of his mind, what fame had did to him, how he sees himself and how he loves what he does despite the struggles of being an idol.  Furthermore, he really loves his members and his fans. He takes care of the members in a way that doesn’t seem much, but is very clear to fans. He even takes care of his fans. During several BTS fan meetings, he would always ask the fans if they ate and would tell them never to skip any of their meals. On his birthday, he even wrote more than 300 notes by hand to express his love and gratefulness to his fans. He also bought snacks and gave the notes and snacks to the fans at a fan meeting on his birthday. There are so many more reasons why I love Min Yoongi. Maybe it’s his raspy and hoarse voice when he raps, or the thoughtfulness he puts in his lyrics. Maybe it’s his beautiful smile that shows all his gums, or his weird cuteness when he is feeling his best. Whatever it is, I feel an immediate and strong connection to him whenever I see him.  Min Yoongi has taught me so much. He taught me not only to follow your dreams or to work hard but to also live life the way you want to. He taught me not to stress over things that you have no control over, and not live your life to the expectations of others. Don’t let your past define you, but be grateful for how it made you into the strong person you are today. Be grateful for the ones who weakened you, because they’re the ones who encouraged you to try harder. Stay humble and stay grateful. These are all things that Yoongi has taught me through these past two years. One flaw that he and I share, is that he will never be satisfied with himself. He always thinks that he isn’t good enough for his fans, and that he can always show us a better ‘Yoongi.’ No matter how many nights he stays up to perfect his work that will never be perfect to him, his passion is always visible. Yoongi must realize that his fans love him for everything he is, flaws and all. What made this past album of BTS great was that he was proud of the way it came out, and he felt great to say that he contributed to it. To see him be happy and achieving his dreams is the greatest thing I could ask for.  I apologize for how long this turned out to be haha~ ",
            "date": "Answered May 22, 2017",
            "views": "115",
            "upvotes": " View 245 Upvoters",
            "upvoters": [
                {
                    "user_id": "Ekakshi Gupta",
                    "user_href": "/profile/Ekakshi-Gupta"
                },
                {
                    "user_id": "Putri R Karima",
                    "user_href": "/profile/Putri-R-Karima"
                },
                {
                    "user_id": "T Dennis",
                    "user_href": "/profile/T-Dennis-16"
                },
                {
                    "user_id": "Ally Adison",
                    "user_href": "/profile/Ally-Adison"
                },
                {
                    "user_id": "ST.Kristal Holgado",
                    "user_href": "/profile/ST-Kristal-Holgado"
                },
                {
                    "user_id": "Sparkle Franklin",
                    "user_href": "/profile/Sparkle-Franklin-1"
                },
                {
                    "user_id": "Tamanna Khan",
                    "user_href": "/profile/Tamanna-Khan-235"
                },
                {
                    "user_id": "Benthe Smit",
                    "user_href": "/profile/Benthe-Smit-1"
                },
                {
                    "user_id": "Jess Reeves",
                    "user_href": "/profile/Jess-Reeves-18"
                },
                {
                    "user_id": "Ashley Turner",
                    "user_href": "/profile/Ashley-Turner-597"
                }
            ]
        },
        {
            "author_info": {
                "name": "Irene Ahn",
                "href": "/profile/Irene-Ahn-6"
            },
            "answer_text": "**ok so before you start reading — beware that the question said “according to you” which means what I would think the BTS ideal types would be..? The ones I put down there may or may not be true to their ideal type** Seokjin / Jin: As Seokjin loves to eat, cook, and moreover like to joke around. I think he would want someone who would share an interest of cooking or eating with him — by which means, is good at cooking and maybe even a good eater that doesn’t care about their weight While eating. I think someone who would accept his jokes and laugh for him would be someone he would want to be with. And a person that is willing to wait for him to explain when something goes wrong and not just escalate something on their own. Jin is a very traditional and family orientated person. I think he would rather date someone who would be accepted into the society without any harm or hate, and wants someone who would treat his parents like their own, in means of kind and respect, and someone who his parents accept. Namjoon / RM: As RM, I think he is a very reserved and deep person. Someone who knows how to fit in the society but still gets hurt and offended easily. He claimed that number was just an age in an interview before. But in my sincere opinions I think he would want to date someone who is younger because he wants to show dominance on someone. He is a true leader and doesn’t neccessarily need anyone to lean on compared to the other members of bts. I think someone very sweet, and someone with a lot of aegyo, and yet be able to take over awkward times and make it not awkward again would be the type of person he would want to date. Someone who doesn’t tease him too much and protects him and stay by his ‘side’ when there’s a particular argument. Yoongi / Suga: Suga, in my point of view, is similar to RM. A very quiet and reserved person who likes to spend a lot of alone time rather daydreaming or thinking than talking or explaining. Suga, as stated in an interview before, said that his father was a little bit cold and maybe even a bit tsundere around his children. (Meaning that he would act like he’s not caring for them but secretly is) Yoongi doesn’t know how to express emotions as easily as others because he’s too shy or doesn’t know how to.I don’t think he would want anyone that has too much aegyo unlike rm and seokjin, because I feel like he wouldn’t know what to do when a girl gives him aegyo and he would just be super shy about it. So I feel like he wouldn’t like getting aegyo because he doesn’t know how to deal with it. He would want someone that has a passion for music and is willing to understand and stay calm and reserved when he has a bad day, temper, or accidentally does something wrong. He would want someone that is willing to listen to his explanation before escalating anything in their heads before. Hoseok / J-hope: As stated in an interview before, J-hope is very sensitive to Love. As someone so playful, I feel like he would get extremely shy if a girl gives him aegyo, but he would still want someone with aegyo. Since he’s a great dancer and loves to dance himself, he would like someone who has a lot of energy like him and someone who also loves dancing and is good at it. I think he would like the idea of dance practices with his girlfriend lol c’: I feel like Hoseok would make a lot of mistakes on the way of a relationship, and that would make him panicked, so someone who would understand that side of him would be better. Jimin: First of all, I feel like it would suit Jimin both for older and younger girls. Being able to show his dominance over a younger girl and also able to show his adorable and cheeky side to the older girls. I think he would want someone who’s shorter than him (Shorter than 173cm) because Jimin already gets a lot of teasing from being the shortest member of bts. Having a shorter girlfriend would just be better for him in my opinion. Jimin would want someone who would be like someone who has some aegyo and is able to make him stuff to smile (e.g lunch, letters, etc.) Someone caring and is able to love him only because I feel like Jimin would have a hard time leaving someone after falling in love with them deeply. Taehyung / v: Taehyung is a childish yet manly guy. I think he would want someone who’s younger and shorter than him so that he can tease them and yet protect them in a manly way — purposely doing stuff to please or make someone nervous. (Not saying that he would play with anyone’s hearts tho :0 even tho he technically is with all the taehyung Stan’s LOL) I think someone who is caring and understanding to him would be nice. Someone who would perceive his jokes as just ‘jokes’ and be able to forgive him easily if he does something wrong. Someone who would constantly love him after all the jokes he does to her and someone who wouldn’t cheat or even talk to other guys, and would understand if he had to stay with a girl. Jungkook: Jungkook would want someone older than him since he debuted at such a young age and is pretty childish. Even though I feel like he would want to take dominance someday, having someone he can lean on and talk without awkwardness would be someone he would like. I think someone who is shorter or the same height as him would be ok with him and someone who would understand and look at him and think everything about him is cute is someone he’d want. ",
            "date": "Answered November 23, 2018",
            "views": "169",
            "upvotes": " View 58 Upvoters",
            "upvoters": [
                {
                    "user_id": "Ann Mary",
                    "user_href": "/profile/Ann-Mary-349"
                },
                {
                    "user_id": "Ekakshi Gupta",
                    "user_href": "/profile/Ekakshi-Gupta"
                },
                {
                    "user_id": "Kpv.06",
                    "user_href": "/profile/Kpv-06"
                },
                {
                    "user_id": "Nisha Desuza",
                    "user_href": "/profile/Nisha-Desuza"
                },
                {
                    "user_id": "Kelle Dudas",
                    "user_href": "/profile/Kelle-Dudas-1"
                },
                {
                    "user_id": "Disha Mahesh",
                    "user_href": "/profile/Disha-Mahesh-2"
                },
                {
                    "user_id": "Anarita Dennis",
                    "user_href": "/profile/Anarita-Dennis"
                },
                {
                    "user_id": "Sara Namjoon",
                    "user_href": "/profile/Sara-Namjoon"
                },
                {
                    "user_id": "Jiya Kharbanda",
                    "user_href": "/profile/Jiya-Kharbanda-1"
                },
                {
                    "user_id": "Dana Rangel",
                    "user_href": "/profile/Dana-Rangel-3"
                }
            ]
        }
    ]
}