{
    "title": "Who is the greatest Spanish language poet? - Quora",
    "tags": [
        "Spanish Poetry",
        "Poets",
        "Poetry"
    ],
    "response": [
        {
            "author_info": {
                "name": "Enrique Pareja",
                "href": "/profile/Enrique-Pareja"
            },
            "answer_text": "I fully support User-9938525219388766718’s opinion (as usual) and share his preferences. Could add Miguel Hernández (more here) but be aware that his poetry is more symbolic, baroque and ornamented (and in fact some of his books, as “Perito en lunas” can be very hard to understand even for a native Spanish speaker). In my opinion his “Elegía” (that he dedicated to a friend that had died recently) is one of the best examples of the power and beauty of the Spanish Language: (En Orihuela, su pueblo y el mío, seme ha muerto como del rayo Ramón Sijé,con quien tanto quería.) Yo quiero ser llorando el hortelanode la tierra que ocupas y estercolas,compañero del alma, tan temprano. Alimentando lluvias, caracolasy órganos mi dolor sin instrumento,a las desalentadas amapolas daré tu corazón por alimento.Tanto dolor se agrupa en mi costado,que por doler me duele hasta el aliento. Un manotazo duro, un golpe helado,un hachazo invisible y homicida,un empujón brutal te ha derribado. No hay extensión más grande que mi herida,lloro mi desventura y sus conjuntosy siento más tu muerte que mi vida. Ando sobre rastrojos de difuntos,y sin calor de nadie y sin consuelovoy de mi corazón a mis asuntos. Temprano levantó la muerte el vuelo,temprano madrugó la madrugada,temprano estás rodando por el suelo. No perdono a la muerte enamorada,no perdono a la vida desatenta,no perdono a la tierra ni a la nada. En mis manos levanto una tormentade piedras, rayos y hachas estridentessedienta de catástrofes y hambrienta. Quiero escarbar la tierra con los dientes,quiero apartar la tierra parte a partea dentelladas secas y calientes. Quiero minar la tierra hasta encontrartey besarte la noble calaveray desamordazarte y regresarte. Volverás a mi huerto y a mi higuera:por los altos andamios de las florespajareará tu alma colmenera de angelicales ceras y labores.Volverás al arrullo de las rejasde los enamorados labradores. Alegrarás la sombra de mis cejas,y tu sangre se irán a cada ladodisputando tu novia y las abejas. Tu corazón, ya terciopelo ajado,llama a un campo de almendras espumosasmi avariciosa voz de enamorado. A las aladas almas de las rosasdel almendro de nata te requiero,que tenemos que hablar de muchas cosas,compañero del alma, compañero. Also, I’ve always had a special preference for Antonio Machado, he is also about the closest you can get to a “pure” Castilian Spanish. If you understand Spanish I recommend that you read some of his poems. Also, and on a more popular level, you might want to know that Juan Manuel Serrat, a very popular Spanish singer, published in 1969 an album putting music to some of Machado’s poems; this recording is considered a keystone of Spanish popular music. Oh, he published another recording adding music to Miguel Hernández’s poems! **Self-PortraitBy Antonio MachadoTranslated by A.Z. Foreman My childhood is all memories of a patio in Seville,A orchard in the light where lemons ripened every fall,My life as a young man- some twenty years about Castille,My adult life- a few things I would rather not recall. I've never gone Lothario or played at Don Juan at parties.It's obvious from my slovenly apparel that I can't.Still, I endured the arrow meted out to me by CupidAnd loved as much as women's hospitality could grant. Though drops of leftist rebel blood may pulse throughout my body,My verse has welled forth from a peaceful spring through all my daysMore so than the good boys who follow all the holy strictures,I stand as a good man, and in the good sense of the phrase. I give myself to beauty. In contemporary fashionI've cut some classic roses from the garden of RonsardBut I've no love for make-up of the Modernist beauticiansAnd do not flock with birds that sing in high-flown avant-garde. And I dislike the balladry of hollow lovelorn tenors,The cricket-choirs and tweety-birds who warble at the moon.I cock my ear to try and tell the voices from the echos,And of the many voices I but listen to the one. Classical or Romantic - which am I? Who knows. I ratherWould leave my poetry just as a warrior leaves his blade,More famous for the manful hand that brandished it to purpose Than prized for the learn'd crafting of the forger at his trade. I am in conversation with a friend who's always with me.- Who talks alone can hope someday to talk with the Divine -All my soliloquy amounts to talk with this companionWho shared with me the secret key to loving humankind And in the end, I owe you nothing. You owe me for writing.I go about my work with care, and what I earn I keepTo buy the suit that keeps me clothed, the roof that keeps me sheltered,The bread that keeps the life in me, the bed on which I sleep. And when at last my day arrives, the day of final journeyWhose ship of no return is set to raise the anchor free, You'll find me happily aboard, a lightfoot with scant luggageAnd scarcely clad beneath the sun, like the children of the sea. **The Original: RetratoAntonio Machado Mi infancia son recuerdos de un patio de Sevilla,y un huerto claro donde madura el limonero;mi juventud, veinte años en tierra de Castilla;mi historia, algunos casos que recordar no quiero. Ni un seductor Mañara , ni un Bradomín he sido-ya conocéis mi torpe aliño indumentario-,mas recibí la flecha que me asignó Cupido,y amé cuanto ellas puedan tener de hospitalario. Hay en mis venas gotas de sangre jacobina,pero mi verso brota de manantial sereno;y, más que un hombre al uso que sabe su doctrina,soy, en el buen sentido de la palabra, bueno. Adoro la hermosura, y en la moderna estéticacorté las viejas rosas del huerto de Ronsard;mas no amo los afeites de la actual cosmética,ni soy un ave de esas del nuevo gay-trinar. Desdeño las romanzas de los tenores huecosy el coro de los grillos que cantan a la luna.A distinguir me paro las voces de los ecos,y escucho solamente, entre las voces, una. ¿Soy clásico o romántico? No sé. Dejar quisierami verso, como deja el capitán su espada:famosa por la mano viril que la blandiera,no por el docto oficio del forjador preciada. Converso con el hombre que siempre va conmigo-quien habla solo espera hablar a Dios un día-;mi soliloquio es plática con ese buen amigoque me enseñó el secreto de la filantropía. Y al cabo, nada os debo; debéisme cuanto he escrito.A mi trabajo acudo, con mi dinero pagoel traje que me cubre y la mansión que habito,el pan que me alimenta y el lecho en donde yago. Y cuando llegue el día del último viaje,y esté al partir la nave que nunca ha de tornar,me encontraréis a bordo ligero de equipaje,casi desnudo, como los hijos de la mar. ** The Juan Manuel Serrat version  ",
            "date": "Answered November 16, 2016",
            "views": "11",
            "upvotes": " View 5 Upvoters",
            "upvoters": [
                {
                    "user_id": "Miguel Malfabon",
                    "user_href": "/profile/Miguel-Malfabon"
                },
                {
                    "user_id": "Torin Bell",
                    "user_href": "/profile/Torin-Bell"
                },
                {
                    "user_id": "Nazir Haffar",
                    "user_href": "/profile/Nazir-Haffar"
                },
                {
                    "user_id": "Andres Romero Mier y Terán",
                    "user_href": "/profile/Andres-Romero-Mier-y-Terán"
                },
                {
                    "user_id": "Slavik Fokin",
                    "user_href": "/profile/Slavik-Fokin"
                }
            ]
        },
        {
            "author_info": {
                "name": "Orlando Barrios",
                "href": "/profile/Orlando-Barrios"
            },
            "answer_text": "::Who is the greatest Spanish language poet?:: This question will end needing a wiki. :) I’d like to add another one: Rubén Darío. I won’t destroy any of his poems with -in my case- a necessarily clumsy attempt at translation: enough to paste one of my favorites, Caupolicán: Es algo formidable que vio la vieja raza: robusto tronco de árbol al hombro de un campeón salvaje y aguerrido, cuya fornida maza blandiera el brazo de Hércules, o el brazo de Sansón. Por casco sus cabellos, su pecho por coraza, pudiera tal guerrero, de Arauco en la región, lancero de los bosques, Nemrod que todo caza, desjarretar un toro, o estrangular un león. Anduvo, anduvo, anduvo. Le vio la luz del día, le vio la tarde pálida, le vio la noche fría, y siempre el tronco de árbol a cuestas del titán. «¡El Toqui, el Toqui!» clama la conmovida casta. Anduvo, anduvo, anduvo. La aurora dijo: «Basta», e irguióse la alta frente del gran Caupolicán. And since Gustavo Alfonso Bécquer has already been mentioned, I’d would like to propose the one and only Afro-Cuban poet, Nicolás Guillén. This is his Adivinanzas: En los dientes, la mañana,y la noche en el pellejo.¿Quién será, quién no será? -El negro. Con ser hembra y no ser bella,harás lo que ella te mande.¿Quién será, quién no será? -El hambre. Esclava de los esclavos,y con los dueños, tirana.¿Quién será, quién no será? -La caña. Escándalo de una manoque nunca ignora a la otra.¿Quién será, quién no será? -La limosna. Un hombre que está llorandocon la risa que aprendió.¿Quién será, quién no será? -Yo. ",
            "date": "Answered November 16, 2016",
            "views": "482",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Teresa Yabar",
                    "user_href": "/profile/Teresa-Yabar"
                }
            ]
        }
    ]
}