{
    "title": "Who is your favorite team on this year's IPL? - Quora",
    "tags": [
        "Indian Premier League (IPL)",
        "Cricket in India"
    ],
    "response": [
        {
            "author_info": {
                "name": "Piyush Gambhir",
                "href": "/profile/Piyush-Gambhir-6"
            },
            "answer_text": "2 Teams are capable of winning this year’s IPL ie Delhi Capitals and Mumbai Indians.Let us look in more detail Delhi Capitals They have all the bases covered and could go all the way in IPL 2020.Mentioned are their strengths. Batting: They have arguably the most promising collection of Indian batsmen but they have an issue after No. 5. Prithvi Shaw and Rishabh Pant are absolute aces. Shikhar Dhawan and Shreyas Iyer are not as devastating but can be expected to play longer innings. Shimron Hetmyer makes it an enviable top five.The problem is the absence of a big hitter to follow at No. 6 or 7, especially one who is good on slower tracks as will be expected in the UAE. Towards the end of the last IPL, they settled on Axar Patel and Sherfane Rutherford, but neither of them seem a reliable option when you start planning for a new season. The reinforcements are not that promising either: Marcus Stoinis' best days have come at the top, Alex Carey is not in good T20 form. And neither of their stats suggests great threat against slow bowling in the middle and late overs.One solution could be to bat Stoinis in the top three and ask others to move one position down, but remain fluid with the order if the openers have a long partnership. It might be tempting to go with a floating Stoinis as he provides bowling depth for whatever it might be worth. Bowling: Should the pitches be slightly slow, as the expectation is, they have got good into-the-wicket quicks: Kagiso Rabada, Keemo Paul, Harshal Patel and Ishant Sharma. A jack in the box is Daniel Sams, fresh from a 30-wicket BBL and armed with a point of difference by the virtue of being a left-arm and in Ashwin,they have a spinner who takes the ball away from left-hand batsmen; Amit Mishra, Axar Patel and Sandeep Lamichhane take it away from the right-hand batsmen. Ashwin brings experience, Mishra a low strike rate, Patel extra batting, so there is competition for these slots and readiness to play more than two spinners if conditions allows. Mumbai Indians Batting: With a solid top order and a power-packed middle order, Mumbai don't have much to worry about. Sharma can continue to open with de Kock, who was their leading scorer last year, but Chris Lynn might have to wait, especially given his recent run of low scores and dismissals against spin (six out of nine) in the CPL - the pitches in the UAE are expected to be on the slower side. With Yadav at No. 3 followed by Kishan, the Pandya brothers and Pollard, they look pretty good even for slower tracks. Bowling: Mumbai might miss Lasith Malinga, who is missing due to personal reasons, because he might have proven even more dangerous than usual in the UAE with his experience and slower variations. He usually split the last four overs with Bumrah - this time Bumrah may either do Malinga's job with Boult doing Bumrah's, or Boult may just bowl the 18th and 20th overs with Bumrah sticking to his 17th and 19th overs.Boult had a terrific IPL in 2018 for Delhi Daredevils, especially on the slow Feroz Shah Kotla tracks, and his death-overs record will give Mumbai confidence in Malinga's absence.For pace, they also have Coulter-Nile, who was bought for INR 8 crore ($1.1 million approx.), McClenaghan, Malinga's replacement Pattinson, and Dhawal Kulkarni as options.Unlike the other teams, Mumbai lack a big-name T20 spinner in the squad. Krunal and Chahar will be expected to do the bulk of the heavy lifting and should they need a third spinner in the XI, they could leave out one of the overseas quicks for left-arm spinner Anukul Roy or the offspin of Jayant Yadav. Mumbai may also consider Pollard, who proved handy on slower tracks in the CPL, for a bigger role with the ball. ",
            "date": "Answered September 27, 2020",
            "views": "97",
            "upvotes": " Answer requested by Shiv Sports"
        },
        {
            "author_info": {
                "name": "Shailaja Sabnis",
                "href": "/profile/Shailaja-Sabnis"
            },
            "answer_text": "Mumbai Indians has always been my favourite team. It has already won four times and is hopefully poised to win for the fifth time. It has a very balanced team - great captain, great batsmen, great bowlers and good all-rounders. It has also been fielding well this season. ",
            "date": "Answered September 26, 2020",
            "views": "45",
            "upvotes": " Answer requested by Shiv Sports"
        }
    ]
}