{
    "title": "Who inspired you to become a journalist? - Quora",
    "tags": [
        "Journalists",
        "Inspiration"
    ],
    "response": [
        {
            "author_info": {
                "name": "Kim Cool",
                "href": "/profile/Kim-Cool"
            },
            "answer_text": "It may have sublimial. Each summer we lived in a cabin out in the country. Our next door neighbors were the two top reporters in Cleveland in the late 50s to the 70s when they moved to Pittsburgh. I had a political column and a travel column at Sweet Briar College but majored in economics. When married i was a stay at home mom until my daughter was about 10 when i became co owner of a needlework store. My partned and I did custome designs and has great fun writing our shop newsletter. Then we were asked to write some design books and a needlepoint instruction book for a major publisher in that field. That was even more fun than the newsletter! Years passed and I was widowed and ended up moving to Florida and built a unique house that was written about in the local paper. When I learned the reporter for that story was moving I mentioned that I would like to write about houses parttime for the paper. The editor had me write about a decorator showhouse being held that week. He hired me to write a weekly article about a house or new development etc. I loved it and when I learned the paper was looking for a full-time reporter i told the editor I was interested. By then i had written 40 or 50 articles. He hired me then and there. That was 22 years ago. I did city news and school board and such and volunteered to do some travel writing and help the entertainment wtitwr with play reviews as this area has 3 community theaters plus some of the countrys best professional regional theaters. I was business editor at that time and when the travel /entertainment lady retired I moved to her desk. I still do that but also am features editor for what is consistently the best weekly newspaper in the state in the 7,000 to 15,000 circulation size. It is the perfect job for me. I learn so much every day and work with great people who are intelligent and nice and fun to be with… Life is good when you get a salary to do something so easy and fun while learning so much. I still cover theater but have become an expert on sea turtles, have won awards for medical stories and religion stories and area history plus entertainment and business stories and environmental stories. The variety is a bonus one gets at a small paper with a small staff. I have coveted fires and car accidents and curling and even needlepoint but never football although I was asked to do that once. I know nothing about football so turned that down. If I were at a big city daily i would likely have been stuck in one area. Instead I live in a great little town and was lucky enough to fall into the dream job for me. It would not be for everyone but for me it has been great. If you love writing, find a little paper and see if there is a need for a stringer. You will know after a few stories if the life of a journalist suits you. The main thing is to find a career that you enjoy. I did….by accident ",
            "date": "Answered October 30, 2018",
            "views": "412",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "MIKEL HQ",
                    "user_href": "/profile/MIKEL-HQ"
                },
                {
                    "user_id": "Janet Ybarra",
                    "user_href": "/profile/Janet-Ybarra"
                },
                {
                    "user_id": "M. Vincent Holguin",
                    "user_href": "/profile/M-Vincent-Holguin"
                }
            ]
        }
    ]
}