{
    "title": "Why do people break their marriage vows? - Quora",
    "tags": [
        "Vows",
        "Marriage Advice",
        "Marriage"
    ],
    "response": [
        {
            "author_info": {
                "name": "Michael L Boles",
                "href": "/profile/Michael-L-Boles"
            },
            "answer_text": "There are as many reasons to break a wedding vow as there are persons. I’m leaving out violent obtrusive behavior and dealing with seemingly pleasant relationships. For instance: Do not feel appreciated. Attracted once and not retaining that attraction. No longer romantically attracted to spouse. One or both have altered pivotal beliefs. In time, all respect will be gone. I’d say from over thirty years of working with couples and singles, that the number one reason for breaking a vow is lack of positive communication. Lack of positive communication ruins marriages, relationships, friendships, businesses, causes depression, lowering self worth and esteem. Negatives are put downs, make wrongs and judgmental. Negatives are born out of the frustration of being unable or unwilling to express oneself. Negatives are many peoples way of being heard and/or showing anger at a situation. Mostly negatives are self mutilating, mentally and emotionally. That’s why I love and teach positive, honest communications, spoken appropriately. Don’t talk to the hand (and don’t even say it.) Always talk to the person. Speak to be understood and listen to understand. When disappointed in your partner, you must talk about it, not sex up another. Work it out amiably. Know why you’r staying together or know why you’r breaking it off. Got kids, pets, other joint responsibilities. They are, involved too. Not your own private rodeo . . . ",
            "date": "Updated February 23, 2020",
            "views": "232",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Rhondelle Robanske",
                    "user_href": "/profile/Rhondelle-Robanske-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Julie Evans",
                "href": "/profile/Julie-Evans-83"
            },
            "answer_text": "Hi Blake, thanks for the A2A. I’m someone who is VERY committed to my marriage. To me, the vows my husband and I made just over 11 years ago are a one time deal and are forever. There are those who would think my perception of this is naive, or unattainable, because ‘people are human’. I beg to differ. Free will is not a license to just do whatever you please. To me, the period BEFORE marriage is when you do all your research and ‘testing’ with your spouse. It is BEFORE the ceremony and the uttering of the vows that you learn all that you need to know to determine if he or she is “The One”- not after. If I’d had an ounce of doubt, a smidgen of suspicion.. that my husband would ever ‘stray’, that he would be anything less than what our vows demand I would not have married him The reverse is true in how well I know myself and how well I know my ability to commit to those vows. So I’m sorry Blake.. other than to surmise the some people don’t build a solid relationship before being married, that they aren’t committed to the work it takes to maintain that relationship or that they don’t WANT to, I do not know WHY people break their wedding vows. ",
            "date": "Answered March 23, 2019",
            "views": "292",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Michael L Boles",
                    "user_href": "/profile/Michael-L-Boles"
                }
            ]
        }
    ]
}