{
    "title": "Why should we need to study Biology to become a doctor? - Quora",
    "tags": [
        "Docter"
    ],
    "response": [
        {
            "author_info": {
                "name": "Michael Keyes",
                "href": "/profile/Michael-Keyes-14"
            },
            "answer_text": "There are several ways to answer this question, I'll start with the practical one first, In the US and Canada, medical schools demand it as part of your undergraduate experience. Otherwise, they will reject your application. But there is a reason for this, which is also my second point, medical schools want to see if you are capable of handling science, in this case biology, and to see what your teachers say about your response to the subject. Biology is a complex and often arcane subject that not only requires a lot of memorization, but does not have clear cut logical (and predictive) sequences. It is also gross in all meanings of the word which mimics medical school to a degree. The concepts you learn in undergraduate school only apply peripherally to medical school because they don't become a matter of domain knowledge, but they are indicative of your probable success in medical school. Which brings us to my last point. Medical schools are professional schools whose purpose is to turn out competent physicians ready to learn a specialty in residency. While this does not involve a lot of intellectual rigor, it does involve a lot of work, the ability to deal with what doctors deal with (the gross part) and the transformation of mental, physical and moral viewpoints to that of a doctor. Medical schools want some indications about how you will react when faced with this kind of experience, so along with grades, MCATs, and recommendations, how you perform in the STEM requirements helps them make that decision. These courses also filter out the less capable students, so it is not only a requirement to take biology, you have to do very well in it. The other answers are also correct, medicine is an applied science and a familiarity with the biological sciences is very helpful. About a third of medical school matriculants are not science majors but they have all done well in the required science courses. Careful selection by the schools results in a 96% pass rate of all students and this is what medical schools strive for. Medical school is applied biology. If you don't have a passion for the subject, you won't do well and medical school will quickly become boring. Your exposure to biology in undergraduate school may help you make up your mind whether or not medical school is a good fit for you. Remember, the very first thing you do is to cut up a human body. If you can't handle biology, I can guarantee you that you won't handle that. ",
            "date": "Updated September 20, 2018",
            "views": "15",
            "upvotes": " View 4 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Michael Amigable",
                    "user_href": "/profile/Michael-Amigable"
                },
                {
                    "user_id": "Tuan Nguyen",
                    "user_href": "/profile/Tuan-Nguyen-355"
                },
                {
                    "user_id": "Rod Rishworth",
                    "user_href": "/profile/Rod-Rishworth"
                },
                {
                    "user_id": "John Collins",
                    "user_href": "/profile/John-Collins-211"
                }
            ]
        },
        {
            "author_info": {
                "name": "James Uyi",
                "href": "/profile/James-Uyi"
            },
            "answer_text": "HiIn the United States , a Medical Degree (M.D.) is a professional degree. This means that, after completing your Bachelor’s or undergraduate education, you go on to a specialised Medical School devoted to training you in the medical field . For most students, this also means that your Bachelor’s degree can theoretically be in anything you want , so long as you can pass the MCAT and show that you know a thing or two about medicine. You don’t want to go into medical school without knowing what a Tibia is! (Hint: it’s one of the two bones that make up your lower legs). Biomedicine Bac  There are, however, some degree programmes that will make sure you are extra well-equipped for Medical School in the U.S. These degrees, that largely relate to medical care, health, and treatment will help you once you’re preparing to become a doctor. So, to better prepare for your career saving lives, you’ll want to check out these 5 disciplines to study beforehand. Study Biology to Prepare for Med School Duh! That’s an obvious one. Studying Biology means understanding how life-systems interact, and the science of it is both deeply fascinating and immensely important for doctors. Biology is everywhere in the medical field, and no matter which field you specialise in – surgery, brain science, or pulmonology – Biology will be a huge benefit ",
            "date": "Answered August 27, 2018",
            "views": "611",
            "upvotes": " Answer requested by Hannah Gaddy"
        }
    ]
}