{
    "title": "Why is my handwriting so bad? - Quora",
    "tags": [
        "Graphology",
        "Penmanship",
        "Handwriting"
    ],
    "response": [
        {
            "author_info": {
                "name": "Earl Baversjo",
                "href": "/profile/Earl-Baversjo"
            },
            "answer_text": "You probably will benefit from writing using just two fingers: pointer, and number two. Pretend you are poking a hole in the dirt. This will focus your control down to just your two fingers. From this point look beyond the word you are currently writing by about two small words of distance. This will encourage a level writing line instead of wobbling up and down. The form of your letters should become more standardized no matter what lettering style you pursue. Now it is just a matter of practice. Your writing is really not so terrible. You just need some boldness. Some certainty within yourself. Trusting yourself comes hard for some. A short practice piece with all alphabet letters is a good start. The pointer does the targeting. Number two steadies the two against your thumb. So the three fingers become a team crafting your words. If you feel odd about your last two fingers, tucking them up under your palm might help. Now it is all up to muscle memory. Muscle memory is a part of a martial artist, a soldier, a gymnast. Any task where your movements need to become ingrained to where you do not even think of what you are doing. ",
            "date": "Answered July 17, 2017",
            "views": "68",
            "upvotes": " View 4 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Kate Gladstone",
                    "user_href": "/profile/Kate-Gladstone"
                },
                {
                    "user_id": "Geogina Heath-Bromby",
                    "user_href": "/profile/Geogina-Heath-Bromby"
                },
                {
                    "user_id": "Darren Newland",
                    "user_href": "/profile/Darren-Newland"
                },
                {
                    "user_id": "Duy Nguyễn Khương",
                    "user_href": "/profile/Duy-Nguyễn-Khương-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Shulamit Widawsky",
                "href": "/profile/Shulamit-Widawsky"
            },
            "answer_text": "The shapes of the letters are consistent, line to line. That means you are able to control your hand, and make letters with the same shapes over and over. Therefore, your handwriting shows you have not learned to make shapes that you like. This is not laziness. If you were lazy, the shapes would not be so consistent. You are just not practicing good form. The way to fix this particular problem is to learn a better form. Choose any handwriting book you like (they each have slightly different styles they teach) and work through them. Don’t worry that the books are made for little children, that doesn’t matter. Do all the practices assigned, and try to apply what you learn when you write outside the book, and over a few months, you will see your handwriting improve. Once you have all of it improved, then you can watch out for someone who makes some particular letter, k or z or b, whatever, that you really like, and copy that style into your own style. If you didn’t have such consistent letter shapes, this answer would be very different. But you do. You have already shown you have the ability to write beautifully, you just need to learn and practice. ",
            "date": "Answered July 17, 2017",
            "views": "12",
            "upvotes": " View 22 Upvoters",
            "upvoters": [
                {
                    "user_id": "Jason Bosco",
                    "user_href": "/profile/Jason-Bosco-4"
                },
                {
                    "user_id": "Ryan Gates",
                    "user_href": "/profile/Ryan-Gates-13"
                },
                {
                    "user_id": "Life Hacks",
                    "user_href": "/profile/Life-Hacks-133"
                },
                {
                    "user_id": "Uringuay Kree",
                    "user_href": "/profile/Uringuay-Kree"
                },
                {
                    "user_id": "Iris Duan",
                    "user_href": "/profile/Iris-Duan-8"
                },
                {
                    "user_id": "Charlene Crespo",
                    "user_href": "/profile/Charlene-Crespo-1"
                },
                {
                    "user_id": "Abdul Samie",
                    "user_href": "/profile/Abdul-Samie-5"
                },
                {
                    "user_id": "Psam Ordener",
                    "user_href": "/profile/Psam-Ordener"
                },
                {
                    "user_id": "Nan Waldman",
                    "user_href": "/profile/Nan-Waldman"
                },
                {
                    "user_id": "Bonnie Toney",
                    "user_href": "/profile/Bonnie-Toney"
                }
            ]
        }
    ]
}