{
    "title": "Why might all your characters sound the same (fiction, characters, dialogue, writing)? - Quora",
    "tags": [
        "Dialogue",
        "Fiction Writing",
        "Literary Fiction",
        "Fiction",
        "Creative Writing",
        "Fictional Characters",
        "Writers and Authors",
        "Writing Advice"
    ],
    "response": [
        {
            "author_info": {
                "name": "Z.N. Singer",
                "href": "/profile/Z-N-Singer"
            },
            "answer_text": "That would suggest you haven’t characterized them well, resulting in them all talking with YOUR voice (or perhaps some generic narrator voice). If you’ve got a good understanding of the character, can get in their head, then they should take on a voice of their own. Writing a character is a bit like acting, you are writing what they would say the way they would say it, rather than you. Without that, there’s only one person for them all to sound like: the author. Writers in all fields often comment on how their characters say things they, the author, would never think to say. When this can happen to you, this problem will disappear. A strongly fleshed out character will practically force you to do it their way, they tend to take on a life of their own. It’s a bit like being possessed. And with that cheerful thought, godspeed :) ",
            "date": "Answered October 19, 2020",
            "views": "221",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Hessa هـهـهـهـ",
                    "user_href": "/profile/Hessa-هـهـهـهـ"
                },
                {
                    "user_id": "No And No",
                    "user_href": "/profile/No-And-No-32"
                },
                {
                    "user_id": "Lin Ritter",
                    "user_href": "/profile/Lin-Ritter"
                }
            ]
        },
        {
            "author_info": {
                "name": "Bishop White",
                "href": "/profile/Bishop-White-5"
            },
            "answer_text": "Because they all are you. Here are two methods to make your characters be themselves: 1.Observation. Observe peoples in your life and write short summaries for them. Take the peoples in your life as the prototype of your characters. The more people you meet, the more characters you can write. 2.Imagnation. Find the key features of characters and what experience makes them get the features. Try to imagine you have the same experience as your characters and how you will act and talk. ",
            "date": "Answered October 20, 2020",
            "views": "222",
            "upvotes": "0"
        }
    ]
}