{
    "title": "Why do some French people not like English? - Quora",
    "tags": [
        "French Ethnicity and People",
        "English (language)"
    ],
    "response": [
        {
            "author_info": {
                "name": "Christobachi",
                "href": "/profile/Christobachi"
            },
            "answer_text": "The same as Julia Sudrias, our education system is not well designed for foreign languages and cultures.I understood english not too badly after high school but I was not able to communicate properly plus, as a lot of french people, I was a bit afraid to speak another language.In university, where we need it the most for job and internship chances, my level dropped because the teaching was not here to make you progress, but just to make you keep in mind what you already knew. It took me a lot of series and movies in English with french subtitle, then english subtitle, then no subtitle at all to reach an acceptable level of understanding and get my ears used to this language. And I met my girlfriend from Luxembourg, a very open country, who convinced me to do Couchsurfing when we settled together. Best way to progress when you can’t leave the country. She makes me realize how a big part of France is not really open to other cultures. I don’t know a lot of French who travel, do Couchsurfing, or are really interested on how life or society works in other countries. We don’t have the habit to think outside our borders and, since I’m french, it never strikes me before. So yes, that’s not really a surprise that we are so late on this topic when we compare to other country, but I think we’ll catch up with the next generation :) ",
            "date": "Answered August 4, 2016",
            "views": "44",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "PAtricia BRown",
                    "user_href": "/profile/PAtricia-BRown-146"
                },
                {
                    "user_id": "Soumyadip Ghosh",
                    "user_href": "/profile/Soumyadip-Ghosh-1"
                },
                {
                    "user_id": "Sean Yue",
                    "user_href": "/profile/Sean-Yue-9"
                }
            ]
        },
        {
            "author_info": {
                "name": "Arthur Leloup",
                "href": "/profile/Arthur-Leloup"
            },
            "answer_text": "Aïe ! Aïe ! Aïe ! That question it is kind of “taboo” in France. For many years, not being fluent in English wasn’t a real issue. For instance, look at all our former Presidents (from Sarkozy to Hollande), they were always ashaming us when they used to publicly speak in the language of Shakespeare.  My parents, born after World War II, didn’t learn English at school. German was the most chosen language during that time. Even in what we call in France, the “grandes écoles”, English wasn’t really considered as an important skill to acquire. And even today, some cantankerous teachers in those “prestigious” schools resist to deliver their lessons in English. Last week, I heard a profesor from Polytechnique telling that he intended to defend francophonie by not giving courses in English… However, my generation, mostly raised by the Internet, understood the necessity to be fluent. Emmanuel Macron is, for instance, much better than all its predecessors in English. And I think that all our political and economic leaders, in a not-too-distant future, will not be as shameful as François Hollande when it comes to deliver a speech in English ;) Hope so ! ",
            "date": "Answered January 25, 2018",
            "views": "18",
            "upvotes": "0"
        }
    ]
}