{
    "title": "Why are things typically written in both English and Spanish in the US? - Quora",
    "tags": [
        "English and Spanish Languages",
        "Spanish (language)",
        "Linguistics",
        "Language",
        "Politics",
        "English (language)"
    ],
    "response": [
        {
            "author_info": {
                "name": "SJ \"Joon\" Thomas",
                "href": "/profile/SJ-Joon-Thomas"
            },
            "answer_text": "The United States is the second largest Spanish speaking nation in the world (Mexico is first). The United States has no official national language. Many documents, especially governmental ones, are written from the point of view of effective communications. For example the Internal Revenue Service Multilingual Gateway “offers expanded online language services to individuals, small businesses and international taxpayers. Downloadable files are available in Chinese, Vietnamese, Korean and Russian. The Spanish Multimedia Web page offers links to podcasts, YouTube, the IRS Video Portal and text files.” Voting documents, public health communications, safety advisories and many other public communications are printed in English and Spanish. In particular locales they may also be printed in languages common to those areas. Companies also advertise widely in Spanish, especially as Spanish speaking populations have spread across the United States rather than being concentrated in certain states. Once again, the reason is effective communication. Companies wish to reach their customers and increase sales. Debates about language in the United States is nothing new. From the inception of the republic until World War II German was a widespread language in the United States. German language newspapers, theater, and even political parties appealed to both immigrants and US-born citizens. The debate about whether the nation should enforce the use of English came to a fever pitch as the number of immigrants to the US surged from 1890 to 1910. There are still small groups of Mennonites (Amish) who speak German on a daily basis. Recall that it was not due to immigration that Spanish first became such an important language in the United States. Rather it was land acquisition and conquest that brought Spanish speakers into the boundaries of the expanding United States without those populations having to move an inch! The US annexation of Texas in 1845 and the Treaty of Guadalupe Hidalgo and the of 1848 ceded 55% of what had been the nation of Mexico to the United States, encompassing Texas and what would become the states of California, Nevada, Utah, New Mexico and Arizona, as well as parts of Colorado, Wyoming and Kansas. Over 90% of the population of these areas, many of them Spanish speaking, chose to become US citizens. Language was not a requirement. From that time onward the US has had a core native born Spanish speaking population that has been augmented by immigration. The debate over an official language continues, but has been rejected on the grounds of freedom of speech and liberty. ",
            "date": "Answered November 16, 2019",
            "views": "211",
            "upvotes": " View 3 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Teo Samarzija",
                    "user_href": "/profile/Teo-Samarzija"
                },
                {
                    "user_id": "Margaret Winters",
                    "user_href": "/profile/Margaret-Winters-3"
                },
                {
                    "user_id": "Amir Davis",
                    "user_href": "/profile/Amir-Davis"
                }
            ]
        },
        {
            "author_info": {
                "name": "Paul Carpenter",
                "href": "/profile/Paul-Carpenter-11"
            },
            "answer_text": "I dispute the premise that things are “typically” written in both English and Spanish. This practice is prevalent in places where many people speak Spanish (as you might expect) and rare in places where few people speak Spanish (as you might expect). I live in Los Angeles. Street signs are only in English, with very few exceptions. (Some street signs in Chinatown and Little Tokyo are dual-language.) In most supermarkets, signs labels are only in English, with very exceptions. But, just as you’d expect: In supermarkets that specialize in Central/South-American foods, they tend to be in both Spanish and English, but occasionally just Spanish.In supermarkets that specialize in Korean foods, they tend to be in Korean, but occasionally both Korean and English.In supermarkets that specialize in Japanese foods, they tend to be in both Japanese and English.In supermarkets that specialize in Russian‍/​Ukrainian‍/​Kazakh food, they tend to be in Cyrillic characters, but occasionally in both Cyrillic and Roman.And that’s just Los Angeles. I imagine that in Minnesota, specialty markets have signs in both English and Hmong, with very in Spanish. I imagine that in Vermont, it’s more likely that signs will be in both English and French than in English and Spanish. Voter information pamphlets and Explanation-of-Benefits statements from health insurance companies, often include items in a dozen different languages, typically instructions for downloading or accessing the information in that language. ",
            "date": "Answered October 23, 2019",
            "views": "106",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Susanne Zeiders",
                    "user_href": "/profile/Susanne-Zeiders"
                }
            ]
        }
    ]
}