{
    "title": "Why is it that I can only write my screenplay at night? - Quora",
    "tags": [
        "Screenwriters",
        "Screenwriting"
    ],
    "response": [
        {
            "author_info": {
                "name": "Malindu Kumaradasa",
                "href": "/profile/Malindu-Kumaradasa"
            },
            "answer_text": "I think this is common for all kinds of writers out there because I feel it the same way. At night, one of the main things is the quietness. Because of this quietness, you can process only what you need in your head. I don't know the biology or the psychology behind this but I'm certain that whenever our ears receive some sound, our brain automatically tries to identify what this sound is (as to identify dangers). So without additional sound, your brain becomes clear in order to think more about your play. Another thing is the heat. Even if you're not in a very hot region, there's definitely a difference of the temperatures at the day time and the night time. So you can keep cool and think at night. Also there is this time factor. At day time, there are always loads of things to think of. What you're going to eat next, when you're going to go to the market, when is your neighbour going to pop up at your door, and millions unsaid. This makes your brain work through many operations simultaneously. You might even just sit with the pen to write and think about what you're going to wear for the party at night. So concentrating is an extra effort. Considering all those factors (and probably many more), it makes it closer to impossible to write a screenplay or even an essay at the day time (and if you're a busy person at day, it just makes it worse). I believe this answer meant something to you. Thank you! ",
            "date": "Answered March 19, 2017",
            "views": "178",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Rocco Petrullo",
                    "user_href": "/profile/Rocco-Petrullo"
                }
            ]
        },
        {
            "author_info": {
                "name": "C.S. Friedman",
                "href": "/profile/C-S-Friedman"
            },
            "answer_text": "Everyone has a natural biological rhythm, which determines when body and mind function best, vs when they want to rest. There’s no logic behind it and you can’t consciously change it; it’s an innate schedule. “Night people” function better late at night. Their brains are sharper, their minds clearer, their imagination more alive at night. Obviously you fall into this category. Others are most creative bright and early in the morning, but they’re not responding to this thread :-). Also, introverts often like the quiet solitude of deep night, and draw creative energy from that. Most of my life, my “sweet spot” was 1–3 a.m. Didn’t matter when I got up, how much I slept, or what I was doing during the rest of the day. Nothing ever changed the time. My best writing happened in that time slot, so I saved all my most important writing to work on then. About five years ago, I started taking a medication which, as a side effect, shifted my creative cycle completely. I have no clue how or how or why. My sweet spot, as much as I have one now, is during the day. As an introvert I still love writing at night, and I’m still a night person by preference, but that 1 a.m. creative boost isn’t there anymore. It’s taken me years to adjust to. So whenever or however that sweet spot comes to you, embrace it for all its worth, and schedule your most important projects to be written in the hours when your brain is functioning at its peak. ",
            "date": "Answered March 22, 2017",
            "views": "164",
            "upvotes": "0"
        }
    ]
}