{
    "title": "Why is it the most difficult to write a fantasy book? - Quora",
    "tags": [
        "Creative Writing Books",
        "Fiction Writing",
        "Book Writing",
        "Fantasy (genre)",
        "Creative Writing",
        "Writing"
    ],
    "response": [
        {
            "author_info": {
                "name": "Aditya Oza",
                "href": "/profile/Aditya-Oza-24"
            },
            "answer_text": "Fantasy is the hardest genre to write a story in. Here’s why I believe so: World building.As its name suggests, everything in a fantasy genre book is fictitious. This means that you need to build everything from scratch. Every idea, every character, a kingdom, a world order, whatever it is that your book is set in.This process is extremely difficult. Your book can go a million ways, but you need to find out which one suits your novel the best, and how your characters blend in this environment. Everything from the education to the judiciary needs to be built up from the ground, unless you are writing in a real world setting.PlotThis reason isn’t really specific to the fantasy genre; It is true for any genre. The plot of in a fantasy genre is normally built up due to a conflict between two systems, or a character or a group and a system, and you need to figure out what the conflict is. You need to give the characters proper motivation and justify their action so the plot of the novel doesn’t feel forced.I think the first reason explains it well. If you liked this, drop a follow and help me build an extra curricular activity so I can get to college, man. ",
            "date": "Answered March 6, 2020",
            "views": "757",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Mansi Goel",
                "href": "/profile/Mansi-Goel-12"
            },
            "answer_text": "Writing fantasy fiction is easy. Know why? Because in that fantasy world, you are the god. I'd say writing a fiction based on real life incidents is the toughest, because you cannot just say anything out of the blue. You're limited by reality and rules. In fantasy, there are absolutely no rules. ",
            "date": "Answered April 26, 2015",
            "views": "684",
            "upvotes": " View 2 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Divija",
                    "user_href": "/profile/Divija-8"
                },
                {
                    "user_id": "Sarang Jairaj",
                    "user_href": "/profile/Sarang-Jairaj"
                }
            ]
        }
    ]
}