{
    "title": "Why am I bad at expressing feelings? - Quora",
    "tags": [
        "Understanding Emotions",
        "Emotions",
        "Human Behavior"
    ],
    "response": [
        {
            "author_info": {
                "name": "Angela Miller",
                "href": "/profile/Angela-Miller-20"
            },
            "answer_text": "There are 2 components to being able to express feelings: you must be aware of the feeling and you need a practiced vocabulary to express feelings. Truly, many people are taught by their parents and teachers ONLY how to behave. They are not taught how to acknowledge and process associated emotional content. MANY people just suppress their feelings in order to comply with required behaviors. They aren’t even AWARE of their own feelings at any given time. You can begin your emotional growth just by acknowledging that you are HAVING feelings. A secondary effect of having received no “emotional education” is that you do not have words to express what you are feeling. Here is a list of feeling words to help you in your journey to discerning your feelings:  (Credit to wasatchfamilytherapy.com) Once you know what you are feeling and you have a vocabulary for it, you will be better able to put it into words. The last step is to PRACTICE. When you find yourself feeling upset, see if you can IN YOUR OWN MIND, give words to your circumstances. Example: “I am frustrated because the delay from my co-worker is going to cause me to have to work late.” If you are feeling happy, perhaps you can elaborate, “I am proud of my accomplishment,” or “I am looking forward to my upcoming trip.” It may help you to have a “safe person” to practice your “emotional vocabulary” with. I use the term “safe person” to describe someone who will be soft and non-judgmental with you as you uncover and explore vulnerable parts of your inner self. This is actually very difficult to do, but don’t give up. Many (most) people find that they feel more fully THEMSELVES after going through this process. There is a certain temperament of person that does not feel as great of a need to outwardly express emotions. You may be one of those people. But you will always benefit from having access to the emotional part of yourself to CHOOSE to express. ",
            "date": "Answered January 3, 2018",
            "views": "6",
            "upvotes": " View 8 Upvoters",
            "upvoters": [
                {
                    "user_id": "Riya Verma",
                    "user_href": "/profile/Riya-Verma-520"
                },
                {
                    "user_id": "KUMMARI MANASVI",
                    "user_href": "/profile/KUMMARI-MANASVI"
                },
                {
                    "user_id": "Kryzelle Diaz",
                    "user_href": "/profile/Kryzelle-Diaz-1"
                },
                {
                    "user_id": "Yogita Patil",
                    "user_href": "/profile/Yogita-Patil-6"
                },
                {
                    "user_id": "Ashish Sharma",
                    "user_href": "/profile/Ashish-Sharma-2871"
                },
                {
                    "user_id": "Aditi Balduwa",
                    "user_href": "/profile/Aditi-Balduwa"
                },
                {
                    "user_id": "Alberta Odamea Anim-Ayeko",
                    "user_href": "/profile/Alberta-Odamea-Anim-Ayeko"
                },
                {
                    "user_id": "Julia Bander",
                    "user_href": "/profile/Julia-Bander"
                }
            ]
        },
        {
            "author_info": {
                "name": "Marijn Depraetere",
                "href": "/profile/Marijn-Depraetere"
            },
            "answer_text": "It’s a learned skill, like everything in life. The examples you see around you help you to react on emotions a certain way. This is why family-members look alike and mostly think alike. How our parents are is how we learn how the world is. If your mother is really loving and Suzy homemaker, you experience this as the truth in your youth so in essence you suppose everyone’s mother is exactly as loving and suzy homemaker as your’s was. You yourself will be more susceptible to those emotions. If your mothers was distant, “correct” and hard-working, you assume everyone’s mother is like that and you yourself will be more distant and “correct”. It’s not a problem, it’s a different way of experiencing the world. Emotions are like skill’s, it takes practice to make perfect. Everything we do as humans needs repetition and experience. Nobody is a good soldier because they own a gun, they become one because they learn how to handle a gun. In perfect circumstances all children are raised as joyful individuals, provided opportunity after opportunity to explore their own talents, skills and emotions until they develop into complex but balanced individuals. In current society most parents are working outdoors, care is provided by paid professionals and not a lot of family-time is left to develop those emotions and methods of communication. Practicing emotions is easy: go out and meet strangers. Talk about things that are more insightful then the weather or sports, things that matter to you. Allow yourself to feel and to react, but remember you cannot use violence. Practice makes perfect. Good luck! ",
            "date": "Answered January 3, 2018",
            "views": "22",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Aadhy Shrivastava",
                    "user_href": "/profile/Aadhy-Shrivastava"
                }
            ]
        }
    ]
}