{
    "title": "Why do people use big words? - Quora",
    "tags": [
        "English Diction and Word Usage",
        "Words",
        "Vocabulary of the English Language"
    ],
    "response": [
        {
            "author_info": {
                "name": "Hannah Kris",
                "href": "/profile/Hannah-Kris"
            },
            "answer_text": "While big words certainly do have an association with pompous, elitist, over-educated people, but is it really fair to assume that big, rare, complicated, multi-syllabic words are unecessary, and that the people who use them are simply trying to show off? Well, it often depends. The purpose of language is first and foremost to communicate: This means that regardless of specificity, one cannot effectively communicate through a level of vocabulary above that of their counterpart. If I am speaking to a five-year old, it would be improper and inefficient to use words that are tested on the SAT, for example, because the five-year old will not understand what I am saying, and I will merely have to repeat myself using correct language for the developmental stage of that child, thereby eliminating the use of the large words. Similarly, it would be equally inefficient if a lawyer started speaking in very complicated legal jargon to someone who didn't graduate high school, because they will likely not understand and the lawyer will simply have to repeat himself in a less specific, less wordy, less complicated way. However, this use of language specifically as a tool of communication works both ways. In the English language, we have many words that mean almost, but not quite the same thing. For example, think of all the words you know that are synonyms for the word run. You can probably think of several: sprint, dash, jog, scamper, hasten, speed, etc. But do they really all mean the same thing? If I told you that someone sprinted to the bathroom, doesn’t that give you a different understanding than if I told you that someone jogged to the bathroom. The two words jog and sprint are both synonyms for run, and both both mean essentially the same thing, but the word sprint gives a sense of urgency to the sentence that isnn’t there when I use the word jog. This is why people use big words when they speak, they can’t simplify the words because doing so would alter the meaning of the sentence. Of course, as I said earlier it would still be preferable to simplify a sentence when speaking to a person with a more limited vocabulary, as communicating a partial, or a more general idea is preferable to communicating nothing. Additionally, language can also be used to express education or to distinguish oneself, or equally to show adherence to a social or ethnic group, or class. If you were to walk into a panel on neuroscience and you don’t use scientific names for areas of the brain in an attempt to simplify your language, you will be laughed out of the building, and, more importantly, people will understand your avoidance of scientifically correct terms as a sign that you are not educated in neuroscience and will probably subsequently ignore what you have to say, because you have failed to establish yourself as an expert, or at least someone who's opinions should be respected. You may have communicated in a way that would make sense to a wider audience, but because that wasn't necessary, you have instead only indicated that you are uneducated in a topic. By the same token, language can indicate belonging to a group of people, usually defined by ethnicity, race, or class. This is what leads to the proverbial “\"code-switching,” as people attempt to move between social groups by using language. Just as it would be off-putting for a surgeon to use non-scientific words to describe anatomy, it would be equally off-putting to hear someone living in a poor, uneducated section of town use words associated with a higher educational status. When these conflicts of language occur, it can lead to people deducing that someone doesn’t belong in a group of people, or that someone is attempting to be an “imposter.” This is another commonly used entertainment cliche. So why do people use big words? Well, in most cases, it is simply because using more simplistic words will not lead to the intended outcome of speaking either through a failure to convey meaning, or a failure to communicate status, respect, or belonging. ",
            "date": "Answered August 23, 2016",
            "views": "16",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Brahm Watson",
                    "user_href": "/profile/Brahm-Watson"
                },
                {
                    "user_id": "Jaigobin Shivcharran",
                    "user_href": "/profile/Jaigobin-Shivcharran"
                }
            ]
        },
        {
            "author_info": {
                "name": "Gigi J Wolf",
                "href": "/profile/Gigi-J-Wolf"
            },
            "answer_text": "My brother was telling me once about a seminar he’d attended. His fellow attendees told him that they felt as if he was patronizing them because he used ‘big words.’ I don’t know what the words were; presumably they were over one or two syllables and ticked people off just hearing them. His words must have been variously: Nettlesome, injudicious, polysyllabic, inimitable words that he refused to stop saying. He’s really a smartie. Articulate AND verbose, f you can understand what-in-the-mouse’s-bolt hole, he’s talking about. He felt rather badly about these people’s assessment. He isn’t patronizing, in any sense, that I’ve ever noticed. Au contraire, he’s always going on about something sunshiny. He is a little dorky, if you’ll pardon the small word. I sent him one of my stories once, that everyone who read it understood immediately at the end (it had a sort of ‘hidden meaning’), and he sent me an email saying I should have ‘developed’ the ending more thoroughly, because of whatever. He hadn’t understood it at all! The ending WAS the ending. I was blown away. How could someone THAT smart and educated, be so obtuse? (See, ‘obtuse’ is so much more polite, and far more indicative of his gigi-story-critiquing skills than saying he’s dumb.) He ain’t dumb, by any stretch of the imagination. But he can be very obtuse about some things. His level of education is very high, he uses words that reflect that, without even thinking twice about their choice. Why on earth should he be castigated for that? It’s like saying that an opera singer shouldn’t sing those complicated, high-toned arias (Or whatever; I’m not an opera buff), because other people don’t understand them. We like rock and pop and rap. A writer has NO right to use descriptive, fluid phrasing, or write off-beat poetry, because a lot of people don’t understand the verses or words. (Have you read T.S. Eliot or Proust? What were those guys smoking?) And why is that athlete running so fast, and taking supplements, and using visualizations? I just do a normal work out! I don’t aim for the Olympics! Big words just come easily to the lips of those who read them, know them, and then use them, to articulate what they wish to say. It has no deeper meaning than that. Edit: It’s been pointed out, with some justice, that my analogy doesn’t hold water. Speaking directly with people is NOT the same as singing opera in a performance. But I’m at a loss at the moment for a better one. I still don’t think someone should be penalized for having a broader, more educated vocabulary. To not use it, out of a false sense of modesty, is like saying someone shouldn’t have any other specialized knowledge; or rather, they shouldn’t use knowledge that’s beyond the norm because it makes other people feel bad. ",
            "date": "Updated July 30, 2018",
            "views": "705",
            "upvotes": " View 481 Upvoters",
            "upvoters": [
                {
                    "user_id": "Brahm Watson",
                    "user_href": "/profile/Brahm-Watson"
                },
                {
                    "user_id": "Prakhar Saini",
                    "user_href": "/profile/Prakhar-Saini-7"
                },
                {
                    "user_id": "Jessica V",
                    "user_href": "/profile/Jessica-V-74"
                },
                {
                    "user_id": "Ishpreet Kaur",
                    "user_href": "/profile/Ishpreet-Kaur-171"
                },
                {
                    "user_id": "Bob Marl",
                    "user_href": "/profile/Bob-Marl-7"
                },
                {
                    "user_id": "Lynn Nguyen",
                    "user_href": "/profile/Lynn-Nguyen-95"
                },
                {
                    "user_id": "Alessio Marin",
                    "user_href": "/profile/Alessio-Marin-5"
                },
                {
                    "user_id": "Julius Naktinis",
                    "user_href": "/profile/Julius-Naktinis"
                },
                {
                    "user_id": "Elijah Gardner",
                    "user_href": "/profile/Elijah-Gardner-5"
                },
                {
                    "user_id": "Zarine Arya",
                    "user_href": "/profile/Zarine-Arya"
                }
            ]
        }
    ]
}