{
    "title": "Why do editors expect authors to submit manuscripts instead of ideas? - Quora",
    "tags": [
        "Manuscripts",
        "Publishing",
        "Writers and Authors"
    ],
    "response": [
        {
            "author_info": {
                "name": "David Lascelles",
                "href": "/profile/David-Lascelles"
            },
            "answer_text": "By editors I am assuming the idea of ‘commissioning editor’ in a publishing house rather than someone who edits your document. Because, you know, if it is the latter the answer is obvious - you cannot edit an idea. But assuming the former… Ideas are cheap. Most people can rattle off hundreds in a day, some of them may even be good ones. Many ideas are far from unique anyway, publishers see the same ones again and again: “What if like Moby Dick only the Whale is a giant space squid?” “What about Pride and Prejudice but in a gender flipped setting?” “What about Dracula but the four protagonists are vampires chasing down the poor, human count?” “What about Harry Potter but a school for Vampires/Werewolves/Trolls/Faeries?” And I can give actual examples of published books that cover the last one… both of which are actually better written than Potter ever was. That’s four ideas I just did in about two minutes (took longer to write them down than it did to think them up too…). If publishers paid for ideas I could be sending them 30 to 60 an hour and raking in millions. Ideas are worthless because they can be so quickly created. What takes the work is developing the idea into something entertaining. I could do the gender flipped Pride and Prejudice by doing little more than downloading a copy of Austen’s text and using Find and Replace to change pronouns and character names. Lizzie becomes Larry, Jane becomes Johnathon, Mr Darcy becomes Miss Darcy… however, it wouldn’t really be very interesting or new or exciting because the same things happen, the same themes are explored, the same characters do the same things. Lady Catherine is still an overbearing arrogant old codger even when renamed Charles. Nothing is fundamentally different, just the different genitals. So, instead, what needs to happen is an exploration of an alternative Regency England where women have always been the dominant gender. How does that impact things? What differences are there? How is the socio-economic aspects of the world changed by this? Does this change any of the possible outcomes? Ideally, you might even want to remove things entirely from Regency England and consider the same situation - five unmarried siblings with poverty a result of not getting married - in a new setting. How about a more modern setting where polyamoury, homosexuality and transexuality are common? How does that change the setting. Point is that, as an author, coming up with the idea is basically a two minute job. The hard part is making it work - establishing the impact of your idea on the world you create, ensuring those changes are displayed in your world building and writing the book… ",
            "date": "Answered September 24, 2020",
            "views": "67",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Charlie Kelly",
                    "user_href": "/profile/Charlie-Kelly-25"
                },
                {
                    "user_id": "John Hudson",
                    "user_href": "/profile/John-Hudson-158"
                },
                {
                    "user_id": "Elena Piatti",
                    "user_href": "/profile/Elena-Piatti"
                }
            ]
        },
        {
            "author_info": {
                "name": "Ralph Crown",
                "href": "/profile/Ralph-Crown-1"
            },
            "answer_text": "If you want an apple, you don’t buy a seed. Someone has to germinate it, plant it, water it, tend it, prune it, protect it from pests, and harvest it. People who are not writers want stories, not ideas. You have to develop the plot, the setting, and the characters. You have to draw in your audience, increase the tension, unleash the climax, and leave them wanting more. You have to set down the words and punctuation and paragraphs in a way that an editor can decipher. You have to market yourself and your work if you want to be famous. Ideas are everywhere. A good idea will inspire you to bring it to life. The editor is neither an artist nor a reader but an intermediate who is in the business of publishing. She needs apples to sell to a hungry public, not seeds. ",
            "date": "Answered September 30, 2020",
            "views": "19",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Bret Hampton",
                    "user_href": "/profile/Bret-Hampton"
                }
            ]
        }
    ]
}