{
    "title": "Why is it so difficult to write a script? - Quora",
    "tags": [],
    "response": [
        {
            "author_info": {
                "name": "Matt Burwood",
                "href": "/profile/Matt-Burwood"
            },
            "answer_text": "The basic answer would be sheer complexity, though to be a little more helpful... Time The 'temporal' nature of a screenplay makes it very tricky indeed. When creating a painting for example you have a single 'snapshot' to get right, whereas a movie script contains many different snapshots over a period of time. This makes it tricky for a couple of reasons - You have to consider how those 'snapshots' (or scenes) interlink with one another - for example if you make adjustments to one scene it might have implications for scenes elsewhere in the script.You can't take in the screenplay all at once.With a painting you can stand back and get a good look at the overall image. You can turn your head sideways, look at the painting in a mirror. All these things make it simpler to spot flaws or incorrect 'proportions'. Scripts also contain incorrect proportions but more in a temporal sense - for example the beginning might be too long or not long enough, there might not be enough of a build up to a payoff. However it's impossible to take the entire script in at once, you have to read it through from start to finish. Do that enough times and you start to lose your sanity! I liken this phenomenon to how when you listen to a song over and over it starts to lose all meaning - it's hard to retain that sensation of listening to it 'fresh' so to speak. You get so 'close' to the script eventually it can be almost impossible to judge it objectively, the best you can hope for are flickers of insight into what the problems are. Distancing yourself is the key here, for example put it down for a couple of days. When you come back it'll be more like reading someone else's work. Amount of variables A script has many different dimensions that are almost impossible to distinguish from one another, such as - Character MotivationsStoryEmotionDialoguePacingMysteryEtc...When you're reading a part of the script and something isn't quite 'grabbing you', it can be hard to work out what is wrong. It's hard enough to do this with something like a painting, but with a script it's a whole other level - Is this scene bad because of the dialogue?Is it bad because the story isn't right?Is it actually not so bad, but in fact there is something wrong earlier in the script that means this scene isn't set up correctly and therefore lacks the desired impact?Learning to be able to pinpoint problems and get a feel for why something is wrong is the hard part of writing, and something that takes lots of practice. Even then, it's still blinkin' hard! There are no rules What works for one script may not work for another (not least because you don't want to be cliche!). Writers must innovate in some way in order to get a worthwhile script and this requires an element of pushing the boundaries of the art form, even for the most 'formulaic' of movies. Quite honestly it's a lot down to intuition, creativity and other very 'wishy washy' skills. It's not like cooking where you can follow a recipe to the letter and get the same result as a professional chef. Audiences want to be surprised and so any attempts to follow the rulebook to the letter are guaranteed to end in a bad script. The way it's consumed This is a biggie. Unlike a book for example - a movie is consumed all in one go. You have to keep someone glued to their seat for 2 whole hours. Try getting them to do that any other way! Most novice writers or filmmakers don't have anywhere near enough respect for the audience's time. They don't see it as a case of \"right... I need to keep these people here and interested for 2 hours (or even 15 minutes)!\". It's almost taken for granted that the audience will sit through the movie and this is why many novice efforts can be so excruciating to watch. This all starts with the writing of course, and it's up to the writer to create something that's in some way compelling and engaging to stop people wanting to walk out half way through. The writer is going about it the wrong way Writing is hard, but it's even harder if you don't know how to do it properly. A writer has to learn the craft of writing and adopt a structured process in order to be able to combat the above mentioned pitfalls. Do it the wrong way and writing becomes even harder. If you're really struggling, it's probable you're doing it like this... Sit down in front of a blank page - try to think of things to write.This is guaranteed to end in wanting to smash your head in with a typewriter. Everyone is slightly different and has a different writing process, however in my experience it's largely about finding ways to 'trick' your mind into generating good ideas. When faced with a blank page, almost everyone's mind will start to race with infinite possibilities and this creates a kind of mental block. You're faced with so many possibilities it's hard to settle on one, you also feel under pressure to think of something good, which is terrible for being creative. Some structure is required to narrow down the possibilities and stop the panicky thoughts of \"oh sh***ing hellllll... what do I write?\". This 'structure' can take many forms, throughout the writing process - For example, if you're faced with the task of thinking of a good movie idea (which you often aren't, but still). The question \"what is a good movie idea?\" is a horrific one to ask yourself. Instead you would try things like \"what's a good movie about two kids in space?\" or \"what would happen if you could read minds?\". These sorts of questions are both very easy to think of and to answer. You're providing a structure and limitations to work within and the brain much prefers this to a blank slate. Highly Recommended: Never Brainstorm with a \"Blank Slate\"  When I'm trying to think of dialogue, I don't ask myself \"what would this character say?\". Instead I actually imagine myself as them stood in the scene - if I were them, what would I say? What would I be thinking or feeling at that moment?This helps to get you thinking in an 'authentic' way and to connect with a character, once again it's avoiding the tricky question of \"what is something good to write?\" and replacing it with something easier \"if you were in this situation what would you do?\" Instead of just thinking \"what is a good way to write this scene?\". I'll ask the question \"what are 5 ways this scene could happen?\".This stops the worrying about finding the perfect option - you're then just brainstorming and choosing from a list of 5 favourites. If they're all crap then at least you've worked out what you don't want, and by doing this you'll have got your brain into gear and further ideas should flow more easily. As I say, writing is very much a craft that must be learned, no one can tell you how to write a good script, however you can learn about the process which makes it a whole load easier than doing it the wrong way. Still really hard though - especially when you're doing it in the real world, dealing with feedback and/or interference from real people, plus having to work it around your responsibilities and being knackered and whatnot! Edit: Wanted to add one other thing which was that you know the story and characters but the audience doesn't. It can be really hard to remember what the audience knows about the story at any given moment. This can skew your perception of the script. A simple example of this may be that you may forget you need to reveal certain information about a character, and just assume the audience will know it. So when you see films that are quite clearly badly written and edited, to you it appears like that but when the filmmakers were writing or editing the movie, to them it could have seemed great. As in - they knew all the back story so could get engaged in that moment in the climax which is supposed to be really heartfelt, but to the audience (who only knows about what they've seen on screen) it doesn't quite have the desired effect. ",
            "date": "Answered January 9, 2016",
            "views": "62",
            "upvotes": " View 19 Upvoters",
            "upvoters": [
                {
                    "user_id": "Roque Falabella",
                    "user_href": "/profile/Roque-Falabella-2"
                },
                {
                    "user_id": "Abhilash V",
                    "user_href": "/profile/Abhilash-V-16"
                },
                {
                    "user_id": "Fer Vassolo",
                    "user_href": "/profile/Fer-Vassolo"
                },
                {
                    "user_id": "Vijay Sharma",
                    "user_href": "/profile/Vijay-Sharma-1444"
                },
                {
                    "user_id": "Ashok",
                    "user_href": "/profile/Ashok-594"
                },
                {
                    "user_id": "Aryan Varma",
                    "user_href": "/profile/Aryan-Varma-4"
                },
                {
                    "user_id": "Seiko Red",
                    "user_href": "/profile/Seiko-Red"
                },
                {
                    "user_id": "Akshit Gupta",
                    "user_href": "/profile/Akshit-Gupta-71"
                },
                {
                    "user_id": "Michael Wilde",
                    "user_href": "/profile/Michael-Wilde-11"
                },
                {
                    "user_id": "Ashwin Singh",
                    "user_href": "/profile/Ashwin-Singh-15"
                }
            ]
        },
        {
            "author_info": {
                "name": "Noel Cunningham",
                "href": "/profile/Noel-Cunningham-4"
            },
            "answer_text": "Because they have no pictures.   Kidding...  The real reason it's so difficult to write a script is ,,,,, because it's difficult to write a script.  I'm serious.   If it were easy they wouldn't be worth so much.  Everyone would be doing it.  And there would be more good movies.   But it's tough.   It's a lot of sitting in a chair, writing hundreds of pages that get thrown away, frustration, angst, having to dump some of your favorite sections because they're slowing things down.  Going through it page by page, refining and rewriting for probably well over a year - that's how long it takes to go from \"I have an idea\" to completing a revised and rewritten \"First Draft\" that you can start showing people.  Over a year.   There's no getting around that part either.       There's mounds of other stuff too.  You need to know stor and structure, theme, marketing, character, dialog, how to create with words.  How to choose subject matter, ways to get name actors to consider your script.   And and and...  and it's hard to do it badly.  Even harder to do it well.   The only way to get better at it is time.  Writing and writing and writing... that's the only way it gets easier.   See, there's something else people don't get about writing movies.   They think because they, \"like movies and got good grades in creative writing\" that they have the skills necessary.    They don't any more than if I were to suddenly decide since I like movies and I'm pretty good with my hands I can build a car from scratch.    That's ridiculous, right?    Well, they do that every day.    It's tough.  You need to have a hard work ethic, you need to be resilient, you need to be stronger than the next guy and you need to earn your way to sit at the table.  And then you need to show off what makes you better than everyone else.    Good luck.   ",
            "date": "Answered January 11, 2016",
            "views": "15",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Teddy Hickman",
                    "user_href": "/profile/Teddy-Hickman"
                },
                {
                    "user_id": "Seiko Red",
                    "user_href": "/profile/Seiko-Red"
                }
            ]
        }
    ]
}