{
    "title": "Why don't people say there is 'Asian Privilege'? - Quora",
    "tags": [
        "Privilege",
        "Asian People"
    ],
    "response": [
        {
            "author_info": {
                "name": "Kyung S. Lee",
                "href": "/profile/Kyung-S-Lee"
            },
            "answer_text": "Because being economically successful does not necessarily mean that one has privilege. It just means that one has found a way to reach that goal in spite of any obstacles. Being successful does not mean that one has never faced obstacles due to race. I will give you one example. In the past, a lot of Korean immigrants opened businesses in very bad neighborhoods. Why? Because they did not have enough money to open them in safer neighborhoods. There is a correlation between safety and the income of an area especially in urban settings. Are they able to do this because of bank or government loans? Highly unlikely as they are not eligible due to their citizenship status and do not have a credit history in America due to having come recently from Korea. So then, how do they get the money? Some bring their savings, but many work at other jobs or pool their money with other immigrants to secure a deposit. They brave making money in areas with high crime, high insurance rates, and lots of shoplifting and manage to earn enough to send their kids to good schools while working ten hours a day and not seeing them much. The result is a comfortable future for their children, but I don't think one could say that it was a privileged route. There are other Asian groups that do this as well, run businesses working long hours and dealing with crime in their jobs. Gas stations, convenience stores, and taxis (somewhat) fall in this category. The model minority label was not something created by Asians, but actually the mainstream (white) media to explain the success of Asian students in schools and East Asian immigrants generally. This was later applied to South Asian immigrants as well when their numbers increased. It was not a label asked for, but a stereotype imposed on Asian people. It makes some people less scared of Asians, but that is not always a good thing. Because some people use it as a license to harass Asians, thinking that they won't fight back. And sometimes, Asian students do not get the help they need because they are assumed to be good at school. East and South Asian Americans are not successful because of privilege, but because they tend to value education more than some other groups. When you value education, you invest the required time and effort to achieve a quality education and do well in that area. You look at homework and report cards. You make sure that your child is learning. Does not take a lot of effort. I know of some parents who just look at report cards. Some say that it has to do with the class of Asians that immigrate, but I will disagree because I know of a number of Asians that did not graduate from high school, but managed to send their children to good colleges. In East Asian countries, education is valued by all classes. So you will see a lot of taxi drivers in South Korea, for example, who work long hours to get additional tutoring for their kids. There is not a great socioeconomic gap in PISA scores because of this and other factors. You don't need a lot of money to make sure that your children do well in school. You just need to care and have some common sense. I believe that Ben Carson, who is not Asian, had a mother that could not read well, but she made sure that he did well in school. You can't just assume a lack of racism because of success. Barack Obama had racism and he was the President of the United States. If he can get racism as president, then so can other people. But he's black. Okay, well, Gary Locke was not and he still received death threats while he was governor. That is part of why he chose not to run for re-election despite a high approval rating. Satisfied? ",
            "date": "Answered May 24, 2017",
            "views": "17",
            "upvotes": " View 24 Upvoters",
            "upvoters": [
                {
                    "user_id": "Renee E. Tolentino",
                    "user_href": "/profile/Renee-E-Tolentino"
                },
                {
                    "user_id": "Daniel Park",
                    "user_href": "/profile/Daniel-Park-425"
                },
                {
                    "user_id": "Jane Hu",
                    "user_href": "/profile/Jane-Hu-33"
                },
                {
                    "user_id": "Zahra",
                    "user_href": "/profile/Zahra-430"
                },
                {
                    "user_id": "Randy Kiyabu",
                    "user_href": "/profile/Randy-Kiyabu"
                },
                {
                    "user_id": "Fukai Miao",
                    "user_href": "/profile/Fukai-Miao"
                },
                {
                    "user_id": "Seungwoo Park",
                    "user_href": "/profile/Seungwoo-Park-2"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/Regan-63"
                },
                {
                    "user_id": "Kirsten Lee",
                    "user_href": "/profile/Kirsten-Lee-9"
                },
                {
                    "user_id": "Nathaniel Carreon Jr.",
                    "user_href": "/profile/Nathaniel-Carreon-Jr"
                }
            ]
        },
        {
            "author_info": {
                "name": "Jasper Thomas",
                "href": "/profile/Jasper-Thomas-13"
            },
            "answer_text": "Because not all problems are economic: people are still jerks to Asians, as a normal, accepted part of daily life. People still grow up reading tikki tikki tembo long after anti black books have been put out of circulation. People still tell me that they love sushi when they hear about my racial/ethnic makeup, and nobody has ever said “I love croissants” to a white kid. Teachers still get away with making jokes about Asian kids and their families, or badmouthing them in ways that would be utterly unacceptable had they been black or hispanic. And not all Asians enjoy a homogeneous amount of economic success: Less affluent subgroups of Asians are lumped in with the more successful, which sets them back immensely. A second generation Chinese person born to doctors and lawyers is much better off economically than the descendants of refugees. Yet even those of less privileged descent have to push past barriers like affirmative action, which actively limits Asians. Also, Asians tend to do their share of work for the economic success that they tend to enjoy. Had a white person done exactly what an Asian person did, they would likely have just the same amount of success. Most native born white people speak one language and didn't even have to go through all the BS my mom and the older Asians in my community had to go through as kids, yet they feel entitled to more “economic success” after choosing less demanding jobs. Don't you see the irony in that? If people want to simulate the “privilege” of being an Asian, they can give most of their belongings to goodwill and move to China, then try to make it in a really demanding field, like engineering. If you do poorly, people think that Asians are stupid. If you do well, people will assume that you somehow cheated using Asian privilege or magic math genes. That's Asian (or rather, minority) privilege for you. ",
            "date": "Updated June 1, 2017",
            "views": "953",
            "upvotes": " View 16 Upvoters",
            "upvoters": [
                {
                    "user_id": "Renee E. Tolentino",
                    "user_href": "/profile/Renee-E-Tolentino"
                },
                {
                    "user_id": "Kelli Nakamura",
                    "user_href": "/profile/Kelli-Nakamura-2"
                },
                {
                    "user_id": "Rosalie",
                    "user_href": "/profile/Rosalie-28"
                },
                {
                    "user_id": "Prudence Wilson",
                    "user_href": "/profile/Prudence-Wilson"
                },
                {
                    "user_id": "Kenneth Lo",
                    "user_href": "/profile/Kenneth-Lo-14"
                },
                {
                    "user_id": "Brett Bakos",
                    "user_href": "/profile/Brett-Bakos"
                },
                {
                    "user_id": "Shusen Liu",
                    "user_href": "/profile/Shusen-Liu-1"
                },
                {
                    "user_id": "Jonas Katona",
                    "user_href": "/profile/Jonas-Katona"
                },
                {
                    "user_id": "Syed Hasan",
                    "user_href": "/profile/Syed-Hasan-82"
                },
                {
                    "user_id": "Angela Matz",
                    "user_href": "/profile/Angela-Matz-1"
                }
            ]
        }
    ]
}