{
    "title": "Why should one thank God? - Quora",
    "tags": [
        "Theology",
        "God"
    ],
    "response": [
        {
            "author_info": {
                "name": "Umar Sheriff Habibullah",
                "href": "/profile/Umar-Sheriff-Habibullah"
            },
            "answer_text": "Why don’t you thank GOD today for all your blessings and for the gift of life ………… for another beautiful day. BE GRATEFUL · The Qualifications that gave you a job are the same qualifications some one has, but doesn’t have a job ……………………………………………  Picture by -Redirect Notice  BE GRATEFUL · The Prayer God answered for you, is the same prayer others have been saying without success yet ………………………………………..  Picture by -Redirect Notice BE GRATEFUL · The Road you use safely on the daily basis is the same road many others died on ………………………….  Picture by -Redirect Notice BE GRATEFUL · The place you worship and God blessed you, is the same place other people worship in their lives are still in shambles ……………………………………..  Picture by -Redirect Notice BE GRATEFUL · The bed you used in the hospital, got healed and discharged, as the same bed many other people died on……………………………………..  Picture by - Redirect Notice BE GRATEFUL · Remember!!!!!!!!!!!!!! He is the “Giver of everything you have”  Picture by -Redirect Notice BE GRATEFUL ***************BEAUTIFUL MESSAGE ************************* A rich man looking through his window and saw a poor man picking something from his dustbin …… He said, Thank GOD I am not poor.  Picture by -Redirect Notice The Poor man looked around and saw a naked man mis behaving on the street…………….. He said, Thank GOD I’m not mad. The mad man looked ahead and saw an ambulance carrying a patient……………. He said , Thank GOD I’m not sick…………….  Picture by -Redirect Notice Then a sick person in hospital saw a trolley taking a dead body to the mortuary …………. He said Thank GOD I’m not dead…………………..  Picture by -Redirect Notice Only dead person cannot Thank God…. Why don’t you thank GOD today for all your blessings and for the gift of life ………… for another beautiful day. **************What is LIFE *************************** To understand LIFE better, you have to go to 3 locations. *1. Hospitals * 2. Prison *3. Cemetery At the hospital, you will understand that nothing is more beautiful than HEALTH. In Prison, you will see the FREEDOM is the most precious thing. At the cemetery you will realize that LIFE is precious. The ground we walk today will be our roof tomorrow.  Picture by - Redirect Notice,Redirect Notice Cemetry Images, Stock Photos & Vectors Sad Truth: We all come with * Nothing * and we will go with * Nothing * …………… Let us therefore remain humble and thankful and grateful to God at all times for everything. As i received this good message of love and Hope. Kindly spread this message for the Peace and prosperity !!!!!!!!!!!!!!!!! Thanks and share your comments !!!!!!!! ",
            "date": "Answered May 15, 2020",
            "views": "483",
            "upvotes": " View 2 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Vedha V",
                    "user_href": "/profile/Vedha-V"
                },
                {
                    "user_id": "Asmart Hansel Kloslov",
                    "user_href": "/profile/Asmart-Hansel-Kloslov"
                }
            ]
        },
        {
            "author_info": {
                "name": "Virendra Vasava",
                "href": "/profile/Virendra-Vasava-3"
            },
            "answer_text": "One is thankful to other because some good deed is done by him for one . One could not be thankful until and unless one don't know glory and power of God ! Our holy scriptures narrating virtues of supreme God who created whole nature ! Like in ancient scripture Vedas Glory of supreme God is narrated that he- God take 3 type of forms to take care and nourish whole souls living in 3 places. i.e. mortal place - Lok of Brahm & Par Brahm and eternal place - lok of Purna Brahm. Actually we all souls who are living in different form of creatures here , were living in eternal place of Purna Brahm . We had been trapped here i.e. into lok of Brahm and forgot about real home - eternal place. Father - supreme God of all souls comes to us for giving knowledge of himself, his eternal place and to give right way of worship to achieve his eternal place !! Because we left father's home by our silly mistake but father didn't forget his children !! In holy Bible chapter Genesis , it is mentioned that how god has created whole world in six days ☺️In Quran knowledge giver of quran tells to paigambar that trust that God who is immortal !! Thus, one could be thankful to God who created us and whole nature ! ",
            "date": "Answered December 18, 2018",
            "views": "569",
            "upvotes": " View 27 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Virendra Vasava",
                    "user_href": "/profile/Virendra-Vasava-5"
                },
                {
                    "user_id": "Manju Dhanik",
                    "user_href": "/profile/Manju-Dhanik"
                },
                {
                    "user_id": "Kushal Suman",
                    "user_href": "/profile/Kushal-Suman-2"
                },
                {
                    "user_id": "Vilas Vasava",
                    "user_href": "/profile/Vilas-Vasava-3"
                },
                {
                    "user_id": "Deepika",
                    "user_href": "/profile/Deepika-565"
                },
                {
                    "user_id": "Kailash Bhati",
                    "user_href": "/profile/Kailash-Bhati-13"
                },
                {
                    "user_id": "Raghvendra Singh",
                    "user_href": "/profile/Raghvendra-Singh-277"
                },
                {
                    "user_id": "Bharat Mandloi",
                    "user_href": "/profile/Bharat-Mandloi-3"
                },
                {
                    "user_id": "Aman Mandloi",
                    "user_href": "/profile/Aman-Mandloi-5"
                },
                {
                    "user_id": "Deepak Jyotishi",
                    "user_href": "/profile/Deepak-Jyotishi-1"
                }
            ]
        }
    ]
}