{
    "title": "Why are author's writings not affected by the environment they live in? - Quora",
    "tags": [
        "Environmental Science",
        "Environmentalism",
        "Creative Writing",
        "The Environment",
        "Writers and Authors",
        "Literature",
        "Writing Advice",
        "Writing",
        "Books"
    ],
    "response": [
        {
            "author_info": {
                "name": "Sam Moss",
                "href": "/profile/Sam-Moss-8"
            },
            "answer_text": "‘Why are author's writings not affected by the environment they live in?’ This is an interesting—and somewhat strange, if I’m being honest—way to word this question. Perhaps it was asked in response from a quote OP read or heard? Ultimately, as it is impossible to show how something is not affected by something else, there is no valid answer to the question as stated though the corollary (‘Why are an author’s writings affected by the environment they live in?) can be answered, and in this way some light can be shed on the question as asked. I would say that, like most things, the degree to which an author’s environment influences their writing, can vary on a spectrum, from ‘quite a lot’, to ‘not very much’. Some of this influence is going to be within the writer’s control (a writer can choose, of course what topic they will writing about, and some writers specifically write with their environment in mind) while other aspects (things like language, culture and upbringing) are going to be harder, or impossible to reduce or eliminate. Some writers are known for taking great measures to reduce or eliminate the role of their environment, some going as far as locking themselves in windowless rooms for long periods of time in order to write. While this cannot absolutely eliminate the effect of their environment, it can probably allow the writer’s imagination to take precedence over most environmental factors. At the end of the day there is a good argument that no writer is able to totally remove their environment from their writing, though the effect might be so small as to be functionally invisible to all but the most astute reader. Simply ‘being human’ can be considered an environmental factor which colors all (human) writer’s work. There are those who would argue (rightly I would suggest) that being abled, one’s race, gender, upbringing and so are environmental factors that color one writing, but which so many of us hold in common as to be simply ignored in most cases. ",
            "date": "Answered October 21, 2020",
            "views": "31",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Shana Chen",
                    "user_href": "/profile/Shana-Chen-3"
                }
            ]
        }
    ]
}