{
    "title": "Why do people like Hunter x Hunter? - Quora",
    "tags": [
        "Hunter X Hunter (manga series)",
        "Manga"
    ],
    "response": [
        {
            "author_info": {
                "name": "Sarthak Sharma",
                "href": "/profile/Sarthak-Sharma-53"
            },
            "answer_text": "I love Hunter X Hunter for a lot of reasons. The anime (2011) version is on point, all the details are intricate, no extra shiny faces, no dumb CGI, everything's great. The storyline is awesome, it's engaging from the first episode itself. It feels like a happy-happy anime initially but oh boy is it a dark piece. The arcs are really different and interesting be it the Hunter Exam Arc, Greed Island Arc or the Chimera Ants Arc, they all brought something different to the table and you never had loss of content, plot and action. I love how they combined these different parts and made a big picture out of it, it really is awesome. Hunter X Hunter is for all age groups and you don't have to lower your I.Q. to enjoy the show unlike some anime which are catered to specific age groups only. It is warming, depressing, bright and dark at the same time. And true friendship is what we learn through this legend. Gon and Killua both faced difficulties together, improving together, helping each other in the most troublesome moments. They didn't leave each other to gain an upper hand over the other instead they did what true friends do, they sticked together.  Logic is a great part of this show. Meruem was extremely powerful but he too couldn't beat the radioactive poisoning and he died from it, no character suddenly increased his power level to beat him up, fan service is not the priority here. Netero did detonate the bomb but he didn't simply yell and beat him up, he self destructed and Meruem was revived but he couldn't beat the poisoning. Logic is strong. Gon too sacrificed all his energy to be able to beat Neferpitou, he did not get that level for free. Kurapika had sorted out the intricate details to help him beat his opponents, each finger with a different power and that too really intelligently chosen. Everything was planned out in the show, characters, their powers, their weaknesses, plot, everything. The background music was fantastically synchronized with the scenes. I got goosebumps while watching some scenes because the music made it stand more. Phantom troupe was not your clichéd villain family, Zoldyks were as extraordinary as their mansion, characters had not-so-normal weapons (Gon had a fishing rod for God's sake) and we have daddy issues (Ging Freecs).  Hunter X Hunter has everything you will ever find in an anime, cool fights, intelligent scenes, different perverted stuff (I'm looking at you Hisoka), strong yet well developed characters, awesome music and animation.  ",
            "date": "Updated November 12, 2017",
            "views": "35",
            "upvotes": " View 29 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Nikita Carlo",
                    "user_href": "/profile/Nikita-Carlo-1"
                },
                {
                    "user_id": "Amy Sara",
                    "user_href": "/profile/Amy-Sara-15"
                },
                {
                    "user_id": "Malika Dupont",
                    "user_href": "/profile/Malika-Dupont"
                },
                {
                    "user_id": "Sanket Prasad",
                    "user_href": "/profile/Sanket-Prasad-5"
                },
                {
                    "user_id": "Akhil",
                    "user_href": "/profile/Akhil-159"
                },
                {
                    "user_id": "Feodora Humaira",
                    "user_href": "/profile/Feodora-Humaira"
                },
                {
                    "user_id": "Cheyenne Anderson",
                    "user_href": "/profile/Cheyenne-Anderson-71"
                },
                {
                    "user_id": "Ap Radd",
                    "user_href": "/profile/Ap-Radd"
                },
                {
                    "user_id": "D. Gaara Kurosaki",
                    "user_href": "/profile/D-Gaara-Kurosaki"
                },
                {
                    "user_id": "Marie-Anne",
                    "user_href": "/profile/Marie-Anne-117"
                }
            ]
        }
    ]
}