{
    "title": "Why am I jealous of other people's success? - Quora",
    "tags": [
        "Success",
        "Emotional Advice",
        "Successful People",
        "Jealousy and Envy",
        "Understanding Emotions",
        "Emotions"
    ],
    "response": [
        {
            "author_info": {
                "name": "Tanya Manglik",
                "href": "/profile/Tanya-Manglik"
            },
            "answer_text": "I understand your predicament. One can often feel jealous every time we see someone do something that we feel we could've done but didn't. Guess what? You're only human. It's natural, and sometimes even healthy to feel so. What isn't healthy is to let these feelings of envy get to you in such a way that it occupies your mind and leaves you feeling negative and bitter.  So here's the least you can do to get rid of these feelings:  1. Focus on yourself. I can understand that you really wanted that internship at Amazon, but try somewhere else, or try again. The door is always there, it's up to us to open it and go places.  2. Reflect, Reorganise, Reprioritise. I'm sure it'll help, sometimes we just need to resettle and get back on track.  3. Don't let the jealous and envious thoughts and feelings cloud your judgment of a person. You're very likely to say and think negative stuff about a person you're jealous of in order to make yourself feel better or as a defence mechanism.The bitter thoughts and feelings won't aid your cause in any way. Accept and move on. Wish you all the best! ",
            "date": "Answered January 15, 2016",
            "views": "52",
            "upvotes": " View 18 Upvoters",
            "upvoters": [
                {
                    "user_id": "Maurício Schuster",
                    "user_href": "/profile/Maurício-Schuster"
                },
                {
                    "user_id": "George Anton",
                    "user_href": "/profile/George-Anton-14"
                },
                {
                    "user_id": "Vegeta Prince",
                    "user_href": "/profile/Vegeta-Prince-19"
                },
                {
                    "user_id": "Maria Pintea",
                    "user_href": "/profile/Maria-Pintea-3"
                },
                {
                    "user_id": "Saniya Baig",
                    "user_href": "/profile/Saniya-Baig-12"
                },
                {
                    "user_id": "Mercy Wambaire",
                    "user_href": "/profile/Mercy-Wambaire"
                },
                {
                    "user_id": "An Tran",
                    "user_href": "/profile/An-Tran-274"
                },
                {
                    "user_id": "Abhiman Singh Rathore",
                    "user_href": "/profile/Abhiman-Singh-Rathore"
                },
                {
                    "user_id": "Rudranil Ghosh",
                    "user_href": "/profile/Rudranil-Ghosh-4"
                },
                {
                    "user_id": "Anyango Otieno",
                    "user_href": "/profile/Anyango-Otieno-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Manohar Hosmani",
                "href": "/profile/Manohar-Hosmani"
            },
            "answer_text": "Just recently my friend tagged me in some picture. It said \" People like it when others succeed but they don't want you to be more successful than themselves\"I just loved this one! Its true! Not everyone will accept that but come on we are in the college to get a good life and achieve something.... Jealousy is normal. What makes you a good human being is that you know that you feel jealous and that its not really a good thing... Chill bro... And if you can't get that thing out of your mind then just read the answer given by 'Farid Ahsan' \"India: I am a 4th-year, 5-pointer student at IIT Kanpur. I am totally demoralized for the upcoming placement session. Is there any chance for me?\" Amazing stuff man! Calm down and enjoy man! You just have one more year to go.... ",
            "date": "Answered September 5, 2014",
            "views": "28",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Teach Reader",
                    "user_href": "/profile/Teach-Reader"
                }
            ]
        }
    ]
}