{
    "title": "Why is it important to understand accounting? - Quora",
    "tags": [
        "Understanding and Comprehension"
    ],
    "response": [
        {
            "author_info": {
                "name": "Peter Baskerville",
                "href": "/profile/Peter-Baskerville"
            },
            "answer_text": "To save you from making poor financial decisions. A key purpose of accounting is to communicate to relevant stakeholders, up-to-date information about the financial performance and position of a business, so as to help them make informed decisions about the resources under their control.  But accounting uses it's own language to communicate this information and to someone who doesn't understand the language, the message is lost. If you don't understand concepts like assets, liabilities, expenses, revenue, equity, payables, receivables, creditors, debtors, gross profit, cost of goods sold, accruals, liquidity, cashflow, net assets, retained earnings, goodwill, amortisation, depreciation ... what chance have you or any stakeholder got of understanding the components that communicate the financial performance and position of a business. If stakeholders, like owners, managers, staff, suppliers, investors, funders and customers don't understand what many people in business call 'the language of business', then they would be 'flying blind' when making decisions and are more than likely to make poor ones.    ",
            "date": "Answered January 19, 2016",
            "views": "41",
            "upvotes": " View 15 Upvoters",
            "upvoters": [
                {
                    "user_id": "Olayiwola Theophilus",
                    "user_href": "/profile/Olayiwola-Theophilus-1"
                },
                {
                    "user_id": "Africa Trending",
                    "user_href": "/profile/Africa-Trending"
                },
                {
                    "user_id": "Arthur W. Stockham",
                    "user_href": "/profile/Arthur-W-Stockham"
                },
                {
                    "user_id": "Matteo Galullo",
                    "user_href": "/profile/Matteo-Galullo"
                },
                {
                    "user_id": "Ektha Singh",
                    "user_href": "/profile/Ektha-Singh"
                },
                {
                    "user_id": "Barbara McKinzie",
                    "user_href": "/profile/Barbara-McKinzie"
                },
                {
                    "user_id": "Peggy Zhao",
                    "user_href": "/profile/Peggy-Zhao-2"
                },
                {
                    "user_id": "Jesse Stewart",
                    "user_href": "/profile/Jesse-Stewart-1"
                },
                {
                    "user_id": "Robert Foenix",
                    "user_href": "/profile/Robert-Foenix"
                },
                {
                    "user_id": "Lokesh Yadav",
                    "user_href": "/profile/Lokesh-Yadav-36"
                }
            ]
        },
        {
            "author_info": {
                "name": "David Smith",
                "href": "/profile/David-Smith-5944"
            },
            "answer_text": "Accounting is essential if you want to improve your business in such a way so that it can be measured and predicted as well. Having a system of tracking business' assets, liabilities, and income lets you take smart and informed business decisions based on the previous performances along with present financial health of your enterprise. With a clear and organized accounting system, you can not only analyze your company’s financial data but also help it advance more. Sound accounting helps you to satisfy your customer’s needs and demands. Knowing clearly the financial status of your company in terms of income and expenses will help you better understand what you need to do in the future for maintaining the level of customer satisfaction as well as improve your business. However accounting also employs in managing payroll records, track loan and interest repayments, maintain a budget, and most importantly set you up with the financial data that you require when it’s time to file and pay company’s taxes. Visit to know more: Accounting Services for Small Business and Startups ",
            "date": "Answered March 13, 2020",
            "views": "314",
            "upvotes": "0"
        }
    ]
}