{
    "title": "Why do writers send hard copies of their manuscript to publishers? Wouldn’t it be easier to always email the manuscript or mail in a flash drive with the manuscript on it? - Quora",
    "tags": [
        "Breaking in as a New Author or Novelist",
        "Manuscripts",
        "Publishers",
        "Book Publishing",
        "Publishing",
        "Novels",
        "Writers and Authors",
        "Writing"
    ],
    "response": [
        {
            "author_info": {
                "name": "Judy Gill",
                "href": "/profile/Judy-Gill-2"
            },
            "answer_text": "Formerly, in the Dark Ages, publishers required 2 copies of a (contracted) manuscript. Publishing house didn’t have copier or the staff to create such copies—or so we were supposed to thing—so writers were expteted to pay the shipping for twice the weight. Because I was an impecunious writer, even after I had a contract, I only shipped one copy of that ms. No one ever demanded I send two, so I got away with it. Now, most publishing house have editors who can not only read digital material, but can edit it, so the demand for printed paper has dwindled. I do feel sorry for the producers of paper (especially since my husband helped produce it), but I’m am much happier sending only online material. If you have a publisher who asks for hardcopy or a flashdrive with the material on it, I am wonder what decade they are in. I would willingly send either, but only if a contract was likely. ",
            "date": "Answered November 21, 2019",
            "views": "498",
            "upvotes": " View 3 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Thomas Dalton",
                    "user_href": "/profile/Thomas-Dalton-1"
                },
                {
                    "user_id": "John Knight",
                    "user_href": "/profile/John-Knight-19"
                },
                {
                    "user_id": "Ilgaz Er",
                    "user_href": "/profile/Ilgaz-Er"
                }
            ]
        },
        {
            "author_info": {
                "name": "Joe Biel",
                "href": "/profile/Joe-Biel"
            },
            "answer_text": "When you read on paper, the chances of success are much higher. People often have this absurd notion that editors are looking for any reason to turn something down. Obviously, an editor wants to accept every submission until they find a reason that they cannot. I’ve been a publisher for 24 years and logistics aside, the biggest reason for paper MS is that your brain actually engages with the materials and you read the book as you would if it was a book that you purchased and enjoyed. When you read on screen, the information doesn’t sink into the brain. It gets stuck at the amygdala and your brain shouts “NO! NO! NO!” back at it. This is why you’ll hear acquisition editors talking about how they turned something down for what sounds like a completely trivial and ridiculous reason. Similarly, it’s grown much easier for me to spend a day where I just look at physical submissions rather than trying to reset my brain several times per day and processing that information. My cognitive load and capacity are both much too high to give something considered thought. ",
            "date": "Answered February 14, 2020",
            "views": "241",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Maryanne Slater",
                    "user_href": "/profile/Maryanne-Slater"
                }
            ]
        }
    ]
}