{
    "title": "Why is it important to know an author's background? - Quora",
    "tags": [
        "Backgrounds"
    ],
    "response": [
        {
            "author_info": {
                "name": "Ameesha Smith-Green",
                "href": "/profile/Ameesha-Smith-Green"
            },
            "answer_text": "In fiction, it’s often not important to know the author’s background. What matters is generally the book—how well it’s written, how interesting the story is, how believable the characters are, and so on. That said, knowing an author’s background can make you better appreciate what they overcame to create such works of art. For example, the Brontë sisters writing epic tragic love stories when they never experienced love themselves, and having to use male pseudonyms to get published. Or J.K. Rowling being a flat-broke single parent when she hand-typed each copy of Harry Potter on typewriter to submit to publishers. In nonfiction, the author’s background is often vital because it adds credibility and weight to what they are saying. The author needs to be knowledgeable in the field they’re writing about, either through their studies or personal experience. Would we trust Daniel Kahneman’s arguments about the mind if he wasn’t a psychologist? Would we listen to a self-help guru who has never overcome any problems? It also helps us to determine possible bias, because an author’s background and culture may determine their perspectives on things. An author who has experienced the benefits of society may argue a more favourable view of the world than one who has experienced prejudice or abuse. Depending on an author’s background, they might cite studies that favour their own viewpoint and fail to offer a balanced view. Thus, knowing their background enables us to contextualise better. Of course, there are always exceptions to this rule. For example, I’ve worked with a few philosophy authors who had neither studied philosophy formally nor worked in the field, but who had thought about and observed the world sufficiently to offer something valuable. More often than not though, a nonfiction book is a product of the author’s background. ",
            "date": "Answered September 21, 2020",
            "views": "26",
            "upvotes": " View 7 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Aura Pamela Gabejan",
                    "user_href": "/profile/Aura-Pamela-Gabejan"
                },
                {
                    "user_id": "Dan Vincent-Schaub",
                    "user_href": "/profile/Dan-Vincent-Schaub"
                },
                {
                    "user_id": "Don Eamon",
                    "user_href": "/profile/Don-Eamon"
                },
                {
                    "user_id": "Michaela McGraves",
                    "user_href": "/profile/Michaela-McGraves"
                },
                {
                    "user_id": "Zallee Pepper",
                    "user_href": "/profile/Zallee-Pepper"
                },
                {
                    "user_id": "Lacey White",
                    "user_href": "/profile/Lacey-White-36"
                },
                {
                    "user_id": "Nelson Vidinha",
                    "user_href": "/profile/Nelson-Vidinha"
                }
            ]
        },
        {
            "author_info": {
                "name": "Lorraine Cobcroft",
                "href": "/profile/Lorraine-Cobcroft"
            },
            "answer_text": "It isn’t, in many cases, important to know anything about an author’s background. If an author produces works of fiction that you enjoy reading, why should their background matter? It might be interesting, but it’s not important to know about. On the other hand, if the author is arguing a specific premise, writing a factual account of history, or writing instructional or informational material, you will need to know a little about their background to determine if they how qualified they are to write as they do and whether or not the information they present is reliable. Fiction writers often use their fiction to argue for specific beliefs or ideologies. A historical fiction writer may write fiction, but the historical setting and events should be accurately presented. A fiction story will often be set in a real location, present against a background of scientific or legal research or actions, or expose a particular culture. In cases like that, you may need to know a little of the author’s background and research to determine whether they are qualified to write that kind of story. Don’t be too quick to judge, though. Unique personal experience might qualify someone to write a story that they may not appear well qualified to write based on their general background. For example, someone who experienced injustice first hand might be well qualified to write a legal saga that exposes injustice, while someone with a background in law might write from an entirely different perspective, endorsing the system they serve. Often, a particular version of history is presented and broadly accepted for political or economic purposes, but someone who was present at the time may take an entirely different view, and their view may be equally or more accurate. ",
            "date": "Answered December 15, 2019",
            "views": "31",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Lacey White",
                    "user_href": "/profile/Lacey-White-36"
                },
                {
                    "user_id": "Tanya Bartlett",
                    "user_href": "/profile/Tanya-Bartlett-16"
                },
                {
                    "user_id": "Alqace Bellator",
                    "user_href": "/profile/Alqace-Bellator"
                },
                {
                    "user_id": "Nelson Vidinha",
                    "user_href": "/profile/Nelson-Vidinha"
                }
            ]
        }
    ]
}