{
    "title": "Why do most of the schools allow students to use blue or black-inked pens only? - Quora",
    "tags": [
        "Pens"
    ],
    "response": [
        {
            "author_info": {
                "name": "Miguel Zapata",
                "href": "/profile/Miguel-Zapata-4"
            },
            "answer_text": "It’s uniform. When reading through tons of material, uniformity takes away from the distraction of a rainbow-coloured pile of mostly mediocre work.They have good contrast against white, cream, yellow, brown and newsprint grey. Other colored inks don’t fare as well, especially with inks like green and pink.They scan and photocopy really well, partly because of the aforementioned contrast, and partly because scanners and photocopiers are tuned to refine and sharpen black and blue texts.Imposing black and blue inks to students will let teachers use other colors to annotate the work, making their writing easy to distinguish from the students’ texts. It also looks cleaner this way.They’re pretty popular ink colors for daily writing, so they are less expensive and available everywhere.Tradition - black ink and pigments have always been a popular writing color because of the ease of getting black pigments (which are basically burnt stuff) in huge quantities back in the day.",
            "date": "Answered December 18, 2017",
            "views": "15",
            "upvotes": " View 6 Upvoters",
            "upvoters": [
                {
                    "user_id": "Bhavana Cheruku",
                    "user_href": "/profile/Bhavana-Cheruku"
                },
                {
                    "user_id": "Kayra Pao",
                    "user_href": "/profile/Kayra-Pao-1"
                },
                {
                    "user_id": "Rob Dempwolf",
                    "user_href": "/profile/Rob-Dempwolf"
                },
                {
                    "user_id": "Sapna Ullal",
                    "user_href": "/profile/Sapna-Ullal"
                },
                {
                    "user_id": "Nurullah Mallik",
                    "user_href": "/profile/Nurullah-Mallik"
                },
                {
                    "user_id": "Akshat Mehta",
                    "user_href": "/profile/Akshat-Mehta-19"
                }
            ]
        },
        {
            "author_info": {
                "name": "Paul Goffin",
                "href": "/profile/Paul-Goffin"
            },
            "answer_text": "In England, it's common in Primary schools for pupils to write in Blue, Teachers to mark in Green, then for pupils to reply to the marking with their Purple Pen of Progress (I am not making this up) and for teachers to mark the response to the marking in a fourth colour (that must not be red). They do this because headteachers believe it is required by England's education regulator, Ofsted. It is not required, Ofsted even have this stated on their website, but thousands of teachers are forced to do it anyway. ",
            "date": "Answered December 16, 2017",
            "views": "19",
            "upvotes": " View 8 Upvoters",
            "upvoters": [
                {
                    "user_id": "Jonathan Oei",
                    "user_href": "/profile/Jonathan-Oei-2"
                },
                {
                    "user_id": "Michelle Zhong",
                    "user_href": "/profile/Michelle-Zhong-2"
                },
                {
                    "user_id": "Alicia Woo",
                    "user_href": "/profile/Alicia-Woo-2"
                },
                {
                    "user_id": "RAJEEV RANJAN",
                    "user_href": "/profile/RAJEEV-RANJAN-1595"
                },
                {
                    "user_id": "Elizabeth Ryder",
                    "user_href": "/profile/Elizabeth-Ryder-2"
                },
                {
                    "user_id": "Shinjinee Sen",
                    "user_href": "/profile/Shinjinee-Sen-1"
                },
                {
                    "user_id": "Geoff Redfern",
                    "user_href": "/profile/Geoff-Redfern"
                },
                {
                    "user_id": "Gill Bullen",
                    "user_href": "/profile/Gill-Bullen"
                }
            ]
        }
    ]
}