{
    "title": "Why are the mont blanc pens so costly? - Quora",
    "tags": [
        "Montblanc (company)"
    ],
    "response": [
        {
            "author_info": {
                "name": "Georgette Wolf",
                "href": "/profile/Georgette-Wolf"
            },
            "answer_text": "What’s special about Montblanc pens is the way that they are marketed. They are owned by the same luxury goods company that owns Cartier and Dunhill: Compagnie Financière Richemont SA from Switzerland. They specialize in doing things to make their products look “luxurious.” That includes only allowing a select few stores to sell their merchandise: they prefer to sell everything in their own stores whenever they can. Their “goods” are a lot of different luxury products besides pens. There are or have been Montblanc watches, purses, diaries and more. That’s not to say either that all of their products are overpriced or that they exclusively sell luxury goods. In Germany, they are simply another pen company. Dealing with them when I was in retailing was frustrating. They signed contracts with the company I worked for that allowed them to put their merchandise wherever they wanted in the store. I discovered one day that their merchandiser had placed their stuff in the store’s most prominent display case — and left the merchandise that had been in there before on the floor! I was so furious that I re-arranged everything back to the way it was. That displeased their rep! At any rate, Montblanc has two different kinds of customers; regular pen store customers who include collectors, fountain pen lovers and gift-givers; and what can only be described “riche” customers who are into conspicuous consumption. They tend not to know much about pens, but are certain that only a Montblanc is worth considering for purchase. I feel ambivalent. Getting a Montblanc customer always made for a good day in a small pen shop. On the other hand, I knew there were many times that they would have been comfortable with another brand. ",
            "date": "Answered April 17, 2020",
            "views": "315",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Sudhath Jain",
                    "user_href": "/profile/Sudhath-Jain"
                },
                {
                    "user_id": "Jim Rahn",
                    "user_href": "/profile/Jim-Rahn"
                },
                {
                    "user_id": "Mac McGarry",
                    "user_href": "/profile/Mac-McGarry-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Mark Gershenson",
                "href": "/profile/Mark-Gershenson-1"
            },
            "answer_text": "Because people will pay the asking price. Yes, they are well-made, but there are equally well-made pens from other companies at lower prices. Mont Blanc pens have become status symbols, and some people just have to have them. I had a Mont Blance ballpoint pen a few decades ago and got tired of it. The refills were expensive and tended to leave blobs of ink on the paper. I eventually sold the pen. If you wan to impress people you probably don’t like or care about (with apologies to Dave Ramsey), buy a Mont Blanc. Otherwise, educate yourself about various pen brands and pen types (i.e., ballpoint, fountain, gel, etc.) and then buy one or more reasonably- priced pens that suit your needs and writing styles. ",
            "date": "Answered November 2, 2017",
            "views": "25",
            "upvotes": " View 5 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Satyam Saboo",
                    "user_href": "/profile/Satyam-Saboo-1"
                },
                {
                    "user_id": "Luna Fowler",
                    "user_href": "/profile/Luna-Fowler-1"
                },
                {
                    "user_id": "Dean CSWCD",
                    "user_href": "/profile/Dean-CSWCD"
                },
                {
                    "user_id": "Ashiv Hans Dhondea",
                    "user_href": "/profile/Ashiv-Hans-Dhondea"
                },
                {
                    "user_id": "Jeff Muscato",
                    "user_href": "/profile/Jeff-Muscato"
                }
            ]
        }
    ]
}