{
    "title": "Why do people have to get so weird when they “make” fan fiction? - Quora",
    "tags": [
        "Fanfiction",
        "Fiction Writing",
        "Fiction",
        "Writing",
        "Books"
    ],
    "response": [
        {
            "author_info": {
                "name": "Lily Potter",
                "href": "/profile/Lily-Potter-63"
            },
            "answer_text": "As a fan fiction writer, this question bugs me a little bit. But let’s delve into the question without emotions, shall we? There are some weird people out there, ‘kay? They get annoyed that writers kept a show, book, or movie within parameters and have a certain vision of how the story should have gone (at least in their brains). And since they’re so weird, yeah, that makes it into things. I mean, there are some weird books out there (read: Stephen King novels), but the thing is, fan fiction doesn’t have filters on it from publishers, so all of the weird books that never get published? Yeah, well, you can publish them online because who’s going to stop you?Fanfiction can be a lot of “self insert” which always ends up weird because fan fiction authors sometimes get horny and sometimes for the characters, which is gross, but yeah, that’s why.Fanfiction is often wish fulfillment for shipping, which goes right back up to point number one.If by weird you also mean “full of levels of violence and trauma not in the original storyline” that’s a whole different level. Sometimes authors have gone through some serious stuff, and writing that fan fiction is a way of coping. It’s therapeutic for them. I’ve talked to an author like this, and she was an excellent writer and a great person, but she had PTSD and anxiety and whatnot, and that worked its way into her writing; nothing wrong with it, but the end result is something that you would never find in the show’s canon.Not everyone gets weird. As before stated, I write fanfiction, and while it’s generally a little more violent or the language style a little different than the original story, it otherwise stays within the lines established by the original stories- i.e. if I’m writing for what was originally a children’s show (Avatar, both last Airbender and legend of Korra, Voltron, the Dragon Prince, etc), I don’t put certain adult themes (rape, sex, etc) into the fiction (although I have been guilty of putting other more adult themes that are also relatable to the age [generally Tweens and teenagers, with a smattering of younger kids] watching the show into the fiction, such as suicidal thoughts). And I’ve read some really good fan fiction that isn’t, quote and quote, “weird”. The problem is finding those fan fictions, which is hard on wattpad or fan fiction.net. A good site for finding nice, not weird fan fiction is archiveofourown.org, where you can filter your searches and actually blacklist certain tags or ratings. For instance, if you don’t want to read anything with, idk, fursonas, you can alter your search to exclude anything tagged with “fursona”.In conclusion, there are sickos out there writing fanfiction, but don’t judge all fan fiction based on the weird ones! ",
            "date": "Answered February 6, 2019",
            "views": "970",
            "upvotes": " View 7 Upvoters",
            "upvoters": [
                {
                    "user_id": "Kenz Huynh",
                    "user_href": "/profile/Kenz-Huynh"
                },
                {
                    "user_id": "Courtney Reed",
                    "user_href": "/profile/Courtney-Reed-117"
                },
                {
                    "user_id": "Jennifer Schilling",
                    "user_href": "/profile/Jennifer-Schilling-3"
                },
                {
                    "user_id": "Rachel Arrowsmith",
                    "user_href": "/profile/Rachel-Arrowsmith"
                },
                {
                    "user_id": "Misti Wolanski",
                    "user_href": "/profile/Misti-Wolanski"
                },
                {
                    "user_id": "Connor Thompson",
                    "user_href": "/profile/Connor-Thompson-13"
                },
                {
                    "user_id": "Cheryl Molla",
                    "user_href": "/profile/Cheryl-Molla"
                }
            ]
        },
        {
            "author_info": {
                "name": "Yayenia Thompson",
                "href": "/profile/Yayenia-Thompson"
            },
            "answer_text": "As an author, as in real author not a fan fiction ‘writer’, I have my theories. They become obsessed with a story, world, or character and fixate on their own sort of fantasy(ies) about them. This leads them to take that subject and run with it. They go full-on immersion and place a character into or around said subject and have them interact, but the character is just them in disguise. Sort of like a role-playing game, but instead of rolling dice and choosing outcomes, they’re choosing their own plot line and trying to vicariously live in it.They want to write, but don’t have enough creative independence to write their own stuff, so they shove their fingers into an already made pie and squish it up into something unrecognizable and frankly, unappetizing. It’s as if they don’t care about the original work or intentions to begin with, and just want to mutilate what is already there.They don’t like how the original story went, so they rewrite it how they want it to go. This often involves insulting the world-building, destroying character development, and divulging in disturbing and unrealistic ‘ships’…I’m looking at you Dramione and Snape/Hermione.They have the urge to do those things in real life, but confine and content themselves with hentai versions of the stories. The more explicit the rape, statutory rape, lesbian/gay/bi/trans/hermaphrodite, species crossover, potion/magic induced sex scenes there are, the better. The more gory the violence, physical, and emotion abuse, the better. Which, frankly, I would prefer they write it out rather than act on such things, but I also don’t want to read it, see it, hear it, or even know about it. (LGBTQ and so on sex is fine if that’s what you’re into, I’m talking about the rape, species crossover, rip your limbs off and use them on you, I’mma rape you but you’ll like it cuz magic stuff here.)Furries are weird to begin with and when they write their own fan fiction, they smear that weirdness into it. It’s also theft. Thieves are shady fringe people.Publishers, agents, and editors don’t want to deal with weird fringe writing. There are guidelines for a reason, and many of them don’t want to read slush. There are markets to take into consideration, and demographics to think about. Most people aren’t going to buy what fan fiction is. They’ll happily read it for free, or pay a buck or two, but $11.99 and up? Nah. So publishers aren’t interested, because they can’t make money off it. The closest you’re going to find is the smut section of romance, and even they sell for around a dollar or less anymore. So, fan fiction scribblers self publish on free sites and there are no boundaries. They can be as vulgar, explicit, or trashy as they want. They can have little to no skill with the written language, and it doesn’t matter. They can steal, rip-off, insult, and mutilate original work and other fan fiction people lap it up. There are literally NO boundaries, and they use that to full effect.When I find out about fan fiction of my stories, I shut it down. I created those things, I live with them and have for decades, they are mine and mine alone. I share the stories, not the control. I don’t find it flattering. I don’t find it amusing. I find it lazy thievery. If someone wants to write, then they should do their own work. Create their own characters, worlds, societies, and plots. Don’t get weird with mine. ",
            "date": "Answered February 7, 2019",
            "views": "640",
            "upvotes": " View 4 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Kenz Huynh",
                    "user_href": "/profile/Kenz-Huynh"
                },
                {
                    "user_id": "Bob Satori",
                    "user_href": "/profile/Bob-Satori"
                },
                {
                    "user_id": "Sushrut",
                    "user_href": "/profile/Sushrut-3"
                },
                {
                    "user_id": "Connor Thompson",
                    "user_href": "/profile/Connor-Thompson-13"
                }
            ]
        }
    ]
}