{
    "title": "Why is it important to study 'media'? - Quora",
    "tags": [
        "Importance of Media",
        "Media Studies",
        "Media",
        "Studying",
        "Social Media"
    ],
    "response": [
        {
            "author_info": {
                "name": "Dewayne Pruett-King",
                "href": "/profile/Dewayne-Pruett-King"
            },
            "answer_text": "Because truth be told, the Media holds a lot of power. Imagine the amount of careers, dropped simply due to the media fucking up. “Aziz Ansari, raped someone!” There. Career over. It doesn’t take that much to destroy a reputation. Seriously, how about this, Have you heard of the 1990s greatest defender, Alvin Robinson? He played for the San Antonio Spurs, and even the GOAT, Michael Jordan said, “He’s the toughest sum**** I’ve ever played against”. Of course you haven’t. Because Alvin Robinson, was reported to have been running a small-time human trafficking ring! It was ALL over the news, and ruined his repuation, so much so, that he’s been basically written out of history! In 2015, it was proven that the girl he met, lied about it. Entirely. There was NEVER any actual proof. That’s why the media is so powerful. Yeah, sure, it’s a justice fuck-up too, but just the implication that Average Celebrity A did X, means that it’s over for him/her. Or that politician A did Y, means he/she’s out of the party. It doesn’t matter if you did anything or not. Depending on who you are, you can be DESTROYED by the Media. I think High School students these days should be aware of tricks by the Media to make them believe a false narrative. Tell them to read into things, always search the source, and validate the claims, ect. Don’t be the person the Media wants you to be. I’m not that smart, and I understand it. ",
            "date": "Answered January 18, 2018",
            "views": "1",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Abdul Kamara",
                    "user_href": "/profile/Abdul-Kamara-16"
                }
            ]
        },
        {
            "author_info": {
                "name": "Miller Yuraszek",
                "href": "/profile/Miller-Yuraszek"
            },
            "answer_text": "I have studied ‘Media Studies’, but not to a high qualification. What I have found is that there is a lot of social studies that come with it, of which you can use the knowledge to help improve everyday lifestyle. You can get an understanding of how the public react to certain marketing campaigns which is great for a business aspect. Through knowing the teachings of ‘Media Studies’, allows organisations to predict how they can make positive impacts to the public with their marketing techniques. Many media techniques are used by large businesses to promote themselves. For example, when I was studying ’Media Studies’ a particular topic I found interesting was the ‘Influence of public figures’ and how it can manipulate the public. Many organisations use social media influencers to push our their products, even though the influencers may not be relevant to the product or use it themselves, they still lead the public to make these purchases. Why? All because someone ‘famous’ told you to? Yet if someone was to come up to you on the street and recommend a product you had never heard of, you probably wouldn’t show much interest. A book I found great to read if interested on the impacts of media is Marshall McLuhan’s ‘Understanding Media’. ",
            "date": "Answered October 30, 2019",
            "views": "512",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Fintan Galvin",
                    "user_href": "/profile/Fintan-Galvin"
                }
            ]
        }
    ]
}