{
    "title": "Why do I feel in disbelief that my life is how it is when I see pictures of who I was? - Quora",
    "tags": [
        "Suspension of Disbelief",
        "Photographs",
        "Understanding Emotions",
        "Emotions"
    ],
    "response": [
        {
            "author_info": {
                "name": "Elvin Tjia",
                "href": "/profile/Elvin-Tjia"
            },
            "answer_text": "Most people who thinks they had a better life than they have right now always thinks of that. This is because we feel that life i gradually becoming worse for us. Pictures of who we were reminded us of our past happiness and good memories. We humans have tendencies to compare our life with our past. If we feel that the our life is better when the photo were taken, we would feel disbelief. But if we think our life was worse when the photo was taken, you will very likely feel confident instead of disbelief. ",
            "date": "Answered July 17, 2018",
            "views": "44",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Alan Gaylor",
                "href": "/profile/Alan-Gaylor-1"
            },
            "answer_text": "William Hazlitt, an English philosopher, put forward the theory that we treat our future selves as “strangers” and do not recognise them as the same person we are now. For example, we will often do things in the present which harms our future self such as eat or drink to excess; spend recklessly, etc. I guess this is the same principle in reverse. Sometimes it feels like our past selves were strangers living a different life. ",
            "date": "Answered July 17, 2018",
            "views": "51",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Leslie Kirkpatrick",
                    "user_href": "/profile/Leslie-Kirkpatrick-1"
                },
                {
                    "user_id": "Ila Buckley",
                    "user_href": "/profile/Ila-Buckley"
                }
            ]
        }
    ]
}