{
    "title": "Why do I lose interest in people? - Quora",
    "tags": [
        "Interests (emotion)",
        "Understanding Human Behavior",
        "Human Behavior"
    ],
    "response": [
        {
            "author_info": {
                "name": "Navneet Kaur",
                "href": "/profile/Navneet-Kaur-430"
            },
            "answer_text": "Maybe you are not getting what really want from People like attention , attachment or infatuation .Maybe your expectations of your standards are not being fulfilled by others .Maybe you are tired of keeping expectations from others.Maybe you are too much passionate towards your career that you forgot to have interest in others.Maybe you are an introvert and lazy who don't initiate conversation because he is too lazy .Maybe you are tired of the society's judgements and thoughts about everything .Maybe you don't have your favourite interest or similar interests group people .Maybe you don't get the security to get attached and feel safe .Maybe you are too busy with your job .Maybe you are in depression which can make you lose interest in yourself too, what about people then ….Maybe you tired of putting efforts and getting into relationship .Maybe you search for happiness in other and if you lost interest in others , you lost interest in what makes you happy.Maybe you are so numb after getting hurt that you don't want anyone again and hence , loosing interest.Maybe you are lonely and in reverse order your mind wants you to be alone for your whole life and thinking that you don't need anyone which is not true but you can't have anyone , hence lost interest in others.——Nancy",
            "date": "Answered January 30, 2019",
            "views": "28",
            "upvotes": " View 16 Upvoters",
            "upvoters": [
                {
                    "user_id": "Unhappy Fate",
                    "user_href": "/profile/Unhappy-Fate"
                },
                {
                    "user_id": "Mandy .",
                    "user_href": "/profile/Mandy-294"
                },
                {
                    "user_id": "Ankit",
                    "user_href": "/profile/Ankit-1380"
                },
                {
                    "user_id": "Bryan Gonzalez",
                    "user_href": "/profile/Bryan-Gonzalez-20"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/YTGLITCH"
                },
                {
                    "user_id": "Monica Wagih",
                    "user_href": "/profile/Monica-Wagih"
                },
                {
                    "user_id": "Uswa Batool",
                    "user_href": "/profile/Uswa-Batool-2"
                },
                {
                    "user_id": "Tarik Saidj",
                    "user_href": "/profile/Tarik-Saidj"
                },
                {
                    "user_id": "Zoe Karran",
                    "user_href": "/profile/Zoe-Karran"
                },
                {
                    "user_id": "Ashwin E",
                    "user_href": "/profile/Ashwin-E-2"
                }
            ]
        },
        {
            "author_info": {
                "name": "Al Farook",
                "href": "/profile/Al-Farook-1"
            },
            "answer_text": "Sometimes it's not your fault — sometimes it's just how time passes or how people change. Sometimes it may be down to something you do, distancing yourself, or hurting the other person, which leads them to zone out of the relationship. But unless they give you a reason why, the important thing is to not be too rash if your partner looses interest. \"Regardless of the reason, what's important is that the person 'left behind' because their partner lost interest does not try and change themselves as a result,\" relationship coach and founder of Maze of Love, Chris Armstrong, tells Bustle. \"I once told a client 'if parts of you drew your partner away, maybe it's time to look within but don't make sudden changes over one person losing interest'.\" So if you feel like there's a pattern of people you're dating losing interest, maybe it's time to look inward, but remember that there are so many reasons things can happen. 1. It Was Lust, Not Love, After All Oops. You know how sometimes people warn you not to rush into anything because you can feel so intensely about someone but it wears off? Yup. That happens. Sometimes if they loose interest because, unfortunately, it was never really there in the first place. The lust fades and there's no foundation to back it up. It sucks, but it's true. \"The initial excitement and energy that their partner brought no longer exists. It can be common for people to put their best foot forward upfront, only to fall back to their natural self as the relationship progresses,\" Armstrong says. ",
            "date": "Answered May 7, 2017",
            "views": "17",
            "upvotes": "0"
        }
    ]
}