{
    "title": "Why is British Victorian literature still so popular? - Quora",
    "tags": [
        "British Literature",
        "Victorian Era (1837-1901 AD)",
        "English Literature",
        "Novels",
        "Literature"
    ],
    "response": [
        {
            "author_info": {
                "name": "William Smith",
                "href": "/profile/William-Smith-56"
            },
            "answer_text": "Certainly, the the United States at any rate, few people have a good sense of the full range of Victorian literature, but you will find that nearly any literate person likes some Victorian literature. The answer as to why is not difficult to find. If we confine ourselves to the reign of Queen Victoria, 1837–1901, we have nearly the entire 19th century, minus, in the Regency, Jane Austen and the Romantic poets and essayists. The remainder is vast, and incredibly varied; the great Victorian novelists, Trollope, Dickens, Thackeray, Eliot, Hardy, and Butler for starters (and Henry James if you wish to regard him as English), with great variety among them. There are the great Victorian poets like Browning, Tennyson, Rossetti, and Arnold. The tenor of the literature of the last few decades of the period is quite different from the middle of the century, with Stevenson, Wilde, and Swinburne. You have the revival of British opera with Gilbert and Sullivan. You have the beginnings of the great tradition of English detective fiction, from Wilkie Collins through Arthur Conan Doyle. You have essayists like John Henry Newman, Thomas Carlyle, and John Ruskin, whose importance in the history of art criticism is considerable. Most of it, moreover, is extremely enjoyable to read. I have long said that anyone who likes Austen and Dickens should read Trollope. It’s an extraordinarily rich period in English literature, comparable in my view to the 16th and 17th centuries. (Not that there is anything wrong with the 18th!) ",
            "date": "Answered April 27, 2019",
            "views": "807",
            "upvotes": " View 10 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Charlotte Louise",
                    "user_href": "/profile/Charlotte-Louise-232"
                },
                {
                    "user_id": "Anna Keller",
                    "user_href": "/profile/Anna-Keller-5"
                },
                {
                    "user_id": "Margery Caroline Whittle",
                    "user_href": "/profile/Margery-Caroline-Whittle"
                },
                {
                    "user_id": "Holly Root-Gutteridge",
                    "user_href": "/profile/Holly-Root-Gutteridge"
                },
                {
                    "user_id": "Eduardo Antunes Silva",
                    "user_href": "/profile/Eduardo-Antunes-Silva"
                },
                {
                    "user_id": "Christine Barr",
                    "user_href": "/profile/Christine-Barr-2"
                },
                {
                    "user_id": "Jason De Donno",
                    "user_href": "/profile/Jason-De-Donno"
                },
                {
                    "user_id": "Jonathon Parker",
                    "user_href": "/profile/Jonathon-Parker-1"
                },
                {
                    "user_id": "James Fogge",
                    "user_href": "/profile/James-Fogge"
                },
                {
                    "user_id": "Levi Faulkner",
                    "user_href": "/profile/Levi-Faulkner"
                }
            ]
        },
        {
            "author_info": {
                "name": "Ian Miller",
                "href": "/profile/Ian-Miller-49"
            },
            "answer_text": "For the same reason literature of any era is popular: because it’s connecting to audiences. All the pushes by teachers or television and movies won’t make something popular, though the lack thereof can definitely hinder them from being noticed. The British Victorian writers had perspectives and skills which are valuable, just as the British Augustans, the Romantics, or any country and period has. They wrote in English, which makes it easier for many people to read, and their society had a lot of the kind of violent transitions and technological upheavals that mark our own, which can provide a connection between audience and work (though not always - the 2008 adaptation of Little Dorrit, brilliant and beautiful as it was, didn’t connect super well with audiences despite the pretty direct link between Merdle and the collapse of 2008). I think a better question is: what do YOU like or dislike about British Victorian literature? ",
            "date": "Answered April 29, 2019",
            "views": "141",
            "upvotes": " Answer requested by Jonathon Parker"
        }
    ]
}