{
    "title": "Why there are so many programming languages? Can't we create one language to do everything? It would just be easier right? - Quora",
    "tags": [
        "Learning to Program"
    ],
    "response": [
        {
            "author_info": {
                "name": "David Vandevoorde",
                "href": "/profile/David-Vandevoorde"
            },
            "answer_text": "Randall Munroe has an oldie-but-goodie illustration of your idea:  Programming languages are invented for all kinds of reasons. Sometimes, they just try to tackle one specific problem as directly as possible. Sometimes they try to demonstrate a new approach to programming, or to computing. Sometimes they’re just toy projects. Sometimes, they’re aimed at keeping competitors from gaining too much mindshare. And sometimes they’re the result of people thinking that they can do something better than a variety of predecessors, with the vain hope that people working with those predecessors will be so impressed that they will switch over to the “new thing”. So far, it has rarely worked out though. Instead, those new ideas usually just fade, and otherwise they might end up being just “one more language” in the landscape of viable languages… ",
            "date": "Answered November 12, 2019",
            "views": "25",
            "upvotes": " View 97 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Bo Griffin",
                    "user_href": "/profile/Bo-Griffin-8"
                },
                {
                    "user_id": "Heather Crawford",
                    "user_href": "/profile/Heather-Crawford-15"
                },
                {
                    "user_id": "Owen Curran",
                    "user_href": "/profile/Owen-Curran-2"
                },
                {
                    "user_id": "Chathindu Nethmina",
                    "user_href": "/profile/Chathindu-Nethmina-2"
                },
                {
                    "user_id": "Jeremy Stafford",
                    "user_href": "/profile/Jeremy-Stafford-6"
                },
                {
                    "user_id": "Mantas Ptakauskas",
                    "user_href": "/profile/Mantas-Ptakauskas"
                },
                {
                    "user_id": "Jaime Alonso Rodríguez",
                    "user_href": "/profile/Jaime-Alonso-Rodríguez"
                },
                {
                    "user_id": "M Abhijith Bhuvandas",
                    "user_href": "/profile/M-Abhijith-Bhuvandas"
                },
                {
                    "user_id": "Mark Harrison",
                    "user_href": "/profile/Mark-Harrison-2"
                },
                {
                    "user_id": "Emre Yazıcı",
                    "user_href": "/profile/Emre-Yazıcı"
                }
            ]
        },
        {
            "author_info": {
                "name": "Wim ten Brink",
                "href": "/profile/Wim-ten-Brink-1"
            },
            "answer_text": "Your single programming language would look like this:  Instead of this:  As programming languages are specially made to solve specific problems, it would be challenging to have one that could solve everything without being a big clump of tools joined together. As a software developer, you will use different tools for web development than e.g. making console applications, video games or to do embedded programming. The C language, for example, does a great job at embedded programming and is used for the kernels of many operating systems to form the layer between software and hardware. But beyond that, developers move on to higher-level languages that would need less code and would be easier to use. Because at the other end of the spectrum is SQL. With this language, you can select data from databases and return it in whatever way you like, and the system will use the most optimized solution to do so. But using it to make my line-following robot? No way! So, you’ll need the right tool for the job, and there have been many toolmakers who made programming languages that seem to be the right tool. And some prove worthwhile, like the wheel and the hammer. And others are not, like this tool:  ",
            "date": "Answered November 13, 2019",
            "views": "552",
            "upvotes": " View 3 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Martin Matten",
                    "user_href": "/profile/Martin-Matten"
                },
                {
                    "user_id": "Harm Kramer",
                    "user_href": "/profile/Harm-Kramer"
                },
                {
                    "user_id": "Mulegeta Woldemichael",
                    "user_href": "/profile/Mulegeta-Woldemichael"
                }
            ]
        }
    ]
}