{
    "title": "Why do I struggle with motivation to write? - Quora",
    "tags": [
        "Understanding and Maintaining Motivation",
        "Self Motivation",
        "Creative Writing",
        "Writing Advice",
        "Writing",
        "Self-Improvement"
    ],
    "response": [
        {
            "author_info": {
                "name": "Viktoria Popova",
                "href": "/profile/Viktoria-Popova-7"
            },
            "answer_text": "Do you ever struggle with a motivation to brush your teeth? Most likely not because the notion of motivation doesn’t apply to this daily task. Exclude the notion of motivation from your thinking about writing. Make it an unquestionable task that has to be done. No matter how well you do it. Again, before brushing your teeth, you don’t question your perfection in this task. You just do it. Similarly, if you are learning a physical skill, let’s say figure skating, you would never call your coach saying you don’t feel motivated to practice. Writing is a skill. Never wait for motivation to grace you with its presence. With that said, do look for ideas to inspire you: read, research, surround yourself with fascinating people, stir up your knowledge and imagination. ",
            "date": "Answered August 20, 2020",
            "views": "236",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Zoë Sumra",
                    "user_href": "/profile/Zoë-Sumra"
                }
            ]
        },
        {
            "author_info": {
                "name": "Jessica Hartung",
                "href": "/profile/Jessica-Hartung-3"
            },
            "answer_text": "I struggle with motivation to write as well. I find that the reason for this is that: I don’t have an idea or an idea that I think is goodI am in school, so I don’t have a lot of time to write and when I do have time I’d rather just relax",
            "date": "Answered March 4, 2019",
            "views": "23",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Iwan Stevens",
                    "user_href": "/profile/Iwan-Stevens"
                }
            ]
        }
    ]
}