{
    "title": "Why read fantasy books? - Quora",
    "tags": [
        "Fantasy (genre)",
        "Literature"
    ],
    "response": [
        {
            "author_info": {
                "name": "Alan Nicholas",
                "href": "/profile/Alan-Nicholas"
            },
            "answer_text": "Why indeed? The Motivation of Reading Let's start by breaking the motivation to read into two main categories - a) to gain knowledge, to educate oneself, to broaden one's horizon's, to attain some semblance of wisdom, or b) to escape. I used several phrases to describe the first motivator because it's too broad for one word, but generally can be described by those phrases and I'm sure several others that come to mind when you read those phrases.  When one is motivated by category a), one is primarily reading to \"find something out.\"  Humans are inquisitive by nature, although that may be an overstatement to some degree.  We want to know how the world works.  If you want proof of this, look no further than a child.  From infancy to adolescence, a child is primarily concerned with how the world works, what makes the world work, how do I get what I need, how do I articulate my needs to the world and then how does the world give back to me what I need, or more often want.  We strive to find our way and in that striving we search for knowledge and meaning. But, for some, we seek a balance as well, between knowing our world, and escaping our world... Escapism I personally believe that fantasy readers have a deep desire to escape that often eclipses that same desire in others.  I would argue to you that all readers of fiction desire escape, but that those who primarily read literature are interested in small escapades and further in small escapades that shine light upon their existence, and their place in the world, which reflects category a) as well as b). Fantasy seeks to escape this world almost entirely.  It is an extension of the \"good old days\" phenomena you see with generations that look back at a generation beyond their personal knowledge and long for those days again.  It's a bit of a paradox, a bit of a tight-rope walk, because the knowledge set of what the \"good old days\" entails is truly not available to this generation that looks back with rose colored glasses upon it. So, fantasy as a genre subverts that lack of the proper knowledge set by placing the reader in a situation in which there are none with the actual knowledge set because this is a place and time which have never existed.   Contrast this with science fiction for a moment, which also takes place in a void (as it pertains to actual knowledge sets), and you immediately see two distinct differences - 1) science fiction often plays with the EXTENSION of current knowledge sets, a what if scenario that fundamentally derides itself from current knowledge sets, and 2) science fiction is based in reality while fantasy is based in unreality. This is oversimplistic as there is a subset of science fiction that plays much more like fantasy and which has led to the inclusion of the two as one genre when people speak of sci fi/fantasy, but the reality is that readers of one do not always read the other and sometimes are almost averse to the other. Back to the point though, fantasy, by subverting knowledge sets is about as pure an escapism as you can find.  You enter a world that never existed and never shall.  You enjoy thrills that are fundamentally unreal, though some fantasy is portrayed as \"realistically\" as possible.  The death's and other actions of characters may be realistic, but the world they inhabit complete with some magic system usually is unreal. Fantasy Types Read on if you're interested in the two basic types of fantasy and what may draw readers to them. Epic vs. Sword and Sorcery Confession: I didn't realize there were two types of fantasy until reading this article - The Problem of Karsa Orlong This is an article written by Steven Erikson, discussing one of his most decisive characters in his fantasy series The Malazan Book of the Fallen.  There are other books that take place in the setting of this series not written by Erikson, but we don't need to go into that at this time.  Instead, let's focus on the two main fantasy tropes. The defining characteristic of Epic Fantasy is the delineation of lines of good versus evil.  Probably the most popular current series to use as an example of Epic Fantasy is Robert Jordan's Wheel of Time series.  The series revolves around good versus evil.  The Dark One is breaking free of his prison and the series details the steps necessary to prevent this from happening.   There's a small taste of Sword and Sorcery snuck in the series, but generally this is a prime example of Epic Fantasy. The defining characteristic of Sword and Sorcery Fantasy is the LACK of clear delineation of good and evil.  The most popular example of this in current fantasy is George R.R. Martin's A Song of Ice and Fire series or as it's more commonly known, the Game of Thrones series.  In this series characters frequently shift and slide out of roles conventionally known as good and evil and there are no blacks and whites, but rather, infinite shades of grey. But there's also a small taste of Epic snuck into this series as well... I posit, without any empirical proof, that individuals with a strong sense of order, and perhaps a strong Christian or other religious background of absolutes are more likely to read Epic than Sword and Sorcery, whereas individuals who read Sword and Sorcery and more interested in a) more realism (don't mistake this with reality, there's a distinct difference, but realism dictates that the character's have more varied motivations that may in fact slip in and out of our collective ideas of good and evil) and b) more exploration of the human condition (aka \"philosophy\", the varied and insightful meanderings of Erikson are a good example). But to steal the best line of the above referenced article -  \"Now, as Karsa would say: 'Too many words. Witness.'\" ",
            "date": "Answered February 4, 2013",
            "views": "131",
            "upvotes": " View 37 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Princessjoy Garcia",
                    "user_href": "/profile/Princessjoy-Garcia"
                },
                {
                    "user_id": "Shreyas Pai",
                    "user_href": "/profile/Shreyas-Pai-26"
                },
                {
                    "user_id": "Alejandro Torres Borja",
                    "user_href": "/profile/Alejandro-Torres-Borja"
                },
                {
                    "user_id": "Nithin Krishnan",
                    "user_href": "/profile/Nithin-Krishnan-73"
                },
                {
                    "user_id": "Ignotas Malinauskas",
                    "user_href": "/profile/Ignotas-Malinauskas"
                },
                {
                    "user_id": "Valary Kones",
                    "user_href": "/profile/Valary-Kones"
                },
                {
                    "user_id": "Lavanya Sri",
                    "user_href": "/profile/Lavanya-Sri-1"
                },
                {
                    "user_id": "Vida Cruz",
                    "user_href": "/profile/Vida-Cruz"
                },
                {
                    "user_id": "雨茵 黄",
                    "user_href": "/profile/雨茵-黄"
                },
                {
                    "user_id": "Kiran Kuttan",
                    "user_href": "/profile/Kiran-Kuttan-3"
                }
            ]
        },
        {
            "author_info": {
                "name": "Darrel Tait",
                "href": "/profile/Darrel-Tait"
            },
            "answer_text": "The Name of the Wind  Discover #1 New York Times-bestselling Patrick Rothfuss’ epic fantasy series, The Kingkiller Chronicle. “I just love the world of Patrick Rothfuss.” —Lin-Manuel Miranda • “He’s bloody good, this Rothfuss guy.” —George R. R. Martin • “Rothfuss has real talent.” —Terry Brooks OVER 1 MILLION COPIES SOLD! DAY ONE: THE NAME OF THE WIND My name is Kvothe. I have stolen princesses back from sleeping barrow kings. I burned down the town of Trebon. I have spent the night with Felurian and left with both my sanity and my life. I was expelled from the University at a younger age than most people are allowed in. I tread paths by moonlight that others fear to speak of during day. I have talked to Gods, loved women, and written songs that make the minstrels weep. You may have heard of me. So begins a tale unequaled in fantasy literature—the story of a hero told in his own voice. It is a tale of sorrow, a tale of survival, a tale of one man’s search for meaning in his universe, and how that search, and the indomitable will that drove it, gave birth to a legend. Praise for The Kingkiller Chronicle: “The best epic fantasy I read last year.... He’s bloody good, this Rothfuss guy.”—George R. R. Martin, New York Times-bestselling author of A Song of Ice and Fire “Rothfuss has real talent, and his tale of Kvothe is deep and intricate and wondrous.” —Terry Brooks, New York Times-bestselling author of Shannara \"It is a rare and great pleasure to find a fantasist writing...with true music in the words.\"—Ursula K. Le Guin, award-winning author of Earthsea \"The characters are real and the magic is true.” —Robin Hobb, New York Times-bestselling author of Assassin’s Apprentice \"Masterful.... There is a beauty to Pat's writing that defies description.\" —Brandon Sanderson, New York Times-bestselling author of Mistborn ",
            "date": "Answered November 23, 2018",
            "views": "970",
            "upvotes": "0"
        }
    ]
}