{
    "title": "Why is every novel a 'bestseller'? - Quora",
    "tags": [
        "Fiction",
        "Novels",
        "Writers and Authors"
    ],
    "response": [
        {
            "author_info": {
                "name": "Walter D. Petrovic",
                "href": "/profile/Walter-D-Petrovic-1"
            },
            "answer_text": "A bestseller is a book that sells in very high volume and is tracked in comparison to other large selling books to gage how well and at what level the selling books are doing, against one another, What makes a book a bestseller? All best selling books have been advertising dependent and the big Publishing houses have large budgets to get the word out this such-and-such Title by so-and-so Writer is available for sale. Why people buy books begins with trickle sales out of curiosity. If the curiosity is spry, say three to four hundred books sold, then there are people who will jump on the band wagon only out of the fact that the book begins to trend, in sales. Once the joiners jump on, the sales will sometimes triple and quadruple, then people who are regular readers will buy the books to see why it is selling well. At this point these people check Literary Critics’ points of view on the book and will buy, or not, accordingly. Before you know it, the book then sells a million copies and has a life of its own. Sometimes a new author will be lucky to get some hype and maybe this luck will help to sell the book, by then movie rights may have been purchased and the movie becomes the biggest boost to the book sales. Then what happens is the original writer of the book will start developing a brand related to their name, and then these writers may receive contracts for another half dozen books - all of which pre-sold movie rights — and I am thinking of the Harry Potter stories, here. Once in a while there are certain genres that trend, example Murder Mystery, then it may motivate a writer to write a murder mystery in hope to latch-on to the trend. Today this works well because of eBooks and weekly eBook sales are now beginning to be shown in the major newspapers. Self publishing could have you surf the tip of the current trend wave. At this point the writer and the reader will not care as to the quality of the story - both will be happy in satisfying the trends. ",
            "date": "Answered March 31, 2018",
            "views": "370",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Sheena Hocking",
                "href": "/profile/Sheena-Hocking"
            },
            "answer_text": "Haha! It seems that way sometimes, doesn’t it? There are many bestseller lists, especially on Amazon. A book may be a bestseller in a particular genre, crime fiction, for example, or format, such as on Kindle. It may be that a store somewhere sold more of that book than others one week, or that an author paid for lots of their books to be bought in New York on the first day of publication. Some newspaper may have listed it as a bestseller when no-one else has. The Letter: The No. 1 ebook bestseller How to be Happy: The unmissable, uplifting Kindle bestseller Magpie Murders: the Sunday Times bestseller crime thriller with a fiendish twist How is bestseller defined? Above you will see that there is a difference between a No. 1 bestseller and an ordinary bestseller. If there were not, the other book would also have No. 1 Bestseller in its title line - that is marketing, you see. People like to be like other people. Therefore the words “Best Seller” on the cover of a book may become a self-fulfilling prophecy by making it more appealing to consumers. A search on Amazon for best seller books returned 40,000 results. In other words, it is a marketing ploy. ",
            "date": "Answered March 22, 2018",
            "views": "504",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Mella Cotton",
                    "user_href": "/profile/Mella-Cotton"
                },
                {
                    "user_id": "Caroline Wright",
                    "user_href": "/profile/Caroline-Wright-108"
                }
            ]
        }
    ]
}