{
    "title": "Why isn’t there an archive for the wayback machine so archives can’t be deleted? - Quora",
    "tags": [
        "Wayback Machine (product)",
        "Internet Archive",
        "Archives and Archiving",
        "World Wide Web",
        "Search Engines",
        "The Internet",
        "Websites"
    ],
    "response": [
        {
            "author_info": {
                "name": "Alexander Lehmann",
                "href": "/profile/Alexander-Lehmann"
            },
            "answer_text": "You could run an archive, all you need is 20 PB or so of storage. Archives that cannot be deleted are not a logical (or legal) possibility, at some point someone will come up with something that is stored that has to be made unavailable, either by deleting or blocking access. The Internet archive deletes very few data, I believe they are considering making a second archive in Canada or another country to be safe from US deletion requirements, but some things will still be deleted. ",
            "date": "Answered October 27, 2019",
            "views": "27",
            "upvotes": " Answer requested by Gerrit Bernard"
        },
        {
            "author_info": {
                "name": "David McRitchie",
                "href": "/profile/David-McRitchie-1"
            },
            "answer_text": "I don’t think archive.org purposely deletes entries though I have occasionally found one or more dates out of many backups of the file to be missing the content. If a site loses their domain and somebody purchases it they can ask for previous content to go be removed from archive.org which is really bad, in my opinion, if it was a legitimate site. On the other hand if someone acquired a site that was a porn site while parked the new owner and his viewers would certainly not want a dirty past for the new site. ",
            "date": "Answered October 24, 2019",
            "views": "21",
            "upvotes": " Answer requested by Gerrit Bernard"
        }
    ]
}