{
    "title": "Why is my second main character overshadowing my main character? - Quora",
    "tags": [
        "Character Development",
        "Protagonist",
        "Fiction Writing",
        "Creative Writing",
        "Novels",
        "Fictional Characters",
        "Writing Advice",
        "Writing"
    ],
    "response": [
        {
            "author_info": {
                "name": "Olivia Marcus",
                "href": "/profile/Olivia-Marcus-1"
            },
            "answer_text": "I’m not completely certain, but something of the like seems to be happening to me, so I know what you’re talking about. In my story, there were two relationships, which are the main character’s (Pierre) and his best friend’s (Jacques). Pierre is older, very confident with himself and who he is (perhaps too confident), and he’s looking for romance for fulfillment and because he really loves his woman. Meanwhile, Jacques is younger (he actually sees Pierre as more of a mentor/older brother because his own father is physically and psychologically abusive), a late bloomer, awkward, poor, has ADHD, and is not well versed in talking to females. He also has a language barrier with the girl he likes, while the main does not. But throughout his time “wooing” her, he really is learning to accept himself. Pierre already fine with who he is, but Jacques is not. Pierre’s strong, healthy relationship is actually intended to parallel Jacques’s stumbling, awkward, fledgling one. Throughout his journey of his first love (he’s fourteen) he learns to be more confident with who he is and he grows a lot. I realized later that maybe the story really belongs to Jacques and I didn’t know it. People seem to like him, and he’s still my favorite OC, even though I first created him and the rest of the cast 15 years ago. I’ve always had a soft spot for him. I’m not completely sure if I should switch POV because Jacques isn’t the most observant person and he might not be the best for actually narrating a story. But I’m definitely considering it, because he might be a more relatable protagonist for the book’s young adult intended audience. Pierre is kind of who Jacques wants to be like because he doesn’t have another role model, but Jacques is the one the readers grow with. So what I’m saying here is, I think your instincts are telling you that someone else might deserve the spot as the “main” here! Think, as I did, about who grew the most, who has struggles with himself, and who could most relate to the reader. If your main was removed from the plot, could your secondary stand in his own? Maybe you could revise the story so that he’s the main character, or you can make your current main have a more active role, or you could even write a “spin-off” story in addition to your original. ",
            "date": "Answered May 9, 2020",
            "views": "558",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Jean Lamb",
                    "user_href": "/profile/Jean-Lamb"
                },
                {
                    "user_id": "Jess O'Neill",
                    "user_href": "/profile/Jess-ONeill-3"
                },
                {
                    "user_id": "Sarah Right",
                    "user_href": "/profile/Sarah-Right-2"
                },
                {
                    "user_id": "Nelson Workman",
                    "user_href": "/profile/Nelson-Workman"
                }
            ]
        },
        {
            "author_info": {
                "name": "Kate Singh",
                "href": "/profile/Kate-Singh-1"
            },
            "answer_text": "That’s an interesting question. I think part of the problem might lie in how you think of them. Typically, there is only one main character/protagonist. The fact that you are thinking in terms of a second main character tells me you may need to take a look at your story idea. Why do you have more than one main character? Sometimes the story involves a group of people trying to achieve something (Goonies, The Dirty Dozen, etc.), which involves figuring out if there is a leader in the group who may or may not be the official leader. But if you’re talking about someone who is supposed to be more of a sidekick or supporting character, then take a serious look at the story and the character development you’ve done and figure out which one of them is the actual main character. Which character changes as a result of the story action? A good example where the main character isn’t who you’d expect is The Shawshank Redemption. In that film, Andy is convicted of murdering his wife and ends up in prison. The story of Andy’s life in prison and his attempt to escape is told through the eyes of Red, a long-term prisoner. It’s easy to think that Andy is the main character, but he’s not. It’s actually Red. You may have something like that going on in your own story. It’s important to figure out which character is the main character in order to figure out the story’s progression. If you’re following the one who doesn’t change the story will feel underdeveloped and two-dimensional. ",
            "date": "Answered May 9, 2020",
            "views": "473",
            "upvotes": " View 4 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Jess O'Neill",
                    "user_href": "/profile/Jess-ONeill-3"
                },
                {
                    "user_id": "Sarah Right",
                    "user_href": "/profile/Sarah-Right-2"
                },
                {
                    "user_id": "Cato Evans",
                    "user_href": "/profile/Cato-Evans-2"
                },
                {
                    "user_id": "Logan Bedard",
                    "user_href": "/profile/Logan-Bedard"
                }
            ]
        }
    ]
}