{
    "title": "Why did Urdu choose the Persian script? What script was used for Hindustani? Has Urdu ever been written in the Devanagari script? - Quora",
    "tags": [
        "Devanagari (script)",
        "Urdu (language)"
    ],
    "response": [
        {
            "author_info": {
                "name": "Kunal Pan",
                "href": "/profile/Kunal-Pan"
            },
            "answer_text": "I think you should have a better understanding of the languages 1000 years back. After Turk - Afghan invasion and Delhi Sultanate the linguafranca was a common language with Sanskrit-Prakit ‘shouriseni and Persian , Arabic , Turk and other central Asiatic languages . The new language was known as Dehlvi or Hindvi and later to be known as Hindutani. It It was a time when Persian was the court language not only of Persia but kaspian and central Asiatic Kingdom and most of India. So the newly created common language was written with Persian script for every one who wrote it irrespective of religion and another uniqueness of the language was it was always getting richer with local and foreign words and having many dialects but the script remaining same. MOST SIGNIFICANT aspects of the scripts was that it was Persian throughout history of the language but as very artistic variety of scripts were available :as not all forms of painting is considered to be against Islam :so creativity channelled to the beautification of the calligraphy. The name Urdu became popular during Mughal period. ORDA a Turkish word meaning ARMY or horde in English is origin of the word Urdu. During British period Hindus started Devnagri script to the Hindutani or Urdu with increased number Sanskrit derived words with lesser extent of non Sanskrit-Prakit words and it was being known as Hindi. Hindustani in Persian script with more non Indian words appears to be Urdu used mainly by Muslims. So Hindi and Urdu has same grammar and verbs::95%verbs derived from Sanskrit and same in both the languages ::. So I hope that the facts answered all your queries. And due to sphere of influence of the Persian script from Middle East, Central Asia to Myanmar and sphere of influence of Hindustani /Urdu from Afghanistan to Myanmar made it a perfect choice for each other. Urdu in Devanagari script was written and after a bit of Sanskritisation became Hindi. ",
            "date": "Updated October 23, 2019",
            "views": "745",
            "upvotes": " View 6 Upvoters",
            "upvoters": [
                {
                    "user_id": "Pratham Country",
                    "user_href": "/profile/Pratham-Country"
                },
                {
                    "user_id": "SHAHID AAFRIDI",
                    "user_href": "/profile/SHAHID-AAFRIDI"
                },
                {
                    "user_id": "Ashraf Anam",
                    "user_href": "/profile/Ashraf-Anam"
                },
                {
                    "user_id": "Akash Tayde",
                    "user_href": "/profile/Akash-Tayde-15"
                },
                {
                    "user_id": "Vaibhav Srivastva|वैभव श्रीवास्तव|وےبھو شریواستو|ਵੈਭਵ ਸ਼੍ਰੀਵਾਸ੍ਤਵ",
                    "user_href": "/profile/Vaibhav-Srivastva-वैभव-श्रीवास्तव-وےبھو-شریواستو-ਵੈਭਵ-ਸ਼੍ਰੀਵਾਸ੍ਤਵ"
                },
                {
                    "user_id": "Surinder Singh",
                    "user_href": "/profile/Surinder-Singh-280"
                }
            ]
        },
        {
            "author_info": {
                "name": "Babar Imam",
                "href": "/profile/Babar-Imam"
            },
            "answer_text": "The easiest answer is that since Persian was the court language and the script was in popular use, it began to be used for the emerging language as well. But there is more to it. The Devanagari script at that time lacked a lot of sounds that were commonly used in words imported from Persia and Arab. There was no equivalent letter in Devanagari for the sounds Za, KHa, Qaa etc”. The dot below the letters of Devanagari script is a modern addition. Hence it was also the necessity (including other reasons) that drove people to use Persian script for Urdu. ",
            "date": "Answered November 25, 2017",
            "views": "301",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "SHAHID AAFRIDI",
                    "user_href": "/profile/SHAHID-AAFRIDI"
                },
                {
                    "user_id": "Vaibhav Srivastva|वैभव श्रीवास्तव|وےبھو شریواستو|ਵੈਭਵ ਸ਼੍ਰੀਵਾਸ੍ਤਵ",
                    "user_href": "/profile/Vaibhav-Srivastva-वैभव-श्रीवास्तव-وےبھو-شریواستو-ਵੈਭਵ-ਸ਼੍ਰੀਵਾਸ੍ਤਵ"
                },
                {
                    "user_id": "Mohammed Irshad Hussain",
                    "user_href": "/profile/Mohammed-Irshad-Hussain"
                }
            ]
        }
    ]
}