{
    "title": "Why should I write a journal? - Quora",
    "tags": [
        "Diaries and Journals"
    ],
    "response": [
        {
            "author_info": {
                "name": "Kamila Miller",
                "href": "/profile/Kamila-Miller-2"
            },
            "answer_text": "People who keep up a diary or journal do so for individual reasons based on their personality, circumstances, and needs. My husband keeps a faithfully-maintained diary and has for years. He started when he began work in corrections, partly to clear his head about his job but also as a trustworthy record in case he was questioned about an incident with a coworker or an inmate that may not have warranted a formal report well after it happened. He’s a very honest person with a lot of integrity, and he didn’t want to be placed in a position where he’d have to guess what happened, or use his intuition, especially if it was a matter that would impact a coworker’s or inmates quality of life and/or safety. Also, it made it easier for him to remember, simply by writing it down. Finally, it was easier to see patterns of behavior with individuals, especially if the behavior is sporadic and subtle. Memory, even in people who have excellent powers of recollection, is very malleable. Anyone can manipulate their memories in surprising ways, sometimes for the better, and sometimes in very detrimental ways. Sometimes memories can be created whole-cloth, simply by combining pictures from childhood with stories told around the dinner table. These memories can feel absolutely true to a frightening degree. Memories can even be invented by questionable therapy practices. Creating False Memories A diary doesn’t give you immunity from biased memories, especially if you were stressed or highly emotional at the time. But what you write the day of an event will certainly be more reliable than what you’ll remember years later. My husband’s diary also helps with his taxes. Just the other day, as he was going over his year’s expenditures, he found a large withdrawal. Neither of us could remember what it was for. We went to his diary and pieced that week back together, and that helped us determine what it was for. I don’t keep a daily diary. I do journal, however. My journal helps me keep important data about our farm, like births and deaths, yields from various crop plantings, how much I spent on seeds, live chicks, feed (even tiny farms like ours are expensive to run!) hay and so on. It also reminds me of the good times when we’re struggling a bit, and when we’re doing well, it serves as a reminder to be vigilant with worming programs, noxious weed control, and so forth. I think my favorite thing about journaling, though, is looking back at images of my kids growing up, and newborn goats, and pets that have long since traveled over the rainbow bridge. When we’re happy, we forget that it’s only a moment in time, fleeting and destined to be lost forever. The fact that we can hold on to pieces of that happiness is magical. ",
            "date": "Answered March 4, 2017",
            "views": "64",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Michelle Verstraaten",
                    "user_href": "/profile/Michelle-Verstraaten"
                }
            ]
        },
        {
            "author_info": {
                "name": "Parikshit Dahivalkar",
                "href": "/profile/Parikshit-Dahivalkar"
            },
            "answer_text": "I don't write my diary regularly but yes I do write it often. Infact my parents don't know this thing. Nevertheless keeping a diary can help you in following ways… 1. You can record special events.People take photos so they can remember days out, parties etc. 2. You can record normal events too.You might think that normal days are boring, until you start writing. 3. You can record your thoughts and feelings.You remember how things made you feel on certain days or in certain places, so your memory is more detailed. 4. This is a kind of therapy after bad days.Getting your feelings written down on paper feels much better than keeping them to yourself. It can also help you think about things more clearly. 5. In fact, it’s therapeutic even on good days!Make a hot drink, get into a comfy chair, and take half an hour just for you and your diary. It feels great! 6. You can improve your writing skills.Practice makes perfect! Seeing your writing develop is very rewarding. 7. Why not try a foreign language?Practise your language skills and improve your vocab, without worrying about mistakes. 8. Appreciate your successes.Sometimes, we don’t appreciate what we achieve . So write down a challenge you overcame and how you did it will make you realise this! Within a year or so, you can clearly see how you have developed as a person. So all the best with your diary writing.:-) ",
            "date": "Answered February 5, 2017",
            "views": "44",
            "upvotes": " View 5 Upvoters",
            "upvoters": [
                {
                    "user_id": "Panashe Musara",
                    "user_href": "/profile/Panashe-Musara-2"
                },
                {
                    "user_id": "Akshay Kumar",
                    "user_href": "/profile/Akshay-Kumar-9383"
                },
                {
                    "user_id": "Lucienne La Luna",
                    "user_href": "/profile/Lucienne-La-Luna"
                },
                {
                    "user_id": "Nikhil Sahal",
                    "user_href": "/profile/Nikhil-Sahal-1"
                },
                {
                    "user_id": "Brandon Martin",
                    "user_href": "/profile/Brandon-Martin-65"
                }
            ]
        }
    ]
}