{
    "title": "Why are there no draw programs that work like flash? - Quora",
    "tags": [
        "Adobe Flash",
        "Sketching",
        "Drawings"
    ],
    "response": [
        {
            "author_info": {
                "name": "Allan Reilly",
                "href": "/profile/Allan-Reilly"
            },
            "answer_text": "Details: I’m not looking for animation or web design, just the art tools. Here is what I mean. So I launch Adobe Flash and start a new document: I draw a circle.I draw a line through the circle.I select the paint bucket tool. (It is a vector tool in Flash.)I click on the lower half of the circle, and only that half of the circle is filled in with the current color or gradient.Now I drag the fill out of the circle. The result is a semicircle fill, fully editable with points and vectors. All this takes 30 seconds.I asked my friend to try this in Adobe Illustrator, and after 20 minutes he was reduced to manually trying to trace the sides of the circle with some kind of shape tool! I can’t find any vector programs that let you manipulate lines and objects the way an artist thinks about them. They all seem to think you are making blueprints for a building, and are dumb as a rock when it comes to actually creating art. Surely SOMEONE else can do this? BTW, the reason I have to dump Flash is because Adobe has abandoned it and hasn’t been fixing bugs for 10 years, yet is charging more then ever for what is left of the thing - you actually can’t buy it, you have to rent it for an exorbitant price. ",
            "date": "Answered January 10, 2019",
            "views": "159",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Andy Nightingale",
                "href": "/profile/Andy-Nightingale-2"
            },
            "answer_text": "Any of the HTML5 apps do. I use Tumult’s Hype to build animations. It has layers and a timeline so looks similar to flash. Adobe and Google have similar apps. Rather than Actionscript they use HTML, CSS and JavaScript. ",
            "date": "Answered January 13, 2019",
            "views": "97",
            "upvotes": "0"
        }
    ]
}