{
    "title": "Why do I feel exposed and shy to share poems I write? - Quora",
    "tags": [
        "Writing Poetry",
        "Shyness",
        "Poems",
        "Poetry",
        "Creative Writing",
        "Writing"
    ],
    "response": [
        {
            "author_info": {
                "name": "Arina Abbaali",
                "href": "/profile/Arina-Abbaali-1"
            },
            "answer_text": "I don’t consider myself a poet. I loathe structure but enjoy the lyrical way my words move when I speak it out loud. In that sense, I suppose I am a poet. Just a really bad one. But that’s not what worries me when I’m asked to present my work. It’s not even the possible grammatical errors or misplaced punctuation marks that force me to revert back to my shell. It’s the content lying in it itself. Whatever words I pen down are words that I would not bother saying it out loud. I can voice all thing politics and controversial in front of everyone with no problem at all, but when it comes down to the feelings in my heart, I’m terrified. My poems and writings are my own pent up release, driving from the deepest force in my body. They are the words that whisper heartbreak, pain, selfishness, and feelings of unworthiness. When people read my writing, they are seeing my soul bared in the worst manner possible. And frankly, I am terrified to know what they will think of it. That is why whenever my friends or family read something of mine, I look away. Part of the reason for that is because I don’t want them to worry about putting on a fake smile while they read it. The other part is because I don’t want them to see my expression. I feel exposed when sharing my words because I am willingly giving a person a vulnerable part of myself. ",
            "date": "Updated April 23, 2019",
            "views": "241",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Shara Rajora",
                    "user_href": "/profile/Shara-Rajora"
                },
                {
                    "user_id": "Jenna Walters",
                    "user_href": "/profile/Jenna-Walters-7"
                }
            ]
        },
        {
            "author_info": {
                "name": "Mala Venkateswaran",
                "href": "/profile/Mala-Venkateswaran-1"
            },
            "answer_text": "It’s all in your mind. Just set your fears free and go for it. There is no harder judge on yourself than you. Our ego feels hurt if someone doesn’t say something positive to what we share. But in life, you can’t live for others. You have the desire, so go ahead and share it anyway. All the best! ",
            "date": "Answered April 6, 2019",
            "views": "81",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Jenna Walters",
                    "user_href": "/profile/Jenna-Walters-7"
                }
            ]
        }
    ]
}