{
    "title": "Why might a writer use short sentences? - Quora",
    "tags": [
        "English Sentences",
        "Creative Writing",
        "Sentences (language)",
        "Writers and Authors",
        "Grammar"
    ],
    "response": [
        {
            "author_info": {
                "name": "William Vietinghoff",
                "href": "/profile/William-Vietinghoff"
            },
            "answer_text": "One of the many reasons a writer will use a short sentence is because it adds more punch or drives a point home better than a long sentence. Compare these two examples of text: “Ed Walker, night manager of the Trulite Lamp Store, looked at the clock above his desk in the back room, the hands dead on nine-o-clock and time to close. As he rose from his chair, he heard the tinkle of the bell that hung on the front door, indicating that Someone was either entering or leaving. Maybe it was Rob, the clerk, putting up the “Closed” sign. As Ed entered the main area of the shop, he became aware from the silence that he was totally alone. He walked behind the counter, the store keys dangling from his hand, as he pulled open the cash drawer to check the contents, to transfer the bills and coins to the safe in the office. The drawer was empty. A call to Rob suddenly became crucial, but the realization struck him that Rob had told him he was leaving on a trip that night, and he would be difficult to reach.” “Ed Walker, night manager of the Trulite Lamp Store, looked at the clock above his desk in the back room, the hands dead on nine-o-clock and time to close. As he rose from his chair, he heard the tinkle of the bell that hung on the front door, indicating that Someone was either entering or leaving. Maybe it was Rob, the clerk, putting up the “Closed” sign. As Ed entered the main area of the shop, he became aware from the silence that he was totally alone. He walked behind the counter, the store keys dangling from his hand, as he pulled open the cash drawer to check the contents, to transfer the bills and coins to the safe in the office. A call to Rob suddenly became crucial, because the drawer was empty, but the realization struck him that Rob had told him he was leaving on a trip that night, and he would be difficult to reach.” In the first version the very short “The drawer was empty” is like an interruption in the activity. It focuses the reader’s attention on the fact the money was gone. The wording reflects the shock experienced by Ed. In the second version, the mention of the drawer being empty is a like an interesting fact thrown in. ",
            "date": "Answered July 10, 2020",
            "views": "21",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Mohamad Qasem",
                    "user_href": "/profile/Mohamad-Qasem"
                }
            ]
        },
        {
            "author_info": {
                "name": "John Joss",
                "href": "/profile/John-Joss"
            },
            "answer_text": "Why, indeed? Short sentences are good. They work. Readers like them. Good writers use them. Brevity and clarity work together. The goal: convey information. Bad writers are often prolix. Hiding behind logorrhea is lazy. Modifiers kill. Editing is vital. See what I mean? It’s obvious. You want an example? See below.  A writer noted for his prolixity, his love of TMI (Too Much Information), created the following for a major publication. “He did another return; again the math squared and there were no itemizations on 32 and the printout’s numbers for W-2 and 1099 and Forms 2440 and 2441 appeared to square, and he filled out his codes for the middle tray’s 402 and signed his name and I.D. number that some part of him still refused to quite get memorized so he had to unclip his badge and check it each time and then stapled the 402 to the return and put the file in the top tier’s rightmost tray for 402s OUT and refused to let himself count the number in the trays yet, and then unbidden came the thought that “boring” also meant something that drilled in and made a hole.” The fiction editor of The New Yorker thinks that 17-line (!), 122-word (!) sentence (The New Yorker, March 9, 2010, p63) by the late David Foster Wallace is brilliant, though it’s rotten reportage and mindless logorrhea. We get the ‘boring’ part, don’t we? Try, instead: “Checking tax returns was numbingly tedious.” But why use six words when 122 will do, eh? Ring Lardner’s famous line says it best: ’”Shut up,” he explained.’ ",
            "date": "Answered October 6, 2019",
            "views": "35",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Bob Chokpitakkul",
                    "user_href": "/profile/Bob-Chokpitakkul-1"
                },
                {
                    "user_id": "Eric Zhang",
                    "user_href": "/profile/Eric-Zhang-628"
                },
                {
                    "user_id": "David Croft",
                    "user_href": "/profile/David-Croft-6"
                }
            ]
        }
    ]
}