{
    "title": "Why weren't European settlers killed by Native American diseases in the same way Native Americans are reported to have been wiped out by European diseases like smallpox? - Quora",
    "tags": [
        "Native Americans",
        "Epidemiology"
    ],
    "response": [
        {
            "author_info": {
                "name": "Jason Preston",
                "href": "/profile/Jason-Preston-2"
            },
            "answer_text": "The book 1491 explains that Europeans also died in droves from smallpox, but not nearly to the extent that Native Americans did.  The difference?  Europeans' immune systems were developed for lives of animal husbandry in drier climates where parasites (e.g. worms) were much less a danger than microbes (e.g. smallpox virus from the camels Egyptians kept, flu from pigs).  So European immune systems developed antigens focused more on microbes, while  Native Americans' antigens were focused more on parasites.  Another factor in this divergence: Almost all Native American genes came from a relatively small group of people who crossed over from Asia.  They didn't have as wide a variety of antigens, in the same way that a small island has less human facial diversity than a supercontinent.  In fact, Native Americans only have a third as many kinds of antigens as other, more genetically diverse human groups.  Each antigen allows the body to identify a different kind of evidence at the crime scene of an infection.  More kinds of antigens means a faster detection of infection, a better defense mounted. And that's why when smallpox got to the Americas, it basically caused the Apocalypse for half the planet.  Smallpox had already adapted to savage its way through very well defended European communities, because it has no state where a creature passively carries it.  It has no resting home, it's constantly warring for space.  And when smallpox reached the New World, it blindly used the same aggressive approach to the new, less defended human beings it found. Early records show that wave after wave of smallpox infection spread in every direction, mostly without human guidance, across the Americas starting in the 1500s and picking up speed in the 1600s and 1700s.  One of the first waves has been reconstructed from gravesites and death records and shows the shockwave of infection moving north from Central America into the Mississippi River Valley at a rate of hundreds of miles per year, killing a quarter to three quarters of each Native American population it passed through.  While estimates range widely, they concentrate on a likelihood that smallpox eventually reduced pre-Columbian populations by 95%, or more.  This is historically unprecedented, beyond even the Black Death.   Essentially, when you watch Mad Max or 28 Days Later or World War Z or The Walking Dead, you're seeing what happened in North America 400 years ago.  The Native Americans and early landscape we all think we know, was just the ravaged aftermath of a very different world that Europeans mostly never even saw.  For context, the Black Death killed a third of Europe, and this was enough to destroy feudalism and sow the seeds of vulgate religion, renaissance, enlightenment, secular humanism.  That's what happens when you kill every third person.  When you kill every second person, every 50 years, for 200 years, you don't get a renaissance.  You get scavengers.  You get, for example, a confederacy of marauders made of the survivors of groups that didn't live by marauding, and known to their neighbors (and history) only as The Harassers (\"Comanche\").  You get a breakdown of history, especially when the survivors don't have writing. You get a breakdown of cultivated landscapes into overgrown forest, so that newcoming invaders don't even understand that humans had shaped the land into a brilliant outdoor buffet.  You get a people who are pitied, and yet warehoused and rejected, by all other peoples, because their existence is an intolerable reminder of the possibility of annihilation for any people, or all.   Yes, some Europeans tried to use smallpox as a tool of conquest.   But from the first contact, the range of possible futures for Native Americans was bounded by four extremes:  Every European left the New World; every Native American married a European; the smallpox vaccine was discovered immediately and given to every Native American; 95% of Native Americans would die.  The odds really favored the fourth extreme.   What was lost to smallpox and racist conquest was immeasurable.  A sustainable method for turning woodlands into self-healing supermarkets; judicial systems not reliant on execution or confinement; urban planning capable of scale and hygiene not seen in Europe; countless cultures.  In the words of one Aztec poet, \"Life exists for the moments when the flowers bloom and the songs erupt from the birds and the bright feathers come out for display.  And humanity, otherwise cut off from the timeless truths of the gods, exists for the moments when the poems bloom and the music erupts and the visual arts come out for display.  In those moments of beauty alone does humanity know eternity.\" ",
            "date": "Updated May 11, 2015",
            "views": "645",
            "upvotes": " View 542 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Fatima Jeylani",
                    "user_href": "/profile/Fatima-Jeylani-4"
                },
                {
                    "user_id": "Teena Hiesberger",
                    "user_href": "/profile/Teena-Hiesberger"
                },
                {
                    "user_id": "David Panuška",
                    "user_href": "/profile/David-Panuška"
                },
                {
                    "user_id": "T.J. Caruso",
                    "user_href": "/profile/T-J-Caruso"
                },
                {
                    "user_id": "Oliver Straiton",
                    "user_href": "/profile/Oliver-Straiton"
                },
                {
                    "user_id": "Kenneth Coville",
                    "user_href": "/profile/Kenneth-Coville"
                },
                {
                    "user_id": "Dave Edwards",
                    "user_href": "/profile/Dave-Edwards-60"
                },
                {
                    "user_id": "N. Joseph Potts",
                    "user_href": "/profile/N-Joseph-Potts"
                },
                {
                    "user_id": "Pam Walker",
                    "user_href": "/profile/Pam-Walker-126"
                },
                {
                    "user_id": "Jody Biggs",
                    "user_href": "/profile/Jody-Biggs"
                }
            ]
        },
        {
            "author_info": {
                "name": "Kiran Kumbhar",
                "href": "/profile/Kiran-Kumbhar-4"
            },
            "answer_text": "This answer discusses the urgent need to revisit and modify some of Guns Germs and Steel, and 1491, and Crosby, et al. I try to argue that the question is perhaps based on a notion of immunological superiority/inferiority - and thus needs to be reframed. Native Americans were not as much “wiped out” by European germs and diseases as by the European-triggered disruption in their already precarious social order and personal lives, especially agriculture and subsistence. My intervention here is thus to provide an alternative framework to look at mortality and disease in Native Americans after the arrival of Europeans. (I might disappoint those who wish to know an ‘exact’ answer to this particular Q, but hopefully will give enough material to think about health inequities/disparities, the basic reason behind why mortality rates varied so much between early European colonizers and Native American populations.) My answer is derived wholly from the research and arguments of Professor David Jones, historian of medicine at Harvard Medical School. In 2003 Jones wrote a seminal article relooking at some of the received wisdom regarding mortality in Native American populations after the arrival of Europeans. Titled ‘Virgin Soils Revisited’, it makes a compelling case for the complexity and messiness of history and against trusting simplistic explanations. These are some crucial points that Jones makes: Though epidemics did bring rapid decimation to many native groups [though not all], these ‘European’ infectious diseases did not monopolize the mortality. Europeans and Americans killed countless Naive Americans through war, starvation, neglect, even hunting.The frequently stated claims of ‘no immunity’ have no substance. With the exception of persons born with rare genetic immune diseases, all humans can mount a powerful immune response against microbes, whether new or old. Besides, it is incorrect and racial to assume any specific European ‘superiority’ in terms of immune systems. In any case it is unlikely that diseases like smallpox and measles were present among European populations for long enough to allow natural selection create a huge difference between their resistance as against that of Native Americans to the microbes. (Infectious diseases in primitive societies)Immunity against disease could be innate -which was referred to above - or adaptive. Adaptive immunity is best exemplified by chickenpox, where antibodies (the main mechanism of adaptive immunity) produced during an initial episode offer protection during later episodes. Initial lack of adaptive immunity likely left Native Americans vulnerable to certain pathogens, but certainly not to all, and adaptive immunity was anyway irrelevant for many of the major causes of mortality: the likes of viral pneumonias and diarrheas.There are many other factors, regardless of genes, that dictate susceptibility to infection: a population's physical, social, economic, and political environments all interact to create patterns of vulnerability. Eg, if the smallpox virus is introduced in a modern European nation, people will sure die. But the death rate will not be uniform: there will be far more death and disease among the poor, the poorly nourished, the already diseased (like diabetics and the cancer-stricken), and in communities with unstable social political systems, like overcrowded regions or places where formal caregiving is lacking.David Jones’s compelling explanation for high mortality is thus not lack of immunity in Native Americans (or immunological superiority of Europeans), but the disruption in social life and systems of the Native Americans that colonization and European presence triggered. It was then primarily this disruption that made the Natives more susceptible to disease.The Native Americans were living precarious lives - as against some accounts of a paradisaical existence. Archaeologists and physical anthropologists have shown that many groups were terribly malnourished. The accomplishments of the Mayan civilization might have been undone by climate change, crop failures, and famine. Disease, malnutrition, and violence made Mesoamerican cities as unhealthful as their medieval European counterparts, with life expectancies of 21 to 26 years. The Arikaras had life expectancies as low as 13.2 years. Study of skeletal remains has found widespread evidence of nutritional deficiencies, with health conditions worsening in the years before contact Europeans. Baseline malnutrition left American Indians vulnerable - at the outset - to European diseases. Then, when the conditions of colonization disrupted subsistence, the situation only grew worse.In addition, any factor that causes mental or physical stress - drought, destruction of crops, soil depletion, overwork, social and economic chaos - can increase susceptibility and decrease fertility.Lastly, Jones says that the skewed global distribution of deaths from HIV AIDS - a ‘new’ infectious disease for all human populations - is a good example to help think about his explanations for Native American mortality. AIDS caused disproportionate deaths within America in urban minorities as against suburban whites, and globally in Africans as against Europeans. It would be absurd today to say that the higher mortality in the former communities was due to ‘lack of immunity’ in the former or due to some immunological superiority in the latter groups. Jones maintains that it is deeply disturbing to see Jared Diamond and others, trusting received but unrevised wisdom, making an inadvertent case for biological superiority - and hence racial superiority - of Europeans over Native Americans. Eg, one line in Diamond’s book goes: \"The main killers were Old World germs to which Indians had never been exposed, and against which they therefore had neither immune nor genetic resistance.” History is complex. Disease and health are more so. ",
            "date": "Answered November 29, 2017",
            "views": "101",
            "upvotes": " View 171 Upvoters",
            "upvoters": [
                {
                    "user_id": "Ethan Hardy",
                    "user_href": "/profile/Ethan-Hardy-25"
                },
                {
                    "user_id": "Josie Snow",
                    "user_href": "/profile/Josie-Snow"
                },
                {
                    "user_id": "Kyle Knowles",
                    "user_href": "/profile/Kyle-Knowles-8"
                },
                {
                    "user_id": "Christian Davis",
                    "user_href": "/profile/Christian-Davis-119"
                },
                {
                    "user_id": "Randy Zimmerman",
                    "user_href": "/profile/Randy-Zimmerman-6"
                },
                {
                    "user_id": "David Parry",
                    "user_href": "/profile/David-Parry-114"
                },
                {
                    "user_id": "Salami Guadalupa",
                    "user_href": "/profile/Salami-Guadalupa"
                },
                {
                    "user_id": "Lynn Carey",
                    "user_href": "/profile/Lynn-Carey-1"
                },
                {
                    "user_id": "Greg Courter",
                    "user_href": "/profile/Greg-Courter"
                },
                {
                    "user_id": "Eron Silva",
                    "user_href": "/profile/Eron-Silva"
                }
            ]
        }
    ]
}