{
    "title": "Why did this incident happen? - Quora",
    "tags": [
        "Incomplete Questions",
        "Delta Air Lines",
        "Airports",
        "Experiences in Life"
    ],
    "response": [
        {
            "author_info": {
                "name": "Richard Jette",
                "href": "/profile/Richard-Jette"
            },
            "answer_text": "This actually happens a few times each year and always makes the local news. In many parts of the US there are several runways surrounding a small city. The local commercial airport, a private executive airport, and possibly an Air Force base. They may be no more than a few miles apart. The runways are intentionally aligned in the same orientation to avoid airplanes crossing paths at low altitudes and because the prevailing winds are in the same direction. Air traffic controllers who manage the flight are in a windowless room and can’t see the plane. Radar doesn’t work the same way for commercial flights as it does for military. The radar displays the the ATC room rely on the plane’s transponder to know where it is. Just before landing when the plane is in visual range of the airport, the local control tower takes control. By this time the landing gear is down and the pilot is focused on the runway. The controller in the tower looks out and doesn’t see the plane but usually won’t worry about it. It should be there in a minute since he can hear the radio communication and all seems normal. No one may know he is aiming for the wrong runway until the last minute and sometimes the plane will land before the pilot looks around for the terminal building. OOPS! This happened to me in Wichita, KS. The city is surrounded by runways. There is the Midcontinent airport, and air force base, a flight school, the Cessna, Boeing, Beechcraft and Falcon aircraft factories. It was very easy for a pilot arriving there for the first time to line up on the wrong runway. ",
            "date": "Answered July 11, 2016",
            "views": "868",
            "upvotes": " Answer requested by Andrew Perkins",
            "upvoters": [
                {
                    "user_id": "Dick Karp",
                    "user_href": "/profile/Dick-Karp"
                }
            ]
        },
        {
            "author_info": {
                "name": "Dan Birchall",
                "href": "/profile/Daniel-J-Birchall-1"
            },
            "answer_text": "D’oh! And the article notes that 12 years ago, a Northwest (now Delta) flight did the same thing. This sort of confusion is unfortunately easier when the approach to the airport involves coming in over a highway to a runway that runs roughly from the southeast to the northwest… and the approach to the Air Force base ALSO involves coming in over a highway to a runway that runs roughly from the southeast to the northwest. Of course, the article does note that the tower pointed out both runways and told them which one to land on. I imagine that this took the form of “there are two runways - land on the left one,” followed just after touchdown by a phrase my wife often hears when she’s driving and I’m navigating: No, the other left! (I am fairly certain my wife has not been flying for Delta when I’m not looking, though, so she’s off the hook for this one.) By the way, this sort of thing can go the other way, too. Three years ago, an Air Force C-17 - that’s a large, four-engine cargo jet - landed at a Tampa-area airport that primarily serves small, single-engine private propeller planes, with an 0.6-mile runway oriented pretty much the same direction as the 2-mile runway it was supposed to land on 5 miles later. Air Force blames pilot fatigue for C-17 landing 4 miles from MacDill ",
            "date": "Answered July 8, 2016",
            "views": "13",
            "upvotes": " View 1 Upvoter "
        }
    ]
}