{
    "title": "Why are Dutch people so tall? - Quora",
    "tags": [
        "Flanders",
        "People of the Netherlands",
        "Dutch Ethnicity and People",
        "Belgium",
        "Tall People"
    ],
    "response": [
        {
            "author_info": {
                "name": "Marvin Dookharan",
                "href": "/profile/Marvin-Dookharan"
            },
            "answer_text": "Probably eating habits and diet. The average height of a Dutchman in the 18th century was only like 5′3″-5′4″ or 160–162 cm. Now in modern times The Netherlands ranks as the country with the most plentiful healthy food (Netherlands is country with most plentiful, healthy food: Oxfam), everyone there eats a lot during their growth spurts which has a big effect on height. Studies show that eating habits have a big effect on growth hormones. I’m not sure if it’s because of genetics because the genetics of height is still almost completely unknown whereas we really know that eating habits influences growth. This means if you control for non-genetic factors there could be other groups genetically taller than the Dutch but since The Netherlands ranks as the country with the most plentiful, affordable, healthy food the non-genetic factors are very uneven. All the people I know who are short as adults (like 5′7″ or 171 cm or shorter) were skinny growing up during one or more of their growth spurts. I know some people were very skinny as little kids when a lot of height is gained but fatter later on like after age 9 growing up who are short as adults (you’re supposed to grow like 2.5 inches or 6 cm/year until adolescence but only if you eat enough food). I know far fewer people who were fatter as little kids who are short as adults except for some females since many females decide to intentionally stop eating after age 13 or so. I also know some people who were short but then ate a lot during adolescence and became tall as adults. I still haven’t encountered even one person who ate a lot during all of their growth spurts who is short as an adult. Many people who are fat as adults were skinny growing up. This means the majority of people who are tall or short are probably so for non-genetic reasons. The only genetically short people are the ones who ate enough food during all of their growth spurts who are still short…which I still haven’t encountered even one person like that. So basically if you’re short it probably means that you didn’t eat enough food during your growth spurts.  Image from - So Big! At What Age are Kids' Growth Spurts? - Famlii ",
            "date": "Updated February 16, 2018",
            "views": "148",
            "upvotes": " View 15 Upvoters ",
            "upvoters": [
                {
                    "user_id": "George Nathanael",
                    "user_href": "/profile/George-Nathanael-3"
                },
                {
                    "user_id": "Kennedy Walker",
                    "user_href": "/profile/Kennedy-Walker-41"
                },
                {
                    "user_id": "Christian Edds",
                    "user_href": "/profile/Christian-Edds"
                },
                {
                    "user_id": "E. Groeg",
                    "user_href": "/profile/E-Groeg"
                },
                {
                    "user_id": "Vijay Saikiran",
                    "user_href": "/profile/Vijay-Saikiran"
                },
                {
                    "user_id": "Galih Dwi Kurniawan",
                    "user_href": "/profile/Galih-Dwi-Kurniawan"
                },
                {
                    "user_id": "William Beteet III",
                    "user_href": "/profile/William-Beteet-III"
                },
                {
                    "user_id": "Kevin Velásquez",
                    "user_href": "/profile/Kevin-Velásquez"
                },
                {
                    "user_id": "Justin Gobel",
                    "user_href": "/profile/Justin-Gobel-1"
                },
                {
                    "user_id": "Sten Reiter",
                    "user_href": "/profile/Sten-Reiter"
                }
            ]
        },
        {
            "author_info": {
                "name": "Christiaan van Mierlo",
                "href": "/profile/Christiaan-van-Mierlo-1"
            },
            "answer_text": "We joke about that, that we are so tall because we are below sea level, but in case of flood being tall wont mean you survive. You will if you are 6 meters tall, because some places in the netherlands are 6 meters below sea level. Hoe hoog ligt jouw dorp of stad? Hoogtekaart van Nederland So because we are below sea level isnt the reason we are tall. The Dutch are among the tallest people in the world. On average a Dutch adult will stand at 1.78 meters high and as a nation, the Netherlands towers over its European neighbors. This statistical anomaly has been the source of considerable scientific speculation and has consistently perplexed researchers. A recent study aims to uncover the reasons behind Dutch people’s peculiar growth patterns, combing historic records to reveal the factors that contribute towards their enhanced height. Aforementioned vitamin rich diet undoubtedly helps to fuel growth and supplies children with the energy that their bodies need to reach such towering proportions. Nonetheless, scientists believe this to be only one factor among many.Until around a hundred years ago, the Dutch were actually one of the shortest nations in Europe and their exponential growth has remained something of a mystery to the scientific community. In July of this year, the journal eLife published an investigation that explored global growth trends over the last century. The paper found that other European nations have experienced similar increases in height, mainly because of significant improvements in living standards. The paper also gathered evidence drawn specifically from the Netherlands, tracing a picture of the country’s genealogy during the years between 1935 and 1967. Their data shows that on average taller people were having more children than their shorter compatriots. Moreover, the Netherlands underwent a population boom during this time, resulting in a generation of taller citizens. These families were larger than European averages with Dutch people having one, or two, more children than usual.Observing these patterns over time, the researchers concluded that this distinctively Dutch trait is partly due to genetics. The genes that make for taller individuals are hereditary, and a large population of lofty citizens is more likely to produce broods of equally endowed offspring. Said genetic material has now spread across the Netherlands; meaning its citizens will probably continue to pass on the towering characteristic. While the Dutch are certainly at the peak of global statistics, it should be mentioned that most of the world has enjoyed an increase in stature over the last century; with improved health-care, nutrient, and sanitation believed to be key drivers behind this change. ",
            "date": "Answered May 12, 2017",
            "views": "182",
            "upvotes": " View 39 Upvoters",
            "upvoters": [
                {
                    "user_id": "Hemelton Matlonya",
                    "user_href": "/profile/Hemelton-Matlonya"
                },
                {
                    "user_id": "Kennedy Walker",
                    "user_href": "/profile/Kennedy-Walker-41"
                },
                {
                    "user_id": "Red Devine",
                    "user_href": "/profile/Red-Devine"
                },
                {
                    "user_id": "Justin Talbit",
                    "user_href": "/profile/Justin-Talbit"
                },
                {
                    "user_id": "Marc Cigardain",
                    "user_href": "/profile/Marc-Cigardain"
                },
                {
                    "user_id": "Johanna Reefman",
                    "user_href": "/profile/Johanna-Reefman"
                },
                {
                    "user_id": "Javanese Panislamist",
                    "user_href": "/profile/Javanese-Panislamist"
                },
                {
                    "user_id": "Chwee Teo",
                    "user_href": "/profile/Chwee-Teo"
                },
                {
                    "user_id": "Don Carleone",
                    "user_href": "/profile/Don-Carleone-8"
                },
                {
                    "user_id": "Justin Gobel",
                    "user_href": "/profile/Justin-Gobel-1"
                }
            ]
        }
    ]
}