{
    "title": "Why do people write an article? - Quora",
    "tags": [
        "Blo",
        "Blog Writing",
        "Journalists",
        "Creative Writing",
        "Communication",
        "Blogs",
        "Writers and Authors",
        "Psychology"
    ],
    "response": [
        {
            "author_info": {
                "name": "Roberta Segal",
                "href": "/profile/Roberta-Segal"
            },
            "answer_text": "Writers write for a lot of reasons, and they differ according to the personality of the writer. While a novelists may write because they are inventive and see the world as inspiration for stories to tell, the writers of articles want to make specific points. What kinds of points they make, through the medium of the article format, are indicative of each writer's needs and desires. Some are angry, and use the word as a weapon against things that make them mad. Some are informed about something that has a message, and use words for empowerment of self or others. Some use it as a form of therapy and write journal-type articles which lay bare their symptoms. Some write them because it's a way to occasionally make some money with your skill or knowledge, or because it's a way to pay for your travel habit. Some people simply write them to express their love, appreciation, or criticism of the things they care about, like food, movements, literature, or whatever. People write for self-expression, to be heard, to find kindred spirits, or in the best of all possible worlds, attract fans. For every decent writer, there is an audience somewhere, and the article is a way to reach that audience. Articles are short, and suitable for the abbreviated attention span of most modern readers. Fewer people read books these days, and writing a book is a lengthy process that not all writers can commit to-- but an article can be written in a relatively short time. I write many different kinds of things, but at one time, I wrote for magazines for a living. I wrote about things I thought were amazing to me because I wanted to use the word to give power to the things I valued; one of my articles was the first in a national glossy about Burning Man. I've written a mystery novel for fun, and perhaps profit, memoirs because I think I have something to say about living, and Quora answers because they're short articles that give voice to what I believe or know. I write a blog about mystery novels in which I only review ones I've enjoyed, because I have enjoyed them so much, and wish to let other fans of the genre hear about great stuff I've found. Book bloggers, like bloggers in other fields of interest, use the word to trade enthusiasms. So there is no one answer to why a writer writes an article. There are as many reasons as there are writers-- almost-- and every writer's voice speaks to who they are, what they think is important, and what they feel compelled to put out in the world as a representation of who they are. ",
            "date": "Answered March 27, 2012",
            "views": "56",
            "upvotes": " View 5 Upvoters",
            "upvoters": [
                {
                    "user_id": "Sheamus Rourke",
                    "user_href": "/profile/Sheamus-Rourke"
                },
                {
                    "user_id": "Sherif Shaaban",
                    "user_href": "/profile/Sherif-Shaaban-3"
                },
                {
                    "user_id": "Ramisa Razi",
                    "user_href": "/profile/Ramisa-Razi"
                },
                {
                    "user_id": "Rozlynn Warren",
                    "user_href": "/profile/Rozlynn-Warren"
                },
                {
                    "user_id": "Alexandro Chen",
                    "user_href": "/profile/Alexandro-Chen"
                }
            ]
        },
        {
            "author_info": {
                "name": "Kathryn Kimball Johnson",
                "href": "/profile/Kathryn-Kimball-Johnson"
            },
            "answer_text": "Interesting question! When I write an article, it may be to earn money, but usually I’m not being paid for my time. I write articles because I want to help my readers learn something. And that something almost always has to do about writing fiction. So much has been written about how to write and publish a novel that it’s overwhelming. But, sadly, a lot of it is either impractical advice, misleading, or repetitive to the point of being boring. So I write articles in the same way that I teach my writing classes in DC. I show writers how to write their stories clearly, without a lot of clutter, using good basic English skills…while  emotionally bonding their readers with one or more characters in the story. Whenever an author writes an article, I think that, uppermost in their mind, there needs to be a dedication to revealing or teaching something of substance. ",
            "date": "Answered June 21, 2017",
            "views": "768",
            "upvotes": "0"
        }
    ]
}