{
    "title": "Why do so many people dream of writing a book? - Quora",
    "tags": [],
    "response": [
        {
            "author_info": {
                "name": "Penny Grubb",
                "href": "/profile/Penny-Grubb"
            },
            "answer_text": "Why do people want to write books? (thank you for the A2As) That partly depends on the type of books they write and the purpose of that type writing. People have been writing books, or things similar to books, for thousands of years. It is one of the key ways that we pass on knowledge and ideas from generation to generation. No single generation will progress significantly without standing on the shoulders of the previous ones. Some people write books to prevent their knowledge and experience from being lost. It’s kind of a way of achieving immortality. Writing in order to record and pass on knowledge and experience has been going on since the first human chalked on the first cave wall, but in modern times we have formalised this business of passing on knowledge in academic writing. It has become a lot more rigorous and useful. It is easier to tell the genuine from the sham, even if charlatans still occasionally slip through the net. Here’s a really neat soundbite: Q: What is the purpose of academic writing? A: It is to write something worth saying about something worth saying something about. Try unpacking that one. It’s good. It means what it says. Other types of writing have other purposes, and people want to do them for a variety of reasons. Many reasons revolve around money. Writing is a job. People do it to get paid and earn enough to live. Moving briefly away from books, it’s useful to compare the purpose of writing in different fields. Take tabloid journalism: the underlying immoveable purpose is to make money for the shareholders, thus the purpose of the writing is to pander to the prejudices of the target audience. Just think about that for a minute. THE PURPOSE OF THE WRITING IS TO PANDER TO THE PREJUDICES OF THE TARGET AUDIENCE. It’s not about truth; it’s not about campaigning; it’s not about fairness; it’s not about spreading knowledge – it could be any one of those things but it could equally (and often is) about lies, misleading, stirring up trouble, creating injustice, hiding the truth. Where good academic writing must name its sources, show credible evidence, look at a question in depth, look fairly at all sides including those that the writer disagrees with – good tabloid journalism often turns all that on its head. But the fact remains that a sensationalist and biased story with no evidence behind it is an easier read than a well-balanced and well-researched piece that goes into appropriate depth. Bear that in mind when reading newspapers. It’s always worth asking the question: Where is the evidence for that? On to fiction writing and novels. Why does anyone want to write novels? What are they for? In fact they overlap with the writing discussed above. They can be invaluable in passing on knowledge from generation to generation. These days we are much better at capturing and recording our own social history, but that wasn’t always the case. It tended to be the informal writings of the time (family letters, novels, …) that gave insights into people’s daily lives. Novels can still fulfil the purpose of providing valuable insights. They can bring to life the emotions of living, the drama of situations that the readers might never experience for themselves. Readers experience real emotions when they read fiction. Do you have trouble believing that people can experience real emotions about a situation they know is completely faked? Think about the cinema full of crying patrons as Bambi’s mother is killed. Every one of them knows that they are watching the simulated death of a line drawing, but they experience real emotion as they watch. The experience of real emotions in a situation is a route to understanding that situation, and understanding is a key part of the growth of human knowledge. Personally, I love that part of the creative process that brings a dramatic experience to life on the page. When I feel so scared I want to run away from the keyboard or find myself holding my breath as I write, then I know I’ve hit the right note. But is that why I want to write books? It’s part of it, but it wasn’t at the start because I couldn’t always do that. Finally getting to the nub of the question, and answering for me: Why do I want to write books? I’m almost stuck here. It’s sort of all the above, but it’s more. I can remember writing my first book. I was 4 years old. It was two sentences long and took half a page in one of those half-size exercise books. I no longer have it but I remember the protagonist was a cat. I recall that there was also a mat. I believe that that major action of the ‘book’ involved the cat sitting on the mat. It was a long time ago, and I just took it for granted that I would be a novelist. As things worked out, I wrote non-fiction books before my fiction was taken by a publisher. In fact it took about half a century from my decision to become a novelist to seeing my first novel in the bookshops. I’m glad that my books sell well enough for publishers to keep taking them but I don’t earn enough to give up the day job so I don’t really do it for the money. I love the challenge of unravelling mysteries – both when reading and writing – and it’s partly the challenge of that that keeps me wanting to write more, but not all the books I’ve written have been mysteries. Short answer: I want to write books more than I want not to write books, and I’m not sure I can unpack that very much more. ",
            "date": "Answered May 4, 2018",
            "views": "18",
            "upvotes": " View 2 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Nicolas Karnet",
                    "user_href": "/profile/Nicolas-Karnet"
                },
                {
                    "user_id": "Daniel Grubb",
                    "user_href": "/profile/Daniel-Grubb"
                }
            ]
        },
        {
            "author_info": {
                "name": "Angel Santiago",
                "href": "/profile/Angel-Santiago-8"
            },
            "answer_text": "There are a million different reasons or more, but I will share mine and hope it contributes something to the discussion.  I was inspired to write by a question I had thought of after meeting a rather interesting man in a Chinese food restaurant one day. He was filled with many interesting stories and a high level of knowledge I had only seen a handful of times before. After our conversation, I thanked him for his time and left to go about my business as young adults wont to do. Driving around that night alone I thought of this question that became the basis of my first novel to be published in April, To Be Forever. “If that man had known EVERYTHING there was to know about anything, what is one thing I would want the answer to?” I asked myself. “Eternal life!” I exclaimed one day. Then I thought. I thought long and hard for weeks on end. Hard. Constant reflection on this one question that was the result of my chance meeting with the man at the restaurant. After months of rumination, I decided I would write a book about it. A young adult meets an omniscient man who sends him off on a journey to discover the secret to eternal life. I wanted to write To Be Forever to find the answer to the question I had posed to myself close to 3 years ago now. I met a myriad of heroes and legendary figures throughout my time of writing To Be Forever. Many became the basis for some of the characters you will read about in each chapter. Cooks, Car salesmen, athletes, lovers, coaches, strangers, coworkers. To other people, they were just normal, but in my mind they were legendary. They all shared with me a few moments of their lives that affected me enough to wish to write about them and how they helped me find my answer. So that is all really, that is why I wrote To Be Forever and will continue writing in the future. Books are amazing. They become a tether to the eternal world that exists within the minds of others. When people read what you have written a little piece of you comes alive within them and that is a beautiful thing. ",
            "date": "Updated March 21, 2019",
            "views": "1",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Ranbir Ray",
                    "user_href": "/profile/Ranbir-Ray-4"
                },
                {
                    "user_id": "Genius Turner",
                    "user_href": "/profile/Genius-Turner"
                },
                {
                    "user_id": "Tom Clemans",
                    "user_href": "/profile/Tom-Clemans"
                },
                {
                    "user_id": "Rydia Shaw",
                    "user_href": "/profile/Rydia-Shaw"
                }
            ]
        }
    ]
}