{
    "title": "Why is Enid Blyton so popular in India but not in her own country, the UK? - Quora",
    "tags": [
        "The Barney Mystery",
        "The Family Adventures (book series) by Enid Blyton",
        "Malory Towers (book series)",
        "The Secret Seven (book series)",
        "The Famous Five (book series)",
        "Famous Five",
        "Enid Blyton (author)"
    ],
    "response": [
        {
            "author_info": {
                "name": "Harriet Stanton-Leaffer",
                "href": "/profile/Harriet-Stanton-Leaffer"
            },
            "answer_text": "For some reason the BBC (British Broadcasting Corporation) refused to broadcast her work from the 1930s until the 1950s because they claimed t lacked literary merit. Her books have been criticized as being elitist, sexist, racist, xenophobic and at odds with the more progressive environment emerging in post-Second World War Britain. Despite this boycott, her books continued to best-sellers since her death in 1968. It is interesting that they criticized her since she championed programs for the needy and was in every way someone they should have admired. It should be noted she gained prominence during a time that did not recognize women as equal. Some people just resent successful women. This mindset at its extreme, believes a woman should be a housewife, bearing children, not having a career, and groveling for approval from her husband.. Blyton felt she had a responsibility to provide her readers with a strong moral framework, so she encouraged them to support worthy causes. In particular, through the clubs she set up or supported, she encouraged and organized them to raise funds for animal and pediatric charities. Sounds noble to me. ",
            "date": "Answered September 19, 2020",
            "views": "10",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Scott Grundy",
                "href": "/profile/Scott-Grundy-4"
            },
            "answer_text": "Enid Blyton is still popular here in the UK, though unfortunately not with children. But her books are considered old fashioned and hark back to a time which has passed. Most children today have different interests than those of their grandparents, they are more interested today in staring at a mobile telephone screen than running around the countryside having “adventures” ",
            "date": "Answered August 23, 2020",
            "views": "22",
            "upvotes": "0"
        }
    ]
}