{
    "title": "Why do fanfiction writers so often write straight characters as gay? Why is slash fanfiction so popular? - Quora",
    "tags": [
        "Slash Fanfiction",
        "Fanfiction Writing",
        "Fanfiction",
        "Fictional Characters"
    ],
    "response": [
        {
            "author_info": {
                "name": "Gabriel Bell",
                "href": "/profile/Gabriel-Bell-18"
            },
            "answer_text": "Because back in the day there was almost no gay fiction - at least no on TV and not in books adapted from TV. Star Trek? No gay characters. Harry Potter? No gay characters. Alias? Star Wars? Gremlins? Charmed? No gay characters. Buffy was the first show I can remember to have a gay character on, and even that took a while to definitively make her gay. (And yes - I know she was bi, but you get what I mean). And - arguably - Xena, of course :) Even on most “kids” or “young adult” stuff now there is a reticence to show healthy gay relationships. It’s getting better, but still - the vast majority of stable relationships are straight, not gay. And in movies? Pfft. You might as well abandon that idea completely. So we make our own relationships. If you just look at Steve and Bucky, you KNOW there is something going on there. Jim and Harvey? Clearly. Hermione and Luna? You’d have to be blind not to see it. Cooper and Truman? Duh. Anyway. The point is even if none of these relationships are actually realistic, we can’t wait around for the authors/show runners to give us what we want, and they can’t stop us from doing what we want. And if they aren’t going to join us here in the 20th century, then that’s hardly our fault. (I know - it’s the 21st century, but they have a lot of catching up to do, and they only move so fast….) So - we take their characters, and we make them dance to our tune. Because the alternative is to create OCs and NO ONE wants that. Trust me - creating an OC for Ron to fall in love with will get you shunned. Much better for him to be doing the horizontal tango with Harry than with a new boy named Gary Stu :) ",
            "date": "Answered September 10, 2018",
            "views": "38",
            "upvotes": " View 24 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Emma-Louïse Minnaard",
                    "user_href": "/profile/Emma-Louïse-Minnaard"
                },
                {
                    "user_id": "Audrey Aurelia",
                    "user_href": "/profile/Audrey-Aurelia-5"
                },
                {
                    "user_id": "Olivia Marcus",
                    "user_href": "/profile/Olivia-Marcus-1"
                },
                {
                    "user_id": "Liona Squires",
                    "user_href": "/profile/Liona-Squires-2"
                }
            ]
        }
    ]
}