{
    "title": "Why can’t I tell people how I feel? I cannot open up to anyone, not my friends, or my family. I wish someone could know my emotions and thoughts without me having to tell them, but I hate opening up and even telling people about myself. - Quora",
    "tags": [
        "Interpretations of Human Behavior",
        "Understanding Emotions",
        "Social Advice",
        "Emotions",
        "Understanding Human Behavior",
        "Interpersonal Interaction"
    ],
    "response": [
        {
            "author_info": {
                "name": "Nick Kricheff",
                "href": "/profile/Nick-Kricheff"
            },
            "answer_text": "You should find a therapist who can help you break out of your self imposed emotional prison. Lots of people have trouble expressing their feelings, probably because they grew up in an environment in which it was not ok to openly speak your mind. Life is much better if we can tell people how we feel, and if we can accept how other people feel. Then, if there are conflicts, we can find a way to deal with them. Otherwise, we are forced to make guesses about what other people feel, and this can easily lead to misunderstandings. ",
            "date": "Answered February 10, 2019",
            "views": "2",
            "upvotes": " View 5 Upvoters",
            "upvoters": [
                {
                    "user_id": "Salwa Komalasari",
                    "user_href": "/profile/Salwa-Komalasari"
                },
                {
                    "user_id": "Alberto Garcia",
                    "user_href": "/profile/Alberto-Garcia-102"
                },
                {
                    "user_id": "Rachel Ng",
                    "user_href": "/profile/Rachel-Ng-83"
                },
                {
                    "user_id": "Nur Laila Husna",
                    "user_href": "/profile/Nur-Laila-Husna"
                },
                {
                    "user_id": "Anshul Shukla",
                    "user_href": "/profile/Anshul-Shukla-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Michael Gholson",
                "href": "/profile/Michael-Gholson-1"
            },
            "answer_text": "Find someone who will care enough to listen & someone you are comfortable with. Granted that's challenging to find both qualities in a person like that, but they are out there. in the mean time find a counselor, or call a hotline. We are not built to go through struggles alone. You have to “vent” & open up. not sure if you enjoy exercising, but that is good therapy too…. Best of luck… you got this!!! ",
            "date": "Answered February 11, 2019",
            "views": "615",
            "upvotes": "0"
        }
    ]
}