{
    "title": "Why are some patents called 'bad patents'? - Quora",
    "tags": [
        "Patentability",
        "Patent Law",
        "Patents",
        "Intellectual Property Law",
        "Intellectual Property"
    ],
    "response": [
        {
            "author_info": {
                "name": "Stéphane Touzé",
                "href": "/profile/Stéphane-Touzé"
            },
            "answer_text": "Also, if the claims are too narrow, your patent may be effectively useless as competitors could easily circumvent them by designing around it. It's usually best to err on the side of broadness for better, wider protection. For example, in mechanics notably, \"bad patents\" tend to focus on structure rather than on functions. However, claims that are too broad are potentially less likely to be granted. Also, competitors may apply for patents to protect for their specific embodiment of your invention, rendering your patent useless in practice. So it is often a trade-off. And it is hard to get the right balance, partly because patent infringement lawsuit outcomes are hard to predict. More generally, a \"bad\" patent could mean different things depending on your position on the market and what you want to achieve with your IP. ",
            "date": "Answered December 16, 2014",
            "views": "757",
            "upvotes": " View 5 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Prem Rishi",
                    "user_href": "/profile/Prem-Rishi"
                },
                {
                    "user_id": "Tommy Nolan",
                    "user_href": "/profile/Tommy-Nolan-1"
                },
                {
                    "user_id": "Dennis Levy",
                    "user_href": "/profile/Dennis-Levy"
                },
                {
                    "user_id": "Omprakash Bisen",
                    "user_href": "/profile/Omprakash-Bisen"
                },
                {
                    "user_id": "Samrat Sekhar Saha",
                    "user_href": "/profile/Samrat-Sekhar-Saha"
                }
            ]
        },
        {
            "author_info": {
                "name": "Bhaskar Dutta",
                "href": "/profile/Bhaskar-Dutta-15"
            },
            "answer_text": "Bad patents are the ones that can be easily circumvented .. that is, the claims are so narrow that it may not be enough to stop others from using the technology till the patent expires. Bad patents are also ones that has too broad claims (if at all they are granted) as such patents can be easily challenged and invalidated. Patents are granted if the invention is novel, inventive and has utility (in some countries, industrial application is also desired). So, if you feel certain patents are bad just because they seem stupid at the first glance, it may not be so. For example, patents on butt spanking machine or cat exersizers may generate a good laugh but these can be sellable products. Once the patents like gorilla glass, velcro were also laughed upon when they were first granted, but now they have a huge market to encash. ",
            "date": "Answered October 27, 2020",
            "views": "29",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Kristen Griessmann",
                    "user_href": "/profile/Kristen-Griessmann"
                }
            ]
        }
    ]
}