{
    "title": "Why do people from Quebec speak French? - Quora",
    "tags": [
        "Québécois (French dialect)",
        "Québec (province)"
    ],
    "response": [
        {
            "author_info": {
                "name": "Bertrand Feuvray",
                "href": "/profile/Bertrand-Feuvray"
            },
            "answer_text": "People in Quebec speak French because it was the main language of Canada. Furthermore, French speakers were the majority in Canada until 1830 when British immigration began to outnumber French Speakers in Canada except Quebec. When France lost its North American colonies: Louisiana--East and West of the Mississippi river and New France--now Quebec, the French under British rules were valued by the British because they wanted to use them against the American colonists who--the colonists-- eventually broke away from Britain.In order to convince the French Canadians to support Britain, Britain told them that the two things that Britain would allow French speakers to keep and these two things were things that would not be allowed by the American colonists to be kept because everywhere they--American colonists-- went they outnumbered anyone else who were not English Speaking. There are no place the size of Quebec in the USA today where the language of the majority in any state is French. In Louisiana, it ceased to be the language of the majority for a long time due to English Speaking American immigration. It is only taught in school in Louisiana because it is part of the State of Louisiana's heritage. Whether the majority of Louisianan take it in school I do not know but if I had to take an educated guess, I am pretty sure that with choices around to also take Spanish and other languages, French would be only chosen by a small number probably connected to the Cajuns by ancestry.Understanding that the French Catholic religion and the French language would survive while Quebec was in British hands, French Canadians accepted what Britain offered them, and the British and later Canadian governments kept their promise. No other British dependency or colony ever was involved in such a deal and was able to keep their language like French in Quebec. In two wars against the USA--American Revolution and the War of 1812, French Canadians fought for the British but only to defend their lands in Canada and never to invade and take lands from the Americans. Due possibly to their Dream of Freedom, you can tell from that that they were not anti-American but that they just could not join them--the Americans-- because the price would be too high. But the attraction for the USA is still present in their minds today. ",
            "date": "Answered January 31, 2018",
            "views": "119",
            "upvotes": " View 16 Upvoters",
            "upvoters": [
                {
                    "user_id": "Ovide Vongerlier",
                    "user_href": "/profile/Ovide-Vongerlier"
                },
                {
                    "user_id": "Ed Mercier",
                    "user_href": "/profile/Ed-Mercier-1"
                },
                {
                    "user_id": "Nancy Juby",
                    "user_href": "/profile/Nancy-Juby-1"
                },
                {
                    "user_id": "Eric Petitclerc",
                    "user_href": "/profile/Eric-Petitclerc"
                },
                {
                    "user_id": "Ally Hinckley",
                    "user_href": "/profile/Ally-Hinckley-1"
                },
                {
                    "user_id": "Jean Deschenes",
                    "user_href": "/profile/Jean-Deschenes-3"
                },
                {
                    "user_id": "Anir Ban",
                    "user_href": "/profile/Anir-Ban-13"
                },
                {
                    "user_id": "Lucie Favreau",
                    "user_href": "/profile/Lucie-Favreau"
                },
                {
                    "user_id": "Andrei Stefanescu",
                    "user_href": "/profile/Andrei-Stefanescu-3"
                },
                {
                    "user_id": "Danielle Salomon",
                    "user_href": "/profile/Danielle-Salomon-2"
                }
            ]
        },
        {
            "author_info": {
                "name": "Neo Svensson",
                "href": "/profile/Neo-Svensson"
            },
            "answer_text": "Canada was originally part of the French colony known as New France until the British defeated France in The Seven Years War. In the American theatre of that war which was know as the French and Indian War the British ultimately conquered Canada. The decisive victory for England came during the Battle of the Plains of Abraham in which the English crushed the much less disciplined and competent French army and successfully captured Quebec City, the capital of New France. It was a pivotal battle in the Seven Years War. Once the British had defeated France in Seven Years War. In the The Treaty of Paris France formerly ceded Canada and all of New France to Britain. France thereby lost all of its territory in mainland North America. Retaining only a couple of small Islands off the coast of Newfoundland. The following map shows French territory in North America in blue prior to their losing all of it to England after England defeated them in The Seven Years War   Map showing British territorial gains following the Treaty of Paris in pink With the addition of Canada to the British Empire, Britain gained the strip of territory along the St. Lawrence River that had a population of at nearly 70,000 francophone Roman Catholics, this territory was expanded and renamed as the Province of Quebec under the British North America (Quebec) Act 1774 The French population in Quebec was later given concessions by the British outlined in the British North America (Quebec) Act 1774 which gave French Canadians the right to maintain their French language, keep their Catholic religion as well as their French system of civil law. This is the reason they still speak French in Quebec. ",
            "date": "Updated May 18, 2019",
            "views": "19",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Ovide Vongerlier",
                    "user_href": "/profile/Ovide-Vongerlier"
                },
                {
                    "user_id": "Edu Romero",
                    "user_href": "/profile/Edu-Romero-1"
                },
                {
                    "user_id": "Danielle Salomon",
                    "user_href": "/profile/Danielle-Salomon-2"
                }
            ]
        }
    ]
}