{
    "title": "Why was the ballpoint pen invented? - Quora",
    "tags": [
        "Ballpoint Pen",
        "Ink",
        "Pens"
    ],
    "response": [
        {
            "author_info": {
                "name": "Lance Conway",
                "href": "/profile/Lance-Conway-3"
            },
            "answer_text": "Invention History (light)Until the ballpoint pen was invented by Mr. Loud an attorney in 1888 and though this was the first patented ballpoint pen (would not write on smoother surfaces like paper) it was not until 1941 when in Germany Mr. Biro created the commercially viable ballpoint pen that was actually made in Argentina. Why we have a ballpoint penThe reason for this invention was a lack of portability and fabric ink staining, the ink which notably clogged and always leaked. This issue allowing another early fountain pen inventor to create a sealed plug or protective cover for the pen nib of the fountain pen during transport, this invention later became known as the pen cap, It was the ink leaking issue caused by the fact that ink is capillary in its method of flow creating a solution was still in need, the ballpoint pen solved the issue of the day, ink would no longer leak if a small metal ball placed in a metal nose or cone attached to the ink reservoir or containment vessel would need to roll and or have pressure applied to it between the pen ball and a surface to distribute the ink, ending the leaking pen ink issue (for the most part) that we each enjoy currently. ",
            "date": "Answered June 16, 2018",
            "views": "621",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Ayu Nazrah",
                    "user_href": "/profile/Ayu-Nazrah"
                },
                {
                    "user_id": "Don Eidson",
                    "user_href": "/profile/Don-Eidson"
                },
                {
                    "user_id": "Misha Shauli",
                    "user_href": "/profile/Misha-Shauli-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Priyank Sharma",
                "href": "/profile/Priyank-Sharma-127"
            },
            "answer_text": "Before L. Biro invented ball pen, peeps had fountain pens under their hands. Now the need for inventing ball pen was both cons of FPs and pros of BPs. Actually, before L. Biro, John Loud invented a ball pen because he wanted a pen that could write on leather. But that wasn't commercially viable and thus he is not credited for the invention.FPs required maintenance and lot of time while BPs are easy to use.FPs leaked very often (especially in today's context, while air travelling) while there are very little chances of leakage in a ball pen if at all.Ball pens write fine on a wide range of paper quality while it is not the case with FPs.One needs to dry the ink after writing with a fountain pen.There are a lot of other positives of ball pens. I personally think it's one of the wisest inventions till date. FACT: China couldn't manufacture ball pen nibs till 2017 as they didn't have the technology. ",
            "date": "Updated August 2, 2018",
            "views": "623",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Jacziri Rosales-Solis",
                    "user_href": "/profile/Jacziri-Rosales-Solis"
                },
                {
                    "user_id": "Vinita Sharma",
                    "user_href": "/profile/Vinita-Sharma-112"
                },
                {
                    "user_id": "Jinay Keniya",
                    "user_href": "/profile/Jinay-Keniya"
                }
            ]
        }
    ]
}