{
    "title": "Why do writers write? - Quora",
    "tags": [
        "Creative Writing",
        "Writers and Authors"
    ],
    "response": [
        {
            "author_info": {
                "name": "Jennifer Montgomery",
                "href": "/profile/Jennifer-Montgomery-23"
            },
            "answer_text": "A writer has a story to tell. Whether it's a stream of thousands of thoughts being penciled into a journal or an epic confrontation between good and evil they conjured up in their minds. The story must be written to be told. A writer may want to write to capture an audience, so they can bring passengers to experience the world they created. A writer may write to build a new universe, making this new place a sanctuary where their hopes and dreams have endless possibilities of being realized. A writer may write for clarity of the mind and subconscious. Keeping a journal of their thoughts, or each dream they dream, or a memory they see in a new light. Understanding who they are being the ultimate goal of their words. Words put our thoughts into a physically digestible language. Without them, our thoughts remain our own. Conversation has its merits, but really who wants to sit in front of someone for hours at a time while they widdle out an epic fantasy about a gun toting dragon with a mysterious past. Write it in a book, however. Then you release people from an obligation to sit there patiently while you change the plot several times within the hour (because talking is so fluid, it's hard to keep on track). Writing words, are thoughts solidified into stone. The fluidity of talk is gone, each word is carefully set like a gemstone into a gold necklace; it needs to fit in perfectly to achieve appeal for the wearer- or in this case, the reader. If it's not an engaging experience, the reader has the choice to throw your words into a dung heap, or put them in a place of honor. You. The writer will never fully know how your words are received once they are made available for public consumption. Perhaps it is better that way. It's up to the writer to make sure that their words match what they meant in their mind. A difficult task when you consider how messy our thoughts can be! Writing is a process of extracting thoughts, polishing them, and setting them down to be read. The reasons for doing so, will be unique to each individual author. ",
            "date": "Answered January 24, 2019",
            "views": "531",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Tabitha Deeks",
                    "user_href": "/profile/Tabitha-Deeks"
                },
                {
                    "user_id": "Mark Hamric",
                    "user_href": "/profile/Mark-Hamric"
                },
                {
                    "user_id": "Anne Benzow",
                    "user_href": "/profile/Anne-Benzow"
                }
            ]
        },
        {
            "author_info": {
                "name": "Lina Safarulla",
                "href": "/profile/Lina-Safarulla"
            },
            "answer_text": "The answer to this question changes for writers in their various phases of writing, and there is never a constant answer to why writers write. I started writing when I was very, very young, right after I could frame coherent words from the letters I learnt at school. I have a little collection of absurd tales that I wrote back then, which do not make any sense anymore, but are still hilarious reads! I also cannot understand why I chose to write down the weird thoughts inside my brain when I could just talk to people. When I was in my early teenage, I joined Wattpad. This was one turning point in my writing life. I wrote books, and I had quite a few readers, who gave me honest opinions about what I wrote. I also read other people's works and made some friends for life. Life was good, until time went by and I grew more and more attached to writing. The attachment grew insane to this point that I was writing 24/7. In class, at home, even in the car, even when I was having a conversation with people, I happened to be writing inside my head. I was always describing things inside my head rather than naming them, and always observing people like they could inspire a potential character in my book. :P I eventually got rather addicted to writing and reading, and could not think about a life without them. I could not imagine doing anything else for a living, and also had no idea if there was even anything else that I was remotely good at. It felt nice to be sitting in front of my computer at midnight and just typing forever. When I woke up in the morning and read what I wrote again, they did not make much sense. That did not stop me at all, and I continued to spend all my midnights writing about this beautiful imaginary euphoric world inside my head. This was again only a passing phase in my writing life. As time went by, I found an inclination towards other things such as science and psychology and slowly grew less addicted towards writing. Thank the good gods, or I think it would have driven me insane. xD I cannot write like I used to, anymore. Words do not flow the same way, the stories do not form by themselves and I also do not feel the strong urge to write all the time. But I still write, because it feels good. It is one of the most comforting things in the world to do. Its my favourite companion forever, and my escape door from reality. I don't know if I would ever complete the books that I have worked a lot on, or publish them, or even go back and read them again but I would always keep writing. Writing is love. ",
            "date": "Answered May 22, 2018",
            "views": "15",
            "upvotes": " View 7 Upvoters",
            "upvoters": [
                {
                    "user_id": "Jennifer Montgomery",
                    "user_href": "/profile/Jennifer-Montgomery-23"
                },
                {
                    "user_id": "James Marti",
                    "user_href": "/profile/James-Marti-2"
                },
                {
                    "user_id": "Jennifer Yorke",
                    "user_href": "/profile/Jennifer-Yorke-3"
                },
                {
                    "user_id": "John Sam",
                    "user_href": "/profile/John-Sam-36"
                },
                {
                    "user_id": "Nalini Chandran",
                    "user_href": "/profile/Nalini-Chandran-3"
                },
                {
                    "user_id": "Antony Sandeep Babu",
                    "user_href": "/profile/Antony-Sandeep-Babu"
                },
                {
                    "user_id": "Junaid Anshad",
                    "user_href": "/profile/Junaid-Anshad"
                }
            ]
        }
    ]
}