{
    "title": "Why, largely in scientific literature, is 'on' placed before a title that could stand alone (i.e. On the Origin of Species)? - Quora",
    "tags": [
        "Scientific Research",
        "Research"
    ],
    "response": [
        {
            "author_info": {
                "name": "Gareth Jones",
                "href": "/profile/Gareth-Jones-59"
            },
            "answer_text": "I think this goes back to Roman times. When Lucretius wanted to write about atomic theory (and a few other topics), he called his work “De Rerum Natura.” That is, “On the Nature of Things.” Or, if that’s not clear enough, you could translate it verbosely as “Some stuff about the nature of things.” That title leaves open the possibility that other writers could come along and write some different stuff about the nature of things. When Copernicus wrote his great book about the solar system, he called it De revolutionibus orbium coelestium (On the Revolutions of the Celestial Spheres). Francis Bacon’s essays have names like “On Truth” and “On Death,” so the tradition extended into the English language. I think it was entirely natural for Darwin to name his book “On the Origin of Species.” He had about two thousand years of tradition to follow. Interestingly, however, he didn’t follow the same tradition in “The Descent of Man,” “The Expression of Emotion in Man and Animals,” or “The Power of Movement of Plants.” ",
            "date": "Answered July 17, 2016",
            "views": "202",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Nick Nicholas",
                    "user_href": "/profile/Nick-Nicholas-5"
                },
                {
                    "user_id": "Jim Nail",
                    "user_href": "/profile/Jim-Nail"
                }
            ]
        },
        {
            "author_info": {
                "name": "John Knight",
                "href": "/profile/John-Knight-19"
            },
            "answer_text": "Calling the book \"The origin of species\" would have made it seem more authoritative and definitive. \"On the origin of species\" was more like \"Some aspects  of ...\", and I believe the choice of title reflected Darwin's natural caution and modesty. ",
            "date": "Answered April 11, 2016",
            "views": "108",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Willy Whabit",
                    "user_href": "/profile/Willy-Whabit"
                },
                {
                    "user_id": "Barry Rountree",
                    "user_href": "/profile/Barry-Rountree"
                },
                {
                    "user_id": "Alan Wu",
                    "user_href": "/profile/Alan-Wu-13"
                }
            ]
        }
    ]
}