{
    "title": "Will it help me to read difficult books with unfamiliar vocabulary to improve my vocabulary? - Quora",
    "tags": [
        "English Language Vocabulary Development",
        "Vocabulary Development",
        "Words",
        "English Word Definitions, Terminology, and Jargon",
        "English as a Second Language (ESL)",
        "Learning English"
    ],
    "response": [
        {
            "author_info": {
                "name": "Robert Charles Lee",
                "href": "/profile/Robert-Charles-Lee"
            },
            "answer_text": "No -- but virtue of the fact that the books are difficult for you and that the unfamiliar words won't likely be familiar to you or anyone else. A less risky option with better performance gains is to read more and widely at your own proficiency level first. The vocabulary and usage patterns at one proficiency level will 'stage' (prepare) you for the next level up. Reading beyond your level is like running before learning to walk. If you are a learner (especially a non-native language learner) and perhaps still studying, there are two proven resources to increase language proficiency: - Graded readers are books (usually classic novels and non-fictions) that are designed for reading at certain proficiency levels. As said already, they stage the reader for the next level up. The two famous publishers of graded readers are Penguin and Longman (Pearson). - Audiobooks have the advantage of native language pronunciation in a book-style delivery. This will help the person pronounce and enunciate words like a native speaker, while the delivery remains easy enough to follow like reading a book. Hope this is what you're asking for. ",
            "date": "Answered June 1, 2015",
            "views": "527",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Will Braun",
                    "user_href": "/profile/Will-Braun-3"
                }
            ]
        },
        {
            "author_info": {
                "name": "Richa Verma",
                "href": "/profile/Richa-Verma-14"
            },
            "answer_text": "As much as one thinks that it could work, it doesn't. It gets really annoying to frequently look up the meanings of those difficult words. You may try one of these two things : 1. Reading such texts on an ebook reader that has a built in dictionary feature. It lets you tap on any word and shows it's meaning while you stay on the same page. It'll make the learning process a lot easier for you, as it has made mine. 2.You may find and read books that challenge you somewhat. The ones that you understand mostly while reading but carrying some difficult words for you to learn. But again, presence of too many such words is bound to put you off eventually. So take your pick carefully! Have fun reading! :) ",
            "date": "Answered June 2, 2015",
            "views": "409",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Shubham Devikar",
                    "user_href": "/profile/Shubham-Devikar"
                },
                {
                    "user_id": "Shefali Gupta",
                    "user_href": "/profile/Shefali-Gupta-26"
                },
                {
                    "user_id": "Akshay Jain",
                    "user_href": "/profile/Akshay-Jain-99"
                }
            ]
        }
    ]
}