{
    "title": "Will there ever be a writer that surpasses Shakespeare? - Quora",
    "tags": [
        "Plays",
        "Novelists",
        "Fiction Writing",
        "Novel Writing",
        "William Shakespeare",
        "Book Writing",
        "Novels",
        "Writers and Authors",
        "Literature",
        "Writing"
    ],
    "response": [
        {
            "author_info": {
                "name": "Nicu Obsescu",
                "href": "/profile/Nicu-Obsescu"
            },
            "answer_text": "Remember this: “Diane was right. The world is changing, music is changing,drugs are changing, even men and women are changing. One thousand years from now there’ll be no guys and no girls, just wankers. Sounds great to me. It’s just a pity no one told Begbie.” - Ewan McGregor as Mark Renton in Trainspotting. The ideea is the same as Stuart McCormack explained in his answer in another manner: Shakespeare “climbed the hill” available back then, at the end of 16th century and the begining of the 17th century, but there are other “hills”, because the “hills” of Elisabethan Renaissance are “stuck” back then in the 16th-17th century… In my opinion James Joyce already did that, he “climbed” a much more steep and high “hill” with his intertextualist and trans-linguistic poetical prose, an image of stream of consciousness built with words. Some answer stated that literature is dying, that’s wrong, literature isn’t dying, it’s changing, like Diane said. Have you ever heard of hyperliterature? A text that is mixing as the reader chooses to click a word or another? Or have you ever heard of Raymond Queneau - Hundred Thousand Billion Poems ? Of course, he is french…, see how his book look like:  This gives the reader a 100,000,000,000,000 different poems out of 10 sonnets… Shakespeare wrote 154 sonnets…, can Shakespeare surpass himself with the help of a publisher and make infinite poems in Raymond Queneau method? Well…, no… Raymond Queneau method is copyrighted and Raymond Queneau studied those 10 sonnets to fit the purpose… See? Diane was right. Good luck! ",
            "date": "Answered March 5, 2020",
            "views": "22",
            "upvotes": " View 56 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Jude Collins",
                    "user_href": "/profile/Jude-Collins-1"
                },
                {
                    "user_id": "Jonas O. Pereira",
                    "user_href": "/profile/Jonas-O-Pereira"
                },
                {
                    "user_id": "Divyansh Dubey",
                    "user_href": "/profile/Divyansh-Dubey-14"
                },
                {
                    "user_id": "Gaurav Karki",
                    "user_href": "/profile/Gaurav-Karki-21"
                },
                {
                    "user_id": "Philipp Krüger",
                    "user_href": "/profile/Philipp-Krüger-9"
                },
                {
                    "user_id": "Edward Taylor",
                    "user_href": "/profile/Edward-Taylor-257"
                },
                {
                    "user_id": "Malhar Patel",
                    "user_href": "/profile/Malhar-Patel-51"
                },
                {
                    "user_id": "Orit Zehavi Bergman",
                    "user_href": "/profile/Orit-Zehavi-Bergman"
                },
                {
                    "user_id": "Mike Yost",
                    "user_href": "/profile/Mike-Yost-8"
                },
                {
                    "user_id": "Harvey Silva",
                    "user_href": "/profile/Harvey-Silva-3"
                }
            ]
        },
        {
            "author_info": {
                "name": "Stan Hayward",
                "href": "/profile/Stan-Hayward-1"
            },
            "answer_text": "No............................................................because 'Writing' is, itself, disappearingand being replaced by images, sounds, texting, Acronyms, emojis, Informatics, icons, signs, signals, and telepathy Also, a great many people who praise Shakespeare don't actually understand himActors like him because his words are beautiful to speak, having been written in Iambic pentameters iambic pentameter   but few actors actually understand the philosophy of his statements Also, Shakespeare is a business. Many people have a vested interest in promoting him. And the fact that there are so many people who supposedly wrote his plays provides evidence that others were compared equally to him     who wrote Shakespeare's poetry and plays It has also been proposed that an infinite number of monkeys typing for infinity would eventually produce all of Shakespeare's works. Who knows what other masterpieces they might create in the process?      infinite number of monkeys   It is, of course, well known that he was a great plagiarist. But that should not detract from his reputation as it is a common trait among writers How many people today have even heard of Michel Eyquem de Montaigne? yet some scholars have favorably compared him to Shakespeare     Michel Eyquem de Montaign It was also reported in the News this week that Shakespeare's head is missing from his grave        shakespeare's missing head - Google Search Conspiracy theories suggest that Shakespeare never had a head. and that aliens have a set of 'genius' heads they move around to test out humanity to see how it responds to advanced ideas It is possible that Elon Musk currently has one of them, or even Donald Trump might be using a beta version of a cheaper model Anyway, in regard to the question, there will never be a better writer than Shakespeare who can make words come so trippingly off the tongue, but there might well be someone who can distill the essence of our thoughts into aromatic philosophies ",
            "date": "Answered April 5, 2016",
            "views": "992",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Lynne Perry",
                    "user_href": "/profile/Lynne-Perry-1"
                },
                {
                    "user_id": "Sheri Fresonke Harper",
                    "user_href": "/profile/Sheri-Fresonke-Harper"
                },
                {
                    "user_id": "Jesse Itskowitz",
                    "user_href": "/profile/Jesse-Itskowitz"
                }
            ]
        }
    ]
}