{
    "title": "Will Paul McCartney ever write his autobiography? - Quora",
    "tags": [
        "Autobiographies",
        "Paul McCartney",
        "The Beatles (band)",
        "Musicians"
    ],
    "response": [
        {
            "author_info": {
                "name": "Andres Sanchez Badia",
                "href": "/profile/Andres-Sanchez-Badia"
            },
            "answer_text": "He just recently answered that same question on a Q&A. Been trying to find the link but couldn't been able to locate it.  He basically said that he does not plan it, since more than enough books have been written about him and The Beatles. He would only plan to write some memories about unpublished and publicly-unknown facts if he can manage to have some spare time, which, as of now, he does not have and does not plan to have. I believe it will be a matter of how long he lives vs how much more time can he perform at his actual level. If he continues like this until his last days -which I hope is the case- I don't think he will write his autobiogaphy. However, if he stops performing or start losing ability/voice I do think he will start writing his autobiography. ",
            "date": "Answered March 10, 2015",
            "views": "11",
            "upvotes": " View 5 Upvoters",
            "upvoters": [
                {
                    "user_id": "Chuck Rider",
                    "user_href": "/profile/Chuck-Rider"
                },
                {
                    "user_id": "Christine Thompson",
                    "user_href": "/profile/Christine-Thompson-29"
                },
                {
                    "user_id": "Deniz Şuözer",
                    "user_href": "/profile/Deniz-Şuözer-1"
                },
                {
                    "user_id": "Stephen Wright",
                    "user_href": "/profile/Stephen-Wright-114"
                },
                {
                    "user_id": "Curt Bourque",
                    "user_href": "/profile/Curt-Bourque"
                }
            ]
        },
        {
            "author_info": {
                "name": "Patricia Edwards",
                "href": "/profile/Patricia-Edwards-102"
            },
            "answer_text": "One would hope because there are questions only he and John can really answer and John's not talking unless some hidden secret journal is discovered in the Dakota or a previous residence one day. Maybe Aunt Mimi’s old house in Liverpool. I don't really think Paul will, he's much more proper than John much less likely to dish the dirt. But he may as his mortality looms ever closer, I believe most of humankind has an instinctual sense to get off our chest one way or another if given the time and opportunity. ",
            "date": "Answered September 18, 2018",
            "views": "260",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Michael Bradley",
                    "user_href": "/profile/Michael-Bradley-28"
                }
            ]
        }
    ]
}