{
    "title": "Would you like a love letter to you? - Quora",
    "tags": [
        "Love Letters",
        "Love"
    ],
    "response": [
        {
            "author_info": {
                "name": "Halina Towalska",
                "href": "/profile/Halina-Towalska"
            },
            "answer_text": "Hi, my love, Before I drop a few lines about love in this day of lovers, I should thank you for been there for me by this occasion. Life without love is like a tree without blossoms or fruit, Inside the heart of each and every one of us there is a longing to be understood by someone who really cares. When a person is understood, he or she can put up with almost anything in the world The heart is the place where we live our passions. It is frail and easily broken, but wonderfully resilient. There is no point in trying to deceive the heart. It depends upon our honesty for its survival From every human being there rises a light that reaches straight to heaven. And when two souls that are destined to together find each other, their streams of light flow together, and a single brighter light goes forth from their united being. The moment you have in your heart this extraordinary thing called love and feel the depth, the delight, the ecstasy of it, you will discover that for you the world is transformed. I am sending you this mail with deep faith in God which I know will reach you in a total excellent health condition, We all know what constitutes loving behavior; we need but act upon it, not continually question it. Over-analysis often confuses the issue and in the end, brings us no closer to insight. We sometimes become too busy classifying, separating, and examining, to remember that love is easy. Love cannot endure indifference. It needs to be wanted. Like a lamp, it needs to be fed out of the oil of another's heart, or its flame burns low. It's we who make it complicated, however, I have all it takes in making out my we all need each other to share our sorrowful and joyful moment with two both, and we will be there at the moment of trial, at the moment of pain and leisure activities. However being deeply loved by you gives me strength; loving you deeply gives me courage, Really, love is the master key that opens the gates of happiness. The supreme happiness in life is the conviction that we are loved. I love you, with wet kisses. ",
            "date": "Answered July 14, 2019",
            "views": "75",
            "upvotes": "0"
        }
    ]
}