{
    "title": "Would you be interested in giving feedback to my poetry? Link attached below. - Quora",
    "tags": [
        "Feedback",
        "Poems",
        "Poetry",
        "Literature",
        "Writing Advice"
    ],
    "response": [
        {
            "author_info": {
                "name": "Nidhi Patel",
                "href": "/profile/Nidhi-Patel-169"
            },
            "answer_text": "You poem has a great concept. I understood what you were trying to say but you lost me twice in the middle. It was merely because of the punctuation in the end of the sentences. We walk together as long as we can. After this there is a comma to which I thought, the next line is in continuation but the next line is infact a different idea and not in a way supporting the first..I understand the feeling that you were trying to portray but it took me off from the flow of the poem.Relived at its departure…. and hoping…Idk. I am not able to put my finger on why I went off but I did and wanted to point it out to you!And hey- I enjoyed the poem. Its beautiful. It speaks of acceptance of ones’ self and that is of utmost importance. The above are just my views.. ",
            "date": "Answered July 9, 2020",
            "views": "67",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Srishti Bhat",
                    "user_href": "/profile/Srishti-Bhat-6"
                }
            ]
        },
        {
            "author_info": {
                "name": "Aunwan Shabroo",
                "href": "/profile/Aunwan-Shabroo"
            },
            "answer_text": "Writing poetries provide amusement, joy and extreme delight. An eloquent poet goes in the depth of every character which he/she is going to narrate. You have done the same. You have used the narration to beautifully describe the togetherness with unimaginable points. The use of poetic devices like the shattered glass, vase and storm has been beautifully represented. Try more and you will be improving more. But for now, limited comments. Go ahead, pour your thoughts out. ",
            "date": "Answered July 10, 2020",
            "views": "25",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Srishti Bhat",
                    "user_href": "/profile/Srishti-Bhat-6"
                }
            ]
        }
    ]
}