{
    "title": "Would you be able to walk if you severed your femoral artery? - Quora",
    "tags": [
        "Critical Care",
        "Circulatory System",
        "Anesthesiology",
        "Medicine and Healthcare"
    ],
    "response": [
        {
            "author_info": {
                "name": "Lou Davis",
                "href": "/profile/Lou-Davis"
            },
            "answer_text": "Possibly. Blood loss in a completely severed femoral artery would be profound and clinical signs of shock would manifest quickly. It may well be possible to walk a few steps whilst maintaining pressure on the bleeding point. A child in the UK died after being attacked in 2008. Immediately after the incident, he was able to run to a nearby stairwell where he collapsed with an incised wound to his thigh. Death of Damilola Taylor Various studies, have demonstrated that death is a relatively uncommon sequelae of Femoral Artery Injury - with figures often around 10%. Equally significant is the risk of amputation - sometimes due to the vascular injury, occasionally due to the severity of concomitant bony injury.Acute trauma of the femoral artery and vein. An overview of Femoral Artery Injury is presented here:Page on khansacme.org The most common presentations of injury in our department are due to stab wounds - usually as the result of a violent encounter. We also occasionally see this injury in patients following motorcycle accidents, often associated with pelvic fractures where the patient has not attempted to mobilise. ",
            "date": "Answered April 16, 2014",
            "views": "41",
            "upvotes": " View 6 Upvoters",
            "upvoters": [
                {
                    "user_id": "Evan Lenkowsky",
                    "user_href": "/profile/Evan-Lenkowsky"
                },
                {
                    "user_id": "Harriet Miller",
                    "user_href": "/profile/Harriet-Miller-1"
                },
                {
                    "user_id": "Jeremy Miles",
                    "user_href": "/profile/Jeremy-Miles"
                },
                {
                    "user_id": "Ahmed Zain",
                    "user_href": "/profile/Ahmed-Zain-5"
                },
                {
                    "user_id": "Madeleine Bolger",
                    "user_href": "/profile/Madeleine-Bolger"
                },
                {
                    "user_id": "Michael Levis",
                    "user_href": "/profile/Michael-Levis"
                }
            ]
        },
        {
            "author_info": {
                "name": "Donald Loughlin",
                "href": "/profile/Donald-Loughlin"
            },
            "answer_text": "A severed femoral artery, left untreated, will ultimately result in death from exsanguination. In general most dead people are unable to walk. Prompt treatment and repair of a severed femoral artery, would restore full function, baring other injuries. Original question: Would you be able to walk if you severed your femoral artery? ",
            "date": "Answered February 29, 2020",
            "views": "100",
            "upvotes": "0"
        }
    ]
}