{
    "title": "Would a 45,000 word manuscript be considered a novel or a novela? - Quora",
    "tags": [
        "Novelas",
        "Word Counts",
        "Manuscripts",
        "Novel Writing",
        "Book Publishing",
        "Creative Writing",
        "Novels",
        "Writing Advice",
        "Writing"
    ],
    "response": [
        {
            "author_info": {
                "name": "Walter D. Petrovic",
                "href": "/profile/Walter-D-Petrovic-1"
            },
            "answer_text": "There is so much argument over this question but it has usually been that any novel that is 55,500 to 60,000 words (which is about 200 pages, depending if you consider a manuscript page 250 or 300 words per page), as a NOVELLA. A quick Google of 45,000 words had the following pop-up as the first result: “75 pages is 37,500 words single spaced, 18,750 words double spaced. 80 pages is 40,000 words single spaced, 20,000 words double spaced. 90 pages is 45,000 words single spaced, 22,500 words double spaced. 100 pages is 50,000 words single spaced, 25,000 words double spaced.” Based on just this, I would say that my answer is probably the closer to what is true. Today, with the sheer amount of Independently published books that are available, and since many are sold as eBooks, the comfortable fiction size is about 45,000 words, which would be a novella. Why are there more novella eBooks than regular novels? People need something, besides games, to keep them amused if they are commuting to work via bus or rail, or to have something mentally stimulating during their lunch break. To get too involved in a regular novel appears to be something most people, that read, don’t wish to commit their time towards. Since most writers now use some manner of word processing, in which to write their books, they can know, to the word, just how long their manuscripts are, when completed. Due to this, the writer is able to plan-out their book to suit a certain number of final words. I am currently working on the seventh compilation of the answers I have offer to question, here on Quora. I am currently at 142,000 words, where I am writing single-spaced (usually) on a formatted 6″x 9″ paper print size, or about 420 pages. I used to write all my entire work as a text, but now I am skilled-enough to go write into a direct formatting. Of course, this is because much of my worry is just copying and pasting. When I am writing fresh material, I will usually use the standard font my MSWord is defaulted to and then format later, where I just may decide a different font, or a different paper size. Regardless, I still have all my material available for Kindle, as well — so I have to keep the look, for that, in mind. ",
            "date": "Answered December 11, 2019",
            "views": "274",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Heidi Montgomery",
                    "user_href": "/profile/Heidi-Montgomery-14"
                }
            ]
        },
        {
            "author_info": {
                "name": "Lawrence Watt-Evans",
                "href": "/profile/Lawrence-Watt-Evans"
            },
            "answer_text": "In the science fiction and fantasy fields there are precise definitions codified in the rules for various awards. What’s more, these definitions mostly agree, so there won’t be embarrassing arguments when a story wins “best novelet” for one award and “best novella” for another. By those definitions, 45,000 words is a novel — novellas are 20,000 to 40,000 words. In practice, though, it’s very, very difficult to sell a 45,000-word story as a novel unless it’s aimed at young readers. (As I understand it, a “middle grades” novel can run 45,000 words without problems.) ",
            "date": "Answered October 2, 2020",
            "views": "16",
            "upvotes": " View 14 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Margaret Carter",
                    "user_href": "/profile/Margaret-Carter-2"
                },
                {
                    "user_id": "Eve Stone",
                    "user_href": "/profile/Eve-Stone-13"
                },
                {
                    "user_id": "SJ Fujimoto",
                    "user_href": "/profile/SJ-Fujimoto"
                },
                {
                    "user_id": "Safdar Azaad",
                    "user_href": "/profile/Safdar-Azaad"
                },
                {
                    "user_id": "Lisa Aldridge",
                    "user_href": "/profile/Lisa-Aldridge-2"
                },
                {
                    "user_id": "Brandon Dark Angel",
                    "user_href": "/profile/Brandon-Dark-Angel"
                },
                {
                    "user_id": "Jennifer Sittinger",
                    "user_href": "/profile/Jennifer-Sittinger"
                },
                {
                    "user_id": "Arthur O'Dell",
                    "user_href": "/profile/Arthur-ODell-1"
                },
                {
                    "user_id": "Steven P Robinson",
                    "user_href": "/profile/Steven-P-Robinson"
                },
                {
                    "user_id": "Howard Brazee",
                    "user_href": "/profile/Howard-Brazee"
                }
            ]
        }
    ]
}