{
    "title": "Would I stand benefit from attending a creative writing MFA? - Quora",
    "tags": [
        "Masters of Fine Arts",
        "Learning About Creative Writing",
        "Creative Writing",
        "Writing"
    ],
    "response": [
        {
            "author_info": {
                "name": "Karl Chwe",
                "href": "/profile/Karl-Chwe-1"
            },
            "answer_text": "I don’t have an MFA, but I can tell you what the profs at University of Colorado in Denver are telling their students. 1. MFA’s in writing might make sense if you are independently wealthy and you don’t care about wasting time 2. Otherwise, you should go only if you don’t go into debt. That means You pay zero tuitionThey give you a jobThey pay you enough to live in that particular areaA program that waives all of your tuition is called “fully-funded.” But that isn’t enough. You need to at least break even in the program, taking into consideration your rent, your food, your clothing, your writerly whiskey, etc. Under no circumstances should you take out loans to pay for an MFA in writing. The reason is that MFA’s in writing do not make you employable. There are bejillions of MFA graduates out there competing for about 5 jobs. So it makes no sense to go into debt in order to come out almost unemployable. There are exceptions. If you get into the Iowa Writers’ Workshop, agents will chase you down. But if you don’t (and Iowa has its own set of problems, I hear), then you will have to undergo the long, slow, lonely, painful process of submitting your work to journals, building up a portfolio, finding a book publisher, etc. I know at least two brilliant writers with tons of publications, residencies, books, etc., who are eking out a living as composition instructors without tenure or even a chance at promotion, who consider themselves lucky. 3. Further, an MFA will make sense (they tell me) only if your expectations are reasonable. You should think of an MFA degree as a chance to connect to other writers, and to get paid (a pittance) to write. Which is not to be sneered at; you may never have such a chance again. But what you should NOT expect is: useful feedback in workshops; attentive, engaged teachers; teachers who know how to teach; huge strides in your writing development. It is only three years, and there is only so much you can learn, and even if teachers know how to teach writing, they (or rather, their institutions) don’t care about teaching. They care about income and reputation. You should know that like law schools, MFA programs are money-makers for the universities. There are tons of students applying, who will often pay top dollar, and who can supply a ready supply of labor to teach undergrads basic composition, which they mostly have to do anyway. I know at least one prof who refuses to start an MFA program because he thinks it would likely exploit its students. I know one woman who worked at a local nonprofit writing workshop (the amazing and cheap Lighthouse Writers’ Workshop in Denver) who entered an expensive MFA program, only to be shocked and angered that the workshops she attended were no better than the cheap workshops at Lighthouse. But other MFA students I know have been overjoyed with the experience. In workshops I met one MFA grad who was 25 years old, considered herself superior to the rest of us, and was actually not very bright. She was quite chagrined to discover that sometimes we had valid criticisms of her work. 4. Be aware that tuition grants may be considered income under the Trump/GOP tax plan. So even if you earn $15K a year teaching illiterates how to construct a sentence, you may be taxed as if you are making $80K (because your tuition grant is $65K.) Also, be aware that health insurance is not always available to grad students. The University of Colorado in Denver has stopped offering health insurance to its students at any price. Luckily we have the Medicaid expansion and a functional heath insurance exchange. But not all states have that. So to summarize: you should get an MFA in writing ONLY IF You don’t go into debt for it.You don’t expect to get much attention from teachers, or to suddenly become a great writer.Your health and tax situation will be tenable and predictable.That last requirement might be impossible to meet right now, unless you go to school in Canada or Great Britain. I suspect there are many, many students in MFA programs who shouldn’t be there. They don’t have the basic writing ability or intelligence or seriousness of purpose to really create publishable work, let alone make any kind of living in writing. But MFA programs admit them because they are willing to pay. Is that ethical? I doubt it. ",
            "date": "Answered December 1, 2017",
            "views": "285",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Michael Tincher",
                    "user_href": "/profile/Michael-Tincher-1"
                },
                {
                    "user_id": "May Susan",
                    "user_href": "/profile/May-Susan-1"
                },
                {
                    "user_id": "Cameron Merker",
                    "user_href": "/profile/Cameron-Merker"
                }
            ]
        },
        {
            "author_info": {
                "name": "Phill Provance",
                "href": "/profile/Phill-Provance"
            },
            "answer_text": "If you want to improve your writing, yes, definitely, and with so many low-residency programs out there now, it's possible to do without relocating. But I would be careful about cost. My alma mater, WV Wesleyan, was my choice over several other programs that had expressed interest in me (I had been a working writer and well-published in my genre for many years previous), and my deciding factors were as follows: (1) the program not only requires students to attend lectures in all three genres but also offers the opportunity to qualify for a fifth cross-over semester, during which time the student is enrolled in a genre other than her specialty and completes coursework in that other genre, (2) the program offers a residency abroad in Ireland, during which the student studies under Irish writers and then waives the tuition cost for Ireland attendees to attend the regular residency later that summer, so the student gets twice the workshops and twice the lectures one summer,(3) the tuition cost is only $10k/year, which is cheap for any MFA, leaving the student leeway to take out more than what's necessary for the program to provide living-expense leeway, and (4) it offers exemplary students the opportunity to teach as fellows for up to two years after graduation, thus earning their costs back. So it's really a gem among gems, and since being in the program I've placed seven poems through general submissions, was a finalist for an award with another, shortlisted with yet another, placed with yet another, and won with three, for a total of 13 published pieces, plus a published critical essay and two presentations at conferences. To put that in perspective, up to that point I'd published only 22 poems before the program, so in one year's study had accomplished half of what it had taken me 10 years to do previously. And, granted, I came in with a book contract, a chapbook and thousands of pages of published writing as a journalist, copywriter and comics scripter, I'm not the most widely published student in the program by a longshot, with some students having churned out as many as three collections since they've been at Wesleyan. Moreover, founded by a former state poet laureate, the program has close ties to WV's current poet laureate, Mark Harshman, who stops in at residency and has even taught a lecture there. So it's just a stellar program I can't gush enough about, and for me, as a native-born Appalachian, with family just an hour from school, it's been the perfect fit. But I knew it would be, from my research into programs beforehand. Everything they say is therefore true: you have to decide what you want and which program is most likely to give it to you. If, like me, you're interested in a low-rez in which you can dual specialize while not racking up immense student debt, Wesleyan's a great option. Of course there are now 50 low-rez options and many more full-rez MFA programs out there. Also, I didn't consider “rankings” (which are now considered debunked anyhow after an open letter from just about every professor in the country, including those who were benefitting from it), but I also had an agent at a decent NY house going into it, so I didn't need to wow anyone. The well-known, older schools, remember, are what they are because of students generations ago, and faculty changes; for instance, James Tate studied under Marvin Bell at Iowa, and Marvin's now at Pac-U, while Jim is regrettably no longer with us to be the star professor at U-Mass's legendary program. For my part, yes, the fact that WV Wesleyan is new so doesn't have a huge brand profile makes me nervous re teaching prospects and getting into a PhD program, but I think also a school whose first few cohorts are winning contests and publishing is on the upward trajectory. I'm just not riding anyone else's coattails but must be the coattails others ride. ;-) ",
            "date": "Answered December 1, 2017",
            "views": "162",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Timothy Chambers",
                    "user_href": "/profile/Timothy-Chambers-22"
                },
                {
                    "user_id": "Cameron Merker",
                    "user_href": "/profile/Cameron-Merker"
                }
            ]
        }
    ]
}