{
    "title": "Yahya Bootwala's poetry has become a trend in such a short time. How can I make my poetry a trend similar to his? - Quora",
    "tags": [
        "Trends"
    ],
    "response": [
        {
            "author_info": {
                "name": "Sage Kaleke",
                "href": "/profile/Sage-Kaleke"
            },
            "answer_text": "I perform at Open Mics, though it doesn't happen frequently. During my initial days, I would notice that almost in every Open Mic, there was this one performance that stood out and had people clapping and shouting for more. The weird thing about that perfomance (and particularly poem) was, it was never really a strong piece of art. So, what made such performances appealing to the audience? While I and many others wrote on subjects and did the kind of poetry which is really hard to do, these performances had poems which were written on subjects that audience could easily relate with.  I realised this trend and decided to recite a romantic poem; for the first time in my life. Needless to say, it was well received by audience and I got standing ovation, too. In a nutshell… Write relatable content.Write content that can be easily understood.Play with perspectives. (what Bootwala did)Don't show off the depth in your poetry and concentrate on what appeals to the audience (when it comes to open mics).You can watch my performance below. Feel free to make use of subtitles, if you don't know Punjabi.  Regards, Sage Kaleke P.s - As for how can your poetry become a trend, it depends a lot on how much relatable it is and what's the reach of channel/platform that uploads it. ",
            "date": "Answered April 19, 2019",
            "views": "19",
            "upvotes": " View 6 Upvoters",
            "upvoters": [
                {
                    "user_id": "Preet Singh",
                    "user_href": "/profile/Preet-Singh-768"
                },
                {
                    "user_id": "Priyoshi Kundu",
                    "user_href": "/profile/Priyoshi-Kundu"
                },
                {
                    "user_id": "Manjeet Gurminder Kaur",
                    "user_href": "/profile/Manjeet-Gurminder-Kaur"
                },
                {
                    "user_id": "Anza Shahid",
                    "user_href": "/profile/Anza-Shahid"
                },
                {
                    "user_id": "Krishna Jayswal",
                    "user_href": "/profile/Krishna-Jayswal-8"
                },
                {
                    "user_id": "Amir Alam",
                    "user_href": "/profile/Amir-Alam-3"
                }
            ]
        }
    ]
}