{
    "title": "2 Timothy 3:16, says 'All scripture is God breathed….' How can we trust the Bible when it says that it is the word of God? - Quora",
    "tags": [
        "Second Epistle to Timothy",
        "Theology",
        "The Bible"
    ],
    "response": [
        {
            "author_info": {
                "name": "Richard Porter",
                "href": "/profile/Richard-Porter-10"
            },
            "answer_text": "Don't let common Christian interpretation be your standard here. Consult a few scholarly commentaries and you'll get an entirely different perspective on what Paul was getting at here than what you've been getting from laypeople. The context of this verse is hard times, false teachers, and all of the things that come with those two harsh realities when proclaiming the gospel. This is a pastoral letter meant to address issues that Christians will face in both early and latter days of the faith. It is not an attempt to \"prove the Bible by using the Bible\". That's simply a cartoonish understanding of how to interpret the Bible and all things therein. Are we to believe that Paul thought his letters were eventually going to be published in what we call the New Testament canon? I don't. I think Paul believed that what he was teaching was divinely inspired and authoritative, but I don't think we can say that Paul thought he was writing Scripture. Paul is referring to the Old Testament. How do I know he's talking about the OT? He says so... in verse 15! It's pretty silly to then infer based upon a single verse without regard to context that Paul would reason that the Scriptures are God's word because they say they are. He wouldn't do that. He would likely appeal to various forms of argumentation. Paul was a Pharisee and a very well educated one at that. Paul had at least some training in rhetoric and knew very well how to persuade people with evidence. On what grounds *would* Paul petition someone to accept the truth of Christianity and the sacred writings that are seen as authoritative? Simple. The bodily resurrection of Jesus Christ. This is the central truth of the Christian faith. Just read his letters and this becomes quite clear. Read Acts 17 & 18. The truth of Christianity does not stand or fall on anything other than whether or not Jesus rose from the dead. By extension we can argue that the Bible and its authority as a witness of God's working in history are also ratified by Jesus' resurrection, or at least that it raises the probability of these documents being divinely inspired. Constructing a doctrine of inspiration, however, is not such a simple matter. ",
            "date": "Answered March 11, 2016",
            "views": "183",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Christopher Sean Quigley",
                "href": "/profile/Christopher-Sean-Quigley"
            },
            "answer_text": "Point a microscope at the sky and all you will see is darkness. If you were to then conclude 'there are no stars' it would only be because your approach was wrong.   It is a circular argument. I think most rational Christians would agree with you.   I remember that my youth pastor made the same argument in a sermon.  \"How do we know the Bible is God's word? Well... first because the Bible itself says so.\"  I sat in my chair and I cringed. As a 13 year old I knew that made no sense.  Maybe a better approach would be to actually consider: \"Okay, the Bible claims it is the Word of God. It claims to be 'God breathed.' If that's true, how would I know it?\"  So, do a test. If the Bible said: \"Do 10 jumping jacks, turn around and touch the ground, and Jesus will appear to you.\" Then do it. If Jesus doesn't appear, you know the Bible isn't telling the truth.  But, the Bible doesn't say this. That would be ridiculous.   This is what it actually says:  \"But if from there you seek the LORD your God, you will find him if you seek him with all your heart and with all your soul\" - Deuteronomy 4:29  \"\"Ask and it will be given to you; seek and you will find; knock and the door will be opened to you.\" - Matthew 7:7  Jesus did not say: 'and maybe you will find.' He says you will. So, do what he says.  Make an honest prayer into the dark void of space. \"God, if you are there, it is impossible for me to know it. In fact, everything I see seems to indicate that you do not exist. My logical mind tells me it is foolish even to make this prayer. Yet, this book, which claims to be your word, says I will find you if I seek you. It says your ways are higher than mine and your thoughts are higher than mine. If so, it is not possible for any human to know you unless you lower yourself to our level. This is my humble attempt. If you are there, I need to know.\"   If after a genuine effort, where you open yourself and your mind up to the possibility of God (even while remaining logical and skeptical) you do not find anything. Then I believe you have every right to say:  \"I did what the Bible said, and I have concluded that it is not the Word of God, because it did not lead me to him.\" Edit: I want to add a few things to consider: \"'WHOEVER WILL CALL ON THE NAME OF THE LORD WILL BE SAVED.' How then will they call on Him in whom they have not believed? How will they believe in Him whom they have not heard? And how will they hear without a preacher?\" Romans 10:14 \"So faith comes from hearing, and hearing through the word of Christ.\" Romans 10:17 \"\"Who is he, sir?\" the man asked. \"Tell me so that I may believe in him.\" John 9:36 \"'How can I,' he said, 'unless someone explains it to me?' So he invited Philip to come up and sit with him.\" Acts 8:31  ",
            "date": "Answered February 28, 2016",
            "views": "953",
            "upvotes": " View 14 Upvoters",
            "upvoters": [
                {
                    "user_id": "Tom Lee",
                    "user_href": "/profile/Tom-Lee-281"
                },
                {
                    "user_id": "Anand Samuel",
                    "user_href": "/profile/Anand-Samuel"
                },
                {
                    "user_id": "Darey Mobalaji",
                    "user_href": "/profile/Darey-Mobalaji"
                },
                {
                    "user_id": "Jeremiah Shultz",
                    "user_href": "/profile/Jeremiah-Shultz"
                },
                {
                    "user_id": "Nicholas Lim",
                    "user_href": "/profile/Nicholas-Lim-4"
                },
                {
                    "user_id": "Marlon Thomas",
                    "user_href": "/profile/Marlon-Thomas-66"
                },
                {
                    "user_id": "Carlin Frett",
                    "user_href": "/profile/Carlin-Frett"
                },
                {
                    "user_id": "Even Sosa",
                    "user_href": "/profile/Even-Sosa"
                },
                {
                    "user_id": "Mark Jones",
                    "user_href": "/profile/Mark-Jones-297"
                },
                {
                    "user_id": "Joel V Simon",
                    "user_href": "/profile/Joel-V-Simon"
                },
                {
                    "user_id": "Nathan Ketsdever",
                    "user_href": "/profile/Nathan-Ketsdever"
                },
                {
                    "user_id": "Lazarus Kotum",
                    "user_href": "/profile/Lazarus-Kotum"
                },
                {
                    "user_id": "Darrell Burk",
                    "user_href": "/profile/Darrell-Burk"
                },
                {
                    "user_id": "Mari Adams",
                    "user_href": "/profile/Mari-Adams"
                }
            ]
        },
        {
            "author_info": {
                "name": "Frank Speener",
                "href": "/profile/Frank-Speener"
            },
            "answer_text": "The book of 2nd Timothy, like every other book in the new testament, was written as a single volume of work. It was never intended for any kind of collective works as the Bible actually is. These singular works were epistles, letters to either the named recipient, or directed to a particular congregation. 2nd Timothy is actually Paul's second letter to Timothy, and not directed to any congregation, while Paul's letter to the Ephesians was directed to the congregation which was located at Ephasis. Knowing, then, that these are actually individual works, we have to phrase our questions individually. So now we have to ask, “What constitutes scripture?” It is obviously not referring to anyone who came around offering advice, and the Bible wouldn't exist for another 300 years, so it stands to reason that the scripture that he was tegerring to had to be Old Testament scriptute. The New Testament, however, is a completely different subject altogether. There is overwhelming evidence that much of the content in the Gospels was purposely altered by early Roman christian authorities to fit their own narrative, which in teturn allowed the introduction to so many non-Christians doctrines, practices, and entities into what is regarded as mainstream Christianity today. The molding of this new Christianity began when Rome legalized the practice of Christianity and ultimately made it the official religion of Rome in 313 ad with the Emperor Constantine’s Edict of Milan. We are told to study to showselves approved, rightly dividing the word of truth (2nd Timothy 3:15), and to PROVE all things (1st Thessalonians 5:21). While Grace is a gift of GOD, truth is something that you have to dig for… “It is the glory of God to conceal a thing: but the honour of kings is to search out a matter.” (Proverbs 25:2) ",
            "date": "Answered December 20, 2018",
            "views": "117",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Kyle Hooper",
                "href": "/profile/Kyle-Hooper-1"
            },
            "answer_text": "Please read this. And I dare ANYONE to challenge the “coincidences” … The book of Exodus was written over 1,000 years before the Bible was ever compiled. The amount of books in its compilation were prophesied in Exodus in something called the Golden Lampstand or Candlestick (aka Menorah) When logic is used from the scriptures given: 31 “You shall also make a lampstand of pure gold; the lampstand shall be of hammered work. Its shaft, its branches, its bowls, its ornamental knobs, and flowers shall be of one piece. 32 And six branches shall come out of its sides: three branches of the lampstand out of one side, and three branches of the lampstand out of the other side. 33 Three bowls shall be made like almond blossoms on one branch, with an ornamental knob and a flower, and three bowls made like almond blossoms on the other branch, with an ornamental knob and a flower—and so for the six branches that come out of the lampstand. 34 On the lampstand itself four bowls shall be made like almond blossoms, each with its ornamental knob and flower. 35 And there shall be a knob under the first two branches of the same, a knob under the second two branches of the same, and a knob under the third two branches of the same, according to the six branches that extend from the lampstand. 36 Their knobs and their branches shall be of one piece; all of it shall be one hammered piece of pure gold. [This is important] 37 You shall make seven lamps for it, and they shall arrange its lamps so that they give light in front of it. … there is but only way this could look.  The colors are to help you identify the individual pieces.The three red pieces are the pieces from which the branches grow from. God Breathed all Scripture for God is 3-in-1. When you count all the pieces which are hammered from 1 piece of gold, you get 66 pieces that are 1. For not only is God, 1. But so is His Word 66 books compiled into 1 Bible. There is no room for any additions or subtractions to it.  And note that the top piece is in fact, 12 pieces. Jesus liked 12. There are the 12 tribes of Israel.   Finally, the way Revelation is written when Jesus says He is the Alaph and the Tav He is also saying he is ALSO all the letters in between. In other words as John 1:1 says He is the Word of God. It is hammered of one piece of gold because there are NO OTHER HOLY BOOKS GOD HAS WRITTEN! Therefore, considering there are but only 3 sources of scripture:1) God 2) The Devil 3) Humans …you figure it out. ",
            "date": "Answered September 25, 2019",
            "views": "173",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Gina Langridge",
                "href": "/profile/Gina-Langridge"
            },
            "answer_text": "The Bible isn't a single work, it's a collection of men's writings over centuries and it has all the inaccuracies and contradictions you would expect from such a collection. It also has some beautiful passages and poetry.  The book that most helped me understand what the various writings in the Bible meant to the people it was written for was How to Read the Bible for all its Worth. It's not a debunking book, it's a book to help Christians better understand the book their faith is based on. Understanding in my case led to a huge sense of relief at not having to try to reconcile the irreconcilable any more. I now don't see any reason to believe the Bible any more than any of the other books of  world religions. Why choose the Bible over the Baghavad Gita, or the Book of Mormon? There is no reason. So since I don't believe in those, I don't believe in the Bible either, or not as a guideline to living anyway. But it does have some beautiful passages alongside the terrible ones.  ",
            "date": "Answered February 28, 2016",
            "views": "246",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Eric Dumont",
                    "user_href": "/profile/Eric-Dumont-6"
                },
                {
                    "user_id": "Mangalani Collin Madilonga",
                    "user_href": "/profile/Mangalani-Collin-Madilonga-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Ricardo Almeida",
                "href": "/profile/Ricardo-Almeida-18"
            },
            "answer_text": "There really is an inversion here. You first need to trust the Bible. Only after that you may trust 2 Tim 3:16. But, how can you trust the Bible? I think it is much like you trust a friend. If your parents introduce you to an old friend and show they trust him very much, then you somehow inherit that trust. If you know somebody new, talk with her, do things together, do some favour, get a favour in return... If she proves trustworthy in small things, then you increase your trust, entrusts her with bigger things. After a while, she is your friend, or girlfriend, or even wife. Some people's relationship with the Bible grows like that. It's not a logical thing, it's a feeling. Jesus said, comparing himself to a shepherd: \"his sheep follow him because they know his voice. But they will never follow a stranger; in fact, they will run away from him because they do not recognize a stranger’s voice.” John 10:4,5 NIV. I tried to follow this path, my that's not my thing. I'm kind of deaf to anything beyond reason and logic. Jesus seemed to be referring to this kind of people here: \"I have other sheep that are not of this sheep pen. I must bring them also. They too will listen to my voice, and there shall be one flock and one shepherd.\" John 10:16 NIV. There are sheep not of this sheep pen, the one where those who \"know his voice\" are gathered. So, they don't know his voice, they don't recognize him. But, eventually, they will be brought to the fold. How? I think there is another way to trust the Bible. The one I'm treading now. I'm trying to destroy the Bible in the most honest way possible. I start with this hypothesis: There is a God that informed humanity of his existence through a message: the BibleA universe created by God operates in such a way that it's indistinguishable from a universe that simply is, without an intelligent cause. So, the only way to know for sure, apart from a direct manifestation, is the message -- if there is one. So, one must just refute the message, using a demonstration by reductio ad absurdum. You assume the message is from God, then it must be consistent with known facts (not theories or opinions) and self-consistent. Any contradiction refutes the hypothesis. Easy? Try to do it honestly. Try to trap the Bible like a DA traps a criminal in contradiction. But, have in mind that the hypothesis also postulates the existence of a God, an almighty agent. With that in mind, it is really hard to refute the Bible. One approach: the Bible says God never lies. So, how come God told Moses to tell a lie to pharaoh? \"Tell pharaoh to let my people go on a 3 days' journey to offer sacrifices in the desert.\" It turns out this inconsistency is a clue to undestand the path of the exodus. A path that each reader of the account understands differently. I'm writing a book about it. Adam and Eve? See my answer here: Ricardo Almeida's answer to How has the Adam and Eve story been proven wrong?  ",
            "date": "Answered February 28, 2016",
            "views": "244",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Anthony Bosman",
                "href": "/profile/Anthony-Bosman"
            },
            "answer_text": "In some sense, any worldview has to bottom out at an ultimate, axiomatic truth claim. For example, if I say that I will only trust those things that can be demonstrated by reason, I am left with the question of how do I know that I can trust reason. We may be able to reason through why we should trust our reason, after all there are very good reasons to depend on reason, but even then, we relied on reason to reach that conclusion. Descartes ran into this problem in his Meditations while trying to place his beliefs on sure footing. He recognized that there could be some powerful demon systematically deceiving him. Ultimately, he rejected this possibility, but it is noteworthy that it seems he relied upon a belief in the goodness of God to do so (a good God wouldn't allow him to be systematically deceived). Therefore, rather than prove that reason is trustworthy, we accept that as an axiom and go on to argue instead that doing so is a good way to live life and makes sense of the world around us. Our reasoning helps us to build safe buildings, planes that can fly, and allows us to come up with half-way decent way to govern ourselves. It works. It explains a wide range of phenomena. In a similar way, bottoming out the Christian worldview is a belief in the trustworthiness of God, and that God has revealed Himself through the Scriptures. Now, Christians can point to historical, archaeological, and textual evidence that they believe support these claims, but ultimately the Christian belief in the trustworthiness of scripture don't rest entirely on the findings of these fields. It can't, for Christians believe the authority of Scripture trumps the authority of the current opinion of any field of human knowledge. (If indeed Scripture is the Word of God, this is of course reasonable.) Of course, if the claim of Scripture's trustworthiness consistently ran against the findings of the full range of human knowledge and experience, than the Christian would be in a rather awkward position and had probably ought to consider constructing a worldview constructed from a new truth claim. Yet, at least for a couple billion of people over a couple thousand years, Scripture has appeared to be a reliable means to make sense of everything from history, science, human rights, and justice to one's personal experience of community, acceptance, forgiveness, and purpose. Not to mention Scripture's opening story of humanity made in the \"image of God\" allows one to solidly establish the claim of reason's trustworthiness as well, which is a real relief for those of us which value reason. ",
            "date": "Answered February 29, 2016",
            "views": "479",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Darey Mobalaji",
                    "user_href": "/profile/Darey-Mobalaji"
                },
                {
                    "user_id": "Darrell Burk",
                    "user_href": "/profile/Darrell-Burk"
                }
            ]
        },
        {
            "author_info": {
                "name": "Boomy Tokan",
                "href": "/profile/Boomy-Tokan"
            },
            "answer_text": " Image from Google To the believer all scripture is God-breathed To the atheist all scripture is God-breathed Apart from the cosmos and much of what we call nature - which was all originally created by God, - everything else physical we see is created by man. From the beginning of time - Adam -, God has always worked in partnership with a man for matters concerning the earth and humanity. A picture of this is seen in the Garden of Eden where the man was charged with the naming of animals, the care of the garden and in chapter one of Genesis the charge to populate and dominate the whole earth The struggle The challenge most people have is that if the Bible is the word of God or God-breathed then He - God - should physically write the whole Bible. Unless we believe that: We are made in God’s image and likenessGod works in partnership with the manGod has given us everything we need for life and godlinessWe will always have this challenge. Our World There are so many beautiful things we see around the world that man has created that are just so magnificent. They compel us to realize that another entity must have been working to propelled this! The buildings, gardens, cars, planes, ships, scientific discoveries, medical cures etc All of these physical creations were done in partnership with God! God Breathed When it is said that all scripture is God-breathed it means: In the beginning, we hear that God breathed into man and he became a living soul. (Genesis 2v7) The breath of God is what enabled Adam to act and be like God. With this and other scriptures in mind apostle, Paul could confidently affirm that there is a parallel between the past and the way all scriptures are written. We, therefore, conclude that: All of the Bible is God inspiredAlthough compiled by man all writing in the Bible is God-givenThe Bible includes all the stories and events that God wants us to knowThe Bible was written by God leading the writers to write what He - God - desired - 2 Peter 1v21It does not mean that every word in the Bible is spoken by God - but they are included by God!Some people think people they chose not to be Christians God’s word doesn't apply to them - that is not true. The difference is that If you are a Christian you are obligated to live by what you say you believeIf you are not a Christians you are not obligated to live by the word of God - but the principles that God has set as to how the earth should function still applies to you as well. Because all scripture is God-breathed!If you want to learn more about this and the Book of 1 and 2 Timothy I have a course on Udemy Remain blessed Pastor Boomy Tokan ",
            "date": "Answered December 12, 2018",
            "views": "318",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Timothy Lokker",
                    "user_href": "/profile/Timothy-Lokker"
                }
            ]
        },
        {
            "author_info": {
                "name": "Mark Doel",
                "href": "/profile/Mark-Doel"
            },
            "answer_text": "Paul was writing to a particular individual called Timothy who was a young minister and so the statement about scripture being God breathed was addressed to someone for the sake of encouragement. The early church’s structure was more akin to that of Brethrenism and Presbyterianism, in which there was a network of churches led by a ministry team, rather than the clerical hierarchy of Catholicism, Orthodoxy and Anglicanism, which was owes more to Roman pagan influences from Constantine onward. 2 Timothy is reckoned to be Paul’s last letter and so again we have to bear in mind he wasn’t writing for the sake of conversion. Another view is that 2 Timothy was written by a Pauline fan not that long after Paul’s death. At the end of the day as a Christian I believe it is an act of faith to take that step in recognizing Jesus as our lord and saviour and that simply going in for circular arguments with Atheists and the like is futile. 1 Peter 3:15 tells believers to give the reason for ‘our hope’, i.e. why do we believe in Jesus, when asked. Jesus also stated that by loving one another people around us would know we were his followers. It has often been Christians of the strongly fundamentalist (in the more modern sense of the term) who have gone in for the ‘because the bible says so’ and ‘the world is beautiful, therefore there must be a creator’ line. Most Atheists would have a rebuttal for those arguments and again the bible doesn’t encourage that approach. ",
            "date": "Answered August 10, 2016",
            "views": "102",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Barry Hampe",
                "href": "/profile/Barry-Hampe"
            },
            "answer_text": "2 Timothy 3:16, says \"All scripture is God breathed….\" How can we trust the Bible when it says that it is the word of God? I have seen many people use the 2 Timothy 3:16 passage to argue that the Bible is the word of God. It seems like a classic circular argumentThe Bible is the word of God, because the Bible says so. We should believe the Bible, because it is the word of God.  Obviously, an assertion in a book (unsupported by evidence) that the book is true and valid is meaningless. More to the point, what may be asserted in the holy book of a religion is meaningful to the followers of that religion, because they believe in the existence of the god that religion has grown up around. What the followers of that god, that religion, and the holy book about that god often fail to realize is that the book is meaningless to those who do not share their belief. They try to use the book, and the doctrine of the religion, as evidernce for their god, because they believe it. I am atheist. I have no belief in any god or gods. Having no such belief, I consider the religions that have grown up around verious gods to be nothing more than ancient folklore, no more meaningful than, say, Aesops fables.  In other words, the book doesn't matter to those who do not believe in whatever god the book is about. ",
            "date": "Answered March 11, 2016",
            "views": "23",
            "upvotes": " View 26 Upvoters",
            "upvoters": [
                {
                    "user_id": "James Smith",
                    "user_href": "/profile/James-Smith-3709"
                },
                {
                    "user_id": "Ray Jay",
                    "user_href": "/profile/Ray-Jay-5"
                },
                {
                    "user_id": "Michael Vogel",
                    "user_href": "/profile/Michael-Vogel-5"
                },
                {
                    "user_id": "Stephan Bowie",
                    "user_href": "/profile/Stephan-Bowie"
                },
                {
                    "user_id": "Rob Fletcher",
                    "user_href": "/profile/Rob-Fletcher"
                },
                {
                    "user_id": "Chrys Jordan",
                    "user_href": "/profile/Chrys-Jordan"
                },
                {
                    "user_id": "George Sawyer",
                    "user_href": "/profile/George-Sawyer-1"
                },
                {
                    "user_id": "Jeff Chandler",
                    "user_href": "/profile/Jeff-Chandler-2"
                },
                {
                    "user_id": "Maheshkumar Pillai",
                    "user_href": "/profile/Maheshkumar-Pillai"
                },
                {
                    "user_id": "Pedro Henrique Bernardinelli",
                    "user_href": "/profile/Pedro-Henrique-Bernardinelli"
                },
                {
                    "user_id": "Malcolm Sargeant",
                    "user_href": "/profile/Malcolm-Sargeant"
                },
                {
                    "user_id": "Venkatesh Kandimalla",
                    "user_href": "/profile/Venkatesh-Kandimalla-1"
                },
                {
                    "user_id": "David Olden",
                    "user_href": "/profile/David-Olden"
                },
                {
                    "user_id": "Keith Bailey",
                    "user_href": "/profile/Keith-Bailey-11"
                },
                {
                    "user_id": "Zane Jakobs",
                    "user_href": "/profile/Zane-Jakobs"
                },
                {
                    "user_id": "Glen Tarr",
                    "user_href": "/profile/Glen-Tarr"
                },
                {
                    "user_id": "Helge Kåre Fauskanger",
                    "user_href": "/profile/Helge-Kåre-Fauskanger"
                },
                {
                    "user_id": "Frans du Plessis",
                    "user_href": "/profile/Frans-du-Plessis-1"
                },
                {
                    "user_id": "Rick Thorne",
                    "user_href": "/profile/Rick-Thorne-3"
                },
                {
                    "user_id": "Edward Azkarra",
                    "user_href": "/profile/Edward-Azkarra"
                },
                {
                    "user_id": "Meghdoot Dadegaonkar",
                    "user_href": "/profile/Meghdoot-Dadegaonkar"
                },
                {
                    "user_id": "Claes Engelin",
                    "user_href": "/profile/Claes-Engelin"
                },
                {
                    "user_id": "Toby David Low",
                    "user_href": "/profile/Toby-David-Low"
                },
                {
                    "user_id": "Tony Gundich",
                    "user_href": "/profile/Tony-Gundich-1"
                },
                {
                    "user_id": "Renato Alves",
                    "user_href": "/profile/Renato-Alves"
                },
                {
                    "user_id": "David Chidakel",
                    "user_href": "/profile/David-Chidakel"
                }
            ]
        },
        {
            "author_info": {
                "name": "Trevor Carter",
                "href": "/profile/Trevor-Carter-4"
            },
            "answer_text": "This argument is fallacious. Saying that the Bible is proof that god exists because it someone claims god said “All scripture is breathed…”, is like me saying a book by someone claiming Bigfoot is real makes Bigfoot real. There are many “holy” texts in existence. Many of them claim to be inspired or handed down by some god. Which one do you believe? Are there many gods? How would can know for sure? As for the Bible, if god inspired it he should have used different people to write it, because they screwed up. This is evident by looking at the factual errors, contradictions, and inconsistencies in it. Why couldn’t god write a book himself and hand it down? If you believe god created the human brain, which gives us the ability to read and write, then shouldn’t god have those abilities? It amazes me that so many people accept the Bible as the “word of god” without any evidence. For one, they can’t prove god exists. Secondly, even if he does exist you still have to prove he is the one that inspired it. Unfortunately, god is unavailable for answers. ",
            "date": "Answered June 29, 2016",
            "views": "126",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Eric Dumont",
                    "user_href": "/profile/Eric-Dumont-6"
                },
                {
                    "user_id": "Rohan Nampalliwar",
                    "user_href": "/profile/Rohan-Nampalliwar"
                }
            ]
        },
        {
            "author_info": {
                "name": "Ed Wicke",
                "href": "/profile/Ed-Wicke"
            },
            "answer_text": "Well, if it did say that, it would be Paul’s opinion. And then you would have to put it in the context of whatever else he wrote about scripture. And if it turned out to be a one-off extreme statement (as I think you might conclude) you would want to consider whether it has been correctly understood and indeed whether it is a late addition - a commentary by someone else that got included with the original text. Or you might consider that the Greek doesn’t actually say this. After all, it’s a bit odd for the man who rejected the laws of Moses to be making some blanket claim about the authority of “Scripture”! And indeed the Greek doesn’t say what you quote. It says something like “writings inspired by God also good for instruction”. There is no verb and it can be equally interpreted as “Any God-inspired writings are useful for your instruction”. Lastly, people seize upon “Scriptures”, as if somehow this verse pre-invents a modern Evangelical term for the old and new testaments, even before we had the New Testament! Nonsense. The word is simply the Greek equivalent of “writings”. I suggest that Paul had in mind the writings of himself and Peter and others in the church who were recording the life of Jesus or providing advice. That makes much more sense. And he would no doubt add the prophetic writings of the Old Testament, insofar as they foretold the New. ",
            "date": "Answered November 23, 2017",
            "views": "73",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Julian Farrington",
                "href": "/profile/Julian-Farrington"
            },
            "answer_text": "People like to use this argument because it means they can pick and choose whatever they want from the Bible to support their biases and prejudices. If they genuinely believed what they say about the Bible, they would see that in Revelation 19 and John 1, it says that JESUS is the Word of God. Can you imagine John 1 going: ‘’In the beginning was the Bible, and the Bible was with God, and the Bible was God, and without it (the Bible) was nothing made that is made’’. No…doesn’t make sense at all. Jesus’ said that his words are spirit and they are life (John 6). Jesus also said to the Pharisees ‘’You search the scriptures for in them you think you have eternal life, but it is they that testify of me, but you won’t come to me, that you may have life’’. But of course, you don’t have to trust or believe the Bible on this, or me for that matter. A great way to find out the truth for yourself, is to do what Jesus said. ‘’If you want to know if my doctrine is my own, or from God, then just do it’’ ‘’If you continue in my word, then you shall know the truth and the truth shall set you free’’. Experiment honestly casting aside all prejudice and bias, and you may just find the answer you’re looking for. ",
            "date": "Answered June 20, 2016",
            "views": "115",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Venus Inleo",
                "href": "/profile/Venus-Inleo"
            },
            "answer_text": "That's how it's advertised, maybe there's something to it. Not a whole lot of books claim that, and even more do not try to. If you have the time to study it's history, that clarifies a lot of where it's coming from, who the people are who wrote it and maintained it, and how to get around parts that are merely civilizations speaking up. Most of the time the Bible is a serious attempt by some dedicated person or people to pass on God's word.What others had to gain by out right lies, would be the part of religion that increased money, land, people, and power, however the real Bible prophecy does not concern itself with all that. The Bible has nothing to gain by lying, the hard part is understanding it. Try this, do you have any experiences with the Spiritual Realm? Find out more about it by reading books, including the Bible. It just might be that you have had identical experiences. Of course this would increase your interest. Also, all the \"help books\" that supplement the Bible could also advance your knowledge and belief. Knowledge leads to Understanding (how else can God speak to you if you cant understand His language?) Not all readers have spiritual education that define and explain the words, phrases, parables, revelations, scenes, symbols and even advice that is found there, so it's wise to delve into esoterics a bit. ",
            "date": "Answered November 12, 2017",
            "views": "57",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Boniface Muggli",
                "href": "/profile/Boniface-Muggli"
            },
            "answer_text": "Catholics would say that we don’t need to trust the Bible as the Word of God on its own saying so. Rather, we can trust the Bible as a historical document when it describes Jesus and the Church—and we can look at the Church and see whether it is faithful to what was described, and then once we trust that the Church is guided by the Spirit (and it is very difficult to see how it could not be, given its history), then the Church can identify the Bible as inspired. This is, indeed, the historical way it was chosen, and how it still is backed. It also allows us to get around such problems as knowing what is or is not in the Bible—since the Bible never sets out what is inspired. ",
            "date": "Answered June 29, 2016",
            "views": "227",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Campbell Gill",
                    "user_href": "/profile/Campbell-Gill"
                },
                {
                    "user_id": "Kristian Mamforte",
                    "user_href": "/profile/Kristian-Mamforte"
                },
                {
                    "user_id": "Michael Heen",
                    "user_href": "/profile/Michael-Heen"
                }
            ]
        },
        {
            "author_info": {
                "name": "Lucha Tijuanera",
                "href": "/profile/Lucha-Tijuanera"
            },
            "answer_text": "I disagree with Barry. It is a common assumption but without foundation that one choses a God by relative closeness to that knoledge of determined deity, but it is very unaccurate. I went throu a search and kissed many toads, I mean I worshipped idols before finding the real God Jesus. And not all of us always say because the bible says so, even it is the final authority for Christians. The predictions of historical facts of the bible fulfilled in the time and detail for hundreds of years before or some years whatever the case only GOD can do that. Study the bible. ",
            "date": "Answered August 7, 2017",
            "views": "42",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Dave Clarke",
                "href": "/profile/Dave-Clarke-152"
            },
            "answer_text": "You cant trust anything you read until you see proof or are convinced that it is real. Personally I do believe Jesus existed, however, I do not believe he was the son of God. I have serious doubts that he was crucified and raised from the dead. There is so much rubbish out there it becomes difficult to tell the real from the BS. I think religion is more about power/control/egos ",
            "date": "Answered December 23, 2019",
            "views": "63",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Jeremiah Shultz",
                "href": "/profile/Jeremiah-Shultz"
            },
            "answer_text": "I have heard people question whether it is possible to have a personal relationship with Jesus Christ. Explaining it to them would be like explaining what falling in love is with someone who has never been in love. You will never know God until you make a genuine effort to find God. There are many atheists and the like who have sought to disprove God, but because they were at least honest enough with themselves to keep an open mind, they instead discovered God. A great example is the book The Case for Christ of an ardent atheist and journalist who sought to disprove God and it changed his life. ",
            "date": "Answered March 11, 2016",
            "views": "146",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Joe Buy",
                    "user_href": "/profile/Joe-Buy"
                }
            ]
        },
        {
            "author_info": {
                "name": "Dick Harfield",
                "href": "/profile/Dick-Harfield"
            },
            "answer_text": "Whatever else you rely on to believe the Bible is God’s word, you will not find any proof that the Bible is God's word in Second Timothy. This epistle is now well known as pseudepigraphical — a forgery written in Paul’s name long after his death. Would God — if he exists — really send a forger to prove to us that the Bible is the word of God? There is no evidence that the Bible really is God's word. ",
            "date": "Answered September 24, 2019",
            "views": "155",
            "upvotes": " View 5 Upvoters",
            "upvoters": [
                {
                    "user_id": "Eric Dumont",
                    "user_href": "/profile/Eric-Dumont-6"
                },
                {
                    "user_id": "Tony Hartzell",
                    "user_href": "/profile/Tony-Hartzell"
                },
                {
                    "user_id": "Mark McCoy",
                    "user_href": "/profile/Mark-McCoy-57"
                },
                {
                    "user_id": "Hɩɗɗɘŋ Dʀʌʛoŋ",
                    "user_href": "/profile/Hɩɗɗɘŋ-Dʀʌʛoŋ"
                },
                {
                    "user_id": "Helen Von Schrottky",
                    "user_href": "/profile/Helen-Von-Schrottky"
                }
            ]
        },
        {
            "author_info": {
                "name": "Frederick Naujoks",
                "href": "/profile/Frederick-Naujoks"
            },
            "answer_text": "Well... The answer is simply... Faith.  And that's exactly why I have no faith in any such religion that fails such a simple test of logic.  ",
            "date": "Answered February 28, 2016",
            "views": "90",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Edward Azkarra",
                "href": "/profile/Edward-Azkarra"
            },
            "answer_text": "Of course it's circular reasoning. Worse though, it's completely disingenuous because the proselytizers know this and still use the argument.   ",
            "date": "Answered March 12, 2016",
            "views": "40",
            "upvotes": "0"
        }
    ]
}