{
    "title": "According to the book of Revelation, will Christians be raptured up to Heaven before the 7-year tribulation? - Quora",
    "tags": [
        "Tribulation",
        "The Great Tribulation",
        "The Rapture",
        "Apocalypse (Christianity)",
        "Book of Revelation",
        "Heaven",
        "Christians",
        "The Bible",
        "Christianity"
    ],
    "response": [
        {
            "author_info": {
                "name": "David McKay",
                "href": "/profile/David-McKay-26"
            },
            "answer_text": "The Rapture is a non-biblical term given to identify something that is described in the New Testament as “being caught up to meet the Lord in the air”. Amongst evangelicals, there is widespread agreement that such an event will occur. But there is a real hornet’s nest over exactly when it happens.  I have often said that the Rapture debate is the most one-sided argument of all the major doctrinal disagreements that separate Christians. Yet the vast majority of professed Christians in the world today (at least those who have any interest in end time issues) stubbornly stick to the side that has virtually no evidence to support their position. Can you guess why? Think about it. Both sides say there is going to be a number of years of the worst suffering the world has ever experienced. But one side says you are going to have to go through it (if it doesn’t kill you first). The other side says you don’t need to worry about it at all, because it’s never going to happen… that is, not to YOU. You will be “raptured” (i.e. taken to heaven) before it all happens. So which position do you think will be incredibly popular, with or without any proof text? The Bible is clear about the fact that Christians are going to have to go through this period of great suffering (called The Great Tribulation), and, indeed, that suffering of one sort or another is to be part of our lot in every age. Suffering is what the phrase “taking up your cross” represents. Suck it up, and stop running away from it. God put all that stuff about persecution, etc. in the Bible for a reason. If you are one of the few who is prepared to hear the truth, even if it is uncomfortable, then please watch this short (10-minute) video, which I released about a month ago: Everything You Need to Know About the Rapture ",
            "date": "Answered June 27, 2020",
            "views": "129",
            "upvotes": " View 3 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Leo Miller",
                    "user_href": "/profile/Leo-Miller-33"
                },
                {
                    "user_id": "Charles Fitzgerald",
                    "user_href": "/profile/Charles-Fitzgerald-5"
                },
                {
                    "user_id": "Peter Wheeler",
                    "user_href": "/profile/Peter-Wheeler"
                }
            ]
        },
        {
            "author_info": {
                "name": "De’Mario Edwards",
                "href": "/profile/De-Mario-Edwards"
            },
            "answer_text": "No. According to the Book of Revelation, the Great Tribulation will last 3 & 1/2 years and the event Christians widely misinterpret as a rapture to Heaven with God before the Great Tribulation is in all actuality an event at the very end of the 3 & 1/2 years that describes Jesus’ return. So no, Christians won’t be whisking off to Heaven to escape the Hour of Temptation. Most Christians are actually caught in a very powerful spell cast by Satan and his Agents here on earth that has deceived the world already and caused the inhabitants of the earth to participate in the great falling away from God. The result of this is we live in a world where every nations says they know the God of the Bible but no nation keeps his commandments. This is why God will allow the Great Tribulation to come to pass; to separate those that know him from those that don’t. There is the Wilderness though, for those who do know God. It will be the only place of safety available for man on Earth during that time and people will have about a month to get there from the time the Abomination of Desolation out of the Catholic Church sets foot in the 3rd Temple and claims to be God at the command of Satan, as Satan commanded Nimrod in the original Babylon. Revelation 12 King James Version 12 And there appeared a great wonder in heaven; a woman clothed with the sun, and the moon under her feet, and upon her head a crown of twelve stars: 2 And she being with child cried, travailing in birth, and pained to be delivered. 3 And there appeared another wonder in heaven; and behold a great red dragon, having seven heads and ten horns, and seven crowns upon his heads. 4 And his tail drew the third part of the stars of heaven, and did cast them to the earth: and the dragon stood before the woman which was ready to be delivered, for to devour her child as soon as it was born. 5 And she brought forth a man child, who was to rule all nations with a rod of iron: and her child was caught up unto God, and to his throne. 6 And the woman fled into the wilderness, where she hath a place prepared of God, that they should feed her there a thousand two hundred and threescore days. 7 And there was war in heaven: Michael and his angels fought against the dragon; and the dragon fought and his angels, 8 And prevailed not; neither was their place found any more in heaven. 9 And the great dragon was cast out, that old serpent, called the Devil, and Satan, which deceiveth the whole world: he was cast out into the earth, and his angels were cast out with him. 10 And I heard a loud voice saying in heaven, Now is come salvation, and strength, and the kingdom of our God, and the power of his Christ: for the accuser of our brethren is cast down, which accused them before our God day and night. 11 And they overcame him by the blood of the Lamb, and by the word of their testimony; and they loved not their lives unto the death. 12 Therefore rejoice, ye heavens, and ye that dwell in them. Woe to the inhabiters of the earth and of the sea! for the devil is come down unto you, having great wrath, because he knoweth that he hath but a short time. 13 And when the dragon saw that he was cast unto the earth, he persecuted the woman which brought forth the man child. 14 And to the woman were given two wings of a great eagle, that she might fly into the wilderness, into her place, where she is nourished for a time, and times, and half a time, from the face of the serpent. 15 And the serpent cast out of his mouth water as a flood after the woman, that he might cause her to be carried away of the flood. 16 And the earth helped the woman, and the earth opened her mouth, and swallowed up the flood which the dragon cast out of his mouth. 17 And the dragon was wroth with the woman, and went to make war with the remnant of her seed, which keep the commandments of God, and have the testimony of Jesus Christ. This chapter chronicles the past, present and future of this earth and the people of Israel, God’s chosen priesthood to combat the forces of Mystery Babylon, the tool of the Dragon. This Earth is the 1st Heaven and the woman is Israel, each star of her crown representing a Tribe of Israel. Out of this woman, this people, a Savior was promised to come, and Israel struggled to bring about this Salvation, and wrestled with sin and her enemies, which is the Dragon. Each head represents a world power that has come out of Babylon, Medo-Persia, Greece and Rome, with each horn being a king that came out of these nations, the last of them being the “Little Horn” of Daniel, which is the Antichrist and the Abomination of Desolation, who will come out of Rome, which is the European Union today, specifically the Vatican. These are who Satan uses in the material world to bring about lawlessness and confusion and immorality on the earth, while the 1/3 of the stars mentioned drawn by his tail are the 1/3 of the angels he caused to lose their inheritance of everlasting life with God by following after him in his ambition to take the place of God. These are the powers and principalities that work on the minds of men and women, to cause them to work abominations and crimes and blasphemies before God on earth and who commune with nations and leaders that don’t know God, to give them the perfect things to do and say to authorize wickedness and bring forth perverse and crooked laws and commandments and to persecute the people of Israel, with slavery and injustice and death. These same forces sought to slay Jesus at his birth out of the Tribe of Judah, because it was promised that he would save his people from their sins and that he would rule over his people and all the people of the earth. He came from the Father and lived righteously, he died for the sins of his people and was resurrected and returned back to Heaven where he is waiting for his people to acknowledge their offense as it is written in the Book of Hosea. During this time period, Satan has devoured and tempted and persecuted the people of Israel. He was cast down out of Heaven with his angels before mankind was ever created, and in rage has sought to slay and deceive mankind ever since with his Mystery Religion. Because God had it in his mind to create man to become what he is; God, Satan thinks it’s the perfect slap in God’s face to cause man to worship man instead of him, and that is what he has been using the forces of Babylon to do ever since Nimrod walked the earth. Many of the pagan gods and idols that the Greeks and the Romans and others worshipped started out in the worship of men and women of the lineage of Ham. They just adopted them into their own cultures and changed their faces, then integrated them into their beloved traditions. Before Santa Clause flew across the night sky and delivered presents into the stockings of children, it was the Norse idol Odin, who held the same position and identity as Nimrod and before Christians started dragging trees into their homes and decking them with silver and gold, it was the Assyrians who did it first, because to them the stock, the tree, was their god, going back to the lies and legends of Nimrod and Semiramis, his mother and his lover. It’s all the same. Not much has changed since then. People still weep for Tammuz for 40 days. They just call it Lent now. People still honor Ishtar, the goddess of fertility. They just have their children role play as sperm and seek out the eggs on Easter/Ishtar Sunday, a day of worship dedicated to the Sun god, which can be traced back to Nimrod. It’s all abominable, and the world is made to praise and rejoice in it. The world can’t imagine letting go of it. And the same people who've introduced and enforced these things upon the world simultaneously preach that all of God’s laws, statutes and commandments are done away with, that no one has to keep them, and in fact, you are a bad person if you try to keep them. This world is so wicked. This is what Satan has wrought. And so, Christianity looks at people like me, a son of Israel that’s doing his job to testify against the wickedness of this world and the truth of God, and they want to silence and/or kill me, because that’s what Satan desires for them to do. You’ll probably see them in the comment section. They can’t do anything to me unless God allows them though, which is why Satan accuses me and people like me of our past sins and mistakes day and night, to receive permission to slaughter us. But we overcome that by the blood of Jesus over our lives and this testimony. Eventually, this will boil over, and Satan will be allowed to set his son out of the Catholic Church loose upon the world and he will destroy wonderfully and slay many of my people, because it will be time of Jacobs Trouble, the true Roman Inquisition, where Satan will seek to destroy all of Israel who dares to keep the commandments of God and faith in Jesus, who do not flee to the place of safety in the Wilderness of Jordan when the Abomination of Desolation stands in the rebuilt temple and claims to be God. And even those of us who do know to flee to the Wilderness of Jordan, he will send his 10 armies after us to slaughter us before we can ever make it to the Wilderness, because this son of perdition understands prophecy and this is the flood of the dragon. But God will slay them instead. And so those of us who do make it into this Wilderness will be comfortable and well taken care of for 1,260 days or time, times and a half of a time, which both can be translated as 3 and 1/2 years, the duration of the Great Tribulation. And the loud voice in Heaven announcing the kingdom of God and the power of Christ, and the casting down of the Dragon, is comparable to the 7th Trumpet and 7th Vial of Revelation, because that is when Christ is slated to return, at the blast of the last Trumpet: 1 Corinthians 15:52 King James Version 52 In a moment, in the twinkling of an eye, at the last trump: for the trumpet shall sound, and the dead shall be raised incorruptible, and we shall be changed. This is the event misunderstood to be a pre-Tribulation rapture, but as you can see, it takes place at the last Trumpet of Revelations, which in turn takes place after the 7 Seals of Revelations, which in their entirety, IS the Great Tribulation. But the dead in Christ will be risen from the dead as newborn immortals as well as the righteous remnant that remain alive to meet Christ in the sky at his coming, then come down to the Mount of Olives with him to execute fury and vengeance upon the heathen for the children of Israel as spoken of in Zechariah 9 and other parts of the Bible: Zechariah 9:13-15 King James Version 13 When I have bent Judah for me, filled the bow with Ephraim, and raised up thy sons, O Zion, against thy sons, O Greece, and made thee as the sword of a mighty man. 14 And the Lord shall be seen over them, and his arrow shall go forth as the lightning: and the LordGod shall blow the trumpet, and shall go with whirlwinds of the south. 15 The Lord of hosts shall defend them; and they shall devour, and subdue with sling stones; and they shall drink, and make a noise as through wine; and they shall be filled like bowls, and as the corners of the altar. I hope this has been of help. Take care. ",
            "date": "Answered June 21, 2020",
            "views": "109",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Adam Soren",
                    "user_href": "/profile/Adam-Soren-1"
                },
                {
                    "user_id": "Kim Dourakos",
                    "user_href": "/profile/Kim-Dourakos"
                }
            ]
        },
        {
            "author_info": {
                "name": "Kurt Martin",
                "href": "/profile/Kurt-Martin-2"
            },
            "answer_text": "I believe so. Here’s why: The key to understanding the timeline of Revelation is verse 4:1, which begins with “after these things…” (or afternoon this, depending on the version). This phrase in the original Greek is “meta tauta.” So after what things? The things being referenced prior to chapter 4 are the Church. In fact, the Church isn’t mentioned again in the rest of the book. Why is this? I believe it is because the Church has been taken up. In fact, in verse 1 of chapter 4 of Revelation, the angel speaking tells John: “Come up here, and I will show you things which must take place after this.” What is being said here? “Come up here” certainly sounds like the Rapture event, doesn’t it? This signifies the end of the Church Age as the Church is not mentioned again. Then the Angel says, “after this.” After what? The rapture event itself. What things are being shown? From this point on, they are tribulation events. One more piece of evidence for a pre-tribulation rapture: “So you also, when you see all these things, know that it is near—at the doors!” Matthew‬ 24:33‬ NKJV‬‬ Jesus is telling us what to look for before He takes His Church. If the rapture was in the middle of the tribulation, we’d know exactly when His return would be, because the Tribulation begins when the 7-year peace treaty is signed. Thus we would know the exact mid-point of the tribulation. ",
            "date": "Answered June 24, 2020",
            "views": "41",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Dennis Clough",
                "href": "/profile/Dennis-Clough"
            },
            "answer_text": "Answered more clearly in 1 Thessalonians. Here is a repost to answer your question: Are we living in the Great Tribulation?  Dennis Clough · June 13 Painting Contractor, Retired No. The church will be raptured first and then the Tribulation will begin. The first 3.5 years wil be relatively peaceful as the False Prophet deceives the political, commercial and religious worlds.Then he will drop his mask and begin his Satan empowered reign by persecuting Israel and systematically bringing the three previously mentioned centers of power to heel.The real message is to trust Christ as your Savior and escape Hell as well as the Great Tribulation. ",
            "date": "Answered June 21, 2020",
            "views": "44",
            "upvotes": " Answer requested by Krista Leach",
            "upvoters": [
                {
                    "user_id": "Pamela Cooper",
                    "user_href": "/profile/Pamela-Cooper-34"
                },
                {
                    "user_id": "Lisa Saker",
                    "user_href": "/profile/Lisa-Saker-1"
                },
                {
                    "user_id": "Bob Elton",
                    "user_href": "/profile/Bob-Elton"
                },
                {
                    "user_id": "Roland Rollerdore Jr.",
                    "user_href": "/profile/Roland-Rollerdore-Jr"
                }
            ]
        },
        {
            "author_info": {
                "name": "Shawn Jorgensen",
                "href": "/profile/Shawn-Jorgensen-2"
            },
            "answer_text": "The Rapture is actually best seen, not in the Book of Revelation, as clearly as in 2 Thessalonians 4:16–17: “ 16 For the Lord himself will come down from heaven, with a loud command, with the voice of the archangel and with the trumpet call of God, and the dead in Christ will rise first. 17 After that, we who are still alive and are left will be caught up together with them in the clouds to meet the Lord in the air. And so we will be with the Lord forever. 18 Therefore encourage one another with these words.” That phrase “caught up” is also referred” as “rapture”, which is an old English word meaning to get “carried away” or “caught up”. That word in Greek is |aJrpavzw“ or “harpazo” (pronounced har-pad'-zo), which means “to seize, catch (away, up), pluck, pull, take (by force)”.   ",
            "date": "Answered June 21, 2020",
            "views": "108",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Timo Juntenen",
                "href": "/profile/Timo-Juntenen"
            },
            "answer_text": "The Rapture is not described in the Book of Revelation. The Rapture is described in 1 Thessalonians, chapter 4, verse 17: “Then we which are alive and remain shall be caught up together with them in the clouds, to meet the Lord in the air: and so shall we ever be with the Lord.” Some people believe it will happen before the Tribulation, some believe it will happen after the Tribulation. Either way, it WILL happen. ",
            "date": "Answered June 21, 2020",
            "views": "27",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Dennis Cybulski",
                "href": "/profile/Dennis-Cybulski"
            },
            "answer_text": "There in NOTHING in the Book of Revelation that speaks of a “rapture”. The concept of a “rapture” did not come into existence until the 1700’s. A full discussion of the “rapture” and how it came to be a popular belief can be found here: The Rapture: A Popular but False Doctrine ",
            "date": "Answered June 21, 2020",
            "views": "78",
            "upvotes": " View 4 Upvoters"
        },
        {
            "author_info": {
                "name": "Robert Laundi",
                "href": "/profile/Robert-Laundi"
            },
            "answer_text": "i dont see it, and i never could reconcile that there would be a 7 year tribulation. or a 3 1/2 years of peace. in my studies, the resurrection happens first, and then ! those that are alive in Christ will be changed and caught up into heaven. so, its almost better to die from the pandemic, and then be worthy of the first resurrection to be raised up at the last day, ",
            "date": "Answered June 21, 2020",
            "views": "22",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Joel Koskinen",
                "href": "/profile/Joel-Koskinen-2"
            },
            "answer_text": "NO! The entire basis of this question is wrong! There is a 10 year Tribulation! The 7 year view is a FALSE DOCTRINE! And Christians are persecuted; before, during, and after tribulation! Well.. not really after, but there is a war still and work to be done. ",
            "date": "Answered June 21, 2020",
            "views": "30",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "D. Paul Walker",
                "href": "/profile/D-Paul-Walker-1"
            },
            "answer_text": "D. Paul Walker's answer to Why do you not believe in a pre-tribulation rapture? ",
            "date": "Answered June 21, 2020",
            "views": "36",
            "upvotes": " Answer requested by Krista Leach"
        }
    ]
}