{
    "title": "Am I the only one who can’t stand the character Claire in the Outlander TV series? - Quora",
    "tags": [
        "Outlander (TV series)",
        "Television",
        "Television Series"
    ],
    "response": [
        {
            "author_info": {
                "name": "EJ Jay",
                "href": "/profile/EJ-Jay-1"
            },
            "answer_text": "In the series I believe she’s supposed to appear as a head strong, intelligent, independent, modern woman who has found herself 2 centuries in the past. However, nothing about the decisions that she makes comes across that way. Each and every decision is made without her giving a thought to how the consequences could effect everyone closest to her, especially Jamie. She seems brash, self-righteous, privileged, selfish and completely unrealistic. I feel like it’s written by men who think this how a woman with these characteristics behave but in fact we are so much more complicated than that. And especially a woman who understands history and the roles women had during that time I’d expect her to try to fit in instead of pulling her “this isn’t right I know what’s better” card. Yes, her moral radar is usually correct but as a women in the 18th century NO ONE CARES WHAT YOU HAVE TO SAY YOU HAVE NO RIGHTS AT ALL. She keeps drawing attention to herself when all she has to do is zip it and listen. There are great many examples throughout the show where had she listened to someone else’s advice and taken on someone else’s perspective of, oh I don’t know someone who is actually FROM that time, she would’ve saved a great deal of trouble for everyone. A great female character that accomplishes the complexity of a woman who is imprisoned in a world that is not her own is Sansa Stark. She was a whiney naive little girl at first but her character growth was immense in order to survive and she does and you love her for it. I haven’t seen Claire grow one iota during the two seasons I’ve watched. It’s horrible watching her drag Jamie through her mess. It’s sloppy writing and is no longer charming no matter how wonderful the costumes, cinematography and music is. P.S the torture scene at the end of first season was COMPLETELY unnecessary. I stopped watching the show for about a year before I could convince myself to jump back into it. It’s a great example of how insinuation is powerful enough and you don’t need to show everything. P.p.s I have read that Claire in the books is a lot more quiet and methodical with her decisions so I blame this erroneous character choice on the writers of the series. thank you for coming to my Ted Talk. ",
            "date": "Answered May 26, 2020",
            "views": "589",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Liora Alizade",
                    "user_href": "/profile/Liora-Alizade"
                },
                {
                    "user_id": "Houmaira",
                    "user_href": "/profile/Houmaira"
                },
                {
                    "user_id": "Vee Kee",
                    "user_href": "/profile/Vee-Kee-8"
                },
                {
                    "user_id": "Lynne Bailey",
                    "user_href": "/profile/Lynne-Bailey-6"
                }
            ]
        }
    ]
}