{
    "title": "Am I gay if most of the time I have gay fantasies? - Quora",
    "tags": [
        "Gay Fantasies",
        "LGBTQ Issues",
        "Homosexuality",
        "LGBTQ"
    ],
    "response": [
        {
            "author_info": {
                "name": "Gary Stein",
                "href": "/profile/Gary-Stein"
            },
            "answer_text": "Well it is probably likely that you are gay if most of your sexual fantasy’s are about men if your a boy, or about females if your a girl. But don’t be in a big hurry about figuring things out if your a young teenager. Take your time date one of your crushes boy or girl see how that goes and repeat that a few times the answer will develop when it does you will know it’s really your authentic self if you let it come about naturally without rushing things. If your older and still not sure either date more and figure it out, or maybe get some counseling from a therapist that specializes in psycho social development issues. As far as coming out do not rush there either wait until your comfortable and have a plan for dealing with any worst case results such as being disowned by parents, losing your job, or losing a friend. Your not in anyway doing anything wrong if you stay in the closet until you finish university and have a job, or if you come out as a young teen, no timing is somehow more legitimate, nor does it make you a good or bad person, do what feels right to you. My suggestion is if you have supportive parents who you are sure will not react badly then come out young. If your parents are likely to react badly then stay in the closet until you finish your education or even longer as far as they are concerned. Attend college in a different state then the one your parents live in and be out there to a select group of friends but not to anyone from your home town who might tell your parents if there was ever a problem in that friendship. In a perfect world I believe being out when your a 13 year old is more likely for the person to avoid all the psychological problems caused by living in the closet. Living a lie causes stress, fear, loneliness, self esteem issues, PTSD, and can lead to suicide in extreme cases. So the less time one has to live a lie the better. But in this world being kicked out of your home as a teenager happens way more often to gay kids then any other cause of teen homelessness. Homeless gay teens have much higher suicide rates then other homeless teens, and the psychological damage caused by homelessness and rejection by family is much more severe then those caused by living a lie. ",
            "date": "Answered December 21, 2016",
            "views": "63",
            "upvotes": " View 6 Upvoters",
            "upvoters": [
                {
                    "user_id": "Seth Smith",
                    "user_href": "/profile/Seth-Smith-241"
                },
                {
                    "user_id": "Gerald Schaefer",
                    "user_href": "/profile/Gerald-Schaefer-1"
                },
                {
                    "user_id": "Paul Otero",
                    "user_href": "/profile/Paul-Otero-3"
                },
                {
                    "user_id": "Brian D",
                    "user_href": "/profile/Brian-D-74"
                },
                {
                    "user_id": "Denis O'brien",
                    "user_href": "/profile/Denis-Obrien-10"
                },
                {
                    "user_id": "Jae Starr",
                    "user_href": "/profile/Jae-Starr"
                }
            ]
        },
        {
            "author_info": {
                "name": "Trey McIntyre",
                "href": "/profile/Trey-McIntyre"
            },
            "answer_text": "Not necessarily. And I am not aware of any evidence that supports a claim that fantasies cause homosexuality. But there is certainly a causal relationship in the other direction: if you’re gay, then you’ll have gay fantasies. If you Google for it, I am certain you will find various studies that show that straight people do fantasize about same-sex sexual contact now and then even if they do not pursue it. Rather, I think you have to look at the prevalence, frequency, and quality of your sexual fantasies over all. If you think about same-sex sex all the time, well, that might be a sign that you’re gay. If you only fantasize about it occasionally, perhaps you’re bisexual. If you are very young, though: I would be cautious about regarding your sexual fantasies as some sort of irrefutable test of your sexual identity. Young people are often very easily aroused by all number of things. As you age, you’ll probably find some greater consistency in what appeals to you. ",
            "date": "Answered May 9, 2018",
            "views": "55",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Seth Smith",
                    "user_href": "/profile/Seth-Smith-241"
                }
            ]
        },
        {
            "author_info": {
                "name": "Steve Alexander",
                "href": "/profile/Steve-Alexander-62"
            },
            "answer_text": "A2A Homosexuality is romantic attraction,sexual attraction, orsexual behaviorbetween members of the same sex or gender. As a sexual orientation, homosexuality is an enduring patternof emotional,romantic, and/orsexualattractions to people of the same sex.[1] That is what it means to be gay. Homosexual fantasies, in and of themselves, do not necessarily amount to one being gay. However, they may be an indicator of homosexuality. If they persist in duration and intensity, they indicate a sexual attraction to members of the same sex. That satisfies the definition of homosexuality as a sexual orientation. Taking your question literally, nothing “makes” a person gay other than one’s DNA. Same-sex sexual orientation is an innate and immutable heritable trait.[2] It’s hard coded in one’s DNA. That’s what “makes” a person gay. Homosexual fantasies do not cut it except in so far as they accurately indicate same-sex sexual orientation, or in so far as they are harbingers of homosexual behavior yet to come. Footnotes[1] Homosexuality - Wikipedia[2] Steve Alexander's answer to What's your unquestionable proof that homosexuals are \"born this way\" and are unchangeable?",
            "date": "Answered May 9, 2018",
            "views": "84",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Seth Smith",
                    "user_href": "/profile/Seth-Smith-241"
                }
            ]
        },
        {
            "author_info": {
                "name": "Anamika Pareek",
                "href": "/profile/Anamika-Pareek-2"
            },
            "answer_text": "Trust me! What you want can be completely different from what you fantasize. Though one majorly fantasizes about what one wants. But vice versa can always not be true. I know this because I fantasize a lot of straight sex but that's not what I want. I hope this helps. ",
            "date": "Answered December 25, 2016",
            "views": "84",
            "upvotes": " View 22 Upvoters",
            "upvoters": [
                {
                    "user_id": "Pintu Mardi",
                    "user_href": "/profile/Pintu-Mardi"
                },
                {
                    "user_id": "Moskri Loco Pajdoman",
                    "user_href": "/profile/Moskri-Loco-Pajdoman"
                },
                {
                    "user_id": "Felipe Motta",
                    "user_href": "/profile/Felipe-Motta-10"
                },
                {
                    "user_id": "Miguel García",
                    "user_href": "/profile/Miguel-García-43"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/TAO-MAITREYA"
                },
                {
                    "user_id": "Sarah Seton",
                    "user_href": "/profile/Sarah-Seton"
                },
                {
                    "user_id": "Vishal Singh",
                    "user_href": "/profile/Vishal-Singh-2268"
                },
                {
                    "user_id": "Akshita Mahajan",
                    "user_href": "/profile/Akshita-Mahajan-9"
                },
                {
                    "user_id": "Ongfa Wakhet",
                    "user_href": "/profile/Ongfa-Wakhet"
                },
                {
                    "user_id": "Fawad AkramTm",
                    "user_href": "/profile/Fawad-AkramTm"
                },
                {
                    "user_id": "S.Sharma",
                    "user_href": "/profile/S-Sharma-72"
                },
                {
                    "user_id": "Solanki Vikram",
                    "user_href": "/profile/Solanki-Vikram"
                },
                {
                    "user_id": "Kay Jay",
                    "user_href": "/profile/Kay-Jay-122"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/Laurie-Hunter-3"
                },
                {
                    "user_id": "Vijeta",
                    "user_href": "/profile/Vijeta-11"
                },
                {
                    "user_id": "Parth Solanke",
                    "user_href": "/profile/Parth-Solanke"
                },
                {
                    "user_id": "Gina Langridge",
                    "user_href": "/profile/Gina-Langridge"
                },
                {
                    "user_id": "Rohit Singh",
                    "user_href": "/profile/Rohit-Singh-807"
                },
                {
                    "user_id": "Meagan Ratliff",
                    "user_href": "/profile/Meagan-Ratliff"
                },
                {
                    "user_id": "Sailesh Nanavati",
                    "user_href": "/profile/Sailesh-Nanavati"
                },
                {
                    "user_id": "Amit Chaudhary",
                    "user_href": "/profile/Amit-Chaudhary-30"
                },
                {
                    "user_id": "Madhurima Tripathi",
                    "user_href": "/profile/Madhurima-Tripathi"
                }
            ]
        },
        {
            "author_info": {
                "name": "Walter Page",
                "href": "/profile/Walter-Page-7"
            },
            "answer_text": "Idk. But fantasize alot about being gay and i want to just give in to all the gay fantasies that I've ever dreamed of. And I've had alot. I kinda wanna be gay but a bit scared to be. But damn I dream and think about getting down on my knees and taking a huge hard cock in my mouth. I want to feel that hard shaft and lick his head all over and suck him till his dick is throbbing and then I want to bend over a bed and let him push his dick deep I side my ass. And I want him to fuck my ass so good and slow so I can feel his dick slide in and out of me until he fills me up with every drop of cum he has. Idk why I love to look at big dicks and think about what I want to do with it. I might be gay. Idk ",
            "date": "Answered January 11, 2020",
            "views": "16",
            "upvotes": " View 6 Upvoters",
            "upvoters": [
                {
                    "user_id": "Richard Scrapneck",
                    "user_href": "/profile/Richard-Scrapneck"
                },
                {
                    "user_id": "Morgan",
                    "user_href": "/profile/Morgan-1164"
                },
                {
                    "user_id": "Gerald Schaefer",
                    "user_href": "/profile/Gerald-Schaefer-1"
                },
                {
                    "user_id": "Brad Lund",
                    "user_href": "/profile/Brad-Lund-9"
                },
                {
                    "user_id": "Gary White",
                    "user_href": "/profile/Gary-White-475"
                },
                {
                    "user_id": "Liam Robertson",
                    "user_href": "/profile/Liam-Robertson-63"
                }
            ]
        },
        {
            "author_info": {
                "name": "Jim Grupé",
                "href": "/profile/Jim-Grupé"
            },
            "answer_text": "Most likely yes. Fantasies come from our subconscious, and we don’t conrol them they way we do our conscious behavior. On a conscious level, you are more likely to behave he way you have been told you should behave, and feel what you are told you should feel. But the subconscious mind does its own thing, and is a better indicator of what you really want. At the conscious level, you can fake it, but after a while ‘faking it’ is not very satisfying. ",
            "date": "Answered May 6, 2018",
            "views": "23",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Richard Scrapneck",
                    "user_href": "/profile/Richard-Scrapneck"
                },
                {
                    "user_id": "Erik Boggs",
                    "user_href": "/profile/Erik-Boggs-8"
                }
            ]
        },
        {
            "author_info": {
                "name": "Craig Bullard",
                "href": "/profile/Craig-Bullard"
            },
            "answer_text": "*edit This is a useless answer to this question Quora. WTF! Change the question & then the answers don’t fit! No. It makes you what’s called bi-curious & is a lot more common than you may think. Some people choose to experiment, others don’t. It’s up to you. ",
            "date": "Updated May 12, 2018",
            "views": "14",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Adrian Michael Nicotra",
                    "user_href": "/profile/Adrian-Michael-Nicotra"
                }
            ]
        },
        {
            "author_info": {
                "name": "Julia Hudson",
                "href": "/profile/Julia-Hudson-7"
            },
            "answer_text": "Yes, I think you are. If you have that kind of fantasy, no need to be worried. We are offering the best and reliable dating and relationship services in Australia for romantic people. Just visit us and hire the most sensual Gay escorts in Australia and have fun. ",
            "date": "Answered December 23, 2016",
            "views": "16",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Frans van Oostveen",
                    "user_href": "/profile/Frans-van-Oostveen"
                }
            ]
        },
        {
            "author_info": {
                "name": "Mari Ross",
                "href": "/profile/Mari-Ross"
            },
            "answer_text": "yes, yes you are. ",
            "date": "Answered December 21, 2016",
            "views": "571",
            "upvotes": "0"
        }
    ]
}