{
    "title": "Any good obscure horror books or stories? - Quora",
    "tags": [
        "Horror Stories",
        "Horror (genre)",
        "Horror Movies",
        "Book Recommendations"
    ],
    "response": [
        {
            "author_info": {
                "name": "Sam Moss",
                "href": "/profile/Sam-Moss-8"
            },
            "answer_text": "The thing about horror fiction is that it is all obscure, and all underground. Even if you go to a reasonably well stocked book stone, chances are the offering will start at King and go all the way to Koontz and there won’t be a whole lot else. But a lot of people who are ‘into’ horror might not put King or Koontz in their top ten (or hundred). The last decade or so has seen a blossoming in the horror scene, not only in the quality and quality of writers and work, but in the range of topic, sub-genres and ideas. Subgenres like Cosmic Horror, Eco-Horror and Body Horror have had a burst in activity and it is likely that the luminaries in these areas are not, and never will be, household names. Within the latter part of the 19th and early 20th century writers like Algernon Blackwood, H.P. Lovecraft, William Hope Hodgson, Arthur Machen and Robert W. Chambers set the groundwork for what we think of horror today. Many of their stories are well worth reading now, others have aged poorly and may only be interesting as historical artifacts. As most of these works are in the public domain you can download them for free, legally, from resources like Project Gutenberg. Writers like Shirley Jackson, Gene Wolfe, T.E.D Klein and James Tiptree Jr. wrote with the second half of the 20th century and are widely regarded as master. Thomas Ligotti, with his specific brand of ‘philosophical’ horror and tropes like puppets, mannequins and decrepitude has make an outsized mark on horror fiction. Penguin reissued some of his work a few years ago. Authors who are writing today like Jeff Vandermeer, Samantha Schweblin, Kristi DeMeester, Brian Hodge, Kay Chronister, J. D. Padgett, Matt Cardin and Christopher Slatsky (among so many others) are absolutely worth checking out. Since many of these writers work in the short form there are also a good number of journals, magazines, podcasts and anthologies that pull together many different writers. Psuedopod, Uncanny Magazine, Nightmare Magazine, Vastarien, Black Static, The Dark, Years Best Horror (ed. Ellen Datlow), Nightscript (ed. C.M. Muller), Shadows and Tall Trees, and so on are all worth checking out. ",
            "date": "Answered June 25, 2020",
            "views": "108",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Sean Terrence Best",
                "href": "/profile/Sean-Terrence-Best"
            },
            "answer_text": "A good obscure horror book or story is one entitled Cloak of the Devil written by Sean Terrence Best. The reason this is such a good horror book is because secretly hidden in coded message form among the startling pages of this shocking book can be found the true purpose and method of construction of the pyramids of Ancient Egypt - an esoteric fact that will induce an altered state of consciousness in the minds of readers that will open a luminous psychic portal into latent genetic memory of the origin of the human species on planet Earth linked to the grim unspeakable plot for why we were colonized here in the first place. It’s the impetus that drove China to join the World Trade Organization exactly three months after the terrorist attacks in New York City. Amazon.com: Cloak of the Devil eBook: Sean Terrence Best: Kindle Store ",
            "date": "Answered December 30, 2018",
            "views": "156",
            "upvotes": " Answer requested by Edward Adantain",
            "upvoters": [
                {
                    "user_id": "IJ Wilson",
                    "user_href": "/profile/IJ-Wilson"
                }
            ]
        },
        {
            "author_info": {
                "name": "Harpreet Delacruz",
                "href": "/profile/Harpreet-Delacruz"
            },
            "answer_text": "Jude the Obscure (Dover Thrift Editions)  Powerful and controversial from its 1895 publication to the present, Jude the Obscure scandalized Victorian critics, who condemned it as decadent, indecent, and degenerate. Between its frank portrayals of sexuality and its indictments of marriage, religion, and England's class system, the novel offended a broad swath of readers. Its heated reception led the embittered author to renounce fiction, turning his considerable talents ever afterward to writing poetry.Hardy's last novel depicts a changing world, where a poor stonemason can aspire to a university education and a higher place in society — but where in reality such dreams remain unattainable. Thwarted at every turn, Jude Hawley abandons his hopes, is trapped into an unwise marriage, and pursues a doomed relationship with his free-spirited cousin, Sue Bridehead. The lovers find themselves equally incapable of living within the conventions of their era and of transcending its legal and moral strictures. Hailed by modern critics as a pioneering work of feminism and socialist thought, Hardy's tragic parable continues to resonate with readers. ",
            "date": "Answered November 26, 2018",
            "views": "310",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Suneish Basu",
                    "user_href": "/profile/Suneish-Basu"
                },
                {
                    "user_id": "C Rosee",
                    "user_href": "/profile/C-Rosee"
                }
            ]
        },
        {
            "author_info": {
                "name": "Adam Jones",
                "href": "/profile/Adam-Jones-426"
            },
            "answer_text": "H.P. Lovecraft is a must-read for anyone looking to read some masterful horror stories. He’s was an inspiration for every horror writer, Stephen King & Clive Barker, among them. ",
            "date": "Answered November 26, 2018",
            "views": "76",
            "upvotes": " View 2 Upvoters"
        }
    ]
}