{
    "title": "Approximately what percentages of self-published books make money versus traditionally published books? - Quora",
    "tags": [
        "Self-Publishing",
        "Book Publishing",
        "Publishing"
    ],
    "response": [
        {
            "author_info": {
                "name": "Jacob Noah",
                "href": "/profile/Jacob-Noah-13"
            },
            "answer_text": "Self-publishing is becoming quite famous and a number of new authors are more attracted to this method of publishing. Both traditional and self-publishing come with their own benefits and settlements. However, I believe money isn’t a relevant variable in conveying which option to prefer than the other. In traditional, you usually get to receive a small amount of advance and then you don’t see any money for another 6 to 12 months. These houses will cut off the book’s profit and will cover all the cost of the publishing in the procedure. In self-publishing, every penny you earn belongs to you. A preferable method will be to publish in every medium if you are opting for self-publishing as it will increase your chances of gaining profit as it is beneficial to have 50% of a large size pizza than 90% of a small slice. Then in figures, you may preferably earn more than the other publishing methods. ",
            "date": "Answered May 3, 2019",
            "views": "83",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Mohd Sikandar",
                "href": "/profile/Mohd-Sikandar-6"
            },
            "answer_text": "There is no denying the fact that after internet revolution, self-published books are earning more than traditionally published books. But, there are no official estimates as to the number of self-published books earning more than traditionally published books. As such, self publishing has been continuously on the rise. It is better to get your book self published. There are many self publishing companies in India, but few stand out. One of them is Online Gatha. Based in Lucknow, the company has been in the business of publishing and promoting the works of budding authors, creating a revolution in the literary world.  ",
            "date": "Answered April 24, 2019",
            "views": "30",
            "upvotes": "0"
        }
    ]
}