{
    "title": "Are there any good Harry Potter fics about Hogwarts in certain moments of the books? - Quora",
    "tags": [
        "Hogwarts School of Witchcraft and Wizardry (fictional school)",
        "Harry Potter (book series)",
        "Harry Potter (creative franchise)",
        "Existence Question"
    ],
    "response": [
        {
            "author_info": {
                "name": "Madelyn Glymour",
                "href": "/profile/Madelyn-Glymour"
            },
            "answer_text": "Edit: When I wrote this answer, the question asked \"Are there any good Harry Potter fics about Hogwarts reading certain moments of the books?\" There is a common genre of fanfiction that involves Harry Potter characters communally reading and reacting to the Harry Potter books, which is what I took the question to be asking about. There are plenty of good Harry Potter fics that don't involve characters reading the books. --- There's a philosophical concept called the black swan problem. The black swan problem is a thought experiment, and it basically goes like this: Suppose you want to prove that all swans are white. Suppose further that you can't observe every swan in the world. Then you have a problem: No matter how many white swans you observe, unless you've seen every single one of them, there's always a possibility that the next one could be a black swan. The black swan problem deals with the problem of using a sample of a population to draw conclusions about the population as a whole--which you might recognize as being the basic aim of most scientific fields. Science has dealt with the black swan problem by developing the fields of probability and statistics, which allow us to make inferences from samples. Those inferences aren't certain, but they're highly likely to be true. I have not read every single fanfiction in which Harry Potter characters read the Harry Potter books. So I can't tell you with certainty that there are no good ones. But I've certainly never come across one that was worth reading. ",
            "date": "Updated July 26, 2015",
            "views": "11",
            "upvotes": " View 2 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Sabreen Rashid",
                    "user_href": "/profile/Sabreen-Rashid"
                },
                {
                    "user_id": "Ben Wheatall",
                    "user_href": "/profile/Ben-Wheatall"
                }
            ]
        },
        {
            "author_info": {
                "name": "Guillaume L'Her",
                "href": "/profile/Guillaume-LHer"
            },
            "answer_text": "I am really unsure of what you are asking here. I'm going to assume that you mean the simple question :Are there any good fanfiction of the Harry Potter series?  I must disclaim first that all tastes exist. Hell, some people don't even like Harry Potter.  That said, the only fanfiction that interested me and for which it wasn't that improbable to imagine reading Rowling is the James Potter series from G Norman Lippert. http://www.jamespotterseries.com/muggle_index.html It tells the story of James Potter, son of Harry Potter. I very much dislike fanfiction in general, but these are basically books of their own, excellent work. You won't get any closer to a real Rowling book than that, in my honest opinion. ",
            "date": "Answered June 25, 2015",
            "views": "431",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Charlene Rodriguez",
                    "user_href": "/profile/Charlene-Rodriguez"
                }
            ]
        },
        {
            "author_info": {
                "name": "Amber Nicole Leese",
                "href": "/profile/Amber-Nicole-Leese"
            },
            "answer_text": "I'm not really sure what you mean but if your asking about good fan fiction then wattpad is great there are hundreds, it depends what you are looking for because if you like Dramione fan fic then I would suggest 'A man can change' by imaginarykrystal I am reading it for the third time this year and it just kind of sticks in your mind but they're other really good ones too and obviously they're loafs of genres in this group on fan fiction; but I would definitely recommend wattpad. ",
            "date": "Answered July 8, 2015",
            "views": "275",
            "upvotes": "0"
        }
    ]
}