{
    "title": "Are textbooks outdated? - Quora",
    "tags": [
        "Digital Publishing",
        "Textbooks",
        "Learning"
    ],
    "response": [
        {
            "author_info": {
                "name": "Mark Schneider",
                "href": "/profile/Mark-Schneider-7"
            },
            "answer_text": "No. I think we are talking about 2 different things and 3 different applications.  - The school system- University - Real life  Education - school system:There will always be demands that courses in the school system match a certain curricula and hence a certain standard that meets the criterias of the local board of education. Not every database related information that could be bought with a subscription passes muster, compared to the entire editing system for school books.For sure the media might change from paper to electronic in the future, but this would also demand a high penetration of computers in classrooms. But not every school system in the world is equipped with the latest laptops.  Also from a pedagogic point of view, these are still young people that are learning to deal with the subject and to (if necessary) get basic theories hammered in.For sure, letting the students find information is being taught at a very young age and websites like Khan Academy make a big difference. But as a basis there will be a textbook for the basics and the internet and online information to complete the whole picture.   University: For research purposes to see earlier scientific theory. The whole peer review  system, academia in general as well as the publishing system fuels as well  that many people still desire to have books since they are easier to handle. Many students don't know Jack in the beginning, but can learn much. It is therefore necessary to have several information sources open, were the quality is  important as well. It is true that for academic purposes not many textbooks pass muster, but the prof use compendiums of several books to gather theories together. Too many distribution systems and the printing industry rely on that books are published as well.  Real life: For the gathering of new information and getting access to the latest article in google scholar or digital newspapers. Getting the absolute latest data for development etc is online.  So we need to see what we want and when we need it.  Further development in IT, environmental demands and changes in media format might create a stronger movement towards digital publishing. But presenting past and future knowledge with new editing techniques in a book format to facilitate a deeper learning experience (we are all different and have different educational backgrounds) as well as the entire library system  (with all information (not everything is digital) will still live on for a long time. Much due to that science and generation of theory is created after the fact and is lagging information. Not everyone can deal with piecemeal information. A larger group of individuals might need or want more. For example textbooks including a CD or a weblink for further updates might for example be an additional variant which is already used in several subjects.In many subjects, the language is also totally different in textbooks, which might be of importance in many subjects from a pedagogic point of view. ",
            "date": "Updated October 8, 2014",
            "views": "862",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Tomangtangmo Sritarat",
                    "user_href": "/profile/Tomangtangmo-Sritarat"
                }
            ]
        },
        {
            "author_info": {
                "name": "Marshall E. Gass",
                "href": "/profile/Marshall-E-Gass"
            },
            "answer_text": "Textbooks were the origin design to contain specific learning information. That information was basic to the subject being learned. A little after the Caxton Press textbooks were used as not other form of communication and containment of knowledge was available. Teachers also came into existence round about the same time. ^Their job was to ‘supervise’ the knowledge in the textbook and make sure students got the basics. Thats how curriculum also came into existence,and qualifications and degrees and learned people. They all derived their knowledge from textbooks. However, textbooks contained only one type of staid knowledge with no opinions and different viewpoints expressed. So students learned like sheep. It served its purpose in the years when communication was limited to paper and pencil and curriculum and teachers. In the digital age, textbooks are becoming obsolete. The same thing is available on different media and a thousand viewpoints are also available. In today’s world textbooks cannot keep with the rapid explosion of media. Learning is no more confined to pages on a book. You learn what you want and when you want. But schools being schools and teachers being teachers- and both entities being paid as keepers of knowledge and desperately holding on to their jobs ( and bamboo canes and detentions) they will do everything possible to produce textbooks 0f a different kind. Be it digital, websites, curriculum design, homework and everything else to make you subservient to the knowledge they wish to distribute. Theworld is a different place. There is no point in learning a whole lot of stuff which has no use. Today’s student learns what is important and necessary for the moment. Students are lifelong learners without textbooks. The Khan Academy- Khan Academy has thousands of courses and by far greater than any Textbook or teacher or school can provide. This is modern education. With Mr. Google and Mrs. YouTube as teachers students don’t need gate-keepers like school and teachers. But hush- there is still some time to go before the antique system will roll over and die! And then to answer your question. Yes. Textbooks are dying a slow death under the pervasive onslaught of digital learning. Its have-computer will travel. But listen, Mom and Dad will still march you off to school to learn. As a retired teacher I knew whole classes of students who knew ten times more than me in my specialised subject. Yet at the start of the school year each one got textbooks to learn from- and computers. All I know is that the pages of textbooks made great paper darts and aeroplanes and explicit graffiti. But I was not the bossman so textbooks made great airplanes.Yes. ",
            "date": "Answered October 3, 2016",
            "views": "612",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Elizabeth Garner",
                    "user_href": "/profile/Elizabeth-Garner-1"
                },
                {
                    "user_id": "Ellie Quent",
                    "user_href": "/profile/Ellie-Quent"
                }
            ]
        },
        {
            "author_info": {
                "name": "Alexandre Campos",
                "href": "/profile/Alexandre-Campos-9"
            },
            "answer_text": "No, they are not. Maybe they hardly will. Despite the technology efforts to improve the way we read text in other media, it’s not comfortable to read them on smartphones or tablets. We can read an intire book on those devices but the display’s constant light tires the human eyes. Even if you adjust the light intensity, it’s not that nice. In terms of ease, of course they had lost ground to online content, since lots of information are about one click ahead. But several of those sources have no proof reader to heed their quality or verity. In the other hand, books had, at least, a few of their truthfulness evaluated by the publisher, because there’s also its name written on the literary work. And books are more malleable than gadgets (and I like the paper texture). Devices like Kindle took the right path making use of digital ink (a surface that has a similar effect to a real ink on paper). Maybe when devices with such technology become more popular, books will be at risk. But not now. ",
            "date": "Answered October 5, 2016",
            "views": "305",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Dallin Bastian",
                "href": "/profile/Dallin-Bastian"
            },
            "answer_text": "Yes, modern communication techniques make the whole notion of pigments smeared on pressed wood fibers collected in heavy volumes outmoded. The world changes every day. In the past, a printed and bound book was the best we could do. At the time, that was considered up to date. Today, we have must faster methods of communication. By the time the typical textbook is printed and shipped to the recipient or placed on the shelf its almost always what we would consider out of date. There are, of course, exceptions. History books are technically not out of date because the subject matter is basically not in a state of flux. Even in history there are revisions that happen pretty frequently but it's probably not hard to get a textbook published inside that window. Ultimately, a well written discussion of a topic of interest is never out of date. This is due to the fact that at worst, it's a somewhat behind the times but interesting historical perspective, and at best, it's an excellent exposition of the topic written in a contextually aware style that never ages. Have a nice day. ",
            "date": "Answered October 1, 2014",
            "views": "359",
            "upvotes": "0"
        }
    ]
}