{
    "title": "Are there any good books about successful civil engineers? - Quora",
    "tags": [
        "Engineers",
        "Civil Engineers",
        "Civil Engineering",
        "Existence Question"
    ],
    "response": [
        {
            "author_info": {
                "name": "Sambit Acharya",
                "href": "/profile/Sambit-Acharya-2"
            },
            "answer_text": "I am reading books by designers -Guy Nordenson and Charles H. Thornton. Guy Nordenson's book is called \"Patterns and Structure: Selected Writings\". I got the book after Guy Nordensons (Structural engineering professor at Princeton University) visited Cooper Union. The book \"Patterns and Structure\" covers essays written on a range of topics from technical reports on seismic design, to engineering history and architectural literature/criticisms. He does mention his personal life, but the focus is on the writings about engineering, art, architecture and literature. Charles H. Thornton's book is called \"A life of Elegant Solutions\" is about the life of Dr. Charles H. Thornton. Richard Tomasetti and Charles Thornton started the company Thornton Tomassetti (which has recently merged with another famous structural engineering firm called Weidlinger Associates). The book is written in an autobiographical format. The book is segmented into three parts consisting his origins, professional life and goals/innovation to inspire the next generation. It details his personal and professional life in New York, Chicago, Taipei, and Malaysia. His goal of writing the book was to get people excited about joining the field of ACE (Architecture, Engineering and Construction). ",
            "date": "Updated December 5, 2017",
            "views": "433",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "阿里 Bajjar",
                    "user_href": "/profile/阿里-Bajjar"
                }
            ]
        },
        {
            "author_info": {
                "name": "Amos Bull",
                "href": "/profile/Amos-Bull"
            },
            "answer_text": "You can download this book by accessing this link >>> Land Development for Civil Engineers 2nd Edition  A hands-on guide to beginning, managing, and completing all landdevelopment projects Land Development for Civil Engineers provides essential facts andrecommendations for bringing the nonstructural features of a landdevelopment project to successful completion. Regulations,standards, and permit data have all been thoroughly updated,including EPA General Stormwater Permits and the agency's rulingson water supply, ADA considerations, American Concrete PipeAssociation bedding requirements, wetland permitting changes, andother pertinent information. This single-source reference covers all engineering, legislative,and administrative concerns, including design procedures,construction contracts, development guidelines, and finalinspections. New techniques for project management, including useof intranet and extranet management tools on the Internet, arefeatured, in addition to the latest material on:* Soil remediation and brownfield development* GPS use and new surveying techniques* Streetscaping* Developments in design-build methods* Photogrammetric surveys and GIS use in area and siteplanning Complete with hundreds of maps, diagrams, drawings, tables, andcharts, this Second Edition is the ideal reference for civil designengineers, site design analysts, and students, as well asgovernment personnel, developers, landscape architects, urbanplanners, civil engineering technology students, land surveyors,and geotechnical, structural, transportation, and environmentalengineers. ",
            "date": "Answered October 6, 2018",
            "views": "307",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "ADWARDO Maksabo",
                    "user_href": "/profile/ADWARDO-Maksabo"
                }
            ]
        }
    ]
}