{
    "title": "Are difficult books ever easier in translation? - Quora",
    "tags": [
        "James Joyce (author)",
        "Localization (interface design)",
        "William Shakespeare",
        "Translation Question",
        "Literature"
    ],
    "response": [
        {
            "author_info": {
                "name": "Neha Bagchi",
                "href": "/profile/Neha-Bagchi"
            },
            "answer_text": "It depends on a lot of things, including how good your translator is and how language-heavy (versus plot-heavy) the book is. \"Difficult\" texts are usually difficult because of the use of language, not the plot. Text whose value comes from the way language is used will be more difficult to translate.  Assuming you have a really good translator, the translated work will use language as dense, intense, nuanced and intricate as the original. A good translator will balance translating the words of the original text with the sense of the original text. If a story is primarily plot-driven, it will be easier to translate, and the translated work is much more likely to be exactly as easy or difficult to read as the original.  What's that? You want to know more? Okay, let's skip the analysis of plot-driven texts (since that's not generally what makes a book difficult) and focus on language-driven text.  Say you are translating a work from Language A to Language B. Now, imagine two modes, or guiding principles for translation: \"word for word\" and \"sense for sense.\" Ready? Here we go. One: word for word In \"word for word\" mode, the translator translates each word from Language A into Language B. You, the reader, will get the closest thing in Language B to \"raw data\" that represents the original work in Language A, short of actually being in Language A. This mode is your best bet for minimizing any \"judgement calls\" on the translator's part. The grammar and syntax might be messed up: less if the languages are closely related, like French and Spanish, or like Bengali and Oriya; more if they are largely unrelated, like Hebrew and English. Idioms will likely be lost in translation. The translator risks capturing denotative meanings at the risk of losing connotative meanings, both at word-level and at sentence-level. So you, the reader will have to do lots of \"heavy lifting\" in order to synthesize the translated words and reconstruct the sense of the original. But you have more control in that recreation process than you would in the other mode. Two: sense for sense In \"sense for sense\" mode, the translator uses her knowledge of the linguistic and cultural context of the work to recreate the world and the story and the sense of the original work, in Language B.  As a reader in Language B, you are held hostage by your translator. You might be able to tell whether she did a good job, but you might not. You might be reading something that is very good but not really like the original--but you won't know. You have to live with the translator's judgements and biases. Three: the Buddha wins again As you read this, you have already thought to yourself that the answer is in the middle. Oh, that clever Buddha and his Middle Path! It's about balance. Language is not just strings of words; there is music and rhythm to every language, and culture (the shared experiences of people speaking that language) is inextricable. Luckily, for some works, there exist multiple translations and the reader can choose a translation based on whether he is looking for least-process, most-raw data, or something that is more synthesized. If you are a serious about a text and can't read the original language, your best bet is to read at least two translations, one that is more literal and in \"word for word\" mode, and one that is more in \"sense for sense\" mode. I struggle with Coleman Barks' translations of Rumi, for many reasons. I can't read ancient Persian, and anyway most of Rumi's work was spoken, not written. Sometimes I read a poem that Barks has \"translated\" and there is a glaring anachronism--Rumi couldn't have written this--and in that moment, my trust in Barks falters. Then there are translations that I read side by side with the original. I read Beowulf in the original Anglo-Saxon; then I read a dry, literal, side-by-side translation that helped me understand the \"raw data\"; and finally I read Seamus Heany's much-lauded translation, which found a lovely balance and stayed close to original in word and in sense. Four: What should you do if you can't read the original? Don't stress it. If you have only one translation, read it, enjoy it for what it is, and know that you might never know what you missed. And if you have multiple translations, read them all to reconstruct, as much as you can, the original text. Five: But what about the original question? The what? Oh... right, yes. If you have a good translator, she will find a Buddha-like balance between \"word for word\" mode and \"sense for sense\" mode. So she will hew closely to the original words, modifying them to preserve the integrity of the destination language (Language B), and using her judgment to transform idioms and inflections in the original so that the sense is preserved in the translation. Works like Shakespeare depend heavily on language; these will be the most difficult to translate. A book that is plot-heavy, where the language is not much the focus, will be easier to translate. If a reader is serious about Joyce or Shakespeare, he has to be willing to read the original. I learned Spanish so that I could read Neruda. And if you're content with what you have, then you accept your translator's biases and limitations and move on. I will not be signing up for Ancient Persian 101 any time soon. ",
            "date": "Answered December 15, 2012",
            "views": "166",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "David A K Lichtenstein",
                    "user_href": "/profile/David-A-K-Lichtenstein"
                },
                {
                    "user_id": "Maureen Nalepa",
                    "user_href": "/profile/Maureen-Nalepa"
                }
            ]
        },
        {
            "author_info": {
                "name": "Armin Hanik",
                "href": "/profile/Armin-Hanik"
            },
            "answer_text": "I got into Shakespeare and Joyce via the excellent German translations. While I read Joyce in English these days, I  still stick to the German for Shakespeare.  The current Ulysses translation is by Wollenschlaeger, iirc, and is really a work of art on its own. It does not make him clearer where he is obscure, but imagine finding words in a foreign language with the same intelligent playfulness that the master had. Highly laudable. I don't think that translating it back would clarify anything.There are 4 translations into German of the \"Anna Livia\" chapter in Finnegan's Wake that I'm aware of. They had to find new ways to play with the language (like fitting all the river names (in German) into the narrative), so the original is highly skewed, but reading all 5 texts in turn is fun and adds clarification by showing what someone else made out of it.Shakespeare was translated into German during Goethe's time, and all the translations (still current, printed, used) were by poets and writers from Ludwig Tieck's circle. There are mistakes and misunderstandings (left standing and annotated), but the language is more modern, clearer, the sentence structure is more obvious. I find them much easier to read than the original. I'm sure that if you translated them back to English, you would lose a lot of the beauty of William, but you would gain immensely in clarity. But then, you could simply translate Shakespeare into modern English (I'm sure this has been done), and skip one step.Actually, I'm sure there is an attempt to translate the Wake into basic English somewhere. So, you are in a bind: If translation means simplifying and modernizing, yes, the translation is easier to read.But you could do that straight in English. ",
            "date": "Answered February 23, 2014",
            "views": "309",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Adam Gerow",
                    "user_href": "/profile/Adam-Gerow"
                }
            ]
        },
        {
            "author_info": {
                "name": "Bruce Andrews",
                "href": "/profile/Bruce-Andrews-1"
            },
            "answer_text": "I like the Wilhelm Baynes edition of the i ching, despite its being a double translation (Chinese to German to English).  One might argue that this is due to the excellent editing job more than the translation, but regardless, it is a clear and readble (if somewhat dense) edition of a work that can be impenetrable depending on how you approach it. ",
            "date": "Answered March 28, 2014",
            "views": "154",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Adam Gerow",
                    "user_href": "/profile/Adam-Gerow"
                }
            ]
        }
    ]
}