{
    "title": "Are NCERT books enough for the UPSC exams? - Quora",
    "tags": [
        "National Council of Educational Research and Training (NCERT)",
        "Union Public Service Commission of India",
        "Books"
    ],
    "response": [
        {
            "author_info": {
                "name": "A R Khan",
                "href": "/profile/A-R-Khan-39"
            },
            "answer_text": "To answer your question, I would first submit that NCERT books are necessary but not sufficient for the UPSC Civil Services examination. NCERT or the National Council for Educational Research and Training is a governmental body that is responsible for modelling standard textbooks for school education. These textbooks are designed in such a manner that they gradually train the school students to eventually pursue their chosen disciplines of studies in their graduation courses. In that respect, NCERT textbooks build the foundation of students across various disciplines. As far as the UPSC Civil Services examination is concerned, it has three stages, i.e., Preliminary, Mains and Interview and it would be safe to suggest that at all these stages one has to go beyond the NCERT textbooks. A perusal of the topics prescribed in the Preliminary syllabus along with the previous years’ question papers reveal that the level of this examination is that of 10+2. However, the coverage of the question in the Preliminary examination is much wider than what is usually covered within the NCERT books. Therefore NCERT books are necessary for building the foundation and clearing basic concepts of various disciplines such History, Geography, Political Science and Economics etc. However, the utility of NCERT textbooks ceases to exist at that point and beyond that the UPSC Civil Services aspirants need to study a lot of other materials as well to clear the Preliminary examination. The most important section that remains uncovered in the NCERT textbooks is the Current Affairs which forms a major part of the UPSC syllabus. For this section, students will have to consult newspapers, news magazines or compendium of current affairs such as the Current Connect which is published by the KSG. Further, the Civil Services is a competitive examination in which the performance of a particular candidate is assessed in comparison with other candidates. It may happen that some questions are asked in the examinations which are not covered in the NCERT textbooks. If such questions are covered elsewhere and other students happen to go through that source then the students depending solely on NCERT textbooks would be at a disadvantageous position. Therefore, one has to read other books and study materials too apart from the NCERT textbooks. As far as the UPSC Mains examination is concerned, it has two major sections: General Studies and the Optional Subject. Although the General Studies papers are apparently of 10+2 level, still there are some papers of the UPSC General Studies in the Mains examination which are completely absent in the coverage of the NCERT textbooks. For instance, the topics of Ethics, Integrity and Aptitude that comes under the General Studies Paper-IV is barely covered in the NCERT textbooks and for this a student will have to compulsorily depend upon other sources. Similarly, for the current data and the current topics across all the disciplines, a student will have to keep himself or herself updated by referring to the other sources. The other major part of the Mains examination, the Optional Subject, has syllabus which is at the level of honours degree across all options; except for Engineering, Medical Science and Law which are of bachelors’ level. Naturally, for the Optional Subject, 10+2 level NCERT textbooks would serve as necessary in terms of the initial coverage of the disciplines as well as building the basic foundation. However, for the coverage of higher level in the Optional Subjects one has to refer to the standard textbooks which are written exclusively for bachelors or higher levels. There are specific textbooks which are prescribed across the colleges of India across all these disciplines and students will have to necessarily study those books in order to answer the questions appearing in those Optional Subject Papers. Finally, at the third stage of the Civil Services examination, i.e., the Interview or the Personality Test, the most important segments from where questions are asked include Current Affairs and personal elements mentioned by a candidate in the Detailed Application Form (DAF). Therefore, for the preparation of the Interview also a candidate has to go beyond the NCERT textbooks as these segments can be covered more effectively by referring to the newspapers, news magazines and other relevant material. Furthermore, one of the important aspects tested during the Interview is whether the candidate has taken keen interest beyond the prescribed subjects of study. Naturally, for answering this kind of questions one has to go beyond the syllabus of the UPSC and particularly beyond the NCERT textbooks. This demand of the UPSC can be met only through a habit of general reading. My advice to you would be to start with the NCERT textbooks, build a firm foundation, clear important concepts and get yourself familiarised with the key terminologies covered in these textbooks. Once you have done that, go beyond NCERT to fill up those concepts with data and additional information by referring to the other material available in the newspapers, news magazines and other standard books or relevant material available on the Internet. This should be done with respect to all the three stages of the UPSC examination. After having attended to the issue of what materials to read, it is equally important to emphasise here that the selection of study material is only one criteria of clearing the UPSC examination. What is equally important is how one reads these materials, how one prepares the notes and most importantly how one retrieves what has been learnt. What I would suggest you in this regard is to take up mock tests at regular intervals and do plenty of writing practice. If these steps are taken, then I am sure that you will be able to show great result in the UPSC Civil Services examination. All the best! ",
            "date": "Answered May 14, 2019",
            "views": "53",
            "upvotes": " View 41 Upvoters",
            "upvoters": [
                {
                    "user_id": "Priya P Durai",
                    "user_href": "/profile/Priya-P-Durai"
                },
                {
                    "user_id": "Santosh Kamat",
                    "user_href": "/profile/Santosh-Kamat-51"
                },
                {
                    "user_id": "Akash D",
                    "user_href": "/profile/Akash-D-86"
                },
                {
                    "user_id": "Ankit Raj Gupta",
                    "user_href": "/profile/Ankit-Raj-Gupta-13"
                },
                {
                    "user_id": "Apsar Khan",
                    "user_href": "/profile/Apsar-Khan-11"
                },
                {
                    "user_id": "Sukhveer Mathur",
                    "user_href": "/profile/Sukhveer-Mathur"
                },
                {
                    "user_id": "Arsalan Bari",
                    "user_href": "/profile/Arsalan-Bari-1"
                },
                {
                    "user_id": "Asif Khan",
                    "user_href": "/profile/Asif-Khan-6535"
                },
                {
                    "user_id": "Rekha Pendiala",
                    "user_href": "/profile/Rekha-Pendiala"
                },
                {
                    "user_id": "Neeraj Agrawal",
                    "user_href": "/profile/Neeraj-Agrawal-2-1"
                },
                {
                    "user_id": "Suhail Sonowal",
                    "user_href": "/profile/Suhail-Sonowal"
                },
                {
                    "user_id": "Arjun Reddy",
                    "user_href": "/profile/Arjun-Reddy-261"
                },
                {
                    "user_id": "Harshad R Darbar",
                    "user_href": "/profile/Harshad-R-Darbar"
                },
                {
                    "user_id": "Deepak Kumar",
                    "user_href": "/profile/Deepak-Kumar-24000"
                },
                {
                    "user_id": "Rohit Kumar",
                    "user_href": "/profile/Rohit-Kumar-11044"
                },
                {
                    "user_id": "Mayank Singh",
                    "user_href": "/profile/Mayank-Singh-1012"
                },
                {
                    "user_id": "Shruti Santosh",
                    "user_href": "/profile/Shruti-Santosh-4"
                },
                {
                    "user_id": "Mukul Raj",
                    "user_href": "/profile/Mukul-Raj-78"
                },
                {
                    "user_id": "Ashutosh Yadav",
                    "user_href": "/profile/Ashutosh-Yadav-151"
                },
                {
                    "user_id": "Sharada Yadav",
                    "user_href": "/profile/Sharada-Yadav-2"
                },
                {
                    "user_id": "Tanveer Attari",
                    "user_href": "/profile/Tanveer-Attari-1"
                },
                {
                    "user_id": "Amritanshu Bhardwaj",
                    "user_href": "/profile/Amritanshu-Bhardwaj-2"
                },
                {
                    "user_id": "Rohit Yadav",
                    "user_href": "/profile/Rohit-Yadav-292"
                },
                {
                    "user_id": "Shivam",
                    "user_href": "/profile/Shivam-1041"
                },
                {
                    "user_id": "Bhavesh",
                    "user_href": "/profile/Bhavesh-119"
                },
                {
                    "user_id": "Komal Kalpade",
                    "user_href": "/profile/Komal-Kalpade-1"
                },
                {
                    "user_id": "Kamakhya Pathak",
                    "user_href": "/profile/Kamakhya-Pathak"
                },
                {
                    "user_id": "SHUBHAM NIKAM",
                    "user_href": "/profile/SHUBHAM-NIKAM-26"
                },
                {
                    "user_id": "Pitman",
                    "user_href": "/profile/Pitman-1"
                },
                {
                    "user_id": "Jigar Parikh",
                    "user_href": "/profile/Jigar-Parikh-19"
                },
                {
                    "user_id": "Shivam Mishra",
                    "user_href": "/profile/Shivam-Mishra-1241"
                },
                {
                    "user_id": "Aditya Shirke",
                    "user_href": "/profile/Aditya-Shirke-4"
                },
                {
                    "user_id": "Ashish Kumar",
                    "user_href": "/profile/Ashish-Kumar-1996"
                },
                {
                    "user_id": "Suhail Nabi",
                    "user_href": "/profile/Suhail-Nabi-1"
                },
                {
                    "user_id": "Sagnik Datta",
                    "user_href": "/profile/Sagnik-Datta-23"
                },
                {
                    "user_id": "Abhitej",
                    "user_href": "/profile/Abhitej-2"
                },
                {
                    "user_id": "Rajani Chinnu",
                    "user_href": "/profile/Rajani-Chinnu-3"
                },
                {
                    "user_id": "Manish Mahala",
                    "user_href": "/profile/Manish-Mahala-1"
                },
                {
                    "user_id": "Nishant Kumar",
                    "user_href": "/profile/Nishant-Kumar-419"
                },
                {
                    "user_id": "Jyotishmita Kalita",
                    "user_href": "/profile/Jyotishmita-Kalita-3"
                },
                {
                    "user_id": "Vishal Nagpure",
                    "user_href": "/profile/Vishal-Nagpure-12"
                }
            ]
        },
        {
            "author_info": {
                "name": "Roma Singh",
                "href": "/profile/Roma-Singh-11"
            },
            "answer_text": "No… NCERT books are required to built basics of subjects like History, geography, Science etc. For UPSC preparation, this is only 20% of full syllabus….. ",
            "date": "Answered May 1, 2019",
            "views": "286",
            "upvotes": " View 13 Upvoters",
            "upvoters": [
                {
                    "user_id": "Pooja Singh",
                    "user_href": "/profile/Pooja-Singh-636"
                },
                {
                    "user_id": "Gulshan Kumar",
                    "user_href": "/profile/Gulshan-Kumar-3391"
                },
                {
                    "user_id": "Anjali Singh",
                    "user_href": "/profile/Anjali-Singh-5020"
                },
                {
                    "user_id": "Rohit Panwar",
                    "user_href": "/profile/Rohit-Panwar-193"
                },
                {
                    "user_id": "Ankush Gupta (A Curious Educator)",
                    "user_href": "/profile/Ankush-Gupta-A-Curious-Educator"
                },
                {
                    "user_id": "Balaji Thakare",
                    "user_href": "/profile/Balaji-Thakare-3"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/GULSHAN-KUMAR-2317"
                },
                {
                    "user_id": "Harsh Tomar",
                    "user_href": "/profile/Harsh-Tomar-10"
                },
                {
                    "user_id": "LK Gedam",
                    "user_href": "/profile/LK-Gedam"
                },
                {
                    "user_id": "Seema Parmar",
                    "user_href": "/profile/Seema-Parmar-29"
                },
                {
                    "user_id": "Preyansh Jain",
                    "user_href": "/profile/Preyansh-Jain-1"
                },
                {
                    "user_id": "Priya Batra",
                    "user_href": "/profile/Priya-Batra-11"
                },
                {
                    "user_id": "Amber Khan",
                    "user_href": "/profile/Amber-Khan-41"
                }
            ]
        },
        {
            "author_info": {
                "name": "Vijay Kumar Yadav",
                "href": "/profile/Vijay-Kumar-Yadav-122"
            },
            "answer_text": "Ncert books are very important for upsc exam ,these books will develop your base but only ncert books are not enough for upsc preparation .you should also read other authentic books for upsc like satish chandra for medival history and vipin chandra for modern histroy and these types other subjects book. ",
            "date": "Answered September 13, 2018",
            "views": "176",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Neha Yadav",
                    "user_href": "/profile/Neha-Yadav-699"
                }
            ]
        },
        {
            "author_info": {
                "name": "Sagar Bisen",
                "href": "/profile/Sagar-Bisen-21"
            },
            "answer_text": "I think for prelim that’s enough resource for General Studies or Social Science section along with daily current affairs. By the way resources never have limit for any preparation. Hence if you are dealing with the NCERTs then excel in that or otherwise, also refer some reference material. ",
            "date": "Answered January 27, 2018",
            "views": "285",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Neha Yadav",
                    "user_href": "/profile/Neha-Yadav-699"
                },
                {
                    "user_id": "Kaiser Kundan",
                    "user_href": "/profile/Kaiser-Kundan"
                },
                {
                    "user_id": "Satya Kaushik",
                    "user_href": "/profile/Satya-Kaushik"
                },
                {
                    "user_id": "Rishabh Jha",
                    "user_href": "/profile/Rishabh-Jha-33"
                }
            ]
        },
        {
            "author_info": {
                "name": "Sourabh Singh",
                "href": "/profile/Sourabh-Singh-707"
            },
            "answer_text": "No, But your basic is too clear. Yes your art and culture is almost done . Then , You find more books, and must read or practice. ",
            "date": "Answered May 1, 2019",
            "views": "52",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Tarun Bansal",
                "href": "/profile/Tarun-Bansal-113"
            },
            "answer_text": "Yaa its true.. Basically these NCERT (National Council of Education Research and Training) contains sufficient data for your knowledge. For more content you just have to go with internet sources. ",
            "date": "Answered February 2, 2018",
            "views": "104",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Deepak Singh",
                "href": "/profile/Deepak-Singh-4109"
            },
            "answer_text": "No ",
            "date": "Answered January 26, 2018",
            "views": "30",
            "upvotes": "0"
        }
    ]
}