{
    "title": "Are Lilith, Hecate and Circe the same dieties? - Quora",
    "tags": [],
    "response": [
        {
            "author_info": {
                "name": "Lumi Kløvstad",
                "href": "/profile/Lumi-Kløvstad"
            },
            "answer_text": "They are not. They share certain qualities, but they are each far removed from each other. In particular, Lilith’s time as a goddess in the Mesopotamian tradition was relatively brief, and not at all well documented with evidence today. Whether she had a greater role in things besides being Inanna’s handmaiden is basically completely unknown. Her later reputation as a demonness and even later as a modern feminist icon is much more well documented. Kirke’s sometimes regarded as a minor goddess, sometimes as a mortal enchantress. Whatever she really is isn’t made very clear in the myths she appears in (basically just the Odyssey, with a few namedrops here and there in other myths, usually ones that reference the former). She is skilled with animals, illusions, and transmutation, and features heavily as a short-term antagonist in the Odyssey with little in the way of major appearances beyond that. It is entirely possible that she appears in other stories that are now lost; of that, we have no real way of knowing. Hekate is a Greek witch-goddess of great power, and roughly embodies Sorcery as a concept. Her more specific associations tend to be witchcraft, the night, the moon, ghosts and necromancy. Despite this somewhat macabre collection of associations, she’s unquestionably on the side of good, though she can be uncomfortable to deal with if you’re not the sort who has a proclivity for her assortment of talents. A cool tidbit is that she accompanies Persephone in the underworld, having assisted Demeter in the search for her missing daughter. ",
            "date": "Answered April 23, 2019",
            "views": "14",
            "upvotes": " View 5 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Nick Damianos",
                    "user_href": "/profile/Nick-Damianos"
                },
                {
                    "user_id": "Will Harper",
                    "user_href": "/profile/Will-Harper-15"
                },
                {
                    "user_id": "Paulina Esquino",
                    "user_href": "/profile/Paulina-Esquino"
                },
                {
                    "user_id": "James Harrelson",
                    "user_href": "/profile/James-Harrelson-5"
                },
                {
                    "user_id": "Mark Vanderpool",
                    "user_href": "/profile/Mark-Vanderpool"
                }
            ]
        },
        {
            "author_info": {
                "name": "Lisa JH Gardner",
                "href": "/profile/Lisa-JH-Gardner"
            },
            "answer_text": "The short answer, no, they’re not. In astrology they are all connected to the Dark Moon. Hecate and Circe, from Greek mythology, can be considered “dark” goddesses, dealing with witchcraft/sorcery and birth/death. Lilith, from Mesopotamian to Jewish mythology, is also “dark” but she is not a goddess in the ancient sense. While she started her existence as a demon, many today consider her a modern-day goddess. ",
            "date": "Answered April 23, 2019",
            "views": "666",
            "upvotes": "0"
        }
    ]
}