{
    "title": "Are books our best friends? - Quora",
    "tags": [
        "Reading (Language skill)",
        "Best Friends",
        "Literature",
        "Reading",
        "Friendship"
    ],
    "response": [
        {
            "author_info": {
                "name": "Michael Masiello",
                "href": "/profile/Michael-Masiello-1"
            },
            "answer_text": "Machiavelli famously wrote that “[w]hen evening comes, I return home and go into my study. On the threshold I strip off my muddy, sweaty, workday clothes, and put on the robes of court and palace, and in this graver dress I enter the antique courts of the ancients and am welcomed by them, and there I taste the food that alone is mine, and for which I was born. And there I make bold to speak to them and ask the motives of their actions, and they, in their humanity, reply to me. And for the space of four hours I forget the world, remember no vexation, fear poverty no more, tremble no more at death: I pass indeed into their world.” Needless to say, that implies some kind of sodality, at the very least -- that books are a place where we can commune with the minds of the past, where we can draw upon the deep wells of knowledge that are our collective birthright, and in encountering alterity, encounter ourselves afresh. In that sense they are the dearest friends. But Aristotle was right when he called human beings social animals (zoa politika). There is a great deal to suggest that we need each other's company, each other's presence, to live. Whoever lives for reading alone runs the risk of finding in learning nothing but a lonely cage. Robert Burton learned this to his pain. Books train our minds to think, teach us how to feel, show us the way to new questions, help make us more interesting and sophisticated. But these aims are not strictly contemplative for most members of our species.  So although books are wonderful companions in our solitude, especially in what has become a culture-less and illiterate age, let's also remind ourselves of Francis Bacon's essay \"Of Studies\": \"To spend too much time in studies is sloth; to use them too much for ornament, is affectation; to make judgment wholly by their rules, is the humor of a scholar. They perfect nature, and are perfected by experience: for natural abilities are like natural plants, that need proyning, by study; and studies themselves, do give forth directions too much at large, except they be bounded in by experience. Crafty men contemn studies, simple men admire them, and wise men use them; for they teach not their own use; but that is a wisdom without them, and above them, won by observation. Read not to contradict and confute; nor to believe and take for granted; nor to find talk and discourse; but to weigh and consider.\" I'd say that's just about right. ",
            "date": "Answered March 21, 2016",
            "views": "28",
            "upvotes": " View 21 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Anayra Shah",
                    "user_href": "/profile/Anayra-Shah"
                },
                {
                    "user_id": "Jakub Čačo",
                    "user_href": "/profile/Jakub-Čačo"
                },
                {
                    "user_id": "J. Liang",
                    "user_href": "/profile/J-Liang-6"
                },
                {
                    "user_id": "Asher Reich",
                    "user_href": "/profile/Asher-Reich"
                },
                {
                    "user_id": "Ankush Singla",
                    "user_href": "/profile/Ankush-Singla-118"
                },
                {
                    "user_id": "Edoardo Rinaldi",
                    "user_href": "/profile/Edoardo-Rinaldi"
                },
                {
                    "user_id": "Joaquín Benjamín",
                    "user_href": "/profile/Joaquín-Benjamín"
                },
                {
                    "user_id": "Sophia Toutoglou",
                    "user_href": "/profile/Sophia-Toutoglou"
                },
                {
                    "user_id": "Gleison Ericli",
                    "user_href": "/profile/Gleison-Ericli"
                },
                {
                    "user_id": "Henok Fitsum",
                    "user_href": "/profile/Henok-Fitsum"
                },
                {
                    "user_id": "Amy Sasso",
                    "user_href": "/profile/Amy-Sasso"
                },
                {
                    "user_id": "Nega Soul",
                    "user_href": "/profile/Nega-Soul"
                },
                {
                    "user_id": "Katja Kaila",
                    "user_href": "/profile/Katja-Kaila"
                },
                {
                    "user_id": "Eliot Layton",
                    "user_href": "/profile/Eliot-Layton"
                },
                {
                    "user_id": "Hasib Reza",
                    "user_href": "/profile/Hasib-Reza"
                },
                {
                    "user_id": "Namarata Agrawal",
                    "user_href": "/profile/Namarata-Agrawal-1"
                },
                {
                    "user_id": "Jan Špenko",
                    "user_href": "/profile/Jan-Špenko"
                },
                {
                    "user_id": "Nidhi Lohat",
                    "user_href": "/profile/Nidhi-Lohat"
                },
                {
                    "user_id": "Riya Srivastava",
                    "user_href": "/profile/Riya-Srivastava-2"
                },
                {
                    "user_id": "Ackansha Deoli",
                    "user_href": "/profile/Ackansha-Deoli"
                },
                {
                    "user_id": "Soo J. Oh",
                    "user_href": "/profile/Soo-J-Oh"
                }
            ]
        },
        {
            "author_info": {
                "name": "Ankush Singla",
                "href": "/profile/Ankush-Singla-118"
            },
            "answer_text": " Books are my friends, my companion. They make me laugh And cry and find meaning in life. --christopher paolim. Can you imagine your life without companions? Be it your parents, friends or soulmate! You can't. But how about books? They never walk away. The people who teach, advice and guide us may not always be there with us. But \"books could be our greatest friends\", they say. Books are like people we meet, we can pity or vilify them, venerate or love them. Every book we read stays with us in any form (experiences, memories, empathy n a lot more), one can think of. They give you so much that you wonder of recollecting at once. From being judgemental, enriching our mind, broadening our perspective, giving enormous knowledge, making us smarter, help forgetting troubles and curing loneliness to changing our perspective towards life, they are treasure house one can keep.... The treasure house of the knowledge that occupy your mind, the range of experiences that you can share. You become a thinking person, you have a world view, you'r perspective and have a knowledge of universe. And all this will feed into what you become and what mark you leave. Each book we read has the power to transpose us into a diff World. It's not just within the narrow confines of mere words but the time you go into books, you feel the noble thoughts they generate into you, you feel the characters well than what people actually encounter. Your whole life that you spend obersing and learning things are concised in a plot of a book thus reducing the chaos of confusion and making things more obvious. We think of literature as something very sophisticated but there are ways in which books organise and clarify our thoughts, concerns and beliefs thus simplying them and being your greatest aka best friends for life. Please upvote. ",
            "date": "Answered June 1, 2020",
            "views": "496",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Bharat Nathani",
                    "user_href": "/profile/Bharat-Nathani-4"
                }
            ]
        },
        {
            "author_info": {
                "name": "Sourav Raj",
                "href": "/profile/Sourav-Raj-46"
            },
            "answer_text": "Man cannot live alone. He needs friends. Something he loves must. Therefore, he likes to live in the company of men or in the company of animals. There are some who love the company of Nature. There are also those who loved the company of books It is good to live in the company of bad books. But it is bad to fall in the company of bad books. Through the influence of bad books you can pick up bad habits without your knowing it. Therefore, you must select your direction with great care. You must make a choice wisely. But even the very best of books cannot give you everything. The company of books can give you knowledge but it cannot give you the practical expeience. No book can make you a great scientist. Newton was not born in a library. He did not read much. He lives in the company of plants and flowers. So, a library cannot make you a great poet or thinker. Even the books of your choice may make you only a bookworm. You get only second-hand information. You cannot believe everything unless you see with your own eyes and hear with your own ears. Therefore, you must come out of the world of books from time to time and live in the company of man and nature. The life of man and the life of Nature must be balanced up. A cut between book and life is full of dangers. So, read not only books but also the great Book of Life and Nature, after all It is said that “world is a book to read”, but “each book is, self a world” ",
            "date": "Answered March 3, 2017",
            "views": "32",
            "upvotes": " View 10 Upvoters",
            "upvoters": [
                {
                    "user_id": "Baipath Lang",
                    "user_href": "/profile/Baipath-Lang"
                },
                {
                    "user_id": "Ankush Singla",
                    "user_href": "/profile/Ankush-Singla-118"
                },
                {
                    "user_id": "Arvind Chaudhary",
                    "user_href": "/profile/Arvind-Chaudhary-240"
                },
                {
                    "user_id": "Naman Gangil",
                    "user_href": "/profile/Naman-Gangil"
                },
                {
                    "user_id": "Dwij Mistry",
                    "user_href": "/profile/Dwij-Mistry-2"
                },
                {
                    "user_id": "Namita Garg",
                    "user_href": "/profile/Namita-Garg-5"
                },
                {
                    "user_id": "Namarata Agrawal",
                    "user_href": "/profile/Namarata-Agrawal-1"
                },
                {
                    "user_id": "Utkarsh Wághmare",
                    "user_href": "/profile/Utkarsh-Wághmare"
                },
                {
                    "user_id": "Mrunal Narote",
                    "user_href": "/profile/Mrunal-Narote"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/Serenade-11"
                }
            ]
        },
        {
            "author_info": {
                "name": "Debanjali Pal",
                "href": "/profile/Debanjali-Pal"
            },
            "answer_text": "Books are the quietest and the most constant of friends; they are the most accessible and wisest of counselors and the most patient of teachers. The library is what drew me to the world of books. The long corridor lined with cupboards filled with thousands of books fascinated me as a child. It was the place where I spent most of my teenage years lost in the land of fantasy and fiction. St.Clare’s introduced me to midnight feasts and friendly brawls. I solved mysteries with Nancy Drew, adventured with Famous Five and also belonged to the Baby Sitter’s Club. Harry, Ron and Hermione became my best friends. Godfather presented me the thrill in the world of crime. Balance reflected India’s history post Independence. Sherlock Holmes tutored my detective skills. Little Women became my family. Mr. Darcy, is not the one who falls in love you for your looks, but for the liveliness of your mind. Books have been my escape from the real world. You can do anything you want inside the pages of a book with no consequences. You can be whoever you want, man or woman, adult or child, hero or villain. You can hurt. You can kill. You can save the world with your supernatural power. Books keep secrets like best friends should. They never get jealous and they never spread rumors. They don’t keep you out of their secrets. Books will always remain a part of my life.The messages of the books I’ve read live inside me, and to touch their worn pages is to travel back in time, into a comfort zone that is only mine. “Books are love that never defy” ",
            "date": "Answered July 3, 2016",
            "views": "945",
            "upvotes": " View 5 Upvoters",
            "upvoters": [
                {
                    "user_id": "Hardika Rathod",
                    "user_href": "/profile/Hardika-Rathod-1"
                },
                {
                    "user_id": "Rajesh Kumar Mulani",
                    "user_href": "/profile/Rajesh-Kumar-Mulani"
                },
                {
                    "user_id": "Yogendra Bisht",
                    "user_href": "/profile/Yogendra-Bisht-7"
                },
                {
                    "user_id": "Purushottam Bhakat",
                    "user_href": "/profile/Purushottam-Bhakat"
                },
                {
                    "user_id": "Sai Manoj",
                    "user_href": "/profile/Sai-Manoj-80"
                }
            ]
        },
        {
            "author_info": {
                "name": "Chaitanya Shrishrimal",
                "href": "/profile/Chaitanya-Shrishrimal"
            },
            "answer_text": " Due to below reasons I feel books really are person's best friends:- They won't judge you as other people do. They don't cheat.Usually our very ‘best’ friends start ignoring/avoiding us and sometimes even leave us alone. You will never be alone when you have book in our hand. Books never expect anything.Each book has something to teach you without boring you to death. It never happens that you don't learn anything from them.You start knowing about yourself as you go on reading. It helps you know what type of person you are, what are your deepest feelings, emotions.Books will always be with you wherever you go, whatever time- day/night it maybe.Books offer you chance to live many lives in a single life.Books are hidden treasure, Go find it!  ",
            "date": "Updated July 1, 2018",
            "views": "14",
            "upvotes": " View 7 Upvoters",
            "upvoters": [
                {
                    "user_id": "Ritesh Gogade",
                    "user_href": "/profile/Ritesh-Gogade-1"
                },
                {
                    "user_id": "Anushruti Mohanty",
                    "user_href": "/profile/Anushruti-Mohanty"
                },
                {
                    "user_id": "Hema Navya Bobbili",
                    "user_href": "/profile/Hema-Navya-Bobbili"
                },
                {
                    "user_id": "Rahul",
                    "user_href": "/profile/Rahul-2758"
                },
                {
                    "user_id": "Priyong Raj Banerjee",
                    "user_href": "/profile/Priyong-Raj-Banerjee"
                },
                {
                    "user_id": "Shridhar Dodamani",
                    "user_href": "/profile/Shridhar-Dodamani-1"
                },
                {
                    "user_id": "Ashok Savalgimath",
                    "user_href": "/profile/Ashok-Savalgimath"
                }
            ]
        },
        {
            "author_info": {
                "name": "Soo J. Oh",
                "href": "/profile/Soo-J-Oh"
            },
            "answer_text": "Early on in Catcher in the Rye, there's an implicit suggestion that books, in Holden's view, might be better than people. Myself, I think books are in a different category than people.  For instance, that annoying person who never stops talking and won't let you get a word in at all so that it's difficult to get away from them -- with a book, if it bothers you that much, you can just shut it.  Done, over. Best friends talk and listen.  They too need consoling and your sympathy.  It's a two-way street.  With a book, all a book needs is your engagement.  But it offers a great deal in return.  Some books are entertainment, others wisdom and reflection about their world, some factual, some beautiful and visual. When I am lowdown and in need of consolation, a human touch, I don't think books will do it.  I'd rather have my husband give me a hug.  On the other hand, when I want to read a 600 page Russian novel, I doubt my husband can hold out at length about changes to the lives of Russian serfs.  ",
            "date": "Answered March 20, 2016",
            "views": "12",
            "upvotes": " View 5 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Baipath Lang",
                    "user_href": "/profile/Baipath-Lang"
                },
                {
                    "user_id": "Ankush Singla",
                    "user_href": "/profile/Ankush-Singla-118"
                },
                {
                    "user_id": "Namarata Agrawal",
                    "user_href": "/profile/Namarata-Agrawal-1"
                },
                {
                    "user_id": "Riya Srivastava",
                    "user_href": "/profile/Riya-Srivastava-2"
                },
                {
                    "user_id": "Michael Masiello",
                    "user_href": "/profile/Michael-Masiello-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Shainda",
                "href": "/profile/Shainda-शायन्द-आ-सैफी"
            },
            "answer_text": "Yes ,I totally agree to this statement that,books are our best friend because nobody lives alone in this world .Books are not everything for us ,but books give us knowledge .If you read good books you get good things ,ideas,views, opinion, knowledge,and confidence. Through the influence of bad books we get bad things.sone people are not interested in good things ,so they choose bad things they also get ideas after reading books but in wrong way it depends on mentality. The company of book can give you knowledge,but it cannot give you the practical experience.By reading books you can achieve motivational thoughts, inspire by people ,and many other things which you make different.For reading book,we don't need any library ,and environment we need only passion because Newton's does not born in any library ,but he has dedication,so he became scientist. So you should make friend your books …… ",
            "date": "Answered December 28, 2018",
            "views": "335",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Ankush Singla",
                    "user_href": "/profile/Ankush-Singla-118"
                },
                {
                    "user_id": "Prabhat Ranjan Chaudhary",
                    "user_href": "/profile/Prabhat-Ranjan-Chaudhary"
                }
            ]
        },
        {
            "author_info": {
                "name": "Apoorva Mishra",
                "href": "/profile/Apoorva-Mishra-20"
            },
            "answer_text": "Hi Srini, For this particular answer lets tot travel back to my childhood. When i was small i used to stay with my maternal grandfather, so every week he used to ask me to write a letter to my mother.And like a Disciplined child i used to do it every week. This letter writing continued till 4th standard.Then i moved with my parents.Well i come from army background where everything has a time frame to do things.We (With we i mean me and brother)were not allowed to watch TV. So i wanted to use my inner child my hyper activeness ,my energy.I was a difficult child to handle. My mom was an avid reader so i started putting my energy in reading.Sometimes it was good sometimes difficult to read.But i learnt it slowly. Now wherever i travel i always have 2 -3 books with me .I am not that person who like online reading i like to hold books,I like the way they smell.The papers,the color everything.You don’t the feel of book online. Its been like 14–15 years my love for books is increasing and i really want to pass this legacy .  That’s so me! Happy Reading! ",
            "date": "Answered July 29, 2019",
            "views": "379",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Srini Reddy",
                    "user_href": "/profile/Srini-Reddy-65"
                }
            ]
        },
        {
            "author_info": {
                "name": "Mister Gaurav Gupta",
                "href": "/profile/Mister-Gaurav-Gupta-1"
            },
            "answer_text": "I think books are our best friends. But then I have friends who argue with me that dogs are our best friends-as they are living creatures offering unconditional love. So are books or dogs(cats/hamsters etc) our best friends? The answer lies simply in what rejuvenates you: Do you want a furry animal to cuddle up and play around to unwind from life’s problems? Then the dog is your best friend.Do you love lots of me-time to think through how you would like to lead your life, how do you find purpose in your life, how people go through circumstances far more trying than ours and emerge victorious? If yes, and if if seeking answers to our existence interests you, then books are your best friend.",
            "date": "Answered August 13, 2016",
            "views": "969",
            "upvotes": " View 4 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Ankush Singla",
                    "user_href": "/profile/Ankush-Singla-118"
                },
                {
                    "user_id": "Prabhat Ranjan Chaudhary",
                    "user_href": "/profile/Prabhat-Ranjan-Chaudhary"
                },
                {
                    "user_id": "Rashmi Jha",
                    "user_href": "/profile/Rashmi-Jha-28"
                },
                {
                    "user_id": "Saurabh Gupta",
                    "user_href": "/profile/Saurabh-Gupta-346"
                }
            ]
        },
        {
            "author_info": {
                "name": "Nikhil Gangoli",
                "href": "/profile/Nikhil-Gangoli-1"
            },
            "answer_text": "Francis Bacon - the English philosopher - said just about everything which needs to be said about books in his Essays. Read the essay - Of Studies - and you can know the utility and use of books and how they are your best friends Here is the link to the essay Essays of Francis Bacon Books serve to delight (or entertain). They serve to make you learned and capable. And much more besides As Bacon says STUDIES serve for delight, for ornament, and for ability. Their chief use for delight, is in privateness and retiring; for ornament, is in discourse; and for ability, is in the judgment, and disposition of business. The entire book (The Essays) deserves to b regarded as one of the best of friends because each of these essays gives in a page or two the distilled subtlety of a master mind on a major issue of life Enjoy ",
            "date": "Answered March 5, 2017",
            "views": "12",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Divya Reddy",
                    "user_href": "/profile/Divya-Reddy-618"
                },
                {
                    "user_id": "Disha Arora",
                    "user_href": "/profile/Disha-Arora-109"
                }
            ]
        },
        {
            "author_info": {
                "name": "Jigyasu Solanki",
                "href": "/profile/Jigyasu-Solanki"
            },
            "answer_text": "Well I don't know about friend and best friend thing. I never had that kind of bond with anyone. Still considering the context in which this phrase is always used it basically means :- Books are your all time companion. If you consider them as your friend they will never leave you, will teach you good things, will increase your wisdom. Will let you experience life and imagination of so many people. In your high and low times, books will accompany you be it lonely night time or a journey in train. They will also listen to you, your thoughts and will never judge you. This is what a best friend does. Hence books are your best friend. ",
            "date": "Answered June 17, 2020",
            "views": "87",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Madhurya Goswami",
                "href": "/profile/Madhurya-Goswami-1"
            },
            "answer_text": "In the modern era of new problems, busy schedule ,daily hustle and bustle one can really consider books to be their best of friends. Here the question is why I ,a 17 year old teenager is saying or you can say suggesting to read books ? Some of you will say it will give us insights, knowledge or that too mainstream kind of blah blah.. So rather I thought that why don't you feel it yourself? And to my all friends out there it will be good decision for sure.. once you have fallen for the books , there will be a whole new world is set up for you.. So,to the ginipigs of Googlism , let's feel the joy of reading a book and spread some love.!! ",
            "date": "Answered April 30, 2019",
            "views": "159",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Gaurav Das",
                    "user_href": "/profile/Gaurav-Das-122"
                },
                {
                    "user_id": "Sumanta Raja",
                    "user_href": "/profile/Sumanta-Raja-1"
                },
                {
                    "user_id": "Rajesh Kumar Mulani",
                    "user_href": "/profile/Rajesh-Kumar-Mulani"
                }
            ]
        },
        {
            "author_info": {
                "name": "Sumit Usha",
                "href": "/profile/Desi-Kafka"
            },
            "answer_text": "No. And I'll tell you why, based on my experiences. When I had this intense feeling (momentary though) of popping up an entire file of sleeping pills after my first break up, it was not a book that gave me a tight, warm hug. He was my friend, on that cold December night. When I was suspended a day before my III semester engineering exams, again, it was not a book who sat with me all night drinking Vodka. He was, once again, a friend (despite his exams next day.) Again, it was not a book I shared my deepest, darkest secrets with. Not even a diary. She is a friend, a very dear one. My friend, books may give you company, knowledge but humans are fashioned in a way that they look for an emotional support. And that, comes from the animate, the mortals. So, develop bonds, make friends, live in moments. And keep reading.  ",
            "date": "Answered March 31, 2016",
            "views": "727",
            "upvotes": " View 2 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Ankush Singla",
                    "user_href": "/profile/Ankush-Singla-118"
                },
                {
                    "user_id": "A'ssmaa E'smat",
                    "user_href": "/profile/Assmaa-Esmat"
                }
            ]
        },
        {
            "author_info": {
                "name": "Anjali Kashyap",
                "href": "/profile/Anjali-Kashyap-8"
            },
            "answer_text": "Well, people come and go in our life. People have expectations.We have expectations from them and if not fulfilled, these expectations make us sad. Some people talk bitterly..their words hurt us. Sometimes they aren't there for us when we need them the most! Books never expect anything from us. Books never hurt us through bitter words. Books never complain. Books are there for us when we need them the most! Yes,books are truly our best friends! ",
            "date": "Updated September 10, 2017",
            "views": "2",
            "upvotes": " View 10 Upvoters",
            "upvoters": [
                {
                    "user_id": "Ankush Singla",
                    "user_href": "/profile/Ankush-Singla-118"
                },
                {
                    "user_id": "Avent",
                    "user_href": "/profile/Avent-2"
                },
                {
                    "user_id": "Manish Chourey",
                    "user_href": "/profile/Manish-Chourey-4"
                },
                {
                    "user_id": "Motivaana",
                    "user_href": "/profile/Motivaana"
                },
                {
                    "user_id": "Monisha Naidu",
                    "user_href": "/profile/Monisha-Naidu-8"
                },
                {
                    "user_id": "Namarata Agrawal",
                    "user_href": "/profile/Namarata-Agrawal-1"
                },
                {
                    "user_id": "Soumyajit Das",
                    "user_href": "/profile/Soumyajit-Das-81"
                },
                {
                    "user_id": "Mrunal Narote",
                    "user_href": "/profile/Mrunal-Narote"
                },
                {
                    "user_id": "Quorauser",
                    "user_href": "/profile/Quorauser-115"
                },
                {
                    "user_id": "Shekhar Bavanari",
                    "user_href": "/profile/Shekhar-Bavanari"
                }
            ]
        },
        {
            "author_info": {
                "name": "Aditya Ekka",
                "href": "/profile/Aditya-Ekka-6"
            },
            "answer_text": "Its not good but a Best friend for everyone. And it will help you at every point. He will never leave if you maintain your teading habit. It will motivate you, help you, guide you stay along with. It will ask nothing but your time and in turn it will give you many things. And it will never betray you. So get into a habit of reading get into a best friendship. ",
            "date": "Answered June 22, 2020",
            "views": "69",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Santosh Kumar Ekka",
                    "user_href": "/profile/Santosh-Kumar-Ekka"
                }
            ]
        },
        {
            "author_info": {
                "name": "Jitendra Singh",
                "href": "/profile/Jitendra-Singh-1528"
            },
            "answer_text": "A friend is someone ,who Improve our life in a tremendous way.A good friend will always show the correct path to his friend. The above mentioned thing is true for Book also.Reading books help us to acquire huge amount of knowledge,which is important in today’s competitive world.Books help us to concentrate ,which help us to gain huge amount of knowledge in very short period of time. Book also help us to build vocabulary.Having good vocabulary will give us edge.If we are good reader eventually we become a good writer as well.Being a good writer can help us in other competitive exam. ",
            "date": "Answered June 30, 2018",
            "views": "286",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Hatson Selva",
                "href": "/profile/Hatson-Selva"
            },
            "answer_text": "Yes obviously,when you spend a time in book, you forgot the entire world around you and become a stress less person. But it depends on type of book you choose.and see it is a vast habit among the Koreans and japanese we used to swipe the phone. But those person always carries some book.they try to utilise single notch so it is the reason for the productivity.lonely person used to fond of books as they feel like they were speaking to them. ",
            "date": "Answered August 5, 2018",
            "views": "235",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Priyong Raj Banerjee",
                    "user_href": "/profile/Priyong-Raj-Banerjee"
                }
            ]
        },
        {
            "author_info": {
                "name": "Wow Hits",
                "href": "/profile/Wow-Hits"
            },
            "answer_text": "Yes! of-course books are our best friends as books don’t expect anything from us instead feed us with great knowledge and reading books or making the habit of reading can take you on another level as you will see a tremendous growth in you after that. For more knowledge related to books or getting an overview of books you can check the below link :- https://www.youtube.com/channel/UCqrUXA1PisNn-E7OyUbELOA ",
            "date": "Answered June 4, 2020",
            "views": "75",
            "upvotes": " Answer requested by Ankush Singla",
            "upvoters": [
                {
                    "user_id": "Shainda",
                    "user_href": "/profile/Shainda-शायन्द-आ-सैफी"
                }
            ]
        },
        {
            "author_info": {
                "name": "Edmund A.M. Batara",
                "href": "/profile/Edmund-A-M-Batara-1"
            },
            "answer_text": "Books are guides, entertainment, or reference materials. In short, they are ideas printed on paper. If they are your best friends, then you need to go out more. Or see a shrink. Man is a social animal. That’s one reason why isolation is one of the severest penalties in a prison. It’s not healthy to withdraw from human contact. ",
            "date": "Answered September 5, 2020",
            "views": "34",
            "upvotes": " Answer requested by Reena Rai",
            "upvoters": [
                {
                    "user_id": "Ankush Singla",
                    "user_href": "/profile/Ankush-Singla-118"
                }
            ]
        },
        {
            "author_info": {
                "name": "Ramshankar Singh",
                "href": "/profile/Ramshankar-Singh-22"
            },
            "answer_text": "Because of below reasons:- Book will give a lot of knowledge, wisdom and value to you.It will never cheat you.It will never break your trust.It costs nothing compared to the value which you get it.It will make you a leader. As you know a good reader is a good leader.It will improve your thought process or mindset which is very necessary for anyone.It shows you your face , your value and your potential. etc.",
            "date": "Answered June 17, 2020",
            "views": "62",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Kamna Lakaria",
                "href": "/profile/Kamna-Lakaria"
            },
            "answer_text": "Books guide you Advice you Motivates and inspires you Make you laugh and lost in the world of imagination Never hurts you Never disappoints you Be with you whenever you need a help The friendship lasts forever and is unconditional. ",
            "date": "Answered March 16, 2018",
            "views": "254",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Shainda",
                    "user_href": "/profile/Shainda-शायन्द-आ-सैफी"
                }
            ]
        },
        {
            "author_info": {
                "name": "Alicia Andrea Marsland Geromel",
                "href": "/profile/Alicia-Andrea-Marsland-Geromel"
            },
            "answer_text": "This is not meant to be taken literally. Friends are friends. Books are books. It is just that, as with friends, books can be entertaining, comforting or inspiring and encouraging, as needed. ",
            "date": "Answered May 31, 2019",
            "views": "91",
            "upvotes": " View 1 Upvoter "
        },
        {
            "author_info": {
                "name": "Ruchi",
                "href": "/profile/Ruchi-172"
            },
            "answer_text": "Because when we read the book…we get into the story…we learn many things and its a very different feeling to read a book if you read it passionately…you will feel you do not require anything else but a book…whereas friends in our life are not permanent…they may come in our life and they may leave…Books are always with us ",
            "date": "Answered March 15, 2018",
            "views": "268",
            "upvotes": " View 1 Upvoter"
        },
        {
            "author_info": {
                "name": "Somil Agarwal",
                "href": "/profile/Somil-Agarwal-1"
            },
            "answer_text": "Why should books be your best friend ? ",
            "date": "Answered July 25, 2016",
            "views": "494",
            "upvotes": "0"
        }
    ]
}