{
    "title": "Are 'home remedies' and Ayurveda related? If so, how? - Quora",
    "tags": [
        "Ayurvedic Medicines",
        "Remedies",
        "Homeopathy",
        "Ayurveda",
        "Home Remedies",
        "Health Tips",
        "Complementary and Alternative Medicine",
        "Medical Conditions and Diseases",
        "Health"
    ],
    "response": [
        {
            "author_info": {
                "name": "Puneet Aggarwal",
                "href": "/profile/Puneet-Aggarwal-1"
            },
            "answer_text": "Ayurveda is the desire to return to nature and nature starts from the herbs and spices found in the kitchen. Natural Ayurvedic treatments start from the home and from following a proper dietary regimen as per daily and seasonal variations. Most diseases arise due to improper food habits and faulty lifestyle besides heredity and other reasons. Ayurveda is one such system, which tries to bring harmony between man & nature by using holistic methods of diagnosis, prevention, and treatment. Ayurveda preaches the gentle way of treatment mainly based on herbs and diet. Many of the most effective remedies are simple, easily available and can be prepared at home. Simple recipes prepared from ingredients available in the kitchen, for simple health problems like cough, cold, indigestion, etc, are very effective. They have been proved effective from empirical experiences and from observations made by age-old wise men. Disclaimer: General home remedies should be followed only after being guided by an expert Ayurvedic Physician. ",
            "date": "Answered December 9, 2019",
            "views": "71",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Suman Sharma",
                    "user_href": "/profile/Suman-Sharma-2186"
                },
                {
                    "user_id": "Vidhi Madnawat",
                    "user_href": "/profile/Vidhi-Madnawat"
                },
                {
                    "user_id": "Yashraj Singh Rathor",
                    "user_href": "/profile/Yashraj-Singh-Rathor"
                }
            ]
        },
        {
            "author_info": {
                "name": "Vaidya Surya",
                "href": "/profile/Vaidya-Surya"
            },
            "answer_text": "Most of home remedies are ayurvedic but Ayurveda is not home remedies. Ayurveda is vast science that deals with how we can live disease free life not only in perspective of Physical health but also mental and spiritual health. So we can't correlate Ayurveda with home remedies. Home remedies are smallest part of Ayurveda. Thanks Vaidya Surya Healing Touch Ayurveda ",
            "date": "Answered December 5, 2019",
            "views": "60",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Yashraj Singh Rathor",
                    "user_href": "/profile/Yashraj-Singh-Rathor"
                }
            ]
        }
    ]
}