{
    "title": "Are there any books that can teach you how to build and all you need to know about inline engines? - Quora",
    "tags": [
        "Inline Engines",
        "Automobile Engineering",
        "Car Engines",
        "Engines",
        "Mechanical Engineering",
        "Book Recommendations",
        "Engineering",
        "Books"
    ],
    "response": [
        {
            "author_info": {
                "name": "Robert Bruce",
                "href": "/profile/Robert-Bruce-94"
            },
            "answer_text": "There are a lot of different inline engines out there, ranging from flat heads from the 50’s and earlier to modern engines with overhead cams. I’m not aware of any one book that could possibly cover every engine out there. The best bet would be to buy repair manuals that cover specific engines you are planning to work on. Beyond that, if you want to know more than the manuals show, research the individual engine. There are a lot of “how to” websites out there dedicated to specific engines that give tips that you aren’t likely to pick up in books. For example, it is possible to convert the early Chevy’s to full flow oil filteration by plugging off certain oil passages, drilling and tapping a few holes, and rerouting the oil flow to a remote oil filter but I doubt you will find that in a book. There are other tips you aren’t likely to find in a book such as the early Corvettes with the 235 used a (apparently stock) camshaft from a 261, and it is possible to install a 235 head on a 261 block to raise the compression ( similarly, a 240 Ford head can be installed on a 300 block). I’m sure most any popular engine out there has websites dedicated to them and also have similar tricks, but those are some I picked up researching stove bolt Chevy’s and the 6 cylinder Fords. ",
            "date": "Answered February 3, 2019",
            "views": "185",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Doug Smith",
                    "user_href": "/profile/Doug-Smith-142"
                }
            ]
        },
        {
            "author_info": {
                "name": "Micheal Odling",
                "href": "/profile/Micheal-Odling"
            },
            "answer_text": "Chevrolet Inline-6 Engine: How to Rebuild  Chevrolet’s inline 6-cylinder, affectionately known as the “Stovebolt,” was produced and applied to Chevrolet-powered automobiles from 1929 through 1962. Its effectiveness and simplicity greatly contributed to the lengthy duration of its life span, with the engine still being created in some capacity into 2009. Deve Krehbiel of devestechnet.com has taken his decades of knowledge on the inline-6 and created the ultimate resource on rebuilding the Stovebolt Chevrolet powerplant. Using color photography with step-by-step sequencing, Deve takes you through the disassembly, rebuild, and reassembly of these engines, including rebuilding the carburetor, distributor, and intake/exhaust systems. Tech Tips highlight areas that can be overlooked, such as proper cleaning and determining if a part is reusable, and an appendix provides information on decoding casting numbers. *Note: This book focuses on the 1954 and newer engines. These engines had insert bearings as opposed to the poured Babbitt bearings of the earlier models. With the majority of owners retrofitting the newer engines into older chassis, and the difficulty finding Babbitt professionals today, the focus of this book is on the 1954 and newer versions.* With millions of Chevrolets built with an inline-6 engine, there’s no shortage of candidates for a rebuild. With Chevrolet Inline-6 Engine: How to Rebuild, you will now have the perfect complementary tool to walk you through the entire engine-rebuilding process. ",
            "date": "Answered February 3, 2019",
            "views": "11",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Rockne Stephenson",
                "href": "/profile/Rockne-Stephenson"
            },
            "answer_text": "Are you aware that Chrysler used the same basic engine block 36to 58. The. Only visual difference were the spark plugs & water pumps. & V belts. No book can tell you all about line sixes. I dought one could find a spring compresser for any flat head ",
            "date": "Answered February 3, 2019",
            "views": "39",
            "upvotes": "0"
        }
    ]
}