{
    "title": "Are there any descendants of Henry VIII alive today? - Quora",
    "tags": [
        "King Henry VIII (historical figure)",
        "Descendants",
        "Genealogy",
        "History of Great Britain"
    ],
    "response": [
        {
            "author_info": {
                "name": "Alfred Jones",
                "href": "/profile/Alfred-Jones-150"
            },
            "answer_text": "From his legitimate children, no ,since none of them had children, Henry had no official grandchildren. Henry certainly acknowledged some of his illegitimate children, Henry Fitzroy being the most famous example, however there is possibly more illegitimate children that we don’t know about, and perhaps some that Henry himself didn’t know about. So there is likely descendants form Henry alive today, but not from his wife’s. ",
            "date": "Answered October 13, 2020",
            "views": "222",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Chris Spencer",
                "href": "/profile/Chris-Spencer-120"
            },
            "answer_text": "No. None of his children had children of their own, and the Tudor dynasty ended with Queen Elizabeth. All subsequent monarchs of England and the UK are descended from Henry’s sister Margaret, who married the King of Scots. ",
            "date": "Answered October 8, 2020",
            "views": "590",
            "upvotes": " View 10 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Vlad Racovita",
                    "user_href": "/profile/Vlad-Racovita-2"
                }
            ]
        },
        {
            "author_info": {
                "name": "Selene Daws",
                "href": "/profile/Selene-Daws"
            },
            "answer_text": "There are no legitimate descendants. None of Henry's legitimate children had children of their own. Only one of them married (Mary) and she married late at 38 to a cousin. None of the acknowledged illegitimate children had children either, but it is possible that there may have been other illegitimate children that no one knew about. ",
            "date": "Answered October 14, 2020",
            "views": "439",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Federico Granzotto",
                "href": "/profile/Federico-Granzotto"
            },
            "answer_text": "It is almost impossible that there are not descendants of Henry VIII alive. This because kings had often a lot of illegitimate children. The only problem is that those children do not know that they are descendants of Henry VIII. ",
            "date": "Answered October 9, 2020",
            "views": "126",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "William Aitchison Todd",
                "href": "/profile/William-Aitchison-Todd"
            },
            "answer_text": "There are Tudors alive today but, whether they are related or not I do not know. My wife is a Tudor and she does have the red hair of the Tudors. ",
            "date": "Answered October 12, 2020",
            "views": "83",
            "upvotes": "0"
        }
    ]
}