{
    "title": "Are publishers interested in picking up books that have already been self-published? - Quora",
    "tags": [
        "Publishers",
        "Self-Publishing",
        "Book Publishing",
        "Publishing"
    ],
    "response": [
        {
            "author_info": {
                "name": "Emil Fortune",
                "href": "/profile/Emil-Fortune-1"
            },
            "answer_text": "Sure, sometimes. The book that you want, as a publisher, is the one which has already had success and built an audience, but which you can take to the next level in terms of sales. This has been going on for years, in a small way. I can think of a couple of books I've been involved in over the years which were acquired after the authors invested significant sums in publishing their own work in print, then selling them in to bookshops very effectively. This was not easy to do, especially the last part. Self-publishing in print is very dicey; the setup costs are expensive, it's hard to get into bookshops without a sales network already in place, and you need to deal with thorny issues like production costs on small runs and warehousing/distribution costs across very small lists (or single books.) So if - as is more likely than not - your book doesn't sell well, you'd be out thousands of pounds, and sitting on a garage-full of unsold books. Publishers are more easily able to absorb those kinds of risks - that is, in fact, what a publishing company is for - so they still have a big advantage in the world of print books. There has been a shift in the balance recently, as it's become more economical and accessible to do print-on-demand or short-run digital printing - platforms like Createspace, say, and of course Amazon as a shop window - but there's still a big scale advantage for trade publishing. So that's where you get a story like Fifty Shades Of Grey. Now, this wasn't, I think, technically self-published, but it was published by a small press who couldn't offer the gigantic scale and reach of Random House. It follows the same kind of pattern: an editor in New York overhears mums discussing the book at the school gates, and it turns out that it's a kind of cult hit already, and praise be there are three of them written already. Instant trilogy.  Random steps in and scales things up enormously. At one point, an entire continent of printers runs out of silver ink, because of all the copies of the silver-covered books that are being printed and reprinted. I'm pretty sure there are paper mills in business today that wouldn't otherwise have been. The marketing is brilliant, it's in every shop, people buy the whole trilogy at once. And they like it, and tell their friends, and it's viral, and becomes the biggest-selling book in history. (Or something. I forget the exact stat and am too lazy to Google it now.) That's the ideal situation that you're looking for. Your proposition to the author is that you can bring the scale up enormously. They'll make way more money even if they're taking less of a cut of each individual book sale, is the pitch.  What this all requires though is that the self-published book is successful in a particular kind of way before the publisher becomes aware of it. You either need for it to be selling strongly through trade channels, or channels shared with the trade, or you need for it to pop up in the line of sight of some kind of publishing professional in another way. The conversation at the school gates a few thousand miles away is brilliant - it demonstrates that there's already some kind of social media reach for this story, and - crucially - that people are talking about it in real life too. ",
            "date": "Answered February 13, 2015",
            "views": "565",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Joe Hannington",
                    "user_href": "/profile/Joe-Hannington"
                },
                {
                    "user_id": "Rachel Caine",
                    "user_href": "/profile/Rachel-Caine-3"
                }
            ]
        },
        {
            "author_info": {
                "name": "John Joss",
                "href": "/profile/John-Joss"
            },
            "answer_text": "Yes. Famous example: The Celestine Prophecy by James Redfield. He sold 100,000 copies from his car before Crown picked it up. It became a big best seller and was made into a film. Not-famous example: My own SierraSierra, a novel about soaring (gliding). I self-published it with my own publishing company (The Soaring Press) before it was picked up by William Morrow in New York. It sold out but was not reprinted.  It’s rare, but it happens. My book was under consideration by Clint Eastwood to make into a film but he decided against it when he considered that much of the book described flying a single-seat sailplane (photo below of my Libelle with canopy removed). The book, though a novel, describes Alcor, a pressurized sailplane that hangs today in the Seattle Air Museum at Boeing Field..  Why all this detail? Self-serving? Not my intention. I want more than anything else to encourage any writer to create his or her own book and rely on the one-in-a-million chance that a major publisher will like it. It can happen, but the odds are so long as to defy belief. I can still hardly believe my good fortune. ",
            "date": "Answered August 20, 2020",
            "views": "340",
            "upvotes": " View 2 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Sharon Breivogel-Leonard",
                    "user_href": "/profile/Sharon-Breivogel-Leonard"
                },
                {
                    "user_id": "Christian Hans",
                    "user_href": "/profile/Christian-Hans-13"
                }
            ]
        },
        {
            "author_info": {
                "name": "Eileen M. Gormley",
                "href": "/profile/Eileen-M-Gormley"
            },
            "answer_text": "It can, but the odds are it won’t be. Look, one of two things will happen. Your self-published book is a roaring success, sells thousands of copies a day, and you’re making a lot of money. So if the traditional publisher comes to you and says they want to publish it and give you 8% royalties, you will laugh at them. Or your self-published book is not selling. It sold a couple of hundred copies to your friends and family, but sales have slowed to a trickle. The traditional publisher is likely to say, “This book doesn’t sell.” Maybe they like the book, but they are more likely to tell you to send them your next book, rather than take on a book which is not selling. Of course there are exceptions, but you’ll notice that traditional publisher are not trawling Amazon looking for self-pubs to publish. ",
            "date": "Answered July 25, 2019",
            "views": "305",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Rachael Saltzman",
                    "user_href": "/profile/Rachael-Saltzman"
                },
                {
                    "user_id": "Thomas P. Buehner",
                    "user_href": "/profile/Thomas-P-Buehner"
                }
            ]
        },
        {
            "author_info": {
                "name": "Carol Ann Newsome",
                "href": "/profile/Carol-Ann-Newsome"
            },
            "answer_text": "Fifty Shades of Gray was self-published. Hugh Howey and Colleen Hoover hopped the fence. Publishers will sometimes pick up self-published works, but only after the book has an established track record. The contracts offered frequently demonstrate a lack of reality, as they drastricly cut author royalties and limit the author's ability to publish other works for an extended period without committing to a level of promotion or distribution that would make the loss of income worthwhile. And on top of it you get people telling you how to write. So, yeah, it happens, but do the math before you sign. I know a number of authors who are jumping the fence ... but in the other direction! ",
            "date": "Answered February 12, 2015",
            "views": "403",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Joe Hannington",
                    "user_href": "/profile/Joe-Hannington"
                },
                {
                    "user_id": "Ana Sanchez-Tan",
                    "user_href": "/profile/Ana-Sanchez-Tan-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Robin de Jongh",
                "href": "/profile/Robin-de-Jongh"
            },
            "answer_text": "Yes they are. Walk a mile in their shoes for a moment and think about it from their perspective. Every author they sign is a risk. Each book they develop takes investment. Anything that will reduce that risk a little is worth doing. So let's say I was acquiring for a fiction house, and I had a manuscript in hand from a first time author whose writing I thought was great. If I give them a contract, I have to pay them an advance, then persuade the boss to fork out many thousands of dollars to finance the editing and production of the book, the marketing and the promotion. Then that book could sell nothing and we lose it all. Now, if I have in the other hand a self published book that's not as good, that I don't like as much, but it has a thousand people who already paid good money to read it, then I'll always be tempted to go with that. Why? Because if before I got to it it sold 1000, then once I'm through with improving it I'm sure it'll sell 10,ooo, and that's all I need for it to have covered costs. In other words, the risk is gone. Business success is reached as much through minimising risk as maximising return on investment. ",
            "date": "Answered February 12, 2015",
            "views": "436",
            "upvotes": " View 2 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Steven Jay Griffel",
                    "user_href": "/profile/Steven-Jay-Griffel"
                },
                {
                    "user_id": "Elizabeth Abram",
                    "user_href": "/profile/Elizabeth-Abram"
                }
            ]
        },
        {
            "author_info": {
                "name": "Christine Keleny",
                "href": "/profile/Christine-Keleny"
            },
            "answer_text": "It used to be a no-no to self-publish then try to get in with a traditional publisher, but if you books is selling well, very well, and if you have a good following of fans - to your blog and/or author facebook page and/or website, they might come looking for you. Every year you read about more and more authors that are getting picked up for just these reasons. If you’re making good money yourself and have a good platform, publishers want in on that success. This takes a lot of time and effort, mind you, but it’s doable and once you’re on your way and you are building followers and readers, start looking for an agent. You will need one of those anyway. And if you can convince an agent to pick you up, you have a better chance of getting in with a traditional publisher. Christine ",
            "date": "Answered March 10, 2017",
            "views": "185",
            "upvotes": " Answer requested by Victoria LaVonne",
            "upvoters": [
                {
                    "user_id": "Melinda Clayville",
                    "user_href": "/profile/Melinda-Clayville"
                }
            ]
        },
        {
            "author_info": {
                "name": "Shawn Bell",
                "href": "/profile/Shawn-Bell"
            },
            "answer_text": "Absolutely! It happens more often that some people seem to think. In order to be considered, the publishing company is going to want to know more about your work(s)-in-progress, as picking up just one title isn’t really a good business model. They’re also going to want to talk rights - especially if it is a work that would possibly translate to a solid film idea. So the answer is yes; but be prepared for sticker-shock. You’re going to be giving up creative control and a whole lot of future revenue by settling for a publishing deal through a traditional publisher. ",
            "date": "Answered July 30, 2019",
            "views": "167",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Shoaib Taimur",
                    "user_href": "/profile/Shoaib-Taimur"
                },
                {
                    "user_id": "Julie Black",
                    "user_href": "/profile/Julie-Black-9"
                }
            ]
        },
        {
            "author_info": {
                "name": "Kevin McLaughlin",
                "href": "/profile/Kevin-McLaughlin-170"
            },
            "answer_text": "Sometimes, but it’s rare, and when it happens it’s usually a bad deal for both parties. Here’s the thing: indie writers make about $2–5 per sale of their books. Trad writers make about $0.50–2 per sale of their books. That means an indie can make $10,000 from a book after just 2000–5000 sales, but a trad author would need 5000–20,000 sales to make the same income. By the time an indie writer is selling enough copies to interest a traditional publisher, they’re also EARNING enough that they would absolutely lose money by signing with a publisher. This is the boat myself and most other Indies are in. I make enough from each new book I write that I’d be taking a serious pay cut to work with a publisher. I’d also lose all rights to the work (and generally at least that universe/world, since I write fiction) for good. I’m still happy to work with a publisher; if one comes to me and asks me to write a book for them, I will, assuming the pay is good enough. But I won’t waste time chasing them; I don’t need them. ",
            "date": "Answered August 23, 2020",
            "views": "325",
            "upvotes": " View 2 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Joshua Stone",
                    "user_href": "/profile/Joshua-Stone-104"
                },
                {
                    "user_id": "Linda Ingmanson",
                    "user_href": "/profile/Linda-Ingmanson"
                }
            ]
        },
        {
            "author_info": {
                "name": "Travis Casey",
                "href": "/profile/Travis-Casey-4"
            },
            "answer_text": "That depends on what you mean by “picked up”. They can’t, for example, take over publishing the book without permission. There have been self-published books that were successful enough that a publisher took notice and made an offer to the author — a notable recent one is The Martian — but this is exceedingly unlikely. ",
            "date": "Answered May 28, 2020",
            "views": "94",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Gabriele Corti",
                    "user_href": "/profile/Gabriele-Corti-1"
                },
                {
                    "user_id": "Roksana Parvin Yasmin",
                    "user_href": "/profile/Roksana-Parvin-Yasmin"
                }
            ]
        },
        {
            "author_info": {
                "name": "Natik Ameen",
                "href": "/profile/Natik-Ameen-3"
            },
            "answer_text": "Yes, a self-published book can be picked up by a publisher. As per my experience as a book publisher, a book publishing company can show interest in publishing a self-published book as well. If you have self-published a book, that does not mean you should not contact book publishers to publish it. ",
            "date": "Answered May 28, 2020",
            "views": "71",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Karen Marie Shelton",
                    "user_href": "/profile/Karen-Marie-Shelton"
                }
            ]
        },
        {
            "author_info": {
                "name": "Sheri Fresonke Harper",
                "href": "/profile/Sheri-Fresonke-Harper"
            },
            "answer_text": "Yes, but not often. What matters to the publisher is if they think the self-published book has saturated the entire market. Often books will only sell to the authors family, or to the author's hometown. If sales are good, and more people in the market might buy it, then the publisher can often make the case of helping the author expand their market. ",
            "date": "Answered August 20, 2020",
            "views": "263",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Cyril Schmedlap",
                    "user_href": "/profile/Cyril-Schmedlap"
                },
                {
                    "user_id": "Andretta Schellinger",
                    "user_href": "/profile/Andretta-Schellinger"
                },
                {
                    "user_id": "Linda Ingmanson",
                    "user_href": "/profile/Linda-Ingmanson"
                }
            ]
        },
        {
            "author_info": {
                "name": "Rachel Caine",
                "href": "/profile/Rachel-Caine-3"
            },
            "answer_text": "It can happen, but usually only if it’s a viral success already. Publishers don’t rescue books that failed to sell. ",
            "date": "Answered May 28, 2020",
            "views": "61",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Jon Harris",
                    "user_href": "/profile/Jon-Harris-50"
                },
                {
                    "user_id": "Joshua Stone",
                    "user_href": "/profile/Joshua-Stone-104"
                },
                {
                    "user_id": "Roksana Parvin Yasmin",
                    "user_href": "/profile/Roksana-Parvin-Yasmin"
                }
            ]
        },
        {
            "author_info": {
                "name": "Jane Wickenden",
                "href": "/profile/Jane-Wickenden"
            },
            "answer_text": "Yes: it happened to Jill Paton Walsh, whose book Knowledge of Angels nobody would publish at first (once it was picked up by a publisher, it was shortlisted for the Booker Prize). But it doesn't happen often. ",
            "date": "Answered May 28, 2020",
            "views": "77",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Melinda Clayville",
                    "user_href": "/profile/Melinda-Clayville"
                }
            ]
        },
        {
            "author_info": {
                "name": "Conda V Douglas",
                "href": "/profile/Conda-V-Douglas"
            },
            "answer_text": "Depends on the publisher. Many publishers take only unpublished manuscripts to consider. And that means not published in any format, audio, print, eBook, websites, etc. Those publishers want new works to promote. Read the publisher's guidelines. ",
            "date": "Answered February 17, 2015",
            "views": "260",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Skip Press",
                "href": "/profile/Skip-Press"
            },
            "answer_text": "Yes, happens far more often than it used to. If you sell enough ebooks, they’ll probably find you. ",
            "date": "Answered July 26, 2019",
            "views": "19",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Melinda Clayville",
                    "user_href": "/profile/Melinda-Clayville"
                }
            ]
        },
        {
            "author_info": {
                "name": "Nicholas Blake",
                "href": "/profile/Nicholas-Blake"
            },
            "answer_text": "Self-published authors who are successful are successful only online. A traditional publisher will offer access to bricks-and-mortar retail outlets that are not available to self-published authors, as well as as translation and other deals. Fifty Shades was a success when published but would it have sold the 100 million copies it has in ebook form only? ",
            "date": "Answered February 12, 2015",
            "views": "189",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Steven Hutson",
                "href": "/profile/Steven-Hutson-1"
            },
            "answer_text": "My experience has been that no one wants to compete with a book that’s already out there. Yes, exceptions exist. But it’s rare. ",
            "date": "Answered March 23, 2017",
            "views": "36",
            "upvotes": " Answer requested by Melinda Clayville"
        },
        {
            "author_info": {
                "name": "Jean Rafenski Reynolds",
                "href": "/profile/Jean-Rafenski-Reynolds"
            },
            "answer_text": "Yes. It happened to me with one of my books. ",
            "date": "Answered July 25, 2019",
            "views": "12",
            "upvotes": " View 1 Upvoter"
        },
        {
            "author_info": {
                "name": "Rachael Saltzman",
                "href": "/profile/Rachael-Saltzman"
            },
            "answer_text": "With blowout sales, yes. It's unusual. If you do self publish, beware of scams claiming to be interested publishers. ",
            "date": "Answered June 4, 2020",
            "views": "29",
            "upvotes": "0"
        }
    ]
}