{
    "title": "Are there any significant discoveries that were not discovered by accident? - Quora",
    "tags": [],
    "response": [
        {
            "author_info": {
                "name": "Jay Bazzinotti",
                "href": "/profile/Jay-Bazzinotti"
            },
            "answer_text": "Many. Consider the light bulb. Edison often gets the credit but many people were working towards the goal of artificial light. Making one was simply a matter of trial and error and finding the right materials until a successful model was developed. No accident - hard work. Or perhaps the telephone. There was a race for such a machine between Elisha Gray and Alexander Graham Bell. Bell was quicker to the patent office after developing the principles and machines. Again, it was no accident - it was the result of trial and error and experimentation. What about the airplane? People had been struggling for years to build such a machine. Henson and Stringfellow created the principles of air travel in the 1850s before the advent of light internal combustion motors, so they tried to build lightweight steam engines to power the planes. The US government backed a crackpot named Langley whom they gave the credit to for building the first plane and even named the first aircraft carrier after him, but it was the Wright Brothers who broke the code. But it was no accident. Look at the Chronometer. The discovery of a method of determining longitude for sea navigation was a major unsolved problem since Danish ships first started ranging the oceans around 2500 BC but it was not til the English government offered the equivalent of 2 million dollars that the sea going navigation chronometer was invented by John Harrison, giving the English the ability to rule the seas. That was no accident but the result of years of trial and error and improvement upon improvement. Or even television. People were racing for a machine that would display moving pictures over the air like radio did for voice, but it was Philo T. Farnsworth who came up with the goods in the 1920s based on the work of Defforrest who developed the cathode tube in 1907. Farnsworth is largely forgotten because of a media blitz by unscrupulous RCA President Sarnoff who sent a scientist friend to steal Farnsworth’s ideas and would mount a major PR blitz claiming credit for his work. But television was no accident. It was the result of hard work. There are many discoveries made by sweat and tenacity and I think that today most discoveries are made that way, not by accident as the vulcanization of rubber by Goodyear supposedly was, or the discovery of Penicillin supposedly was. ",
            "date": "Answered November 24, 2017",
            "views": "12",
            "upvotes": " View 18 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Raymond Russ Kroll",
                    "user_href": "/profile/Raymond-Russ-Kroll"
                },
                {
                    "user_id": "Veronica Scavo",
                    "user_href": "/profile/Veronica-Scavo-1"
                },
                {
                    "user_id": "Karthik Kumar",
                    "user_href": "/profile/Karthik-Kumar-52"
                },
                {
                    "user_id": "Charles Agyeman",
                    "user_href": "/profile/Charles-Agyeman"
                },
                {
                    "user_id": "Sandy Perlmutter",
                    "user_href": "/profile/Sandy-Perlmutter"
                },
                {
                    "user_id": "Peter Šterba",
                    "user_href": "/profile/Peter-Šterba"
                },
                {
                    "user_id": "Matt Bahr",
                    "user_href": "/profile/Matt-Bahr-2"
                },
                {
                    "user_id": "Naomi Kerseybrown",
                    "user_href": "/profile/Naomi-Kerseybrown"
                },
                {
                    "user_id": "Philip Cobb",
                    "user_href": "/profile/Philip-Cobb-1"
                },
                {
                    "user_id": "Bradley Polanco",
                    "user_href": "/profile/Bradley-Polanco"
                },
                {
                    "user_id": "Kostea Frunza",
                    "user_href": "/profile/Kostea-Frunza"
                },
                {
                    "user_id": "Derrin Gottlieb",
                    "user_href": "/profile/Derrin-Gottlieb"
                },
                {
                    "user_id": "Nicholas Mew",
                    "user_href": "/profile/Nicholas-Mew-1"
                },
                {
                    "user_id": "Hervé Philippon",
                    "user_href": "/profile/Hervé-Philippon"
                },
                {
                    "user_id": "Saikat Guha",
                    "user_href": "/profile/Saikat-Guha"
                },
                {
                    "user_id": "Eleanor Murray",
                    "user_href": "/profile/Eleanor-Murray-1"
                },
                {
                    "user_id": "Chetan Madaan",
                    "user_href": "/profile/Chetan-Madaan"
                },
                {
                    "user_id": "Tran Hoang Hai",
                    "user_href": "/profile/Tran-Hoang-Hai"
                }
            ]
        },
        {
            "author_info": {
                "name": "Justice Långvall",
                "href": "/profile/Justice-Långvall"
            },
            "answer_text": "Well, fairly recently we found the Higgs boson, for example, using the Large Hadron Collider. That’s basically what it was built to do, so it wasn’t at all accidental. I would consider it quite a significant discovery. However, most such discoveries were already pretty much assumed to be true, already. The most interesting ones are the ones we discover “by accident”, because they weren’t expected, and therefore it may have a greater impact on how we see things. ",
            "date": "Answered November 24, 2017",
            "views": "46",
            "upvotes": " View 2 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Hussein Taher",
                    "user_href": "/profile/Hussein-Taher-2"
                },
                {
                    "user_id": "Hervé Philippon",
                    "user_href": "/profile/Hervé-Philippon"
                }
            ]
        },
        {
            "author_info": {
                "name": "Ted England",
                "href": "/profile/Ted-England"
            },
            "answer_text": "Almost none were discovered by accident. Nearly everything discovered in the past 200 years was found by someone looking in the right sort of places. Maybe they had an idea in mind and maybe they did not. ",
            "date": "Answered December 26, 2017",
            "views": "5",
            "upvotes": " Answer requested by Hervé Philippon"
        }
    ]
}