{
    "title": "Are the South Park creators Trump supporters? - Quora",
    "tags": [
        "South Park (TV series)",
        "Animated Television Series",
        "Animation",
        "Television",
        "Television Series"
    ],
    "response": [
        {
            "author_info": {
                "name": "Rob Wilson",
                "href": "/profile/Rob-Wilson-169"
            },
            "answer_text": "As a long time fan of the show I can tell you that South Park has mocked pretty much everyone over the course of their very long run with no regard for political preference. However I admit some of the more controversial episodes were those that offended the political left. Though this should not come as much of a surprise since the political left is more “offended” by social satire just in general than the right is. Some of the more controversial issues that jump to mind were the episode 201 which targeted Mohammad/Islam. This was by far the biggest shit storm in the history of the show. The episode was pulled entirely from streaming by Comedy Central and was censored on broadcast when the network received threats from various radical islamic organizations in the US and abroad.   The scientology episode ended up being controversial as the man who voiced Chef on the show was an active scientologist and ended up leaving the show entirely over the episode. Though he later claimed otherwise. Most of the rest of the controversy the show has generated has been garden variety identity politics issues. So accusations of racism, sexism, homophobia, etc. You know, the usual. Trey Parker and Matt Stone, the shows creators, do not appear to have been deterred in the least by any of these incidents. They have consistently shown that nobody is off limits from criticism and mockery, which I feel is one of the show’s core strengths. ",
            "date": "Answered November 16, 2018",
            "views": "27",
            "upvotes": " View 12 Upvoters",
            "upvoters": [
                {
                    "user_id": "Mariah Davy",
                    "user_href": "/profile/Mariah-Davy"
                },
                {
                    "user_id": "Mitch Williams",
                    "user_href": "/profile/Mitch-Williams-2"
                },
                {
                    "user_id": "Robert Silva",
                    "user_href": "/profile/Robert-Silva-38"
                },
                {
                    "user_id": "F. Koch",
                    "user_href": "/profile/F-Koch-1"
                },
                {
                    "user_id": "Pat Fenton",
                    "user_href": "/profile/Pat-Fenton"
                },
                {
                    "user_id": "Kevin Sheng",
                    "user_href": "/profile/Kevin-Sheng-18"
                },
                {
                    "user_id": "Patrick Stott",
                    "user_href": "/profile/Patrick-Stott-4"
                },
                {
                    "user_id": "William Joseph",
                    "user_href": "/profile/William-Joseph-78"
                },
                {
                    "user_id": "James LaBare",
                    "user_href": "/profile/James-LaBare"
                },
                {
                    "user_id": "Checkina H. Coulibaly-疏炒疑",
                    "user_href": "/profile/Checkina-H-Coulibaly-疏炒疑"
                },
                {
                    "user_id": "Connor Henry",
                    "user_href": "/profile/Connor-Henry-14"
                },
                {
                    "user_id": "Don Bruck",
                    "user_href": "/profile/Don-Bruck"
                }
            ]
        },
        {
            "author_info": {
                "name": "Enric Martinez",
                "href": "/profile/Enric-Martinez"
            },
            "answer_text": "Good question. I do not think they are, but there have been a few very strange things happening in the show that made me raise a brow. One that I keep in mind was in an episode about climate change. All was good and fun “Liberal” and “Greenbashing” with all the people saying silly alarmist stuff about global warming. Somebody said “But the scientists say it’s real”, then a kid appears and says “My dad is a scientist and he doesn’t says that”. The strange thing is that it wasn’t said in a funny or ironic mood, but just so, out of the air and context. A very WTF moment. What’s true is that a good bunch of the SP audience is the type of people who use to hang around shitholes like 4Chan, places where alt-right and stuff like this Kekistan crap abound. So, I don’t think they are directly pro-trumpers but they certainly pay tribute to the philosophy behind a good bunch of his followers. ",
            "date": "Answered December 17, 2018",
            "views": "14",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Crystal Hope Kendrick",
                    "user_href": "/profile/Crystal-Hope-Kendrick"
                },
                {
                    "user_id": "Checkina H. Coulibaly-疏炒疑",
                    "user_href": "/profile/Checkina-H-Coulibaly-疏炒疑"
                },
                {
                    "user_id": "Taumi Conohan",
                    "user_href": "/profile/Taumi-Conohan-1"
                },
                {
                    "user_id": "Nel Sharma",
                    "user_href": "/profile/Nel-Sharma-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Jimmy Dunlap",
                "href": "/profile/Jimmy-Dunlap"
            },
            "answer_text": "They’re not Trump supporters, they spent a whole season ripping HRC and DJT. They’re tired of current event based comedy and are hoping to take the show back to its roots. I really couldn’t see Trey or Matt being “supporters” of anything like a president, they are far too cynical to be so petty. “He’s not intentionally funny but he is intentionally using comedic art to propel himself,” he said. “The things that we do — being outrageous and taking things to the extreme to get a reaction out of people — he’s using those tools. At his rallies he gets people laughing and whooping. “I don’t think he’s good at it. But it obviously sells — it made him president,” he added. -Trey Parker ",
            "date": "Answered December 14, 2018",
            "views": "1",
            "upvotes": " View 9 Upvoters",
            "upvoters": [
                {
                    "user_id": "Lensei Nishizawa",
                    "user_href": "/profile/Lensei-Nishizawa"
                },
                {
                    "user_id": "Mitch Williams",
                    "user_href": "/profile/Mitch-Williams-2"
                },
                {
                    "user_id": "Checkina H. Coulibaly-疏炒疑",
                    "user_href": "/profile/Checkina-H-Coulibaly-疏炒疑"
                },
                {
                    "user_id": "Pat Fenton",
                    "user_href": "/profile/Pat-Fenton"
                },
                {
                    "user_id": "Jerry Mason",
                    "user_href": "/profile/Jerry-Mason-16"
                },
                {
                    "user_id": "Zoe Hornett",
                    "user_href": "/profile/Zoe-Hornett"
                },
                {
                    "user_id": "Paul Calonge",
                    "user_href": "/profile/Paul-Calonge"
                },
                {
                    "user_id": "Lelouch Nguyen",
                    "user_href": "/profile/Lelouch-Nguyen-1"
                },
                {
                    "user_id": "Nel Sharma",
                    "user_href": "/profile/Nel-Sharma-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Kenrick Bautista",
                "href": "/profile/Kenrick-Bautista"
            },
            "answer_text": "I mean, considering how they Trumpized Garrison, I highly doubt that these two are Trump supporters. Heck, in a very recent interview, Parker and Stone wrote that they hated both liberals and conservatives, with Stone famously commenting \"I hate conservatives but I really fucking hate liberals\"; in 2006, Parker commented in an interview that they were aware of the concept of the South Park Republican and they both felt that they were \"just pretty middle-ground guys\". Trey Parker even called the far left and the far right the exact same person. They vocally expressed hatred of both the Republican and Democratic parties. So are they Trump supporters? I don't think so. ",
            "date": "Answered November 21, 2019",
            "views": "660",
            "upvotes": " Answer requested by Nel Sharma",
            "upvoters": [
                {
                    "user_id": "Nel Sharma",
                    "user_href": "/profile/Nel-Sharma-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Aron Cox",
                "href": "/profile/Aron-Cox"
            },
            "answer_text": "No, it’s hard to find them directly talking about Trump in my quick Google search, but I’m pretty certain they are not Trump supporters from : a) They things they say about him in South Park b) The fact they are Libertarians, and Trump is so far off from a Libertarian ideal c) They flat out say they have conservatives as much as liberals GOPers claiming 'South Park' creators as their own are in for a rude awakening I think Libertarians are more mental than the rest put together, but it does allow them to make fun of pretty much everyone in South Park. ",
            "date": "Answered October 30, 2019",
            "views": "392",
            "upvotes": " Answer requested by Nel Sharma",
            "upvoters": [
                {
                    "user_id": "Checkina H. Coulibaly-疏炒疑",
                    "user_href": "/profile/Checkina-H-Coulibaly-疏炒疑"
                }
            ]
        },
        {
            "author_info": {
                "name": "Richard Davis",
                "href": "/profile/Richard-Davis-58"
            },
            "answer_text": "You are asking if Trey Parker and Matt Stone are Trump supporters? I haven’t watched the new series as of yet, but from what I have garnered from the last few series, I am willing to stake my own shitty reputation on “NO” the South Park creators are not supporters of Trump. In the form of “President Garrison”, I think that his ridiculous behaviour is more than enough of an exhibition of a TRUMP presidency. ",
            "date": "Answered December 14, 2018",
            "views": "369",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Bryan Campos",
                    "user_href": "/profile/Bryan-Campos-10"
                },
                {
                    "user_id": "Paul Calonge",
                    "user_href": "/profile/Paul-Calonge"
                },
                {
                    "user_id": "Checkina H. Coulibaly-疏炒疑",
                    "user_href": "/profile/Checkina-H-Coulibaly-疏炒疑"
                }
            ]
        },
        {
            "author_info": {
                "name": "James T. Bawden",
                "href": "/profile/James-T-Bawden"
            },
            "answer_text": "Thank you, for asking me to reply to your question. Good Evening. Your question is quite amusing to me. Oh, I know South Park is about as redneck a cartoon location as we are liable to find in cartoon land. Yet, I believe the creators of South Park are “spoofing” rednecks, in a comical way. I seriously doubt the same folks who are spoofing rednecks, would be supporting our president. I hope you have a pleasant Evening, my friend. ",
            "date": "Answered October 14, 2019",
            "views": "330",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Checkina H. Coulibaly-疏炒疑",
                    "user_href": "/profile/Checkina-H-Coulibaly-疏炒疑"
                }
            ]
        },
        {
            "author_info": {
                "name": "Marc Tinnez",
                "href": "/profile/Marc-Tinnez"
            },
            "answer_text": "Not necessarily. Both of them have admitted to be Libertarian leaning Republicans, but also have admitted to dislike Trump personally. ",
            "date": "Answered December 8, 2018",
            "views": "290",
            "upvotes": " View 3 Upvoters"
        },
        {
            "author_info": {
                "name": "Michael Shtalman",
                "href": "/profile/Michael-Shtalman"
            },
            "answer_text": "I’ve never watched it. But I know Trump haters will be surprised to find out how many smart, talented, and creative people prefer Trump to his opponents. Well, if you are in the entertainment industries, that might be safer and wiser to remain a closet Trump supporter. ",
            "date": "Answered November 23, 2018",
            "views": "161",
            "upvotes": " View 1 Upvoter"
        },
        {
            "author_info": {
                "name": "Walter Doherty",
                "href": "/profile/Walter-Doherty-1"
            },
            "answer_text": "I believe in an interview they said one was a liberal and the other is conservative. ",
            "date": "Answered November 17, 2018",
            "views": "129",
            "upvotes": "0"
        }
    ]
}