{
    "title": "Book recommendation: What are some of the best graduate level books for studying Mathematical Physics? - Quora",
    "tags": [
        "Mathematical Physics",
        "Physics Books",
        "Physics (college major)",
        "Applied Mathematics",
        "Book Recommendations"
    ],
    "response": [
        {
            "author_info": {
                "name": "Drew Henry",
                "href": "/profile/Drew-Henry-2"
            },
            "answer_text": "Arfken seems to be the standard. I used a combination of Arfken and Vaughn in my mathematical methods course. A lot of people seem to dislike Arfken, but I found it to be a readable book with a lot to offer. As for Vaughn, I did enjoy reading through it and found that it was easy to learn from but it seemed to be a little lacking in content and it isn't really arranged in such a way that will make it a good reference later. Of course, I don't actually own Arfken. On recommendation from the internet, I decided to purchase Hassani instead. When it arrived, I was quite shocked that it was maybe 4\" thick; there really is quite a bit in it (three chapters on Green's functions as opposed to the usually one chapter or one section). A need has recently arisen for me to build up my algebra background and there happens to be maybe a dozen chapters on groups, algebras, and representations. So far, I'd say it's one of the most readable textbooks I've come across and on top of that, it's formatted very nicely (the margins, for instance, contain notes labeling important concepts). In summary, Arfken is a decent book, but my recommendation goes to Hassani. ",
            "date": "Answered February 25, 2016",
            "views": "994",
            "upvotes": " View 7 Upvoters",
            "upvoters": [
                {
                    "user_id": "Deeponjit",
                    "user_href": "/profile/Deeponjit"
                },
                {
                    "user_id": "Ashutosh",
                    "user_href": "/profile/Ashutosh-546"
                },
                {
                    "user_id": "Deepthi Amarasuriya",
                    "user_href": "/profile/Deepthi-Amarasuriya"
                },
                {
                    "user_id": "Julian Grodzicky",
                    "user_href": "/profile/Julian-Grodzicky"
                },
                {
                    "user_id": "Tanya Diaz",
                    "user_href": "/profile/Tanya-Diaz-4"
                },
                {
                    "user_id": "Ehsan Nahvi",
                    "user_href": "/profile/Ehsan-Nahvi"
                },
                {
                    "user_id": "Tanzilur Rahaman",
                    "user_href": "/profile/Tanzilur-Rahaman"
                }
            ]
        },
        {
            "author_info": {
                "name": "Evie-May Bernal",
                "href": "/profile/Evie-May-Bernal"
            },
            "answer_text": "ISBN-13: 978-0691131023 ISBN-10: 0691131023 Mathematics for Physics and Physicists 1st Edition ",
            "date": "Answered November 24, 2018",
            "views": "209",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Kamil Jaszkowiak",
                    "user_href": "/profile/Kamil-Jaszkowiak"
                }
            ]
        }
    ]
}