{
    "title": "Can teenagers read Stephen King books? - Quora",
    "tags": [
        "Stephen King (author)",
        "Teenagers and Teenage Years"
    ],
    "response": [
        {
            "author_info": {
                "name": "David Graham",
                "href": "/profile/David-Graham-149"
            },
            "answer_text": "I’m not into horror fiction, so I haven’t read any of King’s stuff after ’Salem’s Lot and The Shining. But I doubt his books are scary enough to make teenagers afraid of monsters under their beds. If you meant to ask whether reading Stephen King is appropriate for a teenager because of concerns about a book’s “adult content” (whatever that means), I’d say yes. I don’t see why not. I read Lolita at fourteen. Didn’t care for it, to tell you the truth. When you’re a boy that age you’re not interested in younger girls: you dream of older women aged eighteen and nineteen. James Jones’s From Here to Eternity was the first big book I read at that age. This novel had over eight hundred pages, so reading it felt like a huge accomplishment. That year I also read Tropic of Cancer and my mom’s copy of Lady Chatterley’s Lover. From Here to Eternity was an amazing book, the others not so much. Vladimir Nabokov was too mannered and fastidious a writer for my taste, and Henry Miller and D.H. Lawrence were just flat-out bad. Parents get to decide what a teenager should or shouldn’t read. In that respect at least I was lucky in the parents I had. They were mostly oblivious about their parental duties, so I had a great deal of freedom at home—that is, when I was home from boarding school. My dad was a certified public accountant who loved hunting. He rarely read anything, and was a bit of a prude. Had he seen me with a copy of Madame Bovary, he would have assumed it was a book about a brothel keeper. He would have shaken his head in disappointment at the way I’d turned out, but he wouldn’t have tried to keep me from reading it. ",
            "date": "Answered December 6, 2017",
            "views": "17",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Jonathan Keiler",
                    "user_href": "/profile/Jonathan-Keiler-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Michael Lipphardt",
                "href": "/profile/Michael-Lipphardt"
            },
            "answer_text": "Oh yes. There is some sex at times, but it’s mild. Gore and horror is what Mr King is all about. And the stories are great, for the most part. And there is nothing in them that requires you to be an adult. You just need a good grasp of the english language and reading skills. If you can find it, read Head Down. It’s not fiction. King built a baseball field for little league. He is intensely into baseball and he has a team which apparently went to states, and possibly further. He wrote about the season leading to states and I personally think it was the most powerful thing he ever wrote. His love of baseball and for the kids is very clear. ",
            "date": "Answered December 6, 2017",
            "views": "985",
            "upvotes": "0"
        }
    ]
}