{
    "title": "Can NCERT at at your fingertips can substitute NCERT Book? - Quora",
    "tags": [
        "National Council of Educational Research and Training (NCERT)"
    ],
    "response": [
        {
            "author_info": {
                "name": "Anuj Kr Hembrom",
                "href": "/profile/Anuj-Kr-Hembrom"
            },
            "answer_text": "I think you might be preparing for NEET or JEE MAINS/ADVANCE. If it is the case then As your question you should not substitite ncert with any book especiallly when there are merely 2 months left for the exams. You must go through each and every line of ncert . MTG fingertips has roughly 100 questions per chapter . So it wont be able to cover each and every topic of the ncert which could be easily done by you after going ncert book multiple times. For practice you can sure attempt questions from mtg BUT REMEMBER NCERT IS EQUIVALENT TO ANY HOLY BOOKS WHEN IT COMES TO COMPETITIVE EXAMS. ",
            "date": "Answered April 7, 2020",
            "views": "58",
            "upvotes": " Answer requested by Shymal Kumar"
        },
        {
            "author_info": {
                "name": "Reks Nair",
                "href": "/profile/Reks-Nair"
            },
            "answer_text": "There is no other school that can substitute the NCERT textbook. I don't mean that no other book has the standard. I mean that for the CBSE board exams and other talent search examinations conducted by the CBSE board, it is important to refer to the NCERT text books. You can always refer to other text books and guides for further information as well as for understanding the concepts. ",
            "date": "Answered April 7, 2020",
            "views": "46",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Shreya Shrivastava",
                "href": "/profile/Shreya-Shrivastava-87"
            },
            "answer_text": "No.. but it will definitely helps you to masters in NCERT…!! Some extra topics also given in this book which also useful for AIIMS or jipmer With fingertips and samples you diidnt even need any extra books… I personally recommend fingertips of chemistry and bio. ",
            "date": "Answered April 8, 2020",
            "views": "49",
            "upvotes": " Answer requested by Shymal Kumar"
        },
        {
            "author_info": {
                "name": "Vipul Maisske",
                "href": "/profile/Vipul-Maisske"
            },
            "answer_text": "For chemistry, No. For Maths, maybe. For Physics, Yes. ",
            "date": "Answered May 16, 2020",
            "views": "32",
            "upvotes": " Answer requested by Shymal Kumar"
        }
    ]
}