{
    "title": "Can I use Amazon Kindle to read books bought elsewhere not from Amazon? - Quora",
    "tags": [
        "Kindle App (iOS)",
        "eBook Readers",
        "Amazon Kindle (product)",
        "eBooks",
        "Amazon.com (product)",
        "Amazon (company)"
    ],
    "response": [
        {
            "author_info": {
                "name": "Nora Jean Stone",
                "href": "/profile/Nora-Jean-Stone"
            },
            "answer_text": "Kindle requires mobi files. There are a number of ways to convert files to mobi. Amazon has Kindle Gen https://www.amazon.com/gp/feature.html?ie=UTF8&docId=1000765211 It does require you to boss your DOS, but not that much. I convert my fiction epub files from Scrivener into a mobi file and upload the mobi to my Kindle with the same cord that I use to recharge the Kindle. The USB end of the plug goes into your computer/laptop that has the mobi file, and the micro usb goes into the Kindle. That makes your Kindle a storage device. I copy the mobi file I made with Kindle Gen and paste it into the Kindle “Doc” folder. It then shows up in my “Doc” section of my Kindle. Once you get the hang of converting any document into a mobi file the whole process takes just a couple of minutes. At first it’s a bit hair raising. ",
            "date": "Answered August 10, 2019",
            "views": "285",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "B Smith",
                "href": "/profile/B-Smith-38"
            },
            "answer_text": "Not really. Get Calibre freeware. It reads epub files and is my secondary e-reader for non-kindle books. It’s updated a lot and I do donate to the site though the download is free. At this point, I have more books in Calibre than Kindle. The software author pronounces it ‘caliber’ like a weapon, not ca- LEE-bray the Latin or Spanish pronunciation. Apparently, he was educated in the UK or in British English and like ‘centre’ vs American ‘center’, the ’er’ order is reversed. ",
            "date": "Answered August 10, 2019",
            "views": "105",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Bill West",
                    "user_href": "/profile/Bill-West-8"
                }
            ]
        },
        {
            "author_info": {
                "name": "Ben Guy-Williams",
                "href": "/profile/Ben-Guy-Williams"
            },
            "answer_text": "I was really angry when, after buying a Kindle and reading one book I bought on Amazon, I found Amazon remove many kindle options from their sales… So I found another source, then I used Calibre on my Linux PC - which can convert and edit books. It’s much more convenient than using the Kindle interface to manage my books… ",
            "date": "Answered August 13, 2019",
            "views": "27",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Catherine Lee",
                "href": "/profile/Catherine-Lee-425"
            },
            "answer_text": "If your public library has e-books, you can read them on your Kindle. And you don’t even have to buy them. ",
            "date": "Answered August 10, 2019",
            "views": "34",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Linda McGuire",
                    "user_href": "/profile/Linda-McGuire-9"
                }
            ]
        }
    ]
}