{
    "title": "Can I sell online (on Flipkart, Amazon) the products I have bought online? - Quora",
    "tags": [
        "Amazon Vs. Flipkart",
        "Online Selling",
        "Flipkart.com (product)",
        "Amazon (company)",
        "Online Shopping"
    ],
    "response": [
        {
            "author_info": {
                "name": "Mit Kotak",
                "href": "/profile/Mit-Kotak-1"
            },
            "answer_text": "Yes you can. But make sure you do not sell on the same site, from where you bought, this is just a safety thing i am suggesting. Also raise legal tax invoice and pay tax whatever is there, this business cannot be just for fun, and all legal formalities need to be done. I am a seller and what you are thinking is not going to make you earn profits as all websites will charge your commissions ranging from 10–30% depending on products and categories. Buying online and re-selling even if you have at a discounted rate and coupons i believe you do not have such discounts, if you want to sell online you need atleast 50% margin, that too you will realise after some months whether you are actually making profits, so beware. ",
            "date": "Answered June 1, 2016",
            "views": "592",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Venu Gopal",
                    "user_href": "/profile/Venu-Gopal-381"
                },
                {
                    "user_id": "Hanan Khurshid",
                    "user_href": "/profile/Hanan-Khurshid"
                }
            ]
        },
        {
            "author_info": {
                "name": "Gopal Kanani",
                "href": "/profile/Gopal-Kanani-1"
            },
            "answer_text": "Clearly Not, First You Need Brand Authorization Letter for Selling Specific Brand. and If You have It you can Buy at Cheap Rate directly from Dealer or Manufacturer. ",
            "date": "Answered June 1, 2016",
            "views": "202",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Vishal Kanani",
                    "user_href": "/profile/Vishal-Kanani-3"
                },
                {
                    "user_id": "Anil Prajapati",
                    "user_href": "/profile/Anil-Prajapati-5"
                }
            ]
        },
        {
            "author_info": {
                "name": "Venu Gopal",
                "href": "/profile/Venu-Gopal-381"
            },
            "answer_text": "Legally you cannot.  But if you are ready to some good up in between then you can sell it. You should have a TIN and VAT documents to be legally able to sell on online portals to raise an invoice. ",
            "date": "Answered May 31, 2016",
            "views": "257",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Sai Alekhya Chikkam",
                    "user_href": "/profile/Sai-Alekhya-Chikkam"
                }
            ]
        }
    ]
}