{
    "title": "Can an illustration of an animal silhouette be copyrighted? - Quora",
    "tags": [
        "Copyright",
        "Illustration",
        "Intellectual Property Law",
        "Copyright Infringement"
    ],
    "response": [
        {
            "author_info": {
                "name": "Erich Von Bulow",
                "href": "/profile/Erich-Von-Bulow"
            },
            "answer_text": "The answers so far have a mistaken understanding of copyright law, insofar as U.S. law is involved. Let’s assume the illustration was made in the U.S., so that we know your question is about U.S. law. If so, the correct answer can be found here: What Does Copyright Protect? In a nutshell, “Copyright … protects original works of authorship including literary, dramatic, musical, and artistic works…” that are fixed in a tangible medium. Thus, there are only a few very simple questions that need to be answered to know whether your illustration is protected by copyright: Did you make the illustration? Is it on paper or other tangible medium? Was it your original work? Was there even a “slight amount” of originality or creative expression? If yes, it is protected by copyright, from the moment you made the illustration. Registering your copyright in your illustration is a different matter, but that’s not what the question asked. Several of the other answers conflate the existence of copyright protection with meaningful enforcement of your copyright. Those are not the same thing, at all. Copyright protects the author only against someone else copying their creative expression. Thus, anyone else who creates an illustration of an animal silhouette, without copying your specific version of it (or someone else’s), has a copyright in their illustration, too. Proving copyright infringement requires (simplifying here) access to your copyrighted work and substantial similarity between your work and the alleged copy. If your illustration is simple, it’s difficult to show that someone else’s illustration is substantially similar. The result is that your copyright protection is probably very limited, but that doesn’t mean that your illustration isn’t protected by copyright. ",
            "date": "Answered February 9, 2020",
            "views": "67",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "James Sams",
                    "user_href": "/profile/James-Sams-6"
                },
                {
                    "user_id": "Ted Baker",
                    "user_href": "/profile/Ted-Baker-12"
                }
            ]
        },
        {
            "author_info": {
                "name": "Ted Baker",
                "href": "/profile/Ted-Baker-12"
            },
            "answer_text": "You must understand your copyrights. It is not copyright it is copyrights, a set of rights. To start an education about topic I recommend you read from cover to cover the The Graphic Artists Guild Handbook: Pricing & Ethical Guidelines. In addition consider consulting an attorney, one well versed in and that loves copyrights law and intellectual property. You can also read publications. One is titled The Copyright Guide A Fiendly Handbook to Protecting and Profiting From Copyrights by Lee Wilson These are some possible information sources of many on the copyrights topic. To get additional information on what copyrights are I suggest you check out this link: U.S. Copyright Office Can you draw a unique animal silhouette, create the unique silhouette in a 2d fixed form such as a black print on white paper. That art you can register for copyright. Go online sign up and register the work, pay the fee. Then you may have to defend the copyrighted image, that is not so easy. But it should be easy to enforce and defend ones copyrights, so if you agree then support the Case Act. You can read a bit about that follow this link CASE Act Stalled in Senate Due to Single Holdout, Says Copyright Alliance ",
            "date": "Answered February 26, 2020",
            "views": "17",
            "upvotes": " Answer requested by Sheryl Phillips",
            "upvoters": [
                {
                    "user_id": "Ted Baker",
                    "user_href": "/profile/Ted-Baker-12"
                }
            ]
        },
        {
            "author_info": {
                "name": "Anthony Bartoletti",
                "href": "/profile/Anthony-Bartoletti-1"
            },
            "answer_text": "In principle, yes. If you took a photo of the Grand Canyon, it is your picture. You decided how to frame it, the angle, the time of day, etc. So you can copyright that picture. But the only benefit of copyright is to prevent someone else from using your “art” without permission or payment. Therefore, it must be something sufficiently unique that a judge could tell when someone has used YOUR image, as opposed to having created one from scratch. In fact, it should be sufficiently unique that no one else is likely to have accidentally reproduced an image indistinguishable from yours. The silhouette of a teapot probably won’t cut it. A “generic” silhouette of a roadrunner (meep! meep!) may be too simple to copyright. But if no one has used it as a trademark for a business, you might be able to get it trademarked. This would not prevent others from copying and sharing your trademark - but if your business is successful, and a competitor comes along and tries to sell their product or services using your trademarked logo, they could be sued for attempting to pass their poorly made, knock-off products as yours, or attempting to make it appear that their services are endorsed by your company. ",
            "date": "Answered February 26, 2020",
            "views": "37",
            "upvotes": " Answer requested by Sheryl Phillips",
            "upvoters": [
                {
                    "user_id": "Travis Casey",
                    "user_href": "/profile/Travis-Casey-4"
                }
            ]
        },
        {
            "author_info": {
                "name": "Andrew Chapman",
                "href": "/profile/Andrew-Chapman-75"
            },
            "answer_text": "I’ll start by assuming this is asked as it applies to the United States. The answer is, yes it can — but there’s more information needed to say whether that’s true in your case. The most relevant thing you need to read is the concept of threshold of originality. This is what determines whether your silhouette is sufficiently unique to be eligible for copyright protection. And keep in mind, my answer is based on experience in publishing and design, not as an intellectual-property attorney. The protection of an illustration can get complicated depending on how it’s used, its form, and whether it needs to be trademarked. But everything hinges on the threshold of originality, so read up on that. Thanks for the A2A! [Answered: Can an illustration of an animal silhouette be copyrighted?] ",
            "date": "Answered February 19, 2020",
            "views": "33",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Ted Baker",
                    "user_href": "/profile/Ted-Baker-12"
                }
            ]
        },
        {
            "author_info": {
                "name": "Earl Dingman",
                "href": "/profile/Earl-Dingman-1"
            },
            "answer_text": "That’s hard to say. Possibly if it’s very artistic and unique. If it’s just a copy of the Playboy bunny head like we’d all made in plastics back in school, no. The problem is that it’s just too undefined. It could be challenged in court. The copyright office may also reject it. I’d give them a call and ask. It’s only $35 so if you have the money and want to possibly waste it, do it. I’ll be frank. Services like Getty Images make these kinds of things available and they have a big war chest if you ever challenge the on your copyright. Of course if you have a form and a number and they don’t, and their images is a copy of your image, then you could win hands down. If there’s is slightly different and you can match the two up perfectly, you could lose. ",
            "date": "Answered February 4, 2020",
            "views": "31",
            "upvotes": " Answer requested by Sheryl Phillips",
            "upvoters": [
                {
                    "user_id": "David Mullich",
                    "user_href": "/profile/David-Mullich"
                }
            ]
        },
        {
            "author_info": {
                "name": "Todd Gardiner",
                "href": "/profile/Todd-Gardiner"
            },
            "answer_text": "Possibly. Pretty hard to say in just the hypothetical, since this could clearly be challenged in court as “lacking sufficient effort or creativity”. I’d have to see the exact copyright. If you are asking “can I use this silhouette” because you feel it doesn’t have protections, be aware that your use definitely gives them grounds to sue. And thus this question is literally the one that your lawyer would try to get the jury to answer in a way that is favorable to you. That would be an expensive process of course. I would suggest that the risk adverse make careful consideration on whether to use someone’s work where this question exists. ",
            "date": "Answered February 5, 2020",
            "views": "57",
            "upvotes": " View 1 Upvoter"
        },
        {
            "author_info": {
                "name": "Thomas Ruddick",
                "href": "/profile/Thomas-Ruddick-1"
            },
            "answer_text": "Yes. It’s an origiinal work. If you do it yourself and not for an employer, you are the copyright holder (if you register it your rights increase). However, you’re working in an area that’s not conduciv e to a lot of originality—any competent sketch artist or digital artist can produce a silhouettte of any animal, and unless it’s just ab out a line-by-line precise copy of your original, the courts probably would not consider it an infringment. Consider how many famous painters have produced images of London Bridge or the Colisseum—so long as the newer painting was not identical, it was not plagiarism. ",
            "date": "Answered February 19, 2020",
            "views": "14",
            "upvotes": " View 1 Upvoter "
        },
        {
            "author_info": {
                "name": "Konstantinos Konstantinides",
                "href": "/profile/Konstantinos-Konstantinides"
            },
            "answer_text": "I am not an attorney, but I think context is important. Is this part of a trademarked logo or used in trade? definitely. Is this part of a book (say, an illustration) of another document (an article, a paper, etc.)? Most likely Part of a collection of animals in clip art ? Most likely. A single drawing? Tough to tell, it has to be really unique and “creative.” ",
            "date": "Answered February 26, 2020",
            "views": "14",
            "upvotes": " Answer requested by Sheryl Phillips"
        },
        {
            "author_info": {
                "name": "Evelyn Elwell Uyemura",
                "href": "/profile/Evelyn-Elwell-Uyemura"
            },
            "answer_text": "Probably not. Works without enough \"originality\" (creativity) to merit copyright protection such as titles, names, short phrases and slogans, familiar symbols or designs, font design, ingredients or contents, facts, blank forms, etc. cannot be copyrighted. If it’s just a basic shape that anyone looking at a cat could draw, then there’s no IP in creating that. And if you copyright your outline of a cat, what do you plan to do if someone else makes the shape of a cat that looks very similar to yours? ",
            "date": "Answered February 4, 2020",
            "views": "42",
            "upvotes": " View 1 Upvoter"
        },
        {
            "author_info": {
                "name": "Rob Snow",
                "href": "/profile/Rob-Snow-2"
            },
            "answer_text": "I would say that you would have to proof that you were the person who took the photograph that the silhouette was made from. However, anything that is created instantly becomes copyrighted inherently by the person who created it. That said, it would depend on the court the district to the states the country that would be fine with her you win any kind of argument about copyright infringement based on something that could be considered very vague and open to interpretation. ",
            "date": "Answered February 19, 2020",
            "views": "17",
            "upvotes": " Answer requested by Sheryl Phillips"
        },
        {
            "author_info": {
                "name": "Jade Enright",
                "href": "/profile/Jade-Enright"
            },
            "answer_text": "The actual image can i.e. a company can’t take a digital copy of your image and use it in their marketing or whatever. However you can’t claim to have the copyright on drawing a silhouette of a duck. Anyone else is allowed to draw their own illustration ",
            "date": "Answered February 4, 2020",
            "views": "24",
            "upvotes": " Answer requested by Sheryl Phillips"
        },
        {
            "author_info": {
                "name": "Junaid Meo",
                "href": "/profile/Junaid-Meo"
            },
            "answer_text": "Yes, each and everything that is created by someone else is copyrighted if the owner claims for that work and registers his work. You can’t use it without the permission of the original creator. ",
            "date": "Answered February 26, 2020",
            "views": "11",
            "upvotes": " Answer requested by Sheryl Phillips"
        },
        {
            "author_info": {
                "name": "Bruce Nahin",
                "href": "/profile/Bruce-Nahin"
            },
            "answer_text": "You can file a copyright on any original work ",
            "date": "Answered February 6, 2020",
            "views": "11",
            "upvotes": " Answer requested by Sheryl Phillips"
        }
    ]
}