{
    "title": "Can a writer change the perspective of a story? - Quora",
    "tags": [
        "Fiction Writing",
        "Storytelling",
        "Creative Writing",
        "Writers and Authors",
        "Literature",
        "Writing Advice"
    ],
    "response": [
        {
            "author_info": {
                "name": "Will Greenway",
                "href": "/profile/Will-Greenway-1"
            },
            "answer_text": "Can a writer change the perspective of a story? If you mean “viewpoint” or “point of view” … yes, you can … but in short work you SHOULDN’T. As to why it’s “discouraged” as mentioned by another poster, is each viewpoint dilutes and dissipates the strength of the narrative. Often writers use other viewpoints to communicate things they feel are necessary to the understanding of the story’s epiphany. If the detail is important, you should have figured out how to communicate it in the SINGLE viewpoint. This comes round to how characters need four basic things for you to depict them properly and show their growth: A goal — initially the character will have some short term objective. However, when they come into contact with the story problem they will have a target to shoot for to resolve the conflict. The goal may change as the stakes in the story change…A desire — something that they are striving for, something they will fight and struggle to accomplish.A secret need — this can be the same thing as the character’s desire, but in stories with some kind of epiphany or self discovery… the protagonist eventually exchanges their desire for their need (epiphany). In Star Wars, Luke’s desire was to go to the academy and learn to fly. He sympathized with the rebellion but wasn’t motivated to join the cause. When his aunt and uncle are killed by the evil empire, his desire for revenge pushes him toward his need, and that is to find purpose in social responsibility and becoming a user of the force. So, Luke’s secret need was to become a Jedi.Stakes — this is what the protagonist cares about. Luke cared about his aunt and uncle. The empire killed them. This was his failure. When he is motivated by revenge, the new stakes become the freedom of the republic, and rebel alliance. Now, the problem is the Death Star is coming to destroy the rebels. So, now they must destroy the Death Star. If they fail, they lose. This win/lose consequence should be pervasive in the story and why it’s so important that a character have something under threat to maintain tension in the narrative.If you have only a short story length to establish these things for the protagonist… isn’t it best just to accomplish this?   ",
            "date": "Updated August 12, 2020",
            "views": "141",
            "upvotes": " View 2 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Laura Austin",
                    "user_href": "/profile/Laura-Austin-21"
                },
                {
                    "user_id": "Alex Wilson",
                    "user_href": "/profile/Alex-Wilson-693"
                }
            ]
        },
        {
            "author_info": {
                "name": "Denis Martindale",
                "href": "/profile/Denis-Martindale"
            },
            "answer_text": "There are times when writing for a character that a male writer switches from he to me instead. It’s not likely for a female character that a male writer switches like that. Another situation is when referring to an animal being called he in one line and it in another. So if that really gets out of hand then the writer may need to use the search and replace feature that word processors may provide. That can also apply to web pages, too. The search and switch being made for one word at a time, rather than for every time a certain word would appear in the text. A decision must be made for either the switch or the stay. Then the text can be saved as it should have been written. : ",
            "date": "Answered August 12, 2020",
            "views": "16",
            "upvotes": " Answer requested by Nelson Vidinha",
            "upvoters": [
                {
                    "user_id": "Shana Chen",
                    "user_href": "/profile/Shana-Chen-3"
                },
                {
                    "user_id": "Blake Le",
                    "user_href": "/profile/Blake-Le-4"
                }
            ]
        },
        {
            "author_info": {
                "name": "Scoot Booterson",
                "href": "/profile/Scoot-Booterson"
            },
            "answer_text": "Yes, even in short stories you can shift perspective. In the US if it happens too much it is called “head hopping” and is discouraged for some reason - but in other countries it’s not a big deal if the story takes different character’s perspectives. ",
            "date": "Answered August 11, 2020",
            "views": "48",
            "upvotes": " View 2 Upvoters"
        },
        {
            "author_info": {
                "name": "Blake Le",
                "href": "/profile/Blake-Le-4"
            },
            "answer_text": "You can certainly change the perspective of a story. It’s already been mentioned, but some people don’t like it if you shift perspective too often. When considering those audiences, you maintain a balance and don’t change perspective every other sentence. ",
            "date": "Answered August 11, 2020",
            "views": "30",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Jean Michael",
                "href": "/profile/Jean-Michael-7"
            },
            "answer_text": "I went out on a limb in the novel Blooded in Sleepy Hollow by having four narrators take turns telling the story in the same order: the wife, the husband, the chief detective, the young daughter. In each round the story advanced from four perspectives as the voice went from pure, to a little edgy, to openly racist to innocent round after round. The secret is held out to the end of a long narrative. Hope it works for readers. ",
            "date": "Answered August 11, 2020",
            "views": "21",
            "upvotes": " Answer requested by Nelson Vidinha"
        },
        {
            "author_info": {
                "name": "Brenda Nichols",
                "href": "/profile/Brenda-Nichols-9"
            },
            "answer_text": "Yes. From the omniscient point of view, the narrator knows everything from every character’s perspective. First person can be a bit tricky. Third person can often have different points of view written by having a break between transitions or by alternating chapters. Chapter one: Jane. Chapter 2: Dick Chapter 3: Jane, etc. ",
            "date": "Answered August 11, 2020",
            "views": "16",
            "upvotes": " Answer requested by Nelson Vidinha"
        },
        {
            "author_info": {
                "name": "Elizabeth Emond",
                "href": "/profile/Elizabeth-Emond-5"
            },
            "answer_text": "Sure. William Faulkner does that in The Sound and the Fury. The story is told not only by different characters; the characters speak from wildly differing moral perspectives. ",
            "date": "Answered August 11, 2020",
            "views": "15",
            "upvotes": " Answer requested by Nelson Vidinha"
        },
        {
            "author_info": {
                "name": "Harold Cohn",
                "href": "/profile/Harold-Cohn-1"
            },
            "answer_text": "You are the writer you direct the path the story. However, sometimes the story will tell you how the story should go. I suggest you listen to the story and abandon your original plan. To see my books go haroldcohn.com. Harold ",
            "date": "Answered August 12, 2020",
            "views": "9",
            "upvotes": " Answer requested by Nelson Vidinha"
        },
        {
            "author_info": {
                "name": "Francisco Ojeda",
                "href": "/profile/Francisco-Ojeda-12"
            },
            "answer_text": "Absolutely. I am currently writing a short story that has taken a different direction since the first time I developed the first draft. ",
            "date": "Answered August 12, 2020",
            "views": "10",
            "upvotes": " Answer requested by Nelson Vidinha"
        },
        {
            "author_info": {
                "name": "Jamzie Mccallen",
                "href": "/profile/Jamzie-Mccallen"
            },
            "answer_text": "Yes I do it all the time. As long as it makes sense and it flows nicely. It does not mater what point of view it is in. Just be careful that it is understandable to the reader. ",
            "date": "Answered August 11, 2020",
            "views": "11",
            "upvotes": " Answer requested by Nelson Vidinha"
        }
    ]
}