{
    "title": "Can I be sued for copying the text from the student book? - Quora",
    "tags": [
        "Sue",
        "International Copyright Law",
        "Copyright",
        "Copy and Paste",
        "Copyright Infringement",
        "Copyright Law",
        "Writers and Authors"
    ],
    "response": [
        {
            "author_info": {
                "name": "David Mullich",
                "href": "/profile/David-Mullich"
            },
            "answer_text": "United States Perspective. It is relatively easy for one person to sue another. If the copyright holders of the book objected to what you are doing, they could sue you for copyright infringement. Copyright infringement is the use of works protected by copyright law without permission, infringing certain exclusive rights granted to the copyright holder, such as the right to reproduce, distribute, display or perform the protected work, or to make derivative works. If you were sued for copyright infringement, you could make a Fair Use defense. Fair Use hinges on the following factors: The purpose and character of the use, including whether such use is of a commercial nature or is for nonprofit educational purposes;The nature of the copyrighted work;The amount and substantiality of the portion used in relation to the copyrighted work as a whole; andThe effect of the use upon the potential market for or value of the copyrighted work.It would be up to a judge to determine whether your use is fair use of the copyrighted work. I don’t know exactly what you mean by “I am making a script from a book and my script has identical words as a book but I shortened”. It is not clear to me how much of the book you are copying and the exact nature of your derivative work. I also don’t know what you mean by “all rights go to the writer of the book”, as it does sound to me that you might be infringing the writer’s exclusive right to make copies and/or derivative works. As for whether or not you are making a profit, that is just one factor in determining whether or not your use is fair use. That you are not making a profit is not in itself a defense. If you are concerned about getting sued, you should discuss the exact details of your usage with an attorney knowledgable about copyright law in your jurisdiction, not get legal advice from strangers on the internet. ",
            "date": "Answered April 12, 2017",
            "views": "473",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Marko Josipovic",
                    "user_href": "/profile/Marko-Josipovic-3"
                }
            ]
        },
        {
            "author_info": {
                "name": "Hal Cooper",
                "href": "/profile/Hal-Cooper-2"
            },
            "answer_text": "Education and research are fair use. With words it’s best if you can avoid copying exact text. Do something to make it different if you can. You don’t have to make it different; but that makes a stronger case. Each case is unique. This is likely very different from yours: The Harry Potter encyclopedia (not transformative): Although the creation of a Harry Potter encyclopedia was determined to be “slightly transformative” (because it made the Harry Potter terms and lexicons available in one volume), this transformative quality was not enough to justify a fair use defense. An important factor in the court’s decision was the extensive verbatim use of text from the Harry Potter books. Warner Bros. Entertainment, Inc. v. RDR Books, 575 F. Supp. 2d 513 (S.D.N.Y. 2008). ",
            "date": "Answered October 10, 2017",
            "views": "236",
            "upvotes": "0"
        }
    ]
}