{
    "title": "Can you explain your life’s purpose so far in one paragraph? - Quora",
    "tags": [
        "Paragraphs",
        "Meaning of Life",
        "Purpose",
        "Writing Advice",
        "Important Life Lessons",
        "Writing",
        "English (language)",
        "Philosophy of Everyday Life",
        "Life and Living"
    ],
    "response": [
        {
            "author_info": {
                "name": "Samari Smith",
                "href": "/profile/Samari-Smith-4"
            },
            "answer_text": "Just the other day I had a huge revelation; I discovered what my entire life had led up to, what it all meant! It was an eye opener. I recently purchased a house on a small lake (more like a glorified pond, only 10 acres). It has a lovely large wooded lot and a gorgeous view (no matter the weather, time of day or night [at night the people across the lake have lights on their docks that reflect, along with the moon, on the water giving the ripples from the wind a beautiful pattern]) of this sweet, small, quiet, duck and geese populated pond. I keep finding myself wasting hours upon hours just sitting on the porch rocking in my lawn chair looking out across the lake. I can literally sit there all day and later, when the sun sets, wonder what happened to the time. You see, I have always been a wanderer. I left home to go to college, left college to join the military and have not stopped moving ever since. Here is the statistic that defines my life since I graduated High School; I have not lived in one house (one address) for more than 3.5 years since 1981. Scary huh? Most of the moves were at the one year mark, but many were after just a few months. Some were military directed, others were after the military and the job just was not a good fit, I was in temp quarters while I looked for a more permanent abode, my partner/roommate decided to change things (or I did), and a plethora of other reasons to cause me to pack all I own, move, and unpack it all again. I have moved so many times that I have it down to a science; I know the bare minimum I need to survive for a year. I can put those items in a few boxes and if I know the next move will also be temporary I only need to unpack those few boxes to survive. I know to make an inventory of each box, put a copy in the box and keep a copy for myself; this helps when I need to locate something. So, what is the big revelation? What is the purpose of my life? Many of my moves, after becoming a civilian, were to get better jobs. I have always kept my eye on the fact that I need to retire at a particular grade as that drives my annuity. I need a certain level of income so that I can manage my bills, maintain a level of life style (I am simple so I don't need that much), and to pay for or maintain the homes I rent (I am not a \"landlord\" by trade and I won't throw people out just to sell a house, as long as they are good tenants I will let them stay and I will just suck it up and deal with the maintenance and taxes, everyone needs good housing). So, all this packing, and unpacking, all the searching for a home, all the resume building and job applications all the searching and searching for home and jobs and for what? To establish a grade that will provide for me in my retirement. Am I there? No. So, what is the Revelation? That all my moves, all my searching, all my work as been so I could find a house on the side of a small quiet lake where me, my cats, and the ducks and geese can commune. That is all it is for; a place of peace with a bit of calm and quiet attached. Nothing more, no great celebratory life after all of the work, just a bit of peace and quiet. I never expected to find a home so calming, so peaceful that I would give up the pursuit of more retirement income and just sit on the porch and watch the sunrise or set. I had no clue that this was all I had been looking for all this time. Amazing. It all seems so simple and, honestly, a bit anticlimactic (until the geese get to squabbling, but that is another story for another time). ",
            "date": "Answered May 8, 2019",
            "views": "612",
            "upvotes": " View 6 Upvoters",
            "upvoters": [
                {
                    "user_id": "Alexis Williams",
                    "user_href": "/profile/Alexis-Williams-490"
                },
                {
                    "user_id": "Christopher Jackson",
                    "user_href": "/profile/Christopher-Jackson-187"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/Micah-Moose"
                },
                {
                    "user_id": "Elizabeth Nunya",
                    "user_href": "/profile/Elizabeth-Nunya-2"
                },
                {
                    "user_id": "Anthony Graham Clark",
                    "user_href": "/profile/Anthony-Graham-Clark"
                },
                {
                    "user_id": "David Rudko",
                    "user_href": "/profile/David-Rudko-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Rodney Lewis",
                "href": "/profile/Rodney-Lewis-3"
            },
            "answer_text": "My life’s purpose—our lives’ purpose—is love. Pure and simply that. I am here to learn what love means. I’m here to learn to practice love and to get better and better at it. I’m here to learn how to love those for whom it is difficult to love. My religion is love. My reward could never be anything greater than love. If I cannot find love for those hard to love, my love is worth nothing for those easy to love. Unconditional love doesn’t exist in this world yet to strive for it is all life is worth living for, the most gallant of endeavors. I am not perfect but I do my best to do everything I do in the spirit of love. God is love. God is oxytocin’s lie made true. To love God is to love indiscriminately, to love until it hurts. ",
            "date": "Answered May 22, 2019",
            "views": "114",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Ra-v Prasad",
                    "user_href": "/profile/Ra-v-Prasad"
                }
            ]
        },
        {
            "author_info": {
                "name": "Sabri Shahin",
                "href": "/profile/Sabri-Shahin"
            },
            "answer_text": "To pass the testing mission in this temporary testing stage, to be blessed in this life and to be saved in the afterlife. For those who can afford to read more than one paragraph, the following answers include the details: https://www.quora.com/What-are-Gods-greatest-teachings/answer/Sabri-Shahin https://www.quora.com/How-do-we-know-our-purpose-of-existence-in-this-world/answer/Sabri-Shahin https://www.quora.com/What-makes-us-happy-in-our-lives/answer/Sabri-Shahin https://www.quora.com/What-are-some-life-philosophies-that-cut-across-all-cultures/answer/Sabri-Shahin https://www.quora.com/What-are-the-differences-between-the-Holy-books-of-different-religions-Do-all-of-them-promote-love-humanity/answer/Sabri-Shahin https://www.quora.com/If-God-is-loving-and-caring-why-does-evil-and-suffering-still-exist/answer/Sabri-Shahin ",
            "date": "Answered May 31, 2019",
            "views": "23",
            "upvotes": " Answer requested by Anthony Graham Clark and April Swanson",
            "upvoters": [
                {
                    "user_id": "Clayton Martin",
                    "user_href": "/profile/Clayton-Martin-15"
                },
                {
                    "user_id": "Peter Hunter",
                    "user_href": "/profile/Peter-Hunter-69"
                },
                {
                    "user_id": "Marija Lišanin",
                    "user_href": "/profile/Marija-Lišanin-1"
                },
                {
                    "user_id": "Angelia Milanovic",
                    "user_href": "/profile/Angelia-Milanovic"
                },
                {
                    "user_id": "Tanya Munoz",
                    "user_href": "/profile/Tanya-Munoz-4"
                },
                {
                    "user_id": "Jim Barr",
                    "user_href": "/profile/Jim-Barr-1"
                },
                {
                    "user_id": "Grant Gassman",
                    "user_href": "/profile/Grant-Gassman"
                },
                {
                    "user_id": "K. Colin",
                    "user_href": "/profile/K-Colin"
                }
            ]
        },
        {
            "author_info": {
                "name": "Sally Alter",
                "href": "/profile/Sally-Alter"
            },
            "answer_text": "I have always lamented that I had no purpose in life, but at my therapist’s office yesterday I realized that I am actually ‘living my life’s purpose’ now that I am writing regularly on Quora. I mostly specialize in writing about Bipolar Disorder as that’s where I think I can give the most helpful answers, and have now been told many times that I am giving invaluable advice to people all over the world. It’s not too many people who can say they have made a difference in their lifetime. I now find that I am doing it. ",
            "date": "Answered June 5, 2019",
            "views": "384",
            "upvotes": " View 8 Upvoters",
            "upvoters": [
                {
                    "user_id": "Moses Freedman",
                    "user_href": "/profile/Moses-Freedman"
                }
            ]
        },
        {
            "author_info": {
                "name": "Linda Zebert",
                "href": "/profile/Linda-Zebert"
            },
            "answer_text": "As a follower of Jesus, to be truthful about how life is worth living because of Him. To my father, God, to share the gospel of His son and my savior and to the Holy Spirit, to let Him guide me and strengthen my resolve not to give in to the weakness within but to fight with all His might to lessen satans hold on those around me. For God so loved the world, that he gave his only begotten Son, that whosoever believed in him should not perish, but have everlasting life. ... For God loved the world in this way: He gave his one and only Son, so that everyone who believes in him will not perish but have eternal life. John 3:16 KJV ",
            "date": "Answered May 10, 2019",
            "views": "46",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Mike Masters",
                "href": "/profile/Mike-Masters-41"
            },
            "answer_text": "Help someone in need without asking for anything in return, life will reward you tenfold because of your actions. Use your life experience as a way to help someone avoid the mistakes you’ve made or share what worked for you so they can succeed along with you. Explore the universe further because there are so much more things to be discovered and only few human beings actually exploring it. Well that took 3 ✌️ Also inspire people to create more because all that matters is for you to participate into the process of creation, because that way you can shape the world as you want to see it Here goes the 4th one  ",
            "date": "Answered July 26, 2019",
            "views": "22",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Sarvan Kumar Shaw",
                    "user_href": "/profile/Sarvan-Kumar-Shaw"
                }
            ]
        },
        {
            "author_info": {
                "name": "Saam Saeed",
                "href": "/profile/Saam-Saeed-1"
            },
            "answer_text": "My life's purpose is to be kind, helpful and care for the people I love. The truth is with the help of social media I have been able to take this much far using posts and stories to inspire and help people stand-up for themselves. One recent addition is the love of my life and I would like to refer her as K, I want to love her unconditionally whether we are together or apart because she makes me really happy and her presence lightens me up every time. Most importantly this comes from the fact that I know myself and I am satisfied by what I have, hence I want to give back to where I have stared from. The people. ",
            "date": "Answered May 9, 2019",
            "views": "34",
            "upvotes": " Answer requested by Anthony Graham Clark",
            "upvoters": [
                {
                    "user_id": "Sarvan Kumar Shaw",
                    "user_href": "/profile/Sarvan-Kumar-Shaw"
                }
            ]
        },
        {
            "author_info": {
                "name": "Richard S Stone",
                "href": "/profile/Richard-S-Stone"
            },
            "answer_text": "My purpose is to raise, provide for, and protect my two daughters. I’m doing that reasonably well at this point, I think. Meanwhile, I believe that we have a purpose in life, which is to reproduce. That is sort of definitional, and not particularly grand or noble. Meanwhile, we can use that purpose to provide some meaning to life, but that does not mean that humans are here on earth for some purpose, or that life has some meaning. ",
            "date": "Answered May 15, 2019",
            "views": "41",
            "upvotes": " Answer requested by Anthony Graham Clark",
            "upvoters": [
                {
                    "user_id": "Anthony Graham Clark",
                    "user_href": "/profile/Anthony-Graham-Clark"
                }
            ]
        },
        {
            "author_info": {
                "name": "Lawrence Leonard Taylor",
                "href": "/profile/Lawrence-Leonard-Taylor"
            },
            "answer_text": "My purpose in life is to build broad-bridges over the gaps that separate people. I do this by positively addressing my pain, keeping my shadows in front of me, telling meaningful and inspiring stories while building people, businesses products and services using my organizing, team building, problem solving and marketing skills to meet needs of people while monitoring the impact my actions are having on humanity. ",
            "date": "Answered May 15, 2019",
            "views": "16",
            "upvotes": " Answer requested by Anthony Graham Clark",
            "upvoters": [
                {
                    "user_id": "Sarvan Kumar Shaw",
                    "user_href": "/profile/Sarvan-Kumar-Shaw"
                }
            ]
        },
        {
            "author_info": {
                "name": "K. Colin",
                "href": "/profile/K-Colin"
            },
            "answer_text": "My life’s purpose is to be alive! My answer is not meant to be curt, it truly is what I feel life’s “purpose” is! What is the purpose of the life of an infant? His or her purpose is to be alive!What is the purpose of the lives of any animals in existence? Their purpose is to be alive.We try to cram too much into our lives, and when we finally look up, it’s almost over. Be alive! Live! That is what the gift of life is for! ",
            "date": "Answered June 6, 2019",
            "views": "29",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Sallie Loftin",
                "href": "/profile/Sallie-Loftin-1"
            },
            "answer_text": "To cause consternation in the other people I meet and make a few good friends, recognize one major love, raise three wonderful kids and completely confuse people who think I should act my age. I have a sticker for this: Cleverly disguised as a responsible adult. Oh, and to care for a ridiculous number of four footed furry people ’cause there’s no one else. ",
            "date": "Answered May 11, 2019",
            "views": "13",
            "upvotes": " Answer requested by Anthony Graham Clark"
        },
        {
            "author_info": {
                "name": "Henry Martin",
                "href": "/profile/Henry-Martin-16"
            },
            "answer_text": "My life’s purpose in one paragraph? Staying alive despite all that life and mankind has thrown in my path, I spread my wisdom like seeds of tiny flowers across the vast landscape with the hope that some will take root and bring forth more seeds, like a cascading wave that, eventually, falls on fertile soil of someone who takes my words and actions to heart. ",
            "date": "Answered May 9, 2019",
            "views": "18",
            "upvotes": " Answer requested by Anthony Graham Clark"
        },
        {
            "author_info": {
                "name": "Ahmed Alishare",
                "href": "/profile/Ahmed-Alishare"
            },
            "answer_text": "My aim is to be successful, rich, powerful and a role model to Millions and Billions of people in the world. My aim is to live my life in such a way that I remain as one of the best and the greatest parts of history. I want to be the motivation to the people like me who are either waiting for their successful life or living with grief obtained by the comments of the people. Belonging to the world of billions of people is easy and boring but being being one among those billions is not so easy but it is quite adventurous and inspiring. ",
            "date": "Answered November 12, 2019",
            "views": "22",
            "upvotes": " View 1 Upvoter"
        },
        {
            "author_info": {
                "name": "Tich Ennis",
                "href": "/profile/Tich-Ennis"
            },
            "answer_text": "To change the world. It is easier to change the world than to change yourself said Nelson Mandela. Therefore my aim is to change the world first. After that, me. Although a friend said I’d have to change myself first. I’ll go with Mandela. ",
            "date": "Answered November 12, 2019",
            "views": "40",
            "upvotes": " View 1 Upvoter"
        },
        {
            "author_info": {
                "name": "Kumari Weerasooriya",
                "href": "/profile/Kumari-Weerasooriya"
            },
            "answer_text": "The purpose of my life is to live happily and make the lives of my family members as well as the other known and unknown people happy. At the same time I try my best not to harm nature and to be sensitive to animal life . ",
            "date": "Answered May 24, 2019",
            "views": "14",
            "upvotes": " Answer requested by Anthony Graham Clark"
        },
        {
            "author_info": {
                "name": "Robert Anderson",
                "href": "/profile/Robert-Anderson-952"
            },
            "answer_text": "I can sum up my life’s purpose in one word. Happiness. Everything I do is geared towards this goal. Of course, one cannot be happy ALL of the time. But “unhappy” moments makes the happy moments more precious. ",
            "date": "Answered August 8, 2019",
            "views": "12",
            "upvotes": " Answer requested by April Swanson"
        },
        {
            "author_info": {
                "name": "Sandra Maazouz",
                "href": "/profile/Sandra-Maazouz"
            },
            "answer_text": "To thank God for all the love He showed me and make Him proud and always remember how much He loves me even when i fall from my path and He wants me (not only me ofc..us, all humans) with Him more than anything,, ",
            "date": "Answered May 8, 2019",
            "views": "24",
            "upvotes": " View 1 Upvoter"
        },
        {
            "author_info": {
                "name": "Bruce Heckerman",
                "href": "/profile/Bruce-Heckerman"
            },
            "answer_text": "My wife of 30 years and I have always done volunteer work. When you give yourself over to the service of other you are doing what we are all put here for and doors open for you that otherwise would have remained closed forever. ",
            "date": "Answered May 28, 2019",
            "views": "6",
            "upvotes": " Answer requested by Anthony Graham Clark"
        },
        {
            "author_info": {
                "name": "Joe Adair",
                "href": "/profile/Joe-Adair-3"
            },
            "answer_text": "Life’s purpose for me is acknowledging that we all come from God, and will return to God after our death for judgement. In that aspect I aspire to please God, although I’m not always successful. ",
            "date": "Answered July 28, 2019",
            "views": "5",
            "upvotes": " Answer requested by April Swanson"
        },
        {
            "author_info": {
                "name": "Nemanja Rakic",
                "href": "/profile/Nemanja-Rakic"
            },
            "answer_text": "I always felt like my purpose was to fix the world and help people I am a great storyteller when i rap or write poems I might drop something soon so stay tuned ",
            "date": "Answered July 27, 2019",
            "views": "6",
            "upvotes": " Answer requested by April Swanson"
        },
        {
            "author_info": {
                "name": "Subramanian Pitchandi",
                "href": "/profile/Subramanian-Pitchandi"
            },
            "answer_text": "I want to attain MUKTHI in this birth. I also want those who are in contact with me to attain MUKTHI in this birth itself. ",
            "date": "Answered November 12, 2019",
            "views": "8",
            "upvotes": " View 1 Upvoter"
        },
        {
            "author_info": {
                "name": "Jacob Kallmann",
                "href": "/profile/Jacob-Kallmann"
            },
            "answer_text": "Simple Since life doesn’t come with a purpose, might as well give it one. Life’s beautiful, go out there and live, give it purpose, give it meaning, the worlds yours. ",
            "date": "Answered May 12, 2019",
            "views": "12",
            "upvotes": " Answer requested by Anthony Graham Clark"
        },
        {
            "author_info": {
                "name": "Nelson Rosa",
                "href": "/profile/Nelson-Rosa-8"
            },
            "answer_text": "This is life's purpose in one sentence. TO LIVE IS TO LOVE AND TO LOVE IS TO LIVE so learn to love or to live. ",
            "date": "Answered June 17, 2019",
            "views": "5",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Lawrence Bentley",
                "href": "/profile/Lawrence-Bentley"
            },
            "answer_text": "To avoid running out of money in older age & stay active + healthy as long as possible, then die strong ",
            "date": "Answered May 17, 2019",
            "views": "7",
            "upvotes": " Answer requested by Anthony Graham Clark"
        },
        {
            "author_info": {
                "name": "Gigi Kent",
                "href": "/profile/Gigi-Kent-8"
            },
            "answer_text": "None. There is no purpose per sei in life. This is just an idea some like to toy with it and that is all there is. ",
            "date": "Answered May 11, 2019",
            "views": "11",
            "upvotes": " Answer requested by Anthony Graham Clark"
        },
        {
            "author_info": {
                "name": "Philip Atkinson",
                "href": "/profile/Philip-Atkinson-16"
            },
            "answer_text": "Yes. To do my duty. ",
            "date": "Answered June 20, 2019",
            "views": "11",
            "upvotes": "0"
        }
    ]
}