{
    "title": "Can I continuously guess a number randomly? - Quora",
    "tags": [
        "Random Number Generators (RNG)",
        "Randomness (statistics)",
        "Probability (statistics)",
        "Statistics (academic discipline)"
    ],
    "response": [
        {
            "author_info": {
                "name": "Etaash Katiyar",
                "href": "/profile/Etaash-Katiyar"
            },
            "answer_text": "Many studies of the brain suggest that the brain is not capable of producing truly random numbers. For example, the participants when told to choose random numbers had a tendency towards the numbers 7 and 17. The brain has been evolved to find patterns in the world, and use information about those patterns to predict future events. Creating a complete lack of pattern probably confuses the brain, asking it to do something it cannot do, so the mind chooses random-seeming numbers, but not actually random. For example, when choosing a random number between 1 to ten, one line of reasoning could be: It can’t be 1 or 10, too high or low to be ‘random’.It can’t be 5, too precisely half of the totalIt can’t be an even number, they have too much structure in them to be random.So we’re left with 3 and 7, however 3 is too low to be random so 7 it is.Although this only applies to a single number, one could see how this could carry on into a sequence of numbers. (I already picked this number, so i can’t pick it again. However if it was truly random you could pick any number with equal chance, and not giving this specific number a lower one.) A final point, the brain is terrible at distinguishing randomness from order, since it is so intent on finding patterns, giving itself an evolutionary advantage. Whenever people see faces in random day to day objects it is simply the brain tricking people into seeing a face out of random blobs and shapes. From the following images, try to guess which one is randomly generated and which one has artificial elements.   It’s the first one. This may seem simple, but it demonstrates how hard it is for the brain to distinguish chaos and randomness. In this case and in the case o picking numbers. ",
            "date": "Answered February 10, 2017",
            "views": "665",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Varun Babbar",
                    "user_href": "/profile/Varun-Babbar-5"
                },
                {
                    "user_id": "Rohith D'souza",
                    "user_href": "/profile/Rohith-Dsouza-1"
                }
            ]
        }
    ]
}