{
    "title": "Can I improve in IQ by reading? - Quora",
    "tags": [
        "Getting Smarter",
        "Reading Recommendations",
        "IQ Testing",
        "Intelligence Quotient",
        "Understanding Self-Improvement",
        "Intelligence",
        "Reading"
    ],
    "response": [
        {
            "author_info": {
                "name": "Martin Lukac",
                "href": "/profile/Martin-Lukac-2"
            },
            "answer_text": "I realised how interesting this question is only when I heard my inner voice say: “how obvious, of course it does…” But wait. Does it really? Countless online business coaches and productivity gurus tell you that reading increases IQ, right? Look at Warren Buffet, right? He reads a lot and he is successful, so it must be true, right? Buckle up, ladies and gentleman, it is time for peer-reviewed and evidence based no bullshit science!  Imagine you asked many people about their reading habits and then measured their IQ. This is the evidence that has long been produced in research with various results. For example, Frank Smith’s famous claim \"Literacy doesn't generate finer feelings or higher values. It doesn't even make anyone smarter\" (1989, p. 354) goes very much against what we all hope to hear. Luckily, there is more research with brighter results. Stanovich (1993), for example, states “[i]f \"smarter\" means having a larger vocabulary and more world knowledge in addition to the abstract reasoning skills encompassed within the concept of intelligence, as it does in most laymen's definitions of intelligence (Stanovich, 1989; Sternberg, 1990), then reading may well make people smarter.” Let me tell you why this is a really tricky question to answer in the first place. It has to do with two main problems: causal ordering and measurement. Bear with me for a moment, I promise, there will be an answer in the end. Lets first talk about the problem of causality. What is rather tricky is the implicit causality in the question we are asking: Does reading improve IQ? So, if I read more, will I be smarter? Suppose that we repeatedly find that reading is highly correlated with IQ. Does that mean that reading will make you smarter? It might, but not necessarily… The problem here is with the statistical evidence that we use to back our claims. Correlation itself is not enough to prove causation. Suppose you would be asking a different question: Do smart people read more? and you would find, again, a strong correlation between reading frequency and IQ. Does that mean that smart people read more or that reading improves your IQ? I hope you get where I am heading. Correlation is not causation.  How can this be solved? In an absolutely ideal scenario, you would take a random sample of people and randomly split them into two groups. This is routinely done in randomised clinical trials (RCTs) that are used for drug trials and are considered the golden standard to establish causal effects.  Having split the sample into two groups, you would introduce a manipulation (treatment)—prohibit one group from reading and command the other group to read regularly. After some time, you would measure the difference between groups’ average IQs. Since people were allocated randomly into both groups, at the initial point the groups were equal in their average IQ. Both groups had the same probability to contain geniuses and idiots—people whose IQ can be improving, stagnating, or degenerating (this equality can and should be verified to be sure that the groups are as equal as possible on all the observable characteristics). The only difference between the groups is therefore your intervention (treatment)—reading or not reading—and thus you can claim that the difference in IQ was caused by reading. However, and here is the trick!, in real life, we cannot command people to read or stop reading, and even if we tried, they would possibly do as they like. Therefore we are bound to observational studies—those that do not try to change anything about people’s behaviour, but rather rely on observation to get as close as possible to the RCT setting. The causality can then be reached by using longitudinal panel data—data measuring the same people several times and see if their decision to start reading more increased their intelligence later in their life. Something like this has been done by Ritchie, Bates, and Plomin (2014), however instead of focusing on the adult population, they worked with children age 7–16. To get rid of the influence of other genetic and environmental characteristics, they worked with identical (monozygotic) twins. The idea was the following: Since these twins were raised in the same environment and had the same genetic predisposition, would early adopters in reading experience a higher boost in intelligence later in life? And they conclude, “[i]n a longitudinal analysis of cognitive development in monozygotic twins, assessed in five waves from ages 7 to 16, we found support for this hypothesis. Twins with better earlier reading ability compared to their identical cotwin tended not only to have better reading at subsequent measurements but also higher scores on general intelligence tests.” and “[w]e also found that the associations are not restricted to possible effects of reading on the verbal domain—mainly affecting vocabulary and general knowledge—but extend to associations of reading with nonverbal intelligence” (Ritchie, Bates & Plomin, 2014). The same data was later reanalysed by Bailey and Littlefield (2016) by the means of different statistical models in order to check the robustness of the conclusions. They state, “[r]eplicating the findings of RBP's previous analysis using the cross-lagged panel regression model on the same data set, we found that previous reading ability predicted later IQ consistently across development. However, we found that the model exhibited poor fit to the data. The state–trait model [the new model they have used] fit the data very well but showed less evidence for effects of individual differences in children's environmentally caused reading ability on their later intelligence.” (Bailey & Littlefield, 2016) So, yes, recent evidence suggests that reading can really improve your intelligence… at the age 7–16. Do we have reasons to believe this could be generalized to the whole population? Development of cognitive abilities of children will certainly differ from those of adults. Not only are they more open-minded to learn and try new things, but also they go through much more hands-on experience and trial-and-error. If there is ‘anything’ that kids have (i.e. open-mindedness) and we as adults don’t, this can invalidate the generalisability of these findings to the whole population. Nonetheless, there is pretty solid statistical evidence that early in your life, reading can help you improve your intelligence later on. Nonetheless, there is another problem. Any effort to measure these elusive concepts such as intelligence, smartness, etc. will necessarily be challenged by its measurement. There are millions of intelligence tests out there—which one is the right one? The one with more abstract questions about shapes, or the one with more verbal puzzles? This is why researchers very often differentiate the effect of reading on different aspects of intelligence: emotional, verbal, nonverbal… And this allows us to distinguish the most consistent effects out there. Recently published results of several experiments by Kidd and Castano investigate the effect of reading literary fiction and non-fiction on “the human capacity to comprehend that other people hold beliefs and desires and that these may differ from one's own beliefs and desires” (2013, Abstract). Some may claim that this is not intelligence per se, but what else makes us more distinct as humans than our ability of empathy, cooperation, and socialisation? The results consistently show that “reading passages of literary fiction, in comparison to nonfiction or popular fiction, does indeed enhance the reader's performance on [such] tasks.” All in all, what do we make out of it? The statistical evidence suggests that reading early in life helps immensely not only with verbal abilities and emotional intelligence, but also with abstract reasoning. Later, experimental evidence by Kidd and Castano (2013) provides evidence that reading fiction is pretty good for your emotional intelligence and empathy. If I were to make a judgment call, I would say that reading makes you smarter. Not only because of the evidence provided above, but also because you expose yourself to different perspectives and thought processes of the authors. You absorb how other people think, their heuristics, which helps you solve similar problems later in your life. These ‘skills’ might be hard to measure, but I personally find them as very possible outcomes of reading based on my personal experience. Moreover, reading requires patience and undivided attention. Practicing these skills often will spillover to other spheres of your mental achievement. No doubt, my friends, reading is good for you—be it your intelligence, outlook, or empathy. Happy reading!  Hey, if you had any more questions about methodology or science, be sure to get in touch via Quora. Feel free to check my personal website to see what I work on these days! ",
            "date": "Answered August 29, 2017",
            "views": "57",
            "upvotes": " View 29 Upvoters",
            "upvoters": [
                {
                    "user_id": "Sarutobi Sama",
                    "user_href": "/profile/Sarutobi-Sama"
                },
                {
                    "user_id": "Kent Napier",
                    "user_href": "/profile/Kent-Napier-1"
                },
                {
                    "user_id": "Nick Sarafolean",
                    "user_href": "/profile/Nick-Sarafolean"
                },
                {
                    "user_id": "Jan Chrisler Venus",
                    "user_href": "/profile/Jan-Chrisler-Venus"
                },
                {
                    "user_id": "Sam",
                    "user_href": "/profile/Sam-9349"
                },
                {
                    "user_id": "David Benhamou",
                    "user_href": "/profile/David-Benhamou-6"
                },
                {
                    "user_id": "Shylesh Pujari",
                    "user_href": "/profile/Shylesh-Pujari"
                },
                {
                    "user_id": "Lol",
                    "user_href": "/profile/Lol-1513"
                },
                {
                    "user_id": "Idris Bevan",
                    "user_href": "/profile/Idris-Bevan"
                },
                {
                    "user_id": "Liam Donnelly",
                    "user_href": "/profile/Liam-Donnelly-50"
                },
                {
                    "user_id": "Sangita Subba",
                    "user_href": "/profile/Sangita-Subba-3"
                },
                {
                    "user_id": "Mike Dan",
                    "user_href": "/profile/Mike-Dan-6"
                },
                {
                    "user_id": "Kiran Kumar Badijana",
                    "user_href": "/profile/Kiran-Kumar-Badijana-1"
                },
                {
                    "user_id": "Ella German",
                    "user_href": "/profile/Ella-German-1"
                },
                {
                    "user_id": "Seth Gibson",
                    "user_href": "/profile/Seth-Gibson-10"
                },
                {
                    "user_id": "Sharad Dodiya",
                    "user_href": "/profile/Sharad-Dodiya-1"
                },
                {
                    "user_id": "Shrijoo Kanoria",
                    "user_href": "/profile/Shrijoo-Kanoria"
                },
                {
                    "user_id": "Sisirath Sadanandan",
                    "user_href": "/profile/Sisirath-Sadanandan"
                },
                {
                    "user_id": "Kimberly Palmer",
                    "user_href": "/profile/Kimberly-Palmer-27"
                },
                {
                    "user_id": "Andrei Lazar",
                    "user_href": "/profile/Andrei-Lazar-16"
                },
                {
                    "user_id": "Gavin Christopher Patterson",
                    "user_href": "/profile/Gavin-Christopher-Patterson"
                },
                {
                    "user_id": "Vishlendra Kumar",
                    "user_href": "/profile/Vishlendra-Kumar"
                },
                {
                    "user_id": "Niels Schimmel",
                    "user_href": "/profile/Niels-Schimmel"
                },
                {
                    "user_id": "Tripp Roberts",
                    "user_href": "/profile/Tripp-Roberts-2"
                },
                {
                    "user_id": "Rajyalakshmi S Venkata",
                    "user_href": "/profile/Rajyalakshmi-S-Venkata"
                },
                {
                    "user_id": "Ehizogie J. Otoigiagha",
                    "user_href": "/profile/Ehizogie-J-Otoigiagha"
                },
                {
                    "user_id": "Chia Mar",
                    "user_href": "/profile/Chia-Mar"
                },
                {
                    "user_id": "Shivani Shrivastva",
                    "user_href": "/profile/Shivani-Shrivastva"
                },
                {
                    "user_id": "Anish Shetty",
                    "user_href": "/profile/Anish-Shetty-14"
                }
            ]
        },
        {
            "author_info": {
                "name": "Sheena Hocking",
                "href": "/profile/Sheena-Hocking"
            },
            "answer_text": "IQ is usually measured using a two part test. One part is verbal, and the other part is performance related. Here is a list of what is measured on the verbal part of the test, which I have taken from IQ Test | Encyclopedia of Psychology : “Verbal scales Information: 29 questions – a measure of general knowledge.Digit Span: Subjects are given sets of digits to repeat initially forwards then backwards. This is a test of immediate auditory recall and freedom from distraction.Vocabulary: Define 35 words. A measure of expressive word knowledge. It correlates very highly with Full Scale IQArithmetic: 14 mental arithmetic brief story type problems. tests distractibility as well as numerical reasoning.Comprehension: 16 questions which focus on issues of social awareness.Similarities: A measure of concept formation. Subjects are asked to say how two seemingly dissimilar items might in fact be similar.”In my opinion well-chosen novels could improve your general knowledge. You would need to read historical fiction, technology-based science fiction, or fiction set in different locations around the globe for this to work. Reading novels could certainly increase your word knowledge, but only if you conscientiously look up those you are even slightly unsure of. No cheating and expecting the context to reveal the meaning to you. Comprehension and social awareness might also be enhanced by reading novels. In order to gain this benefit you would need to think as you read, asking yourself questions such as, “Why has this character said this? If I said this to a friend of mine, how would they react? How might a different friend react?” or “What would this character’s facial expression be like at this moment?” and so on. However, having an interest in reading in these ways is probably a marker for a high IQ in the first place, which is why these methods are used to assess it. Does it really matter? Why not just be yourself and accept that you are good enough as you are? Emotional intelligence is important too, you know. ",
            "date": "Answered May 14, 2017",
            "views": "18",
            "upvotes": " View 4 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Yena Azul",
                    "user_href": "/profile/Yena-Azul"
                },
                {
                    "user_id": "Bhupendra Narayan Sharma",
                    "user_href": "/profile/Bhupendra-Narayan-Sharma"
                },
                {
                    "user_id": "Caroline de Jager",
                    "user_href": "/profile/Caroline-de-Jager"
                },
                {
                    "user_id": "Philip Pilif",
                    "user_href": "/profile/Philip-Pilif"
                }
            ]
        },
        {
            "author_info": {
                "name": "David H Amiri",
                "href": "/profile/David-H-Amiri"
            },
            "answer_text": "IQ is perceived as natural intellegence, partially biological, genetic and a result of your early upbringing. I’m a bit above average but definitely no genius. To describe IQ, I use cars as a metaphor. Say, your friend who has rich parents, gifts him with a new Lamborghini, while all you can afford is a used Honda Civic. When pitting the two cars in a race there is no question that the Lamborghini will leave you in the dust. Here is the kicker though. Realizing that you still love your car, you take care of it by regular maintenence, oil changes, and eventually decide to customize it by adding performance parts and transforming it into a new badass rice burner. Your friend, on the other hand, does not maintain his Lamborgini, runs it into the ground, and is left with a pile of junk. It still may run, have speed , and can still beat your jacked up Honda, but it will not be as easy since your car performs better than it previously did while your friend did nothing to improve his. You can definitley improve mental ability by constantly reading, exercizing, good nutrition, and by exposing yourself to new knowledge, new experiences, and learning new skills. Having known several “geniuses” in my lifetime, I can definitely attest to the fact that IQ alone has no bearing on one’s happiness or sucess in life. I’ve come across many beaten down sports cars. ",
            "date": "Answered February 1, 2019",
            "views": "28",
            "upvotes": " View 5 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Sangita Subba",
                    "user_href": "/profile/Sangita-Subba-3"
                },
                {
                    "user_id": "Jennifer Zeugin",
                    "user_href": "/profile/Jennifer-Zeugin-1"
                },
                {
                    "user_id": "Kristof Leroux",
                    "user_href": "/profile/Kristof-Leroux"
                },
                {
                    "user_id": "Natasha Burrell",
                    "user_href": "/profile/Natasha-Burrell-4"
                },
                {
                    "user_id": "Vedant Agnihotri",
                    "user_href": "/profile/Vedant-Agnihotri-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Kris Munro",
                "href": "/profile/Kris-Munro"
            },
            "answer_text": "In a way it can increase your score on an IQ test, but it may not strictly increase your intelligence. However, reading does have a positive impact on your knowledge. Several IQ tests incorporate vocabulary components in them; not strictly your knowledge of words, but your understanding of concepts. Having a higher level of contact with more complicated words is likely to produce positive effects on how well you score on these tasks. It’s a little difficult giving examples of how this occurs without also providing insight into the testing material. But seeing as any number of people here have had an IQ test done, I’ll describe things in a way that anyone who has done the tests will be familiar with; and could describe as well. You might be asked to describe an object or concept, such as “what is a wallet?” or “what is weather?”. You may also be asked to describe how two terms are alike, and as the material gets more challenging, you may struggle to find similarities. Answering “in what ways are the beach and the desert alike?” may seems pretty straight forward, but when you start being asked questions like “in what ways are discrete and overt alike?”, most people are likely to have difficulty answering with confidence; particularly when there are multiple (correct) answers that may be necessary for full points and when the concepts appear to be opposites. This is to say that people may know the words, but may lack enough knowledge or insight to properly explain the similarities. Also, it should go without saying that I’ve made up these questions (there are correct answers, as far as my understanding goes); you wont find these in IQ tests. ",
            "date": "Answered June 17, 2017",
            "views": "3",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Brianna McAllister",
                    "user_href": "/profile/Brianna-McAllister-4"
                },
                {
                    "user_id": "Kuba Ptaszkiewicz",
                    "user_href": "/profile/Kuba-Ptaszkiewicz"
                },
                {
                    "user_id": "Courtney Schumacher",
                    "user_href": "/profile/Courtney-Schumacher-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Peter Bellis",
                "href": "/profile/Peter-Bellis"
            },
            "answer_text": "Define IQ … I have a barely above average IQ, yet most people I interact with perceive me as very intelligent. Why? Because IQ is a very restricted measure, but what people perceive as intelligence comes from a whole multitude of factors. I read … A LOT. Because of this I have a vast amount of borrowed experience … I have lived other people’s lives, I have been inside their minds. I have been exposed to a lot of different knowledge sets, I have been buffed and burnished by many different perspectives. Because of this, I SEEM to others to be a very deep thinker, I’m not really … but only my innate honesty compels me to say so … I’d actually prefer people to think me the genius I’m not. Can reading increase IQ? That’s debatable … but an average IQ person who’s well read and has actually thought about what they’ve read can out-perform a high IQ person who’s mentally lazy (and I know a few of those!) So, in the end … who cares. Reading WILL help you in life, even if it’s not by increasing your IQ. ",
            "date": "Answered January 26, 2018",
            "views": "35",
            "upvotes": " View 8 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Sefa Kuyumcu",
                    "user_href": "/profile/Sefa-Kuyumcu"
                },
                {
                    "user_id": "David Benhamou",
                    "user_href": "/profile/David-Benhamou-6"
                },
                {
                    "user_id": "Mr.Alan Morisson",
                    "user_href": "/profile/Mr-Alan-Morisson"
                },
                {
                    "user_id": "Diamonz Burnett",
                    "user_href": "/profile/Diamonz-Burnett"
                },
                {
                    "user_id": "X Warrior",
                    "user_href": "/profile/X-Warrior"
                },
                {
                    "user_id": "Himani Meshram",
                    "user_href": "/profile/Himani-Meshram"
                },
                {
                    "user_id": "Tina Kelly",
                    "user_href": "/profile/Tina-Kelly-28"
                },
                {
                    "user_id": "Jacob Glover",
                    "user_href": "/profile/Jacob-Glover-3"
                }
            ]
        },
        {
            "author_info": {
                "name": "Michelle Lin",
                "href": "/profile/Michelle-Lin-104"
            },
            "answer_text": "No it does not, however, reading can help you to gain awareness of a certain subject, to process new information being taken in, to interpret that new information, etc. Say for example, you are learning a new language. You’ve mastered talking in that language, however, you don’t know how to read it or write it. By taking baby steps in reading in that language, you increase your familiarity with the patterns in the language, the tones of the language, and increase your fluency by reading aloud. As you continue reading aloud in that foreign language, you eventually start to interpret the language faster and the meanings buried within each word or sentence that you can easily say it aloud in your mind as fluently as if you were speaking it. By reading, you also gain knowledge to whatever it is that you like to read. It doesn’t matter if the books you’ve read are fiction, sci-fi, romance, etc. you can learn anything from reading books such as how an author catches the reader’s attention to how and author creates a string of words that are considered to be best selling or an enjoyable book. ",
            "date": "Answered January 27, 2018",
            "views": "15",
            "upvotes": " Answer requested by Cathy McMullen McHenry",
            "upvoters": [
                {
                    "user_id": "Shaik Shoeb",
                    "user_href": "/profile/Shaik-Shoeb-9"
                },
                {
                    "user_id": "Mariah Karimi",
                    "user_href": "/profile/Mariah-Karimi"
                },
                {
                    "user_id": "Rajyalakshmi S Venkata",
                    "user_href": "/profile/Rajyalakshmi-S-Venkata"
                },
                {
                    "user_id": "Anish Shetty",
                    "user_href": "/profile/Anish-Shetty-14"
                },
                {
                    "user_id": "Sumanth Nagula",
                    "user_href": "/profile/Sumanth-Nagula"
                },
                {
                    "user_id": "Sowmya Ravichandran",
                    "user_href": "/profile/Sowmya-Ravichandran-2"
                },
                {
                    "user_id": "Muruga Raj",
                    "user_href": "/profile/Muruga-Raj-5"
                }
            ]
        },
        {
            "author_info": {
                "name": "Muhammad Tayyab",
                "href": "/profile/Muhammad-Tayyab-76"
            },
            "answer_text": "Intelligence quotient (IQ) is a measure of your analytical, critical and problem solving skills. Intelligence simply defined is your ability to adopt to new things/environment. The faster you do the intelligent you are. If you are asking that if reading books will able to you score higher on a IQ scale then it is highly unlikely, it is like asking if eating bananas will make you taller. Bananas are good for health but they, in no possible way make you taller or shorter. Similarly book reading is good for you as it will improve your knowledge and understanding of things but it won't raise your IQ. IQ is genetic, it is pre determined. A huge circle of experts believe that intelligence is too diverse to be calculated by tests and given a specific number. Stop worrying about IQ and just remember reading will make you better in every possible way, just bank on that. ",
            "date": "Updated August 30, 2017",
            "views": "12",
            "upvotes": " View 7 Upvoters",
            "upvoters": [
                {
                    "user_id": "Sefa Kuyumcu",
                    "user_href": "/profile/Sefa-Kuyumcu"
                },
                {
                    "user_id": "David Benhamou",
                    "user_href": "/profile/David-Benhamou-6"
                },
                {
                    "user_id": "Guilherme Xavier",
                    "user_href": "/profile/Guilherme-Xavier-10"
                },
                {
                    "user_id": "Kuba Ptaszkiewicz",
                    "user_href": "/profile/Kuba-Ptaszkiewicz"
                },
                {
                    "user_id": "Fariel Malfurion",
                    "user_href": "/profile/Fariel-Malfurion"
                },
                {
                    "user_id": "AUSTIN CORONADO",
                    "user_href": "/profile/AUSTIN-CORONADO"
                },
                {
                    "user_id": "Prajwal Sagar",
                    "user_href": "/profile/Prajwal-Sagar-5"
                },
                {
                    "user_id": "Santosh Devkota",
                    "user_href": "/profile/Santosh-Devkota-4"
                },
                {
                    "user_id": "Fábio Nascimento",
                    "user_href": "/profile/Fábio-Nascimento-2"
                },
                {
                    "user_id": "David Frigault",
                    "user_href": "/profile/David-Frigault"
                }
            ]
        },
        {
            "author_info": {
                "name": "Jeroen de Bruijn",
                "href": "/profile/Jeroen-de-Bruijn-3"
            },
            "answer_text": "No, it does not increase IQ, but it does help. Wait, what? What kind of paradoxic nonsence am I writing? Well not nonsence, and not even paradoxic. See IQ is a measurement of how you apply knowledge. Without any knowledge your IQ would be near zero. Reading can, of course help gaining knowledge. If you can apply this knowledge to solve puzzles, issues, problems, then, it could help your IQ score. For example An IQ test could have the question of writing down the next number in sequence. 1, 4, 9, 16,… This is of course simply the quadrate of the numbers 1 to 4, so the next should be 5^2=25. However, therefor you need to have the knowledge of quadratic numbers actually being a thing, or you will never hbe able to solve the question. Reading about quadratic numbers will gain that knowledge to be able to solve the question. IQ rather is knowing with the above example you could also solve 168, 195, 224, 255, … With the number 288. ",
            "date": "Updated December 28, 2018",
            "views": "92",
            "upvotes": " View 10 Upvoters ",
            "upvoters": [
                {
                    "user_id": "David Joyce",
                    "user_href": "/profile/David-Joyce-11"
                },
                {
                    "user_id": "Zyeni Teloma",
                    "user_href": "/profile/Zyeni-Teloma"
                },
                {
                    "user_id": "Siddhartha.ch",
                    "user_href": "/profile/Siddhartha-ch-5"
                },
                {
                    "user_id": "Chetna Vats",
                    "user_href": "/profile/Chetna-Vats"
                },
                {
                    "user_id": "Mike Cerchia",
                    "user_href": "/profile/Mike-Cerchia"
                },
                {
                    "user_id": "Raja Reddy Kunduru",
                    "user_href": "/profile/Raja-Reddy-Kunduru"
                },
                {
                    "user_id": "Srdjan Kesic",
                    "user_href": "/profile/Srdjan-Kesic"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/Vik-Jha-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Ryan Reich",
                "href": "/profile/Ryan-Reich-1"
            },
            "answer_text": "Although I deplore these IQ questions, I have to say yes to this one. The reason is that IQ is, by definition, your score on an IQ test, and these tests often (though not always) contain questions involving language. By practicing your understanding of language, you thereby increase your IQ. Of course, the best way to increase your IQ is to take a lot of IQ tests; any successful student knows that test prep makes a big difference on standardized tests, because it displaces the challenge of the test from figuring out the questions to figuring out their answers. If you’re asking this because you’re wondering whether you should read more, let me propose that if the only benefit you derive from reading is being able to fill in sentences and make word analogies on a test, then you are doing it wrong. Reading increases your expressiveness, it stimulates your imagination, it encourages you to explore intangible ideas about people and times and societies, it gives you the opportunity to challenge implicit assertions and assumptions both in yourself and in the text. Find me an IQ test that can put a score on those things. ",
            "date": "Answered June 17, 2017",
            "views": "23",
            "upvotes": " View 8 Upvoters",
            "upvoters": [
                {
                    "user_id": "Rom Rs",
                    "user_href": "/profile/Rom-Rs"
                },
                {
                    "user_id": "Keshav Tripathi",
                    "user_href": "/profile/Keshav-Tripathi-22"
                },
                {
                    "user_id": "David Imrik",
                    "user_href": "/profile/David-Imrik"
                },
                {
                    "user_id": "X Warrior",
                    "user_href": "/profile/X-Warrior"
                },
                {
                    "user_id": "Claudia Fiore",
                    "user_href": "/profile/Claudia-Fiore"
                },
                {
                    "user_id": "Shaupik Mullani",
                    "user_href": "/profile/Shaupik-Mullani"
                }
            ]
        },
        {
            "author_info": {
                "name": "John Gerard",
                "href": "/profile/John-Gerard-7"
            },
            "answer_text": "IQ is arbitrary it can only get worse if you come under stress or have a run in with drugs malnutrition or a disease . Reading does however have lots of value to give you . It can improve comprehension even if you read fiction and if you read nonfiction it increases your knowledge. This is my favourite lesson about intelligence and I will share it again . It is not the size of the dog but the paddock it has to roam free in. This is why IQ is so shit when it comes to predicting success. Comprehension effort and strategy are far more important. Add a really big general knowledge and you can be an unstoppable force. So keep reading and forget about IQ. ",
            "date": "Answered November 11, 2017",
            "views": "770",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Tony Reno",
                "href": "/profile/Tony-Reno-1"
            },
            "answer_text": "Thanks for the A2A. I think it depends on what you read. I read lots of problem solving books growing up, as well as test-your-IQ type of books, and I found most IQ tests trivial as a result. A lot of people answering say it doesn’t, but I wonder what types of books the read. Me, I read lots of books about thinking itself, and I believe those definitely improved my ability to think. I also, when reading self-test and brain-teaser books, pushed myself to be able to do them. So when I finally sat down to take IQ tests I found it easy to put my brain in test-taking mode and on overdrive, and I’m sure this made my IQ score much higher than it would have been had I not done the reading. ",
            "date": "Answered January 27, 2018",
            "views": "14",
            "upvotes": " View 6 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Isaac Selberg",
                    "user_href": "/profile/Isaac-Selberg"
                },
                {
                    "user_id": "Ayush Wardhan",
                    "user_href": "/profile/Ayush-Wardhan"
                }
            ]
        },
        {
            "author_info": {
                "name": "Mikael Rusin",
                "href": "/profile/Mikael-Rusin"
            },
            "answer_text": "I think this one carries a very interesting Dynamic to it. Because, on one hand, reading improves the cognitive processing by activating your brain and keeping it “fresh”, but overdoing it, can cause laziness in terms of thinking patterns. It completely depends on, how you do with the reading. I mean, we have to consider, do we convolute the information, do we transform it - do we, further process it.. It’s, kind of a hard thing to really accentuate in terms of, “Does it strictly increase IQ”. And, besides that, just reading, is in of itself benefitial in terms of, you know, gaining knowledge. Gaining knowledge, will always be important regardless of your IQ, really. I mean, that’s, that’s the fundamental basis of doing research in some forms, you know. But it’s about: What do you read How do you use it Just, reading fiction or what not - won’t really do much, in the long run, if you do strictly that, to the point of overdoing it. But otherwise, i think it’s definitly healthy. ",
            "date": "Answered January 27, 2018",
            "views": "13",
            "upvotes": " View 2 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Natasha Burrell",
                    "user_href": "/profile/Natasha-Burrell-4"
                },
                {
                    "user_id": "Putri Salsabila",
                    "user_href": "/profile/Putri-Salsabila-1"
                },
                {
                    "user_id": "Isaac Selberg",
                    "user_href": "/profile/Isaac-Selberg"
                },
                {
                    "user_id": "Ana Pereira",
                    "user_href": "/profile/Ana-Pereira-148"
                },
                {
                    "user_id": "Ge Ya",
                    "user_href": "/profile/Ge-Ya-20"
                },
                {
                    "user_id": "Greg Burns",
                    "user_href": "/profile/Greg-Burns-5"
                }
            ]
        },
        {
            "author_info": {
                "name": "Richard P. Morrall",
                "href": "/profile/Richard-P-Morrall"
            },
            "answer_text": "Reading a book on how to increase your score on an I.Q. test will. So will reading my answer on how to increase your score on an I.Q. test, and my advice is free. I will post the link to my answer in an edit when I figure out how to find it. I found this. How to improve the score on an IQ test. (The score, not your brain.) The IQ test is a test like any other test, so as with any other test, you can study it before you take it and your score will go up. By sixty point? Could be. Number one. Find a Stanford–Binet IQ test on line. Look at it. See the kinds of questions it asks. Number two. Find a study guide to those kinds of questions. Study it! Number three. Talk to a teacher about how tests are constructed and how to best approach them to maximize your score OR Find articles on line about how tests are constructed and how to best approach them to maximize your score. Study them. Number four. Take the test. Get your score. Get a copy of what your got right and what you got wrong. Study those things you got wrong. Number five. Take the test again. ",
            "date": "Answered January 27, 2018",
            "views": "23",
            "upvotes": " View 6 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Peter Terranova",
                    "user_href": "/profile/Peter-Terranova-2"
                }
            ]
        },
        {
            "author_info": {
                "name": "Mike Thakar",
                "href": "/profile/Mike-Thakar"
            },
            "answer_text": "It depends on the amount of reading. If one is already a prolific reader, then the test subject is already applying obtained/learned knowledge to abilities. If one does not read (obtain learned knowledge) and decides to become a prolific reader, then, yes, IQ would go up. Here is the thing — each person is born with innate abilities. You see it all the time in sports where you can witness this happen physically. Those who add to their innate abilities physical strength training, muscle memory, and practice to perfect. Tiger Woods, for example, showed abilities as a 2 year-old. But, it was his years of practice and training that turned him into one of golf’s finest athletes. With intelligence, each of us has whatever our genes provided as innate abilities of intelligence. But, without obtaining learned knowledge — observing as a baby/toddler, education and devotion to learning — provides data for your innate abilities to process. The more data available, the more intelligent. So, when can intelligence increase? When the test subject is able to increase data faster than their age reduces their expected increase of data (that is, just living day-to-day you learn new things). Since IQ is mental ability divided by physical age, you have to keep up with age. For example, a 20 year-old will have to achieve twice the mental result as a 10 year-old — 20 year-old = IQ100 = mental score 2000 / 20 = IQ10010 year-old = IQ100 = mental score 1000/ 10 = IQ100",
            "date": "Answered January 27, 2018",
            "views": "21",
            "upvotes": " Answer requested by Cathy McMullen McHenry",
            "upvoters": [
                {
                    "user_id": "Vivek Singh",
                    "user_href": "/profile/Vivek-Singh-3153"
                },
                {
                    "user_id": "Vasudha Pandey",
                    "user_href": "/profile/Vasudha-Pandey-6"
                },
                {
                    "user_id": "Dipannita Bhaumik",
                    "user_href": "/profile/Dipannita-Bhaumik"
                },
                {
                    "user_id": "Amlesh Yadav",
                    "user_href": "/profile/Amlesh-Yadav"
                },
                {
                    "user_id": "Hiranya Gupta",
                    "user_href": "/profile/Hiranya-Gupta"
                }
            ]
        },
        {
            "author_info": {
                "name": "Caroline Badel",
                "href": "/profile/Caroline-Badel-1"
            },
            "answer_text": "Having just undertaken 3.5 hours of the WAIS IV, I can say that reading will not increase your IQ. But in the knowledge subtest, it would help to know historical figures and some basic science facts. However, you don’t know which historical figures they will ask you about or what scientific questions. You would need to read relatively prolifically and then retain those details, and all on the off chance that you get your IQ tested. The knowledge subtest doesn’t necessarily test your general knowledge but your long term memory - ie your ability to recall information. So read all you want, but if you can’t retain information and recall that information at a later date, no amount of reading will make a difference. ",
            "date": "Answered January 26, 2018",
            "views": "2",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Lisa Dominick",
                    "user_href": "/profile/Lisa-Dominick-2"
                },
                {
                    "user_id": "Jeffrey Woo",
                    "user_href": "/profile/Jeffrey-Woo-9"
                },
                {
                    "user_id": "Jon Ron",
                    "user_href": "/profile/Jon-Ron-8"
                },
                {
                    "user_id": "Srdjan Kesic",
                    "user_href": "/profile/Srdjan-Kesic"
                },
                {
                    "user_id": "Chima Onyemaobi",
                    "user_href": "/profile/Chima-Onyemaobi"
                },
                {
                    "user_id": "Ashwini Prasad Kalapala",
                    "user_href": "/profile/Ashwini-Prasad-Kalapala"
                }
            ]
        },
        {
            "author_info": {
                "name": "Shivangi Bhaumik",
                "href": "/profile/Shivangi-Bhaumik"
            },
            "answer_text": "Definitely ! It does not only improve our iq Reading helps with your attention span and attention to detail. It increases your vocabulary and your understanding of the words that you read. Reading can help you, visually, read emotions better by allowing you to better understand the emotions when reading a character’s reaction IQ… it’ll definitely raise your knowledge. You will know more things as long as you can absorb and retain the information you read. IQs are tricky thing. They’re a little more subjective. The way they calculate it is they take the mental age divided by the chronological age. I don’t think that there’s a single finite way to measure your intelligence. Your ability to retain knowledge, your willingness to learn, the quality of your own short term & long term memory. There are so many things that go into your intelligence that an IQ test doesn’t fully account for. Expand your knowledge base, expand your world view and don’t worry about your IQ because ultimately it doesn’t matter. Thanks ",
            "date": "Answered August 29, 2017",
            "views": "663",
            "upvotes": " View 5 Upvoters",
            "upvoters": [
                {
                    "user_id": "Rich Von Behren",
                    "user_href": "/profile/Rich-Von-Behren"
                }
            ]
        },
        {
            "author_info": {
                "name": "Samuel O. Alfred",
                "href": "/profile/Samuel-O-Alfred"
            },
            "answer_text": " Maybe. Reading is quite useful as it enhances your ability to comprehend and pay attention to detail. Reading books will expand your imaginative ability. You will become more vast and knowledgeable .Reading would only slightly improve your IQ as many IQ tests are not only on verbal reasoning or ability . A high IQ score doesn’t however mean one is intelligent. I personally don’t think there is a single definite way to test or measure one’s intelligence. Reading will surely improve your crystallized and fluid intelligence. ",
            "date": "Updated June 26, 2017",
            "views": "1",
            "upvotes": " View 6 Upvoters",
            "upvoters": [
                {
                    "user_id": "David Andrews",
                    "user_href": "/profile/David-Andrews-27"
                }
            ]
        },
        {
            "author_info": {
                "name": "Ronald J Brown",
                "href": "/profile/Ronald-J-Brown-1"
            },
            "answer_text": "No. Asking such a question suggests that you do not understand what IQ is. It is a measurement of a latent ability. Specifically, the test on which the number is based measures some problem solving skills and pattern recognition. That is not to say that reading cannot make you more intelligent—in the sense that it can increase your knowledge and possibly other desirable attributes like empathy and compassion. ",
            "date": "Answered January 26, 2018",
            "views": "587",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Albert van Leeuwen",
                    "user_href": "/profile/Albert-van-Leeuwen"
                },
                {
                    "user_id": "Elisabeth Ritter",
                    "user_href": "/profile/Elisabeth-Ritter"
                },
                {
                    "user_id": "Nik Bajrami",
                    "user_href": "/profile/Nik-Bajrami"
                },
                {
                    "user_id": "Raymond van Over",
                    "user_href": "/profile/Raymond-van-Over"
                },
                {
                    "user_id": "Moinudeen Umar",
                    "user_href": "/profile/Moinudeen-Umar"
                },
                {
                    "user_id": "Sandra Costa Crea",
                    "user_href": "/profile/Sandra-Costa-Crea"
                },
                {
                    "user_id": "Ludvig Pålsson",
                    "user_href": "/profile/Ludvig-Pålsson"
                },
                {
                    "user_id": "Lars Ap Drw",
                    "user_href": "/profile/Lars-Ap-Drw"
                }
            ]
        },
        {
            "author_info": {
                "name": "Achilles Light",
                "href": "/profile/Achilles-Light"
            },
            "answer_text": "First off,I know that you may or may not be tired about this, but general knowledge points out that IQ doesn’t particularly matter. Second, your IQcan fluctuate from day to day. Third yes, you can increase your word IQ by reading. If you read twenty minutes a day every day, by the end of the year, you will most likely be in the 90 percentile for word IQ. IQ measures reasoning and overall intelligence. Thank you for your interest. ",
            "date": "Answered March 2, 2020",
            "views": "109",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Aaron Meredith",
                "href": "/profile/Aaron-Meredith-9"
            },
            "answer_text": "It depends on what you read, and how well you retain it. Also, IQ measures comprehension and vocabulary so reading will help you there. But, there is also a math component that deals more with how you percieve amounts than actually crunching numbers and equations. It also measures short term memory and your perception of time in general. So, of you read things pertaining to those areas then, yes it will help. ",
            "date": "Answered November 11, 2017",
            "views": "988",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Sanket Shirke",
                    "user_href": "/profile/Sanket-Shirke-10"
                }
            ]
        },
        {
            "author_info": {
                "name": "Manjula Saxena",
                "href": "/profile/Manjula-Saxena-1"
            },
            "answer_text": "Yes . Reading is a metaskill that helps in overall personality development. IQ is a sum of intellect , perception, observation, logical thinking and cognitive skills all of which improve by reading. ",
            "date": "Updated August 30, 2017",
            "views": "402",
            "upvotes": " View 8 Upvoters",
            "upvoters": [
                {
                    "user_id": "Rita Goethals",
                    "user_href": "/profile/Rita-Goethals"
                },
                {
                    "user_id": "Randi Welter",
                    "user_href": "/profile/Randi-Welter"
                },
                {
                    "user_id": "Felipe Alves",
                    "user_href": "/profile/Felipe-Alves-31"
                },
                {
                    "user_id": "Sara Birch",
                    "user_href": "/profile/Sara-Birch-5"
                }
            ]
        },
        {
            "author_info": {
                "name": "Samuel Weber",
                "href": "/profile/Samuel-Weber-3"
            },
            "answer_text": "Reading alone no. Increasing language and reading comprehension skills can help you score better on the test. Some questions hinge on a single word. IQ tests in general Don't actually measure Intelligence. It measures how well you understand the subjects asked about in the test. A large part of Intelligence is genetics but also the curiosity to ask questions and the determination to seek the answers. I have a rather high IQ but I struggle with higher level algerbra. Calculus and quadratic equations I haven't even looked at in over a decade. But I score well in other areas like reading comprehension philosophy, history, and Science. ",
            "date": "Answered January 30, 2018",
            "views": "640",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Gaurav Datt",
                "href": "/profile/Gaurav-Datt-1"
            },
            "answer_text": "yes it does it 1)improve imagination power 2)improve your concept about your (life /IQ) 3) develops logical reasoning actually i am not a good reader but when i met my friend somesh his ( IQ and logical reasoning is more than the other while he studies less than other so when i went his home he has a great book shelf which contains 90% of the novels and according to my point of view it is a better method to improve your IQ but i will not say that you only read novel ,you should also read news paper because it updates your IQ and GK as well ",
            "date": "Answered March 18, 2017",
            "views": "350",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Kim Boze",
                    "user_href": "/profile/Kim-Boze"
                },
                {
                    "user_id": "Parvathy Sreenivasan",
                    "user_href": "/profile/Parvathy-Sreenivasan-1"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/Gv-Soumya"
                },
                {
                    "user_id": "Joy Nicolas",
                    "user_href": "/profile/Joy-Nicolas-4"
                }
            ]
        },
        {
            "author_info": {
                "name": "Sreenivas Sumadithya",
                "href": "/profile/Sreenivas-Sumadithya"
            },
            "answer_text": "Reading a story is similar to watching some movie in TV(Because its a passive act). If the book is interactive i.e., demanding us to think rather just go with the flow of the story,it would definitely be a good help in part of cultivating your brain to better thinking.But if it’s just a book in which author does all the thinking and the readers would just gain knowledge on vocabulary,authors ideas and may gain inspiration to write a book by the beauty. so I think it’s better to read a interactive book which cultivates our thinking and improves our IQ ",
            "date": "Answered April 21, 2017",
            "views": "251",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Adelbert Byttebier",
                "href": "/profile/Adelbert-Byttebier"
            },
            "answer_text": "No, it won’t. But it will make you a far more interesting person. It will raise the level of your general knowledge. It will make you a more cultured person. It will train your brain and will postpone Alzheimer. It will train your phantasy. It will give you thousands of great moments and a very cheap unharmful way of passing time. You will never have a dull moment again in life. So with the same IQ you will be able to do much more than someone who doesn’t read. ",
            "date": "Answered December 26, 2016",
            "views": "429",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Courtney Schumacher",
                    "user_href": "/profile/Courtney-Schumacher-1"
                },
                {
                    "user_id": "Chima Onyemaobi",
                    "user_href": "/profile/Chima-Onyemaobi"
                }
            ]
        },
        {
            "author_info": {
                "name": "Blessy Biju",
                "href": "/profile/Blessy-Biju-2"
            },
            "answer_text": "According to me,reading any book (PS:Something meaningful) can surely improve your IQ levels.Seriously,if you love reading then you must have an above average intelligence.Don’t read the same kind of novels all the time.Change the theme after you finish one novel.For me,it can increase our vocabulary and caliber in a language.So just read.. HAPPY READING… ",
            "date": "Answered March 20, 2017",
            "views": "434",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Rich Von Behren",
                    "user_href": "/profile/Rich-Von-Behren"
                }
            ]
        },
        {
            "author_info": {
                "name": "Liz Froment",
                "href": "/profile/Liz-Froment"
            },
            "answer_text": "I have no idea, but I do know that reading can increase your knowledge, your empathy, and the way you think about things. Over time all this stuff matters. The most successful people I know (in both life and business) are big readers. ",
            "date": "Answered June 17, 2017",
            "views": "241",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Ethan L. Rose",
                    "user_href": "/profile/Ethan-L-Rose"
                },
                {
                    "user_id": "Bhavya Makhania",
                    "user_href": "/profile/Bhavya-Makhania"
                },
                {
                    "user_id": "Rohit Yadav",
                    "user_href": "/profile/Rohit-Yadav-82"
                }
            ]
        },
        {
            "author_info": {
                "name": "Philip Marks",
                "href": "/profile/Philip-Marks-1"
            },
            "answer_text": "IN theory intelligence is a fixed characteristic of your brain. And indeed reading in general does a lot of great things but IQ scores stay about the same no matter what you do. What reading does is increase your education and knowledge and ability to do things. It will let you use your IQ better. ",
            "date": "Updated July 20, 2019",
            "views": "386",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Bakir Hajdarevic",
                    "user_href": "/profile/Bakir-Hajdarevic"
                }
            ]
        },
        {
            "author_info": {
                "name": "Gordon Miller",
                "href": "/profile/Gordon-Miller-21"
            },
            "answer_text": "No. ",
            "date": "Answered May 7, 2017",
            "views": "174",
            "upvotes": " View 3 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Jose Romero",
                    "user_href": "/profile/Jose-Romero-483"
                },
                {
                    "user_id": "T. Fronas",
                    "user_href": "/profile/T-Fronas"
                }
            ]
        },
        {
            "author_info": {
                "name": "Prachi Mishra",
                "href": "/profile/Prachi-Mishra-105"
            },
            "answer_text": "If you read Fictional Novels then there are less chances that it will improve your IQ level but If you read motivational novels or autobiographies, they play more important role in enhancing your intelligence quotient but all kinds of novels definitely increase your vocabulary. ",
            "date": "Answered February 9, 2017",
            "views": "263",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Marco Emilio Giovanni Maltese",
                "href": "/profile/Marco-Emilio-Giovanni-Maltese"
            },
            "answer_text": "Yes, but it greatly depends on WHAT you read. Love story romances won’t raise your grey matter power by a single bit. Scientific publications and engeneering stuff will push your brain to work. ",
            "date": "Answered December 26, 2016",
            "views": "624",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Lissa Jhone",
                    "user_href": "/profile/Lissa-Jhone"
                }
            ]
        },
        {
            "author_info": {
                "name": "Claire Silverman",
                "href": "/profile/Claire-Silverman-1"
            },
            "answer_text": "No, it doesn’t improve IQ but it does increase knowledge, vocabulary, verbal skills, and general awareness. ",
            "date": "Answered November 2, 2019",
            "views": "77",
            "upvotes": " View 2 Upvoters"
        },
        {
            "author_info": {
                "name": "Courtney Schumacher",
                "href": "/profile/Courtney-Schumacher-1"
            },
            "answer_text": "While it might increase your immediate score on an IQ test slightly, it will not increase your intelligence, which is set for life before you’re two, by both genes and experience. I had had good experience. By the time you can read, you cannot change your intelligence. You can only change your knowledge and improve your imagination, which Einstein said was more important than knowledge. He was right. ",
            "date": "Answered July 14, 2017",
            "views": "230",
            "upvotes": " Answer requested by Jon Ron"
        },
        {
            "author_info": {
                "name": "Kara Spaulding",
                "href": "/profile/Kara-Spaulding-1"
            },
            "answer_text": "If you’re reading , you’re using your brain much more than you think! Check out this web article, it sums it all up. Reading Fiction Improves Brain Connectivity and Function ",
            "date": "Answered January 9, 2018",
            "views": "469",
            "upvotes": " View 1 Upvoter"
        },
        {
            "author_info": {
                "name": "Raymond Lockey",
                "href": "/profile/Raymond-Lockey"
            },
            "answer_text": "Reading is always great but focus on expanding your range of interests as well as going deeper into subjects.  The more your brain has in data, the better it can sort through it all to make connections and give insight. ",
            "date": "Answered April 29, 2016",
            "views": "305",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Alan Mcintire",
                "href": "/profile/Alan-Mcintire-1"
            },
            "answer_text": "I think it does. Some might argue that IQ is completely genetic, and reading won’t change that. I prefer to think of intelligence as analogous to physical ability, say running a 10 kilometer race. You may have the genetic POTENTIAL to run a 10 K in 45 minutes or less, but if you sit around drinking beer and watching TV, you’re never going to reach your genetic potential. Likewise, reading helps you reach your genetic potential. ",
            "date": "Answered July 19, 2019",
            "views": "105",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Jerry Hicks",
                "href": "/profile/Jerry-Hicks-15"
            },
            "answer_text": "No it does not. It can increase imagination and it can increase your knowledge of the scope of word use. It might increase the score you get on some tests that are standardized to IQ tests, because all tests using words are culturally biased, so the better you know your language, the higher the score, The primary component of a high score is speed. The people who finish all the questions in the time given get the highest scores, if they haven’t guessed at the answers. ",
            "date": "Answered January 29, 2018",
            "views": "795",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Sherry Courington",
                "href": "/profile/Sherry-Courington"
            },
            "answer_text": "It will increase your knowledge. Same result. People with higher IQs purportedly do it quicker. And in the nude. Mme Sherry ",
            "date": "Answered June 19, 2017",
            "views": "134",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Curt Weinstein",
                "href": "/profile/Curt-Weinstein"
            },
            "answer_text": "Comic books, no. Encyclopedia, maybe. In general, reading helps raise the measured IQ. ",
            "date": "Answered March 19, 2017",
            "views": "68",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Tom Bushmaker",
                "href": "/profile/Tom-Bushmaker"
            },
            "answer_text": "NO. Reading increases awareness. ",
            "date": "Answered November 11, 2017",
            "views": "50",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Sam Euphoria McNaire",
                "href": "/profile/Sam-Euphoria-McNaire"
            },
            "answer_text": "yes ",
            "date": "Answered February 15, 2020",
            "views": "15",
            "upvotes": "0"
        }
    ]
}