{
    "title": "Can you publish a book without a copyright? - Quora",
    "tags": [
        "Copyright",
        "Self-Publishing",
        "Intellectual Property Law",
        "Book Publishing",
        "Copyright Infringement",
        "Copyright Law",
        "Publishing"
    ],
    "response": [
        {
            "author_info": {
                "name": "Jerry Lewis",
                "href": "/profile/Jerry-Lewis-10"
            },
            "answer_text": "If you mean ‘can I publish a book that is not copyrighted’ as in does not have copyright protection, the answer is yes, but you have to take some steps. If you mean ‘without a copyright notice,’ the answer is also yes, but any published material automatically attains copyrighted status, so even without a notice it will still be copyrighted. If your intention is to make it copyright-free and give up your copyright, there are different ways to go about it. You could just put a declaration in the book that you are putting it in public domain (PD). I’m not sure if that is legally binding, however if someone copied something and you tried to prosecute them, it would probably be a good defense. Or you could use Creative Commons (CC), which is a legally constructed way to control your copyright. CC actually also has a PD tool. Or you can construct a license which retains some rights from the least restrictive of ‘attribution’ where users have to acknowledge you only and can use the work in any way they choose, to non-commercial (NC), no derivatives (ND) i.e. it can’t be modified, and also must have attribution., ",
            "date": "Answered June 1, 2020",
            "views": "395",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Greg Moore",
                    "user_href": "/profile/Greg-Moore-45"
                }
            ]
        },
        {
            "author_info": {
                "name": "Earl Dingman",
                "href": "/profile/Earl-Dingman-1"
            },
            "answer_text": "Once a book (manuscript) is created it’s automatically in copyright. If you don’t post a notice that doesn’t lose your copyrights, it just makes it harder to secure rights or get damages. Same if you don’t follow the laws of your nation. That makes it hard or impossible to get damage money. But the moment you fix a work that can be seen or heard it is automatically in copyright in 150 nations. Now, if you’re talking about publishing a book from Public Domain sources, like 20,000 leagues Under the Sea, yes you can PROVIDED you do the typesetting. You can’t just scan a major publisher’s reprint. I suppose you can import a Gutenberg TEXT file and then create a font for the chapter titles, book title, put it into Garamond or Times New Roman, maybe make the first letter of the new chapter larger or ornate and you can publish that and even apply for a copyright on your graphics if they are original. ",
            "date": "Answered August 23, 2020",
            "views": "373",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Hulman Siagian",
                    "user_href": "/profile/Hulman-Siagian"
                }
            ]
        },
        {
            "author_info": {
                "name": "John Archambault",
                "href": "/profile/John-Archambault-3"
            },
            "answer_text": "FOr $45 or whatever it is these days, it is worth registering with the federal Office of Copyright. It is really a stupid answer to tell you that you automatically have copyright. Technically, you do — but you don’t have a lot of protection. You can neither get into federal court, nor make a claim based on 17 USC 101 et seq., without registering — not to mention there is likely to be an issue of proving WHEN you created the material. Whether you can afford to mount a federal suit, even if you do register, is another story. JA - M.S., Juris Doctor, LL.M. Intellectual Property No legal advice is intended. ",
            "date": "Answered June 1, 2020",
            "views": "267",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "C. T. Winter",
                    "user_href": "/profile/C-T-Winter"
                },
                {
                    "user_id": "Brandon O'Mary",
                    "user_href": "/profile/Brandon-OMary"
                },
                {
                    "user_id": "Taryn Irwin",
                    "user_href": "/profile/Taryn-Irwin"
                },
                {
                    "user_id": "Vinicio Hernandez",
                    "user_href": "/profile/Vinicio-Hernandez-5"
                }
            ]
        },
        {
            "author_info": {
                "name": "Todd Gardiner",
                "href": "/profile/Todd-Gardiner"
            },
            "answer_text": "Copyright is automatically created these days. The moment you finish writing a book, you have a copyright on that book. So it isn’t possible to publish a book without a copyright. Now registering your copyright for the extra benefits that gives, sure. That is not a required step. But its so cheap and easy and the benefits are so valuable, I don’t see why a publisher wouldn’t if they are going to spend the money print your book. ",
            "date": "Answered June 1, 2020",
            "views": "244",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Mark Shulmann",
                    "user_href": "/profile/Mark-Shulmann"
                },
                {
                    "user_id": "Maria Arnt",
                    "user_href": "/profile/Maria-Arnt"
                },
                {
                    "user_id": "Ray Beebe",
                    "user_href": "/profile/Ray-Beebe"
                },
                {
                    "user_id": "Dominik Kacprzak",
                    "user_href": "/profile/Dominik-Kacprzak"
                }
            ]
        },
        {
            "author_info": {
                "name": "Lawrence Watt-Evans",
                "href": "/profile/Lawrence-Watt-Evans"
            },
            "answer_text": "Well, technically, of course you can — publish a facsimile edition of the first edition of Wuthering Heights, and you have published a book without a copyright. However, I assume you meant a new book, and that’s much more difficult. I don’t think it can be done in most countries. You can, however, issue a non-exclusive grant of all rights to anyone who wants them, which has pretty much the same effect as not having a copyright at all. ",
            "date": "Answered June 1, 2020",
            "views": "289",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Shelley Roberts",
                    "user_href": "/profile/Shelley-Roberts-3"
                },
                {
                    "user_id": "Barnaby Page",
                    "user_href": "/profile/Barnaby-Page"
                },
                {
                    "user_id": "Mercedes R. Lackey",
                    "user_href": "/profile/Mercedes-R-Lackey"
                }
            ]
        },
        {
            "author_info": {
                "name": "Rachel Caine",
                "href": "/profile/Rachel-Caine-3"
            },
            "answer_text": "When you write the book, you own the intellectual property rights covered by copyright. You’re talking about registering the copyright. There’s no reason not to do it, and it will help you defend your rights in court later if you need to do that. If you’re talking about from the publisher’s standpoint you want to publish a book but haven’t leased the rights to it, and the book is not public domain, then you’d be in trouble. Intellectual property rights reside with the creator, who leases them to the publisher. ",
            "date": "Answered June 1, 2020",
            "views": "55",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Ainissa Ramirez",
                "href": "/profile/Ainissa-Ramirez"
            },
            "answer_text": "A copyright protects your work. It tells people they cannot use it without your permission. I would suggest that you keep the copyright of what you wrote. You can certainly publish a book without it, say as a ghostwriter. But, I would suggest to secure the copyright whenever possible. ",
            "date": "Answered June 4, 2020",
            "views": "150",
            "upvotes": "0"
        }
    ]
}