{
    "title": "Can people with high IQs easily predict what others have? - Quora",
    "tags": [
        "High Level IQ",
        "Genius and Geniuses",
        "IQ Testing",
        "Intelligence Quotient",
        "Smart People",
        "Intelligence",
        "Psychology",
        "Understanding Human Behavior",
        "Psychology of Everyday Life"
    ],
    "response": [
        {
            "author_info": {
                "name": "Ken Morris",
                "href": "/profile/Ken-Morris-34"
            },
            "answer_text": "Assuming that there’s something to IQ to begin with, which I suspect there is, I seriously doubt many people, regardless of their own IQ, can easily predict the IQs of others. Perceptions of intelligence are so conflated with social class, credentials, agreement or not with opinions, etc. that I doubt most people can accurately assess the intelligence of others. In fact, whenever anyone tells me that so-and-so is smart or dumb, I first interpret that as data about the person offering the opinion rather than the so-and-so. But now that Quora has exposed me to a lot of IQ discussions, I’m starting to play around with the concept and mulling its possible application to others. Proceeding on the assumption that a one standard deviation in IQ scores is just noticeable, I periodically wonder if someone I’m dealing with is noticeably smarter or dumber than I am. Proceeding on the further assumption that a two standard deviation difference in IQ makes friendships difficult (something I read) I also periodically wonder if someone I’m dealing with is two standard deviations smarter or dumber than I am. Although I can’t test my opinions of others’ intelligence by asking them to sit for an IQ test, my sense is that I can tell when a person’s IQ is one or more standard deviations lower or higher than mine. My “method” is to pay attention to abstractions, or the lack thereof. Some of my friends, for example, will advance well-reasoned opinions about an issue without realizing that they’re confusing a subordinate point with the main point. If reasoning can be thought of as in outline form, they will miss the roman numerals in favor of focusing on a point under them. Since at least these people are reasoning (and they’re friends) I conjecture that their IQ is about one standard deviation below mine. On the flip side, sometimes I encounter people who offer a higher order abstraction than I’ve thought of. I suspect these people have an IQ a standard deviation above mine, since I can follow their reasoning but didn’t think of it myself. My guess is that those with an IQ two standard deviations or more below mine don’t offer well-reasoned opinions about even subordinate points. Instead, they advance rote platitudes, and often mix in personal feelings and anecdotes. It’s pointless for me to engage in discussions with them about more than the weather (and they’re sometimes wrong in their understanding of weather). I doubt though that I could detect it if someone has an IQ two or more standard deviations above mine. I wouldn’t know whether they’re smart or just talking gibberish. So I think I can guess a person’s IQ relative to mine within a couple standard deviations below and one standard deviation above, but outside of this range I doubt that I could. Plus, I’m only guessing and can’t test my guesses with actual IQ scores. Though once a question was posted on Quora that was said to be drawn from an advanced IQ test. I have my doubts about the origin of the question, but I found it challenging. It was one of those questions that asks what the next number in a series of numbers should be, and when I first looked at the series I couldn’t see any pattern at all. After thinking about it for a minute or two, I realized that the secret was to look at the numbers in pairs rather than in isolation. Once I did that, I was able to answer the question correctly. Although, again, I doubt that the question came from a genius IQ test, I found it a challenging question. Out of curiosity, I gave the question to two friends, one of whom I know has a higher tested IQ than I have (although you’d never guess this from his credentials or social status) and the other who strikes me as an average college student (with an IQ lower than mine). Sure enough, the person with the higher IQ quickly solved it while the average college student gave up. So I’d guess that to some extent, yes, I can ballpark another person’s IQ, but I have no idea how accurate I am. I also doubt the ability of most people to do this, especially if their own IQ is lowish. If they find abstractions difficult, how can they assess others’ facility with abstractions? Even I fog out with people a lot smarter than I am. To return therefore to the question, yes, people with high IQs can probably predict the IQs of others within a reasonable range if they’re careful. But it’s not easy and the predictions may well be wrong. ",
            "date": "Answered October 5, 2020",
            "views": "606",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Abdel Fudadin",
                    "user_href": "/profile/Abdel-Fudadin"
                },
                {
                    "user_id": "Peter Knutsen",
                    "user_href": "/profile/Peter-Knutsen-1"
                },
                {
                    "user_id": "Jake Meadows",
                    "user_href": "/profile/Jake-Meadows-9"
                }
            ]
        },
        {
            "author_info": {
                "name": "Bryce Raymond",
                "href": "/profile/Bryce-Raymond-5"
            },
            "answer_text": "You can spot a 180 IQ if you pay attention.  I once met someone who I came to find out has an IQ of 180. I was at a weeklong sales training meeting in KC. It was a fantastic opportunity with a foreign company looking to expand in the US. They offered me a high base salary, ($65k) and commission potential. There were 40 of us in the class. This guy, we can call him Alex, stood out to me immediately. The first thing I noticed was how quickly he spoke. His speech was flawless, I could have typed it with no grammatical errors. His sales presentation was effortless, convincing and charming. His physical appearance was clean cut. Clean shaven, perfect nails, and spotless clothes. When he laid out his things, he took special care to arrange them neatly. Nothing was out of place. I had to talk to him but I wanted to play a game first. You see, the year leading up to this I started to realize that not all ideas in my head originate there; rather some come from a collective consciousness. This was my first successful telepathic test. All morning I sat two rows behind this guy. I had not spoken to him yet one on one. Lunch was coming up. I concentrated on one thought, directed at him, “Come sit next to me at lunch\" over and over again. The morning flew by and suddenly it was lunchtime. There were 20 tables and 40 people, and most were sitting in groups of 2 or 3. I chose a table in the middle of the room, and waited. But Alex was no where to be seen. I thought maybe he had gone out for lunch, and my little experiment had failed. “I must be so stupid\", I thought to myself. Of course telepathy isn't real. I began to lose myself in the chicken salad, hoping to eat my disappointment away. But then he entered the room, got his food, and sat next to me. He walked past dozens of empty seats on his way. Our conversation was one I will never forget. When he sat down I told him that I had been waiting for him. I told him the whole story and he was pretty surprised. He said he felt a strong urge to talk to me but he did not recieve the actual words that I was thinking his way. We talked for an hour. He told me his Mensa score was 180. While we talked I felt my brain waves shift into a calm, focused state. It felt just like when I listen to binaural beats when I meditate. It was incredible, like I could feel his mind. Alex then decided to play a little game too. Maybe to impress me, or just to flex his mental muscles. He asked two people at an adjacent table if they believed he could read their minds. They said no. He said you wanna bet?? He proceeded to play the country, animal, color game with them. If you aren't familiar, it goes like this: Pick a number between 1–10, multiply it by 9, add them together, subtract 5, select the corresponding letter of the alphabet, (if your number was 2, the letter would be B), think of a country that starts with the letter, an animal that starts with the last letter of that country's name, and a color that starts with the last letter of the animal. He then guessed both of their countries, animals and colors correctly. Obviously theres a trick to this, and you can play the game online. I was more impressed that he kept it all straight in his head. He laughed, winked at me, and excused himself. I loved this so much. For two reasons. First, by playing this game he was joining me. Remember, this all started with mind games. Second, he did not ask me to play the game, but two other people. He gave me a chance to watch, and this little action showed respect. You see, when communicating with a high IQ individual, the real communication is read between the lines. If you aren't on the same level, it would go right over your head. They play games to test you. They have little quirky facts on a wide variety of subjects. Where do I stand compared to him? I don't know. I had the impression that he was more intelligent. But then again I was the one who noticed him, and started playing games with him first. He is about 25 years older than me. We talk from time to time over the phone. I have never taken an IQ test, but one day I will. I am waiting until I reach my full potential. IQ tests mainly test your pattern recognition ability. The subconscious mind is incredible at this, but the conscious mind is not. I believe IQ tests simply examine the strength of the connection between the conscious and subconscious mind. Therefore you can become smarter over time through strengthening your presence of mind. I have quite an amazing, recurring dream where I am talking to a therapist, who is an older version of myself. These dreams are always incredibly insightful and I ask questions from my waking life. This is my favorite way to sync up with my subconscious mind. Thanks for reading my story. Please upvote if you would like me to keep writing for you. ",
            "date": "Updated September 24, 2020",
            "views": "199",
            "upvotes": " View 122 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Ábel Varga",
                    "user_href": "/profile/Ábel-Varga-3"
                },
                {
                    "user_id": "Timotej Mikuljan",
                    "user_href": "/profile/Timotej-Mikuljan"
                },
                {
                    "user_id": "David Santos",
                    "user_href": "/profile/David-Santos-405"
                },
                {
                    "user_id": "Vincent James",
                    "user_href": "/profile/Vincent-James-78"
                },
                {
                    "user_id": "Andrei Daniel Boicu",
                    "user_href": "/profile/Andrei-Daniel-Boicu"
                },
                {
                    "user_id": "Deniya Pompey",
                    "user_href": "/profile/Deniya-Pompey"
                },
                {
                    "user_id": "Janette Lee",
                    "user_href": "/profile/Janette-Lee-31"
                },
                {
                    "user_id": "Rob Jager",
                    "user_href": "/profile/Rob-Jager-5"
                },
                {
                    "user_id": "Julius Naktinis",
                    "user_href": "/profile/Julius-Naktinis"
                },
                {
                    "user_id": "Jamal Bertrum",
                    "user_href": "/profile/Jamal-Bertrum"
                },
                {
                    "user_id": "Rain Dahl",
                    "user_href": "/profile/Rain-Dahl"
                },
                {
                    "user_id": "Thokozani Mthimunye",
                    "user_href": "/profile/Thokozani-Mthimunye-3"
                },
                {
                    "user_id": "Elizabeth Wallace",
                    "user_href": "/profile/Elizabeth-Wallace-176"
                },
                {
                    "user_id": "Alex Chen",
                    "user_href": "/profile/Alex-Chen-834"
                },
                {
                    "user_id": "Gogito UI",
                    "user_href": "/profile/Gogito-UI"
                },
                {
                    "user_id": "Isaac Sobout",
                    "user_href": "/profile/Isaac-Sobout"
                },
                {
                    "user_id": "Lynne Roxas",
                    "user_href": "/profile/Lynne-Roxas-1"
                },
                {
                    "user_id": "Liam Doering",
                    "user_href": "/profile/Liam-Doering"
                },
                {
                    "user_id": "Ermy Ny",
                    "user_href": "/profile/Ermy-Ny"
                },
                {
                    "user_id": "Laurent Bastings",
                    "user_href": "/profile/Laurent-Bastings"
                },
                {
                    "user_id": "Kyle Phan",
                    "user_href": "/profile/Kyle-Phan-2"
                },
                {
                    "user_id": "Chacko Stephen",
                    "user_href": "/profile/Chacko-Stephen-3"
                },
                {
                    "user_id": "Peter Löffler",
                    "user_href": "/profile/Peter-Löffler-1"
                },
                {
                    "user_id": "Husain Khan",
                    "user_href": "/profile/Husain-Khan-9"
                },
                {
                    "user_id": "Katarzyna Parfianowicz",
                    "user_href": "/profile/Katarzyna-Parfianowicz"
                },
                {
                    "user_id": "Arnoldo Pabelonio",
                    "user_href": "/profile/Arnoldo-Pabelonio"
                },
                {
                    "user_id": "Kenta Muirhead",
                    "user_href": "/profile/Kenta-Muirhead"
                },
                {
                    "user_id": "Ethan Spencer",
                    "user_href": "/profile/Ethan-Spencer-15"
                },
                {
                    "user_id": "Jarek Villalva",
                    "user_href": "/profile/Jarek-Villalva"
                },
                {
                    "user_id": "Robin Blue",
                    "user_href": "/profile/Robin-Blue-3"
                },
                {
                    "user_id": "Alcyone Sky",
                    "user_href": "/profile/Alcyone-Sky"
                },
                {
                    "user_id": "Daphne Crimes",
                    "user_href": "/profile/Daphne-Crimes"
                },
                {
                    "user_id": "Fish Man",
                    "user_href": "/profile/Fish-Man-58"
                },
                {
                    "user_id": "Gabriel Guthrie",
                    "user_href": "/profile/Gabriel-Guthrie-1"
                },
                {
                    "user_id": "Victoria Laskovska",
                    "user_href": "/profile/Victoria-Laskovska"
                },
                {
                    "user_id": "Thom De Ruiter",
                    "user_href": "/profile/Thom-De-Ruiter"
                },
                {
                    "user_id": "Wesley Bathgate",
                    "user_href": "/profile/Wesley-Bathgate"
                },
                {
                    "user_id": "Julio Hernandez",
                    "user_href": "/profile/Julio-Hernandez-241"
                },
                {
                    "user_id": "Miracle Obatare",
                    "user_href": "/profile/Miracle-Obatare"
                },
                {
                    "user_id": "Ovidiu Racorean",
                    "user_href": "/profile/Ovidiu-Racorean"
                }
            ]
        },
        {
            "author_info": {
                "name": "Brian White",
                "href": "/profile/Brian-White-722"
            },
            "answer_text": "People cannot guess IQ. If they could do that, we wouldn’t need IQ tests. In reality, people are often surprised at the results of professional IQ tests. If they could accurately predict IQ they would not be surprised. Most of us can broadly sense that a person is dull or very dull. It is obvious, but the associated IQ score requires a proper test. Likewise we can tell if someone is very intelligent, as there are many signs of high IQ (academic success, job status, income, etc.). While none of the factors we use to broadly classify intelligence are deterministic, when they exist in clusters, we get the message. Curiously, bright people seem to believe that they are normal, not bright. The reason is most often because they surround themselves with similarly intelligent people. This happens through universities and jobs. The very bright guy looks around and sees that his friends are just like him, so he becomes calibrated to that level of intelligence as average, even when it is very high. People are amazingly inept at guessing their own IQ: Gilles E. Gignac, Marcin Zajenkowski, People tend to overestimate their romantic partner's intelligence even more than their own, Intelligence, Volume 73, 2019, Pages 41-51. Abstract: People can estimate their own and their romantic partner's intelligence (IQ) with some level of accuracy, which may facilitate the observation of assortative mating for IQ. However, the degree to which people may overestimate their own (IQ), as well as overestimate their romantic partner's IQ, is less well established. In the current study, we investigated four outstanding issues in this area. First, in a sample of 218 couples, we examined the degree to which people overestimate their own and their partner's IQ, on the basis of comparisons between self-estimated intelligence (SEI) and objectively measured IQ (Advanced Progressive Matrices). Secondly, we evaluated whether assortative mating for intelligence was driven principally by women (the males-compete/females choose model of sexual selection) or both women and men (the mutual mate model of sexual selection). Thirdly, we tested the hypothesis that assortative mating for intelligence may occur for both SEI and objective IQ. Finally, the possibility that degree of intellectual compatibility may relate positively to relationship satisfaction was examined. We found that people overestimated their own IQ (women and men + 30 IQ points) and their partner's IQ (women +38 IQ points; men +36 IQ points). Finally, the degree of intellectual compatibility (objectively and subjectively assessed) failed to correlate significantly with relationship satisfaction for both sexes. It would appear that women and men participate in the process of mate selection, with respect to evaluating IQ, consistent with the mutual mate model of sexual selection. However, the personal benefits of intellectual compatibility seem less obvious. ",
            "date": "Answered August 15, 2020",
            "views": "17",
            "upvotes": " View 13 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Abdel Fudadin",
                    "user_href": "/profile/Abdel-Fudadin"
                },
                {
                    "user_id": "Conny Hernö",
                    "user_href": "/profile/Conny-Hernö"
                },
                {
                    "user_id": "Anne Barley",
                    "user_href": "/profile/Anne-Barley-1"
                },
                {
                    "user_id": "Dhivya",
                    "user_href": "/profile/Dhivya-194"
                },
                {
                    "user_id": "Mike Dowell",
                    "user_href": "/profile/Mike-Dowell-19"
                },
                {
                    "user_id": "Livia Nemeth",
                    "user_href": "/profile/Livia-Nemeth-1"
                },
                {
                    "user_id": "Valentina Rodriguez",
                    "user_href": "/profile/Valentina-Rodriguez-149"
                },
                {
                    "user_id": "Daniel Zhang",
                    "user_href": "/profile/Daniel-Zhang-404"
                },
                {
                    "user_id": "Justine Chung",
                    "user_href": "/profile/Justine-Chung-6"
                },
                {
                    "user_id": "Daniel Ngenegbo",
                    "user_href": "/profile/Daniel-Ngenegbo"
                },
                {
                    "user_id": "Kim Nik",
                    "user_href": "/profile/Kim-Nik-5"
                },
                {
                    "user_id": "Anna Fakira",
                    "user_href": "/profile/Anna-Fakira-1"
                },
                {
                    "user_id": "Peter Knutsen",
                    "user_href": "/profile/Peter-Knutsen-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Filip Lisoň",
                "href": "/profile/Filip-Lisoň"
            },
            "answer_text": "We sure do! We are like Jews, we can get easily inside your mind and there we can find out almost anything about you.  Your IQ is NOT the most important thing we wanna know about you when we are in. The first thing, and that’s the same for Jews and people with high IQ, is to get your weaknesses. With this knowledge, it’s almost effortless to manipulate with you. Your IQ is, however, an important tool as well. Let me introduce a brief procedure. Get in touch with the host in whose head you wanna live inWith your mental ability it takes between an hour and one day to get his IQ right and after few tries when you were a child, the prediction is quite accurate in adulthood.With the right questions and topics you get inside his head easily.Now, you have the access to discover his brain, his past and the weaknesses.Event though you have high IQ, you often forget before the first step on the most important question –> What do you want to know? / What is the reason of the whole process?; you start panicking. I have the abilities to do anything, but do I wanna hurt him? Date him (the host)? During these questions, you are getting lost, you are losing the control over his head and you need to decide as fast as possible before he starts hesitate.Done? Are you sure what you want to achieve? The most critical part of the procedure is over. PhewFind the answers on your questions, that’s an end of the journey.note: if the conclusion after the second step is that your eventual host has a similar or higher IQ as you have, don’t rush, you may fall into your own trap because he is doing the same thing with more prudence and diligence and is just waiting for your faults.Thanks Taika Waititi, Jojo Rabbit is such a nice and inspirational movie for this type of questions! ",
            "date": "Answered October 8, 2020",
            "views": "492",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Leonardo Gomes",
                "href": "/profile/Leonardo-Gomes-64"
            },
            "answer_text": "90–110: Likes everything popular.Can talk easily with people about the things he likes.His behavior looks a lot like one of his/her parents and friends.110–125: He is going to have some unusual interests that often caught others' attention, like good rock bands, or good movies.Can talk easily about things he does not know about.Gets very active talking with people with common interests.Is interested in intelligence but view it more like “trickster thief intelligence” than a “scientist intelligence”.Sometimes feels he is smarter than others, sometimes feels he is not.125–145: Have very unusual interests and knowledge at an almost specialist level.Feels easily bored talking with others unless is in an academic environment or something like that.Might leave a discussion as not interested, and weeks later come up with a complex idea about the subject.Know they are smart, even if everyone around him is smarter than him he is pretty aware that the environment he is in does not represent reality.Admire intelligence as described by most psychologists and academics.Feels successful or not depending on how much discipline they have. Even if they are successful for most people they might feel like underachievers.Has deep knowledge about most subjects.Have goals of success and knows the steps to achieve them.Relatively self-aware, the amount of self-awareness is directly correlated with IQ.145 and above: Parents immediately know how smart they are.Very unusual interests.Looks formal friendly most of the time, but will look angry, extremely agitated, or disappointed while discussing something that interests him.Have original ideas about almost any subject.Will only look smart if put into advanced studies, otherwise will look weird and obsessed with confrontation.If you try to point out weird things they usually do, and they already know, almost like they do it to pis people off. Like “you know you delay the class while discussing with the teacher right?” and he might answer “yeah, I know everyone hates me and some people get late to their jobs because of that”.Does not feels genuine when talking about his feelings. Almost like he is makings excuses or does not care.Talking with them makes you feel tired quickly unless you are above 145 too.Feels childish about success. Will be more admired with someone having black belt karate than him being a great CEO. Will usually like things that look cool in movies but have no real advantage in real life.Fake humble to most people, extremely competitive, and ego-oriented with close ones of the same field of interest.There is a lot more to be said, but I think this is good enough. ",
            "date": "Updated September 22, 2020",
            "views": "1984",
            "upvotes": " View 739 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Seth Shaul",
                    "user_href": "/profile/Seth-Shaul"
                },
                {
                    "user_id": "Daniel Magee",
                    "user_href": "/profile/Daniel-Magee-12"
                },
                {
                    "user_id": "Pedro H M Silva",
                    "user_href": "/profile/Pedro-H-M-Silva"
                },
                {
                    "user_id": "Giang Hoang",
                    "user_href": "/profile/Giang-Hoang-10"
                },
                {
                    "user_id": "Were Manero",
                    "user_href": "/profile/Were-Manero"
                },
                {
                    "user_id": "Daniel Son",
                    "user_href": "/profile/Daniel-Son-37"
                },
                {
                    "user_id": "Anthony Janssen",
                    "user_href": "/profile/Anthony-Janssen-3"
                },
                {
                    "user_id": "Anna Karenina",
                    "user_href": "/profile/Anna-Karenina-81"
                },
                {
                    "user_id": "Toni Whittaker",
                    "user_href": "/profile/Toni-Whittaker"
                },
                {
                    "user_id": "Destinée",
                    "user_href": "/profile/Destinée"
                },
                {
                    "user_id": "André Camarão Ramos",
                    "user_href": "/profile/André-Camarão-Ramos"
                },
                {
                    "user_id": "Hannah Boswell",
                    "user_href": "/profile/Hannah-Boswell-6"
                },
                {
                    "user_id": "Vasil Gramov",
                    "user_href": "/profile/Vasil-Gramov"
                },
                {
                    "user_id": "Nabeel",
                    "user_href": "/profile/Nabeel-48"
                },
                {
                    "user_id": "Jerel Black",
                    "user_href": "/profile/Jerel-Black"
                },
                {
                    "user_id": "Rita Amaral",
                    "user_href": "/profile/Rita-Amaral-3"
                },
                {
                    "user_id": "Alexandr Chabanov",
                    "user_href": "/profile/Alexandr-Chabanov"
                },
                {
                    "user_id": "Bellatrix Leonette",
                    "user_href": "/profile/Bellatrix-Leonette"
                },
                {
                    "user_id": "Ryan Baron",
                    "user_href": "/profile/Ryan-Baron-1"
                },
                {
                    "user_id": "Alex Chen",
                    "user_href": "/profile/Alex-Chen-834"
                },
                {
                    "user_id": "Liora Blum",
                    "user_href": "/profile/Liora-Blum"
                },
                {
                    "user_id": "Mark Bowman",
                    "user_href": "/profile/Mark-Bowman-111"
                },
                {
                    "user_id": "Martin Ivancic",
                    "user_href": "/profile/Martin-Ivancic"
                },
                {
                    "user_id": "Locklina Skitt",
                    "user_href": "/profile/Locklina-Skitt"
                },
                {
                    "user_id": "Max Tan",
                    "user_href": "/profile/Max-Tan-120"
                },
                {
                    "user_id": "Hirru Minati",
                    "user_href": "/profile/Hirru-Minati"
                },
                {
                    "user_id": "Brian Shiro",
                    "user_href": "/profile/Brian-Shiro-1"
                },
                {
                    "user_id": "Osvaldo Carvalho de Santana",
                    "user_href": "/profile/Osvaldo-Carvalho-de-Santana"
                },
                {
                    "user_id": "Dominique Lafaysse",
                    "user_href": "/profile/Dominique-Lafaysse"
                },
                {
                    "user_id": "Ivandro Geronimo",
                    "user_href": "/profile/Ivandro-Geronimo"
                },
                {
                    "user_id": "Marco Curschellas",
                    "user_href": "/profile/Marco-Curschellas"
                },
                {
                    "user_id": "Rainer Mühr",
                    "user_href": "/profile/Rainer-Mühr"
                },
                {
                    "user_id": "Helen Metilco Troutt",
                    "user_href": "/profile/Helen-Metilco-Troutt"
                },
                {
                    "user_id": "Isabella Stasi Castriota Scanderbeg",
                    "user_href": "/profile/Isabella-Stasi-Castriota-Scanderbeg"
                },
                {
                    "user_id": "E Hoskins",
                    "user_href": "/profile/E-Hoskins-2"
                },
                {
                    "user_id": "David Jennings",
                    "user_href": "/profile/David-Jennings-5"
                },
                {
                    "user_id": "Azor",
                    "user_href": "/profile/Azor-3"
                },
                {
                    "user_id": "Helena Ursus",
                    "user_href": "/profile/Helena-Ursus"
                },
                {
                    "user_id": "Sebastian Natera",
                    "user_href": "/profile/Sebastian-Natera"
                },
                {
                    "user_id": "Margaret Ann",
                    "user_href": "/profile/Margaret-Ann-57"
                },
                {
                    "user_id": "Philip Whan",
                    "user_href": "/profile/Philip-Whan"
                },
                {
                    "user_id": "Aaron Hill",
                    "user_href": "/profile/Aaron-Hill-31"
                },
                {
                    "user_id": "Paweł Nowakowski",
                    "user_href": "/profile/Paweł-Nowakowski-7"
                },
                {
                    "user_id": "Andrew Tiono",
                    "user_href": "/profile/Andrew-Tiono"
                },
                {
                    "user_id": "Cleef Gulfan",
                    "user_href": "/profile/Cleef-Gulfan"
                },
                {
                    "user_id": "Quinn LeFort",
                    "user_href": "/profile/Quinn-LeFort"
                },
                {
                    "user_id": "Betty (Collier,Watson)Burston",
                    "user_href": "/profile/Betty-Collier-Watson-Burston"
                },
                {
                    "user_id": "Dana Moscalu",
                    "user_href": "/profile/Dana-Moscalu"
                },
                {
                    "user_id": "Allan Jabczynski",
                    "user_href": "/profile/Allan-Jabczynski"
                },
                {
                    "user_id": "Nguyen Thuong Vu",
                    "user_href": "/profile/Nguyen-Thuong-Vu"
                },
                {
                    "user_id": "Nisha Patel",
                    "user_href": "/profile/Nisha-Patel-319"
                },
                {
                    "user_id": "Diego Gonzalez",
                    "user_href": "/profile/Diego-Gonzalez-64"
                },
                {
                    "user_id": "Samuel Malone",
                    "user_href": "/profile/Samuel-Malone-1"
                },
                {
                    "user_id": "Wiktoria Co.",
                    "user_href": "/profile/Wiktoria-Co"
                },
                {
                    "user_id": "Laura Hart",
                    "user_href": "/profile/Laura-Hart-20"
                },
                {
                    "user_id": "Ján Szakál",
                    "user_href": "/profile/Ján-Szakál"
                },
                {
                    "user_id": "George Despotov",
                    "user_href": "/profile/George-Despotov"
                },
                {
                    "user_id": "Bojan Vidaković",
                    "user_href": "/profile/Bojan-Vidaković"
                },
                {
                    "user_id": "Ewa Grzybowska",
                    "user_href": "/profile/Ewa-Grzybowska"
                },
                {
                    "user_id": "Felipe Silva Docolomansky",
                    "user_href": "/profile/Felipe-Silva-Docolomansky"
                },
                {
                    "user_id": "Rene Gibson",
                    "user_href": "/profile/Rene-Gibson-1"
                },
                {
                    "user_id": "Ivan I. Kurdov",
                    "user_href": "/profile/Ivan-I-Kurdov"
                },
                {
                    "user_id": "Jesper Thiesen",
                    "user_href": "/profile/Jesper-Thiesen"
                },
                {
                    "user_id": "Radosław Chwiszczuk",
                    "user_href": "/profile/Radosław-Chwiszczuk-1"
                },
                {
                    "user_id": "Joseph Campos-Furber",
                    "user_href": "/profile/Joseph-Campos-Furber"
                },
                {
                    "user_id": "Fitsum Girum",
                    "user_href": "/profile/Fitsum-Girum"
                },
                {
                    "user_id": "Giovannie Freniere",
                    "user_href": "/profile/Giovannie-Freniere"
                },
                {
                    "user_id": "Tony Spataro",
                    "user_href": "/profile/Tony-Spataro-2"
                },
                {
                    "user_id": "Bobby Cole",
                    "user_href": "/profile/Bobby-Cole-7"
                },
                {
                    "user_id": "Eric Tyler",
                    "user_href": "/profile/Eric-Tyler-5"
                },
                {
                    "user_id": "Elígio Kugo Leonardo",
                    "user_href": "/profile/Elígio-Kugo-Leonardo"
                },
                {
                    "user_id": "Gabriela Bagalá",
                    "user_href": "/profile/Gabriela-Bagalá"
                },
                {
                    "user_id": "Rita Teles",
                    "user_href": "/profile/Rita-Teles-2"
                },
                {
                    "user_id": "Matilde Giuliani",
                    "user_href": "/profile/Matilde-Giuliani-1"
                },
                {
                    "user_id": "Milan Dobrota",
                    "user_href": "/profile/Milan-Dobrota-1"
                },
                {
                    "user_id": "Vaggelis Tsiotsios",
                    "user_href": "/profile/Vaggelis-Tsiotsios"
                },
                {
                    "user_id": "Angela Silveira",
                    "user_href": "/profile/Angela-Silveira-1"
                },
                {
                    "user_id": "Peter David Ransome",
                    "user_href": "/profile/Peter-David-Ransome"
                },
                {
                    "user_id": "Ben Smith",
                    "user_href": "/profile/Ben-Smith-787"
                },
                {
                    "user_id": "Petar Milutinović",
                    "user_href": "/profile/Petar-Milutinović"
                }
            ]
        },
        {
            "author_info": {
                "name": "Alex Easlick",
                "href": "/profile/Alex-Easlick"
            },
            "answer_text": "More like other people's general level. I have a above average IQ but not at all genius level. I have considered this though. Below average- now I'm not talking mentally handicapped, but people who are just not gifted in cognitive thought. I mean it's pretty obvious. They find something like NASCAR or wrestling and become super fans. Not saying all people who enjoy those two examples are below average. It's probably more of a guilty pleasure for some but a obsession for some. They have a couple or way too many kids, and are happy. I'm pretty jealous of these people. My favorite quote is “Human life is too long to devote to reproduction, yet too short to devote to learning, in the helix of time.Perhaps that is why humans succumb to desire and seek release.Despite the fact that life is complete with the sun, the land, and the poetry.\" -HxH. For me that means not everything has to be so fucking complicated. Average intelligence- By far the majority. Just by the very nature of evolution and survival of the fittest, this is probably the sweet spot. You would think the top preformers would be happier, but the average are the children of the previous top preformers (kinda anyways human evolution is way different than non sentient species evolution). They compete and form connections easy because a lot of people are on their level. That's how evolution works. Above intelligent- They find something to obsess about. They study math or health or economics or art or any number of fields. That becomes their whole identity. They can honestly be pretty boring. They can do it for just a idea too. They just want to be a intellectual, so that becomes their personality. So that's my basic guidelines. I place people in one of those three areas and it's a sliding scale from there. I rarely do this anymore. Who cares if someone has a IQ of 105 or 115? I should point out this is super basic. I'm not gonna write a whole essay right now. I make some serious leaps and judgments without explaining why. Also not taking mental health into consideration. ",
            "date": "Answered September 30, 2020",
            "views": "438",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Gonçalo Melo",
                    "user_href": "/profile/Gonçalo-Melo-13"
                }
            ]
        },
        {
            "author_info": {
                "name": "Ky VanD",
                "href": "/profile/Ky-VanD"
            },
            "answer_text": "This is a generalisation across the range but a good one to remember in navigating people, interactions and situations in the more basic day to day. My experience is even in uncomfortable situations, the higher the IQ the more people are able to identify and focus on the actual subject, issues and look at meaningful actions, solutions, or not as some cases may be in a logical manner. They are also more self aware, especially that context really does matter and tuned into the lack of such in others. Higher IQ people are also very open to knowing what they don’t know and able to elicit more information with a great degree of self sufficiency. The lower the IQ the more likely it is they will create drama, think they know everything, get nasty and make personal attacks on others to deflect. Unfortunately this stuff seems to be the only tool in their belt. Their skill that gets enhanced is playing the bully, coward and victim all at the same time. Often I have found extreme reactions and much grandiose entitlement that is totally disproportionate to a situation because they are unable to decipher context. The ironic red flag of these people is usually their stereotype towards people smarter than them as having no social skills because they believe that this entails tension and a barter of nasty and faking the niceties others are often smart enough to see and walk away from early. ",
            "date": "Answered September 30, 2020",
            "views": "393",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Abdel Fudadin",
                    "user_href": "/profile/Abdel-Fudadin"
                }
            ]
        },
        {
            "author_info": {
                "name": "Malcolm Murray",
                "href": "/profile/Malcolm-Murray-3"
            },
            "answer_text": "As a member of Mensa with an IQ estimated to be around 147, I can often read when someone is genuinely smart because it just tends to show through in everything they do. Just in the things they say and do, observations they make, the way they do their jobs, etc. Just yesterday my wife were at a local designer outlet for shoes and the young man helping us just seemed ten steps ahead of his game and was probably one of the most helpful shoe clerks we’d ever seen - doing such a good job like it was nothing to him. My guess is that he’s a student working there for the summer. He just seemed to think of everything; we each found something we liked and were out of that store in no time - each having made a purchase of something we liked. We couldn’t help commenting on how good he was at what he did. I’m sure he could become a doctor or a surgeon or something. He could handle his job like there was nothing to it. I know what it’s like when people can’t thank you enough for how well you do your job, and it was really no big deal. So to get back to your question, I can tell when someone’s smart - usually just by the little things they do while they go about their lives, taking care of problems - even if it’s just a small problem, but in this case we were left with a feeling of whatever the opposite of big disaster is, that was it. As to how smart in terms of IQ, I couldn’t say, although if I was to study it enough I could probably get better at guessing those kinds of things. But anyhow, that’s my answer and thanks for reading this! ",
            "date": "Answered August 15, 2020",
            "views": "892",
            "upvotes": " View 5 Upvoters",
            "upvoters": [
                {
                    "user_id": "Ky VanD",
                    "user_href": "/profile/Ky-VanD"
                },
                {
                    "user_id": "Joy Love",
                    "user_href": "/profile/Joy-Love-100"
                },
                {
                    "user_id": "Valentina Rodriguez",
                    "user_href": "/profile/Valentina-Rodriguez-149"
                },
                {
                    "user_id": "Daniel Zhang",
                    "user_href": "/profile/Daniel-Zhang-404"
                },
                {
                    "user_id": "Kamran Pervez",
                    "user_href": "/profile/Kamran-Pervez-3"
                }
            ]
        },
        {
            "author_info": {
                "name": "Jim Springer",
                "href": "/profile/Jim-Springer-8"
            },
            "answer_text": "It’s not easy but it can be done, if you have a very high IQ to begin with it’s possible to gauge where others fall on the terms of giftedness and get a good idea of the range of their IQ. If you have a lower IQ it’s near impossible to gauge where someone above you falls. I have been video chatting with several people of all ranges but mostly from the profoundly gifted range and most of the time I’m pretty much on target once I get to know enough about a person. ",
            "date": "Answered August 15, 2020",
            "views": "104",
            "upvotes": " View 29 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Julius Naktinis",
                    "user_href": "/profile/Julius-Naktinis"
                },
                {
                    "user_id": "Abdel Fudadin",
                    "user_href": "/profile/Abdel-Fudadin"
                },
                {
                    "user_id": "Marie Angele Barelier",
                    "user_href": "/profile/Marie-Angele-Barelier"
                },
                {
                    "user_id": "Richard Marsh",
                    "user_href": "/profile/Richard-Marsh-66"
                },
                {
                    "user_id": "A.R. LaBaere",
                    "user_href": "/profile/A-R-LaBaere"
                },
                {
                    "user_id": "Sebastian Dionisie",
                    "user_href": "/profile/Sebastian-Dionisie"
                },
                {
                    "user_id": "Daniel Zhang",
                    "user_href": "/profile/Daniel-Zhang-404"
                },
                {
                    "user_id": "Jarle F. Olsen",
                    "user_href": "/profile/Jarle-F-Olsen"
                },
                {
                    "user_id": "Daniel Hudson",
                    "user_href": "/profile/Daniel-Hudson-85"
                },
                {
                    "user_id": "Sharon Ivana",
                    "user_href": "/profile/Sharon-Ivana"
                },
                {
                    "user_id": "Kay Hwang",
                    "user_href": "/profile/Kay-Hwang-5"
                },
                {
                    "user_id": "Abrar Aziz",
                    "user_href": "/profile/Abrar-Aziz-2"
                },
                {
                    "user_id": "Jarek Villalva",
                    "user_href": "/profile/Jarek-Villalva"
                },
                {
                    "user_id": "Kent Renz",
                    "user_href": "/profile/Kent-Renz"
                },
                {
                    "user_id": "Jason Miller",
                    "user_href": "/profile/Jason-Miller-301"
                },
                {
                    "user_id": "Dave Martin",
                    "user_href": "/profile/Dave-Martin-163"
                },
                {
                    "user_id": "Luca Martusciello",
                    "user_href": "/profile/Luca-Martusciello"
                },
                {
                    "user_id": "Justin Savatdy",
                    "user_href": "/profile/Justin-Savatdy"
                },
                {
                    "user_id": "James Wade",
                    "user_href": "/profile/James-Wade-55"
                },
                {
                    "user_id": "K Morales",
                    "user_href": "/profile/K-Morales-6"
                },
                {
                    "user_id": "Ilias Gioldasis",
                    "user_href": "/profile/Ilias-Gioldasis"
                },
                {
                    "user_id": "James Dowling",
                    "user_href": "/profile/James-Dowling-17"
                },
                {
                    "user_id": "Sean Madeley",
                    "user_href": "/profile/Sean-Madeley-3"
                },
                {
                    "user_id": "Andreas Hofer",
                    "user_href": "/profile/Andreas-Hofer-5"
                },
                {
                    "user_id": "Alessio Marin",
                    "user_href": "/profile/Alessio-Marin-5"
                },
                {
                    "user_id": "Peter Knutsen",
                    "user_href": "/profile/Peter-Knutsen-1"
                },
                {
                    "user_id": "James Barton",
                    "user_href": "/profile/James-Barton-129"
                },
                {
                    "user_id": "Elizabeth Morrow",
                    "user_href": "/profile/Elizabeth-Morrow-17"
                },
                {
                    "user_id": "Bosca Fabian",
                    "user_href": "/profile/Bosca-Fabian"
                }
            ]
        },
        {
            "author_info": {
                "name": "Susanna Viljanen",
                "href": "/profile/Susanna-Viljanen"
            },
            "answer_text": "When I served as a butterbar, I had access to the Stanine scores of the men in my unit. Let’s say it was an eye-opening experience, as Stanine scores correspond well to IQ scores, and they also demnstrate a certain kind of personality. IQ is just as about quality as it is quantity. I’d claim I could now predict someone’s IQ after half an hour of interaction within the Stanine score bracket. ",
            "date": "Answered September 14, 2020",
            "views": "244",
            "upvotes": " View 153 Upvoters",
            "upvoters": [
                {
                    "user_id": "Jennifer Armstrong",
                    "user_href": "/profile/Jennifer-Armstrong-115"
                },
                {
                    "user_id": "Andy Ivanisevic",
                    "user_href": "/profile/Andy-Ivanisevic"
                },
                {
                    "user_id": "Aditya Manohar",
                    "user_href": "/profile/Aditya-Manohar-18"
                },
                {
                    "user_id": "Johan Olofsson",
                    "user_href": "/profile/Johan-Olofsson"
                },
                {
                    "user_id": "Joseph Di Pasquale",
                    "user_href": "/profile/Joseph-Di-Pasquale-1"
                },
                {
                    "user_id": "Mridul J Kurup",
                    "user_href": "/profile/Mridul-J-Kurup"
                },
                {
                    "user_id": "Logan Koland",
                    "user_href": "/profile/Logan-Koland"
                },
                {
                    "user_id": "Anugrah Narula",
                    "user_href": "/profile/Anugrah-Narula"
                },
                {
                    "user_id": "Alessio Marin",
                    "user_href": "/profile/Alessio-Marin-5"
                },
                {
                    "user_id": "Dimitri Vulis",
                    "user_href": "/profile/Dimitri-Vulis"
                },
                {
                    "user_id": "Morgan Johnson",
                    "user_href": "/profile/Morgan-Johnson-7"
                },
                {
                    "user_id": "Melix Lel",
                    "user_href": "/profile/Melix-Lel"
                },
                {
                    "user_id": "Wolfgang Keller",
                    "user_href": "/profile/Wolfgang-Keller"
                },
                {
                    "user_id": "Dimitrij Maslov",
                    "user_href": "/profile/Dimitrij-Maslov"
                },
                {
                    "user_id": "Pierce Matthewson",
                    "user_href": "/profile/Pierce-Matthewson"
                },
                {
                    "user_id": "Paul Burke",
                    "user_href": "/profile/Paul-Burke-49"
                },
                {
                    "user_id": "Sylvia Gwen",
                    "user_href": "/profile/Sylvia-Gwen"
                },
                {
                    "user_id": "Brett Bakos",
                    "user_href": "/profile/Brett-Bakos"
                },
                {
                    "user_id": "Jim Springer",
                    "user_href": "/profile/Jim-Springer-8"
                },
                {
                    "user_id": "Mateus Souza",
                    "user_href": "/profile/Mateus-Souza-9"
                },
                {
                    "user_id": "Álvaro Dijkstra",
                    "user_href": "/profile/Álvaro-Dijkstra"
                },
                {
                    "user_id": "Melanie Gutierrez",
                    "user_href": "/profile/Melanie-Gutierrez-42"
                },
                {
                    "user_id": "Gabriel Vicuña",
                    "user_href": "/profile/Gabriel-Vicuña"
                },
                {
                    "user_id": "Eduardo Moreira",
                    "user_href": "/profile/Eduardo-Moreira-14"
                },
                {
                    "user_id": "David Wayne",
                    "user_href": "/profile/David-Wayne-144"
                },
                {
                    "user_id": "Ian Newman",
                    "user_href": "/profile/Ian-Newman-1"
                },
                {
                    "user_id": "Alex Willenbrink",
                    "user_href": "/profile/Alex-Willenbrink"
                },
                {
                    "user_id": "Tim Buchman",
                    "user_href": "/profile/Tim-Buchman-2"
                },
                {
                    "user_id": "Keith Avery",
                    "user_href": "/profile/Keith-Avery-3"
                },
                {
                    "user_id": "Jordan Fearn",
                    "user_href": "/profile/Jordan-Fearn"
                },
                {
                    "user_id": "Toni Fashina",
                    "user_href": "/profile/Toni-Fashina"
                },
                {
                    "user_id": "Daniel Zhang",
                    "user_href": "/profile/Daniel-Zhang-404"
                },
                {
                    "user_id": "Bernardo Ribeiro da Cunha",
                    "user_href": "/profile/Bernardo-Ribeiro-da-Cunha"
                },
                {
                    "user_id": "Lin Rui",
                    "user_href": "/profile/Lin-Rui-20"
                },
                {
                    "user_id": "Erick Taylor Veloso Da Silva",
                    "user_href": "/profile/Erick-Taylor-Veloso-Da-Silva"
                },
                {
                    "user_id": "Zack Walter",
                    "user_href": "/profile/Zack-Walter-4"
                },
                {
                    "user_id": "Zack Gustine",
                    "user_href": "/profile/Zack-Gustine"
                },
                {
                    "user_id": "Cole Smith",
                    "user_href": "/profile/Cole-Smith-82"
                },
                {
                    "user_id": "Evan Chou",
                    "user_href": "/profile/Evan-Chou-1"
                },
                {
                    "user_id": "Kitty Cruz",
                    "user_href": "/profile/Kitty-Cruz-1"
                },
                {
                    "user_id": "Vishal Ramprasad",
                    "user_href": "/profile/Vishal-Ramprasad"
                },
                {
                    "user_id": "Francisco Manuel Bernal",
                    "user_href": "/profile/Francisco-Manuel-Bernal"
                },
                {
                    "user_id": "Ville Hurmalainen",
                    "user_href": "/profile/Ville-Hurmalainen"
                },
                {
                    "user_id": "Tom Preston",
                    "user_href": "/profile/Tom-Preston-50"
                },
                {
                    "user_id": "Sean Xu",
                    "user_href": "/profile/Sean-Xu-56"
                },
                {
                    "user_id": "Roy Loh",
                    "user_href": "/profile/Roy-Loh-2"
                },
                {
                    "user_id": "Ayananta Das",
                    "user_href": "/profile/Ayananta-Das"
                },
                {
                    "user_id": "Joshua Youngkin",
                    "user_href": "/profile/Joshua-Youngkin-1"
                },
                {
                    "user_id": "Akshay Mudgal",
                    "user_href": "/profile/Akshay-Mudgal-1"
                },
                {
                    "user_id": "Jim Miller",
                    "user_href": "/profile/Jim-Miller-139"
                },
                {
                    "user_id": "Alexander Taylor",
                    "user_href": "/profile/Alexander-Taylor-61"
                },
                {
                    "user_id": "Rahul Singh",
                    "user_href": "/profile/Rahul-Singh-17667"
                },
                {
                    "user_id": "John Stauffer",
                    "user_href": "/profile/John-Stauffer-36"
                },
                {
                    "user_id": "Justine Chung",
                    "user_href": "/profile/Justine-Chung-6"
                },
                {
                    "user_id": "Themba Dube",
                    "user_href": "/profile/Themba-Dube-11"
                },
                {
                    "user_id": "Thomas Walter",
                    "user_href": "/profile/Thomas-Walter-27"
                },
                {
                    "user_id": "Vijay Anand",
                    "user_href": "/profile/Vijay-Anand-18"
                },
                {
                    "user_id": "Sebastian Dionisie",
                    "user_href": "/profile/Sebastian-Dionisie"
                },
                {
                    "user_id": "Mahesh",
                    "user_href": "/profile/Mahesh-813"
                },
                {
                    "user_id": "Clement Liu",
                    "user_href": "/profile/Clement-Liu"
                },
                {
                    "user_id": "Dorin Cojocariu",
                    "user_href": "/profile/Dorin-Cojocariu"
                },
                {
                    "user_id": "Stephen Wouters",
                    "user_href": "/profile/Stephen-Wouters"
                },
                {
                    "user_id": "Rahul Rajput",
                    "user_href": "/profile/Rahul-Rajput-38"
                },
                {
                    "user_id": "Mahesh Jethalia",
                    "user_href": "/profile/महेश-जेथलिया-Mahesh-Jethalia"
                },
                {
                    "user_id": "Jari Lainpelto",
                    "user_href": "/profile/Jari-Lainpelto"
                },
                {
                    "user_id": "Birkir Leó",
                    "user_href": "/profile/Birkir-Leó"
                },
                {
                    "user_id": "Tanvir Khan",
                    "user_href": "/profile/তানভীর-খান-Tanvir-Khan"
                },
                {
                    "user_id": "Aditya",
                    "user_href": "/profile/आदित्या-Aditya"
                },
                {
                    "user_id": "Dušan Janiš",
                    "user_href": "/profile/Dušan-Janiš"
                },
                {
                    "user_id": "Sayan Ganguly",
                    "user_href": "/profile/Sayan-Ganguly-14"
                },
                {
                    "user_id": "Aditya Sharma",
                    "user_href": "/profile/Aditya-Sharma-1280"
                },
                {
                    "user_id": "Gunnar Enlow",
                    "user_href": "/profile/Gunnar-Enlow"
                },
                {
                    "user_id": "Vasco Xavier",
                    "user_href": "/profile/Vasco-Xavier-1"
                },
                {
                    "user_id": "Bill Vannoy",
                    "user_href": "/profile/Bill-Vannoy"
                },
                {
                    "user_id": "Bosca Fabian",
                    "user_href": "/profile/Bosca-Fabian"
                },
                {
                    "user_id": "Prabhanjan Sahoo",
                    "user_href": "/profile/Prabhanjan-Sahoo-4"
                },
                {
                    "user_id": "Hunter Wadhams",
                    "user_href": "/profile/Hunter-Wadhams"
                },
                {
                    "user_id": "Bob Simcoke",
                    "user_href": "/profile/Bob-Simcoke"
                },
                {
                    "user_id": "Tarif Ibne Rashid",
                    "user_href": "/profile/Tarif-Ibne-Rashid"
                },
                {
                    "user_id": "Jordan Flanagan",
                    "user_href": "/profile/Jordan-Flanagan-7"
                },
                {
                    "user_id": "Adam Myers",
                    "user_href": "/profile/Adam-Myers-18"
                },
                {
                    "user_id": "Don Anders",
                    "user_href": "/profile/Don-Anders-3"
                },
                {
                    "user_id": "Armando Garza",
                    "user_href": "/profile/Armando-Garza-14"
                },
                {
                    "user_id": "Abdel Fudadin",
                    "user_href": "/profile/Abdel-Fudadin"
                },
                {
                    "user_id": "Anna Juvani",
                    "user_href": "/profile/Anna-Juvani"
                },
                {
                    "user_id": "Christopher Urso",
                    "user_href": "/profile/Christopher-Urso-1"
                },
                {
                    "user_id": "Irina Aleksandrova",
                    "user_href": "/profile/Irina-Aleksandrova"
                },
                {
                    "user_id": "Joshua Nguyen",
                    "user_href": "/profile/Joshua-Nguyen-13"
                },
                {
                    "user_id": "Yashas Vinay",
                    "user_href": "/profile/Yashas-Vinay"
                },
                {
                    "user_id": "Aljaz Hribernik",
                    "user_href": "/profile/Aljaz-Hribernik"
                },
                {
                    "user_id": "Pasha Aulia Muhammad",
                    "user_href": "/profile/Pasha-Aulia-Muhammad"
                },
                {
                    "user_id": "Gonçalo Melo",
                    "user_href": "/profile/Gonçalo-Melo-13"
                },
                {
                    "user_id": "Chris White",
                    "user_href": "/profile/Chris-White-427"
                },
                {
                    "user_id": "James Dolan",
                    "user_href": "/profile/James-Dolan-124"
                },
                {
                    "user_id": "Harold Wang",
                    "user_href": "/profile/Harold-Wang-11"
                },
                {
                    "user_id": "Edgardo Gallegos",
                    "user_href": "/profile/Edgardo-Gallegos"
                },
                {
                    "user_id": "Sellek Daniel",
                    "user_href": "/profile/Sellek-Daniel"
                },
                {
                    "user_id": "Michael Ewart",
                    "user_href": "/profile/Michael-Ewart-2"
                },
                {
                    "user_id": "Patrick Price",
                    "user_href": "/profile/Patrick-Price-1"
                },
                {
                    "user_id": "Ben Lundy",
                    "user_href": "/profile/Ben-Lundy-5"
                },
                {
                    "user_id": "Phoebe Rose",
                    "user_href": "/profile/Phoebe-Rose-48"
                },
                {
                    "user_id": "James Hartline",
                    "user_href": "/profile/James-Hartline"
                },
                {
                    "user_id": "Ali Kashani",
                    "user_href": "/profile/Ali-Kashani-4"
                },
                {
                    "user_id": "Laurent Bastings",
                    "user_href": "/profile/Laurent-Bastings"
                },
                {
                    "user_id": "Ive Mihovilović",
                    "user_href": "/profile/Ive-Mihovilović"
                },
                {
                    "user_id": "Fabio D'Alessandro",
                    "user_href": "/profile/Fabio-DAlessandro"
                },
                {
                    "user_id": "Hyunjun Bae",
                    "user_href": "/profile/Hyunjun-Bae-1"
                },
                {
                    "user_id": "Elliot Grinstead",
                    "user_href": "/profile/Elliot-Grinstead"
                },
                {
                    "user_id": "James Harding",
                    "user_href": "/profile/James-Harding-40"
                },
                {
                    "user_id": "Adrian Wilson",
                    "user_href": "/profile/Adrian-Wilson-26"
                },
                {
                    "user_id": "Kenan Mustafić",
                    "user_href": "/profile/Kenan-Mustafić"
                },
                {
                    "user_id": "Dirk Swanepoel",
                    "user_href": "/profile/Dirk-Swanepoel-11"
                },
                {
                    "user_id": "Johnathan Black",
                    "user_href": "/profile/Johnathan-Black-2"
                },
                {
                    "user_id": "Tyler Silvio",
                    "user_href": "/profile/Tyler-Silvio"
                },
                {
                    "user_id": "Silviu Mormocea",
                    "user_href": "/profile/Silviu-Mormocea"
                },
                {
                    "user_id": "Antonio Luiz Musa De Noronha",
                    "user_href": "/profile/Antonio-Luiz-Musa-De-Noronha-1"
                },
                {
                    "user_id": "Radovanov Stefan",
                    "user_href": "/profile/Radovanov-Stefan"
                },
                {
                    "user_id": "Ahmed Hafez",
                    "user_href": "/profile/Ahmed-Hafez-25"
                },
                {
                    "user_id": "Edward Storey",
                    "user_href": "/profile/Edward-Storey-2"
                },
                {
                    "user_id": "Auke Kaptijn",
                    "user_href": "/profile/Auke-Kaptijn"
                },
                {
                    "user_id": "Jeff York",
                    "user_href": "/profile/Jeff-York"
                },
                {
                    "user_id": "Christian Odenius",
                    "user_href": "/profile/Christian-Odenius"
                },
                {
                    "user_id": "Jake Nickerson",
                    "user_href": "/profile/Jake-Nickerson"
                },
                {
                    "user_id": "Niclas Olovsson",
                    "user_href": "/profile/Niclas-Olovsson"
                },
                {
                    "user_id": "Doug Freyburger",
                    "user_href": "/profile/Doug-Freyburger"
                },
                {
                    "user_id": "Tayoh Dey",
                    "user_href": "/profile/Tayoh-Dey"
                },
                {
                    "user_id": "Frank S. Share",
                    "user_href": "/profile/Frank-S-Share"
                },
                {
                    "user_id": "Arjun Dhar",
                    "user_href": "/profile/Arjun-Dhar-1"
                },
                {
                    "user_id": "Jacob Powers",
                    "user_href": "/profile/Jacob-Powers-19"
                },
                {
                    "user_id": "Adriano Domingues",
                    "user_href": "/profile/Adriano-Domingues"
                }
            ]
        },
        {
            "author_info": {
                "name": "Federico Pettinicchio",
                "href": "/profile/Federico-Pettinicchio"
            },
            "answer_text": "Not really, can't even predict that well, much less easily. I wouldn't even find it useful to be honest, I am hardly ever in need of putting a score beside a person's intelligence, I honestly don't see the point about even thinking about another person's intelligence, how they think is much more fascinating and offers more insights than a stupid score on pattern recognition. In real life I just deal with what is in front of me and since intelligence isn't something I'm ever thinking about I probably even miss things that might hint at it. It's just not that important I guess. ",
            "date": "Answered September 12, 2020",
            "views": "893",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Joey Hiben",
                    "user_href": "/profile/Joey-Hiben"
                },
                {
                    "user_id": "Daniel Zhang",
                    "user_href": "/profile/Daniel-Zhang-404"
                },
                {
                    "user_id": "Daniel Ngenegbo",
                    "user_href": "/profile/Daniel-Ngenegbo"
                }
            ]
        },
        {
            "author_info": {
                "name": "Kyle Lussier",
                "href": "/profile/Kyle-Lussier"
            },
            "answer_text": "The individual is both very good at some things and very bad at other things at the same time. Figuring out “how good at what” can take work but there are ways this can be done. I don’t support the older models because they are too generic. Anyone of decent intelligence could get decent at IQ “predictions” of others if they focus on doing this for awhile & studied all of the external observation methodologies. There are probably ways this can work. But it does require “active challenge/response loops” of some kind to measure. ",
            "date": "Answered August 15, 2020",
            "views": "632",
            "upvotes": " View 2 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Anne Barley",
                    "user_href": "/profile/Anne-Barley-1"
                },
                {
                    "user_id": "Daniel Zhang",
                    "user_href": "/profile/Daniel-Zhang-404"
                }
            ]
        },
        {
            "author_info": {
                "name": "Joseph Natti",
                "href": "/profile/Joseph-Natti"
            },
            "answer_text": "No. Having a high IQ typically, allows those individuals to find solutions to relatively complex problems in less time than perhaps someone with an average IQ. This is certainly not true in all cases. 68% of us have an average IQ of 85 to 115. Very few of us have an IQ of 70 or less or, 130 and above. Psychologists revise and update testing to maintain an average IQ of 100. ",
            "date": "Updated October 10, 2020",
            "views": "183",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Stan Hayward",
                "href": "/profile/Stan-Hayward-1"
            },
            "answer_text": "I once knew a woman with a high IQ and she could predict if others have STDI am not sure if this is the answer required, but then I don’t have a high IQ(or STD) ",
            "date": "Answered August 15, 2020",
            "views": "11",
            "upvotes": " View 3 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Daniel Zhang",
                    "user_href": "/profile/Daniel-Zhang-404"
                },
                {
                    "user_id": "Charlotte Avant",
                    "user_href": "/profile/Charlotte-Avant"
                },
                {
                    "user_id": "Robert Charles Lee",
                    "user_href": "/profile/Robert-Charles-Lee"
                }
            ]
        },
        {
            "author_info": {
                "name": "Roy Lee Wright",
                "href": "/profile/Roy-Lee-Wright"
            },
            "answer_text": "No, people suck as far as being IQ tests. We have some limited ability to detect people that are close to our own IQs that think the same way as we do. So really people with average IQ are actually better at it than anyone else since more people think as they do. This gives them the highest odds of being correct. ",
            "date": "Answered August 15, 2020",
            "views": "1",
            "upvotes": " View 3 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Christina Chen",
                    "user_href": "/profile/Christina-Chen-216"
                },
                {
                    "user_id": "Daniel Zhang",
                    "user_href": "/profile/Daniel-Zhang-404"
                },
                {
                    "user_id": "Andreas Hofer",
                    "user_href": "/profile/Andreas-Hofer-5"
                }
            ]
        },
        {
            "author_info": {
                "name": "Christopher Wilson",
                "href": "/profile/Christopher-Wilson-551"
            },
            "answer_text": "I dont believe so,,,,a high IQ,,,,doesnt mean special skill,,,,it just defines,that possibly one might be more of a structual thinker,,,meaning,,,the one might be,,more of a detailed or complex thinker,as far as how they define the things around them ",
            "date": "Answered August 15, 2020",
            "views": "719",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Daniel Zhang",
                    "user_href": "/profile/Daniel-Zhang-404"
                },
                {
                    "user_id": "Pauline Ru",
                    "user_href": "/profile/Pauline-Ru-2"
                }
            ]
        },
        {
            "author_info": {
                "name": "Tonia Addison-Hall",
                "href": "/profile/Tonia-Addison-Hall-1"
            },
            "answer_text": "Yes, I can generally tell within a few minutes how intelligent someone is. We recognize our own, lol. It's mostly something in the eyes. It can't be faked, either. ",
            "date": "Answered September 17, 2020",
            "views": "11",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Ky VanD",
                    "user_href": "/profile/Ky-VanD"
                },
                {
                    "user_id": "Daniel Zhang",
                    "user_href": "/profile/Daniel-Zhang-404"
                },
                {
                    "user_id": "Brian Fenwick-Wilson",
                    "user_href": "/profile/Brian-Fenwick-Wilson"
                }
            ]
        },
        {
            "author_info": {
                "name": "Ondrej Popp",
                "href": "/profile/Ondrej-Popp"
            },
            "answer_text": "No… they have no clue what others have unless they look in other's refrigerators. That is, if they want to know what others have in their refrigerators obviously! 🙃 ",
            "date": "Answered October 7, 2020",
            "views": "170",
            "upvotes": "0"
        }
    ]
}