{
    "title": "Can a werewolf and a vampire be friends? - Quora",
    "tags": [
        "Werewolves"
    ],
    "response": [
        {
            "author_info": {
                "name": "Thomas M. Hewlett",
                "href": "/profile/Thomas-M-Hewlett"
            },
            "answer_text": "Werewolves and Vampires are not natural enemies, though they are natural competitors. After all, they are both hunters who must often share the same food source. That would be us. They are also naturally contrary in habits and inclinations. Werewolves are territorial pack animals, whereas Vampires a solitary nomads. Werewolves are still somewhat human, Vampires have left their humanity long behind. But just as with humans, Werewolves and Vampires will surprise you. Friendships between these two creatures is not unheard of, it simply requires a shared interest - or better yet, a common enemy. Again, that would be us. When humans get too close to discovering the truth about the dark reality of the world in which they live, Vampires and Werewolves will band together to defend themselves and preserve their anonymity. The combination of strength, speed, bloodlust and sheer monstrous makes for a formidable force and a nigh unbeatable foe. For that very reason, it is perhaps best that I say no more. I must respect the secrets I hold if I wish to remain alive to answer these types of questions in the future. As the old Werewolf saying goes, “Curiosity killed the human.” ",
            "date": "Answered May 19, 2018",
            "views": "1",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Jakob Gipson",
                    "user_href": "/profile/Jakob-Gipson-1"
                },
                {
                    "user_id": "Camilocas",
                    "user_href": "/profile/Camilocas"
                },
                {
                    "user_id": "Romeo Nicolas Cabantug",
                    "user_href": "/profile/Romeo-Nicolas-Cabantug-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Renaat Beauprez",
                "href": "/profile/Renaat-Beauprez"
            },
            "answer_text": "Traditionally, if a werewolf dies in anyway that doesn't involve silver, holy water or holy ground, it will become a vampire*, though a subservient one to his Sire. If a vampire doesn't fully turn you, you're a werewolf, though subservient to your sire. If a werewolf turns you, you're a werewolf, though not necessarily subservient. When you die and there's no silver, holy ground or holy water involved; you become a vampire*. * All becoming of vampires is subject to terms and conditions. All vampirism is null and void when exposed to holy water, pierced with stakes, shot with silver, pierced by silver, buried under a wild rose, bound by rosary, heart burnt and given to the victim, buried face down, buried at crossroads, buried with stone wedges in the mouth, etc. Please refer all complaints to Lilith, mother of Evils. ",
            "date": "Answered May 29, 2020",
            "views": "99",
            "upvotes": "0"
        }
    ]
}