{
    "title": "Can an undergraduate publish a research paper? - Quora",
    "tags": [
        "Academic Publishing",
        "Academic Research Papers",
        "Academic Papers",
        "Academic Research"
    ],
    "response": [
        {
            "author_info": {
                "name": "Andrea Posada",
                "href": "/profile/Andrea-Posada-8"
            },
            "answer_text": "Technically, anyone can publish a research paper. It is key to know that what you are publishing is a true reflection of your work and not something you are going to be embarrassed about later in your career. For example, if you plan on continuing this research into later years (older undergrad years, grad school, work, etc), maybe you should hold off and publish when you have spent more time and are truly an expert at the research. If you don’t plan on continuing your research and you are confident in your paper, go for it! The best thing to do is consult with your professor or an advisor at your university. At the end of the day, it is your work and your decision with what to do with it, as long as you don’t violate any university or lab policies. Good luck! ",
            "date": "Answered May 9, 2020",
            "views": "80",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Robert Cameron",
                "href": "/profile/Robert-Cameron-16"
            },
            "answer_text": "By doing a neat piece of research! Of course it helps if you are in an environment where faculty may advise/critique/ suggest journals. A mate of mine published a paper (on guillimot fledging) based solely on his own observations. I published (with several similar students) two ornithological papers, published when I was a graduate student, but the work was done when we were bachelors’ students, and had no connection with our PhD studies (on snails). Actually, without digging through the archives, I think I have reviewed or edited a few papers stemming from undergraduate projects: usually, of course, with an advisor/supervisor as second author. Most bachelor’s programmes (at least in Biology) involve a project. Some are very good ",
            "date": "Answered July 8, 2020",
            "views": "91",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Mark Jordan",
                    "user_href": "/profile/Mark-Jordan-90"
                }
            ]
        },
        {
            "author_info": {
                "name": "Martin J Pitt",
                "href": "/profile/Martin-J-Pitt"
            },
            "answer_text": "It is quite simple. You have to produce something worth reading, and write it up to the standard required by a refereed journal. (I have been a referee for several learned journals, and subject editor for one.) You don’t need degrees or any formal qualifications. (Amateurs do it in a number of fields, such as botany, where they can literally do the research in fields.) Find a suitable journal and read some issues to see what they publish, and follow the guidelines for formatting etc. You must have some experience if you have something worth publishing. I would suggest you ask a friendly academic for help. ",
            "date": "Answered July 8, 2020",
            "views": "141",
            "upvotes": " View 2 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Mark Jordan",
                    "user_href": "/profile/Mark-Jordan-90"
                },
                {
                    "user_id": "Philip Timms",
                    "user_href": "/profile/Philip-Timms-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Zen Faulkes",
                "href": "/profile/Zen-Faulkes"
            },
            "answer_text": "This is like asking, “How can I complete in a professional sport without ever having hit the gym, having a coach, or practicing?” Maybe you can. But most don’t. Experience is extremely helpful and valuable. Your best bet is to find someone experienced and collaborate with them. There are programs like the NSF REU and HHMI undergrad summer research programs that are meant to do this. ",
            "date": "Answered July 8, 2020",
            "views": "166",
            "upvotes": " View 2 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Mohamed Husain",
                    "user_href": "/profile/Mohamed-Husain-4"
                },
                {
                    "user_id": "Barbara Robson",
                    "user_href": "/profile/Barbara-Robson-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Ron Combs",
                "href": "/profile/Ron-Combs-2"
            },
            "answer_text": "It is possible, but the research paper would need to reach the “extraordinary” level. Why? There is tremendous competition for getting papers published. Check with your professor. He/she should be able to give you guidance on getting it considered for publishing. ",
            "date": "Answered July 16, 2020",
            "views": "59",
            "upvotes": "0"
        }
    ]
}