{
    "title": "Can sweet potato cause diabetes? - Quora",
    "tags": [
        "Yams & Sweet Potatoes",
        "Potatoes",
        "Diabetes"
    ],
    "response": [
        {
            "author_info": {
                "name": "Rohan James",
                "href": "/profile/Rohan-James-31"
            },
            "answer_text": "As the name indicate is a sweet taste food, but sweet potato is gaining increased attention among people with diabetes, because the pancreas-shaped sweet potato helps to balance blood sugar in diabetics, Research shows that sweet potatoes contain adiponectin, the same hormones that are released from fat cells. Adiponectin tends to improve metabolism and insulin regulation. Unlike other starchy vegetables, sweet potatoes are considered to be an anti-diabetic food.However if you eat the right serving size of a sweet potato you can control the amount of sugar you take in. Also what you put on the potato is important,avoid added sugars or sweeteners.Compared to white potatoes, sweet potatoes are lower on the glycemic index and deliver chart topping vitamin A for eye health. Making the switch to sweet potatoes is a healthy approach to eating your spuds. But adding this spud to your diet isn’t appropriate for everyone with diabetes, because of their higher fiber content, sweet potatoes might cause mild digestive ailments when you first eat them, much the same as increasing fiber of any kind in your diet. Symptoms include gas, abdominal pain, and loose stools. ",
            "date": "Answered May 4, 2020",
            "views": "84",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Farhad Hossain",
                "href": "/profile/Farhad-Hossain-252"
            },
            "answer_text": "Carrots are considered a non-starchy vegetable along with options such as broccoli and lettuce. These foods are safe for people with diabetes to eat at each meal without worry that glucose levels will spike.” If you want to take extra precautions against a rise in glucose levels, enjoy carrots raw instead of cooked ",
            "date": "Answered May 8, 2020",
            "views": "46",
            "upvotes": "0"
        }
    ]
}