{
    "title": "Can someone explain what Gamergate is? - Quora",
    "tags": [
        "News Events in Technology in September 2014",
        "Female Gamers",
        "GamerGate (Fall 2014)",
        "Layman's Explanations",
        "Video Game Industry"
    ],
    "response": [
        {
            "author_info": {
                "name": "Jevioso Orishas",
                "href": "/profile/Jevioso-Orishas"
            },
            "answer_text": "Things you need to understand to get Gamergate: The nature of subculturesWhat happens when a subculture becomes mainstreamHow do corporations capitalize off subculturesHow do subcultures feel about their passions being commodifiedHow do subcultures deal with the loss of power and influence they lose in the transition to mainstream culture.Hip-Hop is a great way of understanding Gamergate I’d say to understand gamergate, you should try to understand hip-hop. Hip-Hop started mostly as way for ostracized black kids in the ghetto to express their experiences in America. As Hip-Hop became more popular and more accepted by the mainstream culture, you began to see fights within hip-hop. Whether one was selling out or not to the mainstream culture or the man, that didn’t care about poor black kids, or their experiences, but just wanted some cash. Also as Hip-Hop became more accepted, it became more diversified. More people started engaging in it, many of them being middle class whites, or just people who simply didn’t have that deep investment in the subculture. Certain people also started apply cultural criticism to it. Many literary people wrote about how misogynistic an art form it is or had become. Others criticized it as being a leading cause of violence in the hood. Whether the criticism is true or not is another story, the point is that when a subculture becomes a part of the mainstream culture and money starts flowing in, a lot of people who don’t share an appreciation for the subculture’s foundations and community, start trying to influence the subculture so they can make money off of it. This is still a dynamic at play. It never goes away, which is why there are different kind of rappers. The way hip-hop fans have been able to manage this transition is through things like beef and street cred. Where rappers who have become to committed to mainstream culture and values get called out by others lower on the totem pole, and if they can’t defend themselves, they become irrelevant, see JaRule and 50 cent. Gamergate: A battle between two Subcultures “Radical” Feminism has also been a subculture for most of America’s history. Most women were not and are not feminists, just like most Americans are not gamers. But over the years, these two groups have become part of the mainstream culture. You can look at the popularity of the Handmaid’s Tale on Hulu or the popularity of games like Call of Duty or GTA. Even when you don’t consume these things, you know about them. As both subcultures shift into the mainstream, a lot of people have been able or willing to create niches for themselves. And that’s where people like Anita Sarkeesian and Zoe Quinn come into play here. They have been vessels for feminism to capitalize off of the transition of video game subculture to mainstream culture…and that’s primarily the driving force of gamergate: keeping such people out of gaming. The truth is in this age, the feminists have generally been more skilled and more effective at taking advantage of social media activism to get their way in this regards, than the people who made up gamergate. Which has led to a frustration and aggression on many gamers who want to protect their subculture and the values at the center of it (most of all, which is free speech and the freedom to make or attempt to make any games aka tell any stories they like). I think the desire to join the alt-right from many of these gamers, comes from the fact, that they are aware that they need some kind of organization or platform to combat the people like their antagonists…unfortunately, the costs of doing that requires making allies, with, well, racists, white supremacists and reactionaries, who only see them as pawns as well. ",
            "date": "Answered September 8, 2019",
            "views": "143",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Stephanie Smith",
                "href": "/profile/Stephanie-Smith-101"
            },
            "answer_text": "The Gamergate Controversy is not too difficult to understand. The problem is that Gater like me will tell you a different story to anti-gaters. I can only tell you my side. I would obviously be biased if I tried to tell their side by myself. You'll have to ask someone like Ernest W. Adams for the anti-perspective. I encourage you to do so. What Is Gamergate?  Gamergate is predominantly a discussion hashtag. People use it to raise awareness about concerning ethical issues in Video Game Journalism. Some members also describe it as a 'consumer revolt' against corrupt journalism. No matter how you slice it, it is a group of gamers who are largely unhappy with how the media is covering games. What Do Gamergaters Want? I've already spent a long time answering this question (linked above), but to give you a TL;DR: We want honest journalism free from anti-consumer practices and activism.  We want companies like Polygon, The Verge, Wired, and Kotaku to disclose when they are using affiliate links on games they are trying to sell us. All the ones mentioned here have failed to do that previously.We want games to be reviewed for how good they are and not docked points for a lack of diversity or another political point.We don't want games to be censored because of pressure from people outside of gaming. Every game has a right to its artistic integrity, it is up to the marketplace to decide if that is something worth investing in.We want to support the developers who have fallen victim to this political activism in video game journalism. My personal campaign is to raise awareness about the child exploitation in the industry. The lack of a proper board makes that a real problem. Who Are We?  We are gamers of all walks of life. We're a colourful bunch if the NSFW tab on the discord is anything to go by. My main circle is a lot is more diverse than people would give us credit for. We're mostly girls for starters and I'm including our mtf trans members in that. That actually surprised me when I first got really involved. Before Gamergate I dunno if I had ever met very many female gamers. Lots of them are just normal gamers as opposed to ex-video game journalists like me. We're all pretty pro-LGBT in gaming and trawl Kickstarter for that kinda stuff. Gamergate is the kinda community where you can find whatever you are looking for. I've met some real good people. That's why I'm always quick to jump to their defence when someone tries to paint them with the tar brush. A lot of us are ex-video game journalists, some of us are as old as the hills. We have retrogamers, FPS gamers, that one guy who only plays Call of Duty and never knows what's going on (you know who you are), furries, bronies, whatever the heck a scaly is. Left-leaning, right-leaning, alt-centrists, attack helicopters, and someone who identifies as a spoon. Truth is we're just people. We don't have sharp teeth or claws. We're just gamers. ",
            "date": "Answered August 29, 2018",
            "views": "27",
            "upvotes": " View 79 Upvoters",
            "upvoters": [
                {
                    "user_id": "Kipia Neko",
                    "user_href": "/profile/Kipia-Neko"
                },
                {
                    "user_id": "Jason Abalaka",
                    "user_href": "/profile/Jason-Abalaka"
                },
                {
                    "user_id": "Miguel Espinoza",
                    "user_href": "/profile/Miguel-Espinoza-16"
                },
                {
                    "user_id": "Steve Johnson",
                    "user_href": "/profile/Steve-Johnson-127"
                },
                {
                    "user_id": "Garrett Stock",
                    "user_href": "/profile/Garrett-Stock-2"
                },
                {
                    "user_id": "Federico Devigili",
                    "user_href": "/profile/Federico-Devigili"
                },
                {
                    "user_id": "Jordan Schreck",
                    "user_href": "/profile/Jordan-Schreck-1"
                },
                {
                    "user_id": "Carter Reyenga",
                    "user_href": "/profile/Carter-Reyenga-1"
                },
                {
                    "user_id": "Vitorino Müller",
                    "user_href": "/profile/Vitorino-Müller"
                },
                {
                    "user_id": "Danny Scot",
                    "user_href": "/profile/Danny-Scot-1"
                },
                {
                    "user_id": "James Long",
                    "user_href": "/profile/James-Long-442"
                },
                {
                    "user_id": "Zac Margenthaler",
                    "user_href": "/profile/Zac-Margenthaler"
                },
                {
                    "user_id": "Hahn Ackles",
                    "user_href": "/profile/Hahn-Ackles"
                },
                {
                    "user_id": "Eniola Orunto",
                    "user_href": "/profile/Eniola-Orunto"
                },
                {
                    "user_id": "Sathyajith M S",
                    "user_href": "/profile/Sathyajith-M-S"
                },
                {
                    "user_id": "Thomas Knowles",
                    "user_href": "/profile/Thomas-Knowles-6"
                },
                {
                    "user_id": "Dustin Rausch",
                    "user_href": "/profile/Dustin-Rausch"
                },
                {
                    "user_id": "Isaac Madhavan",
                    "user_href": "/profile/Isaac-Madhavan"
                },
                {
                    "user_id": "Michael Guy",
                    "user_href": "/profile/Michael-Guy"
                },
                {
                    "user_id": "Châu Trương",
                    "user_href": "/profile/Châu-Trương-1"
                },
                {
                    "user_id": "Mark Robinson",
                    "user_href": "/profile/Mark-Robinson-17"
                },
                {
                    "user_id": "Anarta Poashan",
                    "user_href": "/profile/Anarta-Poashan"
                },
                {
                    "user_id": "Jonathon Brent",
                    "user_href": "/profile/Jonathon-Brent"
                },
                {
                    "user_id": "Dan Laskow",
                    "user_href": "/profile/Dan-Laskow"
                },
                {
                    "user_id": "Miles Negrete",
                    "user_href": "/profile/Miles-Negrete"
                },
                {
                    "user_id": "Steven McReynolds",
                    "user_href": "/profile/Steven-McReynolds-1"
                },
                {
                    "user_id": "Niko Storling",
                    "user_href": "/profile/Niko-Storling"
                },
                {
                    "user_id": "Nick Stephenson",
                    "user_href": "/profile/Nick-Stephenson-4"
                },
                {
                    "user_id": "Sebastian Lang",
                    "user_href": "/profile/Sebastian-Lang-5"
                },
                {
                    "user_id": "Peter Bota",
                    "user_href": "/profile/Peter-Bota-1"
                },
                {
                    "user_id": "Tomos King",
                    "user_href": "/profile/Tomos-King"
                },
                {
                    "user_id": "Chris O'Quinn",
                    "user_href": "/profile/Chris-OQuinn-1"
                },
                {
                    "user_id": "Christopher Dumas",
                    "user_href": "/profile/Christopher-Dumas"
                },
                {
                    "user_id": "Christopher Aeneadas",
                    "user_href": "/profile/Christopher-Aeneadas"
                },
                {
                    "user_id": "Galeno Sousa",
                    "user_href": "/profile/Galeno-Sousa-1"
                },
                {
                    "user_id": "Alexander Novak",
                    "user_href": "/profile/Alexander-Novak-5"
                },
                {
                    "user_id": "Samuel Colvin",
                    "user_href": "/profile/Samuel-Colvin-1"
                },
                {
                    "user_id": "Bryan Tan",
                    "user_href": "/profile/Bryan-Tan-4"
                },
                {
                    "user_id": "Krish Andres",
                    "user_href": "/profile/Krish-Andres"
                },
                {
                    "user_id": "Nat Grant-Haysey",
                    "user_href": "/profile/Nat-Grant-Haysey"
                },
                {
                    "user_id": "Tomasz Krzyśków",
                    "user_href": "/profile/Tomasz-Krzyśków"
                },
                {
                    "user_id": "Rhys Owen",
                    "user_href": "/profile/Rhys-Owen-10"
                },
                {
                    "user_id": "Tomas Murphy",
                    "user_href": "/profile/Tomas-Murphy"
                },
                {
                    "user_id": "Steve Taylor",
                    "user_href": "/profile/Steve-Taylor-109"
                },
                {
                    "user_id": "Matt Hastings",
                    "user_href": "/profile/Matt-Hastings-10"
                },
                {
                    "user_id": "Bruno Correia",
                    "user_href": "/profile/Bruno-Correia-16"
                },
                {
                    "user_id": "Mitchell Brown",
                    "user_href": "/profile/Mitchell-Brown-46"
                },
                {
                    "user_id": "Bob Jones",
                    "user_href": "/profile/Bob-Jones-1183"
                },
                {
                    "user_id": "Christopher Throckmorton",
                    "user_href": "/profile/Christopher-Throckmorton-2"
                },
                {
                    "user_id": "Daniel Braga da Silva",
                    "user_href": "/profile/Daniel-Braga-da-Silva"
                }
            ]
        },
        {
            "author_info": {
                "name": "Brian Lim",
                "href": "/profile/Brian-Lim-64"
            },
            "answer_text": "Yesterday I spent maybe ten hours playing a video game (I am on vacation) and I have spent my whole life playing video games. I am a #pcmasterrace gamer, and I play strategy games or turn based games mostly, with a few exceptions like Guild Wars 2. I will probably play more games today than most people. When my vacation is over I will taper off but I estimate between 5–10 hours a week. If you remember the 90s movie Hackers, I was dialing into BBS to play text games before the Internet. I am about to wakeup and play whatever I want. I poke fun at console gamers and they do at me ;). I first heard of GamerGate maybe a year or two after it came out. And you know what I think? I think it is old news (2014 give me a break) and political activism, of a nasty sort. I don't care if someone slept with someone to get an article written (whoo welcome to life) and I don't care if video game journalists take money to write favourable games. The reason I do not care is, in a free market such things will be excorcised. If you got sex appeal, use it. If you are paid to write good stuff, big deal. I know the games I like and the games I want and such things would not influence me. In mainstream media, if there's a conflict of interest particularly with financial news, journalists disclose it. Anything that is not financial is disclosed as either opinion (editorial) or normal news. I don't particularly care if journalists disclose or don't disclose game industry links. Newsflash: all reviewers in everything get free stuff from suppliers, and are therefore bribed. What will allow them to survive is the accuracy and purpose of their reviews. If the review is good, it will stand on its own if it is not it will fall. Here's a life lesson — looking at motives is generally a bullshit argument, and bullshit attack. Attacking someone's motives is not only dirty, it is also unconvincing. Go after the argument, not the man (or woman). If a review is bullshit here is the correct approach — write a counter review. It is not, dig up shit on someone to attack their motives. Such is abnormal and in fact wrong. However the rest that I hear, harassment, sexism etc., Bother me greatly. I do not know if they are true or not, and quite frankly I don't have the mental energy or time to engage (there are others who have far more resources for example Will Wheaton). Now I have a friend who is a #GamerGate. He tried to send me a YouTube explaining it. Didn't really work. Due to its association with harassment (true or not, enough has been written and much seems true) and the apparent lack of substance (who cares) it is not a cause I could get behind. Perhaps I will change my mind later. But probably not. Always treat others as you would want to be treated. Now back to gaming. ",
            "date": "Answered August 29, 2018",
            "views": "217",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "James Chisholm",
                    "user_href": "/profile/James-Chisholm-43"
                }
            ]
        },
        {
            "author_info": {
                "name": "Benjamin Telford",
                "href": "/profile/Benjamin-Telford"
            },
            "answer_text": "There are plenty of articles that give a precise history of gamergate (GG), but the short version is that it was a loose organisation of gamers who formed together to oppose what they perceived as corruption in the videogame industry. More specifically, GG’s stated concern was around ethical violations within videogame journalism. The general outsider view howver was that this was a clumsy pretext to legitimise GG member’s real intentions, which was to harass women in the gaming industry and to air discomforts with the notion of feminists, diversity, and social justice advocacy having a presence in gaming. The truth doesn’t quite lie in the middle; there absolutely where lots of people harassing women in the games industry, and plenty of gamers had rejected diversity in a myriad of ways. It was also an explicit tactic discussed on the 4chan messageboards to feign social causes to try and excuse misogynistic bullying. But despite all of that, there were also plenty of self proclaimed “gators” who were definitely not doing any of that harassment stuff, and who had simply agreed with the official values of GG as a movement. To add more confusion, plenty of conservative and alt-right figures saw an opportunity in trying to appeal to a disaffected group of gamers, so they also played up to the GG ethos, regardless of their actual opinions on gaming. As for the lasting impact, GG utterly failed to do achieve any of its stated aims. The best it could manage was to convince a couple of journalist websites to publicly update their policies. Several websites took severe hits to their userbase as loyal fans began avoiding them, either to avoid “distrustful journalism” or to avoid users who complained about such things. Meanwhile, the prominence of women and diversity in the videogame industry has not died back, despite the harassment and complaints. Though GG as a movement has officially gone, there are still plenty of gamers who complain about women a lot, and hope to rationalise their behaviour with references to “SJW agendas” in the game industry. ",
            "date": "Answered September 1, 2020",
            "views": "44",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "James Chisholm",
                    "user_href": "/profile/James-Chisholm-43"
                }
            ]
        },
        {
            "author_info": {
                "name": "Brian Collins",
                "href": "/profile/Brian-Collins-56"
            },
            "answer_text": "There are multiple Gamergates. A less well-known Gamergate is a female worker ant who can sexually reproduce. One of the meaner native species of ants in Australia the, innocuous-looking but venemous, Green-head ant, has Gamergates.  Male Green-head ants are polygynous and reproduce with multiple Gamergates. There is a controversy in Biology and Entomology as to whether Gamergate is a valid classification. Opponents of Gamergate argue that Gamergate is an invalid category because Gamergates are really Queens, not workers, because they can lay eggs. They argue that we are classifying Gamergates based on their appearance to us as humans, as opposed to any valid qualitative reasoning. However, data from Liebig et al (2000) shows Gamergates’ are actually less fertile than Queens are, and lay fewer eggs over a lifetime. References: Liebig, J., Peeters, C., Oldham, N. J., Markstädter, C., & Hölldobler, B. (2000). Are variations in cuticular hydrocarbons of queens and workers a reliable signal of fertility in the ant Harpegnathos saltator?. Proceedings of the National Academy of Sciences, 97(8), 4124-4131. https://www.pnas.org/content/pnas/97/8/4124.full.pdf Dietemann, V., Peeters, C., & Hölldobler, B. (2004). Gamergates in the Australian ant subfamily Myrmeciinae. Naturwissenschaften, 91(9), 432-435. ",
            "date": "Answered October 10, 2019",
            "views": "416",
            "upvotes": " View 10 Upvoters",
            "upvoters": [
                {
                    "user_id": "Dyson Ye",
                    "user_href": "/profile/Dyson-Ye"
                },
                {
                    "user_id": "Andrew Couto",
                    "user_href": "/profile/Andrew-Couto-2"
                },
                {
                    "user_id": "Michal Fifowski",
                    "user_href": "/profile/Michal-Fifowski"
                },
                {
                    "user_id": "Craig Howard",
                    "user_href": "/profile/Craig-Howard-2"
                },
                {
                    "user_id": "Andrew Dunbar",
                    "user_href": "/profile/Andrew-Dunbar-3"
                },
                {
                    "user_id": "Niklas Hamann",
                    "user_href": "/profile/Niklas-Hamann"
                },
                {
                    "user_id": "Kristen Griessmann",
                    "user_href": "/profile/Kristen-Griessmann"
                },
                {
                    "user_id": "Marc Lawrence",
                    "user_href": "/profile/Marc-Lawrence-23"
                },
                {
                    "user_id": "Viljami Kalliainen",
                    "user_href": "/profile/Viljami-Kalliainen"
                },
                {
                    "user_id": "Michael Moszczynski",
                    "user_href": "/profile/Michael-Moszczynski"
                }
            ]
        },
        {
            "author_info": {
                "name": "Christopher James",
                "href": "/profile/Christopher-James-26"
            },
            "answer_text": "Gamergate is a polysemous term, and the answer you get will largely depend on who you’re talking to. For example: It’s a ragtag collection of people that noticed and pushed back against various ethical failings and blunders in video game journalism and commentaryIt’s a collection of people that noticed and pushed back against various politically motivated incursions into the video game industryIt’s an unfalsifiable boogyman that journalists use as a placeholder for all things deplorable in this worldIt’s a collection of anti-feminists that get a kick out of inciting chaos by trolling and harassing people online, and hate the idea of women playing video gamesOne could go on. The degree to which these overlap will depend on who you’re talking to. On the whole, I see more evidence for the former than the latter. Fortunately, Brad Glasgow is currently writing a book on Gamergate, having surveyed some 725 “Gamergate supporters,” and his research will hopefully offer a more objective perspective on the people involved, and in turn, the nature of the movement. ",
            "date": "Answered September 4, 2018",
            "views": "243",
            "upvotes": " View 5 Upvoters",
            "upvoters": [
                {
                    "user_id": "Jason Abalaka",
                    "user_href": "/profile/Jason-Abalaka"
                },
                {
                    "user_id": "Dustin Rausch",
                    "user_href": "/profile/Dustin-Rausch"
                },
                {
                    "user_id": "David White",
                    "user_href": "/profile/David-White-192"
                },
                {
                    "user_id": "Alijah Coberly",
                    "user_href": "/profile/Alijah-Coberly"
                },
                {
                    "user_id": "Stephanie Smith",
                    "user_href": "/profile/Stephanie-Smith-101"
                }
            ]
        },
        {
            "author_info": {
                "name": "Simon Jäger",
                "href": "/profile/Simon-Jäger-1"
            },
            "answer_text": "Gamergate got me confused a lot, too. I did not understand what it is even about. Now i think it boild down to the right wing/left wing clash in US. Basically, the extremists of both groups fought over video games. Imagine the typical stereotype of a left wing extremist turned on video games. Such a person would want that all progatonists are gender fluid metrosexual vegan socialists, preferably black or Mexican. Now imagine the typical right wing extremist turned on videogames: They would want a male, brutal, mysogonist, racist killer with at least three guns. Now put these two extremists in a room and you have gamergate. There was more to it, but in my opinion it boils down to this difference in opinion how a video game should be. The rest was just finding arguments why the other side is evil. ",
            "date": "Answered September 2, 2018",
            "views": "132",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "James Chisholm",
                    "user_href": "/profile/James-Chisholm-43"
                }
            ]
        },
        {
            "author_info": {
                "name": "Deepak Soni",
                "href": "/profile/Deepak-Soni-326"
            },
            "answer_text": "GamerGate is the name given to an ongoing “movement” in the online games community. While it ostensibly started over concerns about the ethical corruption of video game journalism, it has very quickly become a window into the evolving state of gaming culture and the shifting identity of the “gamer” as well. ",
            "date": "Answered July 4, 2019",
            "views": "58",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "James Chisholm",
                    "user_href": "/profile/James-Chisholm-43"
                }
            ]
        }
    ]
}