{
    "title": "Can video games be the best story telling medium compared to movies and books? - Quora",
    "tags": [
        "Storytelling",
        "Games",
        "Video Games"
    ],
    "response": [
        {
            "author_info": {
                "name": "John Woodworth",
                "href": "/profile/John-Woodworth-11"
            },
            "answer_text": "No not really. Because video games require that the player has agency and at least some choices in the game. The player has to be able to choose a path and most importantly fail. So a game will never be able to tell a story as effectively as a book or movie, because the author never has full control over what the main character will do. Now that doesn’t mean a video game can’t tell a great story. Pretty much every game from Bioware proves this. Mass Effect for example was an amazing story and having to choose between Ashley and Kaiden was pretty emotional, or in Dragons Age when you have too chose if the kid or mother dies (yeah there’s a 3rd option but only if you’re a Mage). But video games still don’t tend to move people like a good book or movie will. ",
            "date": "Answered October 9, 2018",
            "views": "140",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Jacob Duke",
                    "user_href": "/profile/Jacob-Duke-4"
                }
            ]
        },
        {
            "author_info": {
                "name": "Daniel Super",
                "href": "/profile/Daniel-Super"
            },
            "answer_text": "“Can video games be the best story telling medium compared to movies and books? I don’t think there is a generalized best storytelling medium. Each medium has it’s own strengths. For any given story, one medium might be the best. Storytelling in games is still in it’s childhood compared to movies and books and one thing we’ve learned so far is that not all storytelling techniques transfer well between the mediums. Storytelling in games often comes at the expense of the gameplay in a way that limits the medium’s expressiveness substantially and games that heavily favor storytelling over gameplay often do so by removing most or all of the interactivity during the storytelling parts of the game, reducing it to activities that occur between cut-scenes or the games to more interactive fiction than games. ",
            "date": "Answered October 9, 2018",
            "views": "232",
            "upvotes": " View 4 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Praveen Panishetti",
                    "user_href": "/profile/Praveen-Panishetti"
                },
                {
                    "user_id": "Michael Marshall",
                    "user_href": "/profile/Michael-Marshall-34"
                },
                {
                    "user_id": "Edward Conway",
                    "user_href": "/profile/Edward-Conway"
                },
                {
                    "user_id": "Matthew Bond",
                    "user_href": "/profile/Matthew-Bond-9"
                }
            ]
        },
        {
            "author_info": {
                "name": "Paul Leask",
                "href": "/profile/Paul-Leask"
            },
            "answer_text": "It depends on the story being told. Some stories suit the player agency, such as Spec Ops: The Line, or a game about discovery. Other stories will find videogames too unfocused. There is no best medium for any story, even living through the story can suffer without all the relevant information available to explain it. Videogames are just one way to tell a story, and sometimes that works best. ",
            "date": "Answered October 9, 2018",
            "views": "121",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Ahmad Fakih",
                    "user_href": "/profile/Ahmad-Fakih-6"
                }
            ]
        }
    ]
}