{
    "title": "Can we really find friends among books? - Quora",
    "tags": [
        "Self-Help Books",
        "Friendship",
        "Books"
    ],
    "response": [
        {
            "author_info": {
                "name": "Aditya Veer Singh",
                "href": "/profile/Aditya-Veer-Singh"
            },
            "answer_text": "My answer would be no. The reason is the passivity of books. We are humans and we need some kind of feedback loop to express ourselves completely. If you have people in life who can play role of friends like parents, colleagues, then it is fine. But living alone for humans is not easy. Even with books, you are trying to link with the author but it is one-way communication as you are not expressing yourself and no one is acknowledging you. Both are needed for us. Now if the question is can someone spend their whole life without friends, then may be yes. But I find it very difficult and the person needs to be very courageous to do so. ",
            "date": "Answered October 8, 2014",
            "views": "136",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Shobhit Sodhi",
                    "user_href": "/profile/Shobhit-Sodhi"
                }
            ]
        },
        {
            "author_info": {
                "name": "Paritosh Verma",
                "href": "/profile/Paritosh-Verma-1"
            },
            "answer_text": "Well yeah I guess. We meet friends during circumstances good and bad. Similarly you have books, knowledge books to support you, literature/ novels as leisure (,or vice versa). Just like a cup of tea at a small shop with a good friend makes an unforgettable experience, reading something that can intrigue you once has the ability to give you pleasure forever.. ",
            "date": "Answered October 9, 2014",
            "views": "97",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "ShAch NuTul",
                "href": "/profile/ShAch-NuTul"
            },
            "answer_text": "In friendship you encounter disappointments but in books you encounter enormous knowledge, beauty that you never imagined, lines which you can fallow, suspenses n all etc. So you definitely find good frnd among books.Thank for A2a ",
            "date": "Answered October 17, 2014",
            "views": "159",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Preeti Meena",
                "href": "/profile/Preeti-Meena"
            },
            "answer_text": "Why not ?...books are man' best friend.  They give us so much knowledge .they never leave us. They can help us by guiding. They are not emotionally attached to u . ",
            "date": "Answered October 11, 2014",
            "views": "72",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Jitin Ginotra",
                "href": "/profile/Jitin-Ginotra"
            },
            "answer_text": "Of course in my life they are the only one who(what) matters non - judgemental .... but don't go away from reality make friends there too not okay kind but really good ",
            "date": "Answered October 8, 2014",
            "views": "46",
            "upvotes": "0"
        }
    ]
}