{
    "title": "Can books increase in value with age (specifically, can books be considered antiques like cars and coins can)? - Quora",
    "tags": [
        "Antiques"
    ],
    "response": [
        {
            "author_info": {
                "name": "Debra Harrison",
                "href": "/profile/Debra-Harrison-49"
            },
            "answer_text": "Books can increase in value with age, certainly. The real measure of the value of a book lies in its rarity, how well known it became, and in the author who wrote it (or if it won any prizes like a Pulitzer, etc). The first edition of a title can have more value as can an author-signed book. The first book by an author who later became famous and very well known can be valuable as the first book was most likely not published in any great quantity. Very old books can have value both due to the age of the book but also due to the rarity of the book in today’s world. ",
            "date": "Answered August 11, 2020",
            "views": "925",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Areesh Shah",
                    "user_href": "/profile/Areesh-Shah"
                },
                {
                    "user_id": "Hareem Tayyab",
                    "user_href": "/profile/Hareem-Tayyab-1"
                },
                {
                    "user_id": "Jc Djenkal",
                    "user_href": "/profile/Jc-Djenkal"
                },
                {
                    "user_id": "Julien Delvat",
                    "user_href": "/profile/Julien-Delvat"
                }
            ]
        },
        {
            "author_info": {
                "name": "Anna OBrien",
                "href": "/profile/Anna-OBrien"
            },
            "answer_text": "Yes. However it only certain types of books. The value of an antique book depends on several things.  The number of copies of the book in circulation. The less existing copies of a book, the more value it holds.The edition of the book: a first edition of a popular book is worth more than subsequent editions.Condition and quality of the book: Obviously the more pristine the book is the better it's resale value in the future.Author signature: especially if the author gives limited amount of signatures.Previous owner: If a book has a famous owner who has made liner notes, the book may gain value Continue Reading",
            "date": "Updated January 10, 2011",
            "views": "0",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Boudewijn Meijer",
                "href": "/profile/Boudewijn-Meijer"
            },
            "answer_text": "Not to forget that market demand greatly influences the value to.For example taking points 1 to 5 into consideration, a 17th century bible will on a whole be less valuable, financially wise, than a 5th edition of Ortelius' Theatrum Orbis Terrarum. ",
            "date": "Answered January 24, 2011",
            "views": "184",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "John Goetz",
                    "user_href": "/profile/John-Goetz-15"
                }
            ]
        }
    ]
}