{
    "title": "Can ebooks take the place of real books in the future? - Quora",
    "tags": [
        "The Future",
        "eBooks"
    ],
    "response": [
        {
            "author_info": {
                "name": "Eivind Kjørstad",
                "href": "/profile/Eivind-Kjørstad"
            },
            "answer_text": "They already have. This happened a couple years ago, and by now what's left is the mopping up. Those of us with a few decades behind us, will remember having heard this discussion several times before. You can still, if you try, buy film-based as opposed to digital cameras; and get the films developed. It's a hassle, and really only for enthusiasts, but you can. The real battle between these formats is however long over. Convenience and features won, and they did so EVEN at a point where quality was still on the side of film. Features like being able to see the images instantly, and being able to conveniently and easily share the images with people across computer-networks trumphed disadvantages in quality, and today, of course, the quality too is excellent. You can still buy music on CD or on LP, and some people do so, but nevertheless it's clear to most people that the future of music is digital and online. (yes I'm aware that CDs are digital) The same story repeated here: people changed from listening to CDs and to mp3s at a point in time where the latter had inferior quality. Because conveniences like being able to carry a 1000-song library in your pocket trumped pure quality. Today, we're seeing the same question again, this time about books. And people will field the same arguments again. A ebook-reader is not as pleasant on the eyes as a paperbook, they will say. It lacks the tactile FEEL of a book, they will say. And they'll be right. Except they'll fail to notice that the same arguments are RIGHT if you're comparing a LP-record to a mp3-file too, and yet that helped not at all. Ebooks have convenience-features that paperbooks quite simply can't compete with. This is true even today, and it's getting MORE true with every passing month. This battle is over; even though you'll probably be able to purchase paper books, especially large-format color-print books for decades to come. Among those advantages are: Portability. You can store thousands of books on a pocket-sized device, rather than need to fill every room of your house with bookshelves.Availability. Millions of books available for instant purchase and instant reading, even if I'm in some tiny village somewhere, as long as Internet is available in some form. (even slow internet will do!)Ebooks can comfortably be read in the dark due to built-in backlight.Highlights and quotes can be marked, and are instantly available for you complete with correct quotation. This is a life-saver for anyone doing reading for research, and REALLY neat for students of all kinds too.More social; because you can (if you like) share favourite quotes with your friends, ask for book-recommendations and/or read what your friends think about the books. Now you CAN do this with paper-books too, it's just more of a hassle.Cheaper. Paperbooks go trough several cost-inducing steps AFTER the final proofread manuscript is done. Printing, binding and distributing paper costs money, and consequently eBooks will be cheaper -- even if the author and editor still earns the same per book sold. (and it's possible they can make do with less per copy if the lower costs results in higher sales measured in units)Safer. My physical books are at risk from things like fire. My electronic books can easily be backed up; they take a trivial amount of space, and so storing several copies of them for safeguarding is a easy and effortless thing to do.",
            "date": "Updated May 17, 2016",
            "views": "34",
            "upvotes": " View 26 Upvoters",
            "upvoters": [
                {
                    "user_id": "En Shqip",
                    "user_href": "/profile/En-Shqip"
                },
                {
                    "user_id": "Aksingh BZ",
                    "user_href": "/profile/Aksingh-BZ"
                },
                {
                    "user_id": "Marcelo Leão",
                    "user_href": "/profile/Marcelo-Leão-3"
                },
                {
                    "user_id": "Amanda Lovell",
                    "user_href": "/profile/Amanda-Lovell-1"
                },
                {
                    "user_id": "Nirupam Banerjee",
                    "user_href": "/profile/Nirupam-Banerjee-2"
                },
                {
                    "user_id": "月 无",
                    "user_href": "/profile/月-无-1"
                },
                {
                    "user_id": "Mohammad Zahed",
                    "user_href": "/profile/Mohammad-Zahed"
                },
                {
                    "user_id": "Raphy Eldad",
                    "user_href": "/profile/Raphy-Eldad-1"
                },
                {
                    "user_id": "Paul Ryberg",
                    "user_href": "/profile/Paul-Ryberg"
                },
                {
                    "user_id": "Alaina Helena Rutan",
                    "user_href": "/profile/Alaina-Helena-Rutan"
                },
                {
                    "user_id": "Richard Ure",
                    "user_href": "/profile/Richard-Ure"
                },
                {
                    "user_id": "Pam Berkeley",
                    "user_href": "/profile/Pam-Berkeley"
                },
                {
                    "user_id": "Sarah Amalie Lerstrøm Margolin",
                    "user_href": "/profile/Sarah-Amalie-Lerstrøm-Margolin"
                },
                {
                    "user_id": "Nadeesha Rathnayake",
                    "user_href": "/profile/Nadeesha-Rathnayake"
                },
                {
                    "user_id": "Zoe Xiao",
                    "user_href": "/profile/Zoe-Xiao-2"
                },
                {
                    "user_id": "Emma Homes",
                    "user_href": "/profile/Emma-Homes"
                },
                {
                    "user_id": "Alva Lindvall",
                    "user_href": "/profile/Alva-Lindvall"
                },
                {
                    "user_id": "Sumathi S",
                    "user_href": "/profile/Sumathi-S-96"
                },
                {
                    "user_id": "Rohit Dwivedula",
                    "user_href": "/profile/Rohit-Dwivedula"
                },
                {
                    "user_id": "Raghuraj Hegde",
                    "user_href": "/profile/Raghuraj-Hegde"
                },
                {
                    "user_id": "Subrahmanya Hegde",
                    "user_href": "/profile/Subrahmanya-Hegde"
                },
                {
                    "user_id": "Thepnathi Stephenson",
                    "user_href": "/profile/Thepnathi-Stephenson"
                },
                {
                    "user_id": "Peter Griffiths",
                    "user_href": "/profile/Peter-Griffiths-7"
                },
                {
                    "user_id": "Nikhil Prabhu",
                    "user_href": "/profile/Nikhil-Prabhu-1"
                },
                {
                    "user_id": "Heather Jedrus",
                    "user_href": "/profile/Heather-Jedrus"
                },
                {
                    "user_id": "Arun",
                    "user_href": "/profile/Arun-880"
                }
            ]
        },
        {
            "author_info": {
                "name": "Ani Harutyunyan",
                "href": "/profile/Ani-Harutyunyan-17"
            },
            "answer_text": "Nowadays, almost everywhere we go, we encounter people with tablets who are reading them. People prefer to use e-books, as they became trendy and convenient things for those who do not want to carry a big book. And to the question is, whether the e-books can replace paper books I would answer YES? First of all, let’s define what an “e-book” is. “E-book” is an electronic version of a printed book which can be read on a computer or a specially designed handheld device. People carry it everywhere, as it is precisely very convenient for those people who are busy all day, and have no time to go to a bookstore, or to carry many books around. The advantages of the e-book are many; It is straightforward and easy to purchase and download e-books through the Internet, no trees are required to manufacture paper for the pages of e-books and so forth. However, many people put into a question, whether they are as useful as paper books. Since the 1980s there have been hundreds of debates about what is actually better for the human brain: to read ink on the paper or to read from the screen of the tablet. More than a hundred investigations have been dedicated to this topic, and the results are diverse. Moreover, an interesting experiment has been applied to finally understand whether there is a difference between reading on a screen or a real book. A 2013 Norwegian study of the reading pattern showed that students who read a real, physical book scored much better in reading awareness than those who read texts digitally. This is connected with the fact that paper gives spatiotemporal markers; the touching of the paper and the act of shifting pages serve as memory markers that are absent while scrolling down an electronic screen. In two separate 2013 and 2014 studies, one of the school pupils and one of the grown-ups, Anne Mangenand, a professor at the University of Stavanger in Norway gave groups of people with similar reading skills several texts to read, with half reading electronic and half reading text on an actual paper. Afterward, the readers completed a test to gauge reading comprehension. Eventually, the people who read the texts electronically did worse than their paper reading counterparts. ",
            "date": "Answered April 8, 2019",
            "views": "921",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Juggernaut Books",
                "href": "/profile/Juggernaut-Books-3"
            },
            "answer_text": "There’s no substituting the feeling one gets as they flip a page or underline an interesting quote using a pencil. As of now, several market reports suggest that paperbacks are enjoying a revival while there’s either a dip in eBook sales or a flattening. It’s not very surprising, one could argue that since technology has invaded almost every sphere of human life, there are certain activities people prefer the old-school way, like reading books.  But it would be rash to dismiss eBooks so quickly. Here are some factors you ought to keep in mind— 1. Self-Publishing: With the rise of the internet and social media, self-publishing has become easier than ever. Over a million books are self-published every year, a considerable chunk of which are eBooks. Many stats simply consider ISBNs issues and conclude that eBooks are on the decline, but they ignore a very crucial chunk of books out there—those on self-publishing platforms. For instance, Amazon’s KDP that assigns its own number (ASIN) to books, not to mention websites like Wattpad and Juggernaut that offer readers both free and paid books. 2. The Young Readership: The older generation might face occasional hiccoughs when it comes to adopting technology, but not the new one. Their life is closely tied to the devices they use and most of them are pretty comfortable with technology. Reading on a screen feels natural to them. Be it for entertainment-related or educational purposes, youngsters are comfortable whipping out their phone and reading stuff. No wonder reading apps are on the rise and even print media has taken to opening their online counterparts. 3. Others: In general, technology has invaded many aspects of our life and we’re moving towards a no-paper era where more and more things are being digitized. Not to mention, eBooks are a great option for those who are low on space and budget. Things like accessibility become even less of a problem. Students no longer have to scour their college library for hours and bemoan the fact that the book they wanted is unavailable. Everything is available—thanks to the internet. To conclude, it would be rash to claim that paperbacks have no future, that’s not true. They are probably here to stay. But it would also be presumptuous to underestimate eBooks. The need of the hour is to revolutionize reading itself. To take both paperbacks and eBooks, harnessing the power of the internet to access the large digital audience. This is what we at Juggernaut do. Our founder, Chiki Sarkar, recognized the potential of the internet and decided to bring together self-publishing, paperback publishing, and eBooks. On our writing platform, writers both new and old post their work and have it read by millions of smartphone users in India. We also have a publishing wing, open to book proposals. Not only do our expert editors sift through the hundreds of manuscripts they receive, but we also select five new authors from our writing platform every month and develop their book for formal publishing. Lastly, we bring together all these books on our reading app and give people the chance to consume quality content at extremely affordable rates, some even for free! ",
            "date": "Answered June 26, 2019",
            "views": "585",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Jonathan Todd",
                "href": "/profile/Jonathan-Todd-4"
            },
            "answer_text": "To a large extent, probably. But eBooks will Never entirely replace Physical books. We are a perverse stubborn species, we hang on to things long after they are replaced by other newer Technologies. We call ourselves Collectors while we stockpile relics of centuries past, how else can you explain people who still own and lovingly maintain 14th century or older Swords, or other similar relics. Now, eBooks will much faster replace periodicals, though not comic books (collectors again) and paperbound (Trade paperback and mass market paperback) they will even once they get eBooks up to a decent editing standard replace reference materials (already a considerable number of encyclopedia, Dictionaries, and even college level textbooks are digital) but there will still be a niche market for legacy binding physical books for the foreseeable future. /rant What I feel, and I have said this before in other places hurts acceptance of eBooks is that there isn’t a single format usable by all readers, now there are projects like Project Gutenberg working with open domain titles to make them available in the widest number of formats but there remains a vast number of titles not yet in open domain not available in any digital format, in addition to a large number only available in one or two niche formats. Additionally there is the editing problem. I have a large-ish collection of books including a considerable number in physical and electronic form. Far too frequently, serious errors crept into the digital editions, misplaced entire pages, entire chapters, words replaced with words that sound the same but mean entirely different things, or misspelled, or just gibberish. I would understand if these were from the above mentioned Gutenberg project but no, this is from major publishers and new books /off rant ",
            "date": "Answered January 7, 2018",
            "views": "19",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Annette Iszler",
                    "user_href": "/profile/Annette-Iszler"
                },
                {
                    "user_id": "Satyaprakash Jena",
                    "user_href": "/profile/Satyaprakash-Jena-5"
                },
                {
                    "user_id": "Martyn Pentecost",
                    "user_href": "/profile/Martyn-Pentecost"
                },
                {
                    "user_id": "Simon Atford",
                    "user_href": "/profile/Simon-Atford"
                }
            ]
        },
        {
            "author_info": {
                "name": "Dushka Zapata",
                "href": "/profile/Dushka-Zapata"
            },
            "answer_text": "I adore e books. I walk into a bookstore, say, at the airport, look at books that intrigue me and download samples as I walk around. I get on the plane and read them; deleting the ones I don’t want, keeping the ones I do to buy “later” (the more honest word is “soon”.) I often buy the physical copy of the book when I get to my destination. Having read the sample, I know exactly what I want.  Or, a friend recommends a book and instead of making a note of it I immediately download the first chapter, feeling giddy. Or, I’m in my Sunday spot (my sofa) reading book reviews, downloading samples of recommended books that interest me.  I can own any book in the world in seconds without ever leaving my house. I don’t even have to turn on my computer. And it doesn't feel like a purchase. It feels like....well, a download. (Oh oh.) There's more. If you’re reading a book and come across a word you don’t know the meaning of, you can look it up. This has prompted me to look up words even when I do know what they mean, because it’s so quick and easy I can satisfy my curiosity about, say, their etymology. (Did you know that \"disaster\" means \"ill-starred event\" because it was believed a disaster was caused by the position of the stars?) If I wake up with insomnia at 3:00 a.m. I can read the New York Times before it even is available in print. Books that aren’t the latest bestsellers can be yours (in under a minute) for a dollar or two.  I can send a book to a friend via email, instantly.  I can carry hundreds of books at one time, take notes, “clip” pages and archive them (in order), and listen to music. Or, use the “search” feature to find anything online. (What are the seven deadly sins? Give me a second.) Books have their own kind of magic. I like their smell and heft and how the paper feels in my hand. Fortunately for everyone, this is not binary. I don't have to choose, nor replace. I can read a book any time I want to, and use my e reader when I travel.  ",
            "date": "Answered May 9, 2016",
            "views": "202",
            "upvotes": " View 247 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Alan Dale",
                    "user_href": "/profile/Alan-Dale-26"
                },
                {
                    "user_id": "Joan Wolf",
                    "user_href": "/profile/Joan-Wolf-5"
                },
                {
                    "user_id": "David Clive Ramsey",
                    "user_href": "/profile/David-Clive-Ramsey"
                },
                {
                    "user_id": "Catia Silva",
                    "user_href": "/profile/Catia-Silva-2"
                },
                {
                    "user_id": "Hugh Cassidy",
                    "user_href": "/profile/Hugh-Cassidy-3"
                },
                {
                    "user_id": "Surbhi Saraf",
                    "user_href": "/profile/Surbhi-Saraf-3"
                },
                {
                    "user_id": "Sonali Sadhwani",
                    "user_href": "/profile/Sonali-Sadhwani"
                },
                {
                    "user_id": "Piyush Kant",
                    "user_href": "/profile/Piyush-Kant-4"
                },
                {
                    "user_id": "Kinnu Singh",
                    "user_href": "/profile/Kinnu-Singh-1"
                },
                {
                    "user_id": "James Shabani",
                    "user_href": "/profile/James-Shabani"
                },
                {
                    "user_id": "Thomas Robert Wade",
                    "user_href": "/profile/Thomas-Robert-Wade"
                },
                {
                    "user_id": "Keerthana Sankar",
                    "user_href": "/profile/Keerthana-Sankar-5"
                },
                {
                    "user_id": "Anand Sharma",
                    "user_href": "/profile/Anand-Sharma-256"
                },
                {
                    "user_id": "Tianbo Hao",
                    "user_href": "/profile/Tianbo-Hao-1"
                },
                {
                    "user_id": "Nitanshu Baranwal",
                    "user_href": "/profile/Nitanshu-Baranwal"
                },
                {
                    "user_id": "Merve Nuhana",
                    "user_href": "/profile/Merve-Nuhana"
                },
                {
                    "user_id": "Lucas Mendes",
                    "user_href": "/profile/Lucas-Mendes-8"
                },
                {
                    "user_id": "Eliza Bradshaw",
                    "user_href": "/profile/Eliza-Bradshaw"
                },
                {
                    "user_id": "A Federico Osuna Hdez",
                    "user_href": "/profile/A-Federico-Osuna-Hdez"
                },
                {
                    "user_id": "Chithra Ramachandran",
                    "user_href": "/profile/Chithra-Ramachandran"
                },
                {
                    "user_id": "Latika Sharma",
                    "user_href": "/profile/Latika-Sharma-18"
                },
                {
                    "user_id": "Rutuja Ghanekar",
                    "user_href": "/profile/Rutuja-Ghanekar"
                },
                {
                    "user_id": "Toni Lichtenstein Bogolub",
                    "user_href": "/profile/Toni-Lichtenstein-Bogolub"
                },
                {
                    "user_id": "Alok Ranjan",
                    "user_href": "/profile/Alok-Ranjan-237"
                },
                {
                    "user_id": "Shruthi Sailesh",
                    "user_href": "/profile/Shruthi-Sailesh"
                },
                {
                    "user_id": "Arabella Prinz",
                    "user_href": "/profile/Arabella-Prinz"
                },
                {
                    "user_id": "Divya Medicherla",
                    "user_href": "/profile/Divya-Medicherla"
                },
                {
                    "user_id": "Amal",
                    "user_href": "/profile/Amal-183"
                },
                {
                    "user_id": "Swetha Revanur",
                    "user_href": "/profile/Swetha-Revanur"
                },
                {
                    "user_id": "Savitha Vaidyanathan",
                    "user_href": "/profile/Savitha-Vaidyanathan"
                },
                {
                    "user_id": "Maryam Atif",
                    "user_href": "/profile/Maryam-Atif-2"
                },
                {
                    "user_id": "Joseph Roberts",
                    "user_href": "/profile/Joseph-Roberts-19"
                },
                {
                    "user_id": "Fathima Zahra",
                    "user_href": "/profile/Fathima-Zahra-7"
                },
                {
                    "user_id": "Sherry Rosenwein",
                    "user_href": "/profile/Sherry-Rosenwein"
                },
                {
                    "user_id": "Miguel Alejandro Morales",
                    "user_href": "/profile/Miguel-Alejandro-Morales"
                },
                {
                    "user_id": "Sangita Mahanti",
                    "user_href": "/profile/Sangita-Mahanti"
                },
                {
                    "user_id": "Husain Thanawala",
                    "user_href": "/profile/Husain-Thanawala"
                },
                {
                    "user_id": "Nor Fazirra",
                    "user_href": "/profile/Nor-Fazirra"
                },
                {
                    "user_id": "Mary Ella",
                    "user_href": "/profile/Mary-Ella-1"
                },
                {
                    "user_id": "Anshul Aashish",
                    "user_href": "/profile/Anshul-Aashish"
                },
                {
                    "user_id": "Anton Mies",
                    "user_href": "/profile/Anton-Mies"
                },
                {
                    "user_id": "Evelyn MacPhee",
                    "user_href": "/profile/Evelyn-MacPhee"
                },
                {
                    "user_id": "Natha Khistariya",
                    "user_href": "/profile/Natha-Khistariya"
                },
                {
                    "user_id": "G. Kaneeshiya Valantaine",
                    "user_href": "/profile/G-Kaneeshiya-Valantaine"
                },
                {
                    "user_id": "Neetu Choubey",
                    "user_href": "/profile/Neetu-Choubey"
                },
                {
                    "user_id": "Dorian Ranger",
                    "user_href": "/profile/Dorian-Ranger"
                },
                {
                    "user_id": "Thara Merrygold",
                    "user_href": "/profile/Thara-Merrygold-2"
                },
                {
                    "user_id": "Sharon Leo",
                    "user_href": "/profile/Sharon-Leo"
                },
                {
                    "user_id": "Aishwarya Jaishankar",
                    "user_href": "/profile/Aishwarya-Jaishankar-2"
                },
                {
                    "user_id": "Sonal Batra",
                    "user_href": "/profile/Sonal-Batra-2"
                },
                {
                    "user_id": "Shriya Garg",
                    "user_href": "/profile/Shriya-Garg"
                },
                {
                    "user_id": "Neha Mulani",
                    "user_href": "/profile/Neha-Mulani"
                },
                {
                    "user_id": "Rohit Dwivedula",
                    "user_href": "/profile/Rohit-Dwivedula"
                },
                {
                    "user_id": "Nandakishor Desai",
                    "user_href": "/profile/Nandakishor-Desai"
                },
                {
                    "user_id": "Sharmila A",
                    "user_href": "/profile/Sharmila-A-11"
                },
                {
                    "user_id": "Shubham Srivastava",
                    "user_href": "/profile/Shubham-Srivastava-8"
                },
                {
                    "user_id": "Manishankar Singh",
                    "user_href": "/profile/Manishankar-Singh-1"
                },
                {
                    "user_id": "Vyoma Madaan",
                    "user_href": "/profile/Vyoma-Madaan"
                },
                {
                    "user_id": "Kavya GN",
                    "user_href": "/profile/Kavya-GN"
                },
                {
                    "user_id": "Dhananjay Singh",
                    "user_href": "/profile/Dhananjay-Singh-103"
                },
                {
                    "user_id": "Justin Gabriel",
                    "user_href": "/profile/Justin-Gabriel-2"
                },
                {
                    "user_id": "Itisha Singh",
                    "user_href": "/profile/Itisha-Singh-6"
                },
                {
                    "user_id": "Ameya Limaye",
                    "user_href": "/profile/Ameya-Limaye"
                },
                {
                    "user_id": "Payoja Gajenndra",
                    "user_href": "/profile/Payoja-Gajenndra"
                },
                {
                    "user_id": "Girish Shetty",
                    "user_href": "/profile/Girish-Shetty-7"
                },
                {
                    "user_id": "Surabhi Verma",
                    "user_href": "/profile/Surabhi-Verma-3"
                },
                {
                    "user_id": "Gourav Namta",
                    "user_href": "/profile/Gourav-Namta"
                },
                {
                    "user_id": "Saurabh Priyadarshi",
                    "user_href": "/profile/Saurabh-Priyadarshi-10"
                },
                {
                    "user_id": "Sawan Darak",
                    "user_href": "/profile/Sawan-Darak"
                },
                {
                    "user_id": "Rahul Gupta",
                    "user_href": "/profile/Rahul-Gupta-1818"
                }
            ]
        },
        {
            "author_info": {
                "name": "Zeel Patel",
                "href": "/profile/Zeel-Patel-14"
            },
            "answer_text": "Aha! Books *_* Thanks for the interesting question Anjali di :) The mesmerizing smell of books- Ah! Isn't it enough to fall in love with the books in a moment?! Yes, it's not the only thing that attracts us towards books. Actually they are not just the books, they are emotions and this basket of emotions comes with varieties of life. They fill the canvas of life with amazing colours of memories, sorrows, smiles, fears, confidence and what not! They are the unbreakable parts of our lives. But the time changes and so do the things. E-books are somehow the new trend, new refreshment(?). But, will they replace our paper books? Can they take place in our heart which has been locked by our lovable paper books? The answer simply goes for a NO. Old is gold! Some things cannot be replaced. Before concluding why paper books are one step ahead in our mind, check out some pros of ebooks. Okay, so they are easy going and flexible, then their hassle free attitude. We can carry a portable library within it. And imagine the hundreds of books stored in a single place. It's just so casual and comfortable.Well, if ebooks come up with such ease then why do we still tend to fall for the paper books? The answer is we miss so many things in the case of e-books! Umm… Didn't agree?  Let me take you to the world of books and memories then. Reverse psychology is in our blood. It's the funny human tendency to do the exact opposite from the thing which is to be done. We apply our psychology here also. Our mind strikes us, “hey, open the first page.” But, no… We don't give a damn. We will turn the book and always open the last page! Our resisting power becomes zero. Haha, but still it's fun, isn't it? We always keep turning the pages what is next, what is next! And sometimes also end up revealing the suspense and then scolding ourselves. And that eagerness- how many pages are left? Still 30! Still 20… That feeling when we complete our book! Oh, it left something heavy. We think, “ now what is the upcoming thing? The journey with my book is over.” It left some emptiness but that emptiness is what we need at the time. It's adorable I guess.  Then those butterflies in your stomach or rather a zoo itself, when we are just about to start our favourite book. A train of thoughts keep running in our minds, “how will the book be- as per my expectations? What about the characters?” And this eagerness, butterflies are missing in the company of e-books!When we read the books, we are not just reading. We feel each and every character, we try to put ourselves in the shoes of the characters. Words are magical. But, somehow digital thing ruins this crisp.So, it's not just phases, it's a relation, it's a beautiful journey. You know what is the best thing about books? The box of memories. When you look at your mini library in the house and sometimes you are just lost in the precious past with these books. You tend to take out a book and recollect the golden days with the book. Then you take out another one and again the loop continues. Books give us a chance to experience the thrill in life. Yes, I am not kidding. Remember the childhood days, when you used to hide these books inside textbooks and faking like you are reading your textbook, but actually you would be reading your book. When you come down or go to another room at late night to lessen your curiosity about book and want to read at late night. When you are spending more and more time with your books in a library or a corner in your house- just you and your book, for hours and hours.And the frustrating part is whenever you are reading some interesting topic or chapter, only at that time someone will call you or ask you to do some work. I literally feel like killing them at that time. And those moments when you are half leaned on your sofa and go to a deep sleep while reading. You are asleep in the same position with the book on your head or in your hand. What a satisfaction that sleep gives us. Will those virtual books ever give this thrill? Never. And that craziness and obsession for the attracting cover pages and amazing collection of bookmarks! You won't find this craziness with those e-books.This recollecting your past with books is missing while walking in the land of e-books. You may have a numbers of books in your kindle but there is no point as they are not able to make you realize the charm of your past, your quality time with books.Then, those magnetism of yellow pages! To read a book with yellow pages gives you some extraordinary feeling. From where will you find this oomph in your boring kindle? You just swap and read, swap and read. You take utmost care that any of the pages doesn't get torn. And if someone even mistakenly tears or folds the page, abort the mission to explain the person anything. I repeat abort the mission! Paper books makes you more classy. Yeah, I mean it- roaming with a book totally carefree. And roaming around with your kindles?!- It's just the tedious common thing. People will call you a nerd with books. But, being a book lover you would love it.  Being with books is an awesome thing. If you are lonely and want to go on a date- don't worry! Books are there for you. Imagine the scene when it's raining and you are reading a book in the balcony with a cup of coffee. It would be the best date ever. And will the e-books ever be able to create this lively atmosphere and beautiful evening? No.  It's fun to tease someone that I own this book and make the one jealous. It's kind of show off. Then that jugaad factor when we don't have a particular book and apply some jugaad to get the book. Jugaad is the common Indian talent. When you go to buy a book, nah you don't buy just one. You will be confused which should be taken, which should be left for the next time and finally you end up buying more than 2-3 books. Reading a paper book is so flawless. Everything seems to be in its place and happens to a great song of correctly tuned music. Our kindles don't know this music between a reader and a book. You struggle with every word to be concentrated  on the digital screen. E-books can't replace paper books anyhow! Digital words are emotionless. Technology cannot carry the feelings. It's tacit. Maybe you increase the ease but you will decrease so much flavours that books bring. And a life without flavours and emotions is useless. ",
            "date": "Answered May 9, 2016",
            "views": "76",
            "upvotes": " View 43 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Aksingh BZ",
                    "user_href": "/profile/Aksingh-BZ"
                },
                {
                    "user_id": "Kenny Shen",
                    "user_href": "/profile/Kenny-Shen-10"
                },
                {
                    "user_id": "Dat Nguyen",
                    "user_href": "/profile/Dat-Nguyen-595"
                },
                {
                    "user_id": "Ellen Whitherways",
                    "user_href": "/profile/Ellen-Whitherways"
                },
                {
                    "user_id": "Senthamil Selvi G",
                    "user_href": "/profile/Senthamil-Selvi-G"
                },
                {
                    "user_id": "Le Kim Thu",
                    "user_href": "/profile/Le-Kim-Thu"
                },
                {
                    "user_id": "Bharath DS",
                    "user_href": "/profile/Bharath-DS-5"
                },
                {
                    "user_id": "Minli Wen",
                    "user_href": "/profile/Minli-Wen"
                },
                {
                    "user_id": "Ananya Khandelwal",
                    "user_href": "/profile/Ananya-Khandelwal"
                },
                {
                    "user_id": "Arun Kumar",
                    "user_href": "/profile/Arun-Kumar-14946"
                },
                {
                    "user_id": "Mayank Bhardwaj (मयंक भारद्वाज)",
                    "user_href": "/profile/Mayank-Bhardwaj-मयंक-भारद्वाज-1"
                },
                {
                    "user_id": "Solanki Vikram",
                    "user_href": "/profile/Solanki-Vikram"
                },
                {
                    "user_id": "Jatinder Singh",
                    "user_href": "/profile/Jatinder-Singh-337"
                },
                {
                    "user_id": "Karthick Sherly",
                    "user_href": "/profile/Karthick-Sherly"
                },
                {
                    "user_id": "Vipul",
                    "user_href": "/profile/Vipul-221"
                },
                {
                    "user_id": "Priyanka",
                    "user_href": "/profile/Priyanka-1363"
                },
                {
                    "user_id": "Adita Subrahmanyan",
                    "user_href": "/profile/Adita-Subrahmanyan"
                },
                {
                    "user_id": "Himani Patel",
                    "user_href": "/profile/Himani-Patel-17"
                },
                {
                    "user_id": "Digant Patel",
                    "user_href": "/profile/Digant-Patel-4"
                },
                {
                    "user_id": "Sheri Fresonke Harper",
                    "user_href": "/profile/Sheri-Fresonke-Harper"
                },
                {
                    "user_id": "Divyesh Kateliya",
                    "user_href": "/profile/Divyesh-Kateliya"
                },
                {
                    "user_id": "Rakshit Soral",
                    "user_href": "/profile/Rakshit-Soral-2"
                },
                {
                    "user_id": "Harish Varma",
                    "user_href": "/profile/Harish-Varma-25"
                },
                {
                    "user_id": "Srikanth",
                    "user_href": "/profile/Srikanth-344"
                },
                {
                    "user_id": "Sandip Badad",
                    "user_href": "/profile/Sandip-Badad"
                },
                {
                    "user_id": "Nikita",
                    "user_href": "/profile/Nikita-45"
                },
                {
                    "user_id": "Vansh Shah",
                    "user_href": "/profile/Vansh-Shah-1"
                },
                {
                    "user_id": "Malini Rajendra",
                    "user_href": "/profile/Malini-Rajendra"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/Aragão"
                },
                {
                    "user_id": "Anusha Sridharan",
                    "user_href": "/profile/Anusha-Sridharan-5"
                },
                {
                    "user_id": "Sagar Dobariya",
                    "user_href": "/profile/Sagar-Dobariya"
                },
                {
                    "user_id": "Tapasweni Pathak",
                    "user_href": "/profile/Tapasweni-Pathak"
                },
                {
                    "user_id": "Abhash Roy",
                    "user_href": "/profile/Abhash-Roy"
                },
                {
                    "user_id": "Anil Maurya",
                    "user_href": "/profile/Anil-Maurya-19"
                },
                {
                    "user_id": "soilen.org",
                    "user_href": "/profile/soilen-org-1"
                },
                {
                    "user_id": "Vraj Patel",
                    "user_href": "/profile/Vraj-Patel-17"
                },
                {
                    "user_id": "Sreevani Vasudevan",
                    "user_href": "/profile/Sreevani-Vasudevan"
                },
                {
                    "user_id": "Aakash Rathi",
                    "user_href": "/profile/Aakash-Rathi-5"
                },
                {
                    "user_id": "Shivan Patel",
                    "user_href": "/profile/Shivan-Patel"
                },
                {
                    "user_id": "Shailaja Pandya",
                    "user_href": "/profile/Shailaja-Pandya"
                },
                {
                    "user_id": "Sameera K",
                    "user_href": "/profile/Sameera-K-20"
                },
                {
                    "user_id": "Anjali Kriplani",
                    "user_href": "/profile/Anjali-Kriplani"
                },
                {
                    "user_id": "Dupinder Sandhu",
                    "user_href": "/profile/Dupinder-Sandhu"
                }
            ]
        },
        {
            "author_info": {
                "name": "Maja Burazin",
                "href": "/profile/Maja-Burazin-1"
            },
            "answer_text": "I don't think so. As long as people want to buy them, books will exist in the paper form. E-books already exist but I think that not many people would decide to read 300-page book, from the beginning to the end, from the computer or the e-book reader screen. It would be a draining torture for a lot of people. E-books amd tablets are great for some people, especially for reading recipes, news, e-mails or short literary forms, but who would like to read almost 900-page Anna Karenina from a tablet? The problem is that the screen light is artificial and some people simply hate looking at the screen for a long time. I believe that people get more tired when reading an e-book than when reading a paper book. Eyes hurt more. There is also a difference in the way that people read books and e-books. While reading a paper book people usually like to sit back in a cosy armchair or a sofa and enjoy the process. While reading an e-book, some people want to finish reading as soon as possible: they are skimming, scanning, scrolling down and skipping parts of texts or sentences just to get over with it. Therefore, comprehension suffers. Another thing that book lovers are missing when reading digital books is…paper. The smell of paper, the book covers, flipping the pages, putting cute page markers inside and the habit of underlining parts of texts. Paper books and coffee are two best friends.  E-books are perfect for business. Paper books are perfect for pleasure. ",
            "date": "Answered June 9, 2017",
            "views": "53",
            "upvotes": " View 13 Upvoters",
            "upvoters": [
                {
                    "user_id": "Eva Maria",
                    "user_href": "/profile/Eva-Maria-105"
                },
                {
                    "user_id": "Lida Sermpi",
                    "user_href": "/profile/Lida-Sermpi"
                },
                {
                    "user_id": "Andy Dyer",
                    "user_href": "/profile/Andy-Dyer-1"
                },
                {
                    "user_id": "Akash Bheekharry",
                    "user_href": "/profile/Akash-Bheekharry"
                },
                {
                    "user_id": "Edwin Ernst",
                    "user_href": "/profile/Edwin-Ernst"
                },
                {
                    "user_id": "Brian Clark",
                    "user_href": "/profile/Brian-Clark-114"
                },
                {
                    "user_id": "Pritha Mandal",
                    "user_href": "/profile/Pritha-Mandal-4"
                },
                {
                    "user_id": "Libby Spencer",
                    "user_href": "/profile/Libby-Spencer"
                },
                {
                    "user_id": "Jhon Robert Crebillo",
                    "user_href": "/profile/Jhon-Robert-Crebillo-1"
                },
                {
                    "user_id": "Sherzod Sheka",
                    "user_href": "/profile/Sherzod-Sheka"
                },
                {
                    "user_id": "Raja Reddy Kunduru",
                    "user_href": "/profile/Raja-Reddy-Kunduru"
                },
                {
                    "user_id": "Jennifer McCoy",
                    "user_href": "/profile/Jennifer-McCoy-13"
                },
                {
                    "user_id": "Nicolas Caro",
                    "user_href": "/profile/Nicolas-Caro"
                }
            ]
        },
        {
            "author_info": {
                "name": "Kensley Lewis",
                "href": "/profile/Kensley-Lewis"
            },
            "answer_text": "Eh, ebooks can take the place of paper books. However, I don’t believe they will ever fully replace paper books. For me, ebooks have completely replaced physical books, but only for ones that I don’t want to add to my physical collection. I have a personal library at home which consists of mostly free books, advanced copies of books, and those that I physically want for my collection (Harry Potter, Stephen King novels, LotR, etc). I use ebooks for all other reading, because half of the time my physical collection consists of books by a certain author that I want to have or books that I have already read. This also helps me save money, because I rarely buy books on my Kindle that aren’t on sale (Stephen King is the exception, and I also buy some of his books in print and Kindle because of the ease my Kindle gives me to read his big books) or I rent them from the library. It really boils down to a matter of preference and no matter how digital the world gets, ebooks won’t just replace paper books altogether. It would have to take a reality like Fahrenheit 451 for that to happen. ",
            "date": "Answered April 8, 2018",
            "views": "409",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Alaina Helena Rutan",
                    "user_href": "/profile/Alaina-Helena-Rutan"
                }
            ]
        },
        {
            "author_info": {
                "name": "Petar Atanasovski",
                "href": "/profile/Petar-Atanasovski"
            },
            "answer_text": "I don’t think that this will happen anytime soon, especially if we take a look at the statistics. eBooks user penetration is currently 10.5% and it is expected to hit 11.8% by 2022 (eBooks - worldwide | Statista Market Forecast). While the user penetration is still relatively low, sales attribution is not proportional to it - 25.8% buying of total book sales worldwide refers to e-book sales in 2018. More importantly, eBooks are definitely changing the industry and the way we write, publish, distribute, consume written words. Technology is moving the whole industry upfront and directing everything towards the end-users. If we look at the industry itself, there are a couple of things that I would love to highlight (taken from Britannica’s History of publishing): The history of publishing is characterized by a close interplay of technical innovation and social change, each promoting the other.Publishing as it is known today depends on a series of three major inventions—writing, paper, and printing—and one crucial social development—the spread of literacy.The invention of printing transformed the possibilities of the written word. Printing seems to have been first invented in China in the 6th century AD in the form of block printing. The Chinese invented movable type in the 11th century AD but did not fully exploit it. The invention of printing in Europe is usually attributed to Johannes Gutenberg in Germany about 1440–50, although block printing had been carried out from about 1400. Gutenberg’s achievement was not a single invention but a whole new craft involving movable metal type, ink, paper, and press. In less than 50 years it had been carried through most of Europe, largely by German printers.In that way, it’s safe to say that the whole industry was pretty much static from 15th to 21st century. And eBooks disrupted the publishing industry. Kids are now using tablets and smart phones since they are babies. This will affect the eBooks consumption and user penetration in the years to come for sure. I also wrote a blog post on Digital Publishing: eBooks Statistics Indicate Growing Popularity with a brief overview. ",
            "date": "Answered November 29, 2018",
            "views": "776",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Danilo Hadži-Pešić",
                    "user_href": "/profile/Danilo-Hadži-Pešić"
                },
                {
                    "user_id": "Nemanja Đošić",
                    "user_href": "/profile/Nemanja-Đošić"
                },
                {
                    "user_id": "Mladen Jordanov",
                    "user_href": "/profile/Mladen-Jordanov"
                }
            ]
        },
        {
            "author_info": {
                "name": "Dana Bills",
                "href": "/profile/Dana-Bills"
            },
            "answer_text": "While ebooks are far more convenient, physical books are much more stable. That stability is, in many ways, a safety that convenience can’t replace. On top of that, reference material being pulled from a book is often easier to access through physical books than through their electronic counterparts. Flipping back and forth through a physical book is still faster than doing the same electronically. There’s also the sensory aspect of books. Reading from an ebook allows you to read, but reading from a book incorporates all of the senses but taste (Except, of course, for infant/toddler books. They do wind up stimulating taste as well, though they’re rarely deliberately flavored.) Could ebooks entirely replace physical books right now? Yes. Should they? No, not at all. Ebooks and physical books fill different roles within the same sphere of influence. And, in the event of some critical catastrophe, the physical books are more likely to survive for those who need to pick up the pieces. That sounds like paranoia, but people still keep candles, lamps, and flashlights for when power is lost. We keep spare tires in cars just in case one blows. This is no different except that if the ability to access electronic data occurs for an extended period, the only way to fix it will be retained within the physical books that could have been replaced by electronic ones. ",
            "date": "Answered May 13, 2019",
            "views": "3",
            "upvotes": " View 4 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Andy Dyer",
                    "user_href": "/profile/Andy-Dyer-1"
                },
                {
                    "user_id": "Edem Cedar",
                    "user_href": "/profile/Edem-Cedar"
                },
                {
                    "user_id": "Elli Sutton",
                    "user_href": "/profile/Elli-Sutton-1"
                },
                {
                    "user_id": "Bila Kino",
                    "user_href": "/profile/Bila-Kino"
                }
            ]
        },
        {
            "author_info": {
                "name": "Nitya Muralidharan",
                "href": "/profile/Nitya-Muralidharan"
            },
            "answer_text": "Yes E-books have the potential to replace paper books Lot of people who argue otherwise are those who have grown with paper books , and so the idea  that they would become obsolete is unacceptable. But in the coming generations where children would spend more time on their gadgets than anything else , they would prefer everything in the electronic form , because they will not know any other form. Already there is a rise in E-book sales . A few reasons for choosing an E-book over a paper book are  Cost - E-books are cheaper than paper books any day, because after all they are nothing but large files.Environmental Concern: A sustainable future requires us to change our habits and shifting from paper books is one such change Portability : I f I wanted to carry a 1000 books to any place I travel ,an E-book would a better optionPaper books have an appeal that E-books don't , they are more real , for many of us they carry memories, the folded pages , the smell of old books , finding an old note,leaf or a feather pressed between pages, but charm and appeal are giving way to optimization as a future with a resource crunch looms ahead , no matter how much you re-cycle, there will always be  a requirement for new paper and that would mean taxing natural resources , in a few decades it will become a necessity to save trees and not a choice and so  E-books will not be an option but an only choice. ",
            "date": "Answered May 10, 2016",
            "views": "69",
            "upvotes": " View 44 Upvoters",
            "upvoters": [
                {
                    "user_id": "Daya Suvarna",
                    "user_href": "/profile/Daya-Suvarna-1"
                },
                {
                    "user_id": "Phoebe Michelle",
                    "user_href": "/profile/Phoebe-Michelle-2"
                },
                {
                    "user_id": "Rylinn Kubota",
                    "user_href": "/profile/Rylinn-Kubota"
                },
                {
                    "user_id": "Valerie Friera",
                    "user_href": "/profile/Valerie-Friera-1"
                },
                {
                    "user_id": "Ella Silkstone",
                    "user_href": "/profile/Ella-Silkstone-1"
                },
                {
                    "user_id": "Jocelyn Hins",
                    "user_href": "/profile/Jocelyn-Hins"
                },
                {
                    "user_id": "Ana Cerezo",
                    "user_href": "/profile/Ana-Cerezo-1"
                },
                {
                    "user_id": "Maria Hinsche",
                    "user_href": "/profile/Maria-Hinsche"
                },
                {
                    "user_id": "Cameron Gorki",
                    "user_href": "/profile/Cameron-Gorki"
                },
                {
                    "user_id": "Chriss Jazz",
                    "user_href": "/profile/Chriss-Jazz"
                },
                {
                    "user_id": "Mario Joe",
                    "user_href": "/profile/Mario-Joe-3"
                },
                {
                    "user_id": "Sara Alarcon",
                    "user_href": "/profile/Sara-Alarcon-11"
                },
                {
                    "user_id": "Rosa Vazquez",
                    "user_href": "/profile/Rosa-Vazquez-38"
                },
                {
                    "user_id": "Lara Alarcon",
                    "user_href": "/profile/Lara-Alarcon-1"
                },
                {
                    "user_id": "Ema Vazquez",
                    "user_href": "/profile/Ema-Vazquez"
                },
                {
                    "user_id": "Josh Green",
                    "user_href": "/profile/Josh-Green-275"
                },
                {
                    "user_id": "Jennifer Pearce",
                    "user_href": "/profile/Jennifer-Pearce-43"
                },
                {
                    "user_id": "Simon Jez",
                    "user_href": "/profile/Simon-Jez"
                },
                {
                    "user_id": "Micheal Green",
                    "user_href": "/profile/Micheal-Green-25"
                },
                {
                    "user_id": "Orfeas Theofanis",
                    "user_href": "/profile/Orfeas-Theofanis"
                },
                {
                    "user_id": "Jay Pees",
                    "user_href": "/profile/Jay-Pees"
                },
                {
                    "user_id": "Aurora",
                    "user_href": "/profile/Aurora-173"
                },
                {
                    "user_id": "Muhammad Bilal Khan",
                    "user_href": "/profile/Muhammad-Bilal-Khan-70"
                },
                {
                    "user_id": "Gary G Little",
                    "user_href": "/profile/Gary-G-Little"
                },
                {
                    "user_id": "Satyaprakash Jena",
                    "user_href": "/profile/Satyaprakash-Jena-5"
                },
                {
                    "user_id": "Rajeev Kumar",
                    "user_href": "/profile/Rajeev-Kumar-1464"
                },
                {
                    "user_id": "Nirupam Banerjee",
                    "user_href": "/profile/Nirupam-Banerjee-2"
                },
                {
                    "user_id": "Vaibhav Tiwari",
                    "user_href": "/profile/Vaibhav-Tiwari-101"
                },
                {
                    "user_id": "Naveen Prakash",
                    "user_href": "/profile/Naveen-Prakash-188"
                },
                {
                    "user_id": "Ritesh Saini",
                    "user_href": "/profile/Ritesh-Saini-53"
                }
            ]
        },
        {
            "author_info": {
                "name": "Walter D. Petrovic",
                "href": "/profile/Walter-D-Petrovic-1"
            },
            "answer_text": "A few years ago when I placed my first eBooks on Smashwords, there was an article on the site that talked about the industry and how eBooks would overtake print book sales, within a few years. As it turns out, it appears that eBooks had surpassed the sales of paper print before that year ran-out. That was 2016. If you take a look around town you would be very lucky to find a new release bookstore. Even here, where I live, Chapters had closed down, and that is in basically University town. I regard print as real books but before print came along all books were written out, by hand, and often illuminated by hand, too. To those who were thrilled at the mass production of print, those who got accustomed to hand-scribed books regarded those as real books. Tomorrow, who knows? Maybe directly implanted books, into the brain, will replace eBooks and eBooks will be regarded as the real books. Having said this, however, although we saturated the world with printed books, we still value and highly prize the hand-written ones. We value the print ones now, as we will eBooks. What we must keep in mind, not the material books have been produced in, but really keep in mind the content and meaning behind what is written. ",
            "date": "Answered October 16, 2019",
            "views": "689",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Ruven Ikari",
                    "user_href": "/profile/Ruven-Ikari"
                }
            ]
        },
        {
            "author_info": {
                "name": "Atul",
                "href": "/profile/Atul-7"
            },
            "answer_text": "Think this way : HOT VS COOL radio vs Telephone printed word vs spoken word photographs vs comics/cartoons movies vs TV Lectures vs seminars The difference inheres in two things: the thickness of the message transmitted and, most importantly, the degree of active participation the medium demanded. As I put it, hot media is packed to overflowing with data, or message content. Cool data, by contrast, were those which required the audience/reader to fill the gaps. Their participation quotient is higher. Now, with iPad, Skype, cell phones,iTunes,iPhones - the media are evolved well beyond what was seen as excitingly new ( colour TV! Wow! 30 years back). So, the distinguishing mark of the cool is now much more available. are the Kindle, ibook hot or cool? the ebook is much more than a book. Among other things, it's an archive. Not a library book, but a book library. Secondly, a device for receiving and transmitting texts, not merely delivering them. Thirdly, it is formatting device. Buy a book from the bookshop and you are lumbered with the typography and font size. More novels are read in large font size and large print is available in e-book. The e-book has daunting potential. In the very near future, it will, for example, allow soundtracks- as in movies. Or voice-over Illustration can be added. Above all, the annotation can be appended or inserted. The ebook of the near future, it is safe to say, will need as much instruction and tuition in using as driving an automobile. And, like the automobile, it will revolutionise. ",
            "date": "Answered October 3, 2017",
            "views": "12",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Sharon Lippincott",
                "href": "/profile/Sharon-Lippincott"
            },
            "answer_text": "I don’t think so. Personally, I’m in the minority that prefers reading books on my phone ─ even (maybe especially) really long ones. I’ve always had trouble keeping track of characters ─ hooray for search! I consider it a sacrilege to mark up a paper book. I highlight the heck out of an ebook, and export highlights and notes to review them and see them all in one place. Text can be hard to read on stiff paper that doesn’t open well. Paper books now tire my aging hands. Print is often hard to read. HOORAY FOR EBOOKS! BUT, I can’t loan an ebook to a friend. It does not sit silently on a shelf declaring my reading preferences to visitors in my home. Ebooks could go POOF! in a cyber crisis (mine are all backed up.) Ebook technology could (will) become obsolete, making them impossible to access in fifty or one hundred years. Ebooks are increasing in price, making print competitive again. After a few hours of a power outage, we won’t be able to read ebooks. We can’t donate ebooks to used book sales, nor can we pick up an ebook bargain that way. Print books are part of my estate. They may be recycled by my heirs, but they’ll endure as long as anyone wants them. HOORAY FOR PRINT BOOKS! May they both weather the coming ages. ",
            "date": "Answered December 12, 2018",
            "views": "995",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Susan Emmanuel",
                "href": "/profile/Susan-Emmanuel-4"
            },
            "answer_text": "Didn’t they already though? Almost everything is in digital format today, and more often than not, even those who prefer things the old-fashioned way feel inclined to go to the Internet and assess your options first. Yeah, old-fashioned me found the convenience of e-books take over my love for paperbooks. I still adore them but I had to become practical. It all started from me being too lazy to step out of the house to downloading loads of e-books just because they were available and in the process I simply got accustomed to them because that is what technology does to people. It presents itself as the easiest and most viable option, always at your disposal. And over time, that becomes the only option you consider with the thrill of buying the newest book written by your favorite author being the only other one. But e-books don’t get soiled over the years like paper books (although that musty smell adds to their charm), and neither does the issue of storage, cost, availability, or durability arise with them. With so many unparalleled advantages that e-books have, they will soon be prominent in every educational institution, completely erasing the need to study from a book. I haven’t studied from a textbook in two years. And that is how the coming generations will be introduced to studies, which will only be carried on further with the mindset that everything is possible online, thus slowly rendering the old bulky book obsolete. Although I personally think that I’d need paper books for doing my rough work in Math. ",
            "date": "Answered May 5, 2018",
            "views": "486",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Goutham Anil",
                    "user_href": "/profile/Goutham-Anil-2"
                },
                {
                    "user_id": "Akhilesh Akula",
                    "user_href": "/profile/Akhilesh-Akula"
                },
                {
                    "user_id": "Arundhati Jena",
                    "user_href": "/profile/Arundhati-Jena"
                },
                {
                    "user_id": "Kareem Khan",
                    "user_href": "/profile/Kareem-Khan-12"
                }
            ]
        },
        {
            "author_info": {
                "name": "Gabrielle Cerberville",
                "href": "/profile/Gabrielle-Cerberville-1"
            },
            "answer_text": "This is a hotly debated question, and one that I still go back and forth on. Here's where I land. Some physical books will ultimately be replaced by digital books, but others never will. I think that certain books will be replaced by digital copies. Textbooks are a big place where I see a real possibility of this taking place, even in the very near future. Textbooks are expensive to produce, and are quickly becoming more cost-prohibitive to purchase. Textbook resale also hurts producers, who can only profit on a physical copy once. Digital copies make it easier and cheaper to produce and update the same material, and to control distribution for the maximum payout. Same thing with reference books. The Encyclopedia Britannica is a great example. It takes several shelves to house in a library, it's expensive to produce and purchase, and the point of it is to provide clear and accurate information, not to create an experience. It, and other reference books like it, are perfect candidates for digitization.  I don't think we will ever truly transition children's books to digital. The physical action of turning pages and reading to a child from a real, tactile book is something that technology will never be able to replicate, and frankly, it's not even something most parents want. Digital children's books exist, sure, but they're not hugely popular. The same thing applies to many novels, to a lesser degree. The action of reading a physical book is sensual on many levels, and that's the point. The point of a novel is to create an imaginative, immersive, sensual experience which captivates the reader. Sometimes, perhaps even often, a digital copy is more convenient. Nevertheless, physical books will always be available to people who desire them -- and the demand will always be there. ",
            "date": "Answered March 28, 2016",
            "views": "603",
            "upvotes": " View 3 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Andy Dyer",
                    "user_href": "/profile/Andy-Dyer-1"
                },
                {
                    "user_id": "Ellen Whitherways",
                    "user_href": "/profile/Ellen-Whitherways"
                },
                {
                    "user_id": "Nancy Ashmore",
                    "user_href": "/profile/Nancy-Ashmore"
                }
            ]
        },
        {
            "author_info": {
                "name": "Joshua Poh",
                "href": "/profile/Joshua-Poh"
            },
            "answer_text": "I firmly believe both forms will coexist with each other. Paper will be here to stay. Just look at all the stationary shops, paper crafts and libraries out there. Interestingly enough, recent (2017) statistics show that sales of the eBook are going down compared to printed books. Sales of consumer e-books plunged 17% in the U.K. in 2016, according to the Publishers Association. Sales of physical books and journals went up by 7% over the same period, while children's books surged 16%. The same trend is on display in the U.S., where e-book sales declined 18.7% over the first nine months of 2016, according to the Association of American Publishers. Paperback sales were up 7.5% over the same period, and hardback sales increased 4.1%. Source: CNN Other sources: Print Books vs. Ebooks: Who's Up, Who's Down, and Where Are We Headed? As someone who reads on both Kindle and physical books, eBooks for me win in terms of convenience and cost. You can even annotate, bring them out where ever you want, write down notes, etc. This makes for convenient reading - especially when you’re on a crowded train and you don’t have space to pull out a physical book. But nothing beats the tactile experience of thumbing through an actual book, smelling the fresh smell of the printed page and having them on display on your bookshelves. Physical books make for excellent conversation starters too! ",
            "date": "Answered June 9, 2018",
            "views": "670",
            "upvotes": " View 2 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Olivia Steinke",
                    "user_href": "/profile/Olivia-Steinke-1"
                },
                {
                    "user_id": "Gregory Tyler",
                    "user_href": "/profile/Gregory-Tyler-4"
                }
            ]
        },
        {
            "author_info": {
                "name": "Shashidhar Nanjundiah",
                "href": "/profile/Shashidhar-Nanjundiah"
            },
            "answer_text": "E books are on their way to partially replace paper books in select segments, but never completely because the electronic technology covers merely 1% of the whole reading population worldwide. There is still a vast majority in the world who rely on printed books for their reading material. And this is some consolation because the old-world charm of paper books and their emotional connect is something which is unique in itself. E books are most convenient, versatile and can accommodate large volumes of matter and maximum number of books in electronic form. You can read on the run and can be real fun too. You can switch books at the click of a button and can carry a library with you ! And many more advantages that one can think of. While welcoming the era of E books, I certainly miss the emotional experience with our good old paper books. I still love the printed books and continue to use them for my reading purpose. Thanks for the A2A. ",
            "date": "Answered May 12, 2016",
            "views": "877",
            "upvotes": " View 4 Upvoters ",
            "upvoters": [
                {
                    "user_id": "จตุพล เอมอุดม",
                    "user_href": "/profile/จตุพล-เอมอุดม"
                },
                {
                    "user_id": "Alaina Helena Rutan",
                    "user_href": "/profile/Alaina-Helena-Rutan"
                },
                {
                    "user_id": "James Joannides",
                    "user_href": "/profile/James-Joannides"
                },
                {
                    "user_id": "Wayne Allen Sallee",
                    "user_href": "/profile/Wayne-Allen-Sallee"
                }
            ]
        },
        {
            "author_info": {
                "name": "Nikita Sah",
                "href": "/profile/Nikita-Sah"
            },
            "answer_text": "Not at all! Though I agree ebooks could be a little convenient, as you could save a number of books on your Kindle, and read according to your mood. But the kind of romance voracious readers have with their hard copies of books cannot be felt with Ebooks. You do not get to experience that wonderful smell, every time you open the book. I can proudly call myself a book sniffer, as that is the first thing I do whenever I open a new book.The elated feeling you get when you add a new book to your already stacked book shelf, I am sure ebooks can not give you that joy.Even after years when you open your old books, and find some things you wrote on them, always bring back some memories of the years gone by, and you get to time travel back to those times. E.g. Every time I open my copy of Harry Potter and the Deathly Hallows, and find the note ‘Love, Papa’ written on it, reminds me how my father had gone to the bookstore at 6 am in the morning on the day the book released, to surprise me with it.So, I am sure hard copies would never become obsolete, as they have much more emotional value attached to them. ",
            "date": "Answered October 12, 2016",
            "views": "17",
            "upvotes": " View 12 Upvoters",
            "upvoters": [
                {
                    "user_id": "Sandeep Chandran",
                    "user_href": "/profile/Sandeep-Chandran-42"
                },
                {
                    "user_id": "Naveen Prakash",
                    "user_href": "/profile/Naveen-Prakash-188"
                },
                {
                    "user_id": "Kunal Kamdar",
                    "user_href": "/profile/Kunal-Kamdar-7"
                },
                {
                    "user_id": "Kavitha Davay",
                    "user_href": "/profile/Kavitha-Davay"
                },
                {
                    "user_id": "Alaina Helena Rutan",
                    "user_href": "/profile/Alaina-Helena-Rutan"
                },
                {
                    "user_id": "Ananya Khandelwal",
                    "user_href": "/profile/Ananya-Khandelwal"
                },
                {
                    "user_id": "Sumit Sharma",
                    "user_href": "/profile/Sumit-Sharma-58"
                },
                {
                    "user_id": "Mohammad Razique",
                    "user_href": "/profile/Mohammad-Razique"
                },
                {
                    "user_id": "Arpit Gupta",
                    "user_href": "/profile/Arpit-Gupta-175"
                },
                {
                    "user_id": "Venkatesh Sah",
                    "user_href": "/profile/Venkatesh-Sah-1"
                },
                {
                    "user_id": "Aparna Chatterji",
                    "user_href": "/profile/Aparna-Chatterji"
                },
                {
                    "user_id": "Sanjana BL",
                    "user_href": "/profile/Sanjana-BL"
                }
            ]
        },
        {
            "author_info": {
                "name": "Malini Mohan Kumar",
                "href": "/profile/Malini-Mohan-Kumar-1"
            },
            "answer_text": "I really hope it does not. I still remember walking down the aisles of book stores browsing through the books, reading through the synopsis of those that seem to be interesting and then finally picking the ones that are intriguing. When I got married, one pleasant surprise I got from my husband was to allot a separate room in our home dedicated to my entire collection of books. It is our mini library with books ranging from fictions, non fictions to even the comics that I collected since my childhood. However the collection has now come to a halt not because I have stopped reading but because I don’t get to buy the books from the book stores. They are all mostly out of business in my city. The conventional reader in me still does not opt to read from an ebook. So I have stopped getting my collection of books and decided to get books from library instead. Having said that, I will always go for the paperback books whatsoever just for the emotions associated with it and still have the plans to gift a paperback book for my daughter on each of her birthday starting from this year (as she has just begun taking baby steps of reading this year)!!! ",
            "date": "Answered April 28, 2020",
            "views": "185",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Paul Austin Ardoin",
                "href": "/profile/Paul-Austin-Ardoin"
            },
            "answer_text": "There are many cases where e-books are better suited than paper books. I ordered the very first Amazon Kindle the first day it was available because I traveled from California to Germany every six weeks, and I’d often carry many paperbacks with me. Half the time, I’d finish all my books on the way over and have nothing to read on the way back—and there aren’t many English-language bookstores in the area of Germany where I spent my time. I buy most of my books as e-books today because I can have dozens (hundreds! thousands!) of books with me on every plane flight I take. But given the choice, I prefer reading paper books. It’s a more relaxing experience and it engages more of the senses. A ScienceDaily study actually showed that people get less emotionally engaged with e-books than with paper books. This isn’t a “young folks and their technology” thing, either. Millennials—both older millennials and college students—prefer paper books to e-books by a much wider margin than their Gen-X and Boomer counterparts. (The Los Angeles Times cited a 2016 report showing that 92% of college students preferred paper books.) So—can e-books replace paper books? In most cases, they probably could. If paper books disappeared tomorrow, with only Kindles and iPads and Kobo Readers left, people would read e-books. But will they? I believe it’s unlikely: the younger generations simply like their dead trees too much. ",
            "date": "Answered August 20, 2018",
            "views": "303",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Ameesha Smith-Green",
                "href": "/profile/Ameesha-Smith-Green"
            },
            "answer_text": "Theoretically, of course they could in the future. The e-book market exploded and for a few years, e-book sales exceeded print sales. Then for a few years, print sales took over again. In 2018, this is anticipated to switch around again. Some “experts” predict that e-books will eventually be the more common choice by far. However, just because new tech comes along and is very popular doesn’t necessarily mean that the old way will be entirely replaced. There will probably always be people who prefer paper copies of books, in the same way as there are people who still prefer vinyl to MP3s—despite the convenience of the latter. Convenience isn’t the deciding factor for everyone—for some people, it’s about the feeling of putting on a vinyl record or reading a paper book—something you don’t get from switching on your iPod or turning the page on a Kindle. Personally, I don’t get the same feeling reading an e-book compared to a paper book, and it’s always my second and last choice. ",
            "date": "Answered April 4, 2018",
            "views": "551",
            "upvotes": " View 3 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Susan Emmanuel",
                    "user_href": "/profile/Susan-Emmanuel-4"
                },
                {
                    "user_id": "Alaina Helena Rutan",
                    "user_href": "/profile/Alaina-Helena-Rutan"
                },
                {
                    "user_id": "Lonnie Gerarchi",
                    "user_href": "/profile/Lonnie-Gerarchi"
                }
            ]
        },
        {
            "author_info": {
                "name": "Aurel Kurtula",
                "href": "/profile/Aurel-Kurtula-1"
            },
            "answer_text": "I have started reading very late  and ebooks have made reading a pleasure. Books on demand! Especially for someone like me that isn't used to book stores, the idea that I can search for the book I need and download it is fantastic. I go to book stores to find books, but never the book I am looking for  As for the question, of course not, paper is paper digital is digital. As I said I started reading a year or two after the ebooks came out, but I have to say this is the most boring conversation I have ever heard. People that say they love reading, waisting their time talking about the medium (I might be wrong). To me it's like saying will water bottles replace glasses, jugs and the like. Obviously they haven't, but at the same time, no one can tell you when you should use one or the other.  Maybe because I am not used to reading, and maybe because I don't have the large collection of books that other readers have from before ebooks, I love ebooks. I love the fact that the book I am reading is on me all the time, I don't even need an e-reader. I love that I have a dictionary right there. I love that I can clip, comment, rip the book apart and still leave it in tacked. I love at the end of the book, I can take the notes, as if they were the recorded meetings with the other and add them to my evernote, give them to anyone. At the same time I have a collection of physical books as well. For both mediums, I have more than I have read. ",
            "date": "Answered May 9, 2016",
            "views": "798",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Richard Ure",
                    "user_href": "/profile/Richard-Ure"
                },
                {
                    "user_id": "Cassandra Oruche",
                    "user_href": "/profile/Cassandra-Oruche"
                }
            ]
        },
        {
            "author_info": {
                "name": "Arpan Panicker",
                "href": "/profile/Arpan-Panicker"
            },
            "answer_text": "Eventually, yes. Ebooks will replace physical books. Before paper was invented, we used to write on cloth. And before cloth, we used to write on vellum (a form of leather parchment). Before vellum was used, we used to write on stone tablets. Before stone tablets, we used to scratch on cave walls and the ground. You see, all obsolete mediums eventually give way to newer mediums. Now, it seems like blasphemy to say that ebooks will replace physical books. But that’s because we are in the transitional phase. I’m sure vellum manufacturers laughed at the brittle nature of this new paper fad. Eventually, we will reach a point where it will seem stupid and ecologically disastrous to use precious paper to capture transient words. It’s just a matter of time! ",
            "date": "Answered April 13, 2018",
            "views": "202",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Sharika Ravikumar",
                    "user_href": "/profile/Sharika-Ravikumar"
                }
            ]
        },
        {
            "author_info": {
                "name": "Akash Pandey",
                "href": "/profile/Akash-Pandey-67"
            },
            "answer_text": "Well , you can't deny the e-books  hold a certain sway over their Physical counterpart, but I don't think they can rescind the other half. Physical Books -   The raindrops falling on the porch , Few making their way over to your face , but it does not bother you as you are immersed completely in your book. The magical land of the books inspire you , and in between the reads , you stop and take a look at the covers, feeling it , and imagining yourself with the characters. And when you are at the last page,  content with the story and sad about the ending, and eagerly waiting for the next installment, you will know , the books are quite safe and are not going anywhere.  ",
            "date": "Answered May 10, 2016",
            "views": "153",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Anjali Kriplani",
                    "user_href": "/profile/Anjali-Kriplani"
                },
                {
                    "user_id": "Zeel Patel",
                    "user_href": "/profile/Zeel-Patel-14"
                }
            ]
        },
        {
            "author_info": {
                "name": "Deborah Replogle",
                "href": "/profile/Deborah-Replogle"
            },
            "answer_text": "CAN they? Yes. WILL they? No. This question has been asked over and over by publishers, critics, readers, etc since ebooks appeared several years ago. And the man consensus is No. Print books give many people a physical satisfaction. The weight of holding it in their hands, that famous “book smell” of the paper, ink, pages and glue. People like to see their books on their shelves. Physical books have many, many properties that people like. Ebooks have their place and their convenience, but they’re never going to replace the physical print book. ",
            "date": "Answered May 5, 2018",
            "views": "374",
            "upvotes": " View 3 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Alaina Helena Rutan",
                    "user_href": "/profile/Alaina-Helena-Rutan"
                },
                {
                    "user_id": "Chinmay Raut",
                    "user_href": "/profile/Chinmay-Raut-5"
                },
                {
                    "user_id": "Vidya K",
                    "user_href": "/profile/Vidya-K-62"
                }
            ]
        },
        {
            "author_info": {
                "name": "Christopher Seaton",
                "href": "/profile/Christopher-Seaton-1"
            },
            "answer_text": "I am a 21st century person. I like technology. I have a kindle and a kindle app on my ipad. I use them. They are cool. But I still like books more. They are just a wonderful device. Easy to use. Ergonomically designed. Do not require charging. Can take some rough and tumble. Suit their purpose perfectly as in transmitting information into your brain ( assuming you have the language skills ). They also look good and are easy to store as they tend to be vaguely uniform in shape.  Ebooks have their place as well and I believe we will see more and more of them in the future but I doubt books will be replaced by them in my lifetime as they are such a good piece of design. ",
            "date": "Answered March 27, 2016",
            "views": "356",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Andy Dyer",
                    "user_href": "/profile/Andy-Dyer-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "R Patra",
                "href": "/profile/R-Patra-1"
            },
            "answer_text": "According to me, nothing is replaceable in this world(a little philosophical I guess!!!!). Everything whose use comes to an end, bounces back after a period. If paper books are replaced today by ebooks, then one day they too will be replaced by something more advanced. But at the same time, after laying low for sometime, they make a comeback. Take the example of Vinyl records, which are slowly coming back to our lives!!!  Each and everything has its own peculiar quality which makes it unique. I like to take advantages of both worlds. Paper books will be my all time favourite but I don't mind taking advantage of ebooks as well. While the first one adds a sense of belonging and so much pride in owing them. I buy them from bookstores or order them through sites like Amazon or rent books through online rental libraries such as ememozin. The second option (ebooks )makes life so much easier. So many things at one place small device.  The market trends shows that eBook reading is increased while paper books have decreased but I am sure paper books are here to remain. ",
            "date": "Answered January 15, 2018",
            "views": "760",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Nero Liam",
                    "user_href": "/profile/Nero-Liam"
                },
                {
                    "user_id": "Alaina Helena Rutan",
                    "user_href": "/profile/Alaina-Helena-Rutan"
                },
                {
                    "user_id": "Ramakant Singh",
                    "user_href": "/profile/Ramakant-Singh-5"
                }
            ]
        },
        {
            "author_info": {
                "name": "Jack Noel",
                "href": "/profile/Jack-Noel-8"
            },
            "answer_text": "Yes, I can see no way that printed paper books can survive at least not as “standard practice” in methods of production. Especially given the fact that ebooks and ereaders will continue to be improved. ebooks already have the advantage of greatly reduced storage space and having free backup copies available “in the Cloud.” Because they’re cheaper to produce and more easily distributed/accessed and “displayed” by vendors they’ll become progressively more popular with consumer/readers. I haven’t seen any mention of it yet but I’m pretty sure that ereaders need to be made waterproof. I might not just be aware yet but I think that’s one improvement that could be made if it hasn’t already been done. ",
            "date": "Answered February 6, 2017",
            "views": "225",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Tyson Meyer",
                "href": "/profile/Tyson-Meyer-1"
            },
            "answer_text": "I can honestly say I think that's the case. Logically it makes sense to me. People love technology. You have those buffs that must have the newest “it” thing. It's also convenient. Instead of carrying multiple books with you and then buying more which take up more space you now have one device. You can have countless books with you and with a couple taps on the screen buy a new book. It's the digital age. I have an e-reader with about 420 books on it. I travel constantly and it's great to grab one thing that contains anything I could want to read. This fact also saddens me. I love reading. I also love books. Thand feel of opening a new book and hearing the spine crackling. A favorite pastime of mine was to go to a bookstore, grab a coffee and just walk around at the new releases or trying to find new series. I can still do this but it's not the same. ",
            "date": "Answered February 6, 2017",
            "views": "849",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Ahmed Atif Abrar",
                    "user_href": "/profile/আহমেদ-আতিফ-আবরার-Ahmed-Atif-Abrar"
                }
            ]
        },
        {
            "author_info": {
                "name": "Michael Barnard",
                "href": "/profile/Michael-Barnard-14"
            },
            "answer_text": "They are certainly trending in that direction.  There was a recent blip where the New York Times falsely reported that ebook sales were down, but that turned out to be a story about traditional publishers losing market share in the ebook markets.  Other stories claim that print book sales are up, but that's mostly due to the new rage for adult colouring books, which hardly counts. Basically, the more that high-resolution screens penetrate, the more that people use them for all of their media consumption including print. I certainly have given up on all of my print books, and there's almost no second-hand market or library willing to take most print books these days.  ",
            "date": "Answered May 10, 2016",
            "views": "16",
            "upvotes": " View 5 Upvoters",
            "upvoters": [
                {
                    "user_id": "Richard Ure",
                    "user_href": "/profile/Richard-Ure"
                },
                {
                    "user_id": "Felecia Killen",
                    "user_href": "/profile/Felecia-Killen"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/Lex·R·K"
                },
                {
                    "user_id": "Elizabeth R. Goldberg",
                    "user_href": "/profile/Elizabeth-R-Goldberg"
                },
                {
                    "user_id": "John Worthley",
                    "user_href": "/profile/John-Worthley"
                }
            ]
        },
        {
            "author_info": {
                "name": "Louis Tielens",
                "href": "/profile/Louis-Tielens"
            },
            "answer_text": "Probably. For me it will never be the case. I do have an e-reader, but I love the touch and smell of books, particularly old books. But I grew up with printed books, no computers, no video games. Even mostly no TV. And now I simply don’t like reading from a screen. But I can’t speak for the current youth. They are so used to reading from screens, so they probable prefer ebooks (if any). I don’t think paper books will disappear though. Vinyl records also still exists, even with alternatives like CD or MP3. ",
            "date": "Answered February 6, 2017",
            "views": "191",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Travis Casey",
                "href": "/profile/Travis-Casey-4"
            },
            "answer_text": "Well, the pedant in me immediately thinks “a textbook is a book that is the ‘text’ for a course — there’s nothing about the word ‘textbook’ that requires the book in question to be physical”. So, the question is like asking, “can e-books replace novels?” But, to answer the question as likely intended, “Can e-books be used as textbooks?” Certainly. Indeed, in many places, they already are being used. My daughter is using ebook textbooks in her college classes. Not all of them, yet, but at least some of them. ",
            "date": "Answered September 2, 2020",
            "views": "31",
            "upvotes": " Answer requested by Quora User",
            "upvoters": [
                {
                    "user_id": "Andy Dyer",
                    "user_href": "/profile/Andy-Dyer-1"
                },
                {
                    "user_id": "Maja Burazin",
                    "user_href": "/profile/Maja-Burazin-1"
                },
                {
                    "user_id": "Sherzod Sheka",
                    "user_href": "/profile/Sherzod-Sheka"
                },
                {
                    "user_id": "Kirby Costales",
                    "user_href": "/profile/Kirby-Costales"
                }
            ]
        },
        {
            "author_info": {
                "name": "Vipul Ramtekkar",
                "href": "/profile/Vipul-Ramtekkar"
            },
            "answer_text": "Books have a special place in everybody’s heart and can't be replaced. E-Books save paper but reading them does not give you the feeling which that printed paper can give, some will argue that this leads to wastage of paper but I would say that books in there lifetime find many readers and exchanged heavily(should be promoted), and do get recycled. The pleasure of having a mini-library of your own can never be replaced.You will have thousands of e-Books but one tends to read those printed books and re-read them, have a cherishing moment attached with them.How can one one forget those coffee marks on pages, that smell when we buy a new book.Having that bookmark on the pages, the feeling you are halfway that hefty book.In the end book add a special meaning to life, “I am a Reader not because I don't have a life, but because I choose to have many.” Cheers to the love for reading! ",
            "date": "Answered June 8, 2017",
            "views": "21",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Stojadinović Stefan",
                    "user_href": "/profile/Stojadinović-Stefan"
                },
                {
                    "user_id": "Jocke Enegren",
                    "user_href": "/profile/Jocke-Enegren"
                },
                {
                    "user_id": "Andrew Weill",
                    "user_href": "/profile/Andrew-Weill"
                },
                {
                    "user_id": "Horatio Oswald",
                    "user_href": "/profile/Horatio-Oswald"
                },
                {
                    "user_id": "Aneirin Stevenson",
                    "user_href": "/profile/Aneirin-Stevenson"
                }
            ]
        },
        {
            "author_info": {
                "name": "Peter Flom",
                "href": "/profile/Peter-Flom"
            },
            "answer_text": "Not yet, at least, not for all books. Mind you, I do own and use a Kindle and it’s got a lot of advantages, the biggest one being weight - or lack thereof. For “standard” books it’s fine. But it’s not yet good for some things. You can mark pages, but it’s not that easy to flip back and forth from page to page. E.g. to a glossary or a genealogy or a dramatis personae. Some drawings and maps don’t show up well and are not affected by changing the font size. Mathematical formulas don’t usually appear well. It’s hard to scan and skim. ",
            "date": "Answered June 29, 2016",
            "views": "15",
            "upvotes": " View 5 Upvoters",
            "upvoters": [
                {
                    "user_id": "Andy Dyer",
                    "user_href": "/profile/Andy-Dyer-1"
                },
                {
                    "user_id": "Kavisha Perera",
                    "user_href": "/profile/Kavisha-Perera-2"
                }
            ]
        },
        {
            "author_info": {
                "name": "Mfonemana Uduak",
                "href": "/profile/Mfonemana-Uduak"
            },
            "answer_text": "No. Readers are creatures of habit. I read more online than I buy a physical book. But this is only because I have not reached a point in my life when I can participate in collecting books. Yes, readers like to collect books. If you don't believe it look at a reader's epub library. Even if they've read the book, they keep it. If the reader has a chance to collect the physical book, he or she would. I don't know, for me, it's the smell of paper and ink, the feeling of holding the book,.... Let's just say readers have little odd likes. Long story short, e-books are good, but physical books are going no where. ",
            "date": "Answered January 4, 2019",
            "views": "16",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Simon Atford",
                    "user_href": "/profile/Simon-Atford"
                }
            ]
        },
        {
            "author_info": {
                "name": "Chris Grillo",
                "href": "/profile/Chris-Grillo-2"
            },
            "answer_text": "I cannot see why there cannot be space for both… in truth, and only personally, I have done away with paper books and totally use only my Kindle or ipad for reading. They are cheaper, easier to keep organised, and most importantly, a book from my favourite author is available immediately. However, and I must make it abundantly clear here, that this is only for novels. Some books will still make more sense in print… like large-format catalogues. In essence, ebooks are already outselling dead-tree books… so, only time will tell. ",
            "date": "Answered January 7, 2018",
            "views": "214",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Julia Trummer",
                    "user_href": "/profile/Julia-Trummer-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Kiera Akhtar",
                "href": "/profile/Kiera-Akhtar"
            },
            "answer_text": "I don’t think that it is possible. There is no doubt that e-books become more and more popular, but they can’t replace paper books. As for me, paper books bring more pleasure when you read it. It is so nice to buy a paper book, to open it and start reading. Of course, e-books are more practical. They are small and you can download lots of different books there. So you needn’t to carry your big paper book. Books exist so many years and develop simultaneously with our society. They reflect our our needs, problems, interests. They are like exponent of generation’s development. ",
            "date": "Answered June 30, 2017",
            "views": "535",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Lorena Ashcroft",
                    "user_href": "/profile/Lorena-Ashcroft"
                },
                {
                    "user_id": "Simon Atford",
                    "user_href": "/profile/Simon-Atford"
                }
            ]
        },
        {
            "author_info": {
                "name": "Victoria J. Kidd-Cromis",
                "href": "/profile/Victoria-J-Kidd-Cromis"
            },
            "answer_text": "I don’t think so. At least for me they won’t. I am subject to migraines and I can read a paper book while waiting for my meds to kick-in and I absolutely can NOT look at a screen when I’m having a migraine. The blue light exacerbates the migraine pain and the book does not. Besides the fact that I can still read a book even if there is no electricity due to a storm. I like electronic gadgets like the computer but they have limitations. ",
            "date": "Answered January 7, 2018",
            "views": "150",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Kathleen Condon",
                    "user_href": "/profile/Kathleen-Condon-3"
                },
                {
                    "user_id": "Tyler McMann",
                    "user_href": "/profile/Tyler-McMann"
                }
            ]
        },
        {
            "author_info": {
                "name": "Rachel Evans",
                "href": "/profile/Rachel-Evans-101"
            },
            "answer_text": "For me, no. I would love to say yes. Some of my textbooks have been available in e-book form and I wish I could have gone that route. They’re usually cheaper, and obviously a lot easier to carry. But I can’t focus on screens!! That’s why I don’t read e-books. For some reason, I just can’t keep my attention there. Same with audio-books. My level of understanding and learning would drop dramatically if all I could use were the e-book version of textbooks. So, I’m stuck buying the clunky paper versions. ",
            "date": "Answered April 2, 2017",
            "views": "444",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Andy Dyer",
                    "user_href": "/profile/Andy-Dyer-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "A-GOS",
                "href": "/profile/A-GOS"
            },
            "answer_text": "I guess not although both e-books & paper books have their own pros & cons. e-books are easier to carry. You can always carry your whole library with you in a small device like kindle. They are easier to maintain & do not require lot of storage space like paper books. But paper books have their own charm & a better recall value. I often remember the cover & author’s names of paper books because I see the over everytime I pick a paper book to read. But I often forget these details when I read paper books. ",
            "date": "Answered April 3, 2018",
            "views": "71",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Alicia Andrea Marsland Geromel",
                "href": "/profile/Alicia-Andrea-Marsland-Geromel"
            },
            "answer_text": "No. Just as cars did not completely replace horses. Or the computer replace the pen. The multiplicity of uses means that we have more tools to choose from which is actually an improvement. I see the main use for physical books as what you want to buy when you want to hold onto a piece of knowledge or a fine piece of literature. The Internet and all its permutations are ephemeral. They are also vulnerable in a way a book is not, to manipulation. ",
            "date": "Answered December 12, 2018",
            "views": "248",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Alaina Helena Rutan",
                    "user_href": "/profile/Alaina-Helena-Rutan"
                }
            ]
        },
        {
            "author_info": {
                "name": "Paul Ryberg",
                "href": "/profile/Paul-Ryberg"
            },
            "answer_text": "Can television replace radio? Can the internet replace movies? We still have radio. We still have movies. We still have people spending billions on paper books. I think books will last for yet a little while. Go to the children’s section of your local library. Watch the children walking out with bags of paper books. These are children who have all the electronic toys there are - they still want books. ",
            "date": "Answered April 3, 2018",
            "views": "88",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Andy Dyer",
                    "user_href": "/profile/Andy-Dyer-1"
                },
                {
                    "user_id": "Maja Burazin",
                    "user_href": "/profile/Maja-Burazin-1"
                },
                {
                    "user_id": "Tanmay Dhar",
                    "user_href": "/profile/Tanmay-Dhar-2"
                },
                {
                    "user_id": "Sherzod Sheka",
                    "user_href": "/profile/Sherzod-Sheka"
                }
            ]
        },
        {
            "author_info": {
                "name": "Rahul Kanotra",
                "href": "/profile/Rahul-Kanotra-2"
            },
            "answer_text": "No, I don’t think this will ever happen. Best example for this, AMAZON, the company who revolutionize read with his E readers, is planning to set shop for paper book stores at Seattle, San Diego, Portland and Boston. And on personal basis, I own both Kindle and iPad, but nothing can replace the full of a hard bind books. ",
            "date": "Answered February 6, 2017",
            "views": "45",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Priya",
                "href": "/profile/Priya-1182"
            },
            "answer_text": "I sure hope not! I mean there's nothing like delving into a good old book and turning the pages as the plot unravels. I mean sure, the Kindle can mimic turning a page, but the feel of a paperback isn't something a Kindle can imitate can it? I think books will definitely reduce in sales but they will remain forever and ever for old souls like us who still prefer the feel of a book to just devouring words on a screen. It's the old fashioned way and at least in this case there is no replacing it no matter how convenient a Kindle may be. ",
            "date": "Answered June 8, 2017",
            "views": "628",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Danny Farham",
                    "user_href": "/profile/Danny-Farham"
                },
                {
                    "user_id": "Sherzod Sheka",
                    "user_href": "/profile/Sherzod-Sheka"
                },
                {
                    "user_id": "Gina Langridge",
                    "user_href": "/profile/Gina-Langridge"
                },
                {
                    "user_id": "John Dasef",
                    "user_href": "/profile/John-Dasef"
                }
            ]
        },
        {
            "author_info": {
                "name": "Marva Dasef",
                "href": "/profile/Marva-Dasef"
            },
            "answer_text": "Ebooks are books. Audio books are books. Paperbacks are books. Hard covers are books. Ebooks are more convenient to carry with you wherever you go. That’s the advantage of the format (same for audio books). It’s all just packaging, delivery price, and carbon footprint. With that as the criteria, ebooks will win over paper books every time. What are the advantages of paper books (includes paperback and hard cover)? Aesthetically, some people prefer the experience of reading from paper media. But antiquated methods eventually die out. So, too, will paper books. ",
            "date": "Answered June 8, 2017",
            "views": "12",
            "upvotes": " View 4 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Alaina Helena Rutan",
                    "user_href": "/profile/Alaina-Helena-Rutan"
                }
            ]
        },
        {
            "author_info": {
                "name": "Dave Payton",
                "href": "/profile/Dave-Payton-1"
            },
            "answer_text": "Thanks for the A2A. It would be a travesty to everyone if they did. At some point, computers can, and do fail. Imagine if all the world’s history, all the world’s literature, ideas, etc. were all stored electronically, and then that mass of electronic storage were to be lost. What exactly would we fall back on? Real books should always exist, if for no other reason than to preserve those things as a backup in case of electronic meltdown. Anyone who thinks it could never happen, in all the future of the human race, that we’d lose all digital data, is naive. ",
            "date": "Answered March 30, 2019",
            "views": "193",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Kamal Dhiman",
                    "user_href": "/profile/Kamal-Dhiman-6"
                },
                {
                    "user_id": "Mallarapu Hemalatha",
                    "user_href": "/profile/Mallarapu-Hemalatha"
                },
                {
                    "user_id": "Ashwin S Selvarajan",
                    "user_href": "/profile/Ashwin-S-Selvarajan"
                }
            ]
        },
        {
            "author_info": {
                "name": "Renee Starcher",
                "href": "/profile/Renee-Starcher"
            },
            "answer_text": "I think both options will remain. Not having to lug around a heavy book is appealing, however staring a a screen to read it isn’t. E-books are very easy to get and don’t take up space in real life, which are a couple pros. Regular print books are nice to have on your shelf and reduce your screen time. It’s also a comfort to some to have a physical book to hold, carry, or read. I like both, but I wouldn’t like it all digital. I really hope that never happens because libraries would then be obsolete. I prefer to have libraries. Kids just discovering books should be able to have physical books and library access. You also have to think of the future in a possible Y2k situation where all technology could fail, losing all info kept online. All electronic books would be lost. Only print books would remain. Just sayin’. ",
            "date": "Answered June 8, 2018",
            "views": "65",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Tom Dombrock",
                "href": "/profile/Tom-Dombrock"
            },
            "answer_text": "They can, and with some people, they do. However, while ebooks have become a huge market, there’s really no replacing the feel of a cover and pages in your hand. While the market for ebooks has exploded, paper books still dominate the market. The day may come when Kindles and Ereaders are the only means of reading a book, I feel that will be a sad, sad day. ",
            "date": "Answered September 26, 2018",
            "views": "68",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Sankara Saranam",
                "href": "/profile/Sankara-Saranam"
            },
            "answer_text": "Technically, it already has, although not entirely. They can but the question is more if humans will decide to entirely replace paper publishing with digital publishing. I suspect that eventually printed data will be the low tech backup to digitally published material while our greatest encapsulations of knowledge gleaned from the universe will be etched in stone. ",
            "date": "Answered August 13, 2019",
            "views": "200",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Andy Dyer",
                    "user_href": "/profile/Andy-Dyer-1"
                },
                {
                    "user_id": "African Fabrics Brand",
                    "user_href": "/profile/African-Fabrics-Brand"
                }
            ]
        },
        {
            "author_info": {
                "name": "George Sydney Abugri",
                "href": "/profile/George-Sydney-Abugri"
            },
            "answer_text": "It is unlikely to ever happen. The advantages of reading an eBook are several but most people still prefer printed books. The feeling of holding a printed book and turning the pages is something that can never be done with an eBook. Many people also love the convenience of reading a paperback on a bus, plane, train, waiting room, in bed or while waiting for a service. A total of 82 per cent voted for printed books but only 15 per cent preferred eBooks in a recent poll which asked hundreds of readers to choose their reading preferences between eBooks and paperbacks. ",
            "date": "Answered December 12, 2018",
            "views": "496",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Andy Dyer",
                    "user_href": "/profile/Andy-Dyer-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Ted Bowman",
                "href": "/profile/Ted-Bowman-1"
            },
            "answer_text": "eBooks have not taken the place of paper books as some predicted. eBook sales have leveled off the last few years at about 24% of all books sold. 3 out of 4 books sold are still paper. Experts predicted television would be the end of radio (lol). Most people (75% of readers) still like a book in their hands to turn pages, underline, and “dog-ear” corners for reference later. Parents have learned that small children prefer a real book to eBooks. Smart authors simply produce printed as well as electronic books. ",
            "date": "Answered August 19, 2018",
            "views": "281",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Irina Feskova",
                    "user_href": "/profile/Irina-Feskova"
                },
                {
                    "user_id": "Alaina Helena Rutan",
                    "user_href": "/profile/Alaina-Helena-Rutan"
                }
            ]
        },
        {
            "author_info": {
                "name": "Binary",
                "href": "/profile/Binary-4"
            },
            "answer_text": "Even now most of the time I read e books, but I don’t think e books will replace paper books. As smartphone and kindle more and more popular, I can find all the e books I want to read, and for the favorite books, normally I will buy the paper books. Ebook is more easy to taken when you travel outside, but reading a paper book is rather different from reading on the screen. ",
            "date": "Answered May 14, 2016",
            "views": "145",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Timothy Ellis",
                "href": "/profile/Timothy-Ellis-4"
            },
            "answer_text": "The eBook can potentially go on forever. In my Space Opera series, set 600 years in the future, all the eBooks from now are still available, along with all of the ones which follow over the centuries. Hard books become an antique, not used for reading, just for display. There’s an interesting discussion going on at WriterSanctum forum at the moment about copyright extensions. The original copyright was based on books being published by a Publisher, and in some hard form. But a majority of books are now published electronically, and never get printed. And since the original digital book can easily be passed down a family and either updated or re-published, there is an argument for copyright being endless if a family make the effort to keep a book going. Not only will digital books exist in the future, but a lot of changes are coming because of it. ",
            "date": "Answered March 30, 2019",
            "views": "345",
            "upvotes": " View 2 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Zeel Patel",
                    "user_href": "/profile/Zeel-Patel-14"
                }
            ]
        },
        {
            "author_info": {
                "name": "Krunal Talajia",
                "href": "/profile/Krunal-Talajia"
            },
            "answer_text": "Reading is such a pleasure for those who are avid readers. And many of them don't even like the disturbance when they are so much involve in that particular book.  And their are highly chances that on any gadgets weather Kindle, laptop, iPad or phone  you reading the eBook surely gonna break your consistency . Where as  in paper book your consistency is gonna be intact .  And more over to it reading eBook results in exposure of your eyes to that sharp lights emitting from gadgets which are definitely not good. Zooming and scrolling is another problem with eBook.  Paper Book you can simply carry them anywhere anytime and you can enjoy reading without scrolling, zooming and affecting your eyes.  ",
            "date": "Answered May 9, 2016",
            "views": "332",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Kathleen Condon",
                    "user_href": "/profile/Kathleen-Condon-3"
                },
                {
                    "user_id": "Victor Eijkhout",
                    "user_href": "/profile/Victor-Eijkhout"
                }
            ]
        },
        {
            "author_info": {
                "name": "Deborah Elliott",
                "href": "/profile/Deborah-Elliott-20"
            },
            "answer_text": "Unfortunately, I think over time that technology replaces everything. It is my fervent hope that print books are not lost in my lifetime. That said, I have to admit to both publishing and reading electronic books, but I also have loaded bookshelves in my home. I have my Kindle with me all of the time and tend to use it for pleasure reading, but I want my reference books, cookbooks and favorite books on my bookshelf. ",
            "date": "Answered January 7, 2018",
            "views": "46",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Sha Hoek",
                "href": "/profile/Sha-Hoek"
            },
            "answer_text": "I would say no. A textbook is different than a regular book. In university I needed to be able to write on the pages, sketch out mini diagrams, highlight etc. Don't think you can do all of that with an e-book! Not to mention that the cost savings for the user don't seem to be there. I was looking at textbooks today and the e-book pricing was the same. I'd rather have the security of a physical copy for something so important (because technology issues always seem to happen when its important) ",
            "date": "Answered November 15, 2012",
            "views": "473",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Alaina Helena Rutan",
                    "user_href": "/profile/Alaina-Helena-Rutan"
                }
            ]
        },
        {
            "author_info": {
                "name": "Michael Alan Cavalier",
                "href": "/profile/Michael-Alan-Cavalier"
            },
            "answer_text": "There's always going to be people who prefer the look, feel, weight, and smell of printed books…every year I read “A Christmas Carol” in December. A few years ago I downloaded the book on an app and read it that way. When I was finished I dug out my hard back edition and read it a second time…it just wasn't as satisfying in the electronic version. ",
            "date": "Answered October 19, 2017",
            "views": "26",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Mehmud Khan",
                "href": "/profile/Mehmud-Khan-1"
            },
            "answer_text": "There is a high possibility it can happen but only if Kindle or other ebook readers start smelling like paperback. I am currently using Kindle paperwhite and it is so kind to one's eyes and I think it is a perfect replacement for paperbooks. Other than that, thinking about the future generations, the paper no matter how sustainable source are you using it still in a way comes from wood, I would vote for Ebooks, but please people think about the paperback smell that should be there in all ebook readers. ",
            "date": "Answered January 7, 2018",
            "views": "174",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Phinny Phoroza",
                "href": "/profile/Phinny-Phoroza"
            },
            "answer_text": "No But crazy thing is yes! Its already very popular all over the world. You see e-books are resourceful, you don’t have to utilize paper or ink. You don’t have to order the book and wait then uplift it because it transports digitally. It’s easy to use and you find them on phones and tablets, etc. Less luggage and some are audible. But guess what, there are people out there who prefer paper over pixels like ME! So yeah… ",
            "date": "Answered April 5, 2018",
            "views": "144",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Nirupam Banerjee",
                    "user_href": "/profile/Nirupam-Banerjee-2"
                },
                {
                    "user_id": "Alaina Helena Rutan",
                    "user_href": "/profile/Alaina-Helena-Rutan"
                },
                {
                    "user_id": "Richard Ure",
                    "user_href": "/profile/Richard-Ure"
                },
                {
                    "user_id": "Tanishq Varshney",
                    "user_href": "/profile/Tanishq-Varshney-2"
                },
                {
                    "user_id": "soilen.org",
                    "user_href": "/profile/soilen-org-1"
                },
                {
                    "user_id": "Maikou Scofield",
                    "user_href": "/profile/Maikou-Scofield"
                }
            ]
        },
        {
            "author_info": {
                "name": "Sneha Chaudhary",
                "href": "/profile/Sneha-Chaudhary-13"
            },
            "answer_text": "YES. the ebook can replace the paper book because it's easy to read ebooks than the paper book. I prefer the ebooks that easy that it is readable at any time whether its day or night with my comfort zone like front size to brightness to day mode to night mode. so ebook should replace the paper book. ",
            "date": "Updated March 1, 2019",
            "views": "304",
            "upvotes": " View 6 Upvoters",
            "upvoters": [
                {
                    "user_id": "Aksingh BZ",
                    "user_href": "/profile/Aksingh-BZ"
                },
                {
                    "user_id": "Andy Dyer",
                    "user_href": "/profile/Andy-Dyer-1"
                },
                {
                    "user_id": "Vipul Singhal",
                    "user_href": "/profile/Vipul-Singhal-18"
                },
                {
                    "user_id": "Sai Deepak Katepally",
                    "user_href": "/profile/Sai-Deepak-Katepally"
                },
                {
                    "user_id": "Lekshmi Nair",
                    "user_href": "/profile/Lekshmi-Nair-8"
                },
                {
                    "user_id": "Lyn Hardy",
                    "user_href": "/profile/Lyn-Hardy-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Abhishek Pendam",
                "href": "/profile/Abhishek-Pendam-1"
            },
            "answer_text": "There is a recent statement given by Stan Lee when he was asked if online comics were ever to replace Comic books. He said,\" Books are like Boobs, they look real nice on your computer, but feels even better when you hold them in your hands.\" I think you have your answer. :D Stan Lee \\m/ ",
            "date": "Answered March 27, 2016",
            "views": "207",
            "upvotes": " View 6 Upvoters",
            "upvoters": [
                {
                    "user_id": "Bila Kino",
                    "user_href": "/profile/Bila-Kino"
                }
            ]
        },
        {
            "author_info": {
                "name": "Sankalp Sidhant",
                "href": "/profile/Sankalp-Sidhant"
            },
            "answer_text": "Absolutely. Just because of a simply reason,’humanity loves the easier way out'. Apart from that, the amount of human effort it takes to create a book and publish it also comes under consideration. This process is considerably very simple in case of e-books. There are few other reasons also like why a e book should replace a physical book: 1)The physical books gives us knowledge on the cost of destroying our environment. 2)Its heavier to carry. And,we can't carry more than one book at a time. 3)It doesn't allow us flexibility to read. Hope,I have given some vivid answer to ur query. Thank you..!! ",
            "date": "Answered May 4, 2018",
            "views": "198",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Matthew Brown",
                "href": "/profile/Matthew-Brown-774"
            },
            "answer_text": "I don’t think they will. Ebooks are powerful and if you will portable books for people or “books on the go”. However, many people can’t shake the feeling of holding a paperback or hard copy because of how authentic it actually feels. When you read text on a computer, it doesn’t feel like a book but reading an article. Add to the fact that some books can’t be made into ebooks or that some aren’t ebooks. Books will I’ll be around as long as we are around:both paper and ebook. ",
            "date": "Answered March 12, 2019",
            "views": "97",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Dragi Raos",
                "href": "/profile/Dragi-Raos"
            },
            "answer_text": "Not yet. E-ink e-book readers are far more convenient for reading content like novels than DTBs* are, but for textbooks, atlases, heavily illustrated “coffee table books”, children’s picture books, there are no devices as yet rivaling the good old physical object. Large format tablets are close, but still no cigar. *) Dead Tree Book ",
            "date": "Answered May 13, 2019",
            "views": "287",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Casey Gott",
                    "user_href": "/profile/Casey-Gott-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Bharti Singh",
                "href": "/profile/Bharti-Singh-23"
            },
            "answer_text": "In my opinion, there's a slim chance. It's because of various reasons, few amongst many are as it's economically more feasible to have paper/physical book and people usually love to keep their collection in physical form. As far as a leading form of book is concerned,it completely depends upon one's personal preference. Rest you can read this answer for more reasons in favour of physical form of books. Bharti Singh's answer to How do you prefer reading books, as hardcover, paperback or as e-books? ",
            "date": "Updated April 17, 2018",
            "views": "268",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Zachary Stewart",
                "href": "/profile/Zachary-Stewart-54"
            },
            "answer_text": "I believe so, at the technological rate that we are headed towards now, e-books will take over paperback and hardcover books because we don’t feel the need for books, this is going to be the fall of man. Imagine someone hacking into the technology and destroying the mainfra-ok sorry I’m getting off track here. ",
            "date": "Answered December 12, 2018",
            "views": "158",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Alaina Helena Rutan",
                    "user_href": "/profile/Alaina-Helena-Rutan"
                }
            ]
        },
        {
            "author_info": {
                "name": "Jia Meiling",
                "href": "/profile/Jia-Meiling"
            },
            "answer_text": "Without doubts, e book has shared lots portions of traditional paper books market with the development of internet. for it is such convenient , you can download books what you want at one second, and take with a library wherever you go.I enjoy the convenience brought by e book, but i still like the traditional paper book, coz i DO really like the smell and how the paper feel in my hand, i can bury myself into reading literally... paper book is a culture, maybe it will be fading with the development of e book, but never gone. ",
            "date": "Answered May 19, 2016",
            "views": "273",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Kathleen Condon",
                    "user_href": "/profile/Kathleen-Condon-3"
                },
                {
                    "user_id": "Ben Adrian Sarmiento",
                    "user_href": "/profile/Ben-Adrian-Sarmiento"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/Sandor-Szabo"
                }
            ]
        },
        {
            "author_info": {
                "name": "Wang Yuanyan",
                "href": "/profile/Wang-Yuanyan"
            },
            "answer_text": "Yeah, e-content has become a trend, doesn't it? eBooks are portable, relatively cheaper than paper titles, easy to copy & share besides its resource-conserving. LOL, I recently write an article concerning this issue.eBook vs. printed book: 5 pros & cons of eBooks ",
            "date": "Answered November 15, 2012",
            "views": "1",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "C.Lee",
                    "user_href": "/profile/C-Lee-84"
                }
            ]
        },
        {
            "author_info": {
                "name": "Bill Raymond",
                "href": "/profile/Bill-Raymond-4"
            },
            "answer_text": "Not really. Paper books and magazines are still very popular. independent authors have found a very comfortable home with ebooks but print still reaches a wider audience.  Over time, I am sure print will be less desirable but I am betting we are quite a few generations away from ebooks really killing print.  ",
            "date": "Answered April 3, 2016",
            "views": "537",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Alaina Helena Rutan",
                    "user_href": "/profile/Alaina-Helena-Rutan"
                }
            ]
        },
        {
            "author_info": {
                "name": "Maitreyee Deshmukh",
                "href": "/profile/Maitreyee-Deshmukh"
            },
            "answer_text": "No! Have you ever smelled a brand new book better yet an old one from the archive? The fragrance is addictive! Have you ever felt the texture of a hard cover, in contrast to soft glossy pages in a coffee table book? The textures are sensational! Have you ever heard pages turn rapidly when reading a thriller by Agatha Christie, Dan Brown or Stephen King? That sound is the best asmr out there! So no, as long as we have all our five senses, I can't imagine “traditional” books being totally replaced. ",
            "date": "Answered December 12, 2018",
            "views": "395",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Elsa Dean",
                "href": "/profile/Elsa-Dean-2"
            },
            "answer_text": "I think so. Yeah. People are a lot more “greenwashed” today than they were before and if they feel like buying an e-book will save the rain forests (but forget gas emissions from using electricity, right?) then they will. I do get the appeal, though. It’s much more convenient, weighs less and you don’t need a light by your bed because the of the screen. So yeah. ",
            "date": "Answered December 12, 2018",
            "views": "162",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Adrian G Hilder",
                "href": "/profile/Adrian-G-Hilder"
            },
            "answer_text": "People still write letters with a pen and send faxes despite the ubiquity of email these days. I doubt paper will completely die out until some technology comes along that removes the need to read written words to get information into our brain. Children’s and non-fiction books are still mostly paper. Most genres of fiction you are looking at somewhere between around 60% and 95%+ (romance) market share with eBooks now. Yes, paper is practically dead for romance readers who tend to read a lot of books. These statistics are available online. ",
            "date": "Answered June 8, 2018",
            "views": "223",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Joni Lima",
                "href": "/profile/Joni-Lima"
            },
            "answer_text": "Basically it may, but I do not think it's a good idea. I answer briefly because there are several answers to this question and I do not want to repeat them. Check out my answers and you will find it. Bye :) ",
            "date": "Answered April 3, 2018",
            "views": "41",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Bobby Sammons",
                    "user_href": "/profile/Bobby-Sammons"
                }
            ]
        },
        {
            "author_info": {
                "name": "Bernard Mendoza",
                "href": "/profile/Bernard-Mendoza-5"
            },
            "answer_text": "Hi, Goldy. I’m sure it will happen and even sooner than we think. Schools will probably be able to do deals with publishers, students will have less to carry around in their bags. Better for everybody except printers and bookbinders, I suppose. ",
            "date": "Answered September 2, 2020",
            "views": "93",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Jayan Kandath",
                    "user_href": "/profile/Jayan-Kandath"
                },
                {
                    "user_id": "Alaina Helena Rutan",
                    "user_href": "/profile/Alaina-Helena-Rutan"
                }
            ]
        },
        {
            "author_info": {
                "name": "Hristo Samandjiev",
                "href": "/profile/Hristo-Samandjiev"
            },
            "answer_text": "I guess not. There are still people who like paper books just like me. They are just irreplaceable. If we manage to destroy all the wood on our planet in the distant future, then they will probably disappear. ",
            "date": "Answered November 30, 2017",
            "views": "10",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Savitha Kartha",
                "href": "/profile/Savitha-Kartha"
            },
            "answer_text": "A2A. I hope not. Though people do use Kindle but avid book lovers would just love the feel of real books, the smell of those pages and nothing can change that. The feel of cozying up on your couch with your favorite book is definitely a out of this world experience which no digital book can give you. ",
            "date": "Answered June 8, 2017",
            "views": "326",
            "upvotes": " Answer requested by Sherzod Sheka"
        },
        {
            "author_info": {
                "name": "Carel Van Wyk",
                "href": "/profile/Carel-Van-Wyk-2"
            },
            "answer_text": "Ebooks are very convenient and take up less space than normal books, but I prefer normal books because I like there smell and I like the rough texture of books. So I don't think ebooks will take over. ",
            "date": "Answered October 19, 2017",
            "views": "41",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Navaratna Rajaram",
                "href": "/profile/Navaratna-Rajaram"
            },
            "answer_text": "They will dominate. Books will go the way of manuscripts and film cameras. Look at what Wikipedia has done to Britannica. ",
            "date": "Answered March 30, 2019",
            "views": "58",
            "upvotes": " View 2 Upvoters "
        },
        {
            "author_info": {
                "name": "Camilo Ardiles",
                "href": "/profile/Camilo-Ardiles-1"
            },
            "answer_text": "I think so, it would be better for the planet. On my personal experience I did the change because otherwise I would need another house to store all my books. ",
            "date": "Answered September 2, 2020",
            "views": "16",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Deepak Moharana",
                "href": "/profile/Deepak-Moharana-1"
            },
            "answer_text": "No practically it not possible as there is a sense of reading ,touching the book and that cant be possible through the e-Book. you can carry the book anywhere you go and has no power consumption and it is totally overshadowed the e-book. ",
            "date": "Answered April 22, 2018",
            "views": "59",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Spencer Liu",
                "href": "/profile/Spencer-Liu-23"
            },
            "answer_text": "It depends. Many people still in favor of paper books . The paper books just touched so comfortable,and I could know when I will finish directly. ",
            "date": "Answered August 2, 2018",
            "views": "8",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "L. Stewart Hearl",
                "href": "/profile/L-Stewart-Hearl-1"
            },
            "answer_text": "Eventually. However textbook companies make huge profits from such so are avoiding ebook publication as long as possible. ",
            "date": "Answered September 2, 2020",
            "views": "17",
            "upvotes": " Answer requested by Quora User"
        },
        {
            "author_info": {
                "name": "David Lund",
                "href": "/profile/David-Lund-38"
            },
            "answer_text": "No, books are sacred to humankind and whatever digital form they have in the future, people will always have a special feeling about the paper . ",
            "date": "Answered December 12, 2018",
            "views": "47",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Talisman",
                "href": "/profile/Talisman-4"
            },
            "answer_text": "Always I choose paper books over  e books . They is no better feeling than having a book in your hand reading and turning over pages . Real books are always better. ",
            "date": "Answered May 9, 2016",
            "views": "10",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Nicholas Pope",
                "href": "/profile/Nicholas-Pope-8"
            },
            "answer_text": "No! I don’t read e-books as they don’t feel and smell the same as paper. I don’t mind spending more to get the real thing. ",
            "date": "Answered January 7, 2018",
            "views": "9",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "John Chapman",
                "href": "/profile/John-Chapman-103"
            },
            "answer_text": "No - for the same reason as this cartoon  ",
            "date": "Answered June 22, 2017",
            "views": "342",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Rupak Das",
                "href": "/profile/Rupak-Das-83"
            },
            "answer_text": "Yes. ",
            "date": "Answered March 30, 2019",
            "views": "23",
            "upvotes": " View Sharers"
        },
        {
            "author_info": {
                "name": "K Praveen",
                "href": "/profile/K-Praveen-16"
            },
            "answer_text": "no ",
            "date": "Answered October 19, 2017",
            "views": "22",
            "upvotes": "0"
        }
    ]
}