{
    "title": "Can a book help me find God’s purpose for my life? - Quora",
    "tags": [
        "Meaning of Life",
        "Purpose",
        "Theology",
        "God",
        "Book Recommendations",
        "Books",
        "Religion",
        "Philosophy of Everyday Life",
        "Life and Living"
    ],
    "response": [
        {
            "author_info": {
                "name": "Aniket Eche",
                "href": "/profile/Aniket-Eche"
            },
            "answer_text": "5 Great books help you find gods purpose for your life….. Not Religious but these books are spritual and Must read in this new age where everyone is busy in their lives and haven't got time to explore themselves. These books will surely help find you and the purpose of your life. The Secret - Rhonda bryne Based on the 2004 film of the same title and written by Rhonda Byrne (television producer, Melbourne), The Secret talks about the laws of attraction. This is a book that is going to show you how to believe in what you want, and actually get it because you believe in it. 2. To be told: know your story,shape your future-Dan B. Allender  Dan Allender tends to use a lot of Christian language in his work, but his writing can help anyone who wants to learn more about themselves and do better in life. The more you know about yourself, the better able you will be to understand why you do what you do, and how to make changes that will lead to your success in life. 3. A new Earth-awakening to your life's purpose-Eckhart Tolle  Check your ego at the door, and enjoy a more abundant life. This is the message from spiritual teacher Eckhart Tolle, who talks about how the ego is the cause of all conflict in life. This book was selected by Oprah Winfrey for her book club, and has been read by millions. 4. The art of happiness-HH Dalai Lama & Howard Cutler This is the book by the Noble prize for peace awart winner Dalai Lama this is a must read book which will lead you to happiness in your life. Author Howard Cutler wrote this Dalai Lama-inspired book for a Western audience. He talks about how important happiness is, and how easy it is to achieve. 5. Let your life speak- Parker J. Palmer  This book by Parker Palmer is a great book about work and meaning. The ideas in the book will help you with your vocation, by letting you see the author’s journey. There are loads of great quotes, which you are likely to read many times over for daily inspiration and affirmation. ",
            "date": "Answered June 19, 2020",
            "views": "92",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Riya Bisht",
                    "user_href": "/profile/Riya-Bisht-23"
                }
            ]
        }
    ]
}