{
    "title": "Can I become a self published author at age 14? - Quora",
    "tags": [
        "Novel Writing",
        "Self-Publishing",
        "Book Publishing",
        "Publishing",
        "Novels",
        "Writers and Authors",
        "Writing",
        "Teenagers and Teenage Years",
        "Books"
    ],
    "response": [
        {
            "author_info": {
                "name": "Sara Miller",
                "href": "/profile/Sara-Miller-7"
            },
            "answer_text": "Yes, you can. Christopher Paolini, the author of the Inheritance cycle, started writing his first book at around age 15. S. E. Hinton wrote The Outsiders in her teens and became a household name. There’s no reason why you can’t become a self-published author at a young age. My recommendation would be to prepare yourself before you become a self-published author. Take as many writing courses as you can; there may be some available for free at your local library. Befriend the librarians, because when you are published, they are going to be the ones who can recommend your book to readers. Read as much as you can about the industry as well. Join groups dedicated to the genre that you want to write in and learn what makes a book interesting to your potential readers. Buy a copy of the book Elements of Style as soon as you can. It is written by William Strunk Jr. and E.B. White (yes, the Charlotte’s Web author) as a guide to grammar, and it is incredibly helpful to carry around as advice for how to best structure your sentences. When you’ve finished your rough draft, it will feel like the tremendous accomplishment that it is. Don’t let that feeling of elation after finishing the first draft convince you that it’s ready to be published! You will need an editor to proofread and a few beta readers to make sure the story you are trying to tell is the story that readers see on the page. Listen to their feedback, because they are helping you make your book the best it can be. Don’t fall for companies that want to charge you to publish your book. The only charge you should receive from a publisher should be for purchasing physical author copies of your book. Becoming a self-published author the right way is a lot of work, but if you put in the effort there is nothing stopping you from becoming self-published at 14. I hope you do, and I wish you luck! ",
            "date": "Answered February 28, 2019",
            "views": "596",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Warren Bull",
                    "user_href": "/profile/Warren-Bull-3"
                },
                {
                    "user_id": "Prajwal Eliya",
                    "user_href": "/profile/प्र्जव्ल-Prajwal-Eliya"
                }
            ]
        }
    ]
}