{
    "title": "Can somebody tell me about the whole history of the Jews from Abraham's time up till today? Can you also recommend me some books I should read to know about Jews history up from Abraham to Egypt to Exodus till today? - Quora",
    "tags": [
        "Abraham (biblical figure)",
        "History of the Jewish People",
        "Judaism",
        "Jewish Ethnicities and People",
        "Book Recommendations",
        "Books",
        "Religion"
    ],
    "response": [
        {
            "author_info": {
                "name": "David Lev",
                "href": "/profile/David-Lev-11"
            },
            "answer_text": "Nobody can “tell” you the whole history of the Jewish people….our history is simply too vast. There are, however, some helpful books which might serve as an introduction. First, Max I. Dimont does a fair job of portraying the scope and complexity of the Jewish people in his 2 noteworthy books Jews, God, and History, and The Indestructible Jews. Both volumes have some minor flaws but generally speaking they make a pretty good introduction, and they’re very readable. I would also recommend To Be a Jew by Hayim Halevy Donin, which speaks to what it is to be a Jew today. That should be a good way to begin. There is, of course, a great deal more to learn than this, but all that will come when you are ready… ",
            "date": "Answered September 15, 2020",
            "views": "99",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Ian Sawyer",
                "href": "/profile/Ian-Sawyer"
            },
            "answer_text": "Original Question: Can somebody tell me about the whole history of the Jews from Abraham's time up till today? Can you also recommend me some books I should read to know about Jews history up from Abraham to Egypt to Exodus till today? Before you go searching, perhaps you should be aware that: There’s no evidence that Abraham ever existed.The story of Exodus, and all the characters in it, is entirely fictional.Biblical stories are one thing, but don’t go confusing them with real history; they’re very different. ",
            "date": "Answered September 11, 2020",
            "views": "124",
            "upvotes": " View 5 Upvoters",
            "upvoters": [
                {
                    "user_id": "Rafael Alvarado",
                    "user_href": "/profile/Rafael-Alvarado-6"
                },
                {
                    "user_id": "Benny Beit-Hallahmi",
                    "user_href": "/profile/Benny-Beit-Hallahmi"
                },
                {
                    "user_id": "Greg Baugher",
                    "user_href": "/profile/Greg-Baugher-2"
                },
                {
                    "user_id": "Sue Goff",
                    "user_href": "/profile/Sue-Goff-3"
                },
                {
                    "user_id": "Ahmed Elgazar",
                    "user_href": "/profile/Ahmed-Elgazar"
                }
            ]
        },
        {
            "author_info": {
                "name": "Jeffrey Samuels",
                "href": "/profile/Jeffrey-Samuels"
            },
            "answer_text": "I can’t recommend any books but if you go to youtube, there is a gentleman named Henry Abramson who does a great series of videos detailing the history of the Jews from earliest evidence through the modern era. ",
            "date": "Answered September 11, 2020",
            "views": "54",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Carolyn Zinchini",
                    "user_href": "/profile/Carolyn-Zinchini"
                }
            ]
        },
        {
            "author_info": {
                "name": "Ronald Weinger",
                "href": "/profile/Ronald-Weinger"
            },
            "answer_text": "Grayzel Solomon “A History of the Jews” Frederick M. Schweitzer “A History of the Jews” Max I Dimont “Jews, God and History” ",
            "date": "Answered September 11, 2020",
            "views": "39",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Jennifer Louise Porter",
                    "user_href": "/profile/Jennifer-Louise-Porter-2"
                },
                {
                    "user_id": "Tzivia Adler",
                    "user_href": "/profile/Tzivia-Adler"
                },
                {
                    "user_id": "Carolyn Zinchini",
                    "user_href": "/profile/Carolyn-Zinchini"
                }
            ]
        }
    ]
}