{
    "title": "Can I memorize biology NCERT for NEET in 15 days? - Quora",
    "tags": [
        "National Council of Educational Research and Training (NCERT)",
        "National Eligibility cum Entrance Test (NEET)",
        "Exam and Test Preparation"
    ],
    "response": [
        {
            "author_info": {
                "name": "Ishaan Kapur",
                "href": "/profile/Ishaan-Kapur-3"
            },
            "answer_text": "Hi, I will quote Marshall Mathers here, “You can do anything you set your mind to” So, following that memorising biology in 15 days can be done. But, let me bring you back to reality and taking you as a rational person, you should have started it earlier. The earlier the better. Now you have to put in double the efforts to do so. What I think you should do is, go get some online classes. Give them time, do the courses specifically developed for NEET and check out their video lectures on all the subjects. I will suggest you to opt for “m-learning” they will provide you all that you need to crack NEET. With more than 1100 hours of video lectures which have so detailed info. Go check them out on Google or search for their YouTube channel. All the best! ",
            "date": "Answered April 2, 2018",
            "views": "18",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Priyanka Sharma",
                    "user_href": "/profile/Priyanka-Sharma-2000"
                }
            ]
        },
        {
            "author_info": {
                "name": "Mrinal Ranjan",
                "href": "/profile/Mrinal-Ranjan-15"
            },
            "answer_text": " I don't think it's worth it to memorize biology. Because last 1 month should be given to practice and revision of all the chapters. Just memorizing the topics of bio will not help you much although you can do that. Also as you have already studies bio and other subjects why do you want to memorize it at this point. Just go in for revision of the topics. All the best ",
            "date": "Answered April 2, 2018",
            "views": "12",
            "upvotes": " Answer requested by Gavi Rangaiah",
            "upvoters": [
                {
                    "user_id": "S Kumar",
                    "user_href": "/profile/S-Kumar-486"
                }
            ]
        },
        {
            "author_info": {
                "name": "Sakshi Sharma",
                "href": "/profile/Sakshi-Sharma-514"
            },
            "answer_text": "You can if you have studied it thoroughly many times before. You cannot if you have just read through it superficially before. ",
            "date": "Answered April 23, 2017",
            "views": "800",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Gavi Rangaiah",
                    "user_href": "/profile/Gavi-Rangaiah"
                }
            ]
        },
        {
            "author_info": {
                "name": "Vandana R",
                "href": "/profile/Vandana-R-4"
            },
            "answer_text": "If u have already read all the topics thoroughly then you can revise them now.If you have not read it even once or dont have any idea about the topics then surely its not at all possible. ",
            "date": "Answered April 23, 2017",
            "views": "423",
            "upvotes": " View 1 Upvoter"
        }
    ]
}