{
    "title": "Can reading the Bible help you build a relationship with God? - Quora",
    "tags": [
        "God and the Christian Bible",
        "The Bible",
        "God",
        "Christianity"
    ],
    "response": [
        {
            "author_info": {
                "name": "Jody Gattey",
                "href": "/profile/Jody-Gattey"
            },
            "answer_text": "Definitely. It is the Word of God. It is God’s message to the world. It is unlike any other book, because it is authored by the inspiration of God’s Holy Spirt. He inspired men to write what they did, over thousands of years. I’m sure some did not even fully understand what they were writing, especially the prophetic books. But it all comes together the more you continue. The more it is studied, the more amazing it becomes. Because it is a spiritual book, and “deep”, one should pray for understanding as they read, and for God to show them what they need to know. He will show you surprising things. I suggest you start in the New Testament and learn about Jesus Christ. He is the key to everything in the Bible. Pray, that is, have conversations with God about anything and everything that you are discovering. Don’t expect to understand everything immediately, but take to heart what you do understand, and put the remainder “on a shelf” for the time being. More and more will unfold as you continue. There are many things that are interwoven from book to book and from one time period to another. Jesus said, “If you continue in My word, you are truly My disciple. And you will know the truth and the truth will set you free.” (John 8: 31–32) The first 4 books of the New Testament are eye-witness accounts about the life and teachings of Jesus, written by the disciples Matthew, Mark, Luke, and John. John is my favorite because he most clearly describes who Jesus is. There is some overlap but each one contains some information that the others don’t. These 4 books changed my life. Then after you read those, the book of Acts is the exciting account of how Christianity spread and about the early disciples, including persecutions and miracles. The book of Romans was written to the believers in Rome and contains important explanations of doctrine, especially what faith in Christ accomplishes. The rest of the New Testament is short books which were letters of instruction and encouragement and some correction to believers in other newly established Christian churches in various places. Each one has a particular theme and is still important advice for us today. The last book is Revelation and was written by John when he was old and Jesus appeared to him and told him what to write about the End Time or the Last Days. It has not happened yet and is difficult to understand everything because it contains a lot of symbolism, but it is about the Tribulation period and when God will pour out His wrath on those who are left on the earth after the Christians have been taken to Heaven. It requires deep study, but the first few chapters and last couple of chapters of Revelation are easily understood. Then when you are ready to tackle the Old Testament, the first book of Genesis contains much. Be sure to check out Psalms and Proverbs - they are both special and any chapter out of them can be read anytime. Psalms is full of worship and prayers and all kinds of emotions. Proverbs gives us God’s wisdom. The Old Testament is the Jewish religion, and in it we learn much about God and the promised Savior. “Man shall not live by bread alone, but by every word of God.” - (Matthew 4:4) ",
            "date": "Answered November 7, 2018",
            "views": "580",
            "upvotes": " View 12 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Roberto Barajas",
                    "user_href": "/profile/Roberto-Barajas-15"
                },
                {
                    "user_id": "Christlaine Toussaint",
                    "user_href": "/profile/Christlaine-Toussaint"
                },
                {
                    "user_id": "Jessica Fisher",
                    "user_href": "/profile/Jessica-Fisher-280"
                },
                {
                    "user_id": "William Anderson",
                    "user_href": "/profile/William-Anderson-338"
                },
                {
                    "user_id": "Amulya Hatake",
                    "user_href": "/profile/Amulya-Hatake"
                },
                {
                    "user_id": "Isha Singhal",
                    "user_href": "/profile/Isha-Singhal-35"
                },
                {
                    "user_id": "Stella Mei",
                    "user_href": "/profile/Stella-Mei-4"
                },
                {
                    "user_id": "Mark Hamric",
                    "user_href": "/profile/Mark-Hamric"
                },
                {
                    "user_id": "Jim Burney",
                    "user_href": "/profile/Jim-Burney"
                },
                {
                    "user_id": "Jerry Sorrell",
                    "user_href": "/profile/Jerry-Sorrell"
                },
                {
                    "user_id": "Onoriode Voke",
                    "user_href": "/profile/Onoriode-Voke"
                },
                {
                    "user_id": "Loren McCune",
                    "user_href": "/profile/Loren-McCune-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Mac McGarry",
                "href": "/profile/Mac-McGarry-1"
            },
            "answer_text": "The bible is not “a book”. It's many books, written by many authors, none of whom are known with any degree of certainty. It contains some really absurd stories and constantly contradicts itself. How then do you suppose that it could help build a relationship with another entity for which there is absolutely no empirical evidence? When you see other answers here, they'll be studded with quotes from this nonsense tome. Ask yourself of any claim: How could they know this?Is there ANY evidence for the claim?Most people who spout this stuff are only repeating what others have said. None have met a god or conversed with one. They even have the arrogance to say that they “know” stuff when in actual fact - they can't and don't. They will tell you that you should have ‘faith’. This means that you should believe WITHOUT any evidence. They have the temerity to call this ‘reason’ and ‘logic’. In any other walk of life, when would this be acceptable? Why should religion get special pleading? Do you know of any banks that would provide a mortgage based on faith? Go to DTMV and ask for a license to drive a large truck. If they want you to sit some kind of test tell them that they should just “have faith”. For the same reasons - that should be sufficient. You may also tell people that you have the cure for cancer. All they (patients) have to do is ask and Jesus will give them. IT SAYS SO IN THE BOOK, SO IT MUST BE TRUE. ",
            "date": "Answered November 7, 2018",
            "views": "265",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Evan Poole",
                    "user_href": "/profile/Evan-Poole"
                },
                {
                    "user_id": "Jim Brown",
                    "user_href": "/profile/Jim-Brown-437"
                }
            ]
        },
        {
            "author_info": {
                "name": "Mike Settle",
                "href": "/profile/Mike-Settle-3"
            },
            "answer_text": "It can make you think or feel that you are building a relationship with someone or something you cannot see and cannot verify if any of these feelings are coming from you or somewhere else. You can choose to believe its “building a relationship with God” if you choose to believe it long enough and ignore all the confusing things in the Bible (which if you were honest doesn’t help build any relationship with God at all). By the way, the Bible never says it helps you “build a relationship with God”. It says all kinds of different things in different places because it is written from the perspective of old societies who were constrained by the development of religion at their point in history. You can invest meaning in whatever you want and you can hang around people going to bible studies who confirm your view. If it helps you to believe that- good for you. ",
            "date": "Answered November 6, 2018",
            "views": "176",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Sam Adams",
                "href": "/profile/Sam-Adams-128"
            },
            "answer_text": "It’s safe to say that, if more people actually read the bible (as opposed to simply accepting the sound bites they hear from the pulpit or heard in Sunday School) there would be far more atheists in this world. After all, the god of the Bible bears the title of the most unpleasant character in all fiction for good reason. What words come to mind when we think of God? Merciful? Just? Compassionate? In fact, the Bible lays out God’s primary qualities clearly: jealous, petty, unforgiving, bloodthirsty, vindictive—and worse! God: The Most Unpleasant Character in All Fiction: Dan Barker, Richard Dawkins: 9781454918325: Amazon.com: Books After all: Buy a bible, never read it and you’re a good Christian;Buy a bible, read selected passages and you become a pious SOB;Buy a bible, read it thoroughly and you become an atheist.Or, if you prefer the words of Mark Twain:  Have to say that in my case I realized that there was no evidence that god (any god) exists but reading the bible convinced me that, if he does exist, he’s not worthy of worship. ",
            "date": "Answered November 7, 2018",
            "views": "115",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Diane Shatto",
                "href": "/profile/Diane-Shatto"
            },
            "answer_text": "Absolutely. God revealed himself through the Bible. There is natural revelation (His creation), and then there is special revelation (the Bible). The Bible reveals God’s purposes for you and for the world. Not only that, but the Bible was not written by man’s interpretation. Every single Word was written by the inspiration of God - each Word was God-breathed. As we read the Word, God is revealing Himself to us and we are developing a relationship with Him. Imagine if your mom wrote you a letter once a week. She is revealing herself in each letter. If you didn’t read it, you’d still have a relationship with your mom, but if you did read each letter every week you’d be drawing closer to your mother as time goes on. Imagine next time you see her how close you would feel to her, and you’d both feel like you know each other. It’s the same with the Bible on even a greater scale. I encourage you to start reading. It’s not as easy to read as your mom’s letters. It takes time to get to know the mind and heart of God. But you will and it will all be worth it! ",
            "date": "Answered November 7, 2018",
            "views": "206",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Jerry Sorrell",
                    "user_href": "/profile/Jerry-Sorrell"
                },
                {
                    "user_id": "Mark Hamric",
                    "user_href": "/profile/Mark-Hamric"
                }
            ]
        },
        {
            "author_info": {
                "name": "Stephan Hokke",
                "href": "/profile/Stephan-Hokke"
            },
            "answer_text": "Yes. But you must read it in depth. Any English translation has flaws and thus you are encouraged to go once through lightly and then dig into Genesis with an amplified version. Lucky is he that speaks Aramaic fluently as that is the original language of the Bible. After Genesis, you might be wise to take up the gospels followed by a study of Paul’s works. The apparency of discrepancies is from the faults in translation from the original Aramaic, into Greek and into English. A dig into an apparently incoherent section would usually reveal a faulty translation and a failure to bring out the full flavour of the original Aramaic. Further, the Hebrew mind is an action based one whereas the Greek/Western one is a conceptual one. The Hebrew is based on agricultural society and the concept of cycles such as seasons. These make a difference in meaning. Your reading will bring up an understanding of a God who is seeking to communicate with those he created and to have a meaningful dialogue with them. And yes, he does communicate back as things seem to happen “by accident” to help you develop your relationship with Him. Do not fall into a trap of relying on another to create or establish a relationship except Yahshua (aka Jesus), Yahshua is the gateway to YHWH and has a special place in this but is not a via. He did the hard yards to make it possible for us to be allowed to communicate to YHWH. Yahshua is an example to us of how we should live our lives. But he wants us to build our relationship with YHWH directly but in so doing mention that he was the one that made the introduction (in a way). There is nothing in this world more important than establishing a relationship with THE Creator. ",
            "date": "Answered November 7, 2018",
            "views": "205",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Jim Gilligan",
                "href": "/profile/Jim-Gilligan-8"
            },
            "answer_text": "No, the Pharisees were the religious leaders of Christ’s day, they Spent hours of their day studying and reading the word of God. Not only were they miss understanding the bible, they were abusing the followers of their faith, ignoring Gods message of compassion and care. To add insult to injury it was the religious elders who conspired to crucify Jesus. The men who spent the most tome reading and studying the bible were those who orchestrated Christ’s death. Jesus said, if you love me keep my commands, He meant. If you love me, go and love other people as I have loved you. The Pharisees read the bible but didn’t have love, that’s why Jesus left us with one law, one command, love others. Reading the bible is sort of important, understanding Jesus commanding us to love others in His name will show Jesus how much you love Him ",
            "date": "Answered June 7, 2020",
            "views": "65",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Vivian Amis",
                "href": "/profile/Vivian-Amis"
            },
            "answer_text": "No. The bible is a book. You can read it and even memorize it, but it can not bring you closer to God. You can go to church or stand on your head….and you would not be closer to God. God is a spirit and dwells within you. How could he see or hear or know about your actions in this world? He knows nothing of this world. In order to build a relationship with God…you must go within and learn to love God with all your heart ( give up your attachments) all your mind (let go of desires) and all your soul (put your life into God’s hands) and love your neighbor as yourself. ",
            "date": "Answered November 7, 2018",
            "views": "155",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "TJ Berens",
                "href": "/profile/TJ-Berens-1"
            },
            "answer_text": "From my experience, and others I know, actually reading the entire bible cover to cover, several times, and becoming very familiar with it, and thinking deeply about what it all means, seems to result in atheism. Basically, there are simply too many problems with it to ignore, and, over time, they build up, and become an insurmountable obstacle. I DO find, conversely, that reading only certain parts, and not reading the reality conflicting parts, and not thinking deeply about what it all means, CAN help to build a relationship with God. :D ",
            "date": "Answered November 7, 2018",
            "views": "69",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Christian Questions",
                "href": "/profile/Christian-Questions"
            },
            "answer_text": "Absolutely. Bible study is the best way to know and understand the Bible for yourself and begin and build a relationship with God. There are many ways you can study the Bible. We actually have a short video (only 5 minutes) on how to study the Bible so that it does make sense VIDEO: CQ BIBLE 101 - How to Study the Bible and Have it Make Sense | Christian Questions Bible Podcast You’ll learn that there is more than one way to study the Bible and actually begin to understand it. You can also request a free booklet called “How to Study the Bible and Have it Make Sense” from our friends at Christian Resources, simply by clicking here: FREE Booklet - How to Study the Bible ",
            "date": "Answered November 7, 2018",
            "views": "83",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Brittany L",
                "href": "/profile/Brittany-L-71"
            },
            "answer_text": "Yes most definitely ! The Bible tells us a lot about God, what he likes and dislikes, and what he expects of us. For instance, God tells us how we shouldn’t behave, qualities he dislikes at 1 Corinthians 5:11 “11 But now I am writing you to stop keeping company with anyone called a brother who is sexually immoral or a greedy person or an idolater or a reviler or a drunkard or an extortioner, not even eating with such a man.” Since he doesn’t want us associating with those who are sexual immoral or a drunkard then no doubt he doesn’t want us to behave that way. The Bible is a powerful source to happiness and everlasting life, we just have to open it ! (Psalm 1:1,2) jw.org ",
            "date": "Answered November 8, 2018",
            "views": "55",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Masayo Hanyuda",
                "href": "/profile/Masayo-Hanyuda"
            },
            "answer_text": "Oh…yes, it is due to you’ll understanding better about the God and wants to know more about him. He is invisible to us in this generation but it may be due to we don’t believe in God honestly. He might be among us but none of humans ever find it out. It is the way God is. However, he’ll shows up when the time comes. ",
            "date": "Answered November 6, 2018",
            "views": "50",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Tom Polic",
                "href": "/profile/Tom-Polic"
            },
            "answer_text": "No. If you can't build a relationship with god just by breathing then you definitely won't build one by reading. ",
            "date": "Answered August 6, 2020",
            "views": "29",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "John Bradley Gomez",
                "href": "/profile/John-Bradley-Gomez"
            },
            "answer_text": "It can help but it is not the sole requirement for relationship. It’s personal ",
            "date": "Answered November 6, 2018",
            "views": "30",
            "upvotes": "0"
        }
    ]
}