{
    "title": "Can somebody explain 'The Secret' book’s secret in an answer? - Quora",
    "tags": [
        "The Secret Circle (TV series)",
        "The Secret (book)"
    ],
    "response": [
        {
            "author_info": {
                "name": "Bruce Claver",
                "href": "/profile/Bruce-Claver"
            },
            "answer_text": "I read “The Secret” when it first came out and while I bought into what Rhonda Byrne wrote, I couldn’t help but think two things. Throughout her book, she makes reference to, “the secret” that every successful person who ever lived, lived by and used to propel them to success but us common people, we’ve never been privy to what the secret is, until now and Ms. Byrne’s book. She goes on and on and on about this and that but never specifically mentions what “the secret” is. Motivational speakers back her up on her claims. She makes references to “its power” but leaves you guessing until the very end and even then, you’re not 100% sure what specifically the secret is other than to be a positive thinker with a positive attitude towards everything and some other concepts.Ms. Byrne makes reference after reference about how poor she was and all the bad/negative in her life until one day….her daughter handed her a book that changed her life….that taught her there was a secret…and on she goes. What’s that book her daughter gave her? Um…that’s apparently a secret because as far as I can recall (I read her book like ten years ago), she does not mention the name of the book.Wanna know a secret? I know the secret. I know her secret and I know the name of the book her daughter handed her that references “the secret.” I also know that none of what she wrote is original except for how she marketed it. Rhonda Byrne was given one of the most popular books of all time, published in 1937, it continues to be published today and 95% of what was written in the book, holds true today which is why it continues to be a best seller. Here’s another secret, the author reveals “the secret” in one of the first chapters and refers to it as a secret (probably where Byrne came up with her title) but does not focus on it or keep you guessing for the entire book “Think and Grow Rich” by Napoleon Hill is the gold standard…the playbook, the handbook and instruction guide to just about every motivational speaker and author’s lessons on motivation and positive living. While every motivational speaker takes parts of his book and turns it into their mantra, it is Napoleon Hill who really brought all the philosophy together. Not all of what he writes is original but certainly he writes in manner that seems to make sense and work, if you believe and follow the basic philosophy. Rhonda Byrne did just that and made millions of dollars, so yes, it can work. My advice is to buy N. Hill’s book and read the real “secret” in its entirety without the mystical mystery and goofiness that Byrne uses. It’s an easy read. You’ll quickly learn in chapter one, page 7 where Hill writes, “When you begin to think and grow rich, you will observe that riches begin with a state of mind, with definiteness of purpose…” and on page 9 where he writes,” “Little by little, the truth has unfolded itself, until it now appears certain that the principles described in this book hold the secret of mastery over our economic fate.” A person’s state of mind is the absolute secret to absolutely anything & everything that you have ever wanted or even did not want. The rest of the book explains how to achieve that state of mind. And if you really think about it, state of mind really is what sets apart the winners from the defeated.  ",
            "date": "Answered June 19, 2019",
            "views": "704",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Chi Nhan Nguyen",
                "href": "/profile/Chi-Nhan-Nguyen"
            },
            "answer_text": "I recommend 2 book that call Dotcom secrets[1] book and expert secrets[2] book Expert Secrets is the second half of a journey you have already started. Something you experienced in your life started you on this path, which caused you to want to become more. You started to read books, study, and experiment with the things you learned, and by doing so you have become who you are today, an EXPERT. But as most experts soon find, no matter how much personal development you achieve, there will be a point where you can no longer progress. The only way to continue to grow is by helping others become like you. Yes, true growth and fulfillment comes from your contribution to others Your message has the ability to change someone’s life. The impact that the right message can have on someone at the right time in their life is immeasurable. It could help to save marriages, repair families, change someone’s health, grow a company or more… But only if you know how to get it into the hands of the people whose lives you have been called to change. Expert Secrets will help you? Find your voice and give you the confidence to become a leader…Show you how to build a mass movement of people whose lives you can affect…Teach you how to make this calling a career, where people will pay you for your advice…Footnotes[1] FREE BOOK - DotComSecrets, The Underground Playbook For Growing Your Company Online...[2] Expert Secrets - Get Your FREE Copy",
            "date": "Answered January 21, 2018",
            "views": "506",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Akhil Sharma",
                "href": "/profile/Akhil-Sharma-178"
            },
            "answer_text": "THOUGHTS are the secret, thoughts flow through ether and go far beyond that you cannot even imagine,swami vivekananda had also told to watch the thoughts, its all about concentration, when we starts to become more concentrating then our mind starts to becoming more fit and then we can watch our thoughts and turn them positive as we want,as the vibration of thoughts increase, they become stronger and travel more fast,i suggest read the think and grow rich by napoleon hill, this book is the origin of all today's self help books,material is very much but every word is true and tested in that book, when you've mastered the secret then move on to LAW of success, whatever you need to gain anything is written in these two books,i can say after reading and applying rules of these two books you wont need any other self help or motivational booK ",
            "date": "Answered September 6, 2016",
            "views": "660",
            "upvotes": " View 2 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Chhatra Ram",
                    "user_href": "/profile/Chhatra-Ram"
                },
                {
                    "user_id": "Prince Kapoor",
                    "user_href": "/profile/Prince-Kapoor-10"
                }
            ]
        },
        {
            "author_info": {
                "name": "Karen Fereira",
                "href": "/profile/Karen-Fereira"
            },
            "answer_text": "I'll be very short about since I too haven't read and my friend narrated the meaning to me. Comprises of an energy in the whole universe, so if you want something in life such as an object or person you need to constantly think about it and work towards it. You shouldn't think anything bad at all since that would be you emitting negative energy and it would come back to you. So the basic principle here is to focus on what you want and you will get it. Hope this helps. ",
            "date": "Answered September 5, 2016",
            "views": "473",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Harshit Upadhyay",
                    "user_href": "/profile/Harshit-Upadhyay-9"
                }
            ]
        },
        {
            "author_info": {
                "name": "Purvi Dodia",
                "href": "/profile/Purvi-Dodia-1"
            },
            "answer_text": "What we think that happens.Our thoughts rules… ",
            "date": "Answered July 4, 2018",
            "views": "58",
            "upvotes": "0"
        }
    ]
}