{
    "title": "Can you go bankrupt if you invest in stocks? - Quora",
    "tags": [
        "Bankruptcy",
        "Investment Advice",
        "Stocks (finance)",
        "Stock Markets"
    ],
    "response": [
        {
            "author_info": {
                "name": "Cody Carden",
                "href": "/profile/Cody-Carden-8"
            },
            "answer_text": "Going bankrupt, or unable to pay debts, is rare for investors who own common stocks or funds with cash money. But sometimes investors will use what is called margin, which is borrowed money, which if they lose more than they borrow, will of course have to pay all the borrowed money back, WITH INTEREST. Most cases where this happens is when investors put large amounts of money in companies that are very volatile, like penny stocks or smaller publicly traded companies that have high percentage gains or losses. It is uncommon for investors to lose so much money in blue chip companies, but if they have to live off investments and the economy gets put in a recession, like currently, these investors may not make enough to support themselves, which could give them trouble to pay debts, which is bankruptcy. ",
            "date": "Answered March 27, 2020",
            "views": "209",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Difu Wu",
                "href": "/profile/Difu-Wu"
            },
            "answer_text": "Absolutely. If you have all your money in stocks and buy them on margin, your net worth goes to zero in a margin call that you cannot meet. To avoid this, don’t use excessive leverage. If you can’t trust yourself to do that (after all, OPM is very addictive), just don’t use margin at all and buy stocks outright with cash only. There is nothing wrong with getting rich slowly. Don’t go broke trying to get rich quickly. ",
            "date": "Answered March 28, 2020",
            "views": "135",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Les Kutas",
                "href": "/profile/Les-Kutas"
            },
            "answer_text": "Yes, but without using leverage it is very difficult to do. Using leverage on the other hand, it is breathtakingly easy. Margin requirements vary with the times but are 50% in ordinary times. Any contraction of 50% or more at such a time will lead you toward bankruptcy. ",
            "date": "Answered March 28, 2020",
            "views": "286",
            "upvotes": "0"
        }
    ]
}