{
    "title": "Can I send a completely finished book to publishers? - Quora",
    "tags": [
        "Publishers",
        "Book Writing",
        "Book Publishing",
        "Publishing",
        "Writers and Authors"
    ],
    "response": [
        {
            "author_info": {
                "name": "Jody Lebel",
                "href": "/profile/Jody-Lebel"
            },
            "answer_text": "It’s good that your book is finished. Only then will anyone ever consider taking a look at your work. Now, let’s talk about PUBLISHERS I'm going to assume you have taken writing classes and seminars and have written a spectacular, sharp novel that contains no grammatical errors, has no cliches, has a fresh plot, compelling characters, hooks where they are supposed to be, that you have inserted twists, that your pacing is perfect, and you wrote killer dialogue. I'm going to assume you know the market, what is expected in your genre, and have written the correct number of pages according to the guidelines. I'm going to assume your chapters are the correct length for the type of story you wrote, that the scenes are stellar, and that there are no POV problems. If you haven’t done all of that … don’t bother reaching out to a publisher. Remember your competition is every known and successful author in the world who are also contacting publishing houses and pitching their books. How can you compete with them if your book isn’t up to par? If your book is really ready, here's what you do: There is a difference between an agent, who tries to find a publishing house to take on your book, and an editor at a publishing house who also might offer a book contract. Let's start with the publishing houses. In the publishing world there are five major publishing houses: Penguin Random House (Penguin, Dutton, Putnam, Random House, Alfred A. Knopf, Doubleday, Crown, etc.) , Simon & Schuster (Poseidon, Pocket, Threshold, etc.), HarperCollins (Harlequin, etc.), Macmillan (St. Martin's Press, Tor, etc.), and Hachette (Little, Brown & Company, etc.) Very few of the Big 5 publishers and their subsidiaries accept unsolicited manuscripts. You must query them first, which involves you knowing how to write a killer one-page letter asking them if they are interested in reading more of your novel. If they are, they will request 3 chapters and a synopsis of your book, which requires you to know how to write a synopsis. Then you wait. I waited for 18 months once (and I had an agent) for Harlequin to send me a rejection letter. There are many, many smaller publishing houses. Yes, they don't have the power and reach that the Big 5 does, but you have to start somewhere. My suggestion is to scout around the Internet and find an agent that represents the type of book you have written. Query him/her and see if you can get a contract with an agency. Then let the agent do the job of shopping your book around to publishers. They have the contacts and the knowhow. Yes, you pay them a fee from your sales. But you wouldn't have had any sales without them. And they don't market to the 'little publishers'; not enough money in that for either of you. Also make sure your book is ready. Have it read by other writers and take their comments seriously. One good site to try is querytracker. com. That is a free website that lists agents and publishers and tells you which ones take which genres and what their requirements are and how to submit to them. Not every agent in the world is listed here but there's around 1400 of them on this site. Do your homework and find publishers on that site that take on new writers that don't have an agent. Query them. If you don't know what a query letter is Google it...there are many sites that show you how to write that letter. Smaller publishing houses may be more willing to take a chance on a new writer than one from the Big 5. If you are lucky enough to get a request for 3 chapters and a synopsis, and you don’t know how to write a synopsis … check out this blog: 2017 Submission Alert — Your Synopsis - Writers In The Storm To get the attention of an agent or editor you MUST write a book they want to represent. With that said, only query the ones that represent the genre your book is in. The query letter is the industry standard. Learn to write a killer query that hooks the agent and makes him/her want to read your work. I always (even though it says not to) include the first 5 pages of my ms (manuscript) along with the query. If they are interested, they will read them. If they read the first few pages and I can hook them, I'll get a request for a partial, which is 3 chapters. So there's your in... a killer query and a grab-em-by-the-throat first five pages. Just make sure the rest of the ms is as good as the first 5 pages. The other way to get the eye of an agent is to attend local writing conferences where agents are setting appointments. Most times, unless your book is just awful, they will ask for you to send the first 3 chapters as a courtesy because you attended the conference. There's your in. Make sure your chapters are sharp and fresh. The conference has a fee, but if you can fit it in your budget it is well worth it in just the lectures and knowledge you are going to gain. Here is an interesting diagram of what’s what in the publishing industry. The Big Five US Trade Book Publishers Also check this website out. It was updated October 7, 2018. https://www.thebalance.com/the-big-five-trade-book-publishers-2800047 Check out my e-book for more writing tips: Write Better Right Now: Creative Writing Tips http://amzn.com/B00IHIWUDC Only $1.99. ",
            "date": "Answered January 1, 2019",
            "views": "1",
            "upvotes": " View 3 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Bailee Dugan",
                    "user_href": "/profile/Bailee-Dugan"
                },
                {
                    "user_id": "Alex Sewell",
                    "user_href": "/profile/Alex-Sewell-1"
                },
                {
                    "user_id": "Michael Kay",
                    "user_href": "/profile/Michael-Kay-23"
                }
            ]
        },
        {
            "author_info": {
                "name": "Sean Buvala",
                "href": "/profile/Sean-Buvala"
            },
            "answer_text": "We don’t want a finished book; We do however want to see that you understand the overall process and see solid writing in what you submit via the submission guidelines. If you have good writing, I am more interested that you have a fantastic audience full of eager fans and buyers. If you are doing a kids’ book, don’t promise any artist that you will be using their art. You probably won’t. When we are taking submissions, I prefer a solid presentation based on our submission guidelines. No matter what you send a publisher, they will be deconstructing it anyway. :-) Keep writing, keep reaching out to your audience. ",
            "date": "Answered December 30, 2018",
            "views": "303",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Alex Sewell",
                    "user_href": "/profile/Alex-Sewell-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Jewel Parago",
                "href": "/profile/Jewel-Parago"
            },
            "answer_text": "You need to check the publishers submission guidelines. Typically, most publishers want a finished manuscript because unless you have a long standing relationship with them, they have no idea how long it would take an author to finish the book. Not every author can work with writing guidelines. By receiving a finished manuscript, they can evaluate the manuscript to determine if it fits into their line up of forthcoming books, and how much editing and work would be needed so it could be added to their production schedule if they option it. Keep in mind that most publishers are looking for more than simply a finished manuscript, so do your homework and know what publisher you are planning to make your submission to so that you can address everything they want. ",
            "date": "Answered December 9, 2019",
            "views": "375",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Sarvesh Kumar",
                "href": "/profile/Sarvesh-Kumar-1773"
            },
            "answer_text": "Yes, certainly it is suggested to send a complete book to the publisher rather than sending it in parts. Sending it in parts would be a problem as the publisher may lose focus on your book. As they have large number of book and manuscripts to review, edit and carry out other publishing works. Therefore, it is suggested to send a completely done book or manuscript to a publisher. I would also suggest you to do a good research on the type of publishing house you wish to get your masterpiece printed I.e. traditional publishing house or a self-publishing house. Have a Great Day! ",
            "date": "Answered September 27, 2019",
            "views": "132",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Emil Fortune",
                "href": "/profile/Emil-Fortune-1"
            },
            "answer_text": "You can, if that’s the sort of thing they consider. You need to check their submissions policy and follow it meticulously - if they ask for a synopsis and the first three chapters, that’s what you should send. But most publishers won’t consider unsolicited manuscripts - you need to go via a literary agent, who have their own submission guidelines. Same rules apply. What I would emphasise though is that if you have written a novel - or any long form bit of fiction - you almost always need to have finished writing it. That is, don’t just write three chapters and expect to sell a book off the back of that. ",
            "date": "Answered March 11, 2019",
            "views": "157",
            "upvotes": " Answer requested by Alex Sewell",
            "upvoters": [
                {
                    "user_id": "Alex Sewell",
                    "user_href": "/profile/Alex-Sewell-1"
                },
                {
                    "user_id": "Edward Conway",
                    "user_href": "/profile/Edward-Conway"
                },
                {
                    "user_id": "Kat Stevenson",
                    "user_href": "/profile/Kat-Stevenson-11"
                }
            ]
        },
        {
            "author_info": {
                "name": "Elaine Calloway",
                "href": "/profile/Elaine-Calloway"
            },
            "answer_text": "No, you should never do that. You should do research on the publisher - many of them don’t accept anything unless the work is agented, meaning you need an agent first. Go to Find the Agent Who Will Find You a Publisher to learn about what agents represent and how you should query them. Most times, a query letter is what you begin with. This is a one page info letter with the very basics about your book, a blurb to “tease”, a paragraph about you, and a friendly closing. IF they are interested, they will ask for 3 chapters. In some cases, they will ask for the whole thing. But you should never, ever, just send the full thing automatically. That will get you an instant rejection. ",
            "date": "Answered December 30, 2018",
            "views": "199",
            "upvotes": " View 3 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Michael Fitzjohn",
                    "user_href": "/profile/Michael-Fitzjohn-1"
                },
                {
                    "user_id": "Alex Sewell",
                    "user_href": "/profile/Alex-Sewell-1"
                },
                {
                    "user_id": "Shelley McCoy",
                    "user_href": "/profile/Shelley-McCoy"
                },
                {
                    "user_id": "John Dasef",
                    "user_href": "/profile/John-Dasef"
                }
            ]
        },
        {
            "author_info": {
                "name": "Marva Dasef",
                "href": "/profile/Marva-Dasef"
            },
            "answer_text": "If their submission requirements allow it, then you can. Don’t do it if they specify cover letter and synopsis only or cl/s and first three chapters. If they want to see the whole book, they’ll get back to you. If a publisher does not accept direct submissions from authors, don’t bother sending even a cover letter. ",
            "date": "Answered December 30, 2018",
            "views": "118",
            "upvotes": " View 4 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Alex Sewell",
                    "user_href": "/profile/Alex-Sewell-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Los Cowans",
                "href": "/profile/Los-Cowans"
            },
            "answer_text": "You can but you’re unlikely to get much of a response. Most publishers do not accept unsolicited manuscripts but only take seriously work sent through an agent or other clearing house. So you might want to research agents who specialise in your type of writing and see if you can get a bite. Good luck. ",
            "date": "Answered December 30, 2018",
            "views": "67",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Alex Sewell",
                    "user_href": "/profile/Alex-Sewell-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Warren Bull",
                "href": "/profile/Warren-Bull-3"
            },
            "answer_text": "Publishers will tell you what they require in submissions. It is good that you have a “finished” book. Especially if you are a new writer, it will help you get an agent and will make your work more attractive to publisher that don’t require agent submission. Just keep in mind that finished at this point means: ready for more edits based on feedback from an agent or publisher. ",
            "date": "Answered December 30, 2018",
            "views": "165",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "David Clive Ramsey",
                    "user_href": "/profile/David-Clive-Ramsey"
                },
                {
                    "user_id": "Alex Sewell",
                    "user_href": "/profile/Alex-Sewell-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Brendan McNally",
                "href": "/profile/Brendan-McNally"
            },
            "answer_text": "Certainly you can send it, but they won’t read it. They’ll refuse delivery, or they’ll throw it away unseen. Accepting it, opens them up to all kinds of stupid legal liability. If you want a publisher to look at it, you’ll need to do it through an agent. ",
            "date": "Answered September 2, 2019",
            "views": "45",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "John Chapman",
                "href": "/profile/John-Chapman-103"
            },
            "answer_text": "Most publishers now work through literary agents. Try those first. Although they take 15–20% of your income from the publisher they have the contacts needed and probably can negotiate a better deal than you can. ",
            "date": "Answered December 30, 2018",
            "views": "82",
            "upvotes": " View 2 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Alex Sewell",
                    "user_href": "/profile/Alex-Sewell-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Will Edwards",
                "href": "/profile/Will-Edwards-23"
            },
            "answer_text": "You can, but they won’t like it. Generally they will prefer an outline and a sample chapter. But, if you are planning approach trad publishers, your best bet is to get an agent. ",
            "date": "Answered October 10, 2020",
            "views": "15",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Dave Payton",
                "href": "/profile/Dave-Payton-1"
            },
            "answer_text": "Thanks for the A2A. I should hope it’s finished. They won’t consider an unfinished work, when they’ve got piles of finished ones ready to go. ",
            "date": "Answered December 31, 2018",
            "views": "44",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Alex Sewell",
                    "user_href": "/profile/Alex-Sewell-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Jean Rafenski Reynolds",
                "href": "/profile/Jean-Rafenski-Reynolds"
            },
            "answer_text": "You’ll probably need an agent. Go to the library and borrow the latest edition of Writer’s Market. Learn about how the publishing industry works. Then start thinking about how to submit your book to a publisher. In the publishing world, you always want to present yourself as a professional. ",
            "date": "Answered December 30, 2018",
            "views": "98",
            "upvotes": " View 1 Upvoter "
        }
    ]
}