{
    "title": "Can you keep Kindle books forever? - Quora",
    "tags": [
        "eBook Readers",
        "Amazon Kindle (product)",
        "eBooks"
    ],
    "response": [
        {
            "author_info": {
                "name": "Anthony Deming",
                "href": "/profile/Anthony-Deming"
            },
            "answer_text": "No. Like all “streaming” services, the contents of Amazon’s library is dependent on licenses with publishers, and the contents of your Kindle library is dependent on the contents of Amazon’s library. If Amazon ever goes out of business, or decides that the whole “Kindle thing” isn’t worth their time/money anymore, then your Kindle library will disappear, just like happened to Microsoft’s ebook store. Microsoft Is Closing Its Ebook Store and Taking the Books With It In a similar vein, if Amazon loses the license to a book, or determines that the company that listed it through their site doesn’t have the rights to it, they remove it from your Kindle library. Amazon Erases Orwell Books From Kindle Devices They’ve also done this for less noble reasons. Why is Amazon removing Thousands of Kindle eBooks? And of course, there’s always the possibility that Amazon will just take a disliking to you in particular, and delete your account. When this happens, you have no recourse to get it reinstated or retrieve the books that you’ve previously “purchased”. Amazon wipes customer's Kindle and deletes account with no explanation When you hit the “Buy” button on an ebook, you aren’t buying it. You’re renting it for as long as the company feels like it. ",
            "date": "Answered December 17, 2019",
            "views": "754",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Mihir Kumar Jha",
                    "user_href": "/profile/Mihir-Kumar-Jha-1"
                },
                {
                    "user_id": "Thomas P. Buehner",
                    "user_href": "/profile/Thomas-P-Buehner"
                }
            ]
        },
        {
            "author_info": {
                "name": "Dragi Raos",
                "href": "/profile/Dragi-Raos"
            },
            "answer_text": "Yes, with a caveat. E-ink Kindles retain the content downloaded to them even when you de-register them. So, even if Amazon goes out of business, your content is safe, but will be readable only on device(s) where it has already been downloaded. So, the limit is the life of your Kindle(s). What you are buying is a license, but a perpetual license. So, the publisher cannot (legally) say “Nah, we don’t want people to read the title any more. We will revoke their licenses.” (Before anybody jumps in with the “1984 affair” example, that was different: the seller did not hold rights to the particular edition, and, after the uproar, amazon reinstated the licenses although they already reimbursed the buyers.) If you want to be 100% sure, you can back up your content via USB to some permanent storage. Should Amazon go out of business or “that the whole “Kindle thing” isn’t worth their time/money anymore”, to quote Anthony, it is technically almost trivial, and in that situation will be legal, to decrypt your content and use it where you want. ",
            "date": "Answered December 18, 2019",
            "views": "471",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Snehal Yadav",
                    "user_href": "/profile/Snehal-Yadav-62"
                },
                {
                    "user_id": "A Dhanush Kartik",
                    "user_href": "/profile/A-Dhanush-Kartik-1"
                }
            ]
        }
    ]
}