{
    "title": "Can anyone arrange the Harry Potter books from best to worst? - Quora",
    "tags": [
        "Harry Potter (book series)",
        "Harry Potter (creative franchise)"
    ],
    "response": [
        {
            "author_info": {
                "name": "Deanna Eppers",
                "href": "/profile/Deanna-Eppers-1"
            },
            "answer_text": "I love all the books. If you read them in order it is perfect. They are intended to take you from and eleven year old’s point of view (HP and the Sorcerer's Stone when Harry was eleven) up to the Deathly Hallows when Harry was seventeen, and the book is written for a seventeen year old’s level. So I can’t place them in order of favorites other than the order they are in, because the books are perfectly in order. It would be akin to asking what Lord of the Rings book is the best. Well…they all are if you read them in context and they all lead up to the end. Perfectly. So JK Rowling knew what she was doing. Read them in order and you will be taken from an innocent child’s view of the world, though not a world without pain…and go through that awkward phase with the characters and recall your own awkward years. Then go onto the blossoming of young adulthood with its responsibilities. They. Are. Perfect. Enjoy them. Spoiler alert now…. Though I really do like Goblet of Fire. So much going on there. First dance. First faltering steps toward dating. Hosting other schools. Dreamy Cedric Diggory. Or dreamy Fleur Delacour, depending on your point of view. And the three tasks. Oooh. Spooky stuff. And Half Blood Prince. What? No more Dumbledore? Wha??! And that moment, that gut punch in The Deathly Hallows when we see how GOOD Snape was all those years since Harry was attacked. Perfection. Literary perfection. All the books in beautiful order designed by the author to be just that. Literary bliss. ",
            "date": "Answered October 22, 2017",
            "views": "590",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Deepika Garg",
                "href": "/profile/Deepika-Garg-69"
            },
            "answer_text": "Well, thier are two best to worst situations. One as in for HJarry, which was the worst year and which was the best, the other in us, which book was the most thrilling and which one the least thrilling. For us, the books, which were the most thrilling to the books which were the least thrilling. Harry Potter and the Deathly Hallows Harry Potter and the Goblet of Fire Harry Potter and the Order of the Phoenix Harry Potter and the Chamber of Secrets Harry Potter and the Prisoner of Azkaban Harry Potter and the Philosophers Stone Harry Potter and the Half Blood Prince. Well, this is my order of the best books to the worst books, every one has different lists. Now, the order in the way Harry might have categorised his years from the best to worst. Harry Potter and the Philosophers Stone Harry Potter and the Half Blood Prince Harry Potter and the Prisoner of Azkaban Harry Potter and the Chamber of Secrets Harry Potter and the Goblet of Fire Harry Potter and the Order of the Phoenix Harry Potter and the Deathly Hallows. I guess that no one will argue with me in this list, will they, Harry’s worst year had to be the seventh one, and the best had to be the first, as it was the year no one died, nothing bad happened and of course, Harry came to Hogwarts. ",
            "date": "Answered October 19, 2017",
            "views": "351",
            "upvotes": " View 2 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Dhruv Pandya",
                    "user_href": "/profile/Dhruv-Pandya-17"
                },
                {
                    "user_id": "Vivek Saraswat",
                    "user_href": "/profile/Vivek-Saraswat-28"
                }
            ]
        },
        {
            "author_info": {
                "name": "Gary Benantes",
                "href": "/profile/Gary-Benantes"
            },
            "answer_text": "There is no definitive answer. It all comes down to what you, as a person, think. Personally, though, my books would be: Goblet of Fire - It’s so boring.Prisoner of Azkaban - A dull read that provides me with nothing but convenient occurrences. What if Pettigrew was discovered by Harry with the map? What if Sirius’ plan went wrong?Order of the Phoenix - It’s so looooooooong. Also, Umbridge.Deathly Hallows - Read it a few too many times. I absolutely hate any part where they’re camping. Also, Ron is even more of a dick than usual.Half-Blood Prince - Again, read it a few too many times. It’s still a decent book nonetheless.Chamber of Secrets - A good book from start to finish but has a few odd moments and isn’t very well knitted together.Philosopher’s Stone - The original and the best. If only it had been longer! (Please not Order of the Phoenix-long, though…)",
            "date": "Answered October 22, 2017",
            "views": "303",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Mansi Saxena",
                "href": "/profile/Mansi-Saxena-57"
            },
            "answer_text": "For everyone, the arrangement can differ. But for me, I am arranging them from the ones I like a little less to the ones I love the most. Harry potter and the goblet of fire Harry potter and the half blood prince Harry potter and the prisoner of azkaban Harry potter and the philosopher's stone Harry potter and the order of phoenix Harry potter and the chamber of secrets Harry potter and the deathly hallows ",
            "date": "Answered October 19, 2017",
            "views": "735",
            "upvotes": " View 19 Upvoters",
            "upvoters": [
                {
                    "user_id": "Ananya Shrivas",
                    "user_href": "/profile/Ananya-Shrivas-1"
                },
                {
                    "user_id": "Ashok Gaur",
                    "user_href": "/profile/Ashok-Gaur-29"
                },
                {
                    "user_id": "Saharsh Saxena",
                    "user_href": "/profile/Saharsh-Saxena-12"
                },
                {
                    "user_id": "Harshita Saxena",
                    "user_href": "/profile/Harshita-Saxena-52"
                },
                {
                    "user_id": "Sneha Shrivastava",
                    "user_href": "/profile/Sneha-Shrivastava-25"
                },
                {
                    "user_id": "Deeksha Gopaliya",
                    "user_href": "/profile/Deeksha-Gopaliya"
                },
                {
                    "user_id": "Werner Hesinberg",
                    "user_href": "/profile/Werner-Hesinberg"
                },
                {
                    "user_id": "Tom Hanks",
                    "user_href": "/profile/Tom-Hanks-166"
                },
                {
                    "user_id": "Sean Paul",
                    "user_href": "/profile/Sean-Paul-142"
                },
                {
                    "user_id": "Vinnie Agrawal",
                    "user_href": "/profile/Vinnie-Agrawal"
                },
                {
                    "user_id": "Saharsh Saxena",
                    "user_href": "/profile/Saharsh-Saxena-8"
                },
                {
                    "user_id": "Sanjay Saxena",
                    "user_href": "/profile/Sanjay-Saxena-144"
                },
                {
                    "user_id": "Anjali Lalwani",
                    "user_href": "/profile/Anjali-Lalwani-9"
                },
                {
                    "user_id": "Pooja Patidar",
                    "user_href": "/profile/Pooja-Patidar-36"
                },
                {
                    "user_id": "Vedanshi",
                    "user_href": "/profile/Vedanshi-7"
                },
                {
                    "user_id": "Saharsh Saxena",
                    "user_href": "/profile/Saharsh-Saxena-4"
                },
                {
                    "user_id": "Joel Molina",
                    "user_href": "/profile/Joel-Molina-9"
                },
                {
                    "user_id": "Dhruv Pandya",
                    "user_href": "/profile/Dhruv-Pandya-17"
                },
                {
                    "user_id": "Rishabh Goel",
                    "user_href": "/profile/Rishabh-Goel-135"
                }
            ]
        },
        {
            "author_info": {
                "name": "Kiruba Ryuu",
                "href": "/profile/Kiruba-Ryuu"
            },
            "answer_text": "Harry Potter Series from best to worst #7 Harry Potter and the Philosopher’s Stone  #6 Harry Potter and the Chamber of Secrets  #5 Harry Potter and the Prisoner of Azkaban  #4 Harry Potter and the Goblet of Fire  #3 Harry Potter and the Order of the Phoenix  #2 Harry Potter and the Half-Blood Prince  #1 Harry Potter and the Deathly Hallows  Because growing up thinking that the story would soon end has always been the worst part!! ",
            "date": "Answered October 19, 2017",
            "views": "427",
            "upvotes": " View 5 Upvoters",
            "upvoters": [
                {
                    "user_id": "Trevor Whitlow",
                    "user_href": "/profile/Trevor-Whitlow-2"
                },
                {
                    "user_id": "Dhruv Pandya",
                    "user_href": "/profile/Dhruv-Pandya-17"
                },
                {
                    "user_id": "Vivek Saraswat",
                    "user_href": "/profile/Vivek-Saraswat-28"
                },
                {
                    "user_id": "Aryama Bhattacharyya",
                    "user_href": "/profile/Aryama-Bhattacharyya"
                },
                {
                    "user_id": "Sharad Venkataraman",
                    "user_href": "/profile/Sharad-Venkataraman"
                }
            ]
        },
        {
            "author_info": {
                "name": "Natalie Wang",
                "href": "/profile/Natalie-Wang-35"
            },
            "answer_text": "Completely my opinion, but here it is. Also, ALL of the books are amazing. This is just the way I prefer them. Order of the Phoenix  Half-Blood Prince  Goblet of Fire  Deathly Hallows  Philosopher/Sorcerer’s Stone  Chamber of Secrets  Prisoner of Azkaban  ",
            "date": "Answered October 25, 2017",
            "views": "691",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Andrea Burnc",
                    "user_href": "/profile/Andrea-Burnc"
                }
            ]
        },
        {
            "author_info": {
                "name": "Anthony Vandenbosch",
                "href": "/profile/Anthony-Vandenbosch"
            },
            "answer_text": "So, starting with worst… Half-blood princeChamber of secretsOrder of the PhoenixDeathly HallowsPhilosopher’s stonePrisoner of AzkabanGoblet of Fire ",
            "date": "Answered March 19, 2019",
            "views": "86",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Nathan Beard",
                    "user_href": "/profile/Nathan-Beard-6"
                }
            ]
        }
    ]
}