{
    "title": "Has anyone read the book 'The Dhandho investor'? If so, what do you think about the book? - Quora",
    "tags": [
        "The Dhandho Investor",
        "Reading",
        "Book Recommendations"
    ],
    "response": [
        {
            "author_info": {
                "name": "Krushna Jadhav",
                "href": "/profile/Krushna-Jadhav-4"
            },
            "answer_text": " ‘The Dhando Investor’ by Mohnish Pabrai one of the best books for peoples who want to learn about investing is all about The Dhando approach of investing. Firstly book starts with the example patel ,Manilal dhando as well as how Richard branson and laxmi mittal used Dhando approach in their business is explained. DHANDO FRAMEWORK includes following points: 1.Invest in existing business: Mohnish said that it is always better to invest in existing business than starting new business. because starting new business has high risk than investing in existing business. 2.Invest in simple business with ultra slow rate of change: It is better to invest in business with slow rate change. As warren buffet did with co-cola. Investing in IT business is not that good thing as it is rapidly changing industry. 3.Invest in distressed business in distressed industries: Distressed business means business that is suffering from finance or any other things. Investing in this business is like “Head I win ,tail I don’t lose much.” 4.Invest in Business with durable moat: Moat stands for the competitive advantage . 5.Bet heavily when odds are in your favor: When odds are in your favor like when there is 95 % chance winning, bet heavily as per Kelly's formula. But it is always better to invest by taking calculated risk. 5.Focus on arbitage: Arbitage means taking advantage of price between two markets.e.g. If gold is trading in India at $600 and at same time trading at $620 in London. Buying in India and immediately selling in London is arbitage. 7.Margin of safety Buy business or stock of company always less than its intrinsic value. High discount to intrinsic value means high return, low risk. 8.Invest in low risk and high certainty business Calculate the risk and invest only in low risk business. 9.Invest in copycats instead of innvotors: Because copycats have the low risk. This is all about the Dhando framework. Selling stock: Having exit plan is more important than buying stocks. Normally sell the stocks when its current price is greater than the intrinsic value. Thanks for reading! ",
            "date": "Answered January 10, 2018",
            "views": "37",
            "upvotes": " View 19 Upvoters",
            "upvoters": [
                {
                    "user_id": "Aaditya Pokharel",
                    "user_href": "/profile/Aaditya-Pokharel"
                },
                {
                    "user_id": "Mohsin Shaikh",
                    "user_href": "/profile/Mohsin-Shaikh-76"
                },
                {
                    "user_id": "Siddharth Kshatriya",
                    "user_href": "/profile/Siddharth-Kshatriya"
                },
                {
                    "user_id": "Akash Gupta",
                    "user_href": "/profile/Akash-Gupta-1043"
                },
                {
                    "user_id": "Sai Mahesh Patnaik",
                    "user_href": "/profile/Sai-Mahesh-Patnaik"
                },
                {
                    "user_id": "Jugal Patel",
                    "user_href": "/profile/Jugal-Patel-39"
                },
                {
                    "user_id": "Sanket Yeole",
                    "user_href": "/profile/Sanket-Yeole-8"
                },
                {
                    "user_id": "Nicholas Flavius",
                    "user_href": "/profile/Nicholas-Flavius-1"
                },
                {
                    "user_id": "Sourav Mondal",
                    "user_href": "/profile/Sourav-Mondal-251"
                },
                {
                    "user_id": "Giridhar Maddukuri",
                    "user_href": "/profile/Giridhar-Maddukuri"
                },
                {
                    "user_id": "Sarvpriya Ankit Kumar",
                    "user_href": "/profile/Sarvpriya-Ankit-Kumar"
                },
                {
                    "user_id": "Uday Pathak",
                    "user_href": "/profile/Uday-Pathak-37"
                },
                {
                    "user_id": "Kiran Kumar",
                    "user_href": "/profile/Kiran-Kumar-2062"
                },
                {
                    "user_id": "Virendra Goswami",
                    "user_href": "/profile/Virendra-Goswami-1"
                },
                {
                    "user_id": "Ayush Bansal",
                    "user_href": "/profile/Ayush-Bansal-152"
                },
                {
                    "user_id": "Vaibhav Deshmukh",
                    "user_href": "/profile/Vaibhav-Deshmukh-80"
                },
                {
                    "user_id": "Gopal Gupta",
                    "user_href": "/profile/Gopal-Gupta-127"
                },
                {
                    "user_id": "Swapnil Thigale",
                    "user_href": "/profile/Swapnil-Thigale"
                },
                {
                    "user_id": "Prashant Toshniwal",
                    "user_href": "/profile/Prashant-Toshniwal"
                }
            ]
        },
        {
            "author_info": {
                "name": "Kaushal Jain",
                "href": "/profile/Kaushal-Jain-122"
            },
            "answer_text": " ‘The Dhandho Investor’ by Mohnish Pabrai Before I begin, let me give you a brief introduction to the author of the book. The author of the book,’The Dhandho Investor’ is Mohnish Pabrai. He is an Indian-American businessman, investor, and philanthropist. He was born in June 1964. Pabrai has great admiration for Warren Buffett and agrees that his investment style is followed by Buffett and others. Today, he is the managing partner of Pabrai Investment Funds. Another book by Mohnish Pabrai is ‘Mosaic’. In this book, Pabrai has concentrated the Warren Buffett method of investing that are presented in a sequence of articles he authored for various newsletters and web sites between 2001 and 2003 (the book reprints these articles). The theme of the book: The theme,’The Low-Risk Value Method to High Returns’, is reflected in the cover of this book. It is one of the best books on investing that I have read because the ideas of investing in this book are described in a very simple language. In the first chapter,’Patel Motel Dhandho’, Pabrai explains the way how Patel owns the half market share of the motel business in the US. He describes that some inhabitants of the Patel community were doing business in Uganda. Hence, Patel’s business extended so high that the dictator of Uganda asked them to leave the country and let the money of the nation remain in its boundaries….\"The Dhandho Investor\" by Mohnish Pabrai ",
            "date": "Answered February 27, 2020",
            "views": "630",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Anisha Das",
                    "user_href": "/profile/Anisha-Das-136"
                },
                {
                    "user_id": "Kaushal Jain",
                    "user_href": "/profile/Kaushal-Jain-90"
                }
            ]
        },
        {
            "author_info": {
                "name": "Suraj Rao Ghadge",
                "href": "/profile/Suraj-Rao-Ghadge"
            },
            "answer_text": "The Dhandho Investor is book about Minimizing risk and high profit mainly this book focus on particular communities Gujratis , Marwaris it's inspire by many norms but this two communities have a base of business since Mughal and British empire . The author says that for several of centuries Gujraties were used to travel for trading with their Asian and African neighbour a book is full package for how to buy/do business with just finding intrinsic ( real) value of business or Stock.  The book journey is undertaken by Papa Patel , Manilal ,Richard Branson and mittal marwari . For the Indian reader this book is seems like their friend becasue all the time when you want to learn about investing or business world only prefer you the foreign author but for this time this Indian writer will shock you with simple way of doing business . In this book the nine principle constitute the Dhandho framework they are : * Focus on buying existing business * Buy simple business in industries with an ultra rate of change * Buying distressed business in distressed industries * Buy business with a durable competent advantage * Bet heavily when the odds are overweight /over cold mainly in your favour * Focus on arbitrage * Buy business with big discount to underlying their intrinsic value * Look for low risk high uncertainty business * It's better to be a copy cat than an innovator This book will going to be interesting for mainly Indian by giving Indian example that will caught your attention like how 5th pass gujrati, marwari become the millionaire with penny investment. The book also consist of some fulgurant Quote like \" Head's I win , tails I don;t lose much \" In the end I will rate this book 4 * out of 5 Thank you ",
            "date": "Answered April 15, 2020",
            "views": "589",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Oliver Sung",
                "href": "/profile/Oliver-Sung-4"
            },
            "answer_text": "The Dhandho Investor is an obvious choice to read for people wanting to dive into the value investing framework and principles. As a modern language version of Ben Graham’s classic “The Intelligent Investor” in terms of philosophy and state of mind, I can’t recommend Monish Pabrai’s book enough! ",
            "date": "Answered January 22, 2020",
            "views": "508",
            "upvotes": "0"
        }
    ]
}