{
    "title": "Have any of the “revelations” from the Bible ever actually come true? - Quora",
    "tags": [
        "Predicting the Future",
        "Biblical Archaeology",
        "Biblical History",
        "Book of Revelation",
        "Christian Theology and Philosophy",
        "Theology",
        "The Bible",
        "Christianity"
    ],
    "response": [
        {
            "author_info": {
                "name": "Carson Spratt",
                "href": "/profile/Carson-Spratt"
            },
            "answer_text": "It’s interesting that an entire line of Biblical criticism has been spawned by ideological commitments to the contrary. “We must disprove all the prophecy in the Bible!” “Why?”“Because I’m too scared to think about the existence of the supernatural. Therefore, all the prophecies are fakes!” Given this, you will find plenty of a-historical, evidence-free claims that many prophetic parts of the Bible were written after the events in question - only because these prophecies are uncannily accurate. Daniel chapter 8, for instance. Daniel records a vision which describes a great goat which rises and conquers the whole world, even the previous powerful kingdoms. After the goat’s horn (which is a symbol of authority) is broken, it divides into four smaller horns - exactly how Alexander’s kingdom was divided among his generals. And lest there be any doubt, the angel shortly thereafter translates the vision for Daniel: “And the male goat is the kingdom of Greece. The large horn that is between its eyes is the first king. As for the broken horn and the four that stood up in its place, four kingdoms shall arise out of that nation, but not with its power.” On top of this, it is pretty widely recognized that this portion of Daniel was written exactly when it claims to have been: far, far before Alexander became king. Or there’s the example of Cyrus, who is named in Isaiah 45, written far before he comes to conquer Babylon. For those who are ideologically committed to never considering the alternative, these accurate prophecies are in themselves evidence of the falsity of prophecy. They reason to themselves that “No prophecy can be very accurate, because prophecy doesn’t exist. Therefore, that which seems to be an accurate prophecy is a fake, which proves that prophecies don’t exist.” Ah, what a wonderfully self-fulfilling prophec….I mean system of literary criticism. This is barely the tip of the iceberg. Prophecies all throughout Scripture are fulfilled in later parts of Scripture, on a regular basis. Fulfilled Prophecy Demonstrates the Divine Inspiration of Scripture Always forward, Carson ",
            "date": "Answered August 1, 2018",
            "views": "11",
            "upvotes": " View 19 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Madison Hancock",
                    "user_href": "/profile/Madison-Hancock-11"
                },
                {
                    "user_id": "Raymond St Steven",
                    "user_href": "/profile/Raymond-St-Steven"
                },
                {
                    "user_id": "Jason Cañas",
                    "user_href": "/profile/Jason-Cañas"
                },
                {
                    "user_id": "Justin Plagenza",
                    "user_href": "/profile/Justin-Plagenza"
                },
                {
                    "user_id": "Clay Stanton",
                    "user_href": "/profile/Clay-Stanton-1"
                },
                {
                    "user_id": "A. Berean",
                    "user_href": "/profile/A-Berean"
                },
                {
                    "user_id": "Jaap-Jan de Wit",
                    "user_href": "/profile/Jaap-Jan-de-Wit"
                },
                {
                    "user_id": "Antonio Sabatini",
                    "user_href": "/profile/Antonio-Sabatini-1"
                },
                {
                    "user_id": "Christopher Murphy",
                    "user_href": "/profile/Christopher-Murphy-86"
                },
                {
                    "user_id": "Danny De Beer",
                    "user_href": "/profile/Danny-De-Beer"
                }
            ]
        },
        {
            "author_info": {
                "name": "Elaine Vandort",
                "href": "/profile/Elaine-Vandort"
            },
            "answer_text": "Of course. Many of them. And many of them are coming true as I write this. All that has happened in History was recorded in the Bible thoislands of years ago. I'll state a few major ones. The rise and fall of the world kingdoms from Babylon to Medo-Persia to Greece to Rome to Europe. That was foretold in the Book of Daniel including all the details such as Alexander the great of Greece defeating Medo-Persia and His kingdom being divided among three generals.The period of persecution by the Catholic church for 1260 years from 538A.D to 1798A.D. The number 1260 is precisely given in the Bible.The capture andof death of the Pope towards the end of this time period of 1260 yearsThe rise of Papal Rome and the Pope and the murder of the Ostrogoths, Vandals and the Hirulis by their powerAnother prophecy which is rapidly being fulfilled is the discomfort between Isalmic and Christian nations. Turkey is soon to march into Jeruselem.Jesus Christ Himself prophesied of the sun being darkened and stars falling from the sky immediately after that time of tribulation I mentioned earlier. Just as Jesus said, on May 19th 1780, at noon all over the New England states, the Sun was darkened and the darkness lasted until midnight. On November 13, 1833, there was a meteoric shower (stars falling from the sky) of a duration th s t was never witnessed before or after.The technological advancement we see today. The Bible says that knowledge will increase and men will be running to and fro.The Bible also gives revelations of the nature of people in the last daysday which we are living in; violent, idolatrous, lustful, consumed in their own world, mocking God and His warning that He still mercifully gives to His people before it is too late.",
            "date": "Answered August 2, 2018",
            "views": "144",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Sophia Lim",
                    "user_href": "/profile/Sophia-Lim-8"
                }
            ]
        }
    ]
}