{
    "title": "Have you ever read Enid Blyton books? - Quora",
    "tags": [
        "Enid Blyton Books",
        "Enid Blyton (author)",
        "Children's and Young Adult Books",
        "eBooks",
        "Literature",
        "Reading",
        "Book Recommendations",
        "Books"
    ],
    "response": [
        {
            "author_info": {
                "name": "Mickie Southam",
                "href": "/profile/Mickie-Southam"
            },
            "answer_text": "Have you ever read Enid Blyton books? I was just about weaned on Enid Blyton books and loved them until I was about 10 or perhaps a little younger. I started with Noddy and Big Ears, went on to the Magic Faraway Tree when I was about five, and finished up with the Famous Five and the Secret Seven when I was a little older. I remember for several years I strongly identified with George of the Famous Five. I thought she was wonderful. A couple of years ago, I saw an offer on Amazon Kindle for three of the books and bought them, and went for a stroll down Memory Lane. I couldn’t believe what an objectionable little brat she seems to the adult me. No wonder I was clouted so often when I was a child. They were certainly fun for a kid to read, but I clearly didn’t have much taste. ",
            "date": "Answered March 6, 2019",
            "views": "459",
            "upvotes": " View 12 Upvoters",
            "upvoters": [
                {
                    "user_id": "Arkaraj Choudhary",
                    "user_href": "/profile/Arkaraj-Choudhary"
                },
                {
                    "user_id": "Ishani Patel",
                    "user_href": "/profile/Ishani-Patel-83"
                },
                {
                    "user_id": "Shamanthaka",
                    "user_href": "/profile/Shamanthaka"
                },
                {
                    "user_id": "Anne Percy",
                    "user_href": "/profile/Anne-Percy"
                },
                {
                    "user_id": "Gina Langridge",
                    "user_href": "/profile/Gina-Langridge"
                },
                {
                    "user_id": "Dane Clarke",
                    "user_href": "/profile/Dane-Clarke-1"
                },
                {
                    "user_id": "Barbara Pavey",
                    "user_href": "/profile/Barbara-Pavey"
                },
                {
                    "user_id": "Faith Abbott",
                    "user_href": "/profile/Faith-Abbott-3"
                },
                {
                    "user_id": "Shobhit Desai",
                    "user_href": "/profile/Shobhit-Desai"
                },
                {
                    "user_id": "Gill Bullen",
                    "user_href": "/profile/Gill-Bullen"
                }
            ]
        },
        {
            "author_info": {
                "name": "Barbara Steinhauser",
                "href": "/profile/Barbara-Steinhauser"
            },
            "answer_text": "Have I ever read Enid Blyton books? When I was 12, my father was transferred to a town near Frankfurt for two years. While there I met the most interesting girl, with a wild imagination. She was from the States, but had lived in Great Britain and was reading a book I hadn’t seen in the US. I think it was a Roald Dahl’s “Charlie and the Chocolate Factory”. We discovered we were both bookworms and she invited me to her fancy home where she introduced me to The Famous Five series. I think she had Eight and I borrowed them all. The adventures this crew went on were nothing I had read before and I couldn’t get enough. Through Cindy I also fell in love with Puffin books and even now, I attach a specific and unique scent to those beloved young adult paperbacks. Thanks for asking! I saw this a bit ago and didn’t know where on Quora the question went. I had to answer! Your question brought back the best of memories. ",
            "date": "Answered March 17, 2019",
            "views": "210",
            "upvotes": " View 2 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Arkaraj Choudhary",
                    "user_href": "/profile/Arkaraj-Choudhary"
                },
                {
                    "user_id": "Shobhit Desai",
                    "user_href": "/profile/Shobhit-Desai"
                }
            ]
        }
    ]
}