{
    "title": "Have you ever met a celebrity in your life? - Quora",
    "tags": [
        "Celebrities",
        "Experiences in Life",
        "Interpersonal Interaction"
    ],
    "response": [
        {
            "author_info": {
                "name": "Sushan Sharma",
                "href": "/profile/Sushan-Sharma-5"
            },
            "answer_text": "Not fond of celebrities although have meet quite a few when I was working with Kingfisher airlines as an airhostess where my designation was In-flight Manager(IFM). Being an IFM, my designated area of service was bussiness class where mostly business tycoons, celebrities, politicians used to travel in. Listing few and my observation and perception about these so called celebrities… Shahrukh Khan: In the airport surrounded by people pushing and dashing eachother to take his picture or to give a glance. One person by mistake touched him. He literally threw his hand in the air and said “dont you dare touch me”….I was like seriously!!!!Preity Zinta: I served her choice of main course and then to her co passenger too which was different choice. By then she had already started her meal but looks at the other meal and says “ can I have that too”…. I was like seriously!!!!Katrina kaif: Starter was served to her which was tomator shorba (tomato soup) with dash of butter. After taking a sip she spits it back in the bowl and says “ why didnt you tell me that it has a butter”…. I was like seriously!!!!Ritesh Deshmukh: Took window seat first row,his adjacent seat was vacant. Two actresses I honestly dont know their names,sat on the second row. After take off,he sat on the armrest and put his feet on the seat with his shoes on and chatting with those actresses. I went to him and asked him to put his feet down. The expression he gave was as if he owns the aircraft… I was like seriously!!!Kangana Ranaut: While taking her meal orders, I addressed her as Ms Rawath. She with an attitude tells me “ my name is Ranaut”. I didnt know its Ranaut…. And I was like seriously!!!!There are many more,I actually dont remember their names but I never had any good experience with these celebrities when it comes to their attitude, pride,ego and many more… My family, friends used to ask me, you get to meet celebrities but why you dont take pictures with them. I was like if I meet personalities like APJ Abdul, Barack Obama, Mother Teresa then definitely I would love too….. :) ",
            "date": "Updated August 17, 2018",
            "views": "13",
            "upvotes": " View 277 Upvoters",
            "upvoters": [
                {
                    "user_id": "Preethi",
                    "user_href": "/profile/Preethi-462"
                },
                {
                    "user_id": "Akshay C",
                    "user_href": "/profile/Akshay-C-98"
                },
                {
                    "user_id": "Nirban Ghosh",
                    "user_href": "/profile/Nirban-Ghosh-3"
                },
                {
                    "user_id": "Ankit Tiwari",
                    "user_href": "/profile/Ankit-Tiwari-2117"
                },
                {
                    "user_id": "Sharda Joshi",
                    "user_href": "/profile/Sharda-Joshi-17"
                },
                {
                    "user_id": "Shrishti Dwivedi",
                    "user_href": "/profile/Shrishti-Dwivedi-6"
                },
                {
                    "user_id": "Advaith Madhavan",
                    "user_href": "/profile/Advaith-Madhavan"
                },
                {
                    "user_id": "Reyansh Gaming",
                    "user_href": "/profile/Reyansh-Gaming"
                },
                {
                    "user_id": "Rakhi Mohanta",
                    "user_href": "/profile/Rakhi-Mohanta-2"
                },
                {
                    "user_id": "Afrah Razzak",
                    "user_href": "/profile/Afrah-Razzak-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Aman Aayush",
                "href": "/profile/Aman-Aayush-1"
            },
            "answer_text": "Yes I have! It was in 2013. I was a student in Std 8 studying in Loyola School Jamshedpur. Before I get on with my story: Imtiaz Ali(Bollywood Director) was born in Jamshedpur. His brother Sajid Ali, for his debut film chose Jamshedpur. The movie was produced by JA Entertainment ( John Abraham Entertainment) The movie was titled Banana and I don’t think it realesed. So Mr. John Abraham himself was supposed to do a cameo in the film. It was a regular day. I entered my class. And through the corridor, I saw the ‘Assembly Today’ sign and got sad for a moment. I noticed some trucks with a lot of equipment inside the school. I still had no idea that a celebrity would be here because our school students have made 2 films. So i thought that's what they are up to. I reach the assembly line and stand at the end of the line with my friends. BAD DECISION. The Principal came and just calmly announced that Mr John Abraham is here for a shoot. And hell broke. All the students, just sort of jumped ahead and there he stood on the podium. Looking effortlessly dashing. After some time the teachers calmed the students and got everyone in line. And after that, the teachers, who stand at the back of the lines gossiping were suddenly in the front. X'D So we stood for 4 hours because they had to shoot a scene of 2 minutes! Yup that's how much effort goes in. At dismissal I tuldy friend to inform my parents that I would stay late because I wanted to see the shooting. Fast forward to 5 o clock. Another sequence is supposed to be shot inside the school. Still around 50 guys are hanging out. Just watching silently. Suddenly Sajid Ali shouts ' Idhar 2 bacche log chahiye'( we need 2 children here) And then an assistant director wearing a white JAC t shirt comes towards our group! He just looks at our faces. Everyone else is shouting and I don't know what triggered me but I just stood still. Looking him in the eye. And then as expected he chose me and another girl from some other group. We were just supposed to walk out of the office and cross a bench on which Mr. John Abraham was sitting and then quickly duck beside Sajid Ali and wait for the 'Cut'. They took about 12 takes from each angle. Now here's the interesting part. When the angle was Changing, that is, the whole set up was changing, we (Me and that girl)were waiting in a room. A man walks in who I guess was in-charge of Mr. Abraham's stay in Jamshedpur. There was a script on the table. I picked it up and did not understand a word. It's not just lines. Many margins, and cues and whatnots. Anyways, 2 minutes later, John Abraham walks in and sits 15 feet away from me. They are talking about dinner and he suddenly looks at us and says ' Where can I get some good food here? Oh my god, did The John Abraham just ask me what to get for dinner? I told him all the good restaurants according to the cuisine. And he listened! I haven't met any celebrity yet, but I guess that's humble. Talking to a fucking nobody, and then listening too! He listens to what I said and then laughs “ I'll get fat. I'll just take a protein shake” I think he had always decided that. But he had the courtesy to talk to a kid. Later on we were standing near the door waiting for the camera equipment to clear out, he asks me if I was tired. And I replied in the most cheesy way ever “Who'll get tired in your company?” ( Still regret that sentence) And then he just giggled and just put his hand on my shoulder. And that was the end to one of the fantastic days of my life. ",
            "date": "Answered July 20, 2018",
            "views": "76",
            "upvotes": " View 40 Upvoters",
            "upvoters": [
                {
                    "user_id": "Sandeep Rayalla",
                    "user_href": "/profile/Sandeep-Rayalla"
                },
                {
                    "user_id": "Sakshi Chaudhary",
                    "user_href": "/profile/Sakshi-Chaudhary-263"
                },
                {
                    "user_id": "Hem Parmar",
                    "user_href": "/profile/Hem-Parmar-4"
                },
                {
                    "user_id": "Jyoti Meena",
                    "user_href": "/profile/Jyoti-Meena-14"
                },
                {
                    "user_id": "Abhijit Sahu",
                    "user_href": "/profile/Abhijit-Sahu-6"
                },
                {
                    "user_id": "Aseem Ahmed",
                    "user_href": "/profile/Aseem-Ahmed-15"
                },
                {
                    "user_id": "Zonaira Nawal",
                    "user_href": "/profile/Zonaira-Nawal"
                },
                {
                    "user_id": "Vinita Gopalani",
                    "user_href": "/profile/Vinita-Gopalani"
                },
                {
                    "user_id": "Srinath Nagella",
                    "user_href": "/profile/Srinath-Nagella"
                },
                {
                    "user_id": "Gracy George",
                    "user_href": "/profile/Gracy-George-22"
                }
            ]
        }
    ]
}