{
    "title": "How to write a novel in four days - Quora",
    "tags": [
        "Novel Writing",
        "Creative Writing",
        "Novels",
        "Writing Advice"
    ],
    "response": [
        {
            "author_info": {
                "name": "Chandrapal Khasiya",
                "href": "/profile/Chandrapal-Khasiya"
            },
            "answer_text": "There are two ways of to achieve it. First Method: 4 days = (4 x 24) hours - 4 x (8 hours of sleep + 2 hours of other activities) = 96 - 40 = 56 hours So we have 56 hours to complete a novel. The minimum word count for a novel is 40000. If you are a seasoned writer, your average word per hour rate should be 1000 words. Sit and write 1000 words in one go for 50 minutes. Take a break for 10 minutes. And then resume your writing for next 50 minutes. So, per hour, 50 minutes writing plus 10 minutes break, you are adding 1000 words to your book. That means, at the end of 40th hour, you will be done with your first draft. Now spend the rest 16 hours reviewing and editing. Second Method: All you need is to have a NZT pill from Limitless movie, which gives access to 100% to our brain’s power. In that movie, after taking the pill, the protagonist completed his book in four days. P.S. - The second method is for a joke sake. Within four days you can have your first draft for sure, but it will demand determination. All the best! ",
            "date": "Answered October 3, 2017",
            "views": "493",
            "upvotes": " View 5 Upvoters",
            "upvoters": [
                {
                    "user_id": "Dei Lee",
                    "user_href": "/profile/Dei-Lee"
                },
                {
                    "user_id": "Dishant Shah",
                    "user_href": "/profile/Dishant-Shah-11"
                },
                {
                    "user_id": "Kishore Kumar",
                    "user_href": "/profile/Kishore-Kumar-34"
                },
                {
                    "user_id": "Biswadeep Ghosh Hazra",
                    "user_href": "/profile/Biswadeep-Ghosh-Hazra"
                },
                {
                    "user_id": "Rahul Bhat",
                    "user_href": "/profile/Rahul-Bhat-27"
                }
            ]
        },
        {
            "author_info": {
                "name": "Krishna Lokhande",
                "href": "/profile/Krishna-Lokhande-9"
            },
            "answer_text": "What do you think about writing novel?….do you think that you will be completed writing a novel within four days….I am not challenging you that you cannot do this but first try to regard the main motive behind novel writing….the main motive behind article writing is to clean the spoil brains of others people and to bring that wandered people into main stream of reality and truth…. I would never like to demoralise you…yes ,you can complete writing a novel within four days…but only by your own efforts of persistance and reconciliation ,perception….before begin to write a novel first ask yourself why ?,.. after a contemplation think about the life story or narration of what you are writing about..And while imaging place yourself at the place of characters that are included in your novel…never even get it in mind and force yourself that you must make your novel of too many pages…I cannot tell you right now each and everything but I am assure as you begin to write your novel you will get a path and will surely rich at your destination… ",
            "date": "Answered October 5, 2017",
            "views": "158",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Naveen Kumar",
                "href": "/profile/Naveen-Kumar-9157"
            },
            "answer_text": "by not waiting for someone’s suggestions or help (answers) on quora and focussing on writting/typing. And also you should have an idea of what you have to write. And trust me if you start writing instead of wondering about writing you can make it real quick. And four days is possible if you have a clear idea of your story and what all you have to write. ***But the key point is that you should start writing.*** once you finish a page you will have a little confidence and as you keep on writing you will build confidence and will know by yourself what all is necessary for you novel/story. ",
            "date": "Answered October 3, 2017",
            "views": "46",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "D Srinivas Rao",
                "href": "/profile/D-Srinivas-Rao-3"
            },
            "answer_text": "You are a writer so that is totally interest on you. How you handle it. Listen your heart mind planning you sure get that. ",
            "date": "Answered October 3, 2017",
            "views": "40",
            "upvotes": "0"
        }
    ]
}