{
    "title": "How is a TV drama script written? - Quora",
    "tags": [
        "Television Dramas"
    ],
    "response": [
        {
            "author_info": {
                "name": "Sam Tucker",
                "href": "/profile/Sam-Tucker-50"
            },
            "answer_text": "One word at a time. Seriously, though…if you're interested, the best thing to do is read some scripts of shows you like to learn the format. Most shows on network TV are written in a 5 or 6 act structure - meaning a teaser plus 4 or 5 acts. Try watching an episode while reading along with the script. You can find tons of scripts to read here: https://sites.google.com/site/tvwriting/ All that being said, I'm not sure if you mean the mechanics of writing the script itself or the actual process of writing professionally for TV. If you're writing on your own you're either writing a script for an existing show (called a \"spec\") or an original pilot. Best way to learn to do that is to read scripts and spend lots of time writing. Get some books (I'm a fan of Writing the TV Drama Series by Pamela Douglas) and/or take a class. Read and write some more. Watch TV, but not too much. If you mean, how are the shows you see on TV written, that's something else entirely. Typically stories are broken (meaning the beats of each script are figured out) by a group of staff writers and the head writer (showrunner). Then, scripts are assigned to individual writers, or a team. When finished, they'll do a read through with the staff and the showrunner, who will give notes. Changes will be made. The script might be rewritten by another writer or the showrunner. Eventually they'll come up with a final draft and the episode will be filmed. This all sounds like a long process, but it all actually happens pretty quickly. Hope I answered your question! ",
            "date": "Answered May 9, 2014",
            "views": "17",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Nafisa Sumaya",
                    "user_href": "/profile/Nafisa-Sumaya"
                },
                {
                    "user_id": "Gregory A. Farrell",
                    "user_href": "/profile/Gregory-A-Farrell"
                },
                {
                    "user_id": "Joan Hoffman",
                    "user_href": "/profile/Joan-Hoffman-1"
                }
            ]
        }
    ]
}