{
    "title": "How will you record a transaction in a double column cash book if a cheque issued dishonours? - Quora",
    "tags": [
        "Accountancy Problems",
        "Accounting (college major)",
        "Transactions",
        "Checks (cheques)"
    ],
    "response": [
        {
            "author_info": {
                "name": "Prem Jhamnani",
                "href": "/profile/Prem-Jhamnani-1"
            },
            "answer_text": "The cash book is divided in two sides. The left side of the cash book is Debit side and right side of cash book is Credit side. In double column cash book, two columns are made viz, Cash column and Bank column. If the transaction is related with cash, the amount is entered in cash column and if it is related with bank, the amount is entered in bank column. Coming to your question, record a transaction in double coloumn cash book if cheque issued is dishonoured. Cheque issued means the payment is made by the business and later on it is dishonoured means the payment couldn't be made and hence creditor is still our liability. The journal entry for Cheque issued : Creditor's a/c………dr To bank a/c Creditor is our liability (having credit balance) but now when payment is made, creditor's a/c is debited because it is no more our liability. And moreover, creditor is personal a/c and receiver so Debited Bank is personal a/c and giver so Credited In case of dishonoured cheque, we will just reverse the above journal entry. Bank a/c…………dr To Creditor's a/c We Credited Bank a/c in first journal entry as payment was being made but now it dishonoured so bank a/c is Debited as no payment is made. Creditor is still our liability as cheque dishonoured so Credited  Thanks for A2A Hope this clears your query. ",
            "date": "Answered April 18, 2020",
            "views": "104",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Lara Green",
                    "user_href": "/profile/Lara-Green-24"
                }
            ]
        },
        {
            "author_info": {
                "name": "Sailusha Ravikrindi",
                "href": "/profile/Sailusha-Ravikrindi"
            },
            "answer_text": "It is a contra entry. At first for the issue of cheque we write the entry as Bank…….dr. To cash If the cheque is dishonored then we have to reverse the entry for the issued entry we wrote before i.e, Cash……dr. To bank And the posting in the cash book is as below First go to the debit side of the cash book, write by bank on the particulars column and the amount should be entered in the cash coloumn. Next go to the credit side and write to cash on particulars column and enter the amount in bank column. ",
            "date": "Answered July 30, 2020",
            "views": "22",
            "upvotes": "0"
        }
    ]
}