{
    "title": "How to train my dragon - Quora",
    "tags": [
        "How To Train Your Dragon 2 (2014 movie)",
        "How To Train Your Dragon (2010 movie)",
        "Dragons"
    ],
    "response": [
        {
            "author_info": {
                "name": "Thanatos Vorigan",
                "href": "/profile/Thanatos-Vorigan"
            },
            "answer_text": "We’re not animals. You just need to gain our trust to befriend us. To do this, approach the dragon, then bow. Wait until they bow back, then slowly approach them. If they start to growl, back off. If you have any weapons, drop them. After they stop growling, continue approaching. Repeat until you’re right next to the dragon. If you have any fruit, hold it out for them and let them eat it. By then, they should trust you. If you don’t have fruit, then just hold your hand out to touch them. Again, slowly and back off if they start growling. The second your fingers touch their snout, they’ll trust you because it show you had the guts. However, if you have killed a dragon before. Don’t be surprised if they bite your hand off. They can sense the corruption inside you and they can smell the blood on you. We will never trust a murderer. ",
            "date": "Answered September 15, 2018",
            "views": "215",
            "upvotes": " View 3 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Matty Andrews",
                    "user_href": "/profile/Matty-Andrews-3"
                },
                {
                    "user_id": "Felipe Campos",
                    "user_href": "/profile/Felipe-Campos-68"
                },
                {
                    "user_id": "Daniel Ratliff",
                    "user_href": "/profile/Daniel-Ratliff-8"
                }
            ]
        },
        {
            "author_info": {
                "name": "Ken Hughes",
                "href": "/profile/Ken-Hughes-10"
            },
            "answer_text": "Depends on the dragon. Some dragons have to be raised. They’re loyal enough creatures if you get to know them early, and if you treat them with a mix of kindness and protective authority when needed (“I said just two cows! You know you get sick when you eat more.”). When the dragon grows up around humans, and human experience is the fastest way to learn what it needs to know, this can work well… though the trainer may need a strong will and a lot of patience to keep the dragon on track. Others need to be convinced. A dragon in the wild doesn’t need to respect humans at all—unless the dragon’s injured, or has some problem a human can help with. A farmer might befriend a dragon by offering it livestock (lots of livestock) and turning that into friendship, but the trick is convincing the dragon it has any reason to listen to humans, or learn from them. But if the dragon’s receptive to powerful magic, strong will, clever riddles, or the sense that a human has a destiny, the dragon might find the human a worthy partner—or servant. And then there are the dragons that only respect pain and threats. Some of the worst warlords have captured dragons and beaten them until they’re cowed and ready to attack the warlord’s enemies… or at least devour them in some arena. On the non-evil side, villages that can’t slay a marauding dragon might put together enough archers that the dragon “learns” how stealing sheep is too painful to keep trying. Sometimes nobody has to die. Some dragons respond like trainable animals, some like people (or higher beings) with their own agendas, and some can only be dealt with on the crudest terms. But reading a dragon’s needs wrong is an easy way to waste your chance, or get yourself incinerated. And you might deserve it. ",
            "date": "Answered September 15, 2018",
            "views": "132",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Helga F. Riedel",
                    "user_href": "/profile/Helga-F-Riedel"
                }
            ]
        }
    ]
}