{
    "title": "How to find the link to download a 'Sapiens: A Brief History of Humankind' PDF book - Quora",
    "tags": [
        "Downloading Books",
        "PDF (file format)",
        "eBooks",
        "Downloading"
    ],
    "response": [
        {
            "author_info": {
                "name": "Christy Barrera",
                "href": "/profile/Christy-Barrera-3"
            },
            "answer_text": " PDF Sapiens: A Brief History of Humankind Official U.S. edition with full color illustrations throughout. New York Times Bestseller A Summer Reading Pick for President Barack Obama, Bill Gates, and Mark Zuckerberg From a renowned historian comes a groundbreaking narrative of humanity’s creation and evolution—a #1 international bestseller—that explores the ways in which biology and history have defined us and enhanced our understanding of what it means to be “human.” One hundred thousand years ago, at least six different species of humans inhabited Earth. Yet today there is only one—homo sapiens. What happened to the others? And what may happen to us? Most books about the history of humanity pursue either a historical or a biological approach, but Dr. Yuval Noah Harari breaks the mold with this highly original book that begins about 70,000 years ago with the appearance of modern cognition. From examining the role evolving humans have played in the global ecosystem to charting the rise of empires, Sapiens integrates history and science to reconsider accepted narratives, connect past developments with contemporary concerns, and examine specific events within the context of larger ideas. Dr. Harari also compels us to look ahead, because over the last few decades humans have begun to bend laws of natural selection that have governed life for the past four billion years. We are acquiring the ability to design not only the world around us, but also ourselves. Where is this leading us, and what do we want to become? Featuring 27 photographs, 6 maps, and 25 illustrations/diagrams, this provocative and insightful work is sure to spark debate and is essential reading for aficionados of Jared Diamond, James Gleick, Matt Ridley, Robert Wright, and Sharon Moalem. ",
            "date": "Answered December 14, 2018",
            "views": "25",
            "upvotes": "0"
        }
    ]
}