{
    "title": "How would you describe romantic (as in romanticism) literature? - Quora",
    "tags": [
        "Literature, Languages, and Communication",
        "Romanticism (history)",
        "Literary Analysis and Criticism",
        "Literary Fiction",
        "English Literature",
        "Descriptions",
        "Literature"
    ],
    "response": [
        {
            "author_info": {
                "name": "Nathan Ketsdever",
                "href": "/profile/Nathan-Ketsdever"
            },
            "answer_text": "As I recall the three values it advocated and spread are the following: SpiritualEmotionNatureIt’s worth noting that its on the heels of the Enlightenment, so there is overlap between both. But the poetry and the literature of the period is likely to reflect those three key values. Specifically: The Romantic period has passed, but its styles and values still thrive today in popular forms and familiar attitudes, e.g.: feelings, emotions, and imagination take priority over logic and facts (\"Anything you want you can have if you only want it enough.\" cf. romance narrative)belief in children's innocence and wisdom; youth as a golden age; adulthood as corruption and betrayalnature as beauty and truth, esp. the sense of nature as the sublime (god-like awesomeness mixing ecstatic pleasure mixed with pain, beauty mixed with terror)heroic individualism; the individual separate from the masses \"outsiders\" as representatives of special worth excluded by rigid societies or irrational normsnostalgia for the pastdesire or will as personal motivationintensification, excess, and extremes (see Romantic rhetoric) common people idealized as dependable source of true common sense and sentimentidealized or abstract settings; characters as symbolic typesthe gothic as nightmare world of intense emotions and complex psychologySource: terms & themes ",
            "date": "Answered February 14, 2019",
            "views": "611",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Anjana-Victoria Waring",
                    "user_href": "/profile/Anjana-Victoria-Waring"
                },
                {
                    "user_id": "Kévin Savard",
                    "user_href": "/profile/Kévin-Savard-1"
                },
                {
                    "user_id": "Bunny Paine-Clemes",
                    "user_href": "/profile/Bunny-Paine-Clemes"
                },
                {
                    "user_id": "Nathan Yang (楊立慶)",
                    "user_href": "/profile/Nathan-Yang-楊立慶"
                }
            ]
        },
        {
            "author_info": {
                "name": "Evan Meyer",
                "href": "/profile/Evan-Meyer-14"
            },
            "answer_text": "The definition in Encyclopedia Britannica is pretty good: “Romanticism can be seen as a rejection of the precepts of order, calm, harmony, balance, idealization, and rationality that typified Classicism in general and late 18th-century Neoclassicism in particular. It was also to some extent a reaction against the Enlightenment and against 18th-century rationalism and physical materialism in general. Romanticism emphasized the individual, the subjective, the irrational, the imaginative, the personal, the spontaneous, the emotional, the visionary, and the transcendental.” Wordsworth’s “I wandered lonely as a cloud” exemplifies Romanticism for me, not only the whole poem, but in particular that 6-word phrase. ",
            "date": "Answered February 14, 2019",
            "views": "177",
            "upvotes": " View 2 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Anjana-Victoria Waring",
                    "user_href": "/profile/Anjana-Victoria-Waring"
                },
                {
                    "user_id": "Kévin Savard",
                    "user_href": "/profile/Kévin-Savard-1"
                }
            ]
        }
    ]
}