{
    "title": "How to restore old photos and save vintage prints and family pictures from wear and tear - Quora",
    "tags": [
        "Image Restoration",
        "Old Photos",
        "Image Editing",
        "Image Manipulation",
        "Photo Editing",
        "Image Processing",
        "Photographs"
    ],
    "response": [
        {
            "author_info": {
                "name": "Gregory Scott",
                "href": "/profile/Gregory-Scott-5"
            },
            "answer_text": "Perhaps the best option is to have them scanned, and then to retouch the scans as necessary in a photo editor such as photoshop. Then you can tag them with names and location, and other meaningful data such as may or may not already be in your photo album, and post them on the Web. Lightroom/photoshop combo is $10/month, and is a very convenient set of tools for doing this entire project. You can use a good digital camera instead of a scanner, but this is somewhat less convenient. When you do this, it might be a good idea to keep the album in a page with a login password, because an online album is a good way for somebody to figure out somebody's mother's maiden name. (I sure wish this was not used for security purposes!) Only give the password to family members. ",
            "date": "Answered March 25, 2016",
            "views": "457",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Lee Sei-Macfhearchair",
                    "user_href": "/profile/Lee-Sei-Macfhearchair"
                }
            ]
        },
        {
            "author_info": {
                "name": "Julia Voloshchenko",
                "href": "/profile/Julia-Voloshchenko"
            },
            "answer_text": "Hi. If the question is still relevant, I want to share a way that saved old photos from the family album. I used to think that to restore old photos you need to go to the photo shop, and there they will do something with them. But it turned out to be much easier: now you can restore old photos using photo editors on your own laptop, without going anywhere. To do this, you need: - Install the program on your computer and upload your photos. - Use either automatic restoration, or twist the settings manually to remove various cracks, creases, spots on the photo. In General, do everything to improve your photo so that it looks better than before. - Save the photo and then print it or leave it in electronic form. Depending on what you need. That's about it. I restored many of my photos, because most of them had cracks, some dents, some folds from improper storage. ",
            "date": "Answered February 18, 2020",
            "views": "140",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Edu Perez",
                    "user_href": "/profile/Edu-Perez-10"
                }
            ]
        },
        {
            "author_info": {
                "name": "Ann Hiers",
                "href": "/profile/Ann-Hiers"
            },
            "answer_text": "My Dad was 4 years old in this picture. His father, WWII Navy Veteran, died soon after this picture was taken. This is the only known photo of my Dad with his entire family. I used Lightroom to adjust the coloring, white balance and tone. I used the patch tool in Photoshop to remove the creases in the photo. I duplicated the file into three files. I underexposed one and overexposed another. Then I merged all three files into an HDR. I can only imagine my grandparents smiling as they watch this photo restoration from Heaven!  ",
            "date": "Updated February 23, 2017",
            "views": "432",
            "upvotes": " View 6 Upvoters",
            "upvoters": [
                {
                    "user_id": "Ellen Massey",
                    "user_href": "/profile/Ellen-Massey-8"
                },
                {
                    "user_id": "Vijay Aggarwal",
                    "user_href": "/profile/Vijay-Aggarwal-82"
                },
                {
                    "user_id": "Mike Bales",
                    "user_href": "/profile/Mike-Bales-4"
                },
                {
                    "user_id": "Catherine Beale",
                    "user_href": "/profile/Catherine-Beale"
                },
                {
                    "user_id": "JJ Hantsch",
                    "user_href": "/profile/JJ-Hantsch"
                },
                {
                    "user_id": "Wesley Jackson",
                    "user_href": "/profile/Wesley-Jackson-8"
                }
            ]
        },
        {
            "author_info": {
                "name": "Kaye Roth",
                "href": "/profile/Kaye-Roth"
            },
            "answer_text": " First, you have to scan your vintage prints in order to make it can be edited on computer with Photoshop or other photo editors, because digitally photo restoration is the best solution for worn-out old photos. Then use a Photo Scratch Remover to Make Old Photos Look New Again. This is a specialized tool used for photo restoration and photo erasing. Compared to Photoshop, it’s simple to use for photo editing beginner. You just need to mark the scratches and click the ERASER button, all the wear and tear will be restored automatically.  ",
            "date": "Answered October 22, 2018",
            "views": "248",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Lee Sei-Macfhearchair",
                    "user_href": "/profile/Lee-Sei-Macfhearchair"
                },
                {
                    "user_id": "John Russell",
                    "user_href": "/profile/John-Russell-438"
                }
            ]
        },
        {
            "author_info": {
                "name": "Sigbjorn Kaarvann",
                "href": "/profile/Sigbjorn-Kaarvann"
            },
            "answer_text": "I've just gone through a couple of hundred old family photos myself. Scanned and uploaded them to my cloud. This page have some tips and info about storing and preserving :)  http://www.wisebread.com/maintaining-memories-how-to-save-old-photographs ",
            "date": "Answered March 25, 2016",
            "views": "74",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Leon William",
                "href": "/profile/Leon-William-3"
            },
            "answer_text": "Simple way to do this is digitise(scan) images and either restore it yourself using Photoshop or get it restored by professional photo restoration company. ",
            "date": "Answered October 4, 2016",
            "views": "51",
            "upvotes": "0"
        }
    ]
}