{
    "title": "How to get my children's book published through a traditional publisher - Quora",
    "tags": [
        "Publishing Companies",
        "Publishers",
        "Children's and Young Adult Books",
        "Book Publishing",
        "Publishing",
        "Writers and Authors",
        "Children"
    ],
    "response": [
        {
            "author_info": {
                "name": "Jewel Parago",
                "href": "/profile/Jewel-Parago"
            },
            "answer_text": "As a publisher, when I look at authors who want to publish children’s book, I look to their connections where they can market the book. Let’s face it, kids don’t buy books, parents and other adults do. An author with no connections to other parents, teachers, librarians and others who make the decisions on the books purchased for their children is of little interest to me to publish. Also adults who write children’s book, but don’t have kids are a red flag. From a publishers standpoint it’s simply a matter of how likely is the author going to be able to sell their book. Authors looking for the publisher to do all the marketing and sales has their heads in the clouds. As with every book, we look at our chances of making back our investment for publishing a book. Informing a publisher in your query letter of your existing ties to your audience and your following are huge and a big determining factor as to whether we decide to option a book. ",
            "date": "Answered April 17, 2019",
            "views": "268",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Skye R. Regan",
                    "user_href": "/profile/Skye-R-Regan"
                }
            ]
        },
        {
            "author_info": {
                "name": "John Bean",
                "href": "/profile/John-Bean-70"
            },
            "answer_text": "If you aren’t able to land a book deal, don’t give up on your dream. Self-publishing can be a stepping stone to a future book deal and my company helps independent children’s authors pursue their passion. You can learn more about our children’s book publishing service here: https://www.ebooks2go.net/childrens-comic-board-picture-books ",
            "date": "Answered July 14, 2020",
            "views": "25",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Amin",
                "href": "/profile/Amin-164"
            },
            "answer_text": "Well you can search for Local Publisher or well-reputed Publisher on Google and then contact them and discuss the deal. Make sure you fix all the pricing and all other details prior to the deal. that’s it. :) ",
            "date": "Answered April 17, 2019",
            "views": "36",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Skye R. Regan",
                    "user_href": "/profile/Skye-R-Regan"
                }
            ]
        }
    ]
}