{
    "title": "How can books improve your knowledge? - Quora",
    "tags": [
        "Knowledge",
        "Book Recommendations",
        "Self-Improvement"
    ],
    "response": [
        {
            "author_info": {
                "name": "Shelly Provines",
                "href": "/profile/Shelly-Provines"
            },
            "answer_text": "If you’re like me and a research nut…. I read the Temperance Brennan novels by Kathy Reichs. There was one that mentioned Klinefelter syndrome (Genotype XXY), a sex chromosome disorder. My fifteen year old brain didn’t understand and wanted to know more. I spent the next month researching sex chromosome disorders and genetic disorders in general. Four years later…. I’m nineteen years old and sitting in a biology 101 college class. The professor says that Turner Syndrome (genotype XO) is the most common sex chromosome disorder. Something clicked. I remembered all that research I had done, and the novel by Kathy Reichs. (Bare Bones, for those of you who want to know….. I highly recommend the book…. hell, the whole series!) *Science stuff, you can skip this if you want* Turner Syndrome, where a female is missing part of or a whole X chromosome (XO), occurs in 1 in every 2,000 to 1 in every 5,000 girls. Klinefelter syndrome, which is where an extra sex chromosome exists (XXY), occurs in 1 in every 500 to 1 in every 800 boys. *Science stuff mostly done* Between Klinefelter and Turner, look at the odds. Klinefelter is more common, even factoring in for how often Klinefelter likely goes undiagnosed. Did I say something? Hell yes I did. Prof asked for a little background on what kind of research I had done on the topic. It took me about two minutes to make my case and he asked me to email him my sources (I emailed him my research paper that had gotten me a ton of extra credit in high school biology, sources included). Ha. He doesn’t like me very much now. My classmates now kind of see me as more than just that weird kid who’s obsessed with death who sits in the back of class. Who just got a lip piercing and now looks more badass than before. :D All this, from reading a book. A fiction novel. For fun. And this, my friends, is what reading can do. ",
            "date": "Answered September 26, 2017",
            "views": "13",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Haardik Sonkar",
                    "user_href": "/profile/Haardik-Sonkar"
                },
                {
                    "user_id": "Rabs Soloman",
                    "user_href": "/profile/Rabs-Soloman"
                }
            ]
        },
        {
            "author_info": {
                "name": "Aalok Aanand",
                "href": "/profile/Aalok-Aanand"
            },
            "answer_text": "It depend on books you are reading. If you are reading for research, then you obviously gain more knowledge then when you ask a friend or Google it. It is because you learn lot of related stuff when trying to find your answer. That helps your understanding and knowledge regarding the subject. If you are reading novels and comics and stuff, you can also gain knowledge. But it only happens only when you are a curious person and loves to know things in details. In fact I learned quantum mechanics to understand terminology in a comics I read. In this case there are many other ways too other then books like YouTube videos, movies etc. Visual media I'd always easier to gain knowledge. But the thing is that there might not be a good video for every topic. Bottom line is Books are one of the best ways to gain knowledge. But not the only way. ",
            "date": "Answered September 26, 2017",
            "views": "710",
            "upvotes": "0"
        }
    ]
}