{
    "title": "How to promote my e-book which I published with KDP - Quora",
    "tags": [
        "Ebook Promotion",
        "eBook Publishing",
        "Self-Publishing",
        "Book Publishing",
        "Publishing",
        "eBooks"
    ],
    "response": [
        {
            "author_info": {
                "name": "Alexander Danan",
                "href": "/profile/Alexander-Danan"
            },
            "answer_text": "That’s a great question! I go into answering it in detail in my blog at the following link: Self Publishing: How I Sell on Amazon KDP - Digital Nomad Sage The below is a quick run-down of what you’ll want to do to promote your book. There are many ways to promote your book. If you’re enrolled in KDP Select you can run a 5 day free book promotion. Later, when you make multiple books you’ll want to make a series of interrelated books and have 1 title at a time be under a free promotion. This way you’ll have more potential for the non-free books to be bought if the customer likes the “free book” that’s on sale. Social Media: Facebook Page, Instagram, and Twitter. Hashtags: Facebook: 2 Instagram: 30 Twitter: As many as you can fit! Optimizations: You can optimize your book listing by using Publisher Rocket (Affiliate Link) This tool allows you to optimize the 7 keywords for your book listing, analyze competitors, analyze keywords for use in paid advertising. Paid Advertising:AMS ads: Paid ads bring more eyes to your book. They are the fastest and quickest way to make sales but you have to be careful and constantly optimize your keywords and remove the wasteful ones. Website: You’ll want a lot of traffic to your site (Have your books listed there with Amazon Affiliate Links) so Social Media will help you in this arena. An e-mail list will be instrumental in developing a loyal subscriber base full of customers eager to read your next book. The best thing you can do though on Amazon is to optimize your listings for organic sales and next do paid AMS ads. AMS ads are the best way to have people “discover” and purchase your book. Hope that helps and good luck to you! ",
            "date": "Answered August 21, 2019",
            "views": "232",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Rebecca Ann Ivy",
                "href": "/profile/Rebecca-Ann-Ivy"
            },
            "answer_text": "Utilize the free book promotion offered as a member to Kindle Select. I have sold many hardcopy books when I run the free promotion for readers to download the electronic version free. It is only available as free for 5 days every 90 days. However, I have 15 children’s books and run a free promotion every weekend. Readers love it, and if they share my book, then I receive a small royalty for “pages read” from their Global fund. Or, run an Amazon ad campaign, it does cost money, but you can control the total amount spent, you select a budget max of say $100 and you are charged per click (you set the price per click by the consumer). The ad may be viewed by 100 people before someone clicks, but you are only charged for the click. I have run several ads for $20 and got a few sales each time. Or, my best sales online come from Facebook ads, where I include a link to my book on Amazon. You can easily set a limit on spending. Most of the time, I only spend a max of $30...I do this around the Christmas season…I enjoy the comments too. The above information is from my own personal experience, and may differ from the experience of others. I started with little money to advertise and slowly increased to steady sales using these methods. Enjoy your writing journey and the amazing people you meet along the way…God bless! ",
            "date": "Answered March 12, 2019",
            "views": "116",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Phambili Progress",
                    "user_href": "/profile/Phambili-Progress"
                },
                {
                    "user_id": "Amanda Lynn Simons",
                    "user_href": "/profile/Amanda-Lynn-Simons-1"
                }
            ]
        }
    ]
}