{
    "title": "How can we check whether we are mugging things or understanding concepts? - Quora",
    "tags": [
        "Muggings",
        "Concepts"
    ],
    "response": [
        {
            "author_info": {
                "name": "Colleen Ghosh",
                "href": "/profile/Colleen-Ghosh"
            },
            "answer_text": "Thanks for A2A Prakhar. I believe understanding things are as important as memorising them. The best way that's coming to my mind right now is to teach others.That will change your perspective as a learner.But you should chose your disciples wisely!Even they need to have an inquisitive mind to question you back. For example,one of teachers who is also a senior orthopaedic surgeon once told me that when he was a student,there were no easy going you tube videos or even Internet in the first place. So he used to write letters to his father regarding what he learnt in a day.Following which he used to receive letters from his father whose inquisitive mind held questions that helped him understand stuffs better. The same theory I have applied to myself though I send to my father via what's app.  above is an image of what I learnt and send it to my father via what's app! Happy Learning! ~Say. ",
            "date": "Answered October 1, 2017",
            "views": "103",
            "upvotes": " Answer requested by Raju Srivastava",
            "upvoters": [
                {
                    "user_id": "Rui Ann",
                    "user_href": "/profile/Rui-Ann"
                }
            ]
        },
        {
            "author_info": {
                "name": "Akhilesh",
                "href": "/profile/Akhilesh-97"
            },
            "answer_text": "If you can master the concept you learnt and followed it you mugged and if you find a new concept out of it or you practically applied that concept for a different thing that is not meant for but you have succeded then You have understood the concept ",
            "date": "Answered September 12, 2017",
            "views": "32",
            "upvotes": " View 1 Upvoter "
        }
    ]
}