{
    "title": "How many books do famous authors usually read? - Quora",
    "tags": [
        "Writers and Authors",
        "Reading",
        "Book Recommendations"
    ],
    "response": [
        {
            "author_info": {
                "name": "James Sams",
                "href": "/profile/James-Sams-6"
            },
            "answer_text": "Thanks for the A2A. Authors, famous or not, are just people. And they read the way people read. Some are fast, some are slow, some like to read, some don’t. My point is, there is no set answer for this question. It will be individually dependent. That said, most authors I know love to read, which is why they became authors. I suspect that most will have read so many books that they can only offer you vague guesses as to how many they have read. Others may be able to show you a list of every book they have read since they were ten years old. An author who is also an editor will have read more books and stories than they could remember if they had to—and most of them they probably wouldn’t want to anyway. Does that mean they all read hundreds or thousands of books? No. Some very successful authors are quite young. They physically haven’t had the time to be able to read as many as some others, although they may eventually. It is safe to assume that most authors read a lot of books. It is also safe to assume that the busy authors become with their own writing, the more likely it is that they don’t have enough time for their reading habits and reading for “personal pleasure” will drop to a fraction of what they once read. I was once a couple of books a week. Now am a couple of books a year. —If we are talking about just reading books that I want to read just because I want to read them. If we are talking about books and stories I read while editing and researching, that number grows quickly. I hope that helps! ",
            "date": "Answered March 7, 2018",
            "views": "996",
            "upvotes": " View 2 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Matthew Beasley",
                    "user_href": "/profile/Matthew-Beasley-5"
                },
                {
                    "user_id": "Parthiv Purkayastha",
                    "user_href": "/profile/Parthiv-Purkayastha"
                }
            ]
        },
        {
            "author_info": {
                "name": "Naveen Sivakumaran",
                "href": "/profile/Naveen-Sivakumaran-2"
            },
            "answer_text": "I’m not sure how many books they read. I’ve read interviews and “how-to”advice from some amazing authors such as Hemingway, Neil Gaiman, Stephen King and Charles Bukowski. All these authors have said is that they read a lot. And wrote a lot. Most of the their time was consumed by these two activities. And one key advice, that you ought to live by, if you want to become a writer - read as much as you can. Stephen King even goes on to say, if you want to become a writer but hate reading, don’t bother. You just won’t make any progress. Therefore, instead of being consumed by how many books they read, focus on how much of reading you can get done. and go beyond the numbers. There is no point in reading hundreds of books, if you’ve not learned anything from them. I’ve made the mistake of hoarding books and then reading them mindlessly just so that I get through them. The result - wasted time and money. My advice to you (and myself) - do as much effective reading as possible. ",
            "date": "Answered March 11, 2018",
            "views": "591",
            "upvotes": " View 2 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Swastik Sahu",
                    "user_href": "/profile/Swastik-Sahu-26"
                },
                {
                    "user_id": "Tony Chen",
                    "user_href": "/profile/Tony-Chen-359"
                }
            ]
        }
    ]
}