{
    "title": "How old does a book have to be to be valuable? - Quora",
    "tags": [
        "Valuables"
    ],
    "response": [
        {
            "author_info": {
                "name": "William Lanigan",
                "href": "/profile/William-Lanigan-2"
            },
            "answer_text": "A first edition of a modern book that somehow becomes a smash best seller can be very valuable. A first edition of Harry Potter and the Sorcerer’s Stone can be worth thousands of dollars because the book wasn’t expected to do well and the first printing was small. Subsequent editions of the book were printed in far larger numbers so they are worth much less. Subsequent books in the series were printed in large numbers because of the success of the first book and are worth much less. So, a book a mere 23 years old is as valuable as many earlier books. Age doesn’t have to be a factor depending on the unexpected success of the book, but such unexpected successes are rare. You might have to go back to a first edition of Peyton Place from 1956 to duplicate Harry Potter’s success, and to Gone With the Wind in 1939 before that. Both those books were unexpected successes and the first editions are very valuable. Many first edition books less than 100 years old from American Nobel Prize winners and “classic” authors like Fitzgerald are valuable. On the other hand, books several hundred years old can be almost worthless because no one read them then and no one reads them now. ",
            "date": "Answered July 23, 2020",
            "views": "24",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Som Dutt",
                    "user_href": "/profile/Som-Dutt-6"
                }
            ]
        },
        {
            "author_info": {
                "name": "Vinni",
                "href": "/profile/Vinni-55"
            },
            "answer_text": "A book never gets old and neither their is any age to start reading! here is an old book but gold for everyone! You can watch its great review (and a short summary) here :)  ",
            "date": "Answered July 21, 2020",
            "views": "15",
            "upvotes": "0"
        }
    ]
}