{
    "title": "How long does it take to have a book on Amazon after everything else has been concluded on the author's side? - Quora",
    "tags": [
        "Amazon.com (product)",
        "Writers and Authors",
        "Amazon (company)"
    ],
    "response": [
        {
            "author_info": {
                "name": "Paul Austin Ardoin",
                "href": "/profile/Paul-Austin-Ardoin"
            },
            "answer_text": "If you have everything completed on the author side—a finalized e-book-ready .mobi or .kpf file and an appropriate cover art file in the correct size and format, Kindle Direct Publishing (KDP) will allow you to upload your files, which usually takes 10 minutes to an hour, depending on the size of your files. Then it goes through a formal review process. This takes up to 72 hours. If you wish to create a paperback, your files need to be different, and the rules are more stringent. You will need a PDF of your interior, and a PDF the cover art, which must match exactly KDP’s template and requires attention to ink coverage and other stuff that graphic designers know but mere mortals usually don’t. (You can use KDP’s cover art creator instead, but I don’t think the results look very professional.) The paperback takes longer for Amazon to review, and they are much pickier about following the (often unwritten) rules. While ordering a proof copy is highly recommended, proof copies take a VERY long time to ship and are quite expensive. I have found a much faster and cheaper (if riskier) way: publish the book (for real) a few days before your announced launch date/ebook launch date, then order a paperback copy for yourself. If you’re a Prime customer, you’ll get the book in two days—weeks faster than ordering a sample copy, much cheaper because of the shipping costs, and without the annoying “NOT FOR RESALE” ribbon over the entire cover (which hid a typo on the back cover of my first book). If there’s something you need to change, you still have time before your announced date. (Amazon also usually takes a few days to merge your paperback and ebook pages, so that will give a bit of a cushion too.) There is a risk that if your paperback isn’t right, people will order the not-right version and be dissatisfied. So if you have the time, the money, and the patience for true proof copies, by all means do that instead. ",
            "date": "Answered November 12, 2018",
            "views": "69",
            "upvotes": " View 9 Upvoters",
            "upvoters": [
                {
                    "user_id": "Enoch Burke",
                    "user_href": "/profile/Enoch-Burke"
                },
                {
                    "user_id": "Zi Hyder Diary of the Mind",
                    "user_href": "/profile/Zi-Hyder-Diary-of-the-Mind"
                },
                {
                    "user_id": "Muhammed Suleiman",
                    "user_href": "/profile/Muhammed-Suleiman-12"
                },
                {
                    "user_id": "Jason Berthiaume Jr",
                    "user_href": "/profile/Jason-Berthiaume-Jr"
                },
                {
                    "user_id": "Jimmy Dilks",
                    "user_href": "/profile/Jimmy-Dilks"
                },
                {
                    "user_id": "Edward Conway",
                    "user_href": "/profile/Edward-Conway"
                },
                {
                    "user_id": "Mijo Zumato",
                    "user_href": "/profile/Mijo-Zumato"
                },
                {
                    "user_id": "Vibhay Bakshi",
                    "user_href": "/profile/Vibhay-Bakshi"
                },
                {
                    "user_id": "Thomas P. Buehner",
                    "user_href": "/profile/Thomas-P-Buehner"
                }
            ]
        },
        {
            "author_info": {
                "name": "Kathy Meis",
                "href": "/profile/Kathy-Meis-1"
            },
            "answer_text": "For eBooks, you will need to have a KDP account where you will input you information about the book (title, synopsis, categories, keywords, price, etc) and your digital cover file and eBook file (in the .mobi or .epub format). If your files upload without a problem, your book should be live on Amazon in about 24 hours, though it can take up to 72 hours. For print books on Amazon, you will also have to have a KDP account. You’ll follow the same steps as above, but with different file formats that are specific to print covers and interiors. If the files upload successfully, you’ll want to order a print proof to review before publishing your print book to Amazon. You can skip this step and review through KDP’s online previewer, but this is not recommended. It is always wise to order a print proof to be sent to you, so that you can see if everything in your files has printed correctly and you are pleased with the physical version of your book as it will be sold to readers. It is the printing, shipping and review time for the print proof will add a couple of weeks to your publishing timeline. Once you approve your files for publication on KDP, your books should be live on Amazon in about 24 hours, though it can take up to 72 hours. ",
            "date": "Answered November 12, 2018",
            "views": "43",
            "upvotes": " View 5 Upvoters",
            "upvoters": [
                {
                    "user_id": "Enoch Burke",
                    "user_href": "/profile/Enoch-Burke"
                },
                {
                    "user_id": "Edward Conway",
                    "user_href": "/profile/Edward-Conway"
                },
                {
                    "user_id": "Mijo Zumato",
                    "user_href": "/profile/Mijo-Zumato"
                },
                {
                    "user_id": "Jayasridhar Kannan",
                    "user_href": "/profile/Jayasridhar-Kannan"
                },
                {
                    "user_id": "Ana Peraita",
                    "user_href": "/profile/Ana-Peraita"
                }
            ]
        }
    ]
}