{
    "title": "How to read and download What Doesn't Kill Us for free - Quora",
    "tags": [
        "Free Books",
        "Free Ebooks",
        "Downloading Books",
        "eBooks",
        "Free Products",
        "Downloading"
    ],
    "response": [
        {
            "author_info": {
                "name": "Kady Daly",
                "href": "/profile/Kady-Daly"
            },
            "answer_text": "What Doesn't Kill Us: How Freezing Water, Extreme Altitude, and Environmental Conditioning Will Renew Our Lost Evolutionary Strength  What Doesn't Kill Us, a New York Times bestseller, traces our evolutionary journey back to a time when survival depended on how well we adapted to the environment around us. Our ancestors crossed deserts, mountains, and oceans without even a whisper of what anyone today might consider modern technology. Those feats of endurance now seem impossible in an age where we take comfort for granted. But what if we could regain some of our lost evolutionary strength by simulating the environmental conditions of our forebears? Investigative journalist and anthropologist Scott Carney takes up the challenge to find out: Can we hack our bodies and use the environment to stimulate our inner biology? Helping him in his search for the answers is Dutch fitness guru Wim Hof, whose ability to control his body temperature in extreme cold has sparked a whirlwind of scientific study. Carney also enlists input from an Army scientist, a world-famous surfer, the founders of an obstacle course race movement, and ordinary people who have documented how they have cured autoimmune diseases, lost weight, and reversed diabetes. In the process, he chronicles his own transformational journey as he pushes his body and mind to the edge of endurance, a quest that culminates in a record-bending, 28-hour climb to the snowy peak of Mt. Kilimanjaro wearing nothing but a pair of running shorts and sneakers. An ambitious blend of investigative reporting and participatory journalism, What Doesn't Kill Us explores the true connection between the mind and the body and reveals the science that allows us to push past our perceived limitations. ",
            "date": "Answered January 9, 2019",
            "views": "631",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Santiago Sánchez",
                    "user_href": "/profile/Santiago-Sánchez-10"
                },
                {
                    "user_id": "Lindah Diana",
                    "user_href": "/profile/Lindah-Diana"
                },
                {
                    "user_id": "Narayanaswamy Varadenahalli",
                    "user_href": "/profile/Narayanaswamy-Varadenahalli-1"
                }
            ]
        }
    ]
}