{
    "title": "How to write black dialogue - Quora",
    "tags": [
        "Dialogue",
        "Writing Advice"
    ],
    "response": [
        {
            "author_info": {
                "name": "Jonathan Schork",
                "href": "/profile/Jonathan-Schork"
            },
            "answer_text": "This is going to be a hairy subject: it’s going to offend someone, and, possibly, everyone. Firstly, let us recognize that not all “black” people speak substandard English: it’s not uncommon to hear conversations among black people in the U.K. who make even many whites in the U.S. sound terribly ignorant. Idris Elba, Lennie James, Nonso Anozie, Lupita Nyong’o, and Thandie Newton are excellent examples of black performers who speak English, and the characters they play in cinema & television reflect that quality, though some of them are able to perform substandard English as a function of a role. By contrast, even beloved U.S. icons like Oprah Winfrey, Samuel L. Jackson, Whoopie Goldberg, and Morgan Freeman generally present with a distinct accent. Do you want to write dialogue for Barack Obama? You’d better be able to write English eloquently(albeit with a few pauses and other speech dysfluencies): the man was a brilliant speaker and thinker, and sets the bar very high for people who would emulate him (how unfortunate that, during his first presidential campaign, he was credited with “talking white” instead of speaking intelligently). Same thing for Neil deGrasse Tyson: I’ve heard him speak as eloquently about the cosmos as the late Carl Sagan, and never once like a carricature of a gansta. The contrast between black, U.S. substandard English was, to my mind, nowhere more clearly on display recently than in the blockbuster film Black Panther (which features Ms. Nyong’o from one of my above lists). The two male leads, Chadwick Boseman & Michael B. Jordan— both U.S. actors— offer us two very different models of “black” dialogue: Boseman, the intelligent hero, with his affected African English with a distinct U.K. accent beautifully delivered, and (sadly) Jordan, the igmorant villain, with something like ghetto-speak or ebonics, and what makes this distinction so remarkable to me is that the “smart” character speaks well & eloquently, and the muscle-head speaks so poorly (it really did seem like a subtle criticism of the substandard language skills of U.S. black communities). I suppose if one were attempting to write dialogue that seemed faithful to the circumstances of one’s character, one might well have to listen to the way black folks speak in the U.S., bearing in mind that not all black folks speak the same (I have a lawyer friend from Virginia via Chicago who speaks beautifully, and a friend from the ‘hood who is completely stymied by an article with a consonant —“a orda”, “a ardicle”— and by pronouns— “he at home”, “her be hot”). On the other hand, it seems so to me that there is much to be gained by writing dialogue for black characters that, like President Obama & Neil deGrasse Tyson, sets the bar a little higher for black communities in the U.S. The other obvious conclusion is that we, as writers, should perhaps stop writing “black” characters & “white” ones, “gay” ones & “gurlz”: let’s start leaving the caricatures behind us and start building characters who aren’t merely real, but admirable. I’d like to close by remarking (now that I've successfully offended some of my readers) that U.S. black folks aren’t the only ones who speak poorly: there are plenty of white supremacists (who knows what they could possibly be feeling superior about?) of all stripes who speak & read & write like they’ve never been to a school (and I know this because I’m related to a bunch of them!), and if you’re white and illiterate, you’re likely not reading this. But if we stopped glorifying & glamourizing ignorance in the U.S., we could probably all at least sound more intelligent, and, as a philology teacher of mine used to observe, “thinking intelligently starts with speaking intelligently.” ",
            "date": "Answered March 13, 2018",
            "views": "732",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Dan Jones",
                "href": "/profile/Dan-Jones-147"
            },
            "answer_text": "One thing to consider is ‘write what you know’. I don't know a lot of black dialogue so i don't write it. I usually pick up phrases from work or associates. “ya feel me?” (Do you understand?) and “real talk” (truth). My parents are educated and voracious readers so my schoolmates often said i spoke “proper\". So the next thing to consider is that there is no “black dialogue\" just dialogue between two black characters. Does “white dialogue” involve cheese and crackers? Does “women dialog” involve menstration and pregnancy? More proactive advice is determine your writing style. Paul Louis Dunbar made dialectic verse popular. “pritee lil bebe, mebe dun ak so bad\" I think The Wire had strong characters that were black but The Sopranos had black characters that tried to exude strength. Depth of character doesn't have to change the scene just the tone. “i need the money, ya feel me?” “gimmie dat paper be fo i gots ta get my gat\" Both my parents are black, please save comments on my profile photo complexion for an a2a. ",
            "date": "Answered March 13, 2018",
            "views": "473",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Jaylea Miller",
                    "user_href": "/profile/Jaylea-Miller"
                },
                {
                    "user_id": "Nitish Khajuria",
                    "user_href": "/profile/Nitish-Khajuria-2"
                },
                {
                    "user_id": "Katie Gertz",
                    "user_href": "/profile/Katie-Gertz"
                }
            ]
        }
    ]
}