{
    "title": "How to write an award-winning piece - Quora",
    "tags": [
        "Creating Writing Advice",
        "Academy Awards",
        "Winning",
        "Honors and Recognition",
        "Creative Writing",
        "Writing Advice"
    ],
    "response": [
        {
            "author_info": {
                "name": "Julia Tracey",
                "href": "/profile/Julia-Tracey-2"
            },
            "answer_text": "GIrl, you just have to write for months and months and probably years and years to get those muscles tones and sharp. No one (or a rare few) breaks out of the gate winning. Everyone has to earn her way up. You will win awards if you work hard at the craft, listen to criticism and learn from it, and be prepared to cut and edit ruthlessly. Develop a thick skin. And then, when you’ve had some successes publishing, submit those pieces, or unpublished if the contest demands it, and you’ll win. There’s no magic trick. It’s hard work. I look forward to hearing about your wins! ",
            "date": "Answered February 2, 2019",
            "views": "59",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Paul Grant",
                    "user_href": "/profile/Paul-Grant-47"
                }
            ]
        },
        {
            "author_info": {
                "name": "Chris S Cameron",
                "href": "/profile/Chris-S-Cameron"
            },
            "answer_text": "Just In Case. Some days I load the gun, Just in case. Some days I put everything in place , just in case. Some days I take a walk along the peer, just in case. Some days I tighten the rope, just in case. Today the clown didnt smile back at me, when I looked into the mirror I now know why the mirror’s always been cracked…the clown = Hell; why do you think they’re always around children…IT. When you find out the truth…just in case!! ",
            "date": "Answered February 25, 2019",
            "views": "104",
            "upvotes": "0"
        }
    ]
}