{
    "title": "How many books have you sold and how much money has it made you? - Quora",
    "tags": [
        "Book Sales",
        "Book Publishing",
        "Publishing",
        "Writers and Authors",
        "Books"
    ],
    "response": [
        {
            "author_info": {
                "name": "Pinky Jones",
                "href": "/profile/Pinky-Jones-2"
            },
            "answer_text": "Thanks for the a2a. I had the luck of IF YOU FIND ME interesting many people and going to auction amongst publishers both in the US and UK, so the advances in cases such as this are higher. At the same time, one has to remember that advances are paid out in three parts: on signing, when revisions are handed in and accepted, and on publication. So, even really decent advances may still mean ramen in between, after the agent’s standard cut and some more put away for taxes. That said, most writers won’t answer that kind of question. It’s too personal, like asking a stranger how much they make per year, and, in a way, it’s proprietary information; especially if one publishes under different pen names, for example, and wants their privacy. Also, publishers/editors would highly frown on numbers being thrown around amongst the general writing public. Some authors might not mind the above. If so, I’m sure they’ll reply here. The rest of us want to keep being “picked up” so we play by the rules and entertain courtesy and discretion. ",
            "date": "Answered July 7, 2019",
            "views": "73",
            "upvotes": " Answer requested by David Serrano"
        },
        {
            "author_info": {
                "name": "James Roy Roberson",
                "href": "/profile/James-Roy-Roberson"
            },
            "answer_text": "I don't know how many books I've sold. Royalties are paid monthly, from three different components of Amazon and deposited directly into my LLC. All goes to an accountant, who does my taxes. I'm a journalist by trade and numbers generally scare us. For E-books and print books, I receive about $2.00 for a $12.00 book and about $4.00 for $17 audiobook. Fortunately, I don't depend on book sales for my livelihood, rather to finance my world travels and for tax breaks--that's a different question. Hope that helps. You can check out my books at my website: jamesrobersonnovels.com. ",
            "date": "Answered July 7, 2019",
            "views": "19",
            "upvotes": "0"
        }
    ]
}