{
    "title": "How did the Germans defeat the Russians during World War 1, but lose to the Russians during World War 2? - Quora",
    "tags": [
        "Warfare in Russia",
        "World War I",
        "World War II",
        "Germany",
        "Russia"
    ],
    "response": [
        {
            "author_info": {
                "name": "John Lunbeck",
                "href": "/profile/John-Lunbeck-2"
            },
            "answer_text": "The Soviet Union in WW2 was less industrialized than its adversary, but not by much given a populace 2.5 times as large.  In contrast Russia in World War I was far less industrialized than Germany.  From its allies the Soviet Union got material support that was far more important to its effort than Russia got in WW1 [although it is correct to note that perhaps 75-85% of the total German war effort in 1941-3 was devoted to the east as opposed to no more than half in WW1].  But perhaps most important, through the grass roots organization of the CPSU the Soviet Union enjoyed political and ideological conformity and effective cohesion throughout the war, always at the point of a gun and despite a populace ready for any other master in 1941. In contrast, deep fractures in pre-WW1 Russian society widened over the course of the war, eventually disabling the war effort.  Czarism failed to impress any equivalent appeal to and intimidation upon the populace through a lack of proponents at the working level.   Although it put up a hell of a fight [trading blows with the Germans on an almost even basis until early 1915, and almost always defeating the Austro-Hungarians], Russian civil society was doomed by the length of the war and attendant economic deterioration.There was no organized partisan resistance or support from the occupied peoples for the Germans in WW1.  In WW2, through their own brutality the Germans prevented the co-optation that the occupied peoples were so willing to offer their conquerors, and eventually engendered a debilitating partisan presence behind their own lines.  Make no mistake, the Germans could have taken down the Soviets in WW2, but apart from the few large reasons set out above committed some grave strategic and logistic errors.  Most generally, failure to determine war aims in advance.  Most often commentators cite the failure to drive on Moscow in September 1941 in favor of bagging 600,000 prisoners through the Kiev encirclement operation as evidence.  However, Grant is commended for strategic genius for forcing engagement with the enemy and focusing on causing it losses rather than on geographic objectives [even though he took far greater losses in absolute terms].  Also, Hitler noticed that Napoleon occupied Moscow and still lost, badly.  The commentators enjoy the benefit of hindsight in this narrow case, although it is possible that taking Moscow would have automatically caused the collapse of the front to the west due to the absence of rail links enabling supply.  Hitler certainly focused on getting, and then holding, geographic objectives to the detriment of the war effort and effective prosecution of blitzkrieg tactics and the defensive flexibility inherent in German war organization.  Many commentators figure that Germany had no chance after the unsuccessful attempt to take Moscow in December 1941.  I believe Germany could have bled the Soviet Union white, and won the war, had it focused on doing so in 1942 rather than driving for unrealistically distant objectives.  By late 1944 the Soviet Union was starting to experience manpower shortages.  Had Hitler, in conformity with the recommendations of Wehrmacht general staff, concentrated on causing these, rather than trading blows in static positions with an enemy prepared to take unlimited losses, the Germans would have stood a decent chance.  Had Hitler not imposed a nonsensical and brutal racial theory and occupation practice, co-optation of the occupied peoples would have given the Germans a huge edge. ",
            "date": "Answered January 24, 2015",
            "views": "47",
            "upvotes": " View 23 Upvoters",
            "upvoters": [
                {
                    "user_id": "Quanghuy Tran",
                    "user_href": "/profile/Quanghuy-Tran"
                },
                {
                    "user_id": "Jon Smith",
                    "user_href": "/profile/Jon-Smith-631"
                },
                {
                    "user_id": "Ulf Osterberg",
                    "user_href": "/profile/Ulf-Osterberg"
                },
                {
                    "user_id": "James Simone",
                    "user_href": "/profile/James-Simone-8"
                },
                {
                    "user_id": "Niclas Olovsson",
                    "user_href": "/profile/Niclas-Olovsson"
                },
                {
                    "user_id": "Aaron Johnson",
                    "user_href": "/profile/Aaron-Johnson-155"
                },
                {
                    "user_id": "Jonas Behle",
                    "user_href": "/profile/Jonas-Behle"
                },
                {
                    "user_id": "Venky Viswanath",
                    "user_href": "/profile/Venky-Viswanath"
                },
                {
                    "user_id": "N Кеlkka",
                    "user_href": "/profile/N-Кеlkka"
                },
                {
                    "user_id": "Uwe Michael Neumann-Vitale",
                    "user_href": "/profile/Uwe-Michael-Neumann-Vitale"
                }
            ]
        },
        {
            "author_info": {
                "name": "Alex Jouravlev",
                "href": "/profile/Alex-Jouravlev"
            },
            "answer_text": "In WW1, Germany was assisted by two traitors:   Don't be confused by the uniform and the medals, Nicholas II of Russia had exactly zero military background - not combat, not intelligence or planning, or even logistic. None. Yet he was the one making all the decisions. He also had no concept of responsibility, he believed in his divine right to rule the people of Russia in the interests of his family. And his family needed a lot of protection - his wife, a German Princess heavily influenced by the corrupt \"guru\" Rasputin in turn influencing her husband decisions, was facing a lot of resentment even from brown-nosed courtiers. His son was universally believed not suitable for rigor of ruling the country. So naturally with such a need to accommodate their interests, things like keeping people alive, supplied and winning were too far down the list.    Vladimir Ulianov (Lenin) was transferred from Switzerland to Russia by the German Military Intelligence, where he organised a coup under the promise of an immediate peace without annexations or reparations. Then, when succeeded, signed a peace deal that included massive reparation payments and surrendering massive territories, a certified, full-blown defeat.  When you think that Russia still keeps monuments of Lenin, but also worship Nicholas II and his wife as saints, it is hard to be optimistic about their future. Added: another important factor is that WW1 Germans were not after destroying the whole of Russia and enslaving her population. If instead of getting a favorable peace Germans decided to advance towards Moscow, while bringing death and rape to civilian population, it would be different. ",
            "date": "Updated January 25, 2015",
            "views": "467",
            "upvotes": " View 262 Upvoters",
            "upvoters": [
                {
                    "user_id": "Mark Justine J. Herrera",
                    "user_href": "/profile/Mark-Justine-J-Herrera"
                },
                {
                    "user_id": "Vadim Dmitriev",
                    "user_href": "/profile/Vadim-Dmitriev-5"
                },
                {
                    "user_id": "No Name",
                    "user_href": "/profile/No-Name-1863"
                },
                {
                    "user_id": "George Agapax",
                    "user_href": "/profile/George-Agapax"
                },
                {
                    "user_id": "Pawel Mazur",
                    "user_href": "/profile/Pawel-Mazur-3"
                },
                {
                    "user_id": "Noah Cornett",
                    "user_href": "/profile/Noah-Cornett-2"
                },
                {
                    "user_id": "T J",
                    "user_href": "/profile/T-J-1365"
                },
                {
                    "user_id": "Anders Nilsson",
                    "user_href": "/profile/Anders-Nilsson-52"
                },
                {
                    "user_id": "Andremets",
                    "user_href": "/profile/Andremets"
                },
                {
                    "user_id": "Paul Kraase",
                    "user_href": "/profile/Paul-Kraase"
                }
            ]
        }
    ]
}