{
    "title": "How much should you pay to buy an established coffee shop? - Quora",
    "tags": [
        "Business for Sale",
        "Buying and Selling a Business",
        "Valuations (finance)",
        "Cafés and Coffee Shops",
        "Costs"
    ],
    "response": [
        {
            "author_info": {
                "name": "Peter Baskerville",
                "href": "/profile/Peter-Baskerville"
            },
            "answer_text": "While the financial value of a coffee shop can be calculated to some extent by various objective Return on Investment (ROI) measures, most people price a coffee shop based on its subjective value, to them. i.e. it satisfies a long held dream to own oneit promises a lifestyle imbibing the same warm, cozy, friendly, stress-free experience that you enjoyed as a customerits a business in which the whole family can work productivelyit seems like an easy business to operate because you have been making food and drinks your whole lifeit’s busy with customers, so it must be profitableit’s a sociable place where friends and family can come and engage with youAs a builder, operator and seller of over 15 coffee shops, I can tell you that all of the above reasons are either false assumptions or anti-profit and should not be used when valuing a coffee shop. There are three main ways to provide some objective measure of the value of an established coffee shop: Number of Weeks trading multiplier: All business brokers know the benchmark multiplier for each industry in regards to establishing the financial value. When I was active in coffee shops it was about 20 weeks trading. i.e. multiply the proven weekly trading by 20 to establish a target value of the business. This value would then be negotiated up or down based on the length of time remaining on the lease, or standard of the key equipment or quality of the fittout.Replacement value: Any good shop fitter can tell you what an existing coffee shop would cost to replace. This is typically the lowest valuation because it does not take into account, the goodwill that the coffee shop has built over the years with its clientele. But it at least gives you a bargaining position given that you know what it would cost to go up the road and replicate a similar business in competition to the one you are negotiating to buy.Profitability (ROI): Coffee shops like all other small businesses are considered risky investments. That is why most financial analysts will be looking for a 40% return (profit) on the money invested (purchase price) for coffee shops to compensate for the higher risk. By identifying the profits (either from past tax reports or from the current Profit and Loss Statement produced by an accountant), you should be able to calculate the value of the coffee shop. (Annualized profit divided by 40%).Smart operators calculate all three of these valuation methods and reach a mid point between them all to set their starting benchmark for negotiations. ",
            "date": "Answered December 13, 2016",
            "views": "54",
            "upvotes": " View 9 Upvoters",
            "upvoters": [
                {
                    "user_id": "Doug Caldwell",
                    "user_href": "/profile/Doug-Caldwell-2"
                },
                {
                    "user_id": "Dean Riddell",
                    "user_href": "/profile/Dean-Riddell"
                },
                {
                    "user_id": "Karim Belhadj",
                    "user_href": "/profile/Karim-Belhadj-2"
                },
                {
                    "user_id": "Mike Lance",
                    "user_href": "/profile/Mike-Lance-15"
                },
                {
                    "user_id": "Habib Adnan",
                    "user_href": "/profile/Habib-Adnan-5"
                },
                {
                    "user_id": "Garion Hall",
                    "user_href": "/profile/Garion-Hall"
                },
                {
                    "user_id": "Nagabhushan. M. N",
                    "user_href": "/profile/Nagabhushan-M-N"
                },
                {
                    "user_id": "Yair Livne",
                    "user_href": "/profile/Yair-Livne"
                },
                {
                    "user_id": "Muhammad Lee",
                    "user_href": "/profile/Muhammad-Lee-9"
                }
            ]
        },
        {
            "author_info": {
                "name": "Mike Williams",
                "href": "/profile/Mike-Williams-385"
            },
            "answer_text": "Just because you enjoy the aroma of a strong long black does not change the accepted methods of business valuation - especially for cafe’s. The usual method is to determine the ongoing EBITDA (earnings before interest tax depreciation and amortisation) and adjust it to allow for a market level owners wage and add back any one-off costs. This is the first part of the Earnings Multiple (or more correctly the Future Maintainable Earnings). The other half is the Earnings Multiple. For most cafe’s that have high traffic flow, estabished for at least 2 years, increasing revenue (preferrably exceeding $500k), the EBITDA multiple will be 1.0 - 2.0x. The more attractive the business (growing revenue, repeat customers, high foot traffic area, efficient systems, pleasant/attractive atmosphere), the higher the multiple. So the final enterprise value would be Multiple * Ongoing adjusted EBITDA. Of course this assumes that the business is making a profit. If that is not the case then it is a variation of net assets on balance sheet. I have detailed more information here: Business Valuations Melbourne | Exit Value Advisers | Australia ",
            "date": "Answered March 4, 2019",
            "views": "572",
            "upvotes": "0"
        }
    ]
}