{
    "title": "How should I read a book for 12 hours and never get bored? - Quora",
    "tags": [
        "Book Reading",
        "Reading Advice",
        "Dealing with Boredom",
        "Boredom",
        "Literature",
        "Reading",
        "Book Recommendations",
        "Books",
        "Psychology of Everyday Life"
    ],
    "response": [
        {
            "author_info": {
                "name": "Peter Bellis",
                "href": "/profile/Peter-Bellis"
            },
            "answer_text": "Before the how … Why? I’ve often read for more than 12 hours at a stretch … because I’m so engrossed in what I’m reading. It just happens. I don’t plan it, I don’t decide it is something that needs doing. So … why do you feel the need? If you get bored … stop. do something else. Why persevere at something that is no longer fun? Take a walk, visit a friend, watch TV, whatever … When you WANT to carry on reading, sure … come on back. Note, you never said anything about studying … but even here … studying for 12 hours at a stretch is NOT conducive to understanding or memory … you need breaks. ",
            "date": "Answered January 8, 2020",
            "views": "45",
            "upvotes": " Answer requested by Magdalena Sri",
            "upvoters": [
                {
                    "user_id": "Magdalena Sri",
                    "user_href": "/profile/Magdalena-Sri"
                }
            ]
        },
        {
            "author_info": {
                "name": "Carolyn McMaster",
                "href": "/profile/Carolyn-McMaster-1"
            },
            "answer_text": "I’m a voracious reader and have been since I first learned how to read. As an adult (for over half a century now), I can generally read for two hours at a time without becoming bored unless I actively dislike the material I’m reading from the onset. However, to read for prolonged periods of time (such as 8 or more hours), I have to meet three criteria: The book has to seize my interest to the extent that I almost go into a trance as I read it, I must avoid external distractions (such as my telephone, loud music, and bright light as much as possible, and I need to have easy access to water, food, and a restroom close by so that I don’t break my near trance while meeting my body’s needs. Other people I know who can read for long stretches of time in one session have similar reading habits, but I have no way of knowing how representative of marathon readers we are. ",
            "date": "Answered January 7, 2020",
            "views": "70",
            "upvotes": " View 1 Upvoter"
        }
    ]
}