{
    "title": "How to get myself to have more dreams - Quora",
    "tags": [
        "Lucid Dreaming",
        "Dreams and Dreaming"
    ],
    "response": [
        {
            "author_info": {
                "name": "Djordje Pejic",
                "href": "/profile/Djordje-Pejic"
            },
            "answer_text": "So, first, a bit of theory. Sleep consists of REM phases and Non-REM. We dream during REM phases. They happen every 90 minutes. As the night progresses, REM phases become longer and dreams more vivid. The reason we forget them is because of our brains. We have certain mechanisms that delete dreams as unnecessary memories. That's about theory. I mentioned that to re-frame common belief that we have or don't have dreams. I have a couple of tips regarding remembering dreams (you don't need to follow all of them, pick out some or follow all, I will bold those that are necessary): Write down every dream you remember as soon as you wake up. Every details counts. Here, you're training your brain to remember dreams.When you wake up, try not to think about your day. Just relax and try recall your dreams.Don't go to bed with a thought “what if I don't remember my dreams”. Just relax.Don't look at any screens at least an hour before bed. It reduces the amount of sleep hormones.When you wake up during the night, use voice recording app to record your dreams. In the morning, listen to it and write them down.Drink a lot of water before bed, so you wake up to pee. There will be some dreams to record.Don't masturbate. I don't have explanation for this one, just happens a lot among people. A lot of people have more dreams if they don't masturbate.Appreciate your dreams. If they are important to you, you'll rememberMeditate. It helps a lotI think that is about it. I hope this helps :-) ",
            "date": "Answered September 28, 2017",
            "views": "27",
            "upvotes": " View 6 Upvoters",
            "upvoters": [
                {
                    "user_id": "Alayna Withroe",
                    "user_href": "/profile/Alayna-Withroe"
                },
                {
                    "user_id": "Nicolás",
                    "user_href": "/profile/Nicolás-39"
                },
                {
                    "user_id": "Jennifer Mendoza",
                    "user_href": "/profile/Jennifer-Mendoza-15"
                },
                {
                    "user_id": "Audrey Jane Garcia",
                    "user_href": "/profile/Audrey-Jane-Garcia"
                },
                {
                    "user_id": "Jonathan Herman",
                    "user_href": "/profile/Jonathan-Herman-11"
                },
                {
                    "user_id": "Will Budinger",
                    "user_href": "/profile/Will-Budinger"
                }
            ]
        },
        {
            "author_info": {
                "name": "Devesh Reddy",
                "href": "/profile/Devesh-Reddy"
            },
            "answer_text": "A free trip to vegas . Irrelevant sequence of jump scares that may or may not scare the shit out of me. Posing as the most successful entreupreneur for forbes magazine front page. My dog taking bong hits and talking to me . Diving off a cliff - intentionally ( with a glider) / unintentionally (because i had to post a selfie on instagram from the edge of the cliff). Getting 6 pack abs over a night sleep. Waking up in a world with no kids :) ( because l dont like kids , no offense) . Being at a comic con and the next minute in himalayas , and continue with life as if nothing happened . Wheather I like it or not , all these kind of things happen in my dream everyday . So it is not about dreaming more . It is about remembering your dreams! Well, everyday in your sleep you might get around 3–5 dreams or even 7 . The following techniques will help you remember your dreams . Have fun! The boring one - have a dream journal where you note down even a part of your dream that you remember.The easy one - try to get a good amount of sleep around 8hrs , this will help you achieve REM(rapid eye movement) sleep where you dream in about 2 hrs.The desperate one- Wake up a couple of times in the night and immediately fall asleep again . (Keep Espresso and netflix away when ever you wake up.Lesson from Dora the Explorer- Dont judge me ! . When I was a kid , there was an episode where she asks to focus on details . Dreams are not perfect -there will be atleast one illogical thing .So you might get consious and remember your dream or you can lucid dream ( If you practice this well , you can put your spooky dreams at the bay and please dont watch dora the explorer) .From Leonardo De Caprio- As he does in Inception , make and carry your totem and do frequent reality checks.These 5 methods have helped me personally to dream better . Hope you will have enough funny dreams to share with your friends and family . Good Night! Dream Well! ",
            "date": "Answered September 27, 2017",
            "views": "24",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Jonathan Herman",
                    "user_href": "/profile/Jonathan-Herman-11"
                },
                {
                    "user_id": "Allu Pritham",
                    "user_href": "/profile/Allu-Pritham"
                },
                {
                    "user_id": "Niharika Putta",
                    "user_href": "/profile/Niharika-Putta-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Radek Kessl",
                "href": "/profile/Radek-Kessl"
            },
            "answer_text": "We dream all the time.What you are looking for are the memories of the dreams you had. We dream all the time when we are asleep. Mostly during the REM phase of our sleep. So what you need to do is try to recall the dreams when you wake up. It might not go easily, but you should be able to remember at least 1 dream if you recall them right after waking up.Have a dream diary.Good thing to do is to write down all the dreams you can remember after you wake up. Just take a piece of paper and write down as many details as you can. This will help your brain pay attention to what is happening in your dreams. You will remember more dreams and you might even be able to recognize when you are dreaming, which is the main key for Lucid Dreaming. (Lucid dream)Try to concentrate on the imperfections of dreams. In dreams, nothing feels wrong. It is like a math lesson. No one asks why are we on a market buying 3 tons of potatoes but only 3 kg of cucumber, no one. It is the same in dreams. Ever wondered how you happened to be talking to a penguin i a zoo full of children eating flying sandwiches? Of course not, it is absolutely normal. Lucid dreams were some of the best experience in my life. The feeling was one of the strangest things to ever occur to me. ",
            "date": "Answered November 28, 2015",
            "views": "12",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Jonathan Herman",
                    "user_href": "/profile/Jonathan-Herman-11"
                },
                {
                    "user_id": "Asil Mansour",
                    "user_href": "/profile/Asil-Mansour"
                }
            ]
        },
        {
            "author_info": {
                "name": "Vashi Chandi",
                "href": "/profile/Vashi-Chandi"
            },
            "answer_text": "Its a natural process, its not that you can fabricate dreams just at your sole discretion; actually during the day if you are fulfilling your respective duties in constructive endeavors, then at the completion of each day, its understandable you would be quite tired and seeking to sleep well on time, and then once you go to sleep, the realms of dreams will unfold at its own pace and time and not just a space where you can shift back and forth how/when you want; in fact, so many times, what is dream’t is almost as if very remote and almost n clue what was dream’t after all; so its not about choosing and expanding the dreams quotient, but rather earnestly focusing upon ensuring that you are diligently/prudently and wisely striving to fulfill your respective endeavors with complete/total “pure awareness” and then the dreams will come of their own precise accord sequentially; the sequence being of course when at the completion of your nobly fulfilling day right/light true and through; light was mentioned because of the essence of “pure awareness”- meaning when seeking the virtue of righteousness to prevail in all that’s sought/done; its also likewise extremely essential to ensure the element of light - meaning the “pure awareness” factor is resolutely prevalent at all given times integrally, ",
            "date": "Answered September 29, 2017",
            "views": "746",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Avinash Sahu",
                "href": "/profile/Avinash-Sahu-7"
            },
            "answer_text": "To get more dreams, the best thing to do is to sleep early, maybe by 10:00 pm. Set your alarm at about 4:00 am. Then wake up, remain awake for 5-15 min depending upon your drowsiness. Then go back to sleep. Now this time when you sleep, you will get more lucid, vivid or clear dreams. You may wake up frequently. Keep a journal nearby you and record whatever you saw in dream, as much as you can remember. This will also improve your dream recall ability. As this ability improves, you will notice that you remember more dreams, even that which happened at night. Thus you get more dreams. ",
            "date": "Answered December 3, 2015",
            "views": "597",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Karthik Reddy",
                    "user_href": "/profile/Karthik-Reddy-195"
                },
                {
                    "user_id": "A. I. Marshel",
                    "user_href": "/profile/A-I-Marshel-2"
                }
            ]
        },
        {
            "author_info": {
                "name": "Marcus Cheong",
                "href": "/profile/Marcus-Cheong-6"
            },
            "answer_text": "The way to have more dreams is to create more chances for it to happen. Sleeping more often and for longer periods of time provides a higher chance of R.E.M. (rapid eye movement) sleep. In this phase your mind becomes more active and has a chance of experiencing a dream. Most of the dreams we have are actually forgotten so most of the time the number of dreams we think we have is actually very minuscule compared to the actual quantity. If you want to increase the number of perceived dreams, try being more conscious of your dreams by getting immersed in it and participate in it more actively. ",
            "date": "Answered September 27, 2017",
            "views": "373",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Clarance Benes",
                "href": "/profile/Clarance-Benes"
            },
            "answer_text": "You are dreaming every night or you would be dead. What you are saying is that you do not remember your dreams and that is something you can fix. The simplest way to remember your dreams is to program yourself to remember them by saying out loud and then mentally, “ I will remember my dreams!” Say this and focus on it as you relax and fall asleep. Do not be distracted and think or say anything else. Have a recorder or pen and paper nearby to jot something down when you first start to wake up, whether it is the middle of the night or early in the morning. This usually works the first time you try it. If not, try each night until it does. Melatomin is an over the counter drug, that is highly effective in helping one sleep and remember their dreams. I had a class, albeit a small class, do this and 100% reported dreams before the next class period. ",
            "date": "Answered May 19, 2018",
            "views": "548",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Daniel Paul Piotrowicz",
                    "user_href": "/profile/Daniel-Paul-Piotrowicz"
                }
            ]
        },
        {
            "author_info": {
                "name": "Jacy Nova",
                "href": "/profile/Jacy-Nova"
            },
            "answer_text": "Here are a few tips that I use on an evening basis. Don’t drink too much alcohol or sugar before going to sleep. In my experience, it blurs your memory and it makes it harder for you to remember your dreams.Keep a notebook by your bed to write down what you dreamed during the night. This can be when you wake up in the middle of the night or in the morning.Before you go to sleep think of three things you would like to dream about that night It could be an answer to a question, a person, or something generic like balloons, dogs, and apple trees.Over time, you will find you will start remembering your dreams on a daily basis. ",
            "date": "Answered September 27, 2017",
            "views": "443",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Ankur Agrawal",
                    "user_href": "/profile/Ankur-Agrawal-164"
                }
            ]
        },
        {
            "author_info": {
                "name": "Pam Adamchik",
                "href": "/profile/Pam-Adamchik"
            },
            "answer_text": "You dream nightly; it’s how the human brain functions. You just may not remember your dreams. Try keeping pen and paper on your nightstand next to your bed. Set an alarm to wake you once or twice during the night. When you wake up, write down anything you can remember about what you dreamed. Over time, this can help “train” your mind to remember your dreams. ",
            "date": "Answered May 19, 2018",
            "views": "234",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "A. I. Marshel",
                    "user_href": "/profile/A-I-Marshel-2"
                }
            ]
        },
        {
            "author_info": {
                "name": "Zohar Shaulov",
                "href": "/profile/Zohar-Shaulov"
            },
            "answer_text": "Before you go sleep, sincerely request to have more dreams. You can also request the type of dreams you wish to experience. There is a time lag, but your request should be fulfilled as your request will not fall on deaf ears. Good luck Emily! ",
            "date": "Answered September 27, 2017",
            "views": "76",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Dionysus",
                "href": "/profile/Dionysus-21"
            },
            "answer_text": "Take a concoction of Zink, Magnesium, Vitamin D (in excess to all other nutrients that you might be deficient in)—they’ve been known to create funny dreams, and cause improved sleep (not guaranteed). Sleep longer. ",
            "date": "Answered May 19, 2018",
            "views": "53",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Gabriel Wells",
                "href": "/profile/Gabriel-Wells-2"
            },
            "answer_text": "What I read and experienced Vitamin B6 Choline Melatonin (usually nightmares) Why do you want to have more dreams? Better to have deep sleep. ",
            "date": "Answered September 27, 2017",
            "views": "124",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "William Floyd",
                "href": "/profile/William-Floyd-9"
            },
            "answer_text": "Working a lot or handling a lot of business will cause dreams sometimes ",
            "date": "Answered May 19, 2018",
            "views": "149",
            "upvotes": "0"
        }
    ]
}