{
    "title": "How quickly can you write a 50,000 word novel? - Quora",
    "tags": [
        "Breaking in as a New Author or Novelist",
        "Creating Writing Advice",
        "Novel Writing",
        "Book Writing",
        "Creative Writing",
        "Novels",
        "Writers and Authors",
        "Writing Advice"
    ],
    "response": [
        {
            "author_info": {
                "name": "Jo Roderick",
                "href": "/profile/Jo-Roderick"
            },
            "answer_text": "I’m going to answer this from personal experience, and also because the people saying it will be ‘crap’, are those that — for some reason — are unable to do it themselves. With Six For Seven, I wrote, edited, did the book covers, the typesetting for print and electronic eBook formatting, had it independently edited, and published in 25 days. If I remember correctly (I can’t check at the moment), it’s about 66k words. I didn’t wait for the editor, for example. I was already busy with the covers, the formats, and the promotional material. This book is proof that it can be done, not that it should be done this way. I didn’t set out to break any records. It just went very well. This happens when you write what you want, and not something because it’s a product to sell. It’s a very quirky book that has only ever received one bad review while it was on Amazon. I can write over 10 000 words in one day, but that is the exception. I normally aim for 3000–5000 a day … when I write. I only write when I want to. Last year, I wrote two books in a few months, but I haven’t published them. When inspired, sometimes I will write for as long as 12 hours or more. This is how these things get done for some of us. A book isn’t good or bad because of how long it takes you to write it. Alex Boast, thanks for the A2A. The original question was: How quickly can you write a 50,000 word novel? ",
            "date": "Answered May 20, 2020",
            "views": "345",
            "upvotes": " View 6 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Lisa Dooley Fisk",
                    "user_href": "/profile/Lisa-Dooley-Fisk"
                },
                {
                    "user_id": "Harvey Ardman",
                    "user_href": "/profile/Harvey-Ardman-1"
                },
                {
                    "user_id": "Rob Wanless",
                    "user_href": "/profile/Rob-Wanless-3"
                },
                {
                    "user_id": "John Hudson",
                    "user_href": "/profile/John-Hudson-158"
                },
                {
                    "user_id": "Rayshan Dewnarain",
                    "user_href": "/profile/Rayshan-Dewnarain"
                },
                {
                    "user_id": "Alex Boast",
                    "user_href": "/profile/Alex-Boast-4"
                }
            ]
        },
        {
            "author_info": {
                "name": "Lily Potter",
                "href": "/profile/Lily-Potter-63"
            },
            "answer_text": "Okay, so, I actually wrote a 127,000 word novel in about 3 months— and that was where I spend almost all of my free time writing and not going back, just continuing on and on, so let’s assume I could have hypothetically written 50,000 words in, oh, one month. Let’s rephrase the question. How quickly can I write a good 50,000 word novel? Because let me tell you, that one I wrote in 3 months? Absolute trash. I wrote it two years ago. I renovated it and changed it up quite a bit about a year back. You know what I just started doing a couple of days ago? Re-reading and editing it again. It’s not trash anymore. It’s actually comprehensive narrative and whatnot. I’ve been adding more body language to the dialogue, so it’s not so stiff. Anyway. Easier. I wrote what I would consider to be a pretty good 60,000 word novel more recently, which is much closer to the 50,000 words in the question. I did that one a chapter a week, with one week missed when I was really busy. It’s about 23 chapters long, so I did it in 24 weeks. The main difference here is that I spent more time on it, and had the time to re-read chapters as I wrote the new ones, had more time to edit what I already had to be better. While I will doubtless edit it as my writing skills improve, I won’t edit it as heavily as I have been my bigger novel because, well, it’s already better. So, short answer? A hypothetical month, but it would be trash, or, a hypothetical five months with a much better result. ",
            "date": "Answered July 1, 2020",
            "views": "74",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Lisa Dooley Fisk",
                    "user_href": "/profile/Lisa-Dooley-Fisk"
                }
            ]
        }
    ]
}