{
    "title": "How do the Amazons of Themyscira have children? - Quora",
    "tags": [
        "Themysciran",
        "Wonder Woman (2017 movie)",
        "Wonder Woman (DC character)",
        "Children"
    ],
    "response": [
        {
            "author_info": {
                "name": "Yonatan Gershon",
                "href": "/profile/Yonatan-Gershon"
            },
            "answer_text": "Hard to tell, since the most recent update of the story in 2012 is so unlike every other version, by being extremely disturbing and antithetical to Wonder Woman. It details that thrice per century, the Amazons go out to ships that are nearing Themyscira, and present themselves as beautiful women willing to have sex with the men on board. Procreation occurs, whether the men are willing or not, and then the men are killed and/or thrown overboard. Nine months later, some Amazons celebrate having a newborn baby girl, while others despair as their baby boys are ripped away from them. The tradition for dealing with male children is infanticide, but in modern times, they are sold to Hephaestus in exchange for weapons. Hephaestus claims that he buys them to save their lives, but since they are used as a standing army of slaves, it’s dubious. This is the storyline of Wonder Woman #7, from the New 52, written by Brian Azzarello. In every other backstory for Themyscira, the Amazons are either immortal and therefore not in need of procreation at all, or being on Themyscira keeps them immortal, or were simply created by Olympian deities to be a force for peace and justice rather than an actively growing population in its own right. They basically never have children at all, and when they do, they are basically foster parents due to them being created by gods. For obvious reasons, I prefer the long-established answer over the recent one. ",
            "date": "Answered May 9, 2018",
            "views": "196",
            "upvotes": " View 21 Upvoters",
            "upvoters": [
                {
                    "user_id": "Hardik Singh",
                    "user_href": "/profile/Hardik-Singh-134"
                },
                {
                    "user_id": "Jovana",
                    "user_href": "/profile/Jovana-70"
                },
                {
                    "user_id": "James Tee",
                    "user_href": "/profile/James-Tee-33"
                },
                {
                    "user_id": "Hauan Pablo",
                    "user_href": "/profile/Hauan-Pablo"
                },
                {
                    "user_id": "Kathy Cole",
                    "user_href": "/profile/Kathy-Cole-5"
                },
                {
                    "user_id": "Crystal Clear",
                    "user_href": "/profile/Crystal-Clear-103"
                },
                {
                    "user_id": "Kelsey Ching",
                    "user_href": "/profile/Kelsey-Ching-1"
                },
                {
                    "user_id": "Jarrett King",
                    "user_href": "/profile/Jarrett-King-4"
                },
                {
                    "user_id": "Marton Gombos",
                    "user_href": "/profile/Marton-Gombos"
                },
                {
                    "user_id": "Subhrajeet Biswas",
                    "user_href": "/profile/Subhrajeet-Biswas"
                }
            ]
        },
        {
            "author_info": {
                "name": "Kami Ghorbanpour",
                "href": "/profile/Kami-Ghorbanpour-1"
            },
            "answer_text": "They don’t! I have already written an answer on why Amazons do not need to reproduce as they are immortal: Kami Ghorbanpour's answer to How does the population sustain itself if all the inhabitants of Themyscira are women? You might ask but what about Princess Diana? Wasn’t she a child? Well, Diana’s case is a little different. In the old continuity (Pre-New52 era) she was made out of clay as a gift from the goddess, Hera to the queen of Themyscira. However, they changed it after the Flashpoint event and ever since Diana was the daughter of Zeus. (Also Hippolyta’s hair color changed for some reason!)  Picture: Wonder Woman: Rebirth #01 For now, it’s not clear how did she exactly come to life because someone’s messing with her memory and past life! ",
            "date": "Answered June 4, 2017",
            "views": "224",
            "upvotes": " View 17 Upvoters",
            "upvoters": [
                {
                    "user_id": "Aishwarya Anand",
                    "user_href": "/profile/Aishwarya-Anand-23"
                },
                {
                    "user_id": "Josh Watson",
                    "user_href": "/profile/Josh-Watson-13"
                },
                {
                    "user_id": "Sangode Lowe",
                    "user_href": "/profile/Sangode-Lowe"
                },
                {
                    "user_id": "Louw Nieuwoudt",
                    "user_href": "/profile/Louw-Nieuwoudt"
                },
                {
                    "user_id": "Tyler Schmaltz",
                    "user_href": "/profile/Tyler-Schmaltz-1"
                },
                {
                    "user_id": "Alan Andrew Harper",
                    "user_href": "/profile/Alan-Andrew-Harper"
                },
                {
                    "user_id": "Sidharth M",
                    "user_href": "/profile/Sidharth-M-5"
                },
                {
                    "user_id": "Sarvesh Chakraborty",
                    "user_href": "/profile/Sarvesh-Chakraborty-3"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/Emperor-of-The-Universe"
                },
                {
                    "user_id": "Reepu Kumar",
                    "user_href": "/profile/Reepu-Kumar-3"
                }
            ]
        }
    ]
}