{
    "title": "How does Japan react to gay people? - Quora",
    "tags": [
        "Homosexuality in Japan",
        "LGBTQ Issues",
        "Homosexuality",
        "LGBTQ"
    ],
    "response": [
        {
            "author_info": {
                "name": "Erica Friedman",
                "href": "/profile/Erica-Friedman"
            },
            "answer_text": "This is a simple question with a very complex (and therefore long) answer. The perspectives held by straight people and gay people on straight people's \"reactions\" to gay people will be significantly different.  Many straight people (not just in Japan) have a reaction that goes something like this \"I don't mind the idea, but don't really want to have to think about it.\" Whereas actual gay people (not just in Japan) would very much like to see others like themselves represented in media, in the public sphere and in business. What a parent says in relation to a gay theme on a TV show can scar a kid for years, although they themselves forget it. That kind of \"reaction\" may not be meant as a political or social stance, but it colors a person's relationship with their own existence. So, let's start with media representation: Recently, Japanese TV has been slightly more open to the idea of LGBTQ content. The state-run TV network NHK had a show on late night TV called \"NHK Heart\" and another \"The Rule of R\" which will have actual discussions of LGBT issues. TV shows in Japan have embraced a few high profile LGBTQ people, including trans talents Ai Haruna, Kabachan and out lesbian activists, Makimura Asako, Higashi Koyuki and Masahara Hiroko.  There are still very few lesbian or gay characters in Japanese TV or movies, however. Few enough that when there is one, it is notable. Representation for the LGBTQ community goes in waves in entertainment media. A few years ago, there was a wave of actual lesbians in manga, and even a few artists talking about same sex marriage in various ways. There are a few manga artists who portray men's relationships with some sincerity, but generally speaking the majority of same-sex comics are set in not-real places with not-real situations and there is a very obvious lack of LGBTQ identity among the characters. Right now, the genre known as \"bara\" (comics by gay men for gay men)  is undergoing a growth phase in Japan and in the west.  LGBTQ issues pop up in these more and more, as they also tend to in comic by lesbians for lesbians. As with media anywhere, representation for LGBTQ people makes real change in people's comfort level and awareness. Representation in the public sphere makes real life changes though law and policy. It's glacial, but there are changes in the public sphere as well: Toshima Ward, one of the 23 sections of Tokyo has an out representative, Ishikawa Taiga, and some years ago, an Osakan rep, Otsuji Kanako came out as a lesbian, but LGBTQ presence in the public sphere is small and there are few laws on the books protecting same-sex people from discrimination or providing them any legal stability. Shibuya Ward in Tokyo just recently passed a new law that provides marriage certificates to same-sex couples. It is the only place in Japan that currently does so. The national government has already begun tutting and finger-wagging and looking for ways to kill the law.   I was watching NHK cover the news and it was pleasantly (surprisingly)  unbiased  and positive reporting. Back to media representation - NHK explained why laws are as important for same-sex couples, as they are for anyone. And they portrayed this as a celebration. People with no preconceived opinions were given one - this is a thing to be happy about. And this law is, truly, a major step forward towards real change. But, let's go back to opinion and reaction for a moment. I reviewed a book called Coming Out Letters (カミングアウト・レターズ) from parents and teachers to children and children to parents and teachers about their being closeted and coming out. There are as many reactions to real people coming out as there are people to react. Still. Always. Universally. While there is no religious proscription in Japan for LGBTQ life, the finger-waggers and tutters bludgeon people with the word \"Tradition\"...this despite the well-documented tradition of homosexual relationships in Japanese culture, pre-Meiji period. The concept of sexual relations with the same sex is a historical fact in Japanese culture (as they are everywhere, really.) But these were in addition  to legitimate heterosexual marriage and family-rearing and they were appropriate only for men in positions of power. More recently in the 20th century, same-sex relationships were accepted as childhood experimentation, meant to be set aside when one graduated school and joined adult, and therefore heterosexual, life. So...there is progress and there is regress and there is digress. Plenty of people (not just in Japan) are perfectly okay with a crossdressing idol group or a same-sex manga but haven't ever given a thought to actual LGBTQ people or their rights. There doesn't seem to be any correlation between the two things for a lot of people. The correlation that does exist is when a person knows someone who is gay. Just as it does everywhere else, the power of being out is in making one's self an example so that people don't fall back on saying they don't know anyone who is LGBTQ. To that end, the Tokyo Rainbow Pride parade is getting bigger every year. There's still value in marching in a large group. The most major change I saw this past year was that there were far fewer people with their faces hidden or covered. Being out is viral. Most notable, in my opinion, are those groups reclaiming \"Tradition\" for themselves. The national civil coming-of-age ceremony for 20 year olds has been reclaimed by a group that does an\"everyone is welcome\" coming of age ceremony where people are free to dress in the clothes they want to wear. Can you imagine, being a 20 year old 40 years ago, dressed in gender-assigned clothing that made you want to scratch your own eyes out? (I can. I still hate the dress I was Bat Mitzvahed in. It was BROWN. I hate brown. I hated that dress. Sorry Mom.) The LGBT Seijinshiki fixes that. No matter what age, you can come of age as yourself. How magnificent is that?! (定非営利活動法人 ReBit) The gay pride parades get bigger every year, the LGBTQ groups around Japan get slightly louder and braver every year. More people who have never really thought about gay rights are now thinking about them at least when they are on TV.  Of course there will be people who disapprove. So what? ^_^ ",
            "date": "Updated April 27, 2015",
            "views": "311",
            "upvotes": " View 138 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Griff Monk",
                    "user_href": "/profile/Griff-Monk"
                },
                {
                    "user_id": "Matthew Curley",
                    "user_href": "/profile/Matthew-Curley-6"
                },
                {
                    "user_id": "Gianluca Galassini",
                    "user_href": "/profile/Gianluca-Galassini"
                },
                {
                    "user_id": "Kaiya Mudge",
                    "user_href": "/profile/Kaiya-Mudge-2"
                },
                {
                    "user_id": "Bethany Smith Webber",
                    "user_href": "/profile/Bethany-Smith-Webber"
                },
                {
                    "user_id": "Bokumania",
                    "user_href": "/profile/Bokumania"
                },
                {
                    "user_id": "Michelle Gerber",
                    "user_href": "/profile/Michelle-Gerber-1"
                },
                {
                    "user_id": "Me We",
                    "user_href": "/profile/Me-We-25"
                },
                {
                    "user_id": "Vanessa Jones",
                    "user_href": "/profile/Vanessa-Jones-234"
                },
                {
                    "user_id": "Matthew Murphy",
                    "user_href": "/profile/Matthew-Murphy-177"
                }
            ]
        },
        {
            "author_info": {
                "name": "Davide Gualandi",
                "href": "/profile/Davide-Gualandi-1"
            },
            "answer_text": "As it has been mentioned in other answers, Japan seems to have started imitating the west in having a moralistic and puritan attitude toward sex exclusively in the decades following WWII and the American occupation. I’m not really sure it sticked thou’. As a country, Japan has a long tradition of spaces (which eventually evolved into red light districts and areas filled with gay bars and businesses) where man can easily take care of their fantasies, drives and needs. Even with the introduction of a (totally makeshift) anti-prostitution law, Japan (compared to the US where I live) still has an infinite number of businesses where you can go “get your freak on”, at least in large metropolitan areas. Specifically for gay men, you have gay saunas, gigantic sex clubs or literally hundreds of tiny gay bars serving very specific types of clientele and functioning as lively living rooms where you can get your homosocial needs served. In my experience the availability of such spaces hasn’t pushed Japanese gay men to adopt or embrace the radical queer politics the west has developed. It makes sense to me that having realizations about one’s own political identity (and consequently expecting/demanding societal changes) goes against the widely acknowledged understanding that Japanese people are selfless and utterly dedicated to the grand balance of things (zen) that their nation is so proud of. But I still find the fact that Japan has basically treated sex as a consumer good industry more interesting. Gay men often find a family in the bars they patronize, with the bar master (owner) often organizing events inside and outside the bar for his costumers. All these interactions are not politicized as they were in northern Europe or the coastal US throughout the 20th century. Also, they never experienced the AIDS crisis. In Japan there is way too much “life” (a whole lot really) happening behind closed doors. Because of the way Japanese society functions, you probably have an incredibly low number of accidents when it comes to gay bashing or hate crimes towards queer people (mostly because proud queer people as we know them in the west barely exist). It’s a tricky place for critical thought to emerge in general. ",
            "date": "Answered March 13, 2017",
            "views": "65",
            "upvotes": " View 14 Upvoters",
            "upvoters": [
                {
                    "user_id": "Mythra Varuna",
                    "user_href": "/profile/Mythra-Varuna-1"
                },
                {
                    "user_id": "Bokumania",
                    "user_href": "/profile/Bokumania"
                },
                {
                    "user_id": "Angelise Bonet",
                    "user_href": "/profile/Angelise-Bonet"
                },
                {
                    "user_id": "Landin Comins",
                    "user_href": "/profile/Landin-Comins"
                },
                {
                    "user_id": "Sidney Youngs",
                    "user_href": "/profile/Sidney-Youngs"
                },
                {
                    "user_id": "Nguyễn Tuấn Anh",
                    "user_href": "/profile/Nguyễn-Tuấn-Anh-18"
                },
                {
                    "user_id": "David Huffert",
                    "user_href": "/profile/David-Huffert"
                },
                {
                    "user_id": "Aurelie Moorjee",
                    "user_href": "/profile/Aurelie-Moorjee"
                },
                {
                    "user_id": "Marc Kerkmann",
                    "user_href": "/profile/Marc-Kerkmann"
                },
                {
                    "user_id": "Jen Rhoades",
                    "user_href": "/profile/Jen-Rhoades"
                }
            ]
        }
    ]
}