{
    "title": "How to completely change my social life - Quora",
    "tags": [
        "Social Life",
        "Social and Behavioral Norms",
        "Interpersonal Interaction Advice",
        "Social Psychology",
        "Love Life Advice",
        "Social Advice",
        "Dating Advice",
        "Interpersonal Interaction"
    ],
    "response": [
        {
            "author_info": {
                "name": "Judah Frangipane",
                "href": "/profile/Judah-Frangipane"
            },
            "answer_text": "There's a book called How to win friends and influence people. The title is slightly misleading. It's a guide to basic social interaction, and being a decent person. The friendships follow from that.  I've made friends by telling jokes or telling someone a joke. I've had people approach me and want to be friends after being in class with them for a while. Basically, they got to know me and they decided they wanted to be friends.  Sometimes it just happens after you spend time with people long enough. Other times to make friends you have to be friendly. What that means is you may have to do the work to show someone who you are and get to know who they are. Talk to them, listen to them, find common ground and spend time with them.  If I were you I'd find out about any after school classes you're interested in. If you like sports then join the team, if you like drama then join the theater department. There's sites like Find your people - Meetup that let you search for hobbies or interests and meet others who share your interests.  There are groups like toast masters that help you get over the fear of public speaking. Even if you don't plan to do any public speaking it's a great place to learn how to create a real life social network. When I've gone I've felt like everyone there knew where I was coming from and were rooting for me to succeed.  Reading books and watching movies you'll typically see the beginning and initiation of relationships. Pay attention to those and your own experiences and learn from body language and subtle clues. Hang out with people who are social and watch what they do.  Someone else just answered with the same book. Lol that's a good sign.  ",
            "date": "Answered April 28, 2016",
            "views": "14",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Kajal Shah",
                    "user_href": "/profile/Kajal-Shah-67"
                },
                {
                    "user_id": "Edward Isajanyan",
                    "user_href": "/profile/Edward-Isajanyan"
                },
                {
                    "user_id": "Joel Goldstein",
                    "user_href": "/profile/Joel-Goldstein-7"
                }
            ]
        },
        {
            "author_info": {
                "name": "Andrew King",
                "href": "/profile/Andrew-King-98"
            },
            "answer_text": "Hi, I know exactly what you mean, I used to have extreme fear of socal interactions with my peers.(i take it you mean with your peers)Now I am pretty good and comfortable with these social interactions, and trust me it was not easy. I had to work for weeks and months to get over my fear. I know you probably want quick and easy ways to get good at being social but really they all require hardwork. Here are some of the things that worked for me, granted this may not be the best methods for you but it's worth a shot :) : 1. Talk to strangers. What I did was going to my local pool, sit in the hot tub and just try and start conversations with random people sitting next to me.  2. Answer more questions.Since you are in school now, a good way to get used to speaking in front of a group of people confidently is answering questions and participating more in class. Trust me this will help you with speaking in public. 3. Greet people you want to talk to. Even if it is just a head nod,acknowledge those people. This will hopefully tell them that you are friendly and nice. Hopefully.  4. Talk on the phone. Unfortunately, this can back fire. What I did was looking up a company or something and just call them up. Them if they answered, I would try and have a conversation with them. But I warn you, keep it related to the topic and polite. If they think it's a prank call or someone wasting their time, then they may hang up or call the police.  5. Keep track of progress. Keep track of what you have done. Be proud of how far you have gotten and keep an end goal in mind. ",
            "date": "Answered April 28, 2016",
            "views": "462",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Joel Goldstein",
                    "user_href": "/profile/Joel-Goldstein-7"
                },
                {
                    "user_id": "Diego Galárraga Sugoniaev",
                    "user_href": "/profile/Diego-Galárraga-Sugoniaev"
                }
            ]
        }
    ]
}