{
    "title": "How have you successfully dealt with noisy neighbors? - Quora",
    "tags": [],
    "response": [
        {
            "author_info": {
                "name": "Hector Aleman",
                "href": "/profile/Hector-Aleman-5"
            },
            "answer_text": "LLoud neighbors are usually inconsiderate people who don't know what it means to be responsible and respectful towards others. The way to deal with them is you send a certified return receipt letter to your landlord. In this letter you state that as a responsible tenant you have the right to peace and quiet it's the law. You then start reporting them to whatever state agency that takes complaints make sure you get the name, badge number, date, time and confirmation number. Then Google peace and quiet noise and codes. Then keep a diary of everything. Then go to your landlord and tell him it he doesn't help you abate the nuisance that you will be asking the court for an abatement of your rent. Good luck and be vigilant. ",
            "date": "Updated April 24, 2020",
            "views": "57",
            "upvotes": " View 2 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/Gigi-859"
                },
                {
                    "user_id": "Rim Tesfaye",
                    "user_href": "/profile/Rim-Tesfaye"
                }
            ]
        },
        {
            "author_info": {
                "name": "Edward Tierney",
                "href": "/profile/Edward-Tierney-6"
            },
            "answer_text": "I had a bunch of students living next door. I was working long hours, and needed my sleep. They would have parties every night to the small hours, doors slamming, loud music, nightmare. I had the phone number of one of the mothers. One night I phoned her at 4am, and made her listen to what her little darling was getting up to. She was furious. I said I would do it every time I was wakened by them. Which I did, much to her annoyance. I also started a campaign of harassment. I phoned the police who came round regularly and shut them up. I reported it to the police when I smelled marijuana, which led to a swoop and some arrests. I had a lawyers letter issued, and threatened court proceedings.They sold up after a few months, at a loss. I slept like a baby thereafter. It can be done, but it takes a campaign. I never engaged with them directly- there was no point in getting angry with a crowd of drunks, and getting ever more riled. I dealt with it coolly but very consistently, and I got there. Good luck. ",
            "date": "Answered February 11, 2019",
            "views": "186",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Lori Humes Powley",
                    "user_href": "/profile/Lori-Humes-Powley"
                },
                {
                    "user_id": "Mary Pauly",
                    "user_href": "/profile/Mary-Pauly"
                },
                {
                    "user_id": "Nikki Ewald",
                    "user_href": "/profile/Nikki-Ewald"
                }
            ]
        }
    ]
}