{
    "title": "How many pages in length should a good novel be? - Quora",
    "tags": [
        "Novels"
    ],
    "response": [
        {
            "author_info": {
                "name": "Jody Lebel",
                "href": "/profile/Jody-Lebel"
            },
            "answer_text": "Assuming you are writing to sell to the general market, below is the ‘standard’ that publishing houses are looking for. Of course, if you write a phenomenal story there are exceptions. For example: the Harry Potter series. From: How Long Should Your Story Be? “Micro-Fiction or short shorts (up to 100 words): This very abbreviated story is often difficult to write, and even harder to write well, but the markets for micro fiction are becoming increasingly popular in recent times. 6 word micro-story: \"For Sale: Baby shoes. Never Worn.\" - Attributed to Ernest Hemingway Flash Fiction (100 - 1,000 words): This is the type of short-short story you would expect to find in a glossy magazine, often used to fill one page of quick romance (or quick humor, in men's mags) Very popular, still not easy to write, and not easy to sell. Short Story (1,000 - 7,500 words): The 'regular' short story, usually found in periodicals or anthology collections. Most 'genre' zines will features works at this length. Novellette (7,500 - 20,000 words): Often a novellette-length work is difficult to sell to a publisher. It is considered too long for most publishers to insert comfortably into a magazine, yet too short for a novel. Generally, authors will piece together three or four novellette-length works into a compilation novel. Novella (20,000 - 50,000 words): Although most print publishers will balk at printing a novel this short, this is almost perfect for the electronic publishing market length. The online audience doesn't always have the time or the patience to sit through a 100,000 word novel. Alternatively, this is an acceptable length for a short work of non-fiction. Novel (50,000 -110,000 words): Most print publishers prefer a minimum word count of around 70,000 words for a first novel, and some even hesitate for any work shorter than 80,000. Yet any piece of fiction climbing over the 110,000 word mark also tends to give editors some pause. They need to be sure they can produce a product that won't over-extend their budget, but still be enticing enough to readers to be saleable. Imagine paying good money for a book less than a quarter-inch thick? Epics and Sequels (Over 110,000 words): If your story extends too far over the 110,000 mark, perhaps consider where you could either condense the story to only include relevant details, or lengthen it to span out into a sequel, or perhaps even a trilogy. (Unless, of course, you're Stephen King - then it doesn't matter what length your manuscript is - a publisher is a little more lenient with an established author who has a well-established readership.)” ",
            "date": "Answered March 27, 2017",
            "views": "57",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Isaac Chew",
                    "user_href": "/profile/Isaac-Chew-5"
                },
                {
                    "user_id": "Andrea Wood",
                    "user_href": "/profile/Andrea-Wood-136"
                },
                {
                    "user_id": "Rahul Arora",
                    "user_href": "/profile/Rahul-Arora-127"
                },
                {
                    "user_id": "Jimi Alan",
                    "user_href": "/profile/Jimi-Alan"
                }
            ]
        },
        {
            "author_info": {
                "name": "Peyton Shields",
                "href": "/profile/Peyton-Shields"
            },
            "answer_text": "A novel should be as long as it needs to be. Let me clarify, there is no set limit on pages. There is no “maximum” or “minimum” number. While I'm not qualified to speak on the level or critic, I personally believe a good novel should have outstanding character development, an interesting and original plot, and should engage the reader. What do I mean by engage the reader? Simple, don’t write a prosaic book. Imagery and metaphor are your friend. Use them. To cover all of the criteria I've listed is a matter of satisfaction. Are you, as the author, content with what you have written? Do you feel it could be improved or that it is merely average? Even then, a good book is entirely dependent on the public. You may believe your novel is astounding, but the public may dislike it. ",
            "date": "Answered March 26, 2017",
            "views": "32",
            "upvotes": " View 5 Upvoters",
            "upvoters": [
                {
                    "user_id": "Isaac Chew",
                    "user_href": "/profile/Isaac-Chew-5"
                },
                {
                    "user_id": "Mario Molinari",
                    "user_href": "/profile/Mario-Molinari-2"
                },
                {
                    "user_id": "Rahul Tomar",
                    "user_href": "/profile/Rahul-Tomar-57"
                },
                {
                    "user_id": "Rain Greene",
                    "user_href": "/profile/Rain-Greene"
                },
                {
                    "user_id": "Jimi Alan",
                    "user_href": "/profile/Jimi-Alan"
                }
            ]
        }
    ]
}