{
    "title": "How should I go about researching a topic for a nonfiction book? - Quora",
    "tags": [
        "Non-Fiction Books",
        "Topics",
        "Non-Fiction",
        "Publishing",
        "Academic Research",
        "Scientific Research",
        "Research",
        "Writing",
        "Book Recommendations"
    ],
    "response": [
        {
            "author_info": {
                "name": "Patricia Collins",
                "href": "/profile/Patricia-Collins-7"
            },
            "answer_text": "Tommy, I’m concerned that if you don’t even know how to research a topic, you are ill-prepared to write a book-length nonfiction manuscript. Any advice I could give you might come across as dumbing-down advice to someone who is already a nonfiction writer. You need a natural curiosity to learn a whole lot more about a topic that you’re already drawn to.You probably want to start with a broad reading of information about that topic and then to dive deeply into a few of the questions that arise as a result of your initial investigation. Make sure that some of these sources are physical books and journals/magazines. Make sure the topic of your interest hasn’t already been dealt with sufficiently in other books.If the topic is about a phenomenon that is too current to have produced published materials, be careful. It takes a long time between information and manuscript and a very long time between manuscript and publication. Will your topic still be “topical” in 3–4 years?You may need to visit places or people to gather information that can’t be found in books.You’ll want some multi-media sources that allow you to make “first-hand” observations in the manner you would if you could visit a place/person and observe, if that’s possible.You need to formulate a message: What knowledge or perspective on your specific topic do you want the reader to come away with?It’s at that point that you will know where to go for information and how deeply to search for information that will enable you to achieve your objective (i.e., to effectively communicate your message). Research librarians are still a great resource for those who are new to research. Make an appointment with one and learn as much as you can from them about how to find what you need. ",
            "date": "Answered August 6, 2020",
            "views": "57",
            "upvotes": " Answer requested by Tommy Smith"
        },
        {
            "author_info": {
                "name": "Ameesha Smith-Green",
                "href": "/profile/Ameesha-Smith-Green"
            },
            "answer_text": "There’s a phrase in writing: “write about what you know”. Of course, it’s good to challenge yourself in life and learn about new areas, but it’s much easier and more effective to write about the things you already know. If you look at the nonfiction bestsellers, they’re not written by people who just decided to research a topic and write a book, but by people who have been living the topic. Nonfiction works best when it’s written by subject matter experts because they’re passing on their knowledge, experience, and expertise. Think about it this way, if you can go and research a topic and form that into a book, the reader could just as easily research the topic and they wouldn’t need to buy your book. They’re buying the author’s expertise, not their ability to research. If you’re trying to write about something you don’t know inside-out, then you’re giving yourself an uphill battle in having to learn a new topic, become an expert in it, then convey that to the reader. Instead, why not write a book on a topic that you already know about and are a subject matter expert in? That way, you’d pass along your expertise, which would be valuable to the reader. ",
            "date": "Answered August 7, 2020",
            "views": "64",
            "upvotes": " Answer requested by Tommy Smith"
        }
    ]
}