{
    "title": "How is Brandon Sanderson’s Stormlight Archive his “love letter” to fantasy writing? - Quora",
    "tags": [
        "The Stormlight Archive (book series)",
        "Brandon Sanderson",
        "Fantasy (genre)",
        "Creative Writing",
        "Novels",
        "Writing Advice",
        "Writing",
        "Love"
    ],
    "response": [
        {
            "author_info": {
                "name": "Helen Waltz",
                "href": "/profile/Helen-Waltz"
            },
            "answer_text": "Sanderson has said that the characters and plot for The Stormlight Archives had been brewing in the back of his mind for almost the total time he’s been writing. They’ve been growing, adapting, linking together, waiting for the right words to express them. The first draft of the first book came out when Sanderson was uncertain he would sell anything, let alone an epic fantasy tome. He wrote it purely for the joy of writing epic fantasy, purely for the story in its pages. More than that, too. These books are a love letter because of the detail carefully inserted into every facet of the world. We have art, songs, poetry, short stories, myths, all woven together. Everything is made to be a celebration of what epic fantasy can be. I am biased, if you couldn’t tell already. I am in love with his writing. A Sanderfan, if you so desire. The fact remains that this series is on a scale and depth that I had never seen before, and is closely intertwined with Sanderson himself. This is his heart and soul laid out on a page, and that page was coincidentally publishable. If you want to read more, here is his story in his own words. Like the book itself, it is a bit winding, with arguably too many prologues, but not too difficult to get to the meat of. Words of Radiance and the Art of Creating Epic Fantasy Now that my Ode to Sanderson is over, I will step aside, and let you decide for yourself whether to read it, and how it will speak to you. ",
            "date": "Answered October 1, 2019",
            "views": "239",
            "upvotes": " View 6 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Bram de Lorijn",
                    "user_href": "/profile/Bram-de-Lorijn"
                },
                {
                    "user_id": "Xifeng Chen Dracul",
                    "user_href": "/profile/Xifeng-Chen-Dracul"
                },
                {
                    "user_id": "Millard Steven",
                    "user_href": "/profile/Millard-Steven"
                },
                {
                    "user_id": "Robert Anthony Ramos",
                    "user_href": "/profile/Robert-Anthony-Ramos"
                },
                {
                    "user_id": "Andrew Petersen",
                    "user_href": "/profile/Andrew-Petersen-1"
                },
                {
                    "user_id": "David Seyms",
                    "user_href": "/profile/David-Seyms"
                }
            ]
        },
        {
            "author_info": {
                "name": "Barry Craik",
                "href": "/profile/Barry-Craik"
            },
            "answer_text": "I’m not sure about his “love letter,” but I’ll give you the answer he gave me about the Stormlight Archives. SA is Brandon’s “epic fantasy series,” like A Song of Ice and Fire (Game of Thrones), or Wheel of Time, or the Malazan Books of the Fallen. He has always admired the longer length fantasy epics, and wanted to create one of his own. ",
            "date": "Answered July 1, 2019",
            "views": "40",
            "upvotes": " Answer requested by David Seyms"
        }
    ]
}