{
    "title": "How to approach a white girl if I like her knowing I'm black - Quora",
    "tags": [
        "Interracial Dating and Relationships",
        "White People",
        "Black People",
        "Relationships and Dating of Young People",
        "Race and Ethnicity",
        "Teenagers and Teenage Years",
        "Relationship Advice",
        "Dating Advice",
        "Dating and Relationships"
    ],
    "response": [
        {
            "author_info": {
                "name": "Kray Zee",
                "href": "/profile/Kray-Zee-1"
            },
            "answer_text": "Are you stupid? Like any other girl - not giving a F* about her race) Remember the rule: if someone doesn't like you because of you race, you don't want to be around that person. That's all. And actually not only the race. It goes for many characteristics of your personality and quirks. Think about it: you love to read and someone thinks that's lame. You won't have any positive interaction with that person, unless you have a common goal, which is \"the enemy of my enemy is my friend\", but it's usually a short interaction that ends with achieving or abandoning the goal.. So, just cut you doubts) And also work a bit on your writing) Your question can mean several thing: 1. What you probably meant, how do I — a black guy – approach a white girl if i like her.2. How do I approach a white girl if I like the fact that she knows that I'm black. And one more 'pro tip' avoid telling anybody that you like or love someone. You don't even say that often to your girlfriend who you actually love, just show it. Do nice things for her, be around when it's necessary, support, and other stuff that's what really says that you like or love her. And my man, the trial and error method works the best) Just find what works for you, I mean do you know what relationships you want? What types of girls you like? What I mean is, you will never know that's your favorite taste of candy until you try many of them. And if you afraid that you may 'try for too long' read The Mathematics of Love by Hannah Fry. ",
            "date": "Answered October 22, 2020",
            "views": "401",
            "upvotes": " View 12 Upvoters",
            "upvoters": [
                {
                    "user_id": "Caoimhe Murphy",
                    "user_href": "/profile/Caoimhe-Murphy-43"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/L-R-508"
                },
                {
                    "user_id": "Julie Smith",
                    "user_href": "/profile/Julie-Smith-1658"
                },
                {
                    "user_id": "Euqi Piers",
                    "user_href": "/profile/Euqi-Piers"
                },
                {
                    "user_id": "Jim Scott",
                    "user_href": "/profile/Jim-Scott-232"
                },
                {
                    "user_id": "Malik Brooks",
                    "user_href": "/profile/Malik-R-Brooks"
                },
                {
                    "user_id": "Juliet Lo",
                    "user_href": "/profile/Juliet-Lo-2"
                },
                {
                    "user_id": "Ines Senechal",
                    "user_href": "/profile/Ines-Senechal"
                },
                {
                    "user_id": "Joe Booth",
                    "user_href": "/profile/Joe-Booth-2"
                },
                {
                    "user_id": "Drake Watson",
                    "user_href": "/profile/Drake-Watson-5"
                }
            ]
        },
        {
            "author_info": {
                "name": "Evans Okosodo",
                "href": "/profile/Evans-Okosodo"
            },
            "answer_text": "When you sight her and figure out that you like her, go for her before she noticed you are looking at her. When, you get to where she see, spark up a conversation. For example, you can say you look so cute, do live around this area? I wonder if we could hang out soon. A white lady thinks she is smart, beautiful, and of a higher class than the black. This does not mean they are racist. More importantly, she appreciated whoever has the boldness to approach her directly, go straight to the point, and not beat about the bush first. If she is available (i.e., ready for love), she will respond to you gently and with a smile. At this point you need to keep the conversation going and ask for her phone number. This bold approach has a potential to work but if she is no interested, please move on. No sentiment. Try another girl. -Evans Okosodo Chief Software Architect ",
            "date": "Answered October 25, 2020",
            "views": "185",
            "upvotes": "0"
        }
    ]
}