{
    "title": "How is the NEET Most Wanted Physics book by ARS? Should we get a good score by studying that book? - Quora",
    "tags": [
        "National Eligibility cum Entrance Test (NEET)",
        "Book Recommendations",
        "Books"
    ],
    "response": [
        {
            "author_info": {
                "name": "Abhishek",
                "href": "/profile/Abhishek-Abhi-1352"
            },
            "answer_text": "😁😁 I know who asked the question You can get good score by studying NCERT too i have seen many aspirants just want shortcuts for cracking neet ( NCERT at abx ,xyz,oo ) Is this book sufficient for neet etc etc Believe in your preparation not on any book How is the NEET Most Wanted Physics book by ARS? Should we get a good score by studying that book? Maybe good because the author himself said they derived it from ncert , ncert fillers , and many more things you can go for it also many old publications still have this feature (Fingertips , Arihant) Should we get a good score by studying that book? Yes /No both NCERT is father / Mother of NEET no xyz book can take its place *don’t get me wrong I Know you must be having 2–3 coaching modules , previous year papers and you still want to buy any book just because you doubt your preparation Solve modules they too give ncert based questions else buy Mtg books If you still want to buy this book then make sure you recheck the answers don’t follow blindly one of my cousin bought Gear up maximum answers were wrong",
            "date": "Answered February 7, 2020",
            "views": "14",
            "upvotes": " View 5 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Jay Mahakaal",
                    "user_href": "/profile/Jay-Mahakaal-6"
                },
                {
                    "user_id": "Ashutosh Chakraborti",
                    "user_href": "/profile/Ashutosh-Chakraborti-1"
                },
                {
                    "user_id": "Kaushikee Prabha",
                    "user_href": "/profile/Kaushikee-Prabha"
                },
                {
                    "user_id": "Dhyan Chand",
                    "user_href": "/profile/Dhyan-Chand-34"
                },
                {
                    "user_id": "Neha Singh",
                    "user_href": "/profile/Neha-Singh-7607"
                }
            ]
        },
        {
            "author_info": {
                "name": "Anshumaan Thakur",
                "href": "/profile/Anshumaan-Thakur"
            },
            "answer_text": "Don’t fall for such cheap scams by some poeple who derive benefit from being in top colleges. Read your normal NCERT and solve good books like MTG and Biology Booster by S. Ansari Sir. Even the Errorless Biology for NEET is a fine book. People like Aryan Raj and Aman Tilak don’t give a f**k about you and you shouldn’t give a f**k about them. This will hurt if you are a fanboy but if you think logically you’ll be able to see why I am saying this. Do you really think there is a “Magic book” that will boost your score from 400 to 650 in a few days? Do you even have the slightest idea how much effort goes into scoring a score of 650 and that too consistently? Believe me it takes months of late nights and tons of MCQ solving to get there. No magic book will do that for you. The only people falling for Aryan Raj’s scams are the ones who are too weak/scared to work hard. My friend, Aryan Raj and Aman Tilak just want to scam you of your parent’s hard earned money. DON’T FALL FOR SUCH CHEAP TRICKS MY FRIEND!!! ",
            "date": "Answered August 5, 2020",
            "views": "189",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Ashutosh Chakraborti",
                    "user_href": "/profile/Ashutosh-Chakraborti-1"
                },
                {
                    "user_id": "Rakesh Kumawat",
                    "user_href": "/profile/Rakesh-Kumawat-208"
                },
                {
                    "user_id": "Piru",
                    "user_href": "/profile/Piru-4"
                }
            ]
        }
    ]
}