{
    "title": "How to regain your memory after narcissistic abuse - Quora",
    "tags": [
        "Emotional Abuse",
        "Memories",
        "Memory (information storage)",
        "Abuse",
        "Human Memory",
        "Narcissistic Personality Disorder",
        "Narcissism",
        "Self-Improvement"
    ],
    "response": [
        {
            "author_info": {
                "name": "Scarlet Putnam",
                "href": "/profile/Scarlet-Putnam"
            },
            "answer_text": "Memory issues are common among victims of abuse, regardless of the diagnosis of the perpetrator. Abuse is traumatic. It causes high levels of stress, fear, feelings of panic, all around emotional upheaval. When this is in the process of happening, when the abuse is actually taking place, the body goes into “fight, flight or freeze” mode. When this happens, the emotional, instinctual brain, “reptile” brain (due to it being the most primitive part of the human brain) is in control. When the reptile brain is in control, the higher level functioning brain (the part that governs executive function - reasoning, processing, analyzing, etc.) is not in control.Both parts of the brain cannot be in control at the same time. So what happens is that anything happening during the abuse, or after it, that requires the skills of the higher level brain - reasoning, logic, processing, etc., isnt going to be stored in the memory because that is not the area of the brain running the show at that moment. It can take awhile for fight or flight to wear off, for stress levels to come down, and during this time, those higher level skills are sort of out of whack. It is common for people to not remember conversations, going to the grocery store, taking the kids to school, cleaning the house, ironing, other incidents that happen. So it is possible that these memories are never recovered, because they were never stored in the first place. Those with abuse instigated memory issues often find that when they remove themselves from the abusive situation, their memory steadily improves in terms of current ability to store information, recall things, etc. It is difficult while still in the situation to get the memory, or other cognitive functions, operating at optimum levels because the excessive, consistent overflow of cortisol (stress hormone) has a strong effect on the cognitive capacities. ",
            "date": "Answered August 18, 2019",
            "views": "418",
            "upvotes": " View 14 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Kyla Quinn",
                    "user_href": "/profile/Kyla-Quinn-4"
                },
                {
                    "user_id": "Sharon Leader",
                    "user_href": "/profile/Sharon-Leader-2"
                },
                {
                    "user_id": "Anne Pomfrett",
                    "user_href": "/profile/Anne-Pomfrett"
                },
                {
                    "user_id": "Jack Covington",
                    "user_href": "/profile/Jack-A-Covington"
                },
                {
                    "user_id": "Mona Alexandra",
                    "user_href": "/profile/Mona-Alexandra-2"
                },
                {
                    "user_id": "Kristin Koepke",
                    "user_href": "/profile/Kristin-Koepke"
                },
                {
                    "user_id": "Heather Parks",
                    "user_href": "/profile/Heather-Parks-49"
                },
                {
                    "user_id": "Kathy LeFevers",
                    "user_href": "/profile/Kathy-LeFevers"
                },
                {
                    "user_id": "Rob Cox",
                    "user_href": "/profile/Rob-Cox-46"
                },
                {
                    "user_id": "Ula Douglas",
                    "user_href": "/profile/Ula-Douglas"
                }
            ]
        },
        {
            "author_info": {
                "name": "Lee Miller",
                "href": "/profile/Lee-Miller-244"
            },
            "answer_text": " The short answer is: TIME! I had extreme memory problems after my narcissistic abuse because not only did I have CPTSD from the abuse - I had brain-damage as a result of one of the attempts on my life that she organized. I was beaten with metal bars for several hours and left for dead. I had severe short term memory problems as well as object permanence problems. If I could not see it - it did not exist. There are things you can do to help your memory: Stop worrying about your memoryDecide NEVER to get frustrated with yourself - just laugh about it and let it goGet into the habit or writing things down - the action of writing things down will generally improve memory even if you dont look at the listIf you have important things to remember - visualize yourself screwing the thought into your head securelyPut an elastic band on your wrist and twang it when you need to implant a memoryTake Vitamin B6 and B12Eat a Keto diet - this is a bit extreme but it does workGet A LOT OF SLEEPMeditateGo for walks in nature for 20 minutes a daySee my ESSENTIAL GUIDE TO RECOVERY for more ideas ESSENTIAL GUIDE TO RECOVERY FROM ABUSE by Lee Miller on DATING HARLEY QUINN everything on here will in one way or another improve memory - because recovery will improve memoryNow all of this is geared towards improving short term memory. If you are having issues with longer term memory - these have just been suppressed. They will come back as you recover. Meditation helps unlock lost memories. As does any other ‘mindfulness’ activity. My advice - dont force it - they will need dealing with and the time will come for that. GOOD LUCK! :-D —- § —- “She tried to kill me twice, I tried to kill my self once, an employee of mine tried to kill me and in the end I tried to kill her. I went form $2 mill a year to homeless in 3 years and sank enough Meth to keep a heard of elephants awake indefinitely” My new book “DATING HARLEY QUINN - My 3 years with a female histrionic narcissist”. Available on Amazon and Apple Book store. Links in my biography. ",
            "date": "Answered June 18, 2019",
            "views": "586",
            "upvotes": " View 9 Upvoters",
            "upvoters": [
                {
                    "user_id": "SHIVANI DUBEY",
                    "user_href": "/profile/SHIVANI-DUBEY-30"
                },
                {
                    "user_id": "SL C",
                    "user_href": "/profile/SL-C-3"
                },
                {
                    "user_id": "Denise Lines",
                    "user_href": "/profile/Denise-Lines-1"
                },
                {
                    "user_id": "Rena Jones",
                    "user_href": "/profile/Rena-Jones-30"
                },
                {
                    "user_id": "Patricia Marshall",
                    "user_href": "/profile/Patricia-Marshall-68"
                },
                {
                    "user_id": "Michelle Margaret",
                    "user_href": "/profile/Michelle-Margaret-18"
                },
                {
                    "user_id": "Christina Eastburn",
                    "user_href": "/profile/Christina-Eastburn"
                },
                {
                    "user_id": "Robin Gillis",
                    "user_href": "/profile/Robin-Gillis-1"
                },
                {
                    "user_id": "Brittiny Gine",
                    "user_href": "/profile/Brittiny-Gine"
                }
            ]
        }
    ]
}