{
    "title": "How to get books at Barnes and Noble without paying as much for them - Quora",
    "tags": [
        "Barnes & Noble Nook",
        "Book Stores"
    ],
    "response": [
        {
            "author_info": {
                "name": "Albert Schmidt",
                "href": "/profile/Albert-Schmidt-7"
            },
            "answer_text": "There are several options: Get the membership and save 10% off, along with using coupons you get in emails (they are sent monthly, if I'm correct, and don't require membership to receive).Ask an employee or manager (they patrol the stores) for a coupon. Normally, they have little paper coupons handy as an incentive for customers to buy more. If they don't have any, don't be rude.Work at Barnes & Noble and get a 30% employee discount (40% on employee appreciation weeks).Buy on the Barnes & Noble website instead, which ships books right from the company rather than from a store. The books online are cheaper since the taxes added onto books in the stores also add a certain amount on the books to help pay employees. So this option is essentially just buying off of the website, which I believe also accepts coupons as well (if it doesn't, my mistake and sincere apologies). A lot of customers complain about why books online are cheaper than in the store and, without getting technical, here's my way of looking at it: the online portion is an entirely different company, if you will, from the store itself, a company not required to make the books cost extra to pay employees and keep the particular store running.Now, how do I know this stuff? What qualifications does this Alberto (please call me Albert, I hate the “o” in my name) guy have? I worked at Barnes & Noble, so I know quite a bit about saving money there. I also shop for books frequently and try saving money on them. Hope the answer helped. ",
            "date": "Answered July 11, 2017",
            "views": "281",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Gregory Jablynski",
                    "user_href": "/profile/Gregory-Jablynski"
                },
                {
                    "user_id": "Igor Elbert",
                    "user_href": "/profile/Igor-Elbert"
                },
                {
                    "user_id": "Eleanor Deberry",
                    "user_href": "/profile/Eleanor-Deberry"
                }
            ]
        },
        {
            "author_info": {
                "name": "Igor Elbert",
                "href": "/profile/Igor-Elbert"
            },
            "answer_text": "Do everything Albert Schmidt suggested but, in addition, buy Barnes & Noble gift card at a discount on a secondary market (Gift Card Exchange & Discount Gift Cards - Save up to 35% or similar). This would save you another 10% or so. ",
            "date": "Answered July 20, 2017",
            "views": "11",
            "upvotes": " View 9 Upvoters",
            "upvoters": [
                {
                    "user_id": "Mike Tisdale",
                    "user_href": "/profile/Mike-Tisdale"
                },
                {
                    "user_id": "Matthew Beasley",
                    "user_href": "/profile/Matthew-Beasley-5"
                },
                {
                    "user_id": "Arthur Homan",
                    "user_href": "/profile/Arthur-Homan"
                },
                {
                    "user_id": "Ann Burtt",
                    "user_href": "/profile/Ann-Burtt"
                },
                {
                    "user_id": "Joel Goldstein",
                    "user_href": "/profile/Joel-Goldstein-7"
                },
                {
                    "user_id": "Igor PAller",
                    "user_href": "/profile/Igor-PAller-1"
                },
                {
                    "user_id": "Elijah Velaski",
                    "user_href": "/profile/Elijah-Velaski"
                },
                {
                    "user_id": "Karthik Nanchari",
                    "user_href": "/profile/Karthik-Nanchari"
                },
                {
                    "user_id": "Jonathan Brill",
                    "user_href": "/profile/Jonathan-Brill"
                }
            ]
        }
    ]
}