{
    "title": "How to self study chemistry from zero knowledge to higher level chemistry? What are some good books or resources - Quora",
    "tags": [
        "Self Study",
        "How-to Question",
        "Book Recommendations",
        "Books"
    ],
    "response": [
        {
            "author_info": {
                "name": "Sarah Zhang",
                "href": "/profile/Sarah-Zhang-87"
            },
            "answer_text": "I like online material because it's usually free and the internet holds so much info, so I suggest using Khan Academy, edX, and Free Online Course Materials (MIT OpenCourseWare). Khan Academy is probably your best bet for introductory chemistry. It offers lessons in the form of articles and lessons, and allows you to practice. Khan Academy is a really well developed site, and I think you'll find it really helpful. The Khan academy page for Chemistry is this- Chemistry | Science |. Here is the introductory section- Introduction to chemistry. EdX was founded a few years ago by Harvard and MIT, and since then, many other notable universities and colleges have joined edX to offer free, high quality online courses. The courses range in content and difficulty. Here are the selection of Chemistry courses from edX- Courses. You can filter those results more to show courses based on their difficulty rating (which aren't always reliable though, so make sure to read the comments and course description), which ranges from introductory to advanced. One caveat is edX courses are usually specialized (i.e. not just general chemistry, but organic chemistry) and assume at least a bit of knowledge of the subject. MIT OpenCourseWare (OCW) is a web-based publication of virtually all MIT course content. OCW is open and available to the world for free. Courses level consist of both undergrad and graduate. OCW courses are probably going to be on the advance side if the spectrum (simply because they are college level courses!). Hope this helps! ",
            "date": "Updated May 24, 2017",
            "views": "68",
            "upvotes": " View 17 Upvoters",
            "upvoters": [
                {
                    "user_id": "Ahmed Tantawy",
                    "user_href": "/profile/Ahmed-Tantawy-11"
                },
                {
                    "user_id": "Raghad Sy",
                    "user_href": "/profile/Raghad-Sy-2"
                },
                {
                    "user_id": "Sebastian Torres",
                    "user_href": "/profile/Sebastian-Torres-34"
                },
                {
                    "user_id": "Grace Wong",
                    "user_href": "/profile/Grace-Wong-299"
                },
                {
                    "user_id": "Darie Emilian",
                    "user_href": "/profile/Darie-Emilian"
                },
                {
                    "user_id": "Anna Hurieva",
                    "user_href": "/profile/Anna-Hurieva"
                },
                {
                    "user_id": "Subhajit Shome",
                    "user_href": "/profile/Subhajit-Shome-1"
                },
                {
                    "user_id": "Paidamoyo Nyabvure",
                    "user_href": "/profile/Paidamoyo-Nyabvure"
                },
                {
                    "user_id": "Naveed Naveed",
                    "user_href": "/profile/Naveed-Naveed-16"
                },
                {
                    "user_id": "Abhijeet Chaudhuri",
                    "user_href": "/profile/Abhijeet-Chaudhuri-2"
                },
                {
                    "user_id": "Phong Tran",
                    "user_href": "/profile/Phong-Tran-182"
                },
                {
                    "user_id": "J",
                    "user_href": "/profile/J-798"
                },
                {
                    "user_id": "Timothy Mickiewicz",
                    "user_href": "/profile/Timothy-Mickiewicz"
                },
                {
                    "user_id": "David Parker",
                    "user_href": "/profile/David-Parker-281"
                },
                {
                    "user_id": "Salvador Macias",
                    "user_href": "/profile/Salvador-Macias-10"
                },
                {
                    "user_id": "Bro Gamer",
                    "user_href": "/profile/Bro-Gamer"
                },
                {
                    "user_id": "PhysicsMaster",
                    "user_href": "/profile/PhysicsMaster"
                }
            ]
        }
    ]
}