{
    "title": "How can liberalism deal with terrorism? - Quora",
    "tags": [
        "War on Terror",
        "Liberalism (politics)"
    ],
    "response": [
        {
            "author_info": {
                "name": "Brian Good",
                "href": "/profile/Brian-Good-6"
            },
            "answer_text": "I don't know if you consider Bill Clinton a liberal, but here's how his administration dealt with terrorism: After al Qaeda's 1993 bombing of the World Trade Center, they rather quickly identified the suspects,  located them, arrested them, put them on trial, convicted them, and jailed them.  (Of course all this was facilitated by the FBI's infiltrator in the plot.  This FBI mole, Emad Salem,  wanted to foil the bombing by substituting harmless powder for the exposives, but his FBI superiors overruled him.  The bombing went forward and 6 people died.) After the attack on the USS Cole, an FBI interrogator named Ali Soufan achieved excellent results from a suspect in the attack by establishing rapport with the subject, engaging him in philosophical discussions, and giving him small, thoughtful gifts. When the Clinton administration learned of the possibility of an upcoming terrorist attack, they formed a three-agency task force that met every day in the White House.  They were told to shake every tree for information, call in every favor.  The LAX Millenium Bomber was caught trying to cross the border from Canada.   (The cover story is that it was just luck that the Customs agent noticed that the bomber seemed very nervous.  It's very naive not to wonder WHY was he so nervous.  Intelligence operatives have a lot of ways of making people nervous.) Finally, the Clinton administration prepared a plan to \"roll back\" al Qaeda both through military action and interference with their finances.  According to TIME magazine, this plan would have been set in motion in late 2000 had the election controversy gone Al Gore's way.  As it was, the Clinton team decided not to start a war in the last months of their tenure.  They passed Richard Clarke's plan on to Dr. Condoleezza Rice in January, 2001--and she ignored it until a few days before 9/11. ",
            "date": "Answered January 13, 2016",
            "views": "448",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Thara Sanderson",
                    "user_href": "/profile/Thara-Sanderson-1"
                },
                {
                    "user_id": "Jonathan Simonoff",
                    "user_href": "/profile/Jonathan-Simonoff"
                },
                {
                    "user_id": "Hugh Caley",
                    "user_href": "/profile/Hugh-Caley"
                }
            ]
        },
        {
            "author_info": {
                "name": "Chris Joosse",
                "href": "/profile/Chris-Joosse"
            },
            "answer_text": "First, it's useful to understand that what distinguishes a 'terrorist' from a 'freedom fighter' is largely a matter of perspective.  When we want to distinguish sanctioned or legitimate warfare from unsanctioned or illegitimate violence, we change the terms to let everyone know what to think about them.  With that said, everyone is the hero of their own story, someone else has to be the villain.  You've doubtless heard the aphorism that \"one man's terrorist is another man's patriot\". To address the question, 'How can liberalism deal with terrorism?', I think we first have to unpack the sorts of assumptions that are almost certainly associated with it.  In the modern 'War on Terror' context (this question is tagged with that category), it's not uncommon for American conservatives to conflate 'terrorism' with any sort of 'otherness' that it might also be politically convenient to lump in with it- factors like religion, race, and the like.  This practice is rhetorically effective, (all those 'others' end up neatly categorized as enemies) but woefully misleading and morally disturbing, in the sense that if taken to their logical ends, they frame the tiniest terror attack in terms of war between civilizations. If it's me you're asking, the way liberalism can deal with terrorism is to put it into its proper scope.  The people behind modern terror might want to be regarded as warriors, representatives of the downtrodden, anointed by God, or whatever... but really, they're little more than organized criminals that happen to have pretty effective P.R. operations. So, they're criminals... but with a self-proclaimed cause. And they only seem to pop up in failed states or in places so deeply dysfunctional (for example: dominated by oligarchic oil cartels) that basic human dignity suffers.  Probably the best way to deal with terror is to treat that sort of criminal as such, and to process the failed/failing states where they arise into more functional ones.  Without the sort of power vacuum (in which a pickup-truck full of gunmen with a flag can knock over a town and proclaim themselves a state) for them to exploit, they'll find themselves better-occupied with jobs and families. ",
            "date": "Answered January 13, 2016",
            "views": "749",
            "upvotes": " View 6 Upvoters",
            "upvoters": [
                {
                    "user_id": "Sami Ismail",
                    "user_href": "/profile/Sami-Ismail-3"
                },
                {
                    "user_id": "Melody Richardson",
                    "user_href": "/profile/Melody-Richardson-2"
                },
                {
                    "user_id": "Jonathan Simonoff",
                    "user_href": "/profile/Jonathan-Simonoff"
                },
                {
                    "user_id": "Scott Welch",
                    "user_href": "/profile/Scott-Welch"
                },
                {
                    "user_id": "Nicholas Mew",
                    "user_href": "/profile/Nicholas-Mew-1"
                },
                {
                    "user_id": "Jaime Fuhrman",
                    "user_href": "/profile/Jaime-Fuhrman"
                }
            ]
        }
    ]
}