{
    "title": "How to go about creating an E book and selling it online - Quora",
    "tags": [
        "eBooks"
    ],
    "response": [
        {
            "author_info": {
                "name": "Stephen Balaban",
                "href": "/profile/Stephen-Balaban"
            },
            "answer_text": "IMPORTANT: Don't waste time writing an eBook until you know people actually want to buy it. The startup adage holds: Make something people want. 1) Understand your marketThere's no point in writing an eBook, or doing anything in business for that matter, without first understanding your customers. Get out of your house/office and talk with real peopleTweet and post in relevant social media groups and forumsTalk to people about what they would like out of your productThere's nothing worse than spending time on an eBook that nobody purchases, so make sure you know there's a market before you continue. Once you've found your market, you can begin researching your topic. 2) Conduct thorough research on topic I typically will read a ton of different material: Wikipedia articles (http://en.wikipedia.org)Magazine postsAcademic papers (http://scholar.google.com/)Lurk/post on relevant forums.This helps me gain a broad understanding of the content and niche that I'm targeting with my eBook. After I do thorough research and gather proper notes and citations, I begin to write. 3) Write your eBook Organize, organize, organize. And structure. The most important part of good literature, informational, fiction or otherwise, is structure. The structure of your text should mirror the mental model your reader creates when reading it. Make sure you make it easy for them to construct, follow and extrapolate upon that model. Write an outlineCreate sub-sections, break the eBook down into digestible chaptersHave each sub-topic follow into the next (see how I constructed this post)\"After I do thorough research... I begin to write.\" -> Write Your eBookThis helps the reader follow along.Follow the structure of the overall document in each sub-section:Example Structure:Introduction + Topic 1 + Introduction to Topic 1 + sub-topic 1 leading into sub-topic 2 + sub-topic 2 leading into sub-topic 3 + ... + Conclusion of Topic 1 leading into Topic 2  + Topic 2 + ... + ...Conclusion After you write your book, you now have to actually publish it into an eBook. This can easily be handled from your desktop. 4) Publish your eBook Create the eBookSave your Word, Google or whatever Doc to HTML, this is a strong base to work with other conversion methods. You might want to save directly to PDF in which case Google Docs and Drive can take care of it. In general you will want to support the following formats: ePUB (Open source .ePub eBook format) Yay!Mobipocket (Open .prc format) Yay!Amazon Kindle (product) AZW (Proprietary) Boo!Adobe Systems (company) PDF (file format) (Proprietary Photo Document File) Boo!As your first step, convert from the source format to ePub.My two favorite online ePub converters (just upload and download your ePub): 2epub (http://www.2epub.com/)ebook.online-convert (http://ebook.online-convert.com/convert-to-epub)Publish the eBook:Phew! Now you can post your new eBook on any of these sites: 1) Amazon's Kindle Store (https://www.createspace.com/)2) Apple's iBooks Store (http://itunes.apple.com/us/app/ibooks/)3) Clickbank Marketplace (http://www.clickbank.com/) More info:What is the best way to export from Word to epub format?How do I publish an eBook? It's always best to post on as many platform as you can. Each has it's own advantages and disadvantages but by posting on all of them you increase your sales and customer reach, which gets us into advertising. 4) Advertise your eBook This step is really important as well. The best way to do is to mix social media and traditional marketing. Social Media Marketing: Hop on some of the forums that are part of your target marketAnswer questions and be all-around helpfulPlace a link to your eBook page in your signatureTraditional Marketing: Check out PPC advertising platforms like Google AdsCheck out the sites that you found in your research and see if they would post a link to your eBook (maybe even offer a percentage of salesAffiliate Marketing: Affiliate Marketing platforms can help make sales as well [Amazon.com (product), Commission Junction, ClickBank (company), and Baybo]Be sure to provide your affiliates with all of the marketing material they might need (stock emails, stock images, advertising copy, etc.)Keep in touch and support them, remember, they work hard to make you money!Send me an email, tweet or private message if you want some more tips or just want to chat about ePublishing, online business, etc. I've been doing this for a while. stephen@baybo.it ",
            "date": "Updated September 1, 2016",
            "views": "930",
            "upvotes": " View 14 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Dipak Jairath",
                    "user_href": "/profile/Dipak-Jairath"
                },
                {
                    "user_id": "Olaleye Love",
                    "user_href": "/profile/Olaleye-Love-1"
                },
                {
                    "user_id": "Matthew Prince",
                    "user_href": "/profile/Matthew-Prince-6"
                },
                {
                    "user_id": "Hisham Itani",
                    "user_href": "/profile/Hisham-Itani-2"
                },
                {
                    "user_id": "Ramcsi",
                    "user_href": "/profile/Ramcsi"
                },
                {
                    "user_id": "Taofeeq Azeez",
                    "user_href": "/profile/Taofeeq-Azeez-1"
                },
                {
                    "user_id": "Waqas Khan",
                    "user_href": "/profile/Waqas-Khan-99"
                },
                {
                    "user_id": "Robert Morgan",
                    "user_href": "/profile/Robert-Morgan-46"
                },
                {
                    "user_id": "Alex Insouratselou",
                    "user_href": "/profile/Alex-Insouratselou"
                },
                {
                    "user_id": "Juma Mustafa",
                    "user_href": "/profile/Juma-Mustafa"
                },
                {
                    "user_id": "Celeste Fine",
                    "user_href": "/profile/Celeste-Fine"
                },
                {
                    "user_id": "Ningsang Jamir",
                    "user_href": "/profile/Ningsang-Jamir"
                },
                {
                    "user_id": "Puneet Bhatnagar",
                    "user_href": "/profile/Puneet-Bhatnagar"
                },
                {
                    "user_id": "Chad Cooper",
                    "user_href": "/profile/Chad-Cooper"
                }
            ]
        },
        {
            "author_info": {
                "name": "Fred Zimmerman",
                "href": "/profile/Fred-Zimmerman"
            },
            "answer_text": "There are a lot of options, but let me sketch out the overall contours of a plausible workflow.  Start with the content you want to publish. Your life will be much easier if the content is already in a text or simple HTML format..Prepare your content for conversion. You will learn from experience in step (3) what you need to do here!Decide on the target formats you want to support (ePub, Kindle, PDF ...)As your first step, convert from the source format to ePub.* from Word, save as HTML or use the Aspose Word to ePub plugin.* from simple html, use Sigil. 5. Convert from ePub to Kindle (.prc) and any other formats you want. 6.  Select retailers and distributors. At this writing, Amazon and BN's PubIt are the two biggest.  Apple's iBookstore is a pain for publishers and Google eBookstore sales are minimal, so I would put those as lower priorities. There are lots of other options, though.  You can sell directly from your own site, you can use aggregators like SmashWords or BookLocker, etc.  My advice is don't get caught in the weeds of exploring every single small company that offers a clever solution. Follow the 80/20 rule and focus on Kindle and PubIt. 7.  Create metadata (once): book description, blurbs, etc. 8. Upload desired format + metadata to retailers/distributors. 9. Test purchase and quality assurance. 10. Market. ",
            "date": "Answered January 25, 2011",
            "views": "254",
            "upvotes": " View 6 Upvoters",
            "upvoters": [
                {
                    "user_id": "Hisham Itani",
                    "user_href": "/profile/Hisham-Itani-2"
                },
                {
                    "user_id": "Right Coker",
                    "user_href": "/profile/Right-Coker"
                },
                {
                    "user_id": "Waqas Khan",
                    "user_href": "/profile/Waqas-Khan-99"
                },
                {
                    "user_id": "Robert Morgan",
                    "user_href": "/profile/Robert-Morgan-46"
                },
                {
                    "user_id": "Ningsang Jamir",
                    "user_href": "/profile/Ningsang-Jamir"
                },
                {
                    "user_id": "Rita Zerrizuela",
                    "user_href": "/profile/Rita-Zerrizuela"
                }
            ]
        },
        {
            "author_info": {
                "name": "Meenakshi Verma",
                "href": "/profile/Meenakshi-Verma-403"
            },
            "answer_text": "It’s pretty SIMPLE! You can do it in these few steps without breaking a sweat: Gather all the content The text material for the bookCover imageOther photos, images to be used inside the bookDetails about the book like, author, publisher, language, category etc. (these are called as metadata)Software to use For a normal user, MS Word can be effectiveFor a professional user, InDesign is recommendedDownload and install FREE software called as CALIBREEdit and format Flow your text in MS WordInitially make everything to NORMAL (from the style panel)Set the font according to your needDo not bother about page endings or the page sizeMake your Chapter names as Heading1 or Heading2Insert the cover photo in the beginning of the documentInsert all other images into the bookSave as DOC/DOCX fileImport to ePub Open Calibre softwareImport the MS Word documentUse the CONVERT icon to convert from MS Word to ePubGo to the folder containing the ePub fileYour eBook is readyPut your eBook online You can publish your books on digital platforms like Amazon Kindle, Google Play Books, Apple iTunes etc.Sign up with themGive all your details like PAN, Bank account etc.Submit the ePub file or PDF fileStart sellingPromote your eBook Use your social media postings and followers to promote your bookEmploy reviews, shares and some free content to generate traffic that may culminate in a saleNow you have your eBook LIVE that you can use to your heart’s content!  ",
            "date": "Answered August 31, 2020",
            "views": "116",
            "upvotes": " View Sharers",
            "upvoters": [
                {
                    "user_id": "Vanessa Lalloo",
                    "user_href": "/profile/Vanessa-Lalloo"
                }
            ]
        },
        {
            "author_info": {
                "name": "C Peter Konyak",
                "href": "/profile/C-Peter-Konyak"
            },
            "answer_text": "There are many ways out there in the online world where people are making good money online, and earning from making eBook is one of them and you can too! But the one condition that I should say it's based on is that your products should be helpful or productive on the customers. By having your own product, you'll experience a more profitable, scalable and stable business. Every \"guru\" knows that. You'll be amazed at how truly profitable it can be to have your very own winning product that sells. Wouldn't it be amazing if you had something you could call your own and be able to sell over and over again? But Here's Where The Problem Strikes... You don't know how to create a product You hate the pain and thought of writing There's too much garbage and fluffed up guides out there You hate putting the pieces of puzzles together just to get one simple thing done You tend to procrastinate when it comes to creating your products How Can You Get Started Right Here, Right Now?The process of creating your own products can be daunting, especially if you find it difficult to communicate and deliver your point. But luckily, I've made the job easier for you. I've created a practical guide on how to create your own info-products without doing the creation process yourself. This guide details the exact methods I use to create my own products on the fly. Let me introduce it to you; you can email below... digiproproof @gmail.com ",
            "date": "Answered October 19, 2020",
            "views": "8",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Julia Teare",
                "href": "/profile/Julia-Teare"
            },
            "answer_text": "The best way to write an ebook is do it, do it now! Get writing this very minute. Decide on your topic & go for it. Ordering that writing is useful, I write self help books so I break down my topic into parts, which will be my chapters. I write these down then add sub headings under each chapter. When it comes to the writing I have a plan of action I can see & write accordingly! I am guessing it is not too dissimilar writing fiction, mapping out your plot first. My biggest tip is write, write, write. You can edit when done. Too many people never finish writing their book as they get so hung up on editing as they they go that they get stuck on the first chapter forever! When you have finished pouring your soul onto the page, then go re-read & edit. After that, re-read & edit again! Lastly, get someone else to read it & suggest edits. I paid a designer for my cover but many of the sites such as Calibre or Amazon do a basic cover. Maybe check Fiverr too. I won't go into the technical side of converting your writing to Ebook form, but I assure you it is not hard, although that is not saying there is no work involved, what with formatting etc but there are lots of great tuition & articles online. As for selling your Ebook, that is where the work comes in! You have no publisher to help with this so it's all you baby! Social media & lots of it. Get friends & colleagues to rate it (this takes it further up Amazon lists, if you have gone with them) ... just plug, plug, plug!  Good luck! ",
            "date": "Answered May 12, 2016",
            "views": "357",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Yara Artiles",
                "href": "/profile/Yara-Artiles"
            },
            "answer_text": "Do some market research. Know what your ideal readers like and need. Get to work while you start proving value about the topic you're gonna tackle (and the ones you'll be tackling in a future) on social media (with a person brand) Once it's written, create a cover that matches your book after having done market research, choose the right keywords for your book, choose the royalties you want (they vary depending on the price) of the book and simply start 😊 Making sure you're being clear as misleading customers is punished by Amazon. They're currently closing many accounts due to it. People using other authors’ names, similar title, keywords that have nothing to do with the book… Let me know how it goes as wishing you well🙏 ",
            "date": "Answered August 28, 2020",
            "views": "366",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Chris O'Brien",
                "href": "/profile/Chris-OBrien-285"
            },
            "answer_text": "Two approaches to consider for creating your ebook. First and the most popular is Amazon KDP. Suzanne Steele’s answer is spot on, Amazon KDP is super easy to use. Tons of tutorials out there, both on Amazon’s site and on YouTube. When creating your final draft, you can use the freelance site Fiverr and have them format your text into the proper ebook format. You can also find ebook cover design for relatively low prices. You could also design your own cover in the tool Canva. All of this adds up to be in the $50-$100 range. And Amazon KDP is free, you don’t have to buy an ISBN. I disagree with some of the answers below saying not to “waste time writing an ebook.” After reading a few of the answers, the argument seems to be you might spend all of this time on something that sells five copies (which, to be fair, this does happen all the time). Which brings me to the second publishing approach. Why not release your ebook as a PDF that people can have via email? This way, even if it does sell just five copies, at least you have a connection to who those five people are. You can start building an email subscriber list. Keep them in the loop about the next book or other writing projects. Write the ebook because you want to do it. Work on making it as good as it can be and enjoy the process. It’s a really low-cost way to share your stories. ",
            "date": "Answered August 20, 2019",
            "views": "65",
            "upvotes": " Answer requested by Ian Sandoval",
            "upvoters": [
                {
                    "user_id": "Nabeela Imtiaz",
                    "user_href": "/profile/Nabeela-Imtiaz-1"
                },
                {
                    "user_id": "Tom Leigh",
                    "user_href": "/profile/Tom-Leigh-6"
                }
            ]
        },
        {
            "author_info": {
                "name": "István Farkas",
                "href": "/profile/István-Farkas-3"
            },
            "answer_text": "Let's split this question. Write: just like any other book. Being an e-book is a format question. Would you ask the question How can I write a paperback? How can I write a hardcover? The answer is the same. I'm not an author so I would not answer this one. Sell:  you have mainly two options. Go to a publisher, and let it sell your book, again, just like any other, independently from the format. Or you may go to a self-publishing platform, that may or may not covers printed and e-books. There are many platforms, that supports self publishing from Smashwords to Amazon KDP. Using these (and iTunes, Google Play, etc) customers are able to buy your book, technically. \"All\" you have to do now to convince them to buy your stuff. Promotion, marketing, campaigns, social media, etc. Roughly ;-) ",
            "date": "Answered May 11, 2016",
            "views": "235",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Chris A. Baird",
                "href": "/profile/Chris-A-Baird"
            },
            "answer_text": "Hi, Great Question! You can get up and going very simply: 1. figure out what books people are currently buying 2. Write a book in that genre 3. Format your book in Jutoh (see my profile for links) 4. Order cover on Fiverr that matches best sellers in that genre (see my profile for the artist I use) 5. Write description, make list of keywords 6. Post the book as a kindle book on Amazon. 6. Expand into new markets and book formats 7. Run amazon ads for your book. Those are the key steps to winning. Just start with the very first one and go from there. Try to get in 30 minutes a day as you move from one step to the next. ☆★☆ 100+ more answers -> CLICK on my Profile ☆★☆ P.S. If this answer was helpful... Please check out my YouTube channel under my profile! ",
            "date": "Answered September 14, 2020",
            "views": "58",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Mado Mac",
                    "user_href": "/profile/Mado-Mac"
                },
                {
                    "user_id": "Bobbie Dix",
                    "user_href": "/profile/Bobbie-Dix"
                }
            ]
        },
        {
            "author_info": {
                "name": "John Chapman",
                "href": "/profile/John-Chapman-103"
            },
            "answer_text": "Writing the book is easy.Editing it is much harder.Formatting the book as an ebook is a matter of learning how. Not too difficult.Publishing it is easy. You will need an effective cover though. You’ll also need an effective book description which should make people attracted by your cover think ‘I have to read that!’ Try Amazon KDP and follow their guidance for how to publish.Promoting and selling the book is by far the hardest task. You’ll need a lot of luck to be successful but there are things you can do to help.",
            "date": "Answered July 17, 2017",
            "views": "155",
            "upvotes": " View 2 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Vaibhav Kaushik",
                    "user_href": "/profile/Vaibhav-Kaushik-127"
                }
            ]
        },
        {
            "author_info": {
                "name": "Ajit Panicker",
                "href": "/profile/Ajit-Panicker-2"
            },
            "answer_text": "If the question is how to write an e-book, the steps are no different from writing a book. A book can be planned before you write or can be written and planned along, as and when the thoughts take shape. For the marketing part, they are not steps, there are tools for marketing. Check out www.ajitkpanicker.com if you want to learn how to publish and market your book. ",
            "date": "Answered November 24, 2017",
            "views": "142",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Blessed",
                    "user_href": "/profile/Blessed-98"
                },
                {
                    "user_id": "Jacob Handley",
                    "user_href": "/profile/Jacob-Handley-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Gary Hall",
                "href": "/profile/Gary-Hall-34"
            },
            "answer_text": "The process to create a successful ebook is as follows: 1. Create the book online using Google Drive 2. Get someone to proof read your book. 3. Test on your ebook reader by converting using Calibre or the command line 4. Get your friends and family to read it. 5. Work out what your market is. 6. Organise your artwork. 7. Build an online presence. 8. Launch your book. That's it in a nutshell. For more details have a look at this helpful guide ",
            "date": "Answered May 11, 2016",
            "views": "161",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Ajeet Kumar",
                    "user_href": "/profile/Ajeet-Kumar-119"
                }
            ]
        },
        {
            "author_info": {
                "name": "Amanda Huntington",
                "href": "/profile/Amanda-Huntington-10"
            },
            "answer_text": "There are several platforms where you can do this. There are book publishing platforms like Amazon KDP, Smashwords, Lulu, and IngramSpark. They allow you post your book online. You can also use e-commerce platforms, too. You can make a PDF and sell them on these platforms. Some good ones are GumRoad, PayHip, Sellfy, and Shopify Digital Downloads. ",
            "date": "Answered August 19, 2019",
            "views": "54",
            "upvotes": " View 2 Upvoters"
        },
        {
            "author_info": {
                "name": "Pranita Deshpande",
                "href": "/profile/Pranita-Deshpande-3"
            },
            "answer_text": "You can write e book in the PDF form & upload it on Instamojo share it & sell or keep it for sale on ,flip kart etc SUBMIT YOUR KYC- PANCARD,& BANK DETAILS Create a payment link Complete your profile upload your logo,fill up a bio & add contact details. ",
            "date": "Answered May 21, 2016",
            "views": "67",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Doreen Knight",
                "href": "/profile/Doreen-Knight-1"
            },
            "answer_text": "First you have to learn your craft. Take lessons, read books on writing, join a critique group, join groups in your specific genre, find a mentor, or whatever route appeals to you. Unless you write the best book you possibly can, all the marketing in the world will not help you. ",
            "date": "Answered May 11, 2016",
            "views": "326",
            "upvotes": " View 1 Upvoter"
        },
        {
            "author_info": {
                "name": "Sam Cox",
                "href": "/profile/Sam-Cox-84"
            },
            "answer_text": "An e-book is a digital entity. After it is written, it can be sold by social media ads, “pay per click.” Also Kindle and Amazon will help market for a fee. The digital market is world wide with 8 billion potential customers. Do the math if you can interest 1 tenth of 1 percent. ",
            "date": "Answered January 31, 2019",
            "views": "56",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Joe Avella",
                "href": "/profile/Joe-Avella"
            },
            "answer_text": "Write an e-book about making money writing e-books. Charge $9 for it. In the book tell the reader to write an e-book on how to make money writing e-books and instruct them to sell it for $9. Their e-book tells those reader to write an e-book about writing e-books and they can chare $9 for it and on and on and on.. ",
            "date": "Answered September 19, 2020",
            "views": "36",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Chukwu Nancy",
                "href": "/profile/Chukwu-Nancy-1"
            },
            "answer_text": "*Use fiverr to get writers or use google doc to write it yourself *Use grammarly and the likes to check grammatical accuracy *Do proper editing *Publish on Amazon kindle ",
            "date": "Answered September 18, 2020",
            "views": "15",
            "upvotes": "0"
        }
    ]
}