{
    "title": "How to change my life by reading books - Quora",
    "tags": [
        "Life-changing Books",
        "Reading",
        "Self-Improvement",
        "Life and Living"
    ],
    "response": [
        {
            "author_info": {
                "name": "Emijah Jones",
                "href": "/profile/Emijah-Jones"
            },
            "answer_text": "You could read a book a day, but its all in what you read I love reading and try to read everyday. I first became committed to reading in 6th grade. One of my favorites, The Dark Hills Divide By Patrick Carmen. I went school nights reading until 2am. One night, I was towards the end of the book series (Dark Hills is the first one), a character, very dear to the story, died. That night, at 11 I sat there and weeped over the death. Dramatic, I know. Looking back on it I laugh, but I sat there and stayed up for the rest of the night and into morning finishing the book, yearning for the door to shut from that amazing story. I was that thirsty for the conclusion. When it came I was satisfied, shut the book, and got ready for school (by that time I did an all -nighter). I was quiet that day, my friends were all concern but I was merely thinking. Thinking about all the lessons in the book that I was taught unknowingly and I was happy but sad. Its hard to explain. Ever since I’ve loved books, I always wanted to read the book before watching the movie. I started to enjoy those boring documentaries about animals near the Arctic Circle, and I love the smell of books, old and new. I like the ink, smudged and smeared or clean and clear. However, best of all, my vocabulary. Now as a freshman in high school, I use words such as jubilant or blasphemous like funny and I. Those are not complex but they’re enough to raise eyebrows in question. Then I always repeat the sentence without the “fancy” words. If that confuses people already, they should read my writing. I enjoy using words above my average age. I like being able to speak to adults just as intelligently and maturely as them, sometimes above. It makes me motivated, inspired to do better and keep striving. To learn more words and read 700 paged books for fun. That’s how reading can change your life. It makes you more mature, it opens your eyes and allows your mind to wander to unknown places. It adjusts your mindset positively and negatively and it brightens the mind to new perceptions. There’s even more than those, but let’s keep it on a broad stance… ",
            "date": "Answered August 24, 2018",
            "views": "685",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Olayemi Keshinro",
                    "user_href": "/profile/Olayemi-Keshinro"
                },
                {
                    "user_id": "Allan Bloxham",
                    "user_href": "/profile/Allan-Bloxham"
                }
            ]
        },
        {
            "author_info": {
                "name": "Hope Glitters",
                "href": "/profile/Hope-Glitters"
            },
            "answer_text": "I saw the question as two fold. (1). how does reading books help me. (2). what are the things I can do by reading books, that helps me improve myself. How does reading books help me: Good books are a good company. The books you enjoy are a better company.Helps you keep yourself occupied, when you find yourself in a situation/place where you have nothing else to do and nothing else to look at while introspectingIn the long run, helps you write better as it increases your sense of imagination (especially because there is no one to judge your imagination as right and wrong)Helps us question the current situation. When we read and understand something in the books, it helps us to see a different perspective and can point us towards asking question about the existing situationYou will get to learn a lot. They are a source of information, be it the content itself or the author and other detailsAs the reading increases, the natural biproduct will be increased command in the language and more confidence.Improves your analytical skills and brain capacity when you read books which involves puzzles etc. Comedy/uplifting genre keeps you in a in a happy/fun mode, even after the books are kept aside and helps improve your dayWhat are the things I can do by reading books, that helps me improve myself. After the books are kept aside, its a natural process that we run over it in our minds. If we can do it mindfully(meaning giving attention to it), that gives us time to analyze what’s been said, from our own perspectiveWhen we analyze what we have read, helps us teach a behavior/response. In future, when a certain situation arises, the things we read and analyzed, acts as a ready reckoner for our response and makes us more confident while doing soWhen the books contain question yourself pointers, taking time to do them, helps you know yourself betterWhen we follow the steps that the self help books teaches, will definitely reshape the way you think and helps in self healing, clearing our behavioral patterns, better health, better mood, calmer state of being etc.",
            "date": "Answered October 28, 2020",
            "views": "418",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Srinivasan Gopal",
                    "user_href": "/profile/Srinivasan-Gopal-11"
                }
            ]
        }
    ]
}