{
    "title": "How to publish a book in India for free - Quora",
    "tags": [
        "Books About India",
        "Self-Publishing",
        "Book Publishing",
        "Publishing",
        "Books"
    ],
    "response": [
        {
            "author_info": {
                "name": "Praveen Venkiteswara Annu",
                "href": "/profile/Praveen-Venkiteswara-Annu"
            },
            "answer_text": "I can try to provide some inputs regarding the options available for publishing, the pros and cons of each, the various marketing options available to self-published authors and some of the common mistakes that could hurt sales. So here goes. This information has been collated from many of my answers on Quora regarding self-publishing. Hope this helps. There are two ways you could publish your book: Traditional publishingSelf-publishingI do not have experience with traditional publishing. However, you could consider self-publishing, like I did. All major self-publishingplatforms also support authors from India. Here are some that you can try. Self-publish your book to Amazon's Kindle Store - free to self-publishEbooks from independent authors and publishers - free to self-publishDraft2Digital | Welcome - free to self-publishGoogle Books - free to self-publishFor print books, a print on demand service likeCreateSpace (free to self-publish) is probably the best bet, but delivery to India might be expensive compared to the US, Canada and Europe. If you are looking for an Indian company to help with publishing, Self Publishing and Print on Demand in India (free service if you can provide fully formatted content) or Book Publishers in India (paid service) could be considered. Royalties on KDP, the largest marketplace for eBooks vary from 35% to 70% depending on the pricing of the book, the country in which the purchase is made and also based on whether you enroll in KDP Select (where you have to keep your books exclusive to Amazon). Details are available at the link provided above. Royalties on other platforms vary from 30% to 60%. There are no legal issues that I am aware of, other than the fact that income from royalties will be taxable in India. Also look at the pros and cons of self-publishing vs. traditional publishing below. Self Publishing Pros Better control of the publishing process - complete creative freedom to choose what you want to include and howBetter royalties - no cut for the publisher. You decide your pricing and royalties. eBook royalties can be as high as 70%.Faster to market - you can self-publish an eBook that you have ready in a matter of minutes and make it available worldwideNo restrictions for newbie authorsCons Discoverability - your book is the proverbial needle in the haystackMarketing - you are responsible for all marketing effortsIf you are opting for a print edition, there might be an upfront cost involved - except in the case of Print-on-demand optionTraditional Publishing Pros You have the backing of a reputed publishing house - better discoverabilityMarketing is part of the book publishing deal and the publisher helps to an extentProfessional editing, formatting and cover designMade available through all major bookstores and online retailersCons Can take a significant amount of time (months) to get a book to the marketNew authors might find it difficult to get the backing of a good publisher - others might charge a one time publishing fee starting from INR 25,000.Lower royalties - 10 - 15% of selling price for print editionsMarketing options for self-published authors Give away copies to bloggers in exchange for honest reviews - Goodreads might be a good starting point.Make the book available for pre-order so that it has a chance to rake up some sales and feature higher in the rankings on the day of release.Enroll the book in KDP Select program and run a free or Kindle Countdown Deal promotion - if it is an eBookUse social media to get the word out - Facebook, Twitter, Instagram - all have a part to play.Don't be shy about asking your friends and relatives to spread the word.Include a link to your book landing page in your personal e-mail signature.Get the word out on KBoards - a community forum for Kindle Users and Authors - Index - - if it is an eBookNone of the options listed above require a marketing budget. If you do have a marketing budget, you could consider a formal book launch and reading session, Google AdSense campaign, Amazon Marketing Services and Facebook pay per click campaigns. Mistakes that can hurt sales Discoverability - A self-published book is the proverbial needle in a haystack. People have too many books to choose from. Ensure that people have a good reason to pick up your book. A good blurb would be the first step.Bad metadata - The search keywords and category are critical. They can make or break sales. Good keywords will ensure that your book features in relevant user searches and has a better chance of generating a sale.Poor quality of cover - People still judge a book by its cover despite being told not to do so. Irrespective of how good the content in your book is, a bad cover is an instant turn-off and sales killer.Bought/biased reviews - When friends or family post their reviews, it invariably tends to be biased. Readers who are familiar with Amazon can instantly spot such reviews and it is unlikely that they will consider purchasing your book.Bad pricing - Pricing your book too high or too low can also affect its sales. Price it for what it is worth.Lack of marketing - A self-published author should also don the marketing hat without sounding too pushy. Unless people know that your book is out there, they will not even be able to consider a purchase, would they?Worst of all, bad content - If the content of the book is bad, no matter what the author does, it just will not sell. It will garner too many bad reviews, way to soon and ensure the demise of sales.Apart from these some categories not see as much sales as some others, on Amazon. Non-fiction sells a lot less than fiction. Will you make a lot of money selling eBooks? If someone goes on to write a book that sells a million copies, why not pursue writing as a career?  But the question really is, how many of the hundreds, if not thousands, of authors whose books are published each year have seen such success. People only see the tip of the iceberg and they like what they see. What they fail to see is the large number of authors who might not even sell a hundred copies a year. Just like in any other field, a new author is unknown in an already crowded field - more like a needle in a haystack. Most books remain undiscovered and authors do not earn enough to make a living off writing. By no means am I trying to discourage anyone from choosing writing as a career. Just take care that you have a sustainable source of income to keep you going while your book and you yourself are discovered and find a following. Don't give up a day job yet to pursue writing.  You may find the following questions interesting. How many copies does the average book sell?If you publish one eBook on KDP (Kindle Direct Publishing) that is fiction, how many copies should you expect to sell in one year?How do I sell my $2.99 e-book to 335,000 people?My experience with self-publishing I have self-published a book and it is based on my road trip to Ladakh with two of my friends. Once I returned from the trip, I decided to write a memoir of the trip and published it as an eBook on Amazon - Himalayas: Through Heaven and Hell in the Hills Success has many definitions depending on who defines it. To me, being able to write a book that was good enough to be published was the beginning of success. Seeing that at least some people enjoyed reading the book, based on the reviews, was better. If success is measured in monetary terms, I would not call it a success. I still need a day job to pay my bills. Authors must have realistic expectations. I cannot stress this point enough. Do feel free to let me know if you have any specific questions. Good luck with your book! ",
            "date": "Answered September 5, 2016",
            "views": "136",
            "upvotes": " View 31 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Aman Sharma",
                    "user_href": "/profile/Aman-Sharma-745"
                },
                {
                    "user_id": "Rohit Beniwal",
                    "user_href": "/profile/Rohit-Beniwal-55"
                },
                {
                    "user_id": "Bhoomika Dekate",
                    "user_href": "/profile/Bhoomika-Dekate"
                },
                {
                    "user_id": "Kaushiki Jain",
                    "user_href": "/profile/Kaushiki-Jain-1"
                },
                {
                    "user_id": "Aditya Goyal",
                    "user_href": "/profile/Aditya-Goyal-57"
                },
                {
                    "user_id": "Bhoomi Sheth",
                    "user_href": "/profile/Bhoomi-Sheth-3"
                },
                {
                    "user_id": "Jayush Chauhan",
                    "user_href": "/profile/Jayush-Chauhan"
                },
                {
                    "user_id": "Vyshu",
                    "user_href": "/profile/Vyshu-10"
                },
                {
                    "user_id": "Siddharth Jeet",
                    "user_href": "/profile/Siddharth-Jeet"
                },
                {
                    "user_id": "Kavya Sivakumar",
                    "user_href": "/profile/Kavya-Sivakumar"
                }
            ]
        },
        {
            "author_info": {
                "name": "Bhargava Adepalley",
                "href": "/profile/Bhargava-Adepalley"
            },
            "answer_text": "If you have already written your book, you have a couple of publishing options. 1. You could approach any traditional publisher and submit your manuscript for a review. Big name traditional publishers like Penguin Random House, Harper Collins, Hachette etc. do not charge anything to publish your book. They cover the cost of publishing and payout a small percentage of the profits from book sales as royalty to the author (around 7.5% of the cover price of the book). However, traditional publishers get bombarded with hundreds of manuscripts and take a long time to even go through them ( if at all they do ). More often than not, they also reject first time authors due to a perceived risk of not being able to recover publishing costs. 2 Your second option would be to publish it by yourself by using platforms like KDP or Createspace. This would essentially require you to take care of every aspect of publishing ie. cover design, interior formatting, editing etc by yourself. Such platforms are mostly free to use and take a commission from each book sale and pay out a percentage of the profits in terms of royalty. ",
            "date": "Answered March 27, 2018",
            "views": "63",
            "upvotes": " View 30 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Aman Sharma",
                    "user_href": "/profile/Aman-Sharma-745"
                },
                {
                    "user_id": "Bhoomika Dekate",
                    "user_href": "/profile/Bhoomika-Dekate"
                },
                {
                    "user_id": "Nidhi Mehrotra",
                    "user_href": "/profile/Nidhi-Mehrotra-55"
                },
                {
                    "user_id": "Jasveen Singh Sandral",
                    "user_href": "/profile/Jasveen-Singh-Sandral"
                },
                {
                    "user_id": "Sathyendra Vemulapalli",
                    "user_href": "/profile/Sathyendra-Vemulapalli"
                },
                {
                    "user_id": "Jyotsna",
                    "user_href": "/profile/Jyotsna-12"
                },
                {
                    "user_id": "Sagar Joshi",
                    "user_href": "/profile/Sagar-Joshi-33"
                },
                {
                    "user_id": "Jayush Chauhan",
                    "user_href": "/profile/Jayush-Chauhan"
                },
                {
                    "user_id": "Insanely Sane",
                    "user_href": "/profile/Insanely-Sane-5"
                },
                {
                    "user_id": "Anamika",
                    "user_href": "/profile/Anamika-55"
                }
            ]
        }
    ]
}