{
    "title": "How do graphic novels support reading comprehension? - Quora",
    "tags": [
        "Reading Comprehension",
        "Graphic Novels",
        "Understanding and Comprehension",
        "Novels",
        "Comics (narrative art)"
    ],
    "response": [
        {
            "author_info": {
                "name": "Dorothy Fontaine",
                "href": "/profile/Dorothy-Fontaine"
            },
            "answer_text": "Graphic novels can be used effectively in literature instruction in a variety of ways. A teacher needs to be clear on students’ needs and what his/her goals are when assigning a text that is highly visual. When we work with young readers, they are usually reading books that have illustrations that give them context clues. This helps enhance their comprehension of new words they encounter. As readers get more sophisticated, teachers generally assign fictional texts that have fewer pictures and, later, no pictures at all. The controversy about graphic novels seems to centre on this stage of reading. Are pictures in a text an unnecessary crutch or a way to ground the text in a certain setting or mood? Do we make sure students do not have access to pictures with their texts so that they will be forced to engage only with the language for comprehension of the material? This is where a teacher’s goals are critical. Are you predominantly teaching the decoding of the language or are you focusing on other aspects of the literature at hand? I have taught university courses but I am currently teaching high school English in the United States. My class is reading The Odyssey by Homer in its entirety (in translation). For all of my students, this is probably the most formidable text they have encountered yet. Most of them do quite well, and I am proud of the amount of work they put into both decoding the text and catching its underlying meanings and themes. From time to time, though, I have students who have difficulty getting into a text like this: it is dense, intimidating, and there is a large volume of reading. For some, too, there are decoding difficulties such as dyslexia. I want my students to want to read, to feel at ease with reading, to know that they are smart enough to do this kind of reading. For any one of the above reasons, I recommend they read Gareth Hinds’ excellent graphic novel version of The Odyssey first. It is rigorously faithful to Homer’s text, which is great for me, and it is much more approachable for students. After they read the graphic novel version—which operates like a preview of the book for them—they are much more at ease with reading the full, translated text. Now the question you pose may have more to do with reading graphic novels that are solely graphic novels and not graphic versions of classic texts. Like any novels, there are graphic novels worth reading for the depth of their content and characterizations and there are those that are fluff. I would not hesitate to add a graphic novel to my curriculum if it were pertinent to what I wanted to achieve in the class that year. One must just choose wisely. ",
            "date": "Answered October 20, 2020",
            "views": "33",
            "upvotes": " View 2 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Pavel Morava",
                    "user_href": "/profile/Pavel-Morava"
                },
                {
                    "user_id": "Efrayim Bulka",
                    "user_href": "/profile/Efrayim-Bulka-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Heinz Münch",
                "href": "/profile/Heinz-Münch"
            },
            "answer_text": "I don’t think so. Reading means decoding signs or conglomerates of signs. The pictures in graphic novels interfere with this process. Graphic novels are beasts of their own kind. ",
            "date": "Answered October 19, 2020",
            "views": "14",
            "upvotes": "0"
        }
    ]
}