{
    "title": "How to become a political leader in Nepal - Quora",
    "tags": [
        "Nepali Politics",
        "Political Leaders",
        "Politics of Nepal",
        "How-to Become Question",
        "Nepal",
        "Leaders",
        "Leadership"
    ],
    "response": [
        {
            "author_info": {
                "name": "Shankar Pandey",
                "href": "/profile/Shankar-Pandey-33"
            },
            "answer_text": "Start by abusing India ; You will have all the attention , then it's up to your leadership skills .it's not easy though , every second individual especially youth in Nepal is a politician . Political discussion is the favourite pass time of people in Nepal . Be it picnic , bar , friends gettogether , politics doesn't escape people .Every discussion starts and ends with politics .Nepalese people are one of the most politically aware people in the world .Flip side is that instead of focussing on studies and building their careers youths waste prime of their lives in futile discussion on politics . Ultimately the human capital of the country gets wasted . It's not easy breaking into political scenario in Nepal, especially for a new entrant . No neeleader has emerged in the political scene in Nepal in past several decades , barring Maoist leaders like prachanda and baburam bhattarai ; and they made their name on the corpses of several thousands innocent lives who were murdered during what is called as “ jan andolan” or people's revolution. Positive outcome of the revolution is debatable , but one thing is sure that the top leaders of the movement got entrenched firmly in the political scene of Nepal . For a layman , making the cut into political sphere is difficult if not impossible . However Nepal is in need of a young dynamic leadership with a long term vision for development and well being of the people. People of Nepal have been expecting such a leadership but still that void is yet to be filled .There is always a scope for a leadership with honesty and vision to take the country out of poverty and give fresh hope to lakhs of Nepali youths . So good luck . ",
            "date": "Answered January 13, 2020",
            "views": "352",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Sandeept (Ankit) Dhakal",
                "href": "/profile/Sandeept-Ankit-Dhakal"
            },
            "answer_text": "Step 1: Before you decide to dive in, check some important characteristics. Are you: Cunning?Manipulative?Selfish?Heartless?Able to backstab your own friends, relatives, mentors and so on to go up ahead?Able not to give a damn about the negative things people say about you?If Yes, proceed further. If No, don't even think joining politics.  Step 2: Entering Do you want to begin with your own party? Don't think about it unless you assemble a lot of (I mean it—a lot of) like-minded people and convince a lot of other people into believing that you are good. It takes time. If you don't have time for that, join an already established party. Most people join bigger parties but a small one can do wonders. I will cite an example from my college. (Do I need to mention it here? It's already in my bio!) A lot of students there join the sister organization (in Nepali it's Bhratri sangathan—भ्रातृ संगठन) of Nepali Congress known as Nepal Students' Union (Nebisang—नेविसंघ). The second one is ANNFSU (All Nepal National Free Students' Union—अनेरास्ववियु— Oof, what a long name!) of the CPN—UML (Another long name!) The students who join NSU or ANNFSU have to face a lot of competition. To establish yourself is a difficult (not impossible—will come to this later) thing to do. So last year, some students entered into the ANNFSU of Maoist led by Mohan Vaidya. The party has few followers with some reputation. But most of those who joined only that year, were immediately nominated in higher posts. It might be a small party but in the college, all the presidents of all the parties are of equal footing. They got a good lift! The place you choose to get into politics makes a huge difference in how fast you can go to the top. Let's take an example of my college again (I will continue citing my college because it has taught me a lot about students politics). This is what my college leaders are seen doing: Helping a new student get admission.Helping old students solve their problems at any cost.Organizing various programmes.This is something we generally tend to forget in politics: Public Relations. I have a friend who I can call at any time to get information on what is happening on a particular day. I can trust him because he solves problems as fast as he can. I will vote for him irrespective of the party he is in. See. He's earning voters. This is what I had called difficult in the above example. He stands everyday from the gates to the Chief's Office. He shakes hands with thousands of people. He knows a lot of people. Even more know him. These people will carry him to success. A Students' Union leader can become a very influential person. Gagan Thapa is a brilliant example (though his father-in-law is also an influential politician is another matter). If you think you can become a poltician by leading people of your own locality, the chances of success are pretty lean, particularly in Kathmandu.  Step 3: Manipulation Shakuni was the king of manipulation in the Mahabharata. He was able to manipulate Dhritarashtra and his sons against the Pandavas. His cunning was the reason Pandavas had to lose their properties and wife (who they treated like a property). His desire of revenge caused the Mahabharata. That's the power of manipulation. Manipulation is the art of convincing people that the way the politician is showing is true and what others are saying is false. It is the weapon that politicians usually use to create chaos. Should I quote Littlefinger here? I could not resist: Chaos is a ladder. It chills my heart. Politicians have used chaos to climb up in politics. When everything calms down, they are seen on the top. Just look at Mr Prachanda. I don't think I need to explain.  Step 4: Backstabbing It hurts. I have personally seen such a thing happening. One of my closest relatives had been promised that she would get a \"ticket\" in the local elections. Some of her party members had already congratulated her. But on the last day before nomination, she was suddenly replaced by her own friend, who did not oppose. My relative found that there was another person who had actively involved in manipulating the list. She remained upset for months while her friend won the election. If you can backstab your family and friends, you can definitely do it to anyone. Good luck!  Step 5: Don't give a damn about the (negative) things people say If you have done something wrong and others point it out, don't correct yourself. Bash them instead. (Did you watch that Sajha Sawal episode with PM Deuba???) Dismiss every bad thing that people say to you. People might curse you for making their lives worse, but don't give a damn about them. Think that they will always complain no matter what you do.  If you have a political family, you will be easily introduced to the other party leaders who can take you to the top.  P.S.: These are the steps that most of our politicians have taken and except the part about PR, the others are NOT RECOMMENDED. To make it easy: The complete opposite of Step 1 above. No shortcutsNo negative manipulationNo backstabbingAcceptance of criticism to improve oneself.Lastly, increase your knowledge and improve your oratory skills. All the best! ",
            "date": "Answered August 7, 2017",
            "views": "3",
            "upvotes": " View 12 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Nepal Rock",
                    "user_href": "/profile/Nepal-Rock"
                },
                {
                    "user_id": "Synyster Gurung",
                    "user_href": "/profile/Synyster-Gurung"
                },
                {
                    "user_id": "A Kumar",
                    "user_href": "/profile/A-Kumar-276"
                },
                {
                    "user_id": "Rit Rai",
                    "user_href": "/profile/Rit-Rai-1"
                },
                {
                    "user_id": "Birat Bade",
                    "user_href": "/profile/Birat-Bade"
                },
                {
                    "user_id": "Aman Poddar",
                    "user_href": "/profile/Aman-Poddar-8"
                },
                {
                    "user_id": "Saurav Budhathoki",
                    "user_href": "/profile/Saurav-Budhathoki"
                },
                {
                    "user_id": "Nishan Pantha",
                    "user_href": "/profile/Nishan-Pantha"
                },
                {
                    "user_id": "Sulav Karki",
                    "user_href": "/profile/Sulav-Karki-1"
                },
                {
                    "user_id": "Andrew Jackson",
                    "user_href": "/profile/Andrew-Jackson-342"
                }
            ]
        }
    ]
}