{
    "title": "How much money can you make from e-books? - Quora",
    "tags": [
        "eBook Publishing",
        "Self-Publishing"
    ],
    "response": [
        {
            "author_info": {
                "name": "Lisa Oliver",
                "href": "/profile/Lisa-Oliver-84"
            },
            "answer_text": "I have to admit, I wasn’t going to answer this question as it’s rather vague. People write ebooks for a number of different reasons like increasing their brand, attracting new customers, or simply because they like to share information. And yes, they write them to make money too. But I am guessing from the way the question was worded, you want to know if it is easy to write an ebook, slap it up on Amazon and make lots of money. And to answer that, I would say it depends on different things: Can you write?Have you written an amazing book?Have you written an amazing series?Are they books other people are desperate to read?Do you have a ready made audience who will buy your books?Do you have all the other skills necessary in self-publishing, like cover design, editing (you must have an editor), marketing, and accounting.If you’ve answered yes to all of the above, then the only other question is, have you finished the first book? Because a lot of people think about, or have been told by silly online courses, that the best way to make money from home is to write a simple ebook, upload it to Amazon and wait for the money to come rolling in. It does not happen like that. Indie publishing is hard work. You have to do everything yourself, and even if you do put a book up, getting an audience to find your sales page is often the hardest part. I have seen some amazing new authors shattered because they did everything right, put their book up and no one saw it. All that hard work down the drain. A new author friend of mine put her book up just last week - promoted it extensively over numerous social media groups, and probably made a few sales. But she got hammered in the reviews because her editing was atrocious and even though I know she has two other books in the wings waiting to be published, I am not sure she will even bother putting them out. I love what I do, but I’ve been doing this for almost six years. I put my first books out when the competition wasn’t nearly as fierce and I was lucky I made sales because I didn’t have a clue about marketing. I was also lucky, that the people who bought my books are loyal readers who have stuck with me for as long as I have been writing and over time, my audience has grown. I have learned so much from this journey, and now when I put an ebook out, I make money. But there is no way any of this was easy. Good luck and thank you for your A2A. ",
            "date": "Answered November 9, 2019",
            "views": "412",
            "upvotes": " Answer requested by Arien Dunbar",
            "upvoters": [
                {
                    "user_id": "Azmir",
                    "user_href": "/profile/Azmir-1"
                },
                {
                    "user_id": "Omar Francisco",
                    "user_href": "/profile/Omar-Francisco-2"
                }
            ]
        },
        {
            "author_info": {
                "name": "Abdul Rehman",
                "href": "/profile/Abdul-Rehman-3359"
            },
            "answer_text": "5 Ways to Make Money Selling Free eBooks Lead Generation When you give away your book for free, you’re turning random people into prospects who know you, like you, and trust you. You can then convert those readers into lifelong fans, email subscribers, and paying customers. Most businesses are willing to pay a fortune to generate leads, but you can do it for free by simply giving away your book! Sell Products or Services If someone has invested the time to read your entire book, they’ll likely want to learn even more from you. The back of your book is the perfect place to let readers know about any other books, products, or services you sell. Many nonfiction authors earn more money from selling products and services to readers than they do from royalties. Get Tons of Book Reviews With a free book, you can get more readers faster. That can lead to you getting lots of book reviews. That’s why many authors make their books free for a limited time. After they get some great exposure and book reviews, they change the price of the book and benefit from all the great word-of-mouth and social proof. Get Amazon to Promote Your Book Amazon promotes popular books to readers, so if your free book is getting downloaded and read more than the average book in your market, you’ll get tons of extra promotion and downloads from Amazon at no extra cost. Quick and Easy Search Engine Rankings Getting your website to rank #1 in Google for a competitive keyword is tough, but it’s ridiculously easy for Amazon to get ranked #1 in Google. You can get your book’s page on Amazon ranked very highly in Google, even for really competitive search terms, if you have a book that readers love ",
            "date": "Answered November 9, 2019",
            "views": "432",
            "upvotes": " View 2 Upvoters"
        }
    ]
}