{
    "title": "How much better are sweet potatoes than potatoes? - Quora",
    "tags": [
        "Yams & Sweet Potatoes",
        "Potatoes",
        "Nutrition"
    ],
    "response": [
        {
            "author_info": {
                "name": "Deb Deagle",
                "href": "/profile/Deb-Deagle"
            },
            "answer_text": "     Oh my goodness-yes! Here's a matchup done by the Cleveland Clinic White Potatoes vs. Sweet Potatoes: Which Are Healthier? There is something much more important than comparing the number of carbs and calories. What is more important, are the 7 Health Benefits of Sweet Potatoes benefits, like the fact that sweet potatoes are a powerhouse filled with antioxidants. The huge number of benefits, like helping with inflammation, weight loss, etc. far exceed the benefits of a regular spud. A sweet potato cooks up quickly and you can do it without boiling it and pouring nutrients down the sink. Just lightly pierce the paperlike skin of the sweet potato by drawing the tip of a knife, or even the tines of a fork along the length of it. Place it on a microwave safe dish and depending on the wattage of your micro, and the size of the sweet potato, it is going to take about 4 minutes on high. If you can squish it so that it's no longer hard, then it's done (use caution, so you don't burn your fingers. I use a bakers glove.) I have had some very large sweet potatoes, that took 6 minutes. Take it out, slice the top open, and push the two ends toward each other. I drizzle a 1/2 tsp of honey…just a drizzle on it. Then I mash it. It is sweet anyway, so it tastes fine without any butter. But I really do enjoy them with a taste of honey. My favorite way, when I have more time, is to peel the sweet potato, then slice it 1/4 to 1/2 inch thick. I toss those round slices in a little olive oil then lay them out on parchment paper and bake them on a cookie sheet in a preheated 350 degree oven for about 25 minutes. I turn them after 15 minutes. Sometimes they take little longer, but they get a slight golden look around the edges. They are great served hot, but they are a fabulous snack later on, at room temp. I have cut them thin and baked them until they get a little crispy, for my version of potato chips. Sweet potatoes are delicious and contain antioxidants galore! ",
            "date": "Answered April 26, 2019",
            "views": "18",
            "upvotes": " View 4 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Ellen Pemberton",
                    "user_href": "/profile/Ellen-Pemberton"
                },
                {
                    "user_id": "Catherine MacLeod",
                    "user_href": "/profile/Catherine-MacLeod-9"
                },
                {
                    "user_id": "Ipsita Sahoo",
                    "user_href": "/profile/Ipsita-Sahoo-37"
                },
                {
                    "user_id": "Brian Valerie",
                    "user_href": "/profile/Brian-Valerie"
                }
            ]
        },
        {
            "author_info": {
                "name": "Steadfast Nutrition",
                "href": "/profile/Steadfast-Nutrition"
            },
            "answer_text": "Sweet Potatoes are regarded as better than normal potatoes due to the additional benefits, they exert on our body. Sweet potatoes are packed with nutrients like dietary fibre, vitamin A, C, B5, B6, manganese, potassium, copper and niacin.Loaded with antioxidants which prevents free radical damage and oxidative stress.Sweet potatoes contain dietary fibre and antioxidants that promote the growth of good gut bacteria and contribute to a healthy gut.Antioxidants present in sweet potatoes also possess anti-cancer properties and good for brain health.Sweet potatoes are incredibly rich in beta-carotene, the antioxidant responsible for the vegetable’s bright orange colour. This contributes in keeping our vision heathy.Helps boost immune health.Can be easily included as a healthy and yummy snack in the diet, especially by people aiming to lose weight and active people.",
            "date": "Answered November 10, 2019",
            "views": "134",
            "upvotes": "0"
        }
    ]
}