{
    "title": "How to legally make audio books - Quora",
    "tags": [
        "Audiobooks",
        "Book Recommendations"
    ],
    "response": [
        {
            "author_info": {
                "name": "Gutenberg Reloaded",
                "href": "/profile/Gutenberg-Reloaded"
            },
            "answer_text": "First off, most people use the Audiobook Creation Exchange (ACX), as they will post your book to both Audible and iTunes, and it will be available on Amazon as well.  All of this below assumes that you're doing everything yourself except the audio engineering. The easy way is to hire a company to record the book as its not overly expensive and then you get everything done right the first time. But, if you're doing it yourself,  Here’s the short & sweet summary of how you make an audiobook: Step 1: Obtain the RIGHT equipment--a quality microphone, pop screen, and choose a computer program (GarageBand vs Audacity, usually) on which to record Step 2: Set up your equipment in a space that is suitable for recording (read: QUIET) and make sure all your equipment functions correctly Step 3: Record your audio Step 4: Send your audio to an audio engineer for editing Step 5: Modify your cover for ACX standards (they need a square cover instead of the normal rectangle cover you see on Amazon) Step 6: Create your ACX account & enter your bank account and tax information for royalty payments ***If you don’t have an account set up with ACX yet, you’ll need to do so, and I have a handy video that explains the process step-by-step located here on Vimeo.  Step 7: Upload your book description, choose a category for your audiobook, upload your audio and cover, and submit to ACX for their review Step 8: Once approved, market the heck out of your audiobook!  Now, this is a pretty simple overview, but I actually wrote an entire book on the subject of recording audio and currently its only 99 cents on Amazon; its filled with more advice and the details you need to record great audio: Recording Audiobooks: How Record Your Audiobook Narration For Audible, iTunes, & More! Sell More Books and Build Your Brand - Kindle edition by George Smolinski. Reference Kindle eBooks @ Amazon.com.  ",
            "date": "Updated January 30, 2016",
            "views": "84",
            "upvotes": " View 7 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Diana Pavao",
                    "user_href": "/profile/Diana-Pavao-1"
                },
                {
                    "user_id": "Beth Fitzpatrick",
                    "user_href": "/profile/Beth-Fitzpatrick-20"
                },
                {
                    "user_id": "Samuel Owen",
                    "user_href": "/profile/Samuel-Owen-27"
                },
                {
                    "user_id": "Mohammadmahdi Sajedi",
                    "user_href": "/profile/Mohammadmahdi-Sajedi"
                },
                {
                    "user_id": "J. Norton",
                    "user_href": "/profile/J-Norton-13"
                },
                {
                    "user_id": "Dimlak Gorkehgz",
                    "user_href": "/profile/Dimlak-Gorkehgz"
                },
                {
                    "user_id": "Tracy Cordova",
                    "user_href": "/profile/Tracy-Cordova"
                }
            ]
        },
        {
            "author_info": {
                "name": "Michael Bird",
                "href": "/profile/Michael-Bird-54"
            },
            "answer_text": "Assuming that your contract with your publisher doesn’t specifically list other plans for making audiobooks, or specifically prohibits it, then just get yourself a good microphone and read your book into the microphone while recording it. Perfectly legal. If you are asking about making audiobooks with books that someone else wrote, then you can still do the same thing, as long as you will be the ONLY person who ever hears those recordings. If you plan to make the recordings available to other people - whether free or for sale - you must get written approval from the copyright owner(s) of the book, usually the publisher and/or the author. This will usually include payment of a licensing fee in order to use the copyrighted materials. ",
            "date": "Answered April 5, 2020",
            "views": "24",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Martin Reyto",
                "href": "/profile/Martin-Reyto"
            },
            "answer_text": "Making audiobooks is never illegal. The legality factor enters when you make them available to the public (i.e., publish them), whether you sell them or give them away for free. I'm not a lawyer or an expert in copyright law, but to the best of my knowledge: You can legally publish audiobooks that don't violate the author's copyright as it applies under the legislation of the country in which you distribute them. This legislation is fairly complex and varies from one country to the next; it's your responsibility as publisher to make sure you comply. The most straightforward way to go about this is to get the copyright holder's written permission. The copyright holder may be the author or the author's heirs and trustees. Beyond that, you're constrained to publishing only works which are in the public domain, again per the definition of the term that applies in your jurisdiction. ",
            "date": "Updated March 30, 2020",
            "views": "57",
            "upvotes": " View 8 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Sagar Godase",
                    "user_href": "/profile/Sagar-Godase-6"
                },
                {
                    "user_id": "Shane Clitheroe",
                    "user_href": "/profile/Shane-Clitheroe-1"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/Jhun-Tran"
                },
                {
                    "user_id": "Russell Fong",
                    "user_href": "/profile/Russell-Fong"
                },
                {
                    "user_id": "Mohammadmahdi Sajedi",
                    "user_href": "/profile/Mohammadmahdi-Sajedi"
                },
                {
                    "user_id": "Melissa Premuto",
                    "user_href": "/profile/Melissa-Premuto"
                },
                {
                    "user_id": "Becky Phillips",
                    "user_href": "/profile/Becky-Phillips-117"
                },
                {
                    "user_id": "Tracy Cordova",
                    "user_href": "/profile/Tracy-Cordova"
                }
            ]
        },
        {
            "author_info": {
                "name": "Vincent Berg",
                "href": "/profile/Vincent-Berg-8"
            },
            "answer_text": "That’s easy. Buy a microphone. Read your entire book, word for word, with a rich, lyrical voice that captures the emotion of every line perfectly. (If that fails, then prepare to pay quite a bit to hire a professional to read it for you, realizing that audio books typically cost and earn less, which costing much more to produce, so there’s really NO reason to produce one UNLESS you can do it yourself with existing equipment.) ",
            "date": "Answered April 5, 2020",
            "views": "15",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Arber Reka",
                    "user_href": "/profile/Arber-Reka-3"
                }
            ]
        }
    ]
}