{
    "title": "How many Revelation end of times prophecies from the Bible have already came true? - Quora",
    "tags": [
        "Book of Revelation",
        "Prophecies",
        "The Bible",
        "Christianity"
    ],
    "response": [
        {
            "author_info": {
                "name": "Raymond Griffith",
                "href": "/profile/Raymond-Griffith"
            },
            "answer_text": "How many Revelation end of times prophecies from the Bible have already came true? None. And you know all those prophesy books you find in Goodwill and used book stores and second hand shops? Full of interpretations that didn’t come true. The authors revised the books so they could continue to sell their BS to people who enjoy ingesting that stuff. In over 45 years of following this stuff, they haven’t been right once. So why do people still believe in it? Why do people still pay money for it? Why do ”the faithful” still want the end of the world to come for people who have seen how insipid and worthless the claims of the prophesy fanatics have been? Because these loving people absolutely hate everything and everyone and want Jesus to come back so they will get rewards while everyone else burns. It’s what they believe in and are invested in. ",
            "date": "Answered March 28, 2020",
            "views": "77",
            "upvotes": " View 6 Upvoters",
            "upvoters": [
                {
                    "user_id": "Ian Rowland",
                    "user_href": "/profile/Ian-Rowland-13"
                },
                {
                    "user_id": "David Ciambrone",
                    "user_href": "/profile/David-Ciambrone"
                },
                {
                    "user_id": "Robert W. Rider",
                    "user_href": "/profile/Robert-W-Rider"
                },
                {
                    "user_id": "Geoff Read",
                    "user_href": "/profile/Geoff-Read-9"
                },
                {
                    "user_id": "Mike Seeley",
                    "user_href": "/profile/Mike-Seeley-2"
                },
                {
                    "user_id": "Wolfgang Potratz",
                    "user_href": "/profile/Wolfagng-W-E-Potratz"
                }
            ]
        },
        {
            "author_info": {
                "name": "Brett Quinton Bowden",
                "href": "/profile/Brett-Quinton-Bowden"
            },
            "answer_text": "None yet. If you read Revelation from chapter 1, it is talking to the church. This carries on until chapter 3. From chapter 4 onwards the church is never mentioned again. All the things that take place after this is without the church. The church is missing. That is because the rapture took them. The things that happen from chapter 4 onwards happens to the people left behind after the rapture. As long as the church is still here you're safe. 1 Thessalonians 1:10 and to wait for His Son from heaven, whom He raised from the dead, even Jesus who delivers us from the wrath to come. 1 Thessalonians 5:9 For God did not appoint us to wrath, but to obtain salvation through our Lord Jesus Christ, These and a few more verses show that, like Noah who did not personally feel the wrath of God on the world, we will not be punished along with the rest of the rebellious world who reject Jesus. So for now, don't worry. This is not yet the time. But do you want to stay behind for it? I would not, thank you very much. It has been said ‘Life is the sum of our choices'. Make a good choice today. Bless you. ",
            "date": "Answered March 28, 2020",
            "views": "85",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "M.K. Borri",
                    "user_href": "/profile/M-K-Borri"
                },
                {
                    "user_id": "Michele Shipley Klika",
                    "user_href": "/profile/Michele-Shipley-Klika"
                },
                {
                    "user_id": "Gary Steel",
                    "user_href": "/profile/Gary-Steel-12"
                },
                {
                    "user_id": "John Ganio",
                    "user_href": "/profile/John-Ganio"
                }
            ]
        }
    ]
}