{
    "title": "How does The Vatican decide what books to include in the Bible? - Quora",
    "tags": [
        "Books About Religion",
        "Book of Revelation",
        "Vatican City",
        "Bible Study",
        "Catholicism",
        "The Bible",
        "Christianity",
        "Book Recommendations",
        "Books"
    ],
    "response": [
        {
            "author_info": {
                "name": "Wyatt Roetcisoender",
                "href": "/profile/Wyatt-Roetcisoender"
            },
            "answer_text": "It was called CANON (this is where current people get the word). It means that it adds up and does not disagree with previous books or resources. During the persecution from Rome the Church knew it had to be careful which books to keep because they knew that not all of them were true and some could be allowed to burn while others HAD to be protected at all costs. In response, they created CANON. Some of rhe rules (and I can’t remember them all) were the following: the book being disputed had to be distributed throughout the Church and not just one part/section. It was over a century since Christ and the Apostles walked the earth, and by that time thousands of copies of the Gospels and Epistles were spread to guide the Church. However, around this time new books were being written that disagreed with the Character of Christ or added stories never heard of before. If it was true why was it not passed around over a century earlier instead of relatively recently?The authority had to be accurate. Eventually one of the canon rules was that a writer of a book of the New Testament had to be an Apostle (John, Paul, etc) or a close associate of an Apostle (like Mark, Luke, etc). This gave them authority because it gaurentees that they were there and not an imposter. Many had risen recently claiming to find a book written by the Apostles and wanted it to be spread/added to the Bible. These texts did not hold up to Canon and were discarded when they didn’t add up with the others (again, if they were true they would have been spread around before). Also, ‘the gospel of Pepter’ has ‘Peter’ refer to Jesus as ‘the Lord’. Peter was His friend, he never ever referred to Jesus as ‘the Lord’, he referred to Jesus as Jesus, his friend.It had to agree with the Character of Christ. Christ is regarded as joyful and loving throughout the gospels and epistles but some of the new books showed Christ as more of a conqueror than a loving teacher.I can’t remember the other rules (there’s one for each letter of Canon so I’m missing two) but these three are extremely important too and I hope they helped answer this question:)",
            "date": "Answered January 22, 2019",
            "views": "95",
            "upvotes": " Answer requested by Anthony Graham Clark"
        },
        {
            "author_info": {
                "name": "Eugene Mormon",
                "href": "/profile/Eugene-Mormon"
            },
            "answer_text": "The vatican did not decide this, they had church councils before this that hashed out which books to include in what we now call the “canon” of scripture or what books are in the “bible”. The “vatican” at the time was still a place to go to get your fortune told. They actually had a fairly good criteria for inclusion, and as much as I’m not of a high opinion of church councils at all, at least they tried to narrow down the list of many many books, letters, and writings down to a reasonable number. If they included every single book that was claimed to be inspired by God, the bible would be a million pages long. People don’t even read what we do have, and some people are just looking for a loophole. The books we have say things they don’t want them to say, so they look for other, “hidden” and “secret” and “forbidden” books that “someone” in a church somewhere took out, when they weren’t in the bible to begin with. Many writings were rejected because they just sounded like BS. For example, some people want very badly for the Bible to say that adultery or stealing or whatever is justified in some way, and even in the bible we have now, some people manage to rationalize this. So they say something like, well, the book of first Zorkadelia, chapter 10, verse 2, it says we can do this, but some evil priests TOOK IT OUT of the Bible! It was in the bible, but they hid it. But I know it was there, and say it’s ok to steal or commit adultery. Sure. The way I see it, what we DO have is enough for our spiritual growth and development, if we read and practice it. We don’t need any “hidden” or “secret” books. Now, don’t get me wrong, I think there are many other inspirational books, and maybe some of them should have been included in the Bible. But as I said, most people don’t even read what we have. ",
            "date": "Answered January 4, 2019",
            "views": "127",
            "upvotes": " Answer requested by Anthony Graham Clark"
        }
    ]
}