{
    "title": "How to open my MacBook Air - Quora",
    "tags": [
        "MacBook Air"
    ],
    "response": [
        {
            "author_info": {
                "name": "Elijah Rodriguez",
                "href": "/profile/Elijah-Rodriguez-8"
            },
            "answer_text": "Assuming this question does not refer to opening the lid of the Macbook Air. However, I am assuming you mean how do you open the laptop to see all of the beautiful components. I'll reference this iFixIt guide below. Make sure to select the correct model. You may find your model by going to the Apple logo in the top bar and selecting “About this Mac”. iFixIt link: MacBook Air Repair How do I find my Mac model?: How to identify your Mac's model, version, year and serial number with ease (btw, you don't need anything involving system report, unless if you have a first generation, I believe.) However, be cautious. Opening the laptop or any Apple product will void the warranty. So if something goes wrong, you may be out of luck. ",
            "date": "Answered January 5, 2017",
            "views": "48",
            "upvotes": " View 6 Upvoters",
            "upvoters": [
                {
                    "user_id": "Eythan Zerad",
                    "user_href": "/profile/Eythan-Zerad"
                },
                {
                    "user_id": "Franck Horlaville",
                    "user_href": "/profile/Franck-Horlaville"
                },
                {
                    "user_id": "Patrick Ira DonEgan",
                    "user_href": "/profile/Patrick-Ira-DonEgan"
                },
                {
                    "user_id": "David Huang",
                    "user_href": "/profile/David-Huang-8"
                },
                {
                    "user_id": "Scott Ivener",
                    "user_href": "/profile/Scott-Ivener"
                },
                {
                    "user_id": "Cyril Thomas",
                    "user_href": "/profile/Cyril-Thomas-17"
                }
            ]
        },
        {
            "author_info": {
                "name": "Chuck Rogers",
                "href": "/profile/Chuck-Rogers-1"
            },
            "answer_text": "The question is ambiguous. How do you open the lid? Position in front of you so the Apple logo is upside down. Lift between the two parts of the case directly in front of you. How do you turn it on? Press the power button in the upper right corner of the keyboard area. If it doesn’t turn on, charge it. If it still doesn’t turn on take it to an Apple Store or Authorized Apple Service Center. ",
            "date": "Answered January 5, 2017",
            "views": "31",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Patrick Ira DonEgan",
                    "user_href": "/profile/Patrick-Ira-DonEgan"
                }
            ]
        }
    ]
}