{
    "title": "How to open a bookstore coffee shop - Quora",
    "tags": [
        "Bookstore Coffee Shop",
        "Cafés and Coffee Shops"
    ],
    "response": [
        {
            "author_info": {
                "name": "Chris Maynard",
                "href": "/profile/Chris-Maynard-17"
            },
            "answer_text": "You don’t, you sit down and ask yourself what movie or sitcom you watched that made you think of doing that and then crunch the numbers on that hypothetical bookstore coffee shop. You’ll see quite quickly that it’s usually a non starter If you insist I’d suggest finding some place with reasonable rent…put an ad in the paper looking for free books. I’m sure we can find you some coffee makers and maybe your friends can bake some snacks. That seems to be what most of the vogue quaint coffee shops are now. Make sure you find some old stop signs and weird weathered fence posts and stuff to hang on the walls. Definitely need some chalk boards so you can draw bright colorful pictures describing your various specials. Toughest part will be getting your first shipment of over priced coffee (make sure it’s fair trade or the hippies and pretentious people won’t drink it, and they’ll be 99% of your customer base). You’ll have to have at least 5 different kinds. Make sure one is recognizable and the rest HAVE to be strange. No one is going to buy your books but they’ll expect to read them. Make sure you have a million tables because you’re going to be swamped with all the people that watched that show you watched but didn’t actually open a bookstore coffee shop. They’re going to bring their laptops and wireless over the ear headphones and take up an entire table for about 4 hours every morning/afternoon. They’ll only buy a cup of coffee and then just water. Make sure your wi-fi doesn’t suck, they’re always bitching about that in the movies/tv coffee shops. Make sure you have a bunch of couches and stuff. Make sure you hire one spacey but cute girl who dresses like Harley Quinn and Martha Stewart had a love child. She’s the one that keeps the awkward guys with the long hair, trench coats and gloves with the fingers cut off them coming in every day for the most expensive cool coffee you sell. This is the only dependable income you’ll have but it will be steady and hopefully enough to keep the lights on. Oh yeah…make sure you have honey and stevia as options for sweeteners. ",
            "date": "Answered May 24, 2017",
            "views": "249",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Pete Laberge",
                    "user_href": "/profile/Pete-Laberge"
                }
            ]
        }
    ]
}