{
    "title": "How good is the novel, The Great Gatsby? - Quora",
    "tags": [
        "The Great Gatsby (1925 book)",
        "Literary Analysis and Criticism",
        "Novels",
        "Literature"
    ],
    "response": [
        {
            "author_info": {
                "name": "Angel Santiago",
                "href": "/profile/Angel-Santiago-8"
            },
            "answer_text": "The Great Gatsby is everything that is beautiful and broken about the American Dream.  As a novel, it is a brilliantly written piece of work that has entertained readers for almost a century. As a commentary on The American Dream, it stands as one of the most human pieces of literature on the subject. A young man, stuck in the prison of poor, is given a taste of freedom through wealthy yachtsman Dan Cody. Cody, acting as Gatz’s Daedalus, helps Gatz form his wings to escape the prison he has wished to leave for so long. The wings are named Gatsby, and as our Gatsby escapes, he witnesses his symbolic sun; the physical manifestation of wealth and freedom from his impoverished prison: Daisy. Wanting to forever get closer and closer to the very thing that will melt his wings, he flies higher and higher. Gatsby’s struggle is similar to the struggles that we as American’s have faced since the days of the Industrial Revolution. The eternal schism between the Haves and the Have-Nots, and the battle we face crossing from one side of that schism to the other. The Great Gatsby isn’t just a good novel, it is a great one. ",
            "date": "Answered May 26, 2017",
            "views": "29",
            "upvotes": " View 20 Upvoters",
            "upvoters": [
                {
                    "user_id": "Darshana Ambulkar",
                    "user_href": "/profile/Darshana-Ambulkar"
                },
                {
                    "user_id": "Urja Patel",
                    "user_href": "/profile/Urja-Patel-17"
                },
                {
                    "user_id": "Dhivya Lakshmi",
                    "user_href": "/profile/Dhivya-Lakshmi-32"
                },
                {
                    "user_id": "Zeljko Malnar",
                    "user_href": "/profile/Zeljko-Malnar-1"
                },
                {
                    "user_id": "Jennifer Marfatia",
                    "user_href": "/profile/Jennifer-Marfatia"
                },
                {
                    "user_id": "Michael Willhoite",
                    "user_href": "/profile/Michael-Willhoite-1"
                },
                {
                    "user_id": "Nehal Sanghvi",
                    "user_href": "/profile/Nehal-Sanghvi-1"
                },
                {
                    "user_id": "Sahithya Shree",
                    "user_href": "/profile/Sahithya-Shree"
                },
                {
                    "user_id": "Tenzin Singhay Bhotia",
                    "user_href": "/profile/Tenzin-Singhay-Bhotia"
                },
                {
                    "user_id": "Zafar Mahmood",
                    "user_href": "/profile/Zafar-Mahmood-7"
                }
            ]
        },
        {
            "author_info": {
                "name": "Parul Wadhwa",
                "href": "/profile/Parul-Wadhwa-8"
            },
            "answer_text": "Good? It's a wonderful and exemplary piece of literature that is worthy of reference in contemporary novels Quoting the recent reference of a literary debate in “The Masquerade” “Fiction is a figment of our imagination & it causes us to dream but Reality taints dreams, and the F.scott Fitzgerald has clearly depicted this in The Great Gatsby.” It makes you question the very idea of love. Someone who spends half his lifetime to collect fortune and build a dream life for the sake of his love. To prove her of his worthiness. It might just appear as swooningly romantic idea but the extravaganza doesn't appeals much to destiny who has a different plan. It's all glorified, richly decorated and over rated portrayal of life but that's where reality comes in. Soon his sprawling bungalow and richness is overtaken by the brutal harshness of life. Leaving us in an awe wondering the transitory life cycle and it showcases a perfect blend of beauty in the tragic world. You are bound to enjoy the ephemerality. Happy reading! -Parul Wadhwa ",
            "date": "Updated June 3, 2017",
            "views": "18",
            "upvotes": " View 6 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Naveen Bhardwaj",
                    "user_href": "/profile/Naveen-Bhardwaj-144"
                },
                {
                    "user_id": "Siddhardha Sathanapally",
                    "user_href": "/profile/Siddhardha-Sathanapally"
                },
                {
                    "user_id": "Tenzin Singhay Bhotia",
                    "user_href": "/profile/Tenzin-Singhay-Bhotia"
                },
                {
                    "user_id": "Vani Prabha Vasudeva",
                    "user_href": "/profile/Vani-Prabha-Vasudeva"
                },
                {
                    "user_id": "Karim Avram",
                    "user_href": "/profile/Karim-Avram"
                },
                {
                    "user_id": "Utkarsh Pandey",
                    "user_href": "/profile/Utkarsh-Pandey-163"
                }
            ]
        }
    ]
}