{
    "title": "How to write an essay about a book - Quora",
    "tags": [
        "Essay Writing Help",
        "Essays",
        "Writing Advice"
    ],
    "response": [
        {
            "author_info": {
                "name": "Roberta Cobber",
                "href": "/profile/Roberta-Cobber"
            },
            "answer_text": "Here are the basic steps: 1. Select a book - This may already be done for you, if you are currently enrolled in either an English or literature class. 2. Determine the goal for the length - Keep in mind that an essay on a book would already have a predisposed assigned number of words. Let’s set the word count (for the sake of illustration) at 500 words. A 500-word essay is pretty comprehensive and would allow you enough words to describe the plot of the story while having time to disseminate what themes are present and what morals are being conveyed. 3. Decide on a format and style - You will probably be told to use either MLA (Modern Language Association) or APA (Amercian Psychological Association) standard writing style. So, if you were assigned a 500-word essay, using MLA format, then you would need to use a Times New Roman, 12-point font, with a one-inch (all around) page margin and double space throughout the essay. 4. Read the assigned book. Let’s say (once again for the sake of illustration) that you were assigned to read a book entitled \"The Count of Monte Cristo.\" You would need to be familiar with the themes that are within the story behind \"The Count of Monte Cristo.\" Sample Help Writing an Essay on a Book So you have your book, the formatting is complete and you know the word count for the essay. Half the battle is won regarding writing this essay. Basically, you would begin your essay introducing the book. For example, you might begin your essay like so: \"The Count of Monte Cristo\" is a action-adventure book written by the popular French author, Alexandre Dumas. So your first sentence is pretty straightforward and tells what book you read and who the author is. The second, third, and fourth sentences give a bit of background on the storyline and then the fifth sentence concludes the first paragraph yet provides a smooth transition into the second paragraph. The last sentence may go something like this, While the plight of revenge of Edmond Dantes was engaging, the idea of forgiveness was completely remiss throughout the text. You may consider opening the second paragraph with a quote from the book or something that really stood out thematically to you as a reader. Here is another example of a leading sentence that you would start out your second paragraph with. \"Life is a storm, my young friend. You will bask in the sunlight one moment, be shattered on the rocks the next. What makes you a man is what you do when that storm comes.\" Possibly one of the most memorable quotes in the entire book, this quote gives a solid basis to move forward to the next thought. Spend the next sentences exploring the quote that set the tone for the second paragraph. Then, spend the next few paragraphs engaging your reader with your view on the book and what you have learned. The good thing about writing an essay on the book is that you can present both sides of any argument that may pervade the storyline of the book. The sky is literally the limit on what information you can present. ",
            "date": "Answered October 16, 2017",
            "views": "431",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Peter Namen",
                    "user_href": "/profile/Peter-Namen"
                }
            ]
        },
        {
            "author_info": {
                "name": "Scribendi Inc.",
                "href": "/profile/Scribendi-Inc"
            },
            "answer_text": "Writing an essay about a book requires you to do an analysis of the novel. It makes it easier if you take notes about key quotes and events. Some things to look for while you are reading include the following: - Themes: These are the basis of many pieces of literature. Some examples include the corrupting force of power, the triumph of love over hate, and the decline of the American dream. - Symbolism: Often, an author will use a symbol to represent an abstract idea or concept. Don't simply list these symbols, but attempt to draw significance from them in relation to the plot, characters, and themes. - Character development: Dive into a character and analyze his or her actions and speech, as well as how these contribute to the overall plot. When it comes to writing an essay, you should follow the standard essay writing format and rules. Once you develop your thesis, you can expand on the notes you made to create your supporting paragraphs. It is helpful to quote and reference specific incidents from the book to support your argument. Remember to edit your essay thoroughly, and use the required style guide format. ",
            "date": "Answered October 12, 2017",
            "views": "119",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Jose Clark",
                "href": "/profile/Jose-Clark-4"
            },
            "answer_text": "Essay on a book will be very simple because there will be a lot of information to write on. You will have to read the book thoroughly in order to get all the details and then you should select the most important things from it. You can write a detailed summer in a three paragraph paper, it should be more like general review of the book. You can add a few lines about how you felt personally after reading the book but usually there is no space for self reflection in a three page paper. ",
            "date": "Answered October 10, 2017",
            "views": "43",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Jessy West",
                "href": "/profile/Jessy-West-1"
            },
            "answer_text": "Writing an Essay on a Book. If you need help writing an essay on a book, you have come to the right place. Known also as literary essays, this type of essay can be equated more or less to a modern day book report. Once you get your thoughts organized it can be a really easy task.Every book has a theme and often they contain more than one. In order to successfully identify and write about a book's central theme, you need to closely read ... ",
            "date": "Answered November 14, 2017",
            "views": "151",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Patrick Leo Garcia",
                    "user_href": "/profile/Patrick-Leo-Garcia"
                },
                {
                    "user_id": "Terry Alice Carter",
                    "user_href": "/profile/Terry-Alice-Carter"
                },
                {
                    "user_id": "Zachary Joe Wright",
                    "user_href": "/profile/Zachary-Joe-Wright"
                }
            ]
        },
        {
            "author_info": {
                "name": "Ketty Johnson",
                "href": "/profile/Ketty-Johnson"
            },
            "answer_text": "The most important thing is to choose a right book. The book should raise some contoversial issues. It will be easier for you to discuss them in your essay. Remember that essay differs from a book review. Choose the right structure. You can find it on the Internet. There are loads of academic tutorials. ",
            "date": "Answered June 20, 2020",
            "views": "30",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Sabir Shah",
                "href": "/profile/Sabir-Shah-7"
            },
            "answer_text": "You can do that by using my services. ",
            "date": "Answered October 14, 2017",
            "views": "20",
            "upvotes": "0"
        }
    ]
}