{
    "title": "How to increase my reading speed from 200 wpm to 350 or 400 wpm - Quora",
    "tags": [
        "Speed",
        "Neuroscience"
    ],
    "response": [
        {
            "author_info": {
                "name": "Gerard Madorell",
                "href": "/profile/Gerard-Madorell"
            },
            "answer_text": "The Speed Reading Cornerstone The main piece of knowledge you need to read fast is to know what can be read fast and what not. Most people seem to forget that. You cannot expect to read a technical paper on a subject you don't know anything about at the same speed you would read a newspaper and expect to understand it.  As a rule of thumb, you can read much faster things you already had knowledge about beforehand.  Eliminate Reading The fastest way you can improve your reading speed is by skipping whole sections of text (∞ wpm!). This will only prove useful in non-fiction books  you read for knowledge and not for pleasure, though. After you have already understood the main ideas of a chapter, you can easily skip it without losing any knowledge. This has proven very useful to me in some books that have a lot of repetition. Analyse Whether a Book is Worth It Another way of elimination is skipping whole books that are not worth it. Sometimes it happens that you read a book just to find out that you didn't really get any new knowledge from it. Maybe because you already read a lot of books about the same things, maybe because it was just a bad book... What you can do is some research beforehand and decide whether to read it based on data (reviews, your opinion based on the table of contents, ...). (If you want to know more about this, I posted a more in-depth guide in my blog: How to Choose What Not to Read)  Improve Your Technique  Use a tracker: You can achieve faster speeds immediately just by using a pen or your finger. Simply underline what you are reading with the tracker and use it to pace yourself. This way you can effectively read at the pace you move the tracker.Don't make your eyes fixate on the beginning and the end of sentences: You can use peripheral vision to read the first/last words of sentences. Simply fixate your eyes on the second word instead of the first one, and finish your eye movement in the penultimate word instead of the last one.Practise If you really want to read faster you have to practise. Choose an easy book, preferably a short one you've already read before, and try to read it at about 500-600 WPM.  Focus on improving your reading speed, not on understanding the book. It's much harder to learn speed reading if you are multitasking. After practising it, you can use it on \"real\" books. Go ahead and try! ",
            "date": "Answered January 25, 2015",
            "views": "19",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Billy Borgo",
                "href": "/profile/Billy-Borgo"
            },
            "answer_text": "The trick to speed reading is the banishment of the voice in the head. It can easily be accomplished for most people within several hours. I did it in less than thirty minutes and began reading about 2-4 times faster without much additional effort. Howewer, I derive most of the enjoyment from literature by listening to someone read to me. Speed reading took most of that enjoyment, so I rarely partake in unless I have a good reason to do so. ",
            "date": "Answered January 25, 2015",
            "views": "933",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Apoorva Nadig",
                "href": "/profile/Apoorva-Nadig"
            },
            "answer_text": "Practice reading dictionary daily,one page. Also keep yourself and your mind alone while reading,so as to let it not interfere your concentration. Read the first thing in the morning;if not possible in the morning then read in the evening. Time of day matters when reading important stuff. ",
            "date": "Answered July 20, 2020",
            "views": "44",
            "upvotes": "0"
        }
    ]
}