{
    "title": "How to write a book in a month - Quora",
    "tags": [
        "Book Writing",
        "Writing Advice",
        "Writing"
    ],
    "response": [
        {
            "author_info": {
                "name": "James Sams",
                "href": "/profile/James-Sams-6"
            },
            "answer_text": "Thanks for the A2A. You’ve already gotten some really good answers, but I’ll see if I can add anything of value. Writing is different for everyone. Some people already write a book a month. It comes naturally to them. Some flat out can’t write more than one a year or so. They just don’t have it in them. For not being physical labor, writing books can be taxing and difficult. The main thing is to actually write. Not stare at the screen, not listen to the song on the radio, not play solitaire or minesweeper (did I just date myself with that?), but actually write. The more you know what you are going to write, the faster it will go. This is why some people love outlines. Besides, if you are doing “exploratory writing”, or making it up as you go, you can write yourself into a corner (with fiction) or lose focus on your topic, and then you will have to spend a lot more time fixing it. If you really want to get done quickly, do your research in advance, make an outline, and make sure you know what you want as a final result. Once those things are done, you can sit down and write it quickly without constantly stopping to figure out what you need to do next. And you need to not binge watch on Netflix instead of writing. Really. It seems that our brains only have so much creative energy in a day, and if you use it up on other things, like video games, you probably won’t go back to writing for the day. Save all the “other” things you want to do for when you have finished writing for the day. I hope that helps, and I wish you luck. A book in a month is achievable, but not easy. ",
            "date": "Answered February 27, 2018",
            "views": "596",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Beckass Freddo",
                    "user_href": "/profile/Beckass-Freddo"
                }
            ]
        },
        {
            "author_info": {
                "name": "Naveen Sivakumaran",
                "href": "/profile/Naveen-Sivakumaran-2"
            },
            "answer_text": "A2A - Thank you. Unfortunately I’m yet to embark down the road of book writing. Thus, my answer is based on knowledge I’ve accumulated by reading (and learning). One of the best, to-the-point books I’ve read on writing a book fast and also building a business is Hustle. Get it n Kindle. It’ll help you get started, I promise you. One key thing you’ll have to do to write a book in one month, given you’ve already decided what it is going to be on, is to set aside time every day to write. Do nothing else, but write. Some factors you’ll have to consider when planning your month: First draftEdit2nd edit (and re-write)Design coverPublishThe above is an overly simplified structure to help you gain some focus on the project at hand. You’re looking at at least 3–4 hours of writing each day, putting in about 4,000 words. Here are a few resources that are sure to help: APE: Author, Publisher, Entrepreneur—How to Publish a BookThe Book In A Box Method: The Groundbreaking New Way to Write and Publish Your BookThe Miracle Morning for WritersWile there are several books on the subject, the above three are what I’ve bought and consumer. I’m yet to start in my book because, in the Land of Procrastinators, I’m King. Well, that’s a story for another day. :) I wish you the best of luck. :) ",
            "date": "Answered February 26, 2018",
            "views": "239",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Austin Smidt",
                    "user_href": "/profile/Austin-Smidt-1"
                }
            ]
        }
    ]
}