{
    "title": "How long would it take you to read all the 7 Harry Potter books? - Quora",
    "tags": [
        "Harry Potter (book series)",
        "Harry Potter (movie series)",
        "Harry Potter (creative franchise)"
    ],
    "response": [
        {
            "author_info": {
                "name": "Peter Hotchkin",
                "href": "/profile/Peter-Hotchkin"
            },
            "answer_text": "This is not an answer about the length of time it takes to read. That is entirely up to each individual’s reading style. If you’re a quick reader … or if you have dyslexia … will obviously make a difference. If you commute or read them on holidays that will vary too. Some people skim for meaning … some people read every word out aloud in their head. Some people read the book/s to their children … out loud … every word … with inflection and dramatisation! I have read the entire series in less than a week while communing on the train to and from work. However, the most recent time I’ve read the books, I started on 3 December 2018 and I am still on the early chapters of the final book now (9 April 2019)! In the many years since the books were released, it has taken varying lengths of time for me to read (which I do at least annually). However, when the books were released after three or two years, then I had to re-read the earlier books. I started the first book after the second book was released. But I read the books more quickly, as the time went on and the Potter-mania grew. When the Half-Blood Prince was released, I had to wait for the book store to get enough copies … a breakfast radio announcer read the first page or so of chapter 1 “The Other Minister” on air and discussed the Potter-mania! It was agonising for me … and because I’d heard the opening, it was even worse to have to wait. But except for being able to read The Philosopher’s Stone and The Chamber of Secrets in quick succession, I had to wait at least a year between each book being published. There was three years between the Goblet of Fire and the Order of the Phoenix and two years each between Order of the Phoenix and Half-Blood Prince and Deathly Hallows. What did people (including me) do in those longer intervening publications? Read the earlier books again, read other literature, plough through tomes like the Lord of the Rings …? People who weren’t there at the time have little idea what it was like to have to wait! Play Clash of Clans (?). How about now? Sometimes I read for detail (which takes much longer). Sometimes I take notes or write in the margins (only in my ‘working copies’ of the books—yes I have three sets of the books and 5 copies of Deathly Hallows). Sometimes, I make extensive quotes and references … sometimes making psychological observations for my dissertation (which takes ages!) … sometimes I just read for the sheer pleasure of literature while I continue other activities (this current reading). If you read each book, and then watch the movie, in ‘reading order’ — that can be a very interesting (and rewarding) experience. But if you want the challenge like those of us who were with Harry from the start (or at least from early on), try to read the books and have to wait for the publication intervals. Have a real experience of what it was like 20 years ago or so. I am sure this is more than you bargained for … but you can read as slowly or as quickly as you like or are able. But once you are hooked, it is possible that it will take the rest of your lifetime to read the books! ",
            "date": "Answered April 9, 2019",
            "views": "16",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Tharun Kumar",
                    "user_href": "/profile/Tharun-Kumar-16"
                },
                {
                    "user_id": "Yevgeniy Kizhner",
                    "user_href": "/profile/Yevgeniy-Kizhner"
                },
                {
                    "user_id": "Dominic Field",
                    "user_href": "/profile/Dominic-Field-5"
                }
            ]
        },
        {
            "author_info": {
                "name": "Lydia Touchette",
                "href": "/profile/Lydia-Touchette"
            },
            "answer_text": "It really depends on the individual. It depends upon how fast someone can read, how much free time they have, how much time they want to give to it, and how much they enjoy the series. Me, personally, I read the entire series in a week. But that’s all I did and I fell in love with the series in minutes. It just depends upon the individual. ",
            "date": "Answered April 2, 2019",
            "views": "370",
            "upvotes": " View 6 Upvoters",
            "upvoters": [
                {
                    "user_id": "Tharun Kumar",
                    "user_href": "/profile/Tharun-Kumar-16"
                },
                {
                    "user_id": "Dominic Field",
                    "user_href": "/profile/Dominic-Field-5"
                },
                {
                    "user_id": "Kali Cox",
                    "user_href": "/profile/Kali-Cox"
                },
                {
                    "user_id": "Spencer Zundel",
                    "user_href": "/profile/Spencer-Zundel"
                },
                {
                    "user_id": "Nathan Beard",
                    "user_href": "/profile/Nathan-Beard-6"
                },
                {
                    "user_id": "Lydia Buercklin",
                    "user_href": "/profile/Lydia-Buercklin"
                }
            ]
        }
    ]
}