{
    "title": "How many self-published authors are on Amazon? - Quora",
    "tags": [
        "Digital Publishing",
        "Self-Publishing",
        "Publishing",
        "Amazon.com (product)",
        "Writers and Authors",
        "Amazon (company)"
    ],
    "response": [
        {
            "author_info": {
                "name": "William D. Richards",
                "href": "/profile/William-D-Richards"
            },
            "answer_text": "Quite a lot. When Amazon first launched the Kindle, they were having trouble convincing the traditional publishers to sign on with the program. The publishers were convinced the moment they put out their books in digital form, piracy would become rampant. Never mind that Baen Publishing had been pushing out their catalog for years as ebooks, even without DRM, and they were not having any issues with piracy. Unable to get enough titles to make a significant enough library to make the Kindle a success, Amazon made the bold decision to open up their system to self-publishing authors. I think it can be argued that self-publishing authors are what made the Kindle a success. The traditional publishers, suddenly seeing a flood of competition, were forced to jump in or be left out of the new market. So, yeah, there are still a lot of self-published authors on Amazon. You will also find them on Apple’s Book Store, Barnes & Noble Nook, and Kobo. ",
            "date": "Answered July 13, 2019",
            "views": "440",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Keith Wheeler",
                "href": "/profile/Keith-Wheeler-24"
            },
            "answer_text": "To be honest, there’s really no way to know for sure. While, yes, you can do a search for the word “Createspace”, and that will bring up some of the self-published authors, but that’s nowhere near accurate. There are numerous self-publishing platforms that authors can use(KDP, IngramSpark, Barnes & Noble Press, etc. While you can look at the “Publisher” and see if it says something like “Independent Publisher”, but again this doesn’t account for everyone. Finally, some self-published authors create actual business names for their publishing business and purchase their own isbn’s, in which case, there’s no way to distinguish a self-published author from their traditionally published counterparts. ",
            "date": "Answered July 13, 2019",
            "views": "85",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Travis Casey",
                    "user_href": "/profile/Travis-Casey-4"
                },
                {
                    "user_id": "Daniel De La Torre",
                    "user_href": "/profile/Daniel-De-La-Torre-17"
                }
            ]
        }
    ]
}