{
    "title": "How to make a hot woman laugh - Quora",
    "tags": [
        "Being Funny",
        "Impressing Women"
    ],
    "response": [
        {
            "author_info": {
                "name": "Kapil Sharma",
                "href": "/profile/Kapil-Sharma-1250"
            },
            "answer_text": "The secret of how to make a woman laugh is to use what I call Playfully Arrogant Humor. This is where you pretend to be arrogant in a playful way. It’s the type of humor that TV talk show hosts use, but it’s also the type of humor that guys like me (who get laid like crazy) use on women to get them turned on and enjoying my company. Here are some more examples of how to make a woman laugh… As you will discover from the videos above, making a woman laugh is about using the type of humor that will trigger her feelings of sexual attraction. Playfully Arrogant Humor triggers a woman’s feelings of sexual attraction because you are demonstrating social confidence, social intelligence and masculinity. These are very important traits that help a man be a better survivor in this world. In case you’re not yet aware, the attraction that women feel for men is directly linked to her instinctive analysis of his survival traits. In other words, are you the sort of guy who will have an easy or hard time surviving, thriving and prospering in this world? It’s common knowledge that women love a funny guy. Yet, why is that the case? A while back, a team of scientists in the UK decided to conduct some research in an effort to uncover what makes women so interested in guys who can make them laugh. According to the results of their study, which involved 45 women, being a “funny guy” makes a guy seem more intelligent and trustworthy in her eyes and that makes him more desirable in terms of forming a relationship. ",
            "date": "Answered November 15, 2017",
            "views": "397",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Amraj Dhillon",
                    "user_href": "/profile/Amraj-Dhillon-2"
                },
                {
                    "user_id": "Shruthy Radhakrishnan",
                    "user_href": "/profile/Shruthy-Radhakrishnan"
                },
                {
                    "user_id": "Ankit Kinge (अंकित किनगे)",
                    "user_href": "/profile/Ankit-Kinge-अंकित-किनगे"
                },
                {
                    "user_id": "Vibrant Sahu",
                    "user_href": "/profile/Vibrant-Sahu"
                }
            ]
        },
        {
            "author_info": {
                "name": "Mike Jones",
                "href": "/profile/Mike-Jones-1750"
            },
            "answer_text": "Hot women love off the wall comments. They love devious jokes, but you must first spot a good target or it may backfire. Most hot girls love humor and most love it when it is somewhat dark but not over the top. For example, if she is near you, take a look around to see if you can spot something strange, then make a off comment about it. ",
            "date": "Answered November 18, 2017",
            "views": "59",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Matthew Neal",
                "href": "/profile/Matthew-Neal-24"
            },
            "answer_text": "Figure out what amuses them. Now this will take some work, as you need to get to know that 'hot woman's as an individual person. But once you do, and learn what amuses them, you can use that to then make them laugh. ",
            "date": "Answered November 15, 2017",
            "views": "80",
            "upvotes": "0"
        }
    ]
}