{
    "title": "How to remember effectively whatever I study - Quora",
    "tags": [
        "Study Habits",
        "Human Memory"
    ],
    "response": [
        {
            "author_info": {
                "name": "Sanjay",
                "href": "/profile/Sanjay-114"
            },
            "answer_text": "Good question.. First thing you need to know is what kind of learner you are. No two people learn the same way, but there are styles people will lean toward: Visual learners learn best by seeing. They like to watch how something is done, and do best when they can look at a chart, or see the words written on the board, etc. This type of learner may be able to remember where on a page he/she saw something. For visual learners, you need to create visuals while studying. Re-read passages and notes, and whenever possible draw visuals (charts, graphs...). Use brightly colored highlighters. If you make note-cards, print out pictures to paste on one side whenever possible.Auditory learners learn best by hearing. They will do better listening to someone talk about a subject than just reading it. It may sound silly, but in high school when I struggled with history, I would read a passage, and then repeat it to myself. Saying it out loud, in my own words, helped me process the information. Use a tape-recorder and record your notes to play back instead of writing them, and play around with sounds to help memorize things (putting things to music, finding words that rhyme to play a game of association). If you use note cards, say the words out loud while you use them.Kinesthetic learners need to move or feel while learning. They'll do best if they can get up and walk around while studying. Once again, note cards are great because you can manipulate them. You can move them around, such as sorting into categories or placing them chronologically, etc. If this is you, you can also try having something in your hand, like a stress ball, or a lump of play-dough.General tips: * You cannot learn if you're not taking care of your body's basic need for sleep and food. Don't try to study when you haven't slept for 18 hours. * Break things down into small chunks. You can't put a whole apple in your mouth. You have to take bites. Studying is the same way. * Test yourself, or get someone else to test you. Make lists of what you think will be on the test, and check every now and then to see whether you know it yet. * Try engaging your senses. If you chew pepermint gum while studying French, then chew that same gum during your test, it might help you tap into the part of your brain you were using while studying. * Use mnemonics (memory tricks). I always remembered that Ponce deLeon discovered Florida by picturing the state of FL as a cat's paw sticking out to grab something (pounce). Or put things to music. * Review whatever you're having a hard time with right before bed. While you're sleeping, your brain sorts through information from the day. You may find your brain has done some of the work while you slept. * Stay organized. This is SO important. Know exactly what you need to do for each class, and when it's due. Use a planner, a calendar, something. You can't succeed without this. * Use a timer: If there's a task you dread, and you can't seem to make yourself do it, set a timer for 20 minutes and tell yourself you're just going to study until the timer goes off, and then you can work on something else for a while. * Take advantage of otherwise lost time. Keep note cards in your bag or pocket (or phone), and whip them out when you're waiting in line, or otherwise wasting time. Frequent small chunks of study actually work better than long sessions. * Stay accountable. Get a study partner, or get a friend to make you stay accountable and check on you to see how you're doing. * Schedule time to study. Plan time in each day that is set aside for study time only. You can choose when, but commit yourself to it. Refer to my answer : Sanjay's answer to How should I make a study timetable for my exam? * Experiment with different ways of studying to find what works best for you. Good luck! Hope my *long* answer helped :D ",
            "date": "Answered July 22, 2016",
            "views": "19",
            "upvotes": " View 7 Upvoters",
            "upvoters": [
                {
                    "user_id": "Shaikh Khalid",
                    "user_href": "/profile/Shaikh-Khalid-7"
                },
                {
                    "user_id": "Pranav Kunavat",
                    "user_href": "/profile/Pranav-Kunavat"
                },
                {
                    "user_id": "Kodandaram Lanka",
                    "user_href": "/profile/Kodandaram-Lanka"
                },
                {
                    "user_id": "Mohsin Khan",
                    "user_href": "/profile/Mohsin-Khan-712"
                },
                {
                    "user_id": "Kajal Mesta",
                    "user_href": "/profile/Kajal-Mesta"
                },
                {
                    "user_id": "Mukimba Phillimon",
                    "user_href": "/profile/Mukimba-Phillimon"
                },
                {
                    "user_id": "Gurbani Singh",
                    "user_href": "/profile/Gurbani-Singh-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Rahul Sinha",
                "href": "/profile/Rahul-Sinha-113"
            },
            "answer_text": " It takes some time and efforts to retain what you’ve learned. If you want practical ideas on how to remember most of the things you learned, then start with these two strategies. Review daily what you’ve learned.Teach the important concepts you’ve learned. Strategy #1. Review daily what you’ve learned. As you need to sleep, eat, do routine activities daily to stay updated. You need to review whatever you studied earlier to keep the memory fresh and active. If you will study and leave the concept till a specific period, you likely to forget it as new information stored in your mind. Try this: Keep short notes. The best way to review what you studied is to prepare and keep the short notes up to dated. It’ll allow you to gain the momentum easily without going into textbooks. Prepare short notes as per your convenience and understanding level.Allot 15 minutes for review. Every day, before you start study, allow 5–10 minutes to review what you studied yesterday. And, last 5 minutes to review what you studied today. Like, this, it will keep your mind updated with the knowledge you gained and increase the retaining ability of the mind. Strategy #2. Teach what you’ve learned. When you teach something you learned, it solidifies and strengthens your knowledge of the concepts and allow you to recall easily and retain the knowledge for a longer period more effectively. Try this: Find appropriate audience to teach. The audience can be anyone who can patiently attend and listen your lecture. And, in case you don’t find or hesitate, then sit in front of the mirror and start the lecture. You got the audience.Keep essential notes with yourself. While teaching the audience, you probably need to refresh your knowledge or need to sneak into the concepts, so keep the relevant notes with you. It’ll allow you to find out anything if you forget.Teach in most simplified manner you know. When you need to teach, have a simplified approach. Keep the concepts and examples simple and easy to understand. Don’t make teaching complex as it’ll complex the knowledge you retained. While if you practice simple approach, you can retain the knowledge in better and effective manner for a longer period.",
            "date": "Answered September 30, 2016",
            "views": "2",
            "upvotes": " View 18 Upvoters",
            "upvoters": [
                {
                    "user_id": "Hilary .",
                    "user_href": "/profile/Hilary-63"
                },
                {
                    "user_id": "Subhashree Sekhar",
                    "user_href": "/profile/Subhashree-Sekhar-1"
                },
                {
                    "user_id": "Divesh Tandon",
                    "user_href": "/profile/Divesh-Tandon"
                },
                {
                    "user_id": "YuvRaj Singh",
                    "user_href": "/profile/YuvRaj-Singh-450"
                },
                {
                    "user_id": "Samvardhini Rao",
                    "user_href": "/profile/Samvardhini-Rao"
                },
                {
                    "user_id": "Rajkumar T",
                    "user_href": "/profile/Rajkumar-T-57"
                },
                {
                    "user_id": "Priya Gautam",
                    "user_href": "/profile/Priya-Gautam-8"
                },
                {
                    "user_id": "Sonika Singh",
                    "user_href": "/profile/Sonika-Singh-36"
                },
                {
                    "user_id": "Abhishek Singh",
                    "user_href": "/profile/Abhishek-Singh-1099"
                },
                {
                    "user_id": "Priyanka Rede",
                    "user_href": "/profile/Priyanka-Rede"
                }
            ]
        }
    ]
}