{
    "title": "How long was your library book overdue? - Quora",
    "tags": [
        "Public Libraries",
        "Libraries and Librarianship",
        "Personal Experiences",
        "Reading"
    ],
    "response": [
        {
            "author_info": {
                "name": "Patricia Arcularius Self",
                "href": "/profile/Patricia-Arcularius-Self"
            },
            "answer_text": "It was 1959, I was a teenager, and I checked out a book from the Fairfax Public Library. It was a book of stories by Nathaniel Hawthorne, and I forgot to return it. The book was packed and shipped to Germany when we moved there. I married and the book was shipped with household goods to California, where my new husband and I moved. Some years afterward, I moved back to Fairfax County, Virginia, and all my belongings were shipped there. I encountered the Hawthorne book and put it on the bookshelf, knowing I’d owe a small fortune in overdue charges if I returned it. I couldn’t use the library, knowing my name would trigger overdue or replacement charges for that book. Perhaps six years after that, I’d moved out of Fairfax County while staying in VA, and then back into that county. I had a small library of my own, into which the Hawthorne book was placed. And then, a magical thing happened. For the first time in my memory, the Fairfax public library system declared a time of amnesty. Any overdue book could be returned without a fine being owed, and the library member would be reinstated in good standing. The year was 1972, I think, and I dug through my possessions until I located that book once again. The feeling of relief, the lifting of a large burden off my shoulders, the happiness I felt at being able to return the book with no recriminations, cannot be described. For the rest of the time I lived there, I happily used the library, staying well within the two-week checkout period allowed. ",
            "date": "Answered April 10, 2019",
            "views": "104",
            "upvotes": " View 3 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Charley Patterson",
                    "user_href": "/profile/Charley-Patterson-3"
                },
                {
                    "user_id": "Jennie Balfour",
                    "user_href": "/profile/Jennie-Balfour-1"
                },
                {
                    "user_id": "Jo Thomas",
                    "user_href": "/profile/Jo-Thomas-104"
                }
            ]
        },
        {
            "author_info": {
                "name": "Margaret L. Scott",
                "href": "/profile/Margaret-L-Scott"
            },
            "answer_text": "I have usually returned library books promptly. This is easy for me to do as I am close to a library. When I was working in the library (best job ever), we had a borrower return a box of books he had found in his home. (This was in 2016) The books were in perfect order and were due to be returned in the late 80’s, and issued on the old card system before the computer system was installed. Some of the books were quite outdated and were withdrawn. Others were still in perfect condition, we’re reprocessed (bar coded etc) and back in circulation. No fines were charged as the records had long been deleted. There are ways to return books surreptitiously without the library being able to fine you. Replacing an overdue book back on the shelf without discharging it is one. When it is reissued to another borrower it will automatically be transferred to their record. In my earlier days it was common for a librarian to waiver fines on hearing a valid reason. Unfortunately nowadays younger librarians aren't as obliging. ",
            "date": "Answered April 17, 2019",
            "views": "261",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Jo Thomas",
                    "user_href": "/profile/Jo-Thomas-104"
                }
            ]
        }
    ]
}