{
    "title": "How to write an essay on describing myself - Quora",
    "tags": [
        "Essay Writing Help"
    ],
    "response": [
        {
            "author_info": {
                "name": "Larry Milbourne",
                "href": "/profile/Larry-Milbourne"
            },
            "answer_text": "I think the task to write about yourself is quite difficult. It doesn’t matter if you write a personal essay, cover letter or any other project – each goes with some specific tricks that make the writing tough. When I think about writing an essay describing myself, I consider the following: • Introducing to a strangerImagine talking to someone you’ve never met before, but don’t make up a story. Remain as sincere as you can when describing the challenges you faced as a cardiologist’s assistant. Tell what personal struggles you’ve handled during your internship as a TV editor. Stay specific from line one.• Picking one specific topicDon’t write about a general issue. Your essay may well be about feminism, but you have to discuss it based on a defining incident that is personal to you. What does your experience mean to you? Did it teach you anything about feminism? • Providing some good detailsRemember that you describe yourself, so ensure to bring positive light on your personality: o Bad: I like animals. o Better: I like the studying animal behavior.o The best: When I was a teenager, I would attend local vet clinic to help providing basic veterinary care to the animals. That’s what influenced my decision to become a vet. • Getting help from family members It’s not that you have to ask your family to write an essay for you. I mean collecting some stories from your childhood is a nice way to reach your readers. If it’s OK, share a story of you of anyone from your family battling a serious disease or volunteering in a refugee camp. No matter what you decide to share, be honest. Don’t sound fake. It’s up to you to decide what information to include, but I’d recommend you stay away from religion, politics, gender, nationality/race, and income issues. ",
            "date": "Answered May 15, 2019",
            "views": "23",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Anila Humraz",
                    "user_href": "/profile/Anila-Humraz"
                }
            ]
        },
        {
            "author_info": {
                "name": "J. M. MacLellan",
                "href": "/profile/J-M-MacLellan"
            },
            "answer_text": "Personal essay? Cool! Let’s do this… So, start with outlining what you need for your essay - you usually have your five basic paragraphs. The introduction, the three body paragraphs, and the conclusion. What reaallyyyyy helps in writing an essay and I have found highly useful over years of writing is starting with an outline, which looks like this… Thesis: (your introductory sentence) 1.(your first body paragraph’s topic) a. supporting detail b. supporting detail c. supporting detail 2. (your second body paragraph’s topic) a. supporting detail b. supporting detail c. supporting detail 3. (your third body paragraph’s topic) a. supporting detail b. supporting detail c. supporting detail Conclusion: (wrapping your essay up) And now we get to the good stuff - writing the actual essay. In the introduction, tell your reader what you’re going to be talking about. Make sure to start off hooking the reader’s attention - I won’t tell you what to write because this is your own personal essay here! :-) In the first body paragraph, start with the basics about yourself. Maybe talk about what you look like, where you live, and how old you are. In the second paragraph, go a little deeper. Maybe you can talk about your hobbies and interests and what extracurricular activities you’re currently taking. In the third, go even deeper - the reader feels they know you well now, so perhaps share your hopes and dreams for the future, such as what you want to be, where you want to live, etc. Finally, in the conclusion, give a quick summary of what you just said - not so descriptive that it feels repetitive, but a nice wrap-up of your paper. End with a strong, final sentence. After you’re done, EDIT!!! I cannot stress how important this is. Read your essay a couple times over, smoothing out sentences and catching typos. Make sure your essay is 12 pt. Times New Roman with 1″ margins - this is the typical format for an essay and teachers will like to see this. Also, maybe add in MLA format - you know, your name, teacher’s name, class name, date… Note that this is only the basics, and you can expand on what I said. Since this is a personal essay, make it personal! The body paragraphs could really be about anything. This is just a general idea of what to do. Best of luck, and hope this helps! :-) ",
            "date": "Updated July 8, 2018",
            "views": "103",
            "upvotes": " View 5 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Kosar Sdiq",
                    "user_href": "/profile/Kosar-Sdiq"
                },
                {
                    "user_id": "Benjamin Hamdi",
                    "user_href": "/profile/Benjamin-Hamdi"
                },
                {
                    "user_id": "Marissa Martinez",
                    "user_href": "/profile/Marissa-Martinez-123"
                },
                {
                    "user_id": "Geoffrey Brickley",
                    "user_href": "/profile/Geoffrey-Brickley"
                },
                {
                    "user_id": "Clara Chagas",
                    "user_href": "/profile/Clara-Chagas"
                }
            ]
        }
    ]
}