{
    "title": "How to read a book most effectively - Quora",
    "tags": [
        "Literature",
        "Reading",
        "Book Recommendations"
    ],
    "response": [
        {
            "author_info": {
                "name": "Aishwarya Singh",
                "href": "/profile/Aishwarya-Singh-176"
            },
            "answer_text": "If you are an experienced reader that is you have been reading for years then you would know what environment suits you best. If not or if you are still trying to find the perfect surrounding for book reading then i suggest you try by giving solitude a chance.lock yourself in your room and get in your bed and start reading. don’t sleep and read because then you’ll be forced to change position a gazillion times! i don’t know about you but i avoid eating something while reading because that just takes my mind off the topic at hand. while reading a novel or a story try to imagine the situation as you read it. it would happen naturally as you read further but don’t force your imagination. while reading self help books try to analyse yourself first before you start reading and then do it again after every chapter or two chapters. you don’t have to take written notes, you can underline the point and bookmark it. best way to increase efficiency is by associating a situation to a chapter. while reading any book try to keep your cellphone or laptop away from you or on silent mode. to look up meaning for a word you can always use pocket dictionary. to gain the best from any book, choose a book that suits you. you can research about it.. ",
            "date": "Answered November 27, 2016",
            "views": "379",
            "upvotes": " Answer requested by Suraj Harale"
        },
        {
            "author_info": {
                "name": "Muthumeena P R",
                "href": "/profile/Muthumeena-P-R"
            },
            "answer_text": "In my experience, I have understood that to read a book most effectively, what matter a lot are concentration and involvement. If we are completely into the book we read, it’s impossible to forget even the lesser known fact. It also much depends upon the type of book we choose to read. If the book suits our own interests and if we had picked it up with much admiration to read it, we may read it in no time, simultaneously enjoying each and every facet of the book. ",
            "date": "Answered November 28, 2016",
            "views": "198",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Sahir",
                "href": "/profile/Sahir-2"
            },
            "answer_text": "Be it any kind of books academic, novels or biography or any kind of it The only way to read a book is by feeling it , what really author is trying to convey .Read a few pages don't rush it through read 10–15 pages slowly you will feel it and you will want to read more. Thats how it will be most effective when you have interest you will never forget the contents and if you forgot the content the feeling that you got from the book will never be forgotten Goodluck!!!!! ",
            "date": "Answered November 26, 2016",
            "views": "166",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Pankaj Sanodiya",
                "href": "/profile/Pankaj-Sanodiya-2"
            },
            "answer_text": "first of all, there are many way to read books effectively. the main motive is for what purpoes you were reading that book:- Read for academic, so go through the main part of that topic , understand it very well and puke it out in the examination.Read for competitive exams, make the short notes of key concept and solve the several question of that part ,so that you got thoroughly in your mind itself.Read for motivation,fiction and all other, if that book or content of that book touch your heart or something is good in that book so you never be forget that thing, for that you don’t have to memorise it.",
            "date": "Answered November 26, 2016",
            "views": "241",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Devender Kumar",
                "href": "/profile/Devender-Kumar-125"
            },
            "answer_text": "I think read the book In one go Is the best way . Read it as quickly as you can . If book is long finish it with in week. If it's short like 200 or 300 pages finish it within two or three days. Make small targets or your reading. After reading each charter contemplate what you have learned and make notes . Notes of summary type. Hope this helps you. ",
            "date": "Answered November 26, 2016",
            "views": "149",
            "upvotes": "0"
        }
    ]
}