{
    "title": "How do most popular singers learn to sing? - Quora",
    "tags": [
        "Singers",
        "Singing",
        "Musicians"
    ],
    "response": [
        {
            "author_info": {
                "name": "Gaitsiri Mongkolsmai Lin",
                "href": "/profile/Gaitsiri-Mongkolsmai-Lin"
            },
            "answer_text": "Most popular singers sing however they learned growing up - from enjoying singing, from mimicking other singers, from learning to use their voice in school and at home, from the styles of music they are exposed to.  Some learn the right way by chance, and some learn the wrong way without knowing.  Some have formal training, but some do not. The best have had professional training, so that they know not only to use their voices by instinct, but with specific techniques that come with training the voice.  Even the best singers could have had poor habits that needed retraining.  Even famous and talented singers can damage their voices without guidance on use and overuse and vocal health. If they've learned properly, technique for popular music starts with the same basics of classical training for breathing and posture, and then branches away from classical and opera into a multitude of genres.  A properly trained voice can be differentiated by smoothness, resonance, pitch accuracy, quality sound, and control of the voice.  Vocalists must know how to care for and manage their sound. ",
            "date": "Answered April 26, 2016",
            "views": "3",
            "upvotes": " View 9 Upvoters",
            "upvoters": [
                {
                    "user_id": "Aaron Puckett",
                    "user_href": "/profile/Aaron-Puckett"
                },
                {
                    "user_id": "Ana María",
                    "user_href": "/profile/Ana-María-15"
                },
                {
                    "user_id": "Mark Spalding",
                    "user_href": "/profile/Mark-Spalding-15"
                },
                {
                    "user_id": "Rooy Aguirre",
                    "user_href": "/profile/Rooy-Aguirre"
                },
                {
                    "user_id": "Rizz Aariz",
                    "user_href": "/profile/Rizz-Aariz"
                },
                {
                    "user_id": "Natasha Ro",
                    "user_href": "/profile/Natasha-Ro"
                },
                {
                    "user_id": "Anmol Saini",
                    "user_href": "/profile/Anmol-Saini-4"
                },
                {
                    "user_id": "Vincent Pe",
                    "user_href": "/profile/Vincent-Pe"
                },
                {
                    "user_id": "Vaan Cotton",
                    "user_href": "/profile/Vaan-Cotton"
                }
            ]
        },
        {
            "author_info": {
                "name": "Larry English",
                "href": "/profile/Larry-English-3"
            },
            "answer_text": "i would say there is no standard way. it is true that most popular singers have no formal training. although that isn;t bad, it also means their methods are all over the map. self taught, but then that means many things. lots of people start in church or school but they may have started on their own without that too. and lots of pop singers are not really very good, classically speaking, not that that means anything. the goal of 'popular' is money, so whatever works... most singers are NOT 'popular', either. i would guess 10% of the populace can sing passably. almost none of them are known, popular, or even make a living from it. the competition is too great. even if you are good, so are 1,000,000 other people. you also need luck, looks, any number of factors out of your control. wle ",
            "date": "Answered May 3, 2016",
            "views": "36",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Mark Spalding",
                    "user_href": "/profile/Mark-Spalding-15"
                },
                {
                    "user_id": "Rooy Aguirre",
                    "user_href": "/profile/Rooy-Aguirre"
                },
                {
                    "user_id": "Rizz Aariz",
                    "user_href": "/profile/Rizz-Aariz"
                }
            ]
        }
    ]
}