{
    "title": "How to promote KDP low content books - Quora",
    "tags": [
        "Amazon KDP",
        "Book Marketing and Promotion",
        "Amazon Kindle Direct Publishing",
        "Self-Publishing",
        "Content Strategy",
        "Content Marketing",
        "Book Publishing",
        "Publishing",
        "Marketing"
    ],
    "response": [
        {
            "author_info": {
                "name": "Jeffrey Conrad",
                "href": "/profile/Jeffrey-Conrad-5"
            },
            "answer_text": "There’s a common misconception that low-content or low-page-count books on the Kindle Direct Publishing platform don't sell well. There is a misconception that the lower the number of pages you have, the lower the quality or value proposition of your book. These don’t necessarily go hand in hand because it all depends on perceived value. Let me repeat that - it all the depends on perceived value. You probably have heard that perception is everything. When it comes to buying stuff on Amazon Kindle, this is absolutely true. I’ve seen completely trashy books sell like hotcakes. I’ve also seen densely packed, high-quality books gather digital dust. It really all depends on how you sell them. So, it's not the amount of content, but it's the marketing that matters. For example, McDonald’s makes burgers that a lot of burger purists and connoisseurs don’t like. In fact, if you were to sneak them a Big Mac, they probably would vomit. However, McDonald’s serves billions of burgers every single week. I hope you understand that it's all about marketing and positioning. This is why it's really important to not obsess about the content volume of the book and to focus more on the quality and positioning of the book. Different audiences have different expectations as to the number of words that would constitute a good book. For example, Machiavelli's classic, The Prince, has less than a hundred and fifty pages. It is a very small book, but people throughout history can’t stop reading that book. That’s how awesome it is. I can go on and on. There are lots of short books out there. The whole point here is not to obsess about word count or page count but to focus more on whether you are meeting the needs of the intended audience of your books. If you’re worried about cost, don't worry about it. You can hire expert ghostwriters writers like Gene Eugenio who often write for $99 a book to create books for you. This is not a question of cost per se, but more of marketing and product positioning ",
            "date": "Answered October 17, 2019",
            "views": "828",
            "upvotes": " View 7 Upvoters",
            "upvoters": [
                {
                    "user_id": "Brandon Booker",
                    "user_href": "/profile/Brandon-Booker-7"
                },
                {
                    "user_id": "Herbal Remedies",
                    "user_href": "/profile/Herbal-Remedies-11"
                },
                {
                    "user_id": "MD. Montaha Hossain",
                    "user_href": "/profile/MD-Montaha-Hossain"
                },
                {
                    "user_id": "Virginia Smith",
                    "user_href": "/profile/Virginia-Smith-51"
                },
                {
                    "user_id": "Noah Logman",
                    "user_href": "/profile/Noah-Logman-1"
                },
                {
                    "user_id": "Filippo Boninsegna",
                    "user_href": "/profile/Filippo-Boninsegna"
                },
                {
                    "user_id": "Sharon Clark",
                    "user_href": "/profile/Sharon-Clark-209"
                }
            ]
        },
        {
            "author_info": {
                "name": "Janet Wees",
                "href": "/profile/Janet-Wees-1"
            },
            "answer_text": "You can start by running ads on Amazon and setting the price per click quite low. This will give you an idea as to which keywords are getting the most impressions. Other avenues would be through Pinterest or Instagram. The biggest piece outside of Amazon ads is learning where your audience spends time online, and go there. Finance folks may spend more time on Linked-In, where as stay at home moms may spend more time on Pinterest. So first research where your niche is, and go there! ",
            "date": "Answered September 18, 2019",
            "views": "627",
            "upvotes": " View 7 Upvoters",
            "upvoters": [
                {
                    "user_id": "Virginia Smith",
                    "user_href": "/profile/Virginia-Smith-51"
                },
                {
                    "user_id": "Tarik Hmidani",
                    "user_href": "/profile/Tarik-Hmidani"
                },
                {
                    "user_id": "Carolyn Wills",
                    "user_href": "/profile/Carolyn-Wills-1"
                },
                {
                    "user_id": "Jessica James",
                    "user_href": "/profile/Jessica-James-31"
                },
                {
                    "user_id": "Jacob Handley",
                    "user_href": "/profile/Jacob-Handley-1"
                },
                {
                    "user_id": "Allen Zhao",
                    "user_href": "/profile/Allen-Zhao-81"
                },
                {
                    "user_id": "ChandraSekher Rapeti",
                    "user_href": "/profile/ChandraSekher-Rapeti"
                }
            ]
        }
    ]
}