{
    "title": "How groundbreaking was A Wrinkle in Time? - Quora",
    "tags": [
        "Madeleine L'Engle (author)",
        "A Wrinkle in Time (1962 book)",
        "Literary Analysis and Criticism",
        "Children's and Young Adult Books",
        "Science Fiction (genre)"
    ],
    "response": [
        {
            "author_info": {
                "name": "Cristina Hartmann",
                "href": "/profile/Cristina-Hartmann"
            },
            "answer_text": "A Wrinkle in Time broke ground in one very important respect: women in science fiction and fantasy--both fictional and non-fictional.  Meg Murry: the first real sci-fi heroine. Now, L'Engle was hardly the first science fiction author to have a female heroine. James Schmitz's Trigger Argee in Legacy had already made a splash years prior. Trigger Argee and Meg Murry, however, differ wildly. Trigger Argee is a beautiful woman with strastrospheric IQ who just happens to be the best shot in the galaxy. Meg Murry is a plain, shy nerd with serious self-confidence and social issues. Meg Murry is no Mary Sue. Her IQ proves impressive, but she struggles with finding her talents and comfort zone. She bumbles and blusters in social situations. Frizzy-haired and bespectacled, she's no beauty. Still, she proves just as heroic as Trigger Argee, Ellen Ripley or other invincible heroines while being human. Meg's authenticity broke many stereotypes. Mind you, A Wrinkle in Time was published in 1962, at the cusp of the women's liberation movement. Never before had a children's or young adult book portrayed a \"normal\" girl, just as smart and socially awkward as a male nerd. Meg may have flaws, but that's what made her great and real.  As we celebrate A Wrinkle in Time's 50th anniversary, many wonder if Meg Murry inspired the recent spate of smart but flawed heroines such as The Hunger Games' stoic archer Katniss Everdeen and Harry Potter's wild-haired nerd Hermoine Granger. Perhaps, but I think L'Engle did it best of them all. Katniss skews a bit too emotionally detached and static. Hermoine rarely makes mistakes or even evolves as a character. Meg Murry grows--not just changes--as the series progresses. Plus, Meg's love interest (singular, not plural) falls for her because of her intelligence, not because of some hair-blam or archery skills. How cute is that? Madeleine L'Engle: one of the first respected modern female sci-fi authors. When L'Engle shopped her manuscript around, female science fiction and fanasty authors were thought \"downmarket\" and inferior to contemporary male authors in the genre. L'Engle proved them wrong. The 1960s and 1970s became a watershed moment for emerging female sci-fi and fanasty authors: L'Engle, Ursula K. Le Guin, Diana Wynn Jones, Anne McCaffrey and Octavia Butler. L'Engle, with A Wrinkle in Time, showed that women could devise equally (or even more) intriguing, original and scientific concepts in sci-fi and fantasy novels as their male peers. The literary circles recognized these contributions to the canon by giving these authors multiple impressive awards. With L'Engle pounding the path, women became an integral part of modern science fiction. (Here, we must also thank the wonderful Mary Shelley, the original groundbreaker for female science fiction writers.) Now, in the early 21st century, we don't think twice about seeing a female name on the cover of a sic-fi or fanasty book (mostly). Progress._________Sources: 'A Wrinkile in Time' Turns Fifty - What Other Novels Paved the Way for Fantasy and Since Fiction Literature's Comeback (Forbes article) - http://www.forbes.com/sites/erikkain/2012/02/08/a-wrinkle-in-time-turns-fifty-what-other-novels-paved-the-way-for-fantasy-and-science-fiction-literatures-comeback/'A Wrinkle in Time' and its Sci-Fi Heroine (NYT essay): http://www.nytimes.com/2012/01/29/books/review/a-wrinkle-in-time-and-its-sci-fi-heroine.html?pagewanted=all'A Wrinkle in Time' Turns 50: Meg Murry Made Katniss Everdeen Possible (Atlantic Wire article): http://www.theatlanticwire.com/entertainment/2012/02/wrinkle-time-turns-50-meg-murry-made-katniss-everdeen-possible/48364/",
            "date": "Updated June 18, 2014",
            "views": "33",
            "upvotes": " View 55 Upvoters",
            "upvoters": [
                {
                    "user_id": "Sean Yeager Adv",
                    "user_href": "/profile/Sean-Yeager-Adv"
                },
                {
                    "user_id": "Thomas P. Buehner",
                    "user_href": "/profile/Thomas-P-Buehner"
                },
                {
                    "user_id": "Diana Data",
                    "user_href": "/profile/Diana-Data"
                },
                {
                    "user_id": "Christopher VanLang",
                    "user_href": "/profile/Christopher-VanLang"
                },
                {
                    "user_id": "Liz Stell",
                    "user_href": "/profile/Liz-Stell"
                },
                {
                    "user_id": "Jennifer Edeburn",
                    "user_href": "/profile/Jennifer-Edeburn"
                },
                {
                    "user_id": "Isabella De Oliveira Campos",
                    "user_href": "/profile/Isabella-De-Oliveira-Campos"
                },
                {
                    "user_id": "Shruthi Sailesh",
                    "user_href": "/profile/Shruthi-Sailesh"
                },
                {
                    "user_id": "Stu Hirayama",
                    "user_href": "/profile/Stu-Hirayama"
                },
                {
                    "user_id": "Adam Gerow",
                    "user_href": "/profile/Adam-Gerow"
                }
            ]
        },
        {
            "author_info": {
                "name": "Ron Garrett",
                "href": "/profile/Ron-Garrett-2"
            },
            "answer_text": "Cristina has the real answer, but I would like to add:  In 1963, at 8 years old, I had read every non-fiction book in the (small) library.  During the summer, the school opened the library as we didn't have a bookmobile.  That came later.  Once I had explained my predicament to the librarian, an addiction to reading, she gave me several fiction books.  Since my non-fiction interest was outer space and aeronautics, she chose science fiction novels. I was so impressed in Wrinkle, I read hardly any other genre than science fiction for the next 3 decades, including the sequels.  It may have made me a feminist(along with my mom's influence), and I agree that Hermione is a very Meg-ish type girl.  It was also cute in Wrinkle that her Dad called her Megaparsec.  It didn't hurt that the story was about a tesseract(hypercube) for space(time)travel.  It was also the first reference to ESP(not spiritualism) that I had ever seen, so I had to read up on all those offerings when I ran across them. Indeed, my chosen romantic interests were all what I considered strong women.  And I married twice, for love, and was not disappointed. Groundbreaking?  Life-changing!! ",
            "date": "Answered January 22, 2013",
            "views": "442",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Angelica Peralta",
                    "user_href": "/profile/Angelica-Peralta"
                },
                {
                    "user_id": "Tarl Telford",
                    "user_href": "/profile/Tarl-Telford"
                },
                {
                    "user_id": "Susie Downing",
                    "user_href": "/profile/Susie-Downing"
                },
                {
                    "user_id": "Lisa Linnet",
                    "user_href": "/profile/Lisa-Linnet"
                }
            ]
        }
    ]
}