{
    "title": "How has the book 'How to win friends and influence people' improved your life? - Quora",
    "tags": [
        "How to Win Friends and Influence People (1936 book)",
        "Influence",
        "Self-Improvement"
    ],
    "response": [
        {
            "author_info": {
                "name": "Pratik Khedikar",
                "href": "/profile/Pratik-Khedikar"
            },
            "answer_text": "Okay, so let's talk about my favorite book of all time. In fact, it inspired me to open up a youtube channel on this and other books (It’s that effective) What is so different about this book? Well, the topics that are focused on are unusually different and more relatable than any book you will find.Ex :- the Easiest way to make a first good impression, an appeal that everybody likes, If you want the honey then don’t kick the beehive etc. So the principles you learn in these chapters can be applied on a day to day basis which makes it fun to read and reread the book. Now, I will try to include as many benefits as I can remember at the moment. I am pretty sure I will miss a few. 1)You start loving to talk to people and make friends. Probably because you become so good at it based on the principles shared. You know exactly how to start, what to talk about, how to keep the conversation going etc. 2)You become likable and popular. Probably because you understand people a lot better than other people. You know how others like to be treated, how you should behave, how you should respond etc 3)You become a better leader. Since you understand the way people think, feel, want to be treated, you are able to bring out the best in people. 4)You begin a better convincer and persuader. Since you exactly know what makes people tick. 5)You become a good peacemaker - In situations that are tensed and heated or hostile and unfriendly, you can easily get both parties to resolve the issues. You are also able to better resolve your own issues with people. 6)You become a confident speaker - A great advantage of liking other people and being likable is that it increases your confidence to talk in public. Because now instead of those people being “random people to be impressed”, they become “unknown friends that want to hear your story”. There are many more but for now, hope you enjoy these 6 benefits and really take their advantage. Also in order to get the most out of the book, follow these principles. 1)PRACTICE:- Since the exercises suggested are fun to do, try applying them in day to day situation and see how well you can do. ( you will surprise yourself and others around you) 2)READ and REREAD a CHAPTER:- One chapter usually contains a lot of points that you can benefit from. And you can remember all, so read and re-read. I bet you will learn something new every time you reread a chapter 3)MAKE NOTES:- This can include simply underlining important points or writing on the margins. This way you will remember the key points. 4)MAKE YOUR OWN ADDITIONS:- You can add your own ways and methods in the book for you to try the next time you find yourself in situations. Best luck. PS: If you want to quickly revise a few concepts, you can watch my videos.    ",
            "date": "Updated February 12, 2019",
            "views": "32",
            "upvotes": " View 8 Upvoters",
            "upvoters": [
                {
                    "user_id": "M.S.M.Srivatsava",
                    "user_href": "/profile/M-S-M-Srivatsava"
                },
                {
                    "user_id": "Barath Manohar",
                    "user_href": "/profile/Barath-Manohar-2"
                },
                {
                    "user_id": "Rohan Mote",
                    "user_href": "/profile/Rohan-Mote-1"
                },
                {
                    "user_id": "Nagarjun",
                    "user_href": "/profile/Nagarjun-31"
                },
                {
                    "user_id": "Matthew Hutchins",
                    "user_href": "/profile/Matthew-Hutchins"
                },
                {
                    "user_id": "Roshan Rathi",
                    "user_href": "/profile/Roshan-Rathi-5"
                },
                {
                    "user_id": "Pritam Saha",
                    "user_href": "/profile/Pritam-Saha-183"
                },
                {
                    "user_id": "Binu",
                    "user_href": "/profile/Binu-48"
                }
            ]
        },
        {
            "author_info": {
                "name": "Prabhu S Sundararaj",
                "href": "/profile/Prabhu-S-Sundararaj"
            },
            "answer_text": "Remembering names Timestamp: 5th Aug 2019  One of great thing in life is knowing people’s name. It doesn’t matter if you met that person one day back or one week or even one month etc… You easily become frnd with the person. Trust me it is working I will share you my two memory fragments. Thank you, Mr Dale Carnegie, from the book ” how to win friends and influence people” The book name may feel negative but this is a gem of a book which changed my life. Calling people’s name with correct pronunciation we will win their heart! #1 experience 4 month back I went to a local mobile shop bought one headset price: 350rs. I try to bargain it didn’t go well I end up paying the full amount.For the gratitude, I told my name and he told his name is “Niyas”. Unfortunately, my headset was broken within a week and I went to the same shop but this time I well equipped with the technique. I: Hey niyas bro how are you?He:[face expression: surprised and doubtful] you?I: 2 weeks before I bought headset from you. Unfortunately, It is broken now.He: where is your house?I: near bla bla… He: Ho a few years before I also stay there I think that is why you look so familiar.I: Maybe A person standing beside him asked ‘he is your close frnd?. He: [smiled with friendly manner] now both of us become frnds He continued…No one called me by my name everyone calls me “bhai”(commonly in my area other religious people call Muslim male “Bhai” and female “Bhai Amma”). Conversation bla bla…After… I: how much headset price bro?He: 250rs My mind voice: 100rs discount! For calling his name wow!. #2 experience A few months back I learnt the name of Amazon delivery person “Ram”.Whenever I get my package from him I call him by name and greet him.Few weeks before I order metal hand gripper but it is a defective product I applied for replacement. Today I saw ram he was surrounded by 6-7 other customers, I waited behind them.He saw and came near to me and asked: “bro you are Prabhu right?”He: wait one sec! This is your package[With a smile]I: I got the package and Told: “Thank you”. He gave me a priority!!! Remembering names will always create wonders. people’s facial expressions itself you will feel the friendship blossoms! ~DarkEnergy Thank you for reading,“Believe in Force” ",
            "date": "Answered August 17, 2019",
            "views": "65",
            "upvotes": " View 53 Upvoters ",
            "upvoters": [
                {
                    "user_id": "M.S.M.Srivatsava",
                    "user_href": "/profile/M-S-M-Srivatsava"
                },
                {
                    "user_id": "Karan Sharma",
                    "user_href": "/profile/Karan-Sharma-1759"
                },
                {
                    "user_id": "Divesh Barathan",
                    "user_href": "/profile/Divesh-Barathan"
                },
                {
                    "user_id": "Roshan Antony",
                    "user_href": "/profile/Roshan-Antony-14"
                },
                {
                    "user_id": "Harika",
                    "user_href": "/profile/Harika-46"
                },
                {
                    "user_id": "Dhiraj Prabhaka Jadhav",
                    "user_href": "/profile/Dhiraj-Prabhaka-Jadhav"
                },
                {
                    "user_id": "Bhagyaraj Ydya",
                    "user_href": "/profile/Bhagyaraj-Ydya"
                },
                {
                    "user_id": "Devang Nayak",
                    "user_href": "/profile/Devang-Nayak-7"
                },
                {
                    "user_id": "Ram Gupta",
                    "user_href": "/profile/Ram-Gupta-446"
                },
                {
                    "user_id": "Script Ing",
                    "user_href": "/profile/Script-Ing"
                }
            ]
        }
    ]
}