{
    "title": "How does a writer decides how a character behaves in a given situation? - Quora",
    "tags": [
        "Fictional Characters",
        "Writers and Authors"
    ],
    "response": [
        {
            "author_info": {
                "name": "John Joss",
                "href": "/profile/John-Joss"
            },
            "answer_text": "One might prefer “how does a writer decide,” vs. “decides” as being slightly more grammatical. But, hey, grammar is . . . flexible. That said, once the writer has established the character and set him or her in motion, that character will behave ‘in character.’ If he or she is a thoughtful, intelligent and kind individual, he or she will behave accordingly. If another kind of person, expect appropriate reflexes. Leopards don’t change their spots. John Fowles once expressed himself as mystified by how his characters behaved, though he was writing their stories. They did what they had to do, he explained. This reflects some of the wonder and mystery of writing, in which ‘things happen’ beyond the writer’s control or understanding. But the behavior must be in character. Or, as I have explained it with an aphorism: “Habits create character, and character determines destiny.” Say it isn’t so, I dare you. ",
            "date": "Answered May 16, 2019",
            "views": "115",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Grace Abai",
                    "user_href": "/profile/Grace-Abai"
                }
            ]
        },
        {
            "author_info": {
                "name": "Ben Walker",
                "href": "/profile/Ben-Walker-358"
            },
            "answer_text": "In my experience, you take ages planning the character, then you choose the plot, then the character will be themselves in the given situation. THEN REWRITES. Just leaving it at the beginning means that you might be unfair to your characters. However, basically, character and plot should be interwoven and situation i.e. conflict is part of plot - so if you’re writing well the character behaves in the situation either based on the fact that they’ve caused the situation or they’ve ended up in the situation, then their mood will be informed by what kind of character they are. “It’s all my fault this is happening” - nervous, neurotic character, “This isn’t my fault” - stubborn, “Nice.” - arrogant. Then their mood should inform their actions. So nervous character might bite their nails, stubborn character might dig their feet into the ground and damage relationships with other characters and arrogant character might cause more situations for the fun of it. ",
            "date": "Answered May 17, 2019",
            "views": "59",
            "upvotes": "0"
        }
    ]
}