{
    "title": "How much weight can you lose in 30 days? - Quora",
    "tags": [
        "Weight Loss Techniques",
        "Body Weight"
    ],
    "response": [
        {
            "author_info": {
                "name": "Muhammad Saleem",
                "href": "/profile/Muhammad-Saleem-1018"
            },
            "answer_text": "My Friend you can easily lose 20 pounds in 30 days. We have been warned that losing weight quickly is not safe. This statement is actually not true. While there is some level of truth to this (there’s always an extreme to every situation), for the most part, this is false. How to Lose 20 Pounds In A Month Why? For one, losing weight slowly is a motivational killer, TRUST ME! Imagine this, you cut out all your favorite foods, drinks (alcohol for me), desserts, and now you have to start exercising consistently in addition to all this. Now you’ve reached the end of what seemed like the never-ending week only to find out you lost 1 POUND! YIKES! Wouldn’t you rather see 5 or 6 pounds knocked off the scale? Of course you would! Okay, okay. I’m done with my stories, and I will cover the main topic here for you, how to lose 20 pounds in a month. How To Lose 20 Pounds In A Month Tip #1. Carbohydrate Detox If you want to lose 20 pounds in 30 days, then make this your number one priority because it is THE MOST important one! Before I go into too much detail, you’re probably wondering what a carb detox is. It’s when you eliminate carbohydrates completely out for one week. WHAT? Yes, I did say seven days! I also did say this was a CHALLENGE. If it was easy, everybody would already be doing it. Let me assure you, it is possible. It’s challenging for sure. However, try comparing this to losing a family member, raising kids on your own, losing your job, or going through a divorce. Compared to that, detoxing from carbs for a week is a walk in the park. Ok, so then what would I eat for that week? Lean protein and leafy greens for the most part. Obviously, you would be detoxing from sugar as well (sugars are carbs). How To Lose 20 Pounds In A Month Tip #2. Incorporate Intermittent Fasting  I’ve discussed how important intermittent fasting is many times. I really can’t say it enough! Using this eating technique is an extremely beneficial way to help you lose weight. If you are unfamiliar with intermittent fasting, it’s simply an eating schedule where you go through periods of eating and fasting. The one I follow and recommend is the 16-8 method. You would simply eat for 8 hours, and fast for 16 hours. Here’s an example of a few ways to schedule this…  How To Lose 20 Pounds In A Month Tip #3. Eat Nutrient Dense Foods  This is just as important as the first tip. Another HUGE factor for helping you lose 20 pounds in 30 days. No matter how well you apply intermittent fasting or how active you are, it will all be for nothing if you aren’t eating correctly. Since you want to know how to lose 20 pounds in a month, this is going to be the lifeline to your success. Incorporating all of the necessary macronutrients is key! Having the right proteins, fats, and carbs (aka macros) in the right amounts is going to attribute to 80% of your weight loss. I assure you… If you want to lose this amount of weight in this short time frame.. Then pay attention carefully as I list these foods. We will start with protein first… Protein: · Lean Ground Beef · Salmon · Turkey · Chicken Breast · Eggs · Egg Whites · Tilapia · Tuna · Plant Based Protein Powder (low carb) · Non-Fat Greek Yogurt · Low-Fat Cottage Cheese · Hemp Seed Carbohydrates (Complex): · Sweet Potatoes · Yams · Brown Rice · Quinoa · Oats · Oatmeal · Wild Rice · Legumes Vegetables: · Spinach · Kale · Brussel Sprouts · Green Bell Peppers · Asparagus · Bok Choy · Onions · Celery · Romaine Lettuce · Artichoke · Arugula · Spaghetti Squash · Green Beans Fruits: · Apples · Strawberries · Blueberries · Raspberries · Kiwi · Banana · Watermelon · Grapes · Grapefruit Fats: · Avocado · Olive Oil · Coconut Oil · Peanuts · Almonds · Natural Peanut Butter · Natural Almond Butter · Fish Oil · Flaxseed Oil Whoah! That’s a lot to remember. If that wasn’t confusing enough, how am I supposed to know what to eat and how much? No worries, here’s a simple schedule for you to follow… Week 1: >30 Carbs per day Week 2: 50-75 Carbs per day w/ exercise incorporated Week 3: 75-125 Carbs per day w/ exercise incorporated Week 4: 75-125 Carbs per day w/ exercise incorporated Yes, you did see exercise on that list, so of course, the next step is going to be… 4. Exercise This such a broad statement… While exercise is not necessarily required, it is HIGHLY encouraged! Why? Just a reminder that if your end goal is wanting to know how to lose 20 pounds in a month, then you better listen up again. The majority of individuals who are capable of losing this kind of weight in that time frame without exercise… are also the ones who have a lot of weight to lose. That being said, I still would NEVER recommend excluding exercise from the picture. Regardless of your weight, it would be a mistake not to. The only situation I would say to put this idea to rest is if it is “NOT SAFE” for you to be exercising. In this situation, I would recommend walking in place of exercise. Anyways, enough with my rambling. I’ll finally get to the point and explain which forms of exercise you should be incorporating. Strength Training:  This is going to be one of the most beneficial forms of exercise you can include. Some of the many benefits strength training provides are… · A decrease in body fat · Improved body composition · Stronger bones and joints · Increased strength · Increase in muscle mass What I would recommend is a mix of HIIT and Upper/Lower Splits. Perhaps one week do a combination of full-body HIIT, and the next do upper and lower splits. (If HIIT is too dangerous, then just stick to upper lower split type of workout routines) Cardio: There are two different types of cardio you could incorporate… · LISS (Low-Intensity Steady State Cardio) · HIIT (High-Intensity Interval Training) Cardio. What’s the difference? An example of LISS would be to go on the elliptical for 30-45 minutes keeping a steady pace. During this cardio session, you would want to keep your heart rate high enough to burn body fat (using fat for energy). Just make sure it’s not too high where you would be tapping into carbohydrates for energy. HIIT on the other hand, you would be doing a much shorter cardio session. For example, you would start by sprinting on a treadmill or an elliptical for 30 seconds with 90% maximum effort, followed by 1-2 minutes of a decreased pace. You would repeat this for 4 rounds, 5 rounds, etc… The idea is to build yourself up. For beginners… I would recommend starting out with NO MORE than an 8 minute round and working your way up from there. Last but not least… 5. Proper Rest  I’m sure you’ve heard it before… You need to get around 8 hours of rest each night. The problem is, even though most people are aware of this, there is still a good chunk of them that still aren’t getting enough sleep. According to the CDC, 1 out of 3 Americans do not get enough rest Ok, but why is it so important to get proper rest? Well, you put yourself at risk for gaining weight. Lack of sleep also increases your appetite. This is because two of your key weight loss hormones (leptin and ghrelin) become unbalanced from improper sleep When you are putting yourself through a carbohydrate detox, the LAST THING you want is your appetite to increase. What’s going to end up happening is you are going to crave EVERYTHING but what you should be eating. Probably the most important one reason you need proper rest is so your body can heal after your workouts. Without proper rest, your muscles won’t recover adequately leading to potential injuries and muscle atrophy. The CDC recommends getting 7-9 hours of rest if you are 18 years or older. Bottom line, this is extremely important if you want to lose 20 pounds in 30 days, so make sure you get enough rest! ",
            "date": "Answered May 10, 2020",
            "views": "335",
            "upvotes": " View 69 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Anna Lehmann Dexter",
                    "user_href": "/profile/Anna-Lehmann-Dexter"
                },
                {
                    "user_id": "Ritika",
                    "user_href": "/profile/Ritika-157"
                },
                {
                    "user_id": "Lujeena Benomran",
                    "user_href": "/profile/Lujeena-Benomran-1"
                },
                {
                    "user_id": "Aniyah Williams",
                    "user_href": "/profile/Aniyah-Williams-4"
                },
                {
                    "user_id": "Cristien Holguin",
                    "user_href": "/profile/Cristien-Holguin"
                },
                {
                    "user_id": "Mani Tellagorla",
                    "user_href": "/profile/Mani-Tellagorla"
                },
                {
                    "user_id": "Nade Gaurav",
                    "user_href": "/profile/Nade-Gaurav"
                },
                {
                    "user_id": "Michaela Jones",
                    "user_href": "/profile/Michaela-Jones-139"
                },
                {
                    "user_id": "Maini Buragohain",
                    "user_href": "/profile/Maini-Buragohain-1"
                },
                {
                    "user_id": "Maansi Singh",
                    "user_href": "/profile/Maansi-Singh-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Tan Potong",
                "href": "/profile/Tan-Potong"
            },
            "answer_text": "You can lose between 15 - 20 pounds in 30 days. simple and easy ways? Yes,You can slash 15-20 pounds and still eat six times a day to Loss weight . Do you want to know these powerful secrets? Here are 7 proven tips to lose weight fast. You can use it right away, on a daily basis. I think it will really make a huge difference to your life if and when you apply the following: Follow these simple steps and your life will likely changed The 7 tips on weight loss fast naturally, Eating Habit: Only eat food that contain complex carbohydrates and lean protein at every meal. Food to be avoided are processed carbohydrates such as flour / white bread, fast food, pasta made from white flour, canned fruit with added sugar, pickles, and alcohol. They can make you gain weight because processed carbohydrates are easily stored as fat in the body.2. Exercise daily: -walk for at least 10 minutes a day. If you can, jog for 10 minutes a day It is even better than walking. When you walk, it is good to wear a proper walking shoe. Wear socks to take larger walking strides.Your target should be to exercise at least five times a week. Cardio exercises are the best work outs to do for a natural healthy weight loss. 3. Positive affirmations: Write out on a piece of paper 5 positive affirmations that will boost your confidence example:1) every day and in every way I am feeling more confidence\" 2) \"i am a size 14 and loving it\", 3) I am getting better in my eating habit 4. Reduce your Sugar intake: Reduce your daily sugar intake or find an alternative like honey, agave nectar, stevia, it will make a huge difference. 5. Reduce your processed food: Any food that’s processed is usually frozen canned dried, baked, or pasteurized. These are high in fat, sugar and salt and will cause excess weight gain. 6. Eat the Same type of foods and natural remedies that tribal Indians and our ancestors eat. They live obesity free and a healthy life. examples Oats or Bread with alternatives Eggs, Nuts, Avocado, Apple, Banana, Pineapple, Yam, Sweet Potato, Carrot, Guava ,Almond, Cashew Egg Plant with Chilli, Kiwi fruit 7. And take consistent action and see it through. To lose weight now you really need to be dedicated to your goal. Take consistent action and see it through If you need more information, please go to my profile page, Tan Potong : Natural Remedy for weight loss Cheerio until ",
            "date": "Answered February 7, 2020",
            "views": "101",
            "upvotes": " View 10 Upvoters",
            "upvoters": [
                {
                    "user_id": "Anna Lehmann Dexter",
                    "user_href": "/profile/Anna-Lehmann-Dexter"
                },
                {
                    "user_id": "Raashid Sayed",
                    "user_href": "/profile/Raashid-Sayed"
                },
                {
                    "user_id": "Maryam Gill",
                    "user_href": "/profile/Maryam-Gill-4"
                },
                {
                    "user_id": "Evelyn MS",
                    "user_href": "/profile/Evelyn-MS-1"
                },
                {
                    "user_id": "Aisy' Hash",
                    "user_href": "/profile/Aisy-Hash"
                },
                {
                    "user_id": "Cassie Doyle",
                    "user_href": "/profile/Cassie-Doyle-20"
                },
                {
                    "user_id": "Rupali Raut",
                    "user_href": "/profile/Rupali-Raut-3"
                },
                {
                    "user_id": "Da'Naisa Love",
                    "user_href": "/profile/DaNaisa-Love-1"
                },
                {
                    "user_id": "Noah Davis",
                    "user_href": "/profile/Noah-Davis-43"
                },
                {
                    "user_id": "Lisa Lackey",
                    "user_href": "/profile/Lisa-Lackey-10"
                }
            ]
        }
    ]
}