{
    "title": "How hard is it to learn to play the banjo? - Quora",
    "tags": [
        "Banjos",
        "Learning Music",
        "Learning to Play Musical Instruments",
        "Musical Instruments",
        "Learning New Things",
        "Learning"
    ],
    "response": [
        {
            "author_info": {
                "name": "Robert Johnston",
                "href": "/profile/Robert-Johnston-26"
            },
            "answer_text": "I had previously played guitar for 30 years and had tried ukulele, mandolin and various traditional instruments with pretty good results. Banjo may be somewhat unique in that your finger-picking sequences are so much more important and the first and fifth strings are pitched high, but I found that the “finger roll” picking sequences were easy to understand, and once you practice them they become quite workable and musical and your fingers just need time to adopt the methods. The left hand for banjo, compared to working a 6-string acoustic and doing complex songs, is far easier, so with banjo I found the focus soon becomes learning the finger picking. I also thought that with banjo the whole fretboard gets considered and used more than with guitar; your thinking with banjo is about riffs, effects, rhythm sequences and strumming, and the little riffs you make up can be found all over the fretboard. I personally consider the finger-picking (Scruggs style) approach very intriguing and inspiring, whereas clawhammer I find only useful for texture fill or rhythm work, the secondary fill sound, which is fine too; generally the banjo is either used as a strong lead sound or a backup texture in the mix, and the roles of banjo still need far more exploring, if you ask me. To think that the banjo can only be played in Scruggs or clawhammer styles, is just closed-minded. I also think the banjo is too often constructed to sound too brittle, high-tension and tinny. I had a banjo made of mahogany, and though I would prefer one far better quality in strength and materials, I think the richer tone woods have a lot going for them, and while I understand the use of the metal tone ring on a banjo, there’s a lot to be said for bringing out a far richer tonal texture on the instrument (than many of the high price, high-tension models), and construction methods and materials need to be considered. In short, banjo is NOT hard to learn or play, it’s fun, it will lure you in. ",
            "date": "Answered July 15, 2016",
            "views": "42",
            "upvotes": " View 8 Upvoters",
            "upvoters": [
                {
                    "user_id": "Be Strong Tuhin",
                    "user_href": "/profile/Be-Strong-Tuhin"
                },
                {
                    "user_id": "Richard Bachert",
                    "user_href": "/profile/Richard-Bachert-1"
                },
                {
                    "user_id": "Dave Gilbert",
                    "user_href": "/profile/Dave-Gilbert-12"
                },
                {
                    "user_id": "Coylynne Daems",
                    "user_href": "/profile/Coylynne-Daems-1"
                },
                {
                    "user_id": "Christopher Worth",
                    "user_href": "/profile/Christopher-Worth-4"
                },
                {
                    "user_id": "Tessa Enright",
                    "user_href": "/profile/Tessa-Enright"
                },
                {
                    "user_id": "AR Adams",
                    "user_href": "/profile/AR-Adams-1"
                },
                {
                    "user_id": "Lorri Robinson",
                    "user_href": "/profile/Lorri-Robinson"
                }
            ]
        },
        {
            "author_info": {
                "name": "Simon Phoenix",
                "href": "/profile/Simon-Phoenix-11"
            },
            "answer_text": "if you listen to Earl Scruggs as much as you play/learn it will go a lot easier for you. Learn by ear and you’ll progress 100x faster. Slow down those old recordings to excruciatingly low speeds and try to capture all those classic Scruggs breaks note for note. The banjo isn’t hard to learn, it just takes time and practice. If you pace yourself, while setting goals and not taking 10 years to master it(instead maybe 5), you’ll find it to be one of the most rewarding experiences you’ve ever had. Focus on Earl and only Earl for your first two years of playing, I don’t care how fast you progress. If you want to be good you’ll listen to me. Because if you try doing all the fancy stuff(which in my opinion takes less talent and is a lot more methodical and melodic) to early you’ll find your timing starting to slip. Establish that Earl groove as early in your playing as you can. Again slow down the recordings and match his timing, try to feel the beat before you even pick up the instrument. As stated before it’s not hard, it just takes time. It really depends on the person and how passionate you are about the music. ",
            "date": "Answered October 8, 2018",
            "views": "680",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Justin Scotti",
                    "user_href": "/profile/Justin-Scotti-1"
                },
                {
                    "user_id": "Kaelan Dreyer",
                    "user_href": "/profile/Kaelan-Dreyer"
                }
            ]
        }
    ]
}