{
    "title": "How long does it take to write a 500 page novel? - Quora",
    "tags": [
        "Novel Writing",
        "Creative Writing",
        "Novels",
        "Writing Advice"
    ],
    "response": [
        {
            "author_info": {
                "name": "Michael Dellert",
                "href": "/profile/Michael-Dellert"
            },
            "answer_text": "For the sake of a baseline, let’s assume the following: You type 40 words per minuteYou are financially independent and have no need to spend 8–12 hours per day struggling to stay on the right side of debt-slavery.A standard manuscript page is 250 words.A 500 page manuscript is 125,000 words.So: 40wpm x 60 minutes per hour x 8 hours per day = 19,200 words per day. 125,000 words / 19200 words per day = 6.510416666666667 days. About a week. Of course, it’s unlikely that’s a good novel…. The point is, it takes as long as you have time, discipline, and energy to work on it. I’ve “won” NaNoWriMo by writing a ~75000 word novel in 30 days. I’ve written two other novels in 90 days. Recently, I wrote a 65k novel in about 2 weeks. I made the time, planned how many words I needed to write each day and each hour of the time I gave myself to reach the overall goal I set for myself. I didn’t wait for inspiration to strike. I sat down and worked at it. You can too. ",
            "date": "Answered October 4, 2018",
            "views": "49",
            "upvotes": " View 20 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Joel Harris",
                    "user_href": "/profile/Joel-Harris-36"
                },
                {
                    "user_id": "Jordan Sobranie",
                    "user_href": "/profile/Jordan-Sobranie"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/Ifan-7"
                },
                {
                    "user_id": "Akhil Gupta",
                    "user_href": "/profile/Akhil-Gupta-198"
                },
                {
                    "user_id": "Valentin Eni",
                    "user_href": "/profile/Valentin-Eni"
                },
                {
                    "user_id": "Elijah Taylor",
                    "user_href": "/profile/Elijah-Taylor-70"
                },
                {
                    "user_id": "Catharine Bramkamp",
                    "user_href": "/profile/Catharine-Bramkamp"
                },
                {
                    "user_id": "Ashish Gupta",
                    "user_href": "/profile/Ashish-Gupta-2357"
                },
                {
                    "user_id": "Elisabeth MacDonald",
                    "user_href": "/profile/Elisabeth-MacDonald-3"
                },
                {
                    "user_id": "Amanda Pierre- Louis",
                    "user_href": "/profile/Amanda-Pierre-Louis-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Drew Mendelson",
                "href": "/profile/Drew-Mendelson"
            },
            "answer_text": "Wow! A great question? Wish I had a great answer. On the quick side, I guess a fast writer could produce 1,000 words a day. Meaning you could finish a first draft in 6 months given some down time. That doesn’t account for planning, research, editing and rewriting. So maybe a clean draft in a year. I’d still say that would be fast. My first novel took about a year and a half for 350 pages. My second was serialized once a week for a year (a great experience for a writer). My third, a Vietnam War novel, took some 30 years of on and off writing, throwing drafts out and revising, etc. The final draft, 550 pages, took 2 years. I’d guess an average of three years for 500 pages for a final draft. My second Vietnam War novel took about 2 1/2 years for 500 pages. Others may have had very different experiences. ",
            "date": "Answered October 4, 2018",
            "views": "284",
            "upvotes": " Answer requested by Adam Dinofa"
        }
    ]
}