{
    "title": "How to teach English for beginners - Quora",
    "tags": [
        "Teaching English as a Foreign Language (TEFL)",
        "English as a Second Language (ESL)",
        "Learning English",
        "Teaching"
    ],
    "response": [
        {
            "author_info": {
                "name": "Shambhu Nath Roy",
                "href": "/profile/Shambhu-Nath-Roy-3"
            },
            "answer_text": "Use Merriam Webster online Dictionary and Thesaurus, which has an audio providing the pronunciation also. Or any other. Word Power Made Easy by Norman Lewis can also help build your vocabulary. Listening well and reading intently are the first steps in good oral and written communication. Build your knowledge of grammar (Wren & Martin), syntax, vocabulary and so on. Before you use a particular word, say beautiful, check the online thesaurus for synonyms and use the most appropriate word. Vocabulary is built brick by brick. So learning one new word leads to learning many others. Check the exact meaning of every new word from the dictionary, instead of trying to guess the meaning from its context. Read a lot of good authors. Listen to a lot of good speakers. Yet, in either case, develop your own unique style. Write short speeches, memorize them, internalise them and deliver them before the mirror or a better speaker than you. Practice makes perfect. Join a local Toastmasters Club or other public speaking club. Standing Ovation - Fifteen speeches to steer the budding orator by Sterling Publishers on Amazon will be a great help. ",
            "date": "Answered June 2, 2018",
            "views": "152",
            "upvotes": " View 2 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Om Prakash Das",
                    "user_href": "/profile/Om-Prakash-Das-5"
                },
                {
                    "user_id": "Kundan Thakur",
                    "user_href": "/profile/Kundan-Thakur-56"
                }
            ]
        },
        {
            "author_info": {
                "name": "Narinder Walia",
                "href": "/profile/Narinder-Walia-4"
            },
            "answer_text": "Ask all the beginners to write one sentence each in their mother tongue. Ask one beginner to speak out his sentence and all others to write that sentence in their notebooks. Make the English of that sentence and tell all to write in their note book. Do the same for all others. Then ask all to memorize the English of their own sentence. Tell them to close their notebooks. Now point out to anyone beginner to speak out their sentence first in their own language and in English loudly. Tell them to remember these sentences . Next day ask one to say his sentence in the mother tongue and then say those who know its English raise their hands . Ask one of them to tell the English. If correct, say ok . Ask others until correct English comes up. If not ask the student whose sentence it was Education is from known + a little unknown. Go on adding. ",
            "date": "Answered June 2, 2018",
            "views": "141",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Kundan Thakur",
                    "user_href": "/profile/Kundan-Thakur-56"
                }
            ]
        }
    ]
}