{
    "title": "How do l tell a book of legal copy from an infringing copy? - Quora",
    "tags": [
        "Book Publishing",
        "Copyright Infringement",
        "Copyright Law"
    ],
    "response": [
        {
            "author_info": {
                "name": "Sunil Keesara",
                "href": "/profile/Sunil-Keesara"
            },
            "answer_text": "Pirated books are SHOT from original books in the same way as Pirated movie is made. hence the content ,TEXT and Pictures are blur and unsharp, sometimes even broken edges. if you observe carefully you will also find lot of specs (black dots) around text matter. Ink Density (light or dark) would vary for every page and text fonts seem to be getting thicker or thin. Paper quality in general would be poor and ink might SET-OFF because of poor drying/absorbing property of paper. Cover of the book would also be of Low Resolution and if you observe the SPINE of the book ( edge where pages are bound) the design would be MISALIGNED with actual thickness of book. This would happen because of difference in thickness of paper used in original book and pirated book. Now a days most of the publishers are using HOLOGRAM stickers on book covers to authenticate the originality. Check for this hologram and if you are buying from book shop insist for an invoice. If you find a pirated copy, try to contact the publisher with a copy of the same and place of purchase. Most of the publishers do reward the customers with gratis copies for such useful information. i did it few times!!! Respect Copyright, Eliminate Piracy. ",
            "date": "Answered April 1, 2019",
            "views": "97",
            "upvotes": " View 26 Upvoters",
            "upvoters": [
                {
                    "user_id": "Pranil Guroda",
                    "user_href": "/profile/Pranil-Guroda"
                },
                {
                    "user_id": "Souvik Pati",
                    "user_href": "/profile/Souvik-Pati-4"
                },
                {
                    "user_id": "Madhuri Kankipati",
                    "user_href": "/profile/Madhuri-Kankipati"
                },
                {
                    "user_id": "Nidarshana Gohain (নিদৰ্শনা)",
                    "user_href": "/profile/Nidarshana-Gohain-নিদৰ্শনা"
                },
                {
                    "user_id": "Yash Negi",
                    "user_href": "/profile/Yash-Negi-23"
                },
                {
                    "user_id": "Yashu Singh",
                    "user_href": "/profile/Yashu-Singh-66"
                },
                {
                    "user_id": "Avik Sadhukhan",
                    "user_href": "/profile/Avik-Sadhukhan-7"
                },
                {
                    "user_id": "Reena Sharma's Recipies",
                    "user_href": "/profile/Reena-Sharmas-Recipies"
                },
                {
                    "user_id": "Red Hat",
                    "user_href": "/profile/Red-Hat-50"
                },
                {
                    "user_id": "Rahul Pant",
                    "user_href": "/profile/Rahul-Pant-51"
                }
            ]
        },
        {
            "author_info": {
                "name": "Cliff Gilley",
                "href": "/profile/Cliff-Gilley"
            },
            "answer_text": "WIth regard to eBooks, the primary way to tell whether a book is a legal copy or an infringing copy is where you get it from.  If you didn't get it from a legitimate source, such as Amazon, iTunes, or some other established storefront, there's a high likelihood that the book is an infringing copy (yes, there are some authors who freely distribute their books, but they're the exception, not the rule - and the book likely indicates this somewhere in the file). As for print books, it's a significantly harder task - where there is a market for counterfeit or copied books, the value of those books is generally pretty high, and there is a large amount of effort and expertise used to \"duplicate\" these valueable books.  We're talking original copies of Don Quixote, not the latest Dan Brown tripe.  There really isn't a significant enough market for black-market print books of modern vintage to justify the expense that would be required to duplicate them. That said, you may wind up finding pre-release copies or library copies of books on the shelves of a used book store.  Technically, most of these are not licensed for resale, and explicitly say so within the book itself.  So, those would legally be infringing copies, though it's highly unlikely anyone would find such a copy and take you to court over it. ",
            "date": "Answered January 8, 2014",
            "views": "12",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Shdaolhi Shui",
                    "user_href": "/profile/Shdaolhi-Shui"
                }
            ]
        }
    ]
}