{
    "title": "How to find good books to read - Quora",
    "tags": [
        "Mindfulness",
        "Seeking Question",
        "Literature",
        "Reading",
        "Book Recommendations"
    ],
    "response": [
        {
            "author_info": {
                "name": "Rebekah Hancock",
                "href": "/profile/Rebekah-Hancock"
            },
            "answer_text": "I actually wrote a little bit about this in my latest blog post! There are some book recommendations alongside, so it might be a good place to start. On another note, though, the top way I find books to read is through online influencers. People recommending books through blog posts, YouTube videos or even Goodreads. I tend to follow people with similar book interests to my own, or people who’ll open me up to genres that I’ll end up enjoying even if I’ve not explored them before, so it works really well for me. However, there are other ways you can find book recommendations, too! Friends. Do you have friends that read? If so, asking what they’ve been reading lately might be a good idea. It’s actually how I ended up reading Diane Chamberlain books, after my friend let me borrow the first in a series and then bought me another for Easter.Family. My mum loves a good book. We have very different tastes in books for the most part, but she’s bought me a few books that I’ve really ended up enjoying. It might be worth starting a conversation with someone in your family if you know they have an interest in books, too.Other students/work colleagues. Do you work in an office, or attend a school with other students? Start up a conversation about books. As a bonus, this might also help you make friends, expanding your social circle even more than it already has been!Online forums. I know I’ve always mentioned social media platforms and blogging, but other platforms are a great way of searching for books you’re interested in. Reddit’s a great place for this—go to a thread based on your interests, ask for related book recommendations and bam! You’ll have plenty in no time.I hope these help! ",
            "date": "Answered April 15, 2018",
            "views": "531",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Vaishnu Nair",
                    "user_href": "/profile/Vaishnu-Nair"
                },
                {
                    "user_id": "Gareth Greetham",
                    "user_href": "/profile/Gareth-Greetham"
                }
            ]
        },
        {
            "author_info": {
                "name": "Billie Willis",
                "href": "/profile/Billie-Willis-5"
            },
            "answer_text": "I actually wrote a little bit about this in my latest blog post! There are some book recommendations alongside, so it might be a good place to start. On another note, though, the most notable way I discover publications to read through is through internet based influencers. Folks recommending books through websites, YouTube movies as well as Goodreads. I usually follow people who have similar book passions to my own, or men and women who’ll start me to styles that I’ll wind up enjoying even though I’ve perhaps not explored them prior to, so it works effectively in my situation. However, there are some other ways you can get a hold of guide guidelines, also! Friends. Do you have friends that read? If so, asking what they’ve been reading lately might be a good idea. It’s actually how I ended up reading Diane Chamberlain books, after my friend let me borrow the first in a series and then bought me another for Easter.Family. My mum loves a good book. We have very different tastes in books for the most part, but she’s bought me a few books that I’ve really ended up enjoying. It might be worth starting a conversation with someone in your family if you know they have an interest in books, too.Other students/work colleagues. Do you work in an office, or attend a school with other students? Start up a conversation about books. As a bonus, this might also help you make friends, expanding your social circle even more than it already has been!Online forums. I know I’ve always mentioned social media platforms and blogging, but other platforms are a great way of searching for books you’re interested in. Reddit’s a great place for this—go to a thread based on your interests, ask for related book recommendations and bam! You’ll have plenty in no time.I hope these assistance! ",
            "date": "Answered March 20, 2020",
            "views": "227",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Ramona Edwards",
                    "user_href": "/profile/Ramona-Edwards-10"
                },
                {
                    "user_id": "Janice Meyer",
                    "user_href": "/profile/Janice-Meyer-6"
                }
            ]
        }
    ]
}