{
    "title": "How to take good notes in the University class from a textbook and during lectures - Quora",
    "tags": [
        "Lecturers",
        "Study Strategies",
        "Note Taking",
        "Lectures",
        "Notes"
    ],
    "response": [
        {
            "author_info": {
                "name": "Michelle Wallace",
                "href": "/profile/Michelle-Wallace-6"
            },
            "answer_text": "Note: I wrote this as answer to another question, but I don't know how to link previous answers so copy and paste it is! It still applies nicely to you.Quora Answer for Studying/Test Taking I don't think you realize there is actually a class for this type of thing. It's named College Learning Methods at my school, I'd say ask a counselor what it is at your school. In that class you to learn more information when reading(THIS, GO), take better notes over written things like textbooks, (TRAPS), take better listening/lectures notes, (PLANS), and study all these notes you've taken better and review (RECAP).  T Read the title.H Read the HeadingI Read the introS Read the summary. G observe the Graphics (picures) and read their captionsO Read the objectives. T Turn the heading into a questionR Read a sectionA answer your previous question, ask a new oneP Put it into your notesS Summarize P Pay attention (to the lecture)L listen for cuesA associate information to previously learned info (probably from your text)N note systematicallyS summarize the lecture R review reading and lecture notes, and course materials.E Examine notes and materials for key information, integrate the  information.C check notes for answer to objective/review questionsA Ask yourself questions over notes, course materials and teacher questionsP Process answers to the questions. This class also teaches good test taking, though I don't know if there's an acronym for it. It basically sums to:1: Read all the directions on the test to best determine worth and the amount of time each question should take.2: Start wherever you feel most confident, then you can use those answers help you with other parts on the test, not to mention, get some points even if you're clueless on the rest of it.3: MUTLIPLE CHOICE: Read the question, read each answer, cross out as many as is needed until there are only two answer choices left, pick to the best of your ability the best answer, it may not be the only 'correct' answer, it may just have more details than the other one.4: Go over all your answers, but remember, DON'T CHANGE ANY ANSWER UNLESS THERE IS A REALLY GOOD REASON TO CHANGE IT. Your first answer is almost always the right one, at least until proven otherwise.5: Relax. No test will cause the end of the world, the worst thing that can happen will not kill anyone. Unless you're a doctor. ;)Good luck and have a nice day. :) ",
            "date": "Answered November 5, 2015",
            "views": "18",
            "upvotes": " View 7 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Vibha R Udupa",
                    "user_href": "/profile/Vibha-R-Udupa"
                },
                {
                    "user_id": "Abhishek Kisan",
                    "user_href": "/profile/Abhishek-Kisan"
                },
                {
                    "user_id": "Shagun Gupta",
                    "user_href": "/profile/Shagun-Gupta-141"
                },
                {
                    "user_id": "Anshika Singh",
                    "user_href": "/profile/Anshika-Singh-189"
                },
                {
                    "user_id": "Marisa Dasgupta",
                    "user_href": "/profile/Marisa-Dasgupta"
                },
                {
                    "user_id": "Shreya Purohit",
                    "user_href": "/profile/Shreya-Purohit-4"
                },
                {
                    "user_id": "Paul Robinson",
                    "user_href": "/profile/Paul-Robinson-107"
                }
            ]
        },
        {
            "author_info": {
                "name": "Sandra Kpodar",
                "href": "/profile/Sandra-Kpodar"
            },
            "answer_text": "There are quite a few strategies available, but here are the ones you could start with:  Only write down the titles of the lecture/class. You'll have an outline that you will be able to add information to later on.Write down keywords - do not try to write down every single word your teacher says.Try to rephrase what you've understood in short sentencesAdd a star next to what is important (keywords) and a question mark next to what you will need to research after the lecture/class e.g. unclear points. Of course, asking questions during a class is also an effective way of checking your understanding and clarifying concepts. If there are many questions you could save them for after the lesson and ask them to your teacher. But, even after getting answers from your teacher, researching key aspects of your lessons would be a good way of adding to your lesson and remembering what you covered in class. Reviewing regularly is the best way to remember.You could also try the Cornell notes format. It's a method that requires you to use keywords on one side, then short explanations on the other  and write a summary at the bottom. (For more about it check out: The Learning Toolbox - Cornell Notes)If you get a handout, use it as a map and fill in the gaps with personal research: possibly answering some or all of these questions: Who? What? Why? When? How?If you have any trouble during the lesson (to keep up with the pace) you could also ask your teacher if next time you could record the class (as an audio file). Note: I started writing this answer thinking of a student who might just need tips, but if you find any of the tasks difficult to complete, please speak to your learning support person, and I'm sure they will make special arrangements. You might also find this page useful: The Learning Toolbox - Site Map. More strategies for effective study are available. I hope this helps. ",
            "date": "Updated August 1, 2013",
            "views": "36",
            "upvotes": " View 8 Upvoters",
            "upvoters": [
                {
                    "user_id": "Indira Dasgupta",
                    "user_href": "/profile/Indira-Dasgupta-1"
                },
                {
                    "user_id": "ICSE Helper",
                    "user_href": "/profile/ICSE-Helper"
                },
                {
                    "user_id": "Zhen Wei",
                    "user_href": "/profile/Zhen-Wei-31"
                },
                {
                    "user_id": "Rutuja Jadhav",
                    "user_href": "/profile/Rutuja-Jadhav-11"
                },
                {
                    "user_id": "Razia Hassan",
                    "user_href": "/profile/Razia-Hassan-9"
                },
                {
                    "user_id": "Malvika Marndi",
                    "user_href": "/profile/Malvika-Marndi-1"
                },
                {
                    "user_id": "Dave Cheng",
                    "user_href": "/profile/Dave-Cheng"
                },
                {
                    "user_id": "Jimena Ruiz",
                    "user_href": "/profile/Jimena-Ruiz-1"
                }
            ]
        }
    ]
}