{
    "title": "How to read 1 book a month - Quora",
    "tags": [
        "Reading",
        "Book Recommendations"
    ],
    "response": [
        {
            "author_info": {
                "name": "Lostinmyjourney",
                "href": "/profile/Lostinmyjourney"
            },
            "answer_text": "Following are some of the easy steps 1.Count pages of your selected book. 2. Divide number of pages of your book with 30 or 31 (depending on the number of days in that particular month) For example if your selected book has 300 pages and you want to read it in June month thus June has 30 days so 300/30= 10 so that means 10 pages per day 3.Now mark dates on the pages . For example. Mark 1 on first 10 pages and 2 on next 10 pages . 4. Thus your entire book will be divided into 30 days 5. Stick to your resolution and strictly read 10 pages each day ,only by following this you will be able to read 1 book per month. You can do this before going to bed. So you'll be relaxed and calm before going to sleep .Also it will help you to get rid of all the thoughts and tensions of all the day. Thus you'll be refreshed before falling asleep. ",
            "date": "Answered November 29, 2018",
            "views": "968",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Jonathan Henshaw",
                    "user_href": "/profile/Jonathan-Henshaw-3"
                },
                {
                    "user_id": "Melinda Martin",
                    "user_href": "/profile/Melinda-Martin-69"
                }
            ]
        },
        {
            "author_info": {
                "name": "Shreya Ganguly",
                "href": "/profile/Shreya-Ganguly-21"
            },
            "answer_text": "If you read a book a month, you will be reading 12 books in a year. It’s quite easy to finish reading a book in a month. One month is equal to 30 days or 4.5 weeks, which is plenty of time to read a book. You can read a book in 1–3 weeks if you want to. If you read interesting material, you will be a lot more likely to finish reading the book quickly. It is also important to read outside of your favorite genre to broaden your horizons once in a while. Create a reading schedule. Dedicate to reading a certain amount of chapters or pages per day. Set realistic goals that you can achieve. ",
            "date": "Answered December 15, 2018",
            "views": "546",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Robert Esposito",
                "href": "/profile/Robert-Esposito-7"
            },
            "answer_text": "How can I read 1 book a month?  A humble, but clear measurement can give you an idea. paperback novel, say 300 pages at 250 words per page, reading at a slow rate of one page a minute. Obviously 300 minutes, or five hours. You can do that in a day, working full time, not missing a meal, a shower or other ablutions and still catch the ten o’clock news and Steve Colbert before bed. ",
            "date": "Answered December 2, 2018",
            "views": "305",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Melinda Martin",
                    "user_href": "/profile/Melinda-Martin-69"
                }
            ]
        },
        {
            "author_info": {
                "name": "Hina Kaleem Khan",
                "href": "/profile/Hina-Kaleem-Khan"
            },
            "answer_text": "By making a plan. Count the number of pages, divide it by the number of days available ( deduct at least three days from them, just for cases when you don’t feel like reading at all) and just start reading with consistency. Consistency is the key. Besides, the book should be interesting and should match your interests, for e.g whether you like non-fiction, if yes then what genre in non-fiction and so on. ",
            "date": "Answered November 27, 2018",
            "views": "379",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Azna",
                    "user_href": "/profile/Azna"
                },
                {
                    "user_id": "Nelson Rodrigues",
                    "user_href": "/profile/Nelson-Rodrigues-30"
                }
            ]
        },
        {
            "author_info": {
                "name": "Danni O'Lenci",
                "href": "/profile/Danni-OLenci"
            },
            "answer_text": "Just go for it! Work around your schedule and see when you have free time. Read while you eat (unless you’re on a date or with people, then be courteous), read before bed, read when you wake up, read on the train to work, read on your break. You’d be surprised how far you can get with even just a chapter or two a day. Set goals and keep it up as best you can. ",
            "date": "Answered November 27, 2018",
            "views": "278",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Abhirami T",
                "href": "/profile/Abhirami-T-2"
            },
            "answer_text": "Read exciting books. You will be able to read it within days because you will be into it and will continue reading for long time. If your issue is you finish books too early then go for subjects not of your interest. You will take a month or more to finish it. ",
            "date": "Answered November 29, 2018",
            "views": "120",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Sergey Gut",
                "href": "/profile/Sergey-Gut"
            },
            "answer_text": "I use some simple rules. When I wake up I take a book and read 20 minutesI do the same at evening before bedTry to find audio version of book. If you have audio version you can listen a book when you are walking to the job.",
            "date": "Answered November 28, 2018",
            "views": "59",
            "upvotes": "0"
        }
    ]
}