{
    "title": "How to write a good sci-fi and action novel - Quora",
    "tags": [
        "Science Fiction Books",
        "Science Fiction (genre)",
        "Novels"
    ],
    "response": [
        {
            "author_info": {
                "name": "Tony K Boatright",
                "href": "/profile/Tony-K-Boatright"
            },
            "answer_text": "Any novel has certain basic requirements; a good plot, believable characters, twists to maintain interests and a good ending. What not to have is also important; Good grammar in the narrative, but not in the conversations. You want realistic conversations. “Can you gimmy that hammer.” No side stories left hanging or characters without a purpose. Read books by authors in the genre you want to write in for ideas on style, character development, plot twists, content, etc… Some writers are planner who have their story outlined in some form before they begin writing. Others are pantsers who write by the seat of their pants developing their story as they write. I believe at a minimum you must have an idea for your ending. A destination to keep your story on track. Finally, getting the story written is just the first step. You need to get it down to begin the real work, editing. This is where you novel is made. Cutting out often large chunks, rewriting scenes or chapters, altering the storyline, adding or deleting characters, clarifying and correcting the story to create a finished novel is done during multiple edits. Writing is real work. After writing a novel comes the business of selling your book. Do you try to get an agent, sell direct to a publisher or self publish? Once you publish, how active must you be in marketing your book? My advice is enjoy the writing. This is not a field where most people get rich or make a good living. The time invested in writing and editing is huge. So your motivation be writing is something you love doing. Then it is worth every moment. ",
            "date": "Answered January 9, 2018",
            "views": "255",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Justin Martin",
                    "user_href": "/profile/Justin-Martin-67"
                },
                {
                    "user_id": "Steve Sharp",
                    "user_href": "/profile/Steve-Sharp-29"
                },
                {
                    "user_id": "Andrea Miller",
                    "user_href": "/profile/Andrea-Miller-29"
                }
            ]
        }
    ]
}