{
    "title": "How to transfer books from one Kindle to another Kindle - Quora",
    "tags": [
        "Kindle Format (AZW)",
        "Kindle App (iOS)",
        "File Transfer",
        "Amazon Kindle (product)",
        "eBooks"
    ],
    "response": [
        {
            "author_info": {
                "name": "Daniel Nathan",
                "href": "/profile/Daniel-Nathan-26"
            },
            "answer_text": "Transfer ebooks from an old Kindle to a new Kindle Fire Step 1: Connect your old Kindle to your computer via USB. You will find your kindle device as a drive under \"My Computer\", Click it and open the drive. Step 2: There should be multiple folders. Open the folders and drag selected files from the Kindle and drop them into the computer's hard drive, transfer ebooks and other documents from the old Kindle to your computer. Step 3: Connect another Kindle to your computer via USB, then there will be a removable disk displaying in your computer, open it and transfer the documents those files copied from your old Kindle to the new one. For audio books please put them in the Kindle's \"Audible\" directory, and for normal books please place them in the \"Documents\" directory. To transfer purchased books: All your purchased Kindle booksa are stored in your account's Kindle Cloud, all you need to do is de-register your Amazon account in the old Kindle then re-register it on the new one. Go to the reading app, all the books you have ever purchased in Amazon Store will show up on your bookshelf. Share books between two Kindle devices registered with the same account Note of Caution: You are allowed to register your Amazon account on several Kindle devices, then your purchased books will not auto-sync to both of your Kindles, but only the later registered one, at the same time, those already downloaded books still remain in your old Kindle. For you newly purchased Amazon books, you can still control which device to sync the item to in the Manage Kindle page. Step 1: Register the second Kindle with the same account registered to the first one. Maybe you purchased a Kindle Touch before then get a new Kindle Fire HD, or your friend or family have got another Kindle and you want to share your purchased book to him/her. Never mind, in one word, it is possible to register your account in another Kindle and won't do much harm on your previous Kindle. After successful registration, please go to Amazon official site then navigate to \"Manage Your Content and Devices\" (Formerly \"Manage your Kindle\"). From \"Your Content\" you will see all your purchased files. Step 2: Click on \"Deliver\" button. From the new pop up window, you can see all your registered Kindle devices and apps, which means, although you can't auto-sync your purchased books to your old Kindle device anymore, but you can also manually deliver them to any of your registered device. Up by now, you have learnt how to transfer contents from an old Kindle device to a new one; and how to register on two Kindle devices with the same account and transfer purchased contents to them. But what if you are not convenient to share your account with anyone else but only some books? Yes you can lend them out,but you must sacrifice your own 15 reading days, which is not that satisfying. I have written several books on how to master your Kindle device. Check my profile ",
            "date": "Updated September 25, 2017",
            "views": "405",
            "upvotes": " View 7 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Jelte Feenstra",
                    "user_href": "/profile/Jelte-Feenstra"
                },
                {
                    "user_id": "Keith West",
                    "user_href": "/profile/Keith-West-37"
                },
                {
                    "user_id": "Cherie Shear",
                    "user_href": "/profile/Cherie-Shear"
                },
                {
                    "user_id": "Carmen Fitier",
                    "user_href": "/profile/Carmen-Fitier"
                },
                {
                    "user_id": "Kalisetty Srikanth",
                    "user_href": "/profile/Kalisetty-Srikanth"
                },
                {
                    "user_id": "Jacky Alen",
                    "user_href": "/profile/Jacky-Alen"
                },
                {
                    "user_id": "Zhou Jie",
                    "user_href": "/profile/Zhou-Jie-7"
                }
            ]
        },
        {
            "author_info": {
                "name": "Christabel Mattox",
                "href": "/profile/Christabel-Mattox"
            },
            "answer_text": "The first question to ask is, what can of kindle device are you using? Is it Paperwhite, HD Fire, Nook, or Kindle Voyage? In answering this question, I will refer to the device that you are transferring your book to as new kindle and the other one that you are transferring your book from as old kindle. Connect your Kindle Device to your Computer. Depending on your kindle that you have whether IPad or Iphone or PC, Click on the appropriate kindle and open it. Double click on the kindle. You will see a document over there. Copy the document and paste it on your desktop.  After doing that, connect your new kindle to the computer. Then paste the document in the new kindle. This document contains all the books that you have downloaded from amazon including Pdf and books from other online stores other than amazon. Once you click on paste in the new document, select replace. Disconnect your new kindle. Head over to amazon and hover your mouse over your account, a drop down menu appears. Click on Your content and Devices. It will display all your books on your kindle.  Select all of your books and click on Deliver. You will see your new kindle with its name as one of the options to be sent to. Select that device and send to it. When that has been done, turn on your new kindle device. Make sure that you are connected to a WIFI. Depending on the type of kindle device that you are using, click the menu option. In the Menu option, click on sync and check for items. All of your books will downloaded to your kindle device. Looking for more resources on this, check my profile. I am an author that write books on kindle device. You can check my profile for similar books on this topic. ",
            "date": "Updated December 27, 2017",
            "views": "20",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Zack Xu",
                    "user_href": "/profile/Zack-Xu-16"
                },
                {
                    "user_id": "Alison Mallard",
                    "user_href": "/profile/Alison-Mallard"
                }
            ]
        },
        {
            "author_info": {
                "name": "Dragi Raos",
                "href": "/profile/Dragi-Raos"
            },
            "answer_text": "If you are talking about books bought from Amazon or sent to your Amazon library via SendToKindle app or e-mail, forget about USB. Simply register your new Kindle to the same account, and you will see all your library content. Tap on a title (while your Kindle is connected to Internet via WiFi or 3G), and it will download almost instantly. You can also “send” them from Amazon’s MYK library and device management page (amazon.com/myk). There is no need to download more than you are currently reading - the books are not going anywhere from Amazon cloud. Most publishers allow their books to be downloaded to 6 Kindles simultaneously (some as few as two, many to unlimited number of Kindles). To “free up” one reading license, remove the book from one Kindle (through its UI) and sync. Copying via USB will not work for DRM protected content (most books sold by Amazon). Those books are encrypted at the time of download using a key derived from destination device serial number, and only the device it is intended for will be able to open it. So, download, don’t copy. You can copy non-DRM’ed content (usually from sources other than Amazon) via USB. But even then I find sending those books to my library at Amazon and later downloading them just like those I bought from Amazon more convenient. ",
            "date": "Answered February 24, 2018",
            "views": "283",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Eilis Ryan",
                    "user_href": "/profile/Eilis-Ryan-2"
                },
                {
                    "user_id": "Lulu Li",
                    "user_href": "/profile/Lulu-Li-28"
                },
                {
                    "user_id": "Max Viduszynski",
                    "user_href": "/profile/Max-Viduszynski"
                },
                {
                    "user_id": "Reba Schneider",
                    "user_href": "/profile/Reba-Schneider-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Jo Roderick",
                "href": "/profile/Jo-Roderick"
            },
            "answer_text": "Another way you can transfer your books to another Kindle is to go to your Amazon dashboard and make them all available on your new device. You can also make them available in Amazon's 'Cloud' reading section.  Add your new device in under 'Your Devices'.  It's a bit of a nuisance because you have to do this in blocks of 10. There may be another way, but not that I am aware of.  Click on the [ ... ] and synchronise them to your new device. The easiest way by far is to connect your Kindle to a PC and copy your data to the new device. There are other answers already posted that provide clear instruction on how to do this. ",
            "date": "Answered January 23, 2016",
            "views": "691",
            "upvotes": " View 23 Upvoters",
            "upvoters": [
                {
                    "user_id": "Lulu Li",
                    "user_href": "/profile/Lulu-Li-28"
                },
                {
                    "user_id": "Jimmy Chauhan",
                    "user_href": "/profile/Jimmy-Chauhan-2"
                },
                {
                    "user_id": "Sophia S",
                    "user_href": "/profile/Sophia-S-176"
                },
                {
                    "user_id": "Roopa Gayatri Pabolu",
                    "user_href": "/profile/Roopa-Gayatri-Pabolu"
                },
                {
                    "user_id": "Skafe Jones",
                    "user_href": "/profile/Skafe-Jones"
                },
                {
                    "user_id": "Racs D",
                    "user_href": "/profile/Racs-D"
                },
                {
                    "user_id": "Mushtaq Shaikh",
                    "user_href": "/profile/Mushtaq-Shaikh-19"
                },
                {
                    "user_id": "Will Wister",
                    "user_href": "/profile/Will-Wister"
                },
                {
                    "user_id": "Tyron Shorsten",
                    "user_href": "/profile/Tyron-Shorsten"
                },
                {
                    "user_id": "Sally Lasinga",
                    "user_href": "/profile/Sally-Lasinga"
                },
                {
                    "user_id": "Roger Roland",
                    "user_href": "/profile/Roger-Roland-4"
                },
                {
                    "user_id": "Quincy Tuacker",
                    "user_href": "/profile/Quincy-Tuacker"
                },
                {
                    "user_id": "Paul Entzel",
                    "user_href": "/profile/Paul-Entzel"
                },
                {
                    "user_id": "Ramona Nunes",
                    "user_href": "/profile/Ramona-Nunes"
                },
                {
                    "user_id": "Harriet Hontus",
                    "user_href": "/profile/Harriet-Hontus"
                },
                {
                    "user_id": "Manuel Mont",
                    "user_href": "/profile/Manuel-Mont"
                },
                {
                    "user_id": "Lousie Legalle",
                    "user_href": "/profile/Lousie-Legalle"
                },
                {
                    "user_id": "Karl Branzel",
                    "user_href": "/profile/Karl-Branzel"
                },
                {
                    "user_id": "John Jenson",
                    "user_href": "/profile/John-Jenson-3"
                },
                {
                    "user_id": "Isabella Sacks",
                    "user_href": "/profile/Isabella-Sacks"
                },
                {
                    "user_id": "Evan Duarte",
                    "user_href": "/profile/Evan-Duarte"
                },
                {
                    "user_id": "Barry Larson",
                    "user_href": "/profile/Barry-Larson-1"
                },
                {
                    "user_id": "Abigail Anderson",
                    "user_href": "/profile/Abigail-Anderson-12"
                }
            ]
        },
        {
            "author_info": {
                "name": "Amby Jones",
                "href": "/profile/Amby-Jones"
            },
            "answer_text": "If your books are not bought from amazon, you can sync your kindle books from kindle to another one easily. Step 1.Connect your previous Kindle to computer via USB, and you will find a new hard drive in “My Computer”. Open the drive, use windows search function to find your files, next copy them into your computer. Step 2.Connect your new Kindle with computer via USB, you will find another hard drive in “My Computer”. Now you can copy your kindle books from your computer into the drive with just copy and paste, then these book will be saved in new kindle automatically. ",
            "date": "Answered November 11, 2014",
            "views": "203",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Mushtaq Shaikh",
                    "user_href": "/profile/Mushtaq-Shaikh-19"
                },
                {
                    "user_id": "Anna Spysz",
                    "user_href": "/profile/Anna-Spysz"
                }
            ]
        },
        {
            "author_info": {
                "name": "Micheal John",
                "href": "/profile/Micheal-John-113"
            },
            "answer_text": "Easy Steps to transfer books from one kindle to another:- First, Log in to the same Amazon account on both Kindles.Open Amazon in an internet browser.Hover over your name on the menu bar.Click Your Content and Devices on the menu.Select the books you want to move.Click the yellow Deliver button.Click the Devices Selected tab.Select the Kindle you want to transfer your files.",
            "date": "Answered November 14, 2019",
            "views": "962",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Brian Baulsom",
                "href": "/profile/Brian-Baulsom"
            },
            "answer_text": "I have Kindle paperwhite and Kindle fire. 1. I use Windows PC, but guess that AppleMac would be similar. We can transfer the same as any other files. When connected to a PC the Kindle comes up like another drive in Explorer, so we can copy files to our hard drive, and then connect the  other Kindle and transfer there. This also keeps a backup. 2. If ebooks have been purchased from the Kindle Store, we can register several devices and download from there. 3. Have a look at the free Calibre application that handles ebook files. calibre User Manual  ",
            "date": "Answered December 18, 2015",
            "views": "184",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Skafe Jones",
                    "user_href": "/profile/Skafe-Jones"
                },
                {
                    "user_id": "Francy Pereira",
                    "user_href": "/profile/Francy-Pereira"
                }
            ]
        },
        {
            "author_info": {
                "name": "Deborah Elliott",
                "href": "/profile/Deborah-Elliott-20"
            },
            "answer_text": "You don't transfer from one Kindle to another. You go to your accout online and then in the drop down menu choose Manage Content and Devices. Go to you library and you can send any books to any of your devices. ",
            "date": "Answered January 18, 2018",
            "views": "983",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Elizabeth",
                "href": "/profile/Elizabeth-180"
            },
            "answer_text": "you can use library on Amazon,then you share books between you and a family member. If you buy a second kindle, your books are automatic on because your library stays. ",
            "date": "Answered March 6, 2018",
            "views": "11",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Felix Shalu",
                "href": "/profile/Felix-Shalu"
            },
            "answer_text": "You can just copy the folder and the file of the book to you computer and paste it to the other device. ",
            "date": "Answered August 26, 2017",
            "views": "14",
            "upvotes": "0"
        }
    ]
}