{
    "title": "How is the book 'Think Like A Monk' a specialty? - Quora",
    "tags": [
        "Medical Specialties",
        "Monks",
        "Book Reviews",
        "Buddhism",
        "Spirituality",
        "Book Recommendations",
        "Books",
        "Religion"
    ],
    "response": [
        {
            "author_info": {
                "name": "Deepak Sharma",
                "href": "/profile/Deepak-Sharma-1746"
            },
            "answer_text": "If you have read a lot of self help books then, this book is not much different. But if you have recently started or have not gone through many self help books then you will find this book very helpful. I’ll give you some insights from the book - When you think of a monk do you think of a boring bald guy who has no taste of life? In fact Monks are the happiest people alive till date. Not Really, from a monk you can learn a lot including: -How to overcome negativity -How to stop overthinking -Why comparison kills love -How to use your fear -Why you can’t find happiness by looking for it -How to learn from everyone you meet -Why you are not your thoughts -How to find your purpose -Why kindness is crucial to success -And much more... The Author grew up in a family where you could become one of three things—a doctor, a lawyer, or a failure. His family was convinced he had chosen option three: instead of attending his college graduation ceremony, he headed to India to become a monk, to meditate every day for four to eight hours, and devote his life to helping others. After three years, one of his teachers told him that he would have more impact on the world if he left the monk’s path to share his experience and wisdom with others. Heavily in debt, and with no recognizable skills on his résumé, he moved back home in north London with his parents. In this inspiring, empowering book, Author draws on his time as a monk to show us how we can clear the roadblocks to our potential and power. Combining ancient wisdom and his own rich experiences in the ashram, Think Like a Monk reveals how to overcome negative thoughts and habits, and access the calm and purpose that lie within all of us. He transforms abstract lessons into advice and exercises we can all apply to reduce stress, improve relationships, and give the gifts we find in ourselves to the world. Author proves that everyone can—and should—think like a monk. I’ve explained it in much detailed manner in this video on my channel -  Thanks, Pls upvote if found useful. ",
            "date": "Answered October 2, 2020",
            "views": "49",
            "upvotes": " View 2 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Gauresh Chavan",
                    "user_href": "/profile/Gauresh-Chavan-1"
                },
                {
                    "user_id": "Nikhil Thakur",
                    "user_href": "/profile/Nikhil-Thakur-144"
                }
            ]
        },
        {
            "author_info": {
                "name": "Deepasha Sharma",
                "href": "/profile/Deepasha-Sharma-2"
            },
            "answer_text": " Think Like a Monk is a bomb book dude! I finished it a few days back! Probably this will be last self help book you'll ever need to read in your life. He has explained Macros like Identity, Negatively, Fear, Intention, Purpose, etc. Here are some of my favorite lines from the book: “The more we define ourselves in relation to the people around us, the more lost we are.”“When we accept the temporary nature of everything in our lives, we can feel gratitude for the good fortune of getting to borrow them for a time.”“Our identity is wrapped up in what others think of us—or, more accurately, what we think others think of us”“When you try to live your most authentic life, some of your relationships will be put in jeopardy. Losing them is a risk worth bearing; finding a way to keep them in your life is a challenge worth taking on.”“Remember, saying whatever we want, whenever we want, however we want, is not freedom. Real freedom is not feeling the need to say these things”“Fear motivates us. Sometimes it motivates us toward what we want, but sometimes, if we aren’t careful, it limits us with what we think will keep us safe.”“When we tune out the opinions, expectations, and obligations of the world around us, we begin to hear ourselves”“A layperson who is consciously aiming to be continuously alive in the Now is a monk.”“You can’t be anything you want. But you can be everything you are.”“Living intentionally means stepping back from external goals, letting go of outward definitions of success, and looking within.”“I am not who you think I am; I am not who I think I am; I am who I think you think I am” a quote by Cooley he has mentioned in his book.Awesome Book. It is worth giving a shot for sure. ",
            "date": "Answered October 24, 2020",
            "views": "33",
            "upvotes": " View 39 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Mahesh Gowda",
                    "user_href": "/profile/Mahesh-Gowda-426"
                },
                {
                    "user_id": "Abhishek Singh",
                    "user_href": "/profile/Abhishek-Singh-2192"
                },
                {
                    "user_id": "Nirmala gowda",
                    "user_href": "/profile/Nirmala-gowda-7"
                },
                {
                    "user_id": "Saumya Ranjan Nayak",
                    "user_href": "/profile/Saumya-Ranjan-Nayak-14"
                },
                {
                    "user_id": "Sanjot Mondal",
                    "user_href": "/profile/Sanjot-Mondal"
                },
                {
                    "user_id": "Vivekananda Reddy Kancham",
                    "user_href": "/profile/Vivekananda-Reddy-Kancham"
                },
                {
                    "user_id": "Apurv Sharma",
                    "user_href": "/profile/Apurv-Sharma-9"
                },
                {
                    "user_id": "Devang Mehta",
                    "user_href": "/profile/Devang-Mehta-113"
                },
                {
                    "user_id": "Pooja Patil",
                    "user_href": "/profile/Pooja-Patil-1406"
                },
                {
                    "user_id": "Manasadeepika",
                    "user_href": "/profile/Manasadeepika-1"
                }
            ]
        }
    ]
}