{
    "title": "How many books should a new author expect to sell their first month on Amazon if they self-published? - Quora",
    "tags": [
        "Self-Publishing",
        "Book Publishing",
        "Publishing",
        "Amazon.com (product)",
        "Writers and Authors",
        "Sales",
        "Amazon (company)",
        "E-Commerce"
    ],
    "response": [
        {
            "author_info": {
                "name": "Colleen Farrelly",
                "href": "/profile/Colleen-Farrelly-1"
            },
            "answer_text": "0, unless you pay for marketing. I’ve done okay with one of the novels (Phoenix Rising) I have on KDP, but it’s spotty at best. I had some initial sales and get a couple a month now. None of them make much, but it’s better than paying for the book to be printed and trying to break even. Most of my recognition as a writer comes from literary journals, rather than books. If it’s nonfiction, I’d highly recommend a publisher. I’m working under contract now on a popular science/tech book, and it’s a lot easier with a publisher and marketing team than on your own. The fun stuff will go on Amazon. The other stuff where I’m concerned about sales will go to a traditional publisher (and only ones affiliated with a major publisher). ",
            "date": "Answered July 11, 2019",
            "views": "989",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Terry Verduin",
                    "user_href": "/profile/Terry-Verduin-1"
                },
                {
                    "user_id": "Paul Le May",
                    "user_href": "/profile/Paul-Le-May"
                },
                {
                    "user_id": "Shashwata Samanta",
                    "user_href": "/profile/Shashwata-Samanta-1"
                },
                {
                    "user_id": "Peter Knutsen",
                    "user_href": "/profile/Peter-Knutsen-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Jim Murison",
                "href": "/profile/Jim-Murison"
            },
            "answer_text": "Kinda depends on two things, how big is your family and how large is your circle of friends. How many of them have you given a copy to already??? That is the reality of publishing your first novel. You will just have to wait like the rest of us and shit bricks until those first genuine reviews come in. Unless you have thousands of pounds to spend on a major advertising campaigns, then don’t hold your breath. It takes time. It takes reviews. My most popular title has 314 accumulated reviews across amazon and 665 ratings on goodreads, over 80% of those are four to five stars, that’s almost a thousand ratings. More than many mainstream authors get for a title, and I’m not mainstream, I still have to work a full time job to keep a roof over my head. You just keep going. One day hope that someone of note picks up your novel, reads it and gives you a good shout out. ",
            "date": "Answered July 13, 2019",
            "views": "828",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Terry Verduin",
                    "user_href": "/profile/Terry-Verduin-1"
                }
            ]
        }
    ]
}