{
    "title": "How does the per-page royalty to authors from Kindle Unlimited compare, on average, with the per-e-book royalty? - Quora",
    "tags": [
        "Ebooks, Kindle Unlimited",
        "Amazon Kindle Unlimited",
        "Amazon Kindle Direct Publishing",
        "Royalties",
        "eBook Readers",
        "Amazon Kindle (product)",
        "Royalty",
        "eBooks",
        "Writers and Authors",
        "Amazon (company)"
    ],
    "response": [
        {
            "author_info": {
                "name": "Rachel Caine",
                "href": "/profile/Rachel-Caine-3"
            },
            "answer_text": "I can only answer this conceptually; as an Amazon Publishing author (traditional publishing house operated by Amazon) I am in KU, but my contract specifies that instead of a percentage of the monthly “pot” of KU earnings, anyone who reads my book counts as a Kindle sale at the Kindle standard price for my royalties. So my situation’s a little different than most KU self-published authors. In general, as I understand it, the amount of earnings per month in KU gets split up by the number of reads each book got during that month. So it very much depends on how many subscribers there are to KU, and whether or not a KU author’s book is getting reads on a regular basis. Complication: there has been some gaming of the KU system by unscrupulous people (I don’t want to call them authors, that does honest authors a disservice) who put together “books” of random collections of things in public domain and put them out as actual books. There’s also a pretty well-known group who does nothing but trade the same books back and forth, transferring copyright to one another, but brings them out each month under a different author name and different cover. So. Scams abound on KU, reader beware. Unfortunately, as you might imagine, these barely-legal schemes suck up part of the pot with basically zero work put in on behalf of the authors, so that’s really unfair to other KU authors. Amazon’s aware of these issues, but I don’t know what fixes they’ve put in place to prevent this. KU also has an issue of not having a great (to date) reputation for quality works, but I think that’s starting to change. I hope so! That would lift everyone’s ability to earn through that medium. Even considering my longevity and reputation, I still get more from ebook sales than I do from KU reads, at least most months. Especially in release months. ",
            "date": "Answered January 30, 2020",
            "views": "134",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "David Lascelles",
                    "user_href": "/profile/David-Lascelles"
                }
            ]
        },
        {
            "author_info": {
                "name": "Earl Dingman",
                "href": "/profile/Earl-Dingman-1"
            },
            "answer_text": "Depends on the book and the per price. With my big books I make as much as if I were selling them for $4.99 with KU, however my price is generally 99 cents to $2.99 for ebook. So I make more with KU. If you CAN manage to sell your ebooks for $5.99 to $9.99 you will make more with direct selling than with KU in most instances, but it is harder to sell a book at $5.99 and almost impossible at $9.99 because that’s the price that books by Patterson, Grisham and King sell at. So you are now competing with the big boys and the big publishers with your little, unknown, untested self-published book. You also have to remember that KU people are getting your book FOR FREE to read, so that’s even more attractive than 99 cents. So, for the self-published author KU is usually where all the big money is found. I find my KU to eBook sales ratio to be at least 10:1 KU is NO FAULT reader insurance. Pick the book off the new release list and try it out for a chapter or two. You don’t like it, delete it and get another book. No refunds needed. And the writer gets paid for the two chapters you read! Not a lot, maybe only 65 cents, but that’s better than a poke in the eye and it’s actually MORE than if it sold for 99 cents as the author only gets 34! ",
            "date": "Answered February 18, 2020",
            "views": "51",
            "upvotes": " Answer requested by Amy Alkon"
        }
    ]
}