{
    "title": "How harmful is the Kindle for the eyes compared to the iPad? - Quora",
    "tags": [
        "Amazon Kindle (product)"
    ],
    "response": [
        {
            "author_info": {
                "name": "Amol Mishra",
                "href": "/profile/Amol-Mishra-23"
            },
            "answer_text": "Correction! ‘How harmful is the iPad for eyes compared to Kindle?’. Amazon kindle is one great product for reading, with no harm to eyes. Its unique electronic ink, in short, e-ink tech. gives a very much feel of an ordinary b & w paper. Thus, it provides a great ease to eyes, and its the e-ink tech. that makes Kindle easy to read, even in the bright sunlight. But nowadays a new breed of Kindle called the Kindle paper-white, which is backlit, allows you to read even in dark. I don’t know much about Kindle paper-white, but I can say, having a backlit might create a little strain in your eyes, especially if you’re reading in dark or poorly lit conditions. Coming to iPad, there is still lot of debate on what is good as a e-reader? An iPad or Kindle. Well! Its upto you. If you’re an avid reader and don’t like distractions while reading, and (most important) does hours and hours of breakfree reading, then Amazon Kindle is your device. iPads have a backlit LED display, so undoubtedly, iPads aren’t that good for hours of reading, but, if you like reading, doing a little Google and bit of typing, simultaneously, iPads are just too good! ",
            "date": "Answered February 24, 2018",
            "views": "384",
            "upvotes": " View 22 Upvoters",
            "upvoters": [
                {
                    "user_id": "Arpit Srivastava",
                    "user_href": "/profile/Arpit-Srivastava-172"
                },
                {
                    "user_id": "Sandeep Menon",
                    "user_href": "/profile/Sandeep-Menon-25"
                },
                {
                    "user_id": "Constantin Marin",
                    "user_href": "/profile/Constantin-Marin-3"
                },
                {
                    "user_id": "Parth More",
                    "user_href": "/profile/Parth-More-3"
                },
                {
                    "user_id": "Esha Saxena",
                    "user_href": "/profile/Esha-Saxena-5"
                },
                {
                    "user_id": "Darijan Trstenjak",
                    "user_href": "/profile/Darijan-Trstenjak"
                },
                {
                    "user_id": "Iswar",
                    "user_href": "/profile/Iswar-6"
                },
                {
                    "user_id": "Shriramparth .",
                    "user_href": "/profile/Shriramparth"
                },
                {
                    "user_id": "Kevin Rodriguez",
                    "user_href": "/profile/Kevin-Rodriguez-473"
                },
                {
                    "user_id": "Junior Galt",
                    "user_href": "/profile/Junior-Galt"
                }
            ]
        },
        {
            "author_info": {
                "name": "Shirley Atkins",
                "href": "/profile/Shirley-Atkins-8"
            },
            "answer_text": "It depends on the Kindle model you have. The models that are not “back lit” (regular Kindle and Kindle Paperwhite) which use “e-ink” technology are probably much better for your eyes, and some studies say that readers using reflected light rather than back-lit light retain more of what they read. If you are using a Kindlefire, or other LCD screen that is lit from behind, it is probably not much different than using an iPad. Of course, attempting to read a regular Kindle in the darkness would not be good for your eyes, but the Paperwhite comes with its own “front light” for reading in dark areas, and the amount of light can be controlled. Looking at iPads and Kindle Fires with their back-lit LCD displays would be just like staring at a computer all day. ",
            "date": "Answered March 2, 2018",
            "views": "136",
            "upvotes": " View 5 Upvoters",
            "upvoters": [
                {
                    "user_id": "Melissa Tan",
                    "user_href": "/profile/Melissa-Tan-187"
                },
                {
                    "user_id": "Darijan Trstenjak",
                    "user_href": "/profile/Darijan-Trstenjak"
                },
                {
                    "user_id": "Layla Husain",
                    "user_href": "/profile/Layla-Husain"
                },
                {
                    "user_id": "Indrajit Das",
                    "user_href": "/profile/Indrajit-Das-10"
                },
                {
                    "user_id": "Nidhi Agarwal",
                    "user_href": "/profile/Nidhi-Agarwal-553"
                }
            ]
        }
    ]
}