{
    "title": "How to get very rich with the stock market right now any books should I read - Quora",
    "tags": [
        "Reading",
        "Stocks (finance)",
        "Stock Markets",
        "Wanting and Making Money",
        "Book Recommendations"
    ],
    "response": [
        {
            "author_info": {
                "name": "Steven Hager",
                "href": "/profile/Steven-Hager"
            },
            "answer_text": "The internet and free trading are having a huge impact on the stock market. Many strategies will work in the current climate, but clearly the value of FAANG is growing much faster than the old blue chips. You grow wealth by increasing income while reducing expenses. Ideally, you are living in a small house or condo that you or your parents own, and your energy and communications footprint is economical as possible. You do not have expensive habits. You have multiple jobs and income streams. You can go all-in on FAANG plus Tesla, or you can invest in a pair of exchange traded funds. My suggestion would be ARKK, controlled by a visionary CEO, and QQQ, a computer-driven fund based off performance. The former is composed primarily of potentially disruptive companies at early stages of growth (with the exception of their large position in Tesla, bought years ago), while the latter is composed of the current kings of NASDAQ (Facebook, Apple, Amazon, Netflix, Google, Microsoft). These funds spread your chips out to cover the maximum bases. ",
            "date": "Answered October 2, 2020",
            "views": "113",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Tom O'Connor",
                "href": "/profile/Tom-OConnor-174"
            },
            "answer_text": "You may glean useful basic information from books but they will not make you very rich right now. Life is too complicated for that to happen. If someone did know how to make that happen, he will not be telling others in a book. Aim for a more modest goal. Own your home free of debt and have as much as you can in a professionally managed retirement account with modest fees. Amateur investors invariably fail in tough volatile times. It’s never easy. Are you feeling lucky? ",
            "date": "Answered October 5, 2020",
            "views": "33",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Matthew Daneman",
                "href": "/profile/Matthew-Daneman"
            },
            "answer_text": "Number one book you should read first and foremost: Stock Investing for Dummies Do you know how to read a publicly traded company’s filings? Do you even know where to find the filings? Do you know the terminology of investing? If the answer to any of these is “I think so” with a slight hesitation, you need to do your homework before throwing away your cash. ",
            "date": "Answered October 2, 2020",
            "views": "58",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "David Alexander",
                    "user_href": "/profile/David-Alexander-14"
                }
            ]
        },
        {
            "author_info": {
                "name": "David Phillips",
                "href": "/profile/David-Phillips-1062"
            },
            "answer_text": "The Intelligent Investor by Benjamin Graham Warren Buffett was a student of his. The Wealthy Barber by David Chilton The Wealthy Barber was aimed more at regular folks. I don’t know about the US but this book was huge in Canada. It gave simple common sense strategies to be a successful financially like the 10% solution. The Wealthy Barber Returns went into more detail about saving and investing. You need to remove temptation. Banks are in business to make a profit, not for the benefit of their customers. Credit cards are evil. You can’t have everything you want. Save when you have the chance “ wealth flows from savings not income “ ",
            "date": "Updated October 13, 2020",
            "views": "20",
            "upvotes": "0"
        }
    ]
}