{
    "title": "How is online studying different? - Quora",
    "tags": [
        "Higher Education System Comparisons",
        "E-learning in Higher Education",
        "Education System Comparisons",
        "Comparisons",
        "E-learning",
        "Higher Education"
    ],
    "response": [
        {
            "author_info": {
                "name": "Martin J Pitt",
                "href": "/profile/Martin-J-Pitt"
            },
            "answer_text": "There are two sorts of online studying: (1) By yourself. (2) With the support of an educational institution. (1) If you are sufficiently motivated you can learn subjects enough to be useful and to get qualifications.  There is no fundamental difference between this and studying from books.  However, I would recommend a book (not an electronic one) because you cannot lose yourself in hyperlinks or be distracted.  I once took a textbook and did every single question at the end of each chapter.  My PhD supervisor taught himself some very rigorous maths (which he wanted in order to proceed with his work on particles) by essentially the same technique.  If you do it online, make sure you are not just trawling, but writing things down (not copy and paste), calculating, doing graphs, working out circuits, chemical reactions or whatever.(2) This is much the same, but you are directed in your reading and required to do the things you have to motivate yourself in (1), by being given tasks and deadlines.  You will also get some feedback on your efforts, constructive criticism and possibly some interaction with other students. However, both of these are essentially lonely activities. You miss out on the other aspects of being a student, which includes being part of a community with a common interest as well as the ups and downs of dealing with other people. ",
            "date": "Answered August 25, 2015",
            "views": "345",
            "upvotes": " View 2 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Ashish",
                    "user_href": "/profile/Ashish-1453"
                },
                {
                    "user_id": "Ravankol Tarun",
                    "user_href": "/profile/Ravankol-Tarun"
                }
            ]
        },
        {
            "author_info": {
                "name": "Ramu Midatana",
                "href": "/profile/Ramu-Midatana"
            },
            "answer_text": "Yes it's truely different from the normal way of study. Here you can compare the explanation of one person with other and you can follow the one which you feel like proper. There may be fear like what will happen if i ask this question to this professor, will he answer to me or will he ask another question to me or will that be a trouble to me and many more in a normal study process. But in online study you don't need to worry about any thing. You have a doubt ask some one online, you may not be knowing who is that person but you can get the answer to your question. ",
            "date": "Answered August 26, 2015",
            "views": "89",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Ravankol Tarun",
                    "user_href": "/profile/Ravankol-Tarun"
                }
            ]
        }
    ]
}