{
    "title": "How to think of the novel Animal Farm - Quora",
    "tags": [
        "Animal Farm (1945 book)",
        "Book Reviews",
        "Literature",
        "Animals",
        "Books"
    ],
    "response": [
        {
            "author_info": {
                "name": "Affaf Junaid",
                "href": "/profile/Affaf-Junaid-1"
            },
            "answer_text": "Here’s my review of the book along with a brief summary of its contents. In his book Animal farm, Orwell meticulously points out the institution of greed and exploitation that fuels the engine of any and every method of governance. Be it capitalism, be it communism. I found the language of the book to be quite lucid, and the flow effortless and fun. The characters, who are the animals in a farm, are introduced in the story with a combination of their physical and personality traits, with the latter given more emphasis. This made it easier for me to anticipate and relate with their thoughts and actions. It is surprisingly easy to draw parallels between Orwell’s story and the real world, both historical and current. The cruel and unjust conditions that stir a revolution. The dreams, the yearning for freedom and prosperity that lingers in the eyes of the common folk. An expert orator-slash-manipulator who brings people together, uniting them against a common foe and assuming the leadership once the revolution succeeds. A brief moment of joy, prosperity and the feeling of happily-ever-after. Until the imminent reality of greed and exploitation kicks in. Then, inch-by-inch, the core principles that founded the revolution are dismantled and molded according to the whims and desires of those in command. Eventually, the same misery that people thought they were free from, returns, in forms uglier, more painful, and more confusing. Orwell did a great job at “humanizing” the personality traits of animals and delivered their emotions in a powerful and relatable manner. Overall, the story was a revelation. It overlapped a lot with the live political scenario in my own country and that opened my eyes to how stupid and naive the lay folk are. My key takeaways from this story are 5: 1) “All animals are equal, but some are more equal than others” – by George Orwell himself. 2) Keep people uneducated and unenlightened and it becomes easy to trick them into believing any sort of crap. 3) History is changeable and moldable. And so is morality. 4) Injustice and oppression start when the jobs and lives of leaders become easy. 5) The recipe of dictatorship is quite simple. A “friendly” leader, his loyal guard dogs, some squealers who glorify and praise him endlessly, a few scapegoats to take the blame for his failures, and a sizeable population of sheep. Affaf ",
            "date": "Answered May 4, 2020",
            "views": "469",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Nabeel AK",
                    "user_href": "/profile/Nabeel-AK-2"
                },
                {
                    "user_id": "Kadir Günaydın",
                    "user_href": "/profile/Kadir-Günaydın"
                },
                {
                    "user_id": "Derrin Gottlieb",
                    "user_href": "/profile/Derrin-Gottlieb"
                }
            ]
        },
        {
            "author_info": {
                "name": "Manu Shrivastava",
                "href": "/profile/मनु-श्रीवास्तव-Manu-Shrivastava"
            },
            "answer_text": "Animal Farm is an allegorical novella; allegorical means it uses symbols to depict something. Here animals depict human and leaders of the animals are the leaders of the communist government. In this book, animals are living and working as slaves for the human; Old Major imparts the wisdom to them before dying and evokes them to rebel against human. He dreams of a farm where animals are living peacefully and working under favorable conditions and enjoying their hard work, a farm without humans! Animals eventually rebel against the owner of the Manor Farm, Mr. Jones and get freedom from him. They start living happily after that. Pigs take leadership role but with time the corrupt leaders shunned away from the one who was truly the follower of ‘Animalism’. ‘Animalism’ is a metaphor for ‘Communism’ here. Corrupt leaders change the fundamentals of Animalism to suit their needs and whoever tried to correct them was hushed up. A time came when animals were in no better condition than they were when Mr. Jones was their owner. My emotions changed from bewilderment to happiness, confused to shocked and sad to feeling pity for the animals. It wrenched my heart because the writer has painted a picture of reality! It is no fiction, it has happened and this is how communist leaders have made fool of the public who had high hopes, who were waiting for golden days of freedom. The writer has taken a dig at ideologies altering by corrupts in power to suit their desires! He aptly uses the Animal Farm as a metaphor and develops the characters to symbolize the real world people. This novel will absorb you within it and you will be surprised to find many examples of such leaders and the lies sown by them to pollute our mind and propagate their agenda. I am living in a democracy and at some points, I felt eerie similarity with the animals of Animal Farm. Whenever we protest again any policy, we are reminded of the time when we were living under British Rule and dark ages of slavery! Whenever animals tried to voice their opinion against any policy they were silenced in a similar manner- Do you want Mr. Jones back ? have you forgotten the time when we all were slaves and toiling hard and getting bare minimum food?? India is the largest democracy in the world and we take great pride in announcing this but is truly a democracy now? When Indians were fighting for freedom, they were given hopes that one day they will live in a democracy; Everyone will choose their own leader and there will be no Kings or kingdoms, we will live in a secular nation, we will have equal rights and we will live peacefully. Are we living the life our ancestors have dreamt off?? ",
            "date": "Answered July 11, 2019",
            "views": "11",
            "upvotes": " View 8 Upvoters",
            "upvoters": [
                {
                    "user_id": "Midas",
                    "user_href": "/profile/Midas-141"
                },
                {
                    "user_id": "Thomas Packer",
                    "user_href": "/profile/Thomas-Packer-5"
                },
                {
                    "user_id": "Sansriti Mishra",
                    "user_href": "/profile/Sansriti-Mishra-5"
                },
                {
                    "user_id": "Harsh Raj",
                    "user_href": "/profile/Harsh-Raj-724"
                },
                {
                    "user_id": "Ritesh Prasad",
                    "user_href": "/profile/Ritesh-Prasad-4"
                },
                {
                    "user_id": "Nimit",
                    "user_href": "/profile/Nimit-16"
                },
                {
                    "user_id": "Tony Bologna",
                    "user_href": "/profile/Tony-Bologna-21"
                },
                {
                    "user_id": "Abhinav Ashish",
                    "user_href": "/profile/Abhinav-Ashish-12"
                }
            ]
        }
    ]
}