{
    "title": "How did Royalty become royalty? - Quora",
    "tags": [
        "Royalties"
    ],
    "response": [
        {
            "author_info": {
                "name": "Nick Brei",
                "href": "/profile/Nick-Brei"
            },
            "answer_text": "Royalty originated via tribal chiefs, through a member of the tribe being selected by the others, due to a particular trait or character considered useful for the functioning and progress of that tribe. One of the oldest prized qualities for instance, was being a powerful wrestler or a successful hunter. That tribal chief then became recognized as the Lord or senior most powerful personage. Later, from the acquisition of lands through force or otherwise. Then later still, Under feudal systems, they became powerful landowners. The concept of royalty is centuries ­old. It originated with the feudal systems of medieval Europe. Under feudalism, there were a few very powerful landowners who acquired large amounts of territory through military force or purchase. These landowners became high-ranking lords, and one of them was crowned king. This probably happened through a show of military force or through political machinations, or some combination of the two. Powerful as they were, these lords controlled too much territory to manage on their own. They would name vassals, lower-ranking nobles (possibly, Barons, or Viscounts, Counts or Dukes, dependent on the value of that individual to the king - or otherwise through family ties) ) who were granted some, or in some cases, a great amount of property. They retained and profited from whatever income it generated (usually through rents paid by commoners or profits from farming). In return, the vassal would act as administrator of that territory. More importantly, the vassal was obligated to provide military aid to his lord (in return for the privilege of the land and the title). He would raise a private army, and if his territory was large enough, he might create several vassals of his own below him. ­Each vassal was given a title, but no direct political power was usually afforded to him at first. Rules of succession developed along the same lines as rules of inheritance, because a vassalage was essentially property loaned to someone by a higher-ranking lord. When the vassal died, his property, including his title and obligations to the king, was inherited by his heirs. Over time, a variety of elaborate traditions and rituals grew up around this system. ",
            "date": "Answered January 8, 2020",
            "views": "61",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Jeffrey D Stamp",
                "href": "/profile/Jeffrey-D-Stamp"
            },
            "answer_text": "Historically, in most cases, the leader of a family, clan or alliance of both was successful in war. That person, most often male was crowned as King. In Feudal times, land was added to those victories and usually the King was the largest land holder. ",
            "date": "Answered January 8, 2020",
            "views": "31",
            "upvotes": "0"
        }
    ]
}