{
    "title": "How come science is a discovery and not an invention? - Quora",
    "tags": [
        "Discoveries",
        "Invention and Inventions"
    ],
    "response": [
        {
            "author_info": {
                "name": "Tommy C. Lim Jr.",
                "href": "/profile/Tommy-C-Lim-Jr"
            },
            "answer_text": "How come science is a discovery and not an invention? An invention is something that required thought to assemble. It’s a creation. A discovery is something unknown that becomes known. Science can invent the instruments it uses. But the things that it finds with that equipment are discoveries. So a particle accelerator is an invention. The Large Hadron Collider is a use of that invention. Confriming that the Higgs Boson exists is a discovery (more accurately a confirmation of a prediction that it exists). Science did not create the Higgs Boson. It was theorized to exist, but until the LHC was built, nobody could verify that it did exist. We now know it exists. ",
            "date": "Answered April 11, 2019",
            "views": "386",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "David Stevens",
                    "user_href": "/profile/David-Stevens-182"
                }
            ]
        },
        {
            "author_info": {
                "name": "Robert Sarracino",
                "href": "/profile/Robert-Sarracino"
            },
            "answer_text": "It depends on how you look at it. Do we discover new knowledge, or do we invent it? Most scientists think that the “secrets of Nature” have an absolute existence, are in principle comprehensible, and are therefore discovered. However, the tools we use to make those discoveries — and that includes mathematical constructs and tools — are invented. If a new mathematical model then is found to be a marvelous fit in explaining the results of a new (or old) set of experiments, and subsequently is found to have predictive power regarding the results of further experiments, how do we describe it? On the one hand, we might say, we have discovered something new about Nature. On the other hand, we have invented something — we have invented a model which explains the results of experiment and which also has predictive power. ",
            "date": "Answered April 11, 2019",
            "views": "319",
            "upvotes": "0"
        }
    ]
}