{
    "title": "How do Kindle authors get paid? - Quora",
    "tags": [
        "Getting Paid",
        "Amazon Kindle (product)",
        "eBooks",
        "Writers and Authors"
    ],
    "response": [
        {
            "author_info": {
                "name": "Andrew Fuller",
                "href": "/profile/Andrew-Fuller-21"
            },
            "answer_text": "Mostly via royalties per copy sold. There are upload fees/print on demand fees for paperback editions to be deducted from the basic rates. But, unless the book file is huge, e.g. Having lots of graphics or thousands of pages, this is a tiny amount. There are royalty thresholds; 99 cents (minimum price) for a 30% royalty, 2 dollars & 99 cents and over for 70%. Outside the US, there are similar currency specific thresholds. There is also the possibility of bringing out an QuickBooks version to complement the kindle book. The payment area arrangements here are more complicated, but again based on royalties. In all cases, the payments are made into the author's bank account. I don't believe it's still possible to be paid. T cheque. Non-royalty Amazon payments can come from a few sources. Amazon -run writing contests and reward/incentive schemes for high -sales authors. These very by Amazon region and tend to be at hoc. Finally, writers may able to monetise their book, e.g. For non-fiction, by mentioning/linking to other services, e.g. Business consulting, personal development seminars, courses related to the book's subject matter. Or by using a book to increase credibility with potential clients. Too blatant self-promotion will, though, compromise your Amazon account. ",
            "date": "Answered December 6, 2019",
            "views": "63",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Andrew Karam",
                "href": "/profile/Andrew-Karam-3"
            },
            "answer_text": "I get Kindle royalties deposited into my checking account monthly, towards the end of the month. I get a royalty deposit for each nation in which my book is sold (e.g. US, Canada, UK, Germany, India, etc). Some months there are sales in a lot of places, some months I only have sales in a handful of places. Some of the payment is for book sales (35–70% of the sale price) and some is based on the number of pages that have been read by people participating in the Kindle Unlimited program. In about 6 or 7 years Amazon has never missed a payment. ",
            "date": "Answered December 20, 2019",
            "views": "61",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Phillip LaFlamme",
                    "user_href": "/profile/Phillip-LaFlamme"
                },
                {
                    "user_id": "Eamon O'Kelly",
                    "user_href": "/profile/Eamon-OKelly"
                },
                {
                    "user_id": "Jeff Hamilton",
                    "user_href": "/profile/Jeff-Hamilton-43"
                },
                {
                    "user_id": "Tim Cole",
                    "user_href": "/profile/Tim-Cole-7"
                }
            ]
        }
    ]
}