{
    "title": "How to stop reading articles randomly one after another instead of finishing one completely - Quora",
    "tags": [
        "Reading Articles",
        "Self-Improvement"
    ],
    "response": [
        {
            "author_info": {
                "name": "Robert Esposito",
                "href": "/profile/Robert-Esposito-7"
            },
            "answer_text": "Like so many of us, we are being forcibly trained to constantly take in more advertising, faster dialogue, shorter scenes, unending chatter and the deeply annoying television practice of interrupting the flow of a program in mid-fucking-sentence for a commercial a total of six times an hour, but not insulting the commercial with reciprocal treatment. Not that I’m bitter. It’s no wonder you can’t finish an article. I can’t watch movies that are older than about four years…they’re too slow. If I watch “Spartacus” starring the late, great Kirk Douglas, in the first four minutes, I want to hear Tony Curtis jump up and say “I’M SPARTUCUS!” and get to the crucifixion. We’re moving quickly toward “New Speak” and young people, enslaved to I-phones, can’t spell, read, or write cursive. They socialize with their thumbs and slang. I knew a guy got married and was divorced with two kids and paying alimony by the time they went on honeymoon. Learn to meditate and clear your assaulted head. I’m exhausted. ",
            "date": "Answered February 24, 2020",
            "views": "50",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Virginia Hanlon",
                    "user_href": "/profile/Virginia-Hanlon"
                },
                {
                    "user_id": "Yojji Peterson",
                    "user_href": "/profile/Yojji-Peterson"
                },
                {
                    "user_id": "Barrie Levine",
                    "user_href": "/profile/Barrie-Levine"
                },
                {
                    "user_id": "Moh Moh Zin",
                    "user_href": "/profile/Moh-Moh-Zin-1"
                }
            ]
        }
    ]
}