{
    "title": "How to study for practicals of final MBBS subjects like medicine and surgery - Quora",
    "tags": [
        "Bachelor of Medicine and Bachelor of Surgery Degree Advice",
        "Bachelor of Medicine and Bachelor of Surgery Degrees"
    ],
    "response": [
        {
            "author_info": {
                "name": "Aryabhatta Sadhu",
                "href": "/profile/Aryabhatta-Sadhu"
            },
            "answer_text": "All the answers written are very detailed, what I would add is, Davidson-med, MacLeod, a Kundu, Start with digesting MacLeod, 1 system at a time, do Davidson simultaneously, see patients, repeat*2–3 times, making notes, don't worry even if you dn't bcz, they are available online, search FB for Letu Da/ final prof 2017 wbuhs page, download the entire content, it's basically a scaled-down version of Mac+Davidson, literally eat it! Once you are done with it, start with A kundu(1&2), it's optional, you may choose not to do the part 1, if you are confident after doing Mac+Davidson. Additionally, usmle step 2 qbook for clinical cases. First aid step 2both CK &cs) are also good books. ",
            "date": "Answered March 11, 2017",
            "views": "86",
            "upvotes": " View 8 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Parjanya Bhatt",
                    "user_href": "/profile/Parjanya-Bhatt-1"
                },
                {
                    "user_id": "Navnita Dey",
                    "user_href": "/profile/Navnita-Dey-1"
                },
                {
                    "user_id": "Dhatshikaa Kamarasu",
                    "user_href": "/profile/Dhatshikaa-Kamarasu-1"
                },
                {
                    "user_id": "Vikash Singh",
                    "user_href": "/profile/Vikash-Singh-3104"
                },
                {
                    "user_id": "Iswarya",
                    "user_href": "/profile/Iswarya-32"
                },
                {
                    "user_id": "Vishal Raja",
                    "user_href": "/profile/Vishal-Raja-23"
                },
                {
                    "user_id": "Ss",
                    "user_href": "/profile/Ss-1169"
                },
                {
                    "user_id": "Anandita Dalal",
                    "user_href": "/profile/Anandita-Dalal"
                }
            ]
        },
        {
            "author_info": {
                "name": "Nikhil Jha",
                "href": "/profile/Nikhil-Jha-42"
            },
            "answer_text": "Attend clinical postings. Try to know approach to patient rather than jumping on to diagnosis. Make algorithm and approach to patients. Try to present as many cases as possible to the faculty or even your friends, this refines your technique and reduces anxiety in the final exams. Try to elicit signs yourself. Have all the instruments ready right from the start. Do visit emergency as most of the signs are very well seen in emergency when patient arrives fresh specially in cardio respi and gastro. Books- medicine Hutchison Surgery - das No one is perfect keep practicing. Take exam cases as much as possible rather than taking serious difficult cases. ",
            "date": "Answered March 9, 2017",
            "views": "61",
            "upvotes": " View 2 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Iswarya",
                    "user_href": "/profile/Iswarya-32"
                },
                {
                    "user_id": "Ishrath Jahan",
                    "user_href": "/profile/Ishrath-Jahan"
                }
            ]
        }
    ]
}