{
    "title": "How to automate customer service for my startup - Quora",
    "tags": [
        "Customer Relationship Management (CRM) ",
        "Customer Experience",
        "Automation",
        "Customer Service"
    ],
    "response": [
        {
            "author_info": {
                "name": "Daria Leshchenko",
                "href": "/profile/Daria-Leshchenko-2"
            },
            "answer_text": "Depending on what kind of startup you have and what kind of products and services you provide, the answer may differ significantly. Generally, there are three large options you can choose from: AI / Chatbots For smaller startups chatbots can be a good idea. They are effective in dealing with simple questions live. However, in case of a more complicated issue, their inability to escalate further to a human agent does not make them so different from a simple FAQ page. FreelancersThrough numerous freelancer platforms around the web you can find nearly any professional, a customer support agent included. A person or a few could help you handle initial customer support. Though, it is important to make sure you have enough agents to handle the volume of tickets. Outsourcing When using outsourcing companies, you can hire agents but also often rent other services to deal with customer support. It might sound similar to freelancing, but unlike freelancing, you can have agents that are closely familiar with your product and work on providing support for your business continuously rather than in a short-term project style. Security and quality assurance are also among the benefits of such an approach. ",
            "date": "Answered March 26, 2020",
            "views": "87",
            "upvotes": " Answer requested by Siddhant Dash",
            "upvoters": [
                {
                    "user_id": "Siddhant Dash",
                    "user_href": "/profile/Siddhant-Dash-19"
                }
            ]
        },
        {
            "author_info": {
                "name": "Marvin Strauss",
                "href": "/profile/Marvin-Strauss"
            },
            "answer_text": "It’s probably impossible to automate every aspect of your customer service operations. That would lead to a fairly poor customer experience and definitely not something you want. You want a healthy mix of automation alongside human interaction. In Re:amaze for example, there are several different automation features: Workflow automation (for things like auto-routing, assignments, tagging)Automated messaging (for on-site engagement)Pre-built chatbots (to help with commonly asked questions)Custom chatbots (to help with unique scenarios such as finding a product)There are things you want to automate internally and there are things you want to automate externally (customer replies) but be careful with what you automate as a fully automated support process can be extremely alienating for customers. A mixture of the options above will help you speed up customer service but still enable you to offer a human element to your business. ",
            "date": "Answered March 27, 2020",
            "views": "13",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Chris Taylor",
                "href": "/profile/Chris-Taylor-1719"
            },
            "answer_text": "There are a few tools you can use for this, but there’s a couple of questions to ask yourself first. -What level of service are you looking to provide? -B2C/B2B? -How complex is your product? -How much volume of support are you expecting? Ultimately, if you have an extremely simple product you could get an AI/Chatbot, build up the knowledgebase and train it, then let that do the work for you. Thing is, they aren’t really sophisticated enough yet for technically complex products. Other than that, you can outsource, hire freelancers (there are a bunch of service freelancers about). The more process you can automate up front the better, when you eventually get a support hire, they’ll thank you for it. CX and CS is a key differentiator for pretty much everyone these days, so whatever you do, make sure you do it right! ",
            "date": "Answered March 10, 2020",
            "views": "61",
            "upvotes": " View 1 Upvoter"
        },
        {
            "author_info": {
                "name": "Loralyn Mears",
                "href": "/profile/Loralyn-Mears"
            },
            "answer_text": "Bots. Today's AI (artificial intelligence) capabilities and tech behind bots can effectively and affordably automate the bulk of your customer service inquiries, although not all the requests specific to your biz. So you'll need a plan and team ready for manual intervention when those requests escalate. At first blush, consider the 80–20 rule where the bots will probably be able to handle up to 80% of your customer service. NOTE: maybe even less at first given that you're a startup and will not likely know what to prepare for and hence be unable to train your bots to your unique needs. ",
            "date": "Answered March 10, 2020",
            "views": "16",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "IntelePeer Cloud Communications",
                "href": "/profile/IntelePeer-Cloud-Communications"
            },
            "answer_text": "Hello, there are many ways you can automate customer service with CPaaS. Such as creating a chat bot on your website, setting up a workflow to answer and direct incoming calls to the correct place, creating a campaign that allows customers to interact with your business through SMS rather than voice, sending out surveys to customers through sms or email! ",
            "date": "Answered March 10, 2020",
            "views": "17",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Alexey Fitiskin",
                "href": "/profile/Alexey-Fitiskin"
            },
            "answer_text": "It can be different ways. : simple: consultants in online-chat on your sitesystems using the IT Infrastructure Library (ITIL) methodology Customer Service Center (Service Desk) orHelp desk - a narrower concept, it is a tool for technical user support",
            "date": "Answered March 11, 2020",
            "views": "21",
            "upvotes": " Answer requested by Siddhant Dash"
        }
    ]
}