{
    "title": "How does Twilight end? - Quora",
    "tags": [
        "Twilight (2008 movie)",
        "Twilight (creative franchise)",
        "Book to Film Adaptations",
        "Books"
    ],
    "response": [
        {
            "author_info": {
                "name": "Natasha Cheung",
                "href": "/profile/Natasha-Cheung-2"
            },
            "answer_text": "It ends with Bella becoming pregnant with Edward’s kid. The Volturi want to kill it, but they end up not doing so. Bella becomes a vampire because she was about to die, and Jacob imprints on the baby (Renesmee) which means he will now do anything to protect Renesmee if she is in danger. When she grows up, he will fall in love with her and then marry her. That is what is shown in Alice’s vision. It’s a little messed up in some places, speaking as a Potterhead with a huge distaste for Twilight, but I read the books and watched the movies, so I can at least have a right to say something. Some Twihards pay no regard to which book was published first and go right on to flame Potter when they don’t even know how to spell ‘Sirius’, let alone know what Sirius is (a star in Canis Major, earth’s brightest star). Alright, I’m ranting. But that’s how Twilight ends. It’s a happy ending in the epilogue I guess… if you like that stuff ",
            "date": "Answered March 16, 2017",
            "views": "88",
            "upvotes": " View 11 Upvoters",
            "upvoters": [
                {
                    "user_id": "Yichen Dou",
                    "user_href": "/profile/Yichen-Dou"
                },
                {
                    "user_id": "Sumukha Raghu",
                    "user_href": "/profile/Sumukha-Raghu"
                },
                {
                    "user_id": "Ishaan Santosh",
                    "user_href": "/profile/Ishaan-Santosh"
                },
                {
                    "user_id": "Shalon Hutchison",
                    "user_href": "/profile/Shalon-Hutchison"
                },
                {
                    "user_id": "Khushboo Khan",
                    "user_href": "/profile/Khushboo-Khan-68"
                },
                {
                    "user_id": "K Milstead",
                    "user_href": "/profile/K-Milstead-1"
                },
                {
                    "user_id": "Sarah McDermid",
                    "user_href": "/profile/Sarah-McDermid-2"
                },
                {
                    "user_id": "Syed Sarah",
                    "user_href": "/profile/Syed-Sarah-1"
                },
                {
                    "user_id": "Shweta Mishra",
                    "user_href": "/profile/Shweta-Mishra-212"
                },
                {
                    "user_id": "Rich Lukas",
                    "user_href": "/profile/Rich-Lukas"
                }
            ]
        },
        {
            "author_info": {
                "name": "Tiff Dawson",
                "href": "/profile/Tiff-Dawson"
            },
            "answer_text": "As a Potterhead and ex-Twihard, it ends very neatly in a happily ever after bubble where all the main characters live forever with their life partners. Seriously though. That battle in Breaking Dawn part 2? Non-existent in the books. They spend, like, twenty pages negotiating and talking and then the Volturi let Renesmee live and go back to their hovel in Rome. Even lovesick puppy Jacob who luuuurves Bella imprinted on her daughter, who conveniently for Jacob, doesn’t smell vampirish enough to turn him off. And did I mention that the gerascophobe never ages? Literally, Bella, that 18th birthday temper tantrum and meltdown and obsessive search for wrinkles was for nothing. And Bella and Edward lived happily ever after with Renesmee in the woods. ",
            "date": "Answered September 9, 2019",
            "views": "26",
            "upvotes": " View 5 Upvoters",
            "upvoters": [
                {
                    "user_id": "Yichen Dou",
                    "user_href": "/profile/Yichen-Dou"
                },
                {
                    "user_id": "Clara White",
                    "user_href": "/profile/Clara-White-40"
                },
                {
                    "user_id": "Pavlína Vášová",
                    "user_href": "/profile/Pavlína-Vášová-1"
                },
                {
                    "user_id": "Sandra Helena Toft Petersen",
                    "user_href": "/profile/Sandra-Helena-Toft-Petersen"
                },
                {
                    "user_id": "Isabelle Grey",
                    "user_href": "/profile/Isabelle-Grey-2"
                }
            ]
        }
    ]
}