{
    "title": "How far can a CPA change your life? - Quora",
    "tags": [
        "CPA Exam",
        "Certified Public Accountants (CPA)",
        "Accounting"
    ],
    "response": [
        {
            "author_info": {
                "name": "Gokul G",
                "href": "/profile/Gokul-G-260"
            },
            "answer_text": "Please read full post. Yes, I am pursuing CPA from AICPA even after qualifying as a Chartered Accountant from ICAI. Let me share a little about me before we go further. While growing up I was very irregular at school and was not very focused. However, while in class 6 or so I started taking my studies very seriously and got very focused. This focus resulted in me topping my class. My parents have always supported me in my dreams in spite of all the difficulties they face. When I completed my class 12, my father suffered financial huge losses in his business. I wanted to help him and my only way was to study hard and be financially independent. So my plan was simple – Study well, get a good job and support my family. Since I scored 97% in class 12, I was eligible to join this free CPT coaching. I joined that coaching class and started my CA CPT free coaching. This is how I began my Chartered Accountancy journey. This free coaching was such a blessing to me and my family. It helped push start my career. My coaching class would start at 6 AM and end at 6.30 PM. In fact, even after returning home after an 8 hours class I would sit down and revise. I forgot to mention that in class 11 and 12 I had taken Science and not Commerce. Thus Accounts was new to me so I had to learn the basics in Accounting as well. But I kept pushing. At times it would get frustrating but then I used to just think of my parents and that used to motivate me. My only goal was to educate myself and qualify at the earliest so I could support my dad and reduce his burden. And guess what it all paid off – I secured an All India 10 th Rank in CA – CPT. The Institute of Chartered Accountants of India felicitated my parents because I secured a rank. That day my father had tears of joy in his eyes. It was the most memorable moment in my life. He was so proud of me. IPCC Coaching Now after CPT was the next level CA IPCC (2 nd level CA exam from ICAI which consists of 2 groups – Group 1 & Group 2). Since I cleared CA CPT with a rank my CPT coaching class offered me free coaching for CA IPCC. I was all excited as another financial burden was off my father’s shoulder. Now I gave my best for CA IPCC and cleared the same in my 1st attempt. Everyone again expected me to get a rank but I did not. However, clearing CA IPCC in the 1st attempt was good enough. After IPCC it was time to start a 3 years internship at a Chartered Accountancy firm. I started my articleship from at Bramaiah and Company a reputed Audit firm in Hyderabad (India). It was at this Chartered Accounting firm that I learned so much. My Principal was very good to me and used to provide a lot of career advice and guidance which used to really help me. CA Final Exams After 6 months of starting my articleship I started with my CA Final (last level CA Exam which consists of 2 groups – Group 1 & Group 2) coaching class. I took coaching from different places. Since I was using my stipend money to pay my fees I would register for a class as and when I had the money. My schedule was as follows: Attend my coaching class from 6 am to 9 amThen go to office work from 10 am to 6 pmAfter office, I would attend an evening class.This was my routine.However, a few months before the CA Final exams I fell really ill and could not attend coaching class for one subject (ISCA) for which I actually needed coaching. Now during my exam study leaves, I would study for like 15 hours a day but I was so stressed, tensed and nervous that on the actual exam day I could not answer the questions and blanked out. This led to my failure. For the first time in my life, I faced failure and it was devastating. I got very depressed with my failure as I felt I was not able to achieve my dreams and goal. In fact, I was feeling very sorry for my parents mainly my dad because he was 65 years and still struggling and working hard to support us. I wanted to support them and be there for them at the earliest. However, my parents supported and encouraged me a lot and told me to focus and prepare for the next attempt. This time I worked hard during my exams and focused on my weak subjects. I got rid of my nervous scared attitude and instead stayed optimistic and gave my best. I wrote mock test papers and self-assessed my performance. Luckily, I cleared my CA Final in my 2nd attempt and I was a qualified Chartered Accountant. Pursuing CPA After Qualifying as an Indian CA In spite of qualifying as a Chartered Accountant from ICAI and doing my internship from a reputed CA Firm in Hyderabad, I was STILL NOT GETTING ANY JOB OPPORTUNITY in an MNC. I would attend interviews but every time I would get a response from the HR that I was not selected because of poor communication skills. Also, a lot of the MNC’s I interviewed with would want me to have IFRS and US GAAP knowledge which obviously I did not have as ICAI course doesn’t cover US GAAP / IFRS! I was really frustrated. I could not believe that as a qualified Chartered Accountant I was not getting an opportunity in an MNC. It was almost 1 month since I cleared my Chartered Accountancy exams and yet no job opportunity was coming my way. It was then that I spoke to my Principal of the Chartered Accounting firm where I did my internship. He mentioned that I should consider pursuing CPA from AICPA or some international certification and also suggested that I should work on my communication skills. I also realised that if I need to get into an MNC I have to have an international degree from a reputed International Institute and thus decided to pursue CPA from AICPA. I did a little research and got in touch with Sripal Jain from Simandhar Education. I went with my dad to meet him. He told me about CPA and how MNC’s are actually looking for CPA’s in India. Now the cost of CPA was very high INR 3.5 lacs ( almost $4500) from start to finish! That was a lot of money for me. Now I knew CPA was my gateway to get into an MNC. So I took the courage and enrolled for CPA class. Since Simandhar Education had an instalment payment that helped me. I knew if I get a job of say INR 7 lacs per annum I would be able to pay the fees easily. Sripal Sir wanted me to find a job as he knew what I was going through. So he started referring me to his contacts to help me find the right opportunity but again due to communication skills many MNC’s rejected me. Luckily Virtusa had an opportunity in their Account Closure and Reporting of US and CANADA G/L Accounts. The hiring Vice President considered me because I was pursuing CPA from AICPA and had little knowledge about US GAAP. He was also happy that I was a Chartered Accountant as that meant I could understand Indian and US Accounting / Tax terminologies. But mostly you could say I got an opportunity because I was pursuing CPA from AICPA. If not CPA I would have been restricted only to Indian companies I guess. I am very thankful to Sripal Sir who helped me find this job opportunity and guided me. Now I am happy that as my father can retire from his work and relax. In Conclusion… CPA is recognized internationally, even a http://B.Com graduate who is unable to do Chartered Accountancy because of the time span of 5 years can do CPA and get a good package in par with a Chartered Accountants from ICAI.Being a CPA one can go abroad and set up their own practice or get employment. I always wanted to move abroad so I guess pursuing CPA worked in my favour.Multiple MNC companies which are setting up operations in India are also preferring CPA’S because they do have knowledge of IFRS AND US GAAP which those companies require to integrate the accounts.The scope of CPA (USA) in India is increasing day by day because of globalization and an increase in the number of MNC’s setting up business’ in India.CPA can work in a wide variety of areas like Assurance services, Forensic Accounting, Tax and Financial Planning, International Accounting, Internal and External auditing etc.I would also advice semi-qualified accountants to opt for CPA instead of ACCA.Qualified Chartered Accountants should also pursue CPA so that they get internationally recognized in a fast-changing environment like India where there is a demand for international knowledge.Also, I work on my English daily by watching Youtube videos.Always choose a course which will help you in your goal and ALWAYS have BELIEF – she concluded.Folks, real life experiences are much more effective than inked stories, that's why I shared her post. This is your turn and do it wisely. She is active on Facebook and Linkedin at – Santhoshi Y.  Also if you want to know more about CPA and other International Courses, Sripal Jain has agreed to help you with it. Sripal can also help you with job opportunities. You can reach out to him at – Sripaljain07@gmail.com ",
            "date": "Answered June 19, 2020",
            "views": "562",
            "upvotes": " View 15 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Shubham Sagar",
                    "user_href": "/profile/Shubham-Sagar-49"
                },
                {
                    "user_id": "Mukund Sharma",
                    "user_href": "/profile/Mukund-Sharma-21"
                },
                {
                    "user_id": "Lekshmi Jayan",
                    "user_href": "/profile/Lekshmi-Jayan-8"
                },
                {
                    "user_id": "Sripal Jain",
                    "user_href": "/profile/Sripal-Jain-20"
                },
                {
                    "user_id": "Daniel Benny",
                    "user_href": "/profile/Daniel-Benny-3"
                },
                {
                    "user_id": "Zaki Khan",
                    "user_href": "/profile/Zaki-Khan-33"
                },
                {
                    "user_id": "Mani M",
                    "user_href": "/profile/Mani-M-327"
                },
                {
                    "user_id": "Nabiji Noor",
                    "user_href": "/profile/Nabiji-Noor"
                },
                {
                    "user_id": "Mamidi Rohith Ravi",
                    "user_href": "/profile/Mamidi-Rohith-Ravi"
                },
                {
                    "user_id": "Ujwal Singh",
                    "user_href": "/profile/Ujwal-Singh-14"
                }
            ]
        },
        {
            "author_info": {
                "name": "Tim Smith",
                "href": "/profile/Tim-Smith-610"
            },
            "answer_text": "A CPA is the most recognized credential for an accountant as well as a symbol of achievement and assurance of quality. Having this credential will not only unlock more opportunities, but CPAs make on average 10% more than non-CPAs. Getting your CPA is essentially securing your future of always being employed. Companies are always looking for CPAs. Accountants makes good money, but CPAs make more money. Knowing you will always have a job and the option of wider job selection is enough to make many candidates try for the CPA. Some of the fringe benefits of becoming a CPA include: sense of accomplishment, increased self confidence, and the ability to sit for long long hours studying. 4 Pleasantly Unexpected Benefits of Studying for the CPA Exam ",
            "date": "Answered July 6, 2017",
            "views": "610",
            "upvotes": " View 6 Upvoters",
            "upvoters": [
                {
                    "user_id": "Ananmoys",
                    "user_href": "/profile/Ananmoys"
                },
                {
                    "user_id": "Daniel Sobit",
                    "user_href": "/profile/Daniel-Sobit"
                },
                {
                    "user_id": "Sheldon Coelho",
                    "user_href": "/profile/Sheldon-Coelho"
                },
                {
                    "user_id": "Harman More",
                    "user_href": "/profile/Harman-More"
                },
                {
                    "user_id": "Natasha Isom",
                    "user_href": "/profile/Natasha-Isom"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/Insight-Resumes"
                }
            ]
        }
    ]
}