{
    "title": "How to publish my eBook on Amazon & Kindle - Quora",
    "tags": [
        "Amazon Kindle (product)",
        "Publishing",
        "eBooks"
    ],
    "response": [
        {
            "author_info": {
                "name": "Praveen Venkiteswara Annu",
                "href": "/profile/Praveen-Venkiteswara-Annu"
            },
            "answer_text": "The self-publishing process is extremely well explained and easy to follow. Self-publish your book to Amazon's Kindle Store Whether you want to keep it exclusive to Amazon or not is entirely up to you. The positives of going exclusive are access to two book promotion tools once every three months, 70% royalties in some markets for books priced between $2.99 and $9.99 (which is otherwise 35%) and the enrollment of the book in the Kindle Unlimited program. However, by being exclusive, you miss out on B&N, Kobo, Smashwords, Apple store and many others that account for 40 to 50 percent of book sales. Also look at the pros and cons of self-publishing vs. traditional publishing below. Self Publishing Pros Better control of the publishing process - complete creative freedom to choose what you want to include and howBetter royalties - no cut for the publisher. You decide your pricing and royalties. eBook royalties can be as high as 70%.Faster to market - you can self-publish an eBook that you have ready in a matter of minutes and make it available worldwideNo restrictions for newbie authorsCons Discoverability - your book is the proverbial needle in the haystackMarketing - you are responsible for all marketing effortsIf you are opting for a print edition, there might be an upfront cost involved - except in the case of Print-on-demand optionTraditional Publishing Pros You have the backing of a reputed publishing house - better discoverabilityMarketing is part of the book publishing deal and the publisher helps to an extentProfessional editing, formatting and cover designMade available through all major bookstores and online retailersCons Can take a significant amount of time (months) to get a book to the marketNew authors might find it difficult to get the backing of a good publisher - others might charge a one time publishing fee starting from INR 25,000.Lower royalties - 10 - 15% of selling price for print editionsDo feel free to let me know if you have any specific questions. ",
            "date": "Answered June 8, 2016",
            "views": "683",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Harsh Mishra",
                    "user_href": "/profile/Harsh-Mishra-49"
                },
                {
                    "user_id": "Ravi Solanki",
                    "user_href": "/profile/Ravi-Solanki-49"
                },
                {
                    "user_id": "Akshay Mulchandani",
                    "user_href": "/profile/Akshay-Mulchandani"
                },
                {
                    "user_id": "Sudhanshu Dhingra",
                    "user_href": "/profile/Sudhanshu-Dhingra"
                }
            ]
        },
        {
            "author_info": {
                "name": "Vaibhav Sharma",
                "href": "/profile/Vaibhav-Sharma-55"
            },
            "answer_text": "Hi,  Thanks for the A2A, Get help with self-publishing your book to Amazon's Kindle StoreGet help with self-publishing your book to Amazon's Kindle Store amazon has launched Kindle direct Publishing in India , its detailed in the above links on their website. ",
            "date": "Answered May 21, 2015",
            "views": "267",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Kunal Mhaske",
                    "user_href": "/profile/Kunal-Mhaske-1"
                },
                {
                    "user_id": "Anirudh Chauhan",
                    "user_href": "/profile/Anirudh-Chauhan-2"
                }
            ]
        }
    ]
}