{
    "title": "How to transfer books to Kindle from my laptop - Quora",
    "tags": [
        "Amazon Kindle (product)",
        "eBooks",
        "How-to Question"
    ],
    "response": [
        {
            "author_info": {
                "name": "Saurabh Sharma",
                "href": "/profile/Saurabh-Sharma-1129"
            },
            "answer_text": "It is a fairly simple process. What you will need to do is ensure a few things to begin with. First, please check that the books you wish to transfer to your Kindle device are in .mobi format. This is the only format that Kindle recognises or that is compatible with Kindle and is a must to read books on the device. Secondly, download a software called Send to Kindle from Amazon to your desktop/laptop. This software would allow you to transfer books to Kindle. Now, after you have performed these steps all you need to do is to select the ebook on your laptop and click the right mouse button. In the menu you will see Send to Kindle as an option, selecting this option will transfer the book to your Kindle device. The software will take a few seconds depending on the size of the file to upload the book on the server and then all you have to do is open your Kindle device and download the book there by using the sync option given in the device. On a side note if your ebooks are not in Mobi format then you may convert them by using any one of the many online ebook converters. The results aren't perfect but you will have your ebook ready to be read on Kindle. I hope this helps. ",
            "date": "Answered May 6, 2017",
            "views": "33",
            "upvotes": " View 6 Upvoters",
            "upvoters": [
                {
                    "user_id": "Nimisha Bunga",
                    "user_href": "/profile/Nimisha-Bunga"
                },
                {
                    "user_id": "Challa Madan",
                    "user_href": "/profile/Challa-Madan"
                },
                {
                    "user_id": "Sharon Clark",
                    "user_href": "/profile/Sharon-Clark-209"
                },
                {
                    "user_id": "Soma Bhattacharyya",
                    "user_href": "/profile/Soma-Bhattacharyya-6"
                },
                {
                    "user_id": "Nibedita Nandan",
                    "user_href": "/profile/Nibedita-Nandan"
                },
                {
                    "user_id": "Kunal Pandey",
                    "user_href": "/profile/Kunal-Pandey-15"
                }
            ]
        },
        {
            "author_info": {
                "name": "Greg Seery",
                "href": "/profile/Greg-Seery"
            },
            "answer_text": "How do you transfer a book from your computer to Kindle? You can do it with something like Windows Explorer or any other similar program that allows you to explore the files on your disk drives. But doing it this way tends to require a fair bit of knowledge about where files are stored, and where on your Kindle you want to create a file. It isn’t really that difficult, but for most people, it is more than they want to learn. Fortunately, there is an Open Source free program called Calibre that takes care of most of those details. Once you’ve installed the program, you use this to keep a book catalog of all of your books, as well as transferring them to/from your PC to whatever e-reader you have. The program is smart and customizable, you simply tell it what kind of e-reader you have, where you store your ebooks, and let it do its thing. I could go through all of the details, but why re-invent the wheel? Simply click on this Calibre User Manual link and follow the instructions. If you haven’t already installed the latest version, you’ll be given instructions on how to do so. I’ve been using the program for about 15 years now, it has improved considerably over the time. It is easy to use and fairly intuitive. It simply works, making the drudgery of cataloging a fairly easy task. Best of all, it is FREE! (although there is a link should you choose to donate to the maintainer/author, and it would be appreciated) ",
            "date": "Answered June 10, 2020",
            "views": "566",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Anoop Kumar",
                "href": "/profile/Anoop-Kumar-10"
            },
            "answer_text": "You have two options: Connect Kindle to your computer. transfer files as you do in USB drive. <I will update the file path.> This method will not convert your PDF to actual amazon format that is .AWZ. PDF is not very much support in Kindle like free flow.By emailing to your kindle ID:Got to: Amazon Login (Manage Your Content & Devices → Your devices)Click on Action button of your Kindle, copy your Kindle email id.Send your PDF files from your registered Amazon Email id to your Kindle Email id : <YourDeviceKindleId>@kindle.com . Put in subject convert.You PDF book will be available on your kindle within few min in Kindle format .AZW or .AZW2.",
            "date": "Answered May 25, 2017",
            "views": "13",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Usha Bellur",
                    "user_href": "/profile/Usha-Bellur"
                },
                {
                    "user_id": "Janice Kall",
                    "user_href": "/profile/Janice-Kall"
                }
            ]
        },
        {
            "author_info": {
                "name": "Margaret Carter",
                "href": "/profile/Margaret-Carter-2"
            },
            "answer_text": "(1) E-mail the file to your Kindle e-mail address, and Amazon will transmit the file to your Kindle. They used to charge something like 10 cents to do this. I haven’t used this function in a long time, though. (2) Move it on your computer using a USB cable to connect the Kindle device to the computer. The Kindle will show up as a “drive.” I’m very low-tech, so I hope those answers are intelligible, because I can’t explain in any more detail. :) If you bought the book from Amazon itself, of course, all you have to do is go to the “Digital Orders” page and click on the drop-down menu for the particular item, where it says “send to my Kindle” or words to that effect. ",
            "date": "Answered June 10, 2020",
            "views": "252",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Divesh Kumar",
                "href": "/profile/दिवेश-कुमार-Divesh-Kumar"
            },
            "answer_text": "This Process involve few Basic steps------ Go to you gmailCreate a mailChoose ebook which you wish to transfer into KindleNow enter the mail adress of your Kindle deviceNow click on sendThat's done! your ebook has successfully transferred to Kindle. In case if you don't know your Kindle address then first of all you have to go to settings then, to all settings, after that, you will find the option Send to Kindle mail at the bottom there will be your Kindle address. ",
            "date": "Answered July 2, 2017",
            "views": "994",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Prem Mishra",
                "href": "/profile/Prem-Mishra"
            },
            "answer_text": "Basic step is that you need to connect your Kindle to computer using data cable. Kindle will appear as removable media in My Computer in Windows. And it will appear as mouned drive in your Linux machine. Drop your ebooks there and the drive. The book will appear in Kindle. You may also use Calibre ebook management software also. It is free software and converts the book in Kindle format automatically before transferring the book to Kindle. It comes with host of other features. Explore both of the options and see what suits you. ",
            "date": "Answered May 25, 2017",
            "views": "14",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Priyam Das",
                    "user_href": "/profile/Priyam-Das-32"
                },
                {
                    "user_id": "Pallav Mishra",
                    "user_href": "/profile/Pallav-Mishra-3"
                }
            ]
        },
        {
            "author_info": {
                "name": "Tracy Karol",
                "href": "/profile/Tracy-Karol"
            },
            "answer_text": "Plus your Kindle into your computer and turn the computer on. It should bring the device up. Depending on your computer type, you can drag them over to the device. Or if you have them on your Kindle cloud go to “content and devices” and choose the books you want, then specify which device you want to send them to (your Kindle) and just send them from the cloud to your Kindle. This will work with docs too. ",
            "date": "Answered April 30, 2019",
            "views": "474",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Rudy Triana",
                    "user_href": "/profile/Rudy-Triana-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Devang Kamble",
                "href": "/profile/Devang-Kamble"
            },
            "answer_text": "Mail the books to the dedicated mail-id in your kindle (ending with kindle.com). Note, that don’t write anything in the mail, just attach it. Second, keep the subject name ‘Convert’ (Or doesn’t matter if your kindle is of latest version). Click send, within minutes, the book will be in kindle( provided you have net access to kindle)Use the USB cable to copy paste books in Kindle.",
            "date": "Answered May 6, 2017",
            "views": "819",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Deborah Newbury",
                "href": "/profile/Deborah-Newbury"
            },
            "answer_text": "How can I transfer books to Kindle from my laptop? I do it with a USB/mini USB cord. Plug it in. The computer recognizes the Kindle as a thumb drive. Drag and drop the file you want to transfer. Use the ‘Eject’ option on the computer before you unplug. ",
            "date": "Answered June 10, 2020",
            "views": "101",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Nora Jean Stone",
                "href": "/profile/Nora-Jean-Stone"
            },
            "answer_text": "The same way you would upload mobi files from your PC to your Kindle - via the recharger cord. Plug in the USB end to your PC, then plug in the mini USB into the Kindle just as you would to recharge. What that does is make your Kindle into “an additional storage device” like an external HDD. Go to where your mobi files are stored in your Kindle and copy them to a folder on your desktop. You can open and read them via Calibre software, which is free. ",
            "date": "Answered April 16, 2019",
            "views": "437",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Krishna Kishore",
                    "user_href": "/profile/Krishna-Kishore-676"
                }
            ]
        },
        {
            "author_info": {
                "name": "Sam Droid",
                "href": "/profile/Sam-Droid"
            },
            "answer_text": "I would strongly recommend that you try out Calibre. You can find more details here. I use Calibre to manage my ebooks library. It has an excellent interface. It can manage books on your devices, Kindle included. It has a 1-click send to device option. Just plug in your device via USB and you are ready to go. You can tag and search books. Definitely my favorite software when it comes to ebooks. And it is completely free! ",
            "date": "Answered May 6, 2017",
            "views": "467",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "William D. Richards",
                "href": "/profile/William-D-Richards"
            },
            "answer_text": "Connect your Kindle to your computer via a USB cableyour Kindle will appear as a storage drive on your desktop.Open “Kindle” drive on your desktop.Drag the MOBI file into the “Documents” folder on the “Kindle” drive.Close and eject the “Kindle” drive.Your book is now on your Kindle. For the record, this is called Sideloading. ",
            "date": "Answered June 11, 2020",
            "views": "86",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Jennifer Sanchez",
                    "user_href": "/profile/Jennifer-Sanchez-46"
                }
            ]
        },
        {
            "author_info": {
                "name": "Akshay Khandalkar",
                "href": "/profile/Akshay-Khandalkar"
            },
            "answer_text": "Via USB just like an external hard disk, as soon as you connect your Kindle to your computer it will show you the Kindle folder and you can paste your e-books and documents in that folder and the job is done. ",
            "date": "Updated May 24, 2018",
            "views": "746",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Rahul Padhy",
                    "user_href": "/profile/Rahul-Padhy-3"
                },
                {
                    "user_id": "Jayakumar Chandrasekharan",
                    "user_href": "/profile/Jayakumar-Chandrasekharan"
                }
            ]
        },
        {
            "author_info": {
                "name": "Pravin Menon",
                "href": "/profile/Pheno-Menon-2"
            },
            "answer_text": "Use the data cable that comes with it. More about Kindle in my blog All about Amazon Kindle, reading & Kindle Unlimited. Common queries ",
            "date": "Answered May 25, 2017",
            "views": "409",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Sriharsha Modukuri",
                    "user_href": "/profile/Sriharsha-Modukuri"
                }
            ]
        },
        {
            "author_info": {
                "name": "Jane Hernandez",
                "href": "/profile/Jane-Hernandez-52"
            },
            "answer_text": "Connect your kindle to your PC using the USB charger it came with. Your PC will detect it as a usb device. Open the folder and transfer files to “documents”. Kindle can only read kfx, mobi, azw files. ",
            "date": "Answered June 10, 2020",
            "views": "55",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Pooja Kadambi",
                "href": "/profile/Pooja-Kadambi"
            },
            "answer_text": "There is also a Kindle App for your computer which will allow you to do this. I dont think it will let you put is as a PDF which will allow for printing and sharing though there are some programs that can do this. ",
            "date": "Answered May 6, 2017",
            "views": "77",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Brian Hoffman",
                "href": "/profile/Brian-Hoffman-138"
            },
            "answer_text": "First your manuscript must be compiled into the proper format. Scrivener and Velum are examples of programs that can do this. Then follow the instructions on the Kindle website. ",
            "date": "Answered June 10, 2020",
            "views": "38",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Srikumar Krishna Iyer",
                "href": "/profile/Srikumar-Krishna-Iyer"
            },
            "answer_text": "Yes..Just connect it via USB & drag & drop the files to the Kindle Docs directory. thats it. You will instantly find the eBook in the home page of your Kindle. ",
            "date": "Answered June 1, 2017",
            "views": "257",
            "upvotes": "0"
        }
    ]
}