{
    "title": "How faithful to the books are the How To Train Your Dragon movies? - Quora",
    "tags": [
        "Book to Movies",
        "How to Train Your Dragon (book series)",
        "How to Train Your Dragon Series",
        "How To Train Your Dragon 2 (2014 movie)",
        "How To Train Your Dragon (2010 movie)"
    ],
    "response": [
        {
            "author_info": {
                "name": "Joshua Nguyen",
                "href": "/profile/Joshua-Nguyen-60"
            },
            "answer_text": "How To Train Your Dragon is one of my favorite movies of all time with incredible music, a relatable protagonist, and excellent animation. The themes are hard-hitting and heartfelt, and the storytelling and pacing are near perfect. However… This is Percy Jackson and Artemis Fowl levels of book inaccuracy (with HTTYD being the exception of actually being a movie).  Let’s list off some differences that I remember since I don’t read the books years ago. The key difference is that humans and dragons coexist in the books while they don’t in the movies. Dragons are seen as pets in the book while the movie shows that they are the enemy. The coexistence of humans and dragons is brought up near the end of the series while sort of just existing in the back of the stories.Another key difference is the Toothless’s. The movie’s Toothless is a Nightfury meant to be feared by all while book Toothless is a one of the smaller dragons as well as one of the brattier.Hiccup is a normal weakling teenager in the movies, but book Hiccup is (I believe) a middle schooler. Book Hiccup also has the ability to speak a dragon language called “Dragonese” and is the only one to speak this language.Hiccup in the movies has a squad of dragon riders in Astrid, Snotlout, Fishlegs, Ruff, and Tuff. Book Hiccup only has two friends, Fishlegs (Hiccup’s best friend) and this girl named Camicazi from a local tribe. I believe she was the inspiration for Astrid. Snotlout exists, but he’s Hiccups cousin as well as bully.Hiccup’s archenemy is a guy named Alvin who I believe shows up in the cartoon series.Reading is looked down upon in the books with the exception of a manual on training dragons. What I’m about to present to you is a word-for-word interpretation of the inside of the dragon manual that was proudly published and looked upon by the elders in the village. As you can tell, the books and movies are pretty dang different. Have fun stormin’ the castle! It’ll take a miracle! Joshua Nguyen ",
            "date": "Answered June 26, 2020",
            "views": "525",
            "upvotes": " View 4 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Anina Garcia",
                    "user_href": "/profile/Anina-Garcia-1"
                },
                {
                    "user_id": "Jonathon Cole",
                    "user_href": "/profile/Jonathon-Cole-9"
                },
                {
                    "user_id": "Steven Elijah Mack",
                    "user_href": "/profile/Steven-Elijah-Mack"
                },
                {
                    "user_id": "Brianna King",
                    "user_href": "/profile/Brianna-King-133"
                }
            ]
        },
        {
            "author_info": {
                "name": "Aaron Everard",
                "href": "/profile/Aaron-Everard-1"
            },
            "answer_text": "Faithful in theme perhaps, nothing else really. The characters are completely different (mostly.) Hiccup has red hair, Snotlout is his taller cousin, Tuffnut is 99% irrelevant, Fishlegs is an asthmatic twig, Astrid and Ruffnut don’t exist, Stoick and Gobber are much dumber and Toothless can fit on Hiccups shoulder. If that's not enough to convince you that they are vastly different, the dragons speak. Granted it’s their own langue, but Hiccup can speak it. They’re both amazing in their own ways, but they are way too different to even be compared fairly. ",
            "date": "Answered May 27, 2019",
            "views": "309",
            "upvotes": "0"
        }
    ]
}