{
    "title": "How to earn money from writing novels? How do I publish a novel - Quora",
    "tags": [
        "Novel Writing",
        "Book Publishing",
        "Publishing",
        "Creative Writing",
        "Novels",
        "Writing",
        "Wanting and Making Money",
        "Books"
    ],
    "response": [
        {
            "author_info": {
                "name": "Abhinav Singh",
                "href": "/profile/Abhinav-Singh-1836"
            },
            "answer_text": "When it comes to writing books/ novels as a means of earning money - you have to understand that it is a very old profession. There are hundreds of thousands of novels published each year and it has become a very competitive marketplace. Being said that, there are two basic modes of publishing- Regular publishing and Self publishing In regular publishing you only have to focus on your craft of writing and send your manuscript to publishers. If it is accepted, we’ll you are an author. But it is easier said than done - way easier. The regular publishing houses - Like Penguin or others have a pipeline of manuscripts waiting to be seen and accepted. The ratio of acceptance is less than one in a hundred. Their editors don’t have time to read beyond a couple of pages. The least priority goes to a debutant, with no prior achievements or a profile. And it’s not their fault totally. They have to put in a lot of commitment, money and resources to promote the book. They have to make sure that it is really really good book. If your book is published, the money that an author receives is 8~10 percent of the book value. If your story is good, your novel can can move further to become a movie or an Internet series. Well you start to make money - The case study of JK Rowling or Stefen King would be recommended for you. Please look them up. Next is the self publishing- and this world has seen its share of wonderful self published authors. For example - The Martian by Andy Weir, was such a book that went to become a successful movie. The book becomes entirely your baby - from writing to editing to promotion and sales. It’s hell of a task. ( I’m a self published author - Trust me, I know) I spent two years writing my last book and now I have to worry about author website and social media reach, of which I know nothing about. No matter how your book is, you can self publish it on a lot of platforms including Amazon KDP. You don’t have to wait in line for months to get accepted. You just don’t have to be a fantastic writer but must also be a smart business person too. In simple words - your book becomes your business. And if it is your business, it will also need your investment. Reaching out to people is your problem and you have to spend Money on that.. Your business skills, PR skills, social network both online and offline will help you in this… But the rewards are also yours. You own all the rights to your book and you control its direction. Hope that helps.. ",
            "date": "Answered May 28, 2020",
            "views": "172",
            "upvotes": " View 2 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Old Soldier",
                    "user_href": "/profile/Old-Soldier-2"
                },
                {
                    "user_id": "Misha Bharti",
                    "user_href": "/profile/Misha-Bharti-45"
                }
            ]
        },
        {
            "author_info": {
                "name": "Kiran",
                "href": "/profile/Kiran-1346"
            },
            "answer_text": "Some of few ways through which author can earn money are: Book advanceAn advance is money that is given to an author from a publishing company before the book comes out. Advances are usually given to authors who have a track record of publishing best-selling books or have a very high possibility of becoming a best-seller. Only authors with a publishing contract can earn advances. For an average author with a first-time book deal, receiving an advance is very rare. It’s usually $5,000 to $20,000. It’s called an advance because you have to pay it back with your book sales. 2. Royalties Both self-published and authors working with a publishing company can earn royalties. Royalties are money given to an author after a book is published and sold. As an authors, you receive a percentage of the sale, depending on how you published your book. If you work with a publishing company, a part of your royalties must go the publisher, an agent, and then you. If you are a self-published author, you still have to pay the company that helped your book get published. In many cases, this is Amazon. By ditching a professional publisher, you get a higher percentage of your book sales. Another strategy to make more money on direct book sales is to create your book in different formats. This includes digital, paperback, hardback, and audio. This will help you reach a larger audience, because each consumer chooses the format they’re more comfortable with. You can publish you book either with any traditional publisher which is a very difficult thing to do. Another option is any Self Publishing house like BecomeShakespeare which can be an easy and affordable option. ",
            "date": "Answered June 2, 2020",
            "views": "39",
            "upvotes": " Answer requested by George Justin",
            "upvoters": [
                {
                    "user_id": "George Justin",
                    "user_href": "/profile/George-Justin-13"
                }
            ]
        },
        {
            "author_info": {
                "name": "Manisha Gala",
                "href": "/profile/Manisha-Gala-14"
            },
            "answer_text": "In India, it is very difficult to make money from writing novels. Every publisher has piles of scripts to look at and most of them are lost with time. But with the new rise of self-publishing platforms, the future looks better. KDP (Kindle Direct Publishing) has been pretty effective and also controls plagiarising. Its global reach helps the book to reach various corners of the world. Many people, who are subscribers of Kindle unlimited program, do read books that are available free to them. Amazon pays some part of the raised fund to writers based on the number of pages read by members. Not just writing, good marketing is also needed to sell a book. Also, one needs to bulk up in terms of writing. Merely writing one or two books and watching a dream of becoming a best-seller writer is not done. One needs to keep on writing. Even if one book catches readers’ attention and becomes a best-seller, readers will start looking for other books written by the same author. Another source of income could be a novel selected for making a web series or TV soap or film. That brings substantial money and fame to the writer. ",
            "date": "Answered May 30, 2020",
            "views": "42",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "George Justin",
                    "user_href": "/profile/George-Justin-13"
                }
            ]
        },
        {
            "author_info": {
                "name": "Cleo Azure",
                "href": "/profile/Cleo-Azure"
            },
            "answer_text": "Hi, In the present situation of the world, I would recommend you to proceed with online publishing and publicity methods. My approach to the answer to your question will keep a focus on this. However, you may, in parallel, look for offline methods and traditional publishing as well. Recently, an individual had a question on Quora \"Is it possible that I write novels and then travel the whole world by the money I earn through it?\" Check this link for my detailed answer. Here's a picture that may inspire you to start today.  Thanks, Cleo ",
            "date": "Answered June 6, 2020",
            "views": "70",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Sathi Balram",
                "href": "/profile/Sathi-Balram"
            },
            "answer_text": "Well, it depends upon your writing. If you know the art of expressing your emotions into the words. People will definitely admire you. You should follow your 💓 and try to focus on the themes which is helpful for the young generation. There are any publishers. If they like your content, they will definitely help you. There are other platforms for publication too. Nowadays you can publish them online. So the matter is not about getting publisher, but for writing a good content. Hope, you will focus on this and try to write something for the betterment of human soul. ",
            "date": "Answered May 28, 2020",
            "views": "17",
            "upvotes": " Answer requested by George Justin",
            "upvoters": [
                {
                    "user_id": "George Justin",
                    "user_href": "/profile/George-Justin-13"
                }
            ]
        },
        {
            "author_info": {
                "name": "Hemalatha Gnanasekar",
                "href": "/profile/Hemalatha-Gnanasekar-1"
            },
            "answer_text": "You can write a novel and get it published through amazon’s Kindle direct publishing. You can then start marketing/promoting your ebooks to earn money. To start with, you can write some 5000 words short non fiction ebooks that people will find useful. ",
            "date": "Answered May 28, 2020",
            "views": "18",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "George Justin",
                    "user_href": "/profile/George-Justin-13"
                }
            ]
        },
        {
            "author_info": {
                "name": "Deboleena Das",
                "href": "/profile/Deboleena-Das-8"
            },
            "answer_text": "You'll have to write in a grammatically correct manner. You can approach publishing houses with your novel. If the novel is published and sells well, you can earn money. ",
            "date": "Answered May 28, 2020",
            "views": "20",
            "upvotes": " View 1 Upvoter "
        },
        {
            "author_info": {
                "name": "Mythily Venkatesh",
                "href": "/profile/RV-Mythily"
            },
            "answer_text": "Royalties are money given to an author after a book is published and sold. As an authors, you receive a percentage of the sale, depending on how you published your book. If you work with a publishingcompany, a part of your royalties must go the publisher, an agent, and then you. ",
            "date": "Answered May 28, 2020",
            "views": "17",
            "upvotes": " View 1 Upvoter "
        }
    ]
}