{
    "title": "How is your experience with Goodreads? - Quora",
    "tags": [
        "Goodreads"
    ],
    "response": [
        {
            "author_info": {
                "name": "Ravi Mishra",
                "href": "/profile/Ravi-Mishra-979"
            },
            "answer_text": "Goodreads is a website that allows users to freely search its database of books, annotations, and reviews. It is the world’s largest site for readers and book recommendations with 80 million members and 2.3 billion added books as on 6th March 2019.  It has got popularity because users can track the books they are reading, have read, and want to read. Users interact with each other and discuss about books, post book reviews and create reading lists. I like their work and their mission. But I don't find it helpful in keeping my reading lists. I prefer to create my reading lists and to track my reading by writing it in my diary. Being in offline mode helps me to focus on my reading goals. I discuss about books in person with my bibliophile companions. Goodreads helps me only in searching some quotes from some best known books. It is the best thing about Goodreads that it allows users to freely search a huge collection of quotes. But it needs improvements because some best books category have almost no quotes in them. It is also very useful in promoting books/blogs for authors, writers, bloggers and novelists. I don't have any blog as on 6th March, 2019. If I start a blog then I will consider to use Goodreads to connect with the largest group of bibliophiles. It is my personal opinion. Goodreads is helpful to me only in searching quotes and annotations. I wish to be an active member of Goodreads after I start my blog. Thank you for reading ! ",
            "date": "Answered March 5, 2019",
            "views": "123",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Pushkar Tripathi",
                    "user_href": "/profile/Pushkar-Tripathi-2"
                }
            ]
        },
        {
            "author_info": {
                "name": "Sharadha Jayaraman",
                "href": "/profile/Sharadha-Jayaraman"
            },
            "answer_text": "Well favourable, so far. It’s introduced me to a few bookish terms and activities that I wasn’t aware of in the past. TBR shelf - books to be read, it’s usually the largest stack of anything a bookworm will proudly possess. Example usage, “[that book] is in my TBR.”Buddy reads - an interactive and compelling activity that helps to tackle books that you won’t be able to gobble up alone. Makes room for healthy discussions and friends, of course.Challenges and even more challenges - Popsugar, Book Riot, Best-of’s, 52 books in 52 weeks, and tons of more challenges keep you well occupied for the year (only, you LOVE this activity!)Friends - The bookworm community is a really bunch of warm and welcoming wallflowers.As long as you don’t get sucked into bizarre reviews and ratings or write/rate some yourself, you’re pretty safe :) ",
            "date": "Answered February 8, 2019",
            "views": "112",
            "upvotes": " View 3 Upvoters ",
            "upvoters": [
                {
                    "user_id": "AMIT",
                    "user_href": "/profile/AMIT-390"
                },
                {
                    "user_id": "Ravi Babu",
                    "user_href": "/profile/Ravi-Babu-3"
                },
                {
                    "user_id": "Pushkar Tripathi",
                    "user_href": "/profile/Pushkar-Tripathi-2"
                }
            ]
        }
    ]
}