{
    "title": "How does the film adaptation affect books? - Quora",
    "tags": [
        "Movie Adaptations",
        "Book to Film Adaptations",
        "Books"
    ],
    "response": [
        {
            "author_info": {
                "name": "Steve Grey",
                "href": "/profile/Steve-Grey"
            },
            "answer_text": "Probably not much. Depends on how good the film is. I saw an interview with an author who was asked how he felt about a movie adaptation “ruining his book.” His answer was, essentially, the movie did not ruin his book. There it was…right on the shelf. Anyone can pick it up and read it just as if there had been no movie. Films and books are different. They have to tell the story in a different way. You can have a great movie based on a book that wasn't all that good. Maybe the book has too much detail, too much many plot points, or dialogue that doesn't ring true. A filmmaker can fix that in the retelling. That doesn't make the book any better. A bad adaptation might have an affect on book sales—though I'm not sure it would be significant. A person may decide not to read a book based on a bad movie version. But, I expect that those people would either prefer movies over books or would use other sources (book review, word of mouth) to decide whether to read it. On the other hand, it's certainly possible that a great adaptation would get people interested in reading the book. Thanks for the A2A. ",
            "date": "Answered April 1, 2017",
            "views": "693",
            "upvotes": " View 4 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Yashi Srivastava",
                    "user_href": "/profile/Yashi-Srivastava-126"
                },
                {
                    "user_id": "Mark Ballinger",
                    "user_href": "/profile/Mark-Ballinger-3"
                },
                {
                    "user_id": "Asma Asma",
                    "user_href": "/profile/Asma-Asma-29"
                },
                {
                    "user_id": "Muhammed Vaseem",
                    "user_href": "/profile/Muhammed-Vaseem"
                }
            ]
        },
        {
            "author_info": {
                "name": "Matthew Haynes",
                "href": "/profile/Matthew-Haynes-1"
            },
            "answer_text": "Well, adaptations, don't generally affect the plots of books; look at the changes to the Harry Potter series adaptations. The books don't change from it at all. A good adaptation can help book sales: look at Jurassic Park, The Hunger Games, or Jaws. All of these saw increases in sales thanks to their phenomenal movie versions. However, the awful adaptation of The da Vinci Code knocked it off the best-sellers list. In other cases, nothing much happened with the book at all- The Lord of the Rings and The Lorax were already classics when their adaptations came out, and saw little change to sales. Neither did “The Curious Case of Benjamin Button” or The Great Gatsby, similarly classics both, and older than the other two. The main thing that can happen is increased sales, even with badly done adaptations: how many times have you heard: “oh, it's better in the book, you should read it” in reference to an adaptation? It might be irritating, but it helps the book sales, and even with really good adaptations, movie watchers will pick up the novel out of curiosity, as I did many years ago with Jurassic Park and Lord of the Rings.  ",
            "date": "Answered April 3, 2017",
            "views": "617",
            "upvotes": " View 2 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Asma Asma",
                    "user_href": "/profile/Asma-Asma-29"
                },
                {
                    "user_id": "Hamza Shaikh",
                    "user_href": "/profile/Hamza-Shaikh-3"
                }
            ]
        }
    ]
}