{
    "title": "How to make money from my self published free e-book - Quora",
    "tags": [
        "Free Books",
        "Free Ebooks",
        "Book Publishing",
        "Publishing",
        "eBooks",
        "Free Products",
        "Books"
    ],
    "response": [
        {
            "author_info": {
                "name": "James Poulson",
                "href": "/profile/James-Poulson"
            },
            "answer_text": "The question asked is: How can I make money from my self published free e-book? The e-book is free so you obviously can't make money from that. However, you could have a landing page to harvest e-mail adresses from people wanting to download the e-book and the e-book itself could serve as an introduction. Either you have some paid content ready (more in-depth e-books or something else) for those wanting to know more or it can lead to someone paying a service or paying you in particular for the benefit you can bring. That's all I can think of for now. Feel free to comment. Related link: What are all the ways to monetize an ebook?  ",
            "date": "Answered February 8, 2016",
            "views": "352",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Jo Hale",
                    "user_href": "/profile/Jo-Hale-13"
                },
                {
                    "user_id": "Deep Kumar",
                    "user_href": "/profile/Deep-Kumar-54"
                }
            ]
        },
        {
            "author_info": {
                "name": "Andrea Claus Ring",
                "href": "/profile/Andrea-Claus-Ring"
            },
            "answer_text": "It is against Amazon’s TOS to put affiliate links in your ebook, so don’t. The only way to make money from a free book is to use it as a funnel to other products. For example, if you write a series, you can make Book 1 free, and readers who like Book 1 will go on to buy the rest of the series. As someone else noted, you can also use a free ebook to boost your mailing list sign-ups. But again, the only purpose in having a mailing list is so that you get them to buy something in the future. That means having other products. Free books are loss leaders, and they allow a customer to try an unknown author without any risk. But a free book alone won’t bring you any money. ",
            "date": "Answered June 28, 2016",
            "views": "222",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Wallace Phillips",
                    "user_href": "/profile/Wallace-Phillips-6"
                },
                {
                    "user_id": "Camila Watts",
                    "user_href": "/profile/Camila-Watts"
                },
                {
                    "user_id": "Genesis Prescott",
                    "user_href": "/profile/Genesis-Prescott"
                },
                {
                    "user_id": "Heather Howell",
                    "user_href": "/profile/Heather-Howell-85"
                }
            ]
        },
        {
            "author_info": {
                "name": "Shankar Sardar",
                "href": "/profile/Shankar-Sardar-1"
            },
            "answer_text": "Very few people make money via self-published books. One good way is to convert book into a mobile app that would also sell related services and content and continue to provide community experience. That is what I have done with some of my books and they still dont make ton of money.  ",
            "date": "Answered February 8, 2016",
            "views": "73",
            "upvotes": "0"
        }
    ]
}