{
    "title": "How to get schizophrenia - Quora",
    "tags": [
        "Schizophrenia",
        "Psychology"
    ],
    "response": [
        {
            "author_info": {
                "name": "Jane Smith",
                "href": "/profile/Jane-Smith-1890"
            },
            "answer_text": "Most other posters will tell you there is no way to do this. Schizophrenia is a disease with complex biological factors, but I truly believe there are ways to induce the symptoms in yourself. How do I know? I've done it to myself. I've lived with something called Munchausen's Syndrome from an extremely young age. Munchausen's Syndrome is a mental disorder where people fabricate illness for emotional and psychological support. (This condition can be distinguished from malingering, where patients have the same behaviors, but with more concrete and obvious motivations, such as financial gain.) Since I was four years old, I've found deep happiness in imagining myself in a hospital, people surrounding me and comforting me and giving me care. I believe this process comes from my experience with cancer at the age of 7 months old, when I was cared for by my mother, who left the family when I was 2, a few months after I had recovered for various reasons. In turn, I was subconsciously taught that \"being sick\" was the best way to receive attention and love that I lost when my mother left. Throughout my childhood, these fantasies grew more and more extreme, to the point where by the age of 9, many of my most pleasurable experiences originate from an intricate fantasy life where I was permanently hospitalized, had persistent health crises, and with each one was given more and more care from nurses, other children, teachers at school, and other members of the community. By then, my condition had progressed into feigning illness in the real world. I constantly complained to my father, a workaholic who spent most of his time in his high powered job and was not emotionally involved in my upbringing, of imaginary headaches. He was a neglectful parent who has been physically abusive. I invented ingenious ways of convincing him I was too sick to go to school, and on two separate occasions, did it severely enough that my doctors were concerned I may have had a reoccurrence of the cancer I'd experienced in my infancy. I made myself cry, but in truth, this news delighted me. When they told me I was perfectly healthy, I was crushed. When I was 11 years old, I was given complete accessibility to the internet. This took my condition to new levels. I would spend hours a day reading medical websites and stories of individuals who had suffered any days under the sun. I longed to be one of them. After gaining a large arsenal of medical knowledge, I successfully faked appendicitis and had my appendix removed at age 14, after a number of smaller escapades that resulted in a diagnosis of clinical depression and cluster headaches. I have always been a rather reserved and introverted person - not the type of histrionic personality that one would expect to see going to such extreme lengths for attention. I've had difficulties making lasting friendships. Meanwhile, my father grew more and more distant into my teen years, to the point where on weekdays, I would often see him for little more than 20 minutes a day, in which we would have strained conversations that were cordial at best and tense at worst. These two factors combined meant that I lived in near total isolation. My only periods of comfort were the care I got when I went to the doctor. Yet no matter how hard I tried, I could not shake off the pervading sense that I was worthless, that no one would ever love me. That is, not unless I played the role of a patient. At the age of 16, after a few more brushes with fabricated symptoms, including but not limited to self harming and purposely infecting the scars (resulting in a nasty wound that I had to keep covered), taking small doses of my father's medication that made me feel queasy and nauseous, and telling people at school I had ongoing medical issues, I decided I couldn't keep doing this anymore. I figured I needed to develop a chronic illness, something that would make me incapacitated, require the around the clock care that I wished for at the bottom of my heart. So as a last resort, I decided to go insane. I spent the next few months doing intensive research on schizophrenia, plotting and daydreaming about my descent into the illness. Three years later, I wasn't faking it anymore. I was hospitalized for three months. Of course it's possible that in a twist of fate, my real disorder happen to coincide with my factitious disorder. Maybe my fake illness was only a precursor to my real one, and was not the cause. But I honestly believe that part of the reason I have this illness is because I gave it to myself. I convinced myself to the point where I was no longer pretending. So how do you give yourself schizophrenia? I would highly encourage you to NOT actually do this. - Everything is an auditory hallucination. People have something called \"top down processing\", in which we interpret events based on deductive reasoning and our previous perceptual sets and mental state. By thinking enough about hearing voices, you slowly propel yourself into a hyper-awareness where you can make out voices in the background of everything. Hear that person scuffling along with their shoes? You can train yourself to perceive it a voice. Those leaves rustling outside in the wind? A whole conversation. - Isolate yourself, until all you are left with is your own thoughts, which will race until they reach a terrifying stage. You will become depressed. This is the early stage. - Dig into your own psyche. Schizophrenia may be primarily biological, but the ways in which it manifests often mirror people's psychological issues. By understanding your own mind, becoming aware of your darkest fears, you can craft delusions that instill such a sense of primal fear that takes over your consciousness, despite logically knowing that you created them yourself. By the time I was 16, I was very aware that I suffered severe abandonment issues, and that I was incredibly resentful of my father. So I made myself believe my father was trying to kill me - a metaphor for his neglect, and killing of the side that allowed me to connect with other people. I taught myself to believe that I was at the center of a mind control conspiracy in which the government was attempting to keep me away from other people and imprison me inside myself. I became convinced that my words were not my own, and that my true self was purposefully prevented from interacting. This evolved so that I believed I was dangerous - that my very essence and could kill other people, and that was why I was trapped in this conspiracy. Eventually, I thought I was murdering people halfway across the world just by thinking. This represented my fundamental believe that I was unlovable and would only hurt people. I hallucinated whispers, in which I heard people telling me I was worthless and I should commit suicide. After awhile, I was floridly psychotic. To this day, I require medication and do not feign my condition. Through careful introspection when I was 16, I based my false delusions around my actual fears. Although the illness was fake at first, this activated at primal response of fear, and I gradually became genuinely paranoid and scared. The trick is to learn how to manipulate your own mind. Perhaps I am a monster for doing these things. For longing for conditions that people fight every day of their life to go away, that take the lives of so many people. But this is who I am, and I am taking small steps towards recovery of this deeper issue. The truth is that I will never completely recover from schizophrenia. It is a horrific illness, and has destroyed years of my life. But if I go too far into my recovery, I sabotage myself by stopping my medications, telling my doctors they aren't working so they give me higher dosages with increased side effects so I require further treatment. I hate having this illness, but I am stuck in limbo because I can't fully allow myself to become well. No one has figured out that I've ever fabricated illness at all. At least, not that I know of. Luckily, my symptoms are manageable. Although I hear voices and deal with paranoia, I can live indepdently and I am pursuing a career in nursing. (I obviously have a natural inclination towards medicine, and I had extensive knowledge before I even began the program). As far as my Munchausen's Syndrome, I've gotten to the point where I no longer fake sickness that I don't have, induce symptoms in myself, or lie to anyone. This is a feat for me - I am single and have only one close friend. I know engaging in factitious illness behavior is incredibly morally wrong and self destructive, and for over two years, I been able to confine my desire to do this to my fantasy life. I've worked through many of my issues on my own and I want to become a contributing member of society. I desperately hope that one day, I'll find love. ",
            "date": "Answered November 28, 2018",
            "views": "107",
            "upvotes": " View 59 Upvoters ",
            "upvoters": [
                {
                    "user_id": "James Thomas",
                    "user_href": "/profile/James-Thomas-2407"
                },
                {
                    "user_id": "Shelly Harris",
                    "user_href": "/profile/Shelly-Harris-55"
                },
                {
                    "user_id": "Bernael Execite",
                    "user_href": "/profile/Bernael-Execite"
                },
                {
                    "user_id": "Andrew Simo",
                    "user_href": "/profile/Andrew-Simo-1"
                },
                {
                    "user_id": "Cameron Kemp",
                    "user_href": "/profile/Cameron-Kemp-14"
                },
                {
                    "user_id": "Rohan Mishra",
                    "user_href": "/profile/Rohan-Mishra-334"
                },
                {
                    "user_id": "Ashanti Young",
                    "user_href": "/profile/Ashanti-Young-12"
                },
                {
                    "user_id": "Ethan Trulson",
                    "user_href": "/profile/Ethan-Trulson"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/Cyprus-Savage"
                },
                {
                    "user_id": "C Baka",
                    "user_href": "/profile/C-Baka"
                },
                {
                    "user_id": "Rosie Raspberry",
                    "user_href": "/profile/Rosie-Raspberry"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/Beautiful-Tragedy-17"
                },
                {
                    "user_id": "Clay Matthew T",
                    "user_href": "/profile/Clay-Matthew-T"
                },
                {
                    "user_id": "Nirmala Pauline",
                    "user_href": "/profile/Nirmala-Pauline"
                },
                {
                    "user_id": "nazhif",
                    "user_href": "/profile/nazhif"
                },
                {
                    "user_id": "Java Gahara",
                    "user_href": "/profile/Java-Gahara"
                },
                {
                    "user_id": "Everett Rose",
                    "user_href": "/profile/Everett-Rose-2"
                },
                {
                    "user_id": "Antaressa Rasta",
                    "user_href": "/profile/Antaressa-Rasta"
                },
                {
                    "user_id": "Jean Phillips",
                    "user_href": "/profile/Jean-Phillips-12"
                },
                {
                    "user_id": "Dominic Woodruff",
                    "user_href": "/profile/Dominic-Woodruff-2"
                },
                {
                    "user_id": "Ellen M",
                    "user_href": "/profile/Ellen-M-51"
                },
                {
                    "user_id": "Sandra Monserrat",
                    "user_href": "/profile/Sandra-Monserrat"
                },
                {
                    "user_id": "Lesley Maore",
                    "user_href": "/profile/Lesley-Maore"
                },
                {
                    "user_id": "Aly",
                    "user_href": "/profile/Aly-4-1"
                },
                {
                    "user_id": "Kayla Medling",
                    "user_href": "/profile/Kayla-Medling-1"
                },
                {
                    "user_id": "Grace Rossman",
                    "user_href": "/profile/Grace-Rossman"
                },
                {
                    "user_id": "Ayia Hassan",
                    "user_href": "/profile/Ayia-Hassan-1"
                },
                {
                    "user_id": "Rico Gonzalez",
                    "user_href": "/profile/Rico-Gonzalez-4"
                },
                {
                    "user_id": "Colette Maraczy-Lawley",
                    "user_href": "/profile/Colette-Maraczy-Lawley"
                },
                {
                    "user_id": "Emma Jojo",
                    "user_href": "/profile/Emma-Jojo-2"
                },
                {
                    "user_id": "Salem Harris",
                    "user_href": "/profile/Salem-Harris"
                },
                {
                    "user_id": "Karan Mehta",
                    "user_href": "/profile/Karan-Mehta-8"
                },
                {
                    "user_id": "Hamza Muhammad",
                    "user_href": "/profile/Hamza-Muhammad-69"
                },
                {
                    "user_id": "Hovhannes W. Letman",
                    "user_href": "/profile/Hovhannes-W-Letman"
                },
                {
                    "user_id": "Dasha Alkina",
                    "user_href": "/profile/Dasha-Alkina"
                },
                {
                    "user_id": "Carol Busato",
                    "user_href": "/profile/Carol-Busato"
                },
                {
                    "user_id": "Valerie Sanderson",
                    "user_href": "/profile/Valerie-Sanderson-8"
                },
                {
                    "user_id": "Liam Wilo",
                    "user_href": "/profile/Liam-Wilo"
                },
                {
                    "user_id": "Melissa Soliday",
                    "user_href": "/profile/Melissa-Soliday"
                },
                {
                    "user_id": "Haile-Mariam Oba",
                    "user_href": "/profile/Haile-Mariam-Oba"
                },
                {
                    "user_id": "Faris Bader",
                    "user_href": "/profile/Faris-Bader-3"
                },
                {
                    "user_id": "Helena Weltson",
                    "user_href": "/profile/Helena-Weltson"
                },
                {
                    "user_id": "Hans Buns",
                    "user_href": "/profile/Hans-Buns"
                },
                {
                    "user_id": "Adrian Popa",
                    "user_href": "/profile/Adrian-Popa-14"
                },
                {
                    "user_id": "Emilie Conneely",
                    "user_href": "/profile/Emilie-Conneely-1"
                },
                {
                    "user_id": "Claire",
                    "user_href": "/profile/Claire-1680"
                },
                {
                    "user_id": "Mshamba Moses",
                    "user_href": "/profile/Mshamba-Moses"
                },
                {
                    "user_id": "Leo Valdez",
                    "user_href": "/profile/Leo-Valdez-80"
                },
                {
                    "user_id": "April M. Hamm",
                    "user_href": "/profile/April-M-Hamm"
                },
                {
                    "user_id": "Alice Saumensch",
                    "user_href": "/profile/Alice-Saumensch"
                },
                {
                    "user_id": "Chris Dangelo",
                    "user_href": "/profile/Chris-Dangelo-4"
                },
                {
                    "user_id": "Deborah Joy",
                    "user_href": "/profile/Deborah-Joy-19"
                },
                {
                    "user_id": "Antonia Williams",
                    "user_href": "/profile/Antonia-Williams-10"
                },
                {
                    "user_id": "Tori Bryant",
                    "user_href": "/profile/Tori-Bryant-8"
                },
                {
                    "user_id": "Wafi Alimi",
                    "user_href": "/profile/Wafi-Alimi"
                },
                {
                    "user_id": "Nora Sarkozy-DeBardeleben",
                    "user_href": "/profile/Nora-Sarkozy-DeBardeleben"
                },
                {
                    "user_id": "Tamara Radojičić",
                    "user_href": "/profile/Tamara-Radojičić"
                },
                {
                    "user_id": "Soraya Huntink",
                    "user_href": "/profile/Soraya-Huntink"
                },
                {
                    "user_id": "Eileen Adair",
                    "user_href": "/profile/Eileen-Adair"
                }
            ]
        },
        {
            "author_info": {
                "name": "Simon Chatzigiannis",
                "href": "/profile/Simon-Chatzigiannis"
            },
            "answer_text": "You can get schizophrenia. Ok…. let me get into my dark lab and tell you how we do it around here… First of all, schizophrenia has probably more to do with the neocortex part of the brain and less with the limbic system or the reptilian complex. Chances are people who had schizophrenia had a more advanced brain to start with. So to get schizophrenia you need to have: A more intelligent brain in some respectsA genetic predisposition to that illnessA certain type of mental adjustment which triggers the illnessNow let’s define some important concepts: Homeostasis “Homeostasis” is a characteristic unique to living beings. In simple words, it means that a person adjusts to their environment. And by adjusting, we mean a change in the way it functions. And it is a reasonable assumption to make that the purpose of that function is to ensure survival. The age when schizophrenia develops Symptoms such as hallucinations and delusions usually start between ages 16 and 30. What a coincidence. Those are key stages of the development of personality. The symptoms of schizophrenia & the interesting link to personality A common symptom of schizophrenia, not officially described as such, is confusing persons - such as watching a person talk on TV and thinking they talk to you personally. Or hearing voices in your head - again as if a person is there. Another symptom is disorganized speech and disorganized thinking. That is basically, talking or thinking inconsistently, and without connecting meanings appropriately, and without arriving at any terminating conclusion. What could be missing? I smell personalization again. Patients with schizophrenia also show impaired emotional and social behavior, such as lack of theory of mind and misinterpretation of social situations. Impaired emotional behaviour - let’s skip that for the moment - it has been overly medically discussed already. But theory of mind and social behaviour do seem to relate to personality again. Socializing is all about personality. Long story short, I have already made up my mind - I think the root of development of schizophrenia is a problem of personality. I was just writing the previous to get there. So how to reproduce schizophrenia? Given that you fulfill conditions 1 & 2, all that is needed is to create condition 3. And how do you create condition 3? As it seems, the trigger is a change in personality, which would be caused due to homeostasis. Simply put, you would have to force someone to develop a personality that is damaging to themselves. What kind of personality do we need? A very misaligned one: One that is not self-serving, not self-directed, not self-controlling. How do you obtain it? Simple… through homeostasis - place a person in an environment with other people who themselves have a personality type that would induce this type of personality to the subject. An environment controlled by someone who forces others to be so: in other words, an environment rigidly controlled by someone with another personality disorder with almost the opposite characteristics. So all we need to create condition 3 is: Put the subject in an environment with a narcissist, a psychopath, a sociopath.Let that person take all control away from the subject.Give “homeostasis” enough time to do its work.And voila… We have just produced a schizophrenic! ",
            "date": "Answered January 21, 2017",
            "views": "64",
            "upvotes": " View 42 Upvoters",
            "upvoters": [
                {
                    "user_id": "Mike King",
                    "user_href": "/profile/Mike-King-51"
                },
                {
                    "user_id": "Shelly Harris",
                    "user_href": "/profile/Shelly-Harris-55"
                },
                {
                    "user_id": "Peggy J. Rees Raser-Gross",
                    "user_href": "/profile/Peggy-J-Rees-Raser-Gross"
                },
                {
                    "user_id": "Ryder Wright",
                    "user_href": "/profile/Ryder-Wright-1"
                },
                {
                    "user_id": "Lia",
                    "user_href": "/profile/Lia-201"
                },
                {
                    "user_id": "Dominic Woodruff",
                    "user_href": "/profile/Dominic-Woodruff-2"
                },
                {
                    "user_id": "Ellen M",
                    "user_href": "/profile/Ellen-M-51"
                },
                {
                    "user_id": "Mark Calaway",
                    "user_href": "/profile/Mark-Calaway-12"
                },
                {
                    "user_id": "Carol Busato",
                    "user_href": "/profile/Carol-Busato"
                },
                {
                    "user_id": "Hallie Louis",
                    "user_href": "/profile/Hallie-Louis"
                },
                {
                    "user_id": "Emilie Conneely",
                    "user_href": "/profile/Emilie-Conneely-1"
                },
                {
                    "user_id": "Athirah Nabilah",
                    "user_href": "/profile/Athirah-Nabilah-1"
                },
                {
                    "user_id": "Shitsie H",
                    "user_href": "/profile/Shitsie-H"
                },
                {
                    "user_id": "Dan Dank Meme",
                    "user_href": "/profile/Dan-Dank-Meme"
                },
                {
                    "user_id": "Leo Valdez",
                    "user_href": "/profile/Leo-Valdez-80"
                },
                {
                    "user_id": "Laura Vysniauskiene",
                    "user_href": "/profile/Laura-Vysniauskiene"
                },
                {
                    "user_id": "Stoka Stokic",
                    "user_href": "/profile/Stoka-Stokic"
                },
                {
                    "user_id": "▪// lee",
                    "user_href": "/profile/lee-1492"
                },
                {
                    "user_id": "Ankit Pathak",
                    "user_href": "/profile/Ankit-Pathak-16"
                },
                {
                    "user_id": "Alexander Trimble",
                    "user_href": "/profile/Alexander-Trimble"
                },
                {
                    "user_id": "Justin Whipperman",
                    "user_href": "/profile/Justin-Whipperman"
                },
                {
                    "user_id": "Jane Whitacker",
                    "user_href": "/profile/Jane-Whitacker"
                },
                {
                    "user_id": "Alex Kovac",
                    "user_href": "/profile/Alex-Kovac-3"
                },
                {
                    "user_id": "Manora Kehl",
                    "user_href": "/profile/Manora-Kehl"
                },
                {
                    "user_id": "Emily Louise May",
                    "user_href": "/profile/Emily-Louise-May-エミリー-マイ"
                },
                {
                    "user_id": "Jay Sheth",
                    "user_href": "/profile/Jay-Sheth-16"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/sital-s-sam"
                },
                {
                    "user_id": "Midnight Bloodlust",
                    "user_href": "/profile/Midnight-Bloodlust"
                },
                {
                    "user_id": "Andreea Oprea",
                    "user_href": "/profile/Andreea-Oprea-2"
                },
                {
                    "user_id": "Vash Jk",
                    "user_href": "/profile/Vash-Jk"
                },
                {
                    "user_id": "Sean Rumph",
                    "user_href": "/profile/Sean-Rumph"
                },
                {
                    "user_id": "Monica Raprya",
                    "user_href": "/profile/Monica-Raprya"
                },
                {
                    "user_id": "Mary Matoza",
                    "user_href": "/profile/Mary-Matoza"
                },
                {
                    "user_id": "Diane Shatto",
                    "user_href": "/profile/Diane-Shatto"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/D-A-BRANT"
                },
                {
                    "user_id": "Boy Salvador",
                    "user_href": "/profile/Boy-Salvador"
                },
                {
                    "user_id": "Igor McKinney",
                    "user_href": "/profile/Igor-McKinney"
                },
                {
                    "user_id": "Johanna Billy",
                    "user_href": "/profile/Johanna-Billy-1"
                },
                {
                    "user_id": "Jose Hernandez",
                    "user_href": "/profile/Jose-Hernandez-478"
                },
                {
                    "user_id": "Matthew Salerno",
                    "user_href": "/profile/Matthew-Salerno"
                },
                {
                    "user_id": "Michel Gartner",
                    "user_href": "/profile/Michel-Gartner"
                },
                {
                    "user_id": "Ayhan Ağalarov",
                    "user_href": "/profile/Ayhan-Ağalarov"
                }
            ]
        },
        {
            "author_info": {
                "name": "Fubuki Numachi",
                "href": "/profile/Fubuki-Numachi"
            },
            "answer_text": "As a rule of thumb: on a population level it’s about 1 in 100. Any blood siblings or parents with schizophrenia it’d go up to 1 in 10. For twins it’s 1 in 2. So it certainty suggests that schizophrenia both have genetic and environmental components, some are more at-risk for developing the syndrome than others. That said, majority of schizophrenics have no family history. Factors like stress, trauma, drug abuse (especially marijuana), etc. can top-over your strain capacity and even trigger a psychotic episode. No one event necessarily cause schizophrenia, it’s often a confluence of many factors cumulating one on top of another. Note: schizophrenia is a psychotic disorder, meaning they’re marked by relapsing episodes of psychosis not directly associated with a mood state (e.g. bipolar with psychotic features). And it’s a long term condition, with the diagnosis criteria rather arbitrarily requiring signs of disturbance lasting continuously for >6 months and major positive component for >1 month, where other conditions are ruled out that can better explain the symptoms (e.g. brain tumour, drug-induced psychosis). Anyone even mildly familiar with schizophrenia are aware of the demarcation between positive and negative symptoms — “add-on trait” v.s. “removed trait”. There’s also cognitive symptoms, as it says in the name, that are thinking-learning deficit aspects associated with schizophrenia, such as poor memory, poor attention, disorganised thinking and speech. It could be said that psychosis is characterised by loss of stability in cognitive structures where one cannot implicitly take things for what they’re anymore; “there must be something more” or “… something amiss”, a setting stone for delusional moods that can catalyse development of suspicions into overt delusions. To patients the delusions can often be a release, even if it frightens and hurts them in the process, as they’ve alleviated the immense cognitive dissonance for not resolving the apparent senselessness or uncanny coincidences. This brings me to the model of aberrant salience… There’s also a class called ‘basic symptoms’. To my shame, I haven’t seen many articles describe them or go into depth. Some googling’ll pop-up mostly scholar papers. It’s basically a set of subjective symptoms recognised by patients along varying levels of awareness as a disturbance or divergence from normal processes in perception and cognition. Usually the patients find it difficult to put into words his/her experiences but a guided structured interview can often bring them out into the light of cognisance. They surface and remain present in all three stages of psychosis associated with schizophrenia (prodrome, acute, remission), although insight into them is usually only present during the prodromal and remission phases. Presence of these symptoms is markedly predictive in determining whether one is at an at-risk state for emergence into more frank episodes. When assessed to be in this group (say, two or more in this list occurring at least once per week for over three months but less than a year) then you’ve statistically about 50% chance of developing full-on psychosis within the next two years, 90% chance within the next decade. Cognitive and Perceptual Basic Symptoms Associated With Psychosis and Prototypic Self-observations by Patients: Thought interference, i.e., an intrusion of completely insignificant thoughts hindering concentration/thinking.Thought perseveration, i.e., an obsessive like repetition of insignificant thoughts or mental images.Thought pressure, i.e., a self-reported “chaos” of unrelated thoughts.Thought blockages either with or without intrusion of a new thought also includes a sudden loss of the thread or train of thoughts.Disturbance of receptive language, i.e., paralysis in the immediate comprehension of simple words/sentences, either read or heard, that can result in giving up reading or avoiding conversations.Disturbance of expressive speech, i.e., problems in producing appropriate words, sometimes also experienced as a reduction in active vocabulary.Disturbances of abstract thinking, i.e., an unusual basic symptom seen when asking the patient to explain sayings or idioms.Inability to divide attention between simultaneous nondemanding tasks that each draw primarily upon a different sense that would not usually require a switching of attention.Captivation of attention by details of the visual field that catches and holds the look.Decreased ability to discriminate between perception and ideas, true memories and fantasies.Unstable ideas of reference with insight.Derealisation, i.e., a decreased emotional and gestalt connection with the environment.Visual or acoustic perceptual disturbances with insight. Unlike hallucinations or schizotypal perceptual distortions, basic symptom perceptual observations are not regarded as real but are immediately recognized as a sensory or subjective problem. The knowledge that the misperception, e.g., a wrong colouring, distorted shape or changed sound quality/intensity, has no counterpart in the real world is immediate and unquestioned. Of course, for anyone self-assessing, it requires an honest and frank observations into their subjective experiences alongside fully understanding the meaning of each item. This is where meeting and discussing with a knowledgeable doc might come in, if you haven’t already. ",
            "date": "Answered April 24, 2020",
            "views": "217",
            "upvotes": " View 48 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Phyllis Jones",
                    "user_href": "/profile/Phyllis-Jones-81"
                },
                {
                    "user_id": "Furi Nasution",
                    "user_href": "/profile/Furi-Nasution"
                },
                {
                    "user_id": "Cathy Ann Smithey",
                    "user_href": "/profile/Cathy-Ann-Smithey"
                },
                {
                    "user_id": "Angela DiBart",
                    "user_href": "/profile/Angela-DiBart"
                },
                {
                    "user_id": "Marcus Godiali",
                    "user_href": "/profile/Marcus-Godiali-1"
                },
                {
                    "user_id": "Agraz Adam",
                    "user_href": "/profile/Agraz-Adam"
                },
                {
                    "user_id": "Vicki Petrou",
                    "user_href": "/profile/Vicki-Petrou"
                },
                {
                    "user_id": "Manoj Krishna Shrestha",
                    "user_href": "/profile/Manoj-Krishna-Shrestha"
                },
                {
                    "user_id": "Scott Milne",
                    "user_href": "/profile/Scott-Milne-13"
                },
                {
                    "user_id": "Savvy KItty",
                    "user_href": "/profile/Savvy-KItty"
                },
                {
                    "user_id": "Andrea Fernández",
                    "user_href": "/profile/Andrea-Fernández-10"
                },
                {
                    "user_id": "Daniela Parisi",
                    "user_href": "/profile/Daniela-Parisi-4"
                },
                {
                    "user_id": "Geoffrey Simmons",
                    "user_href": "/profile/Geoffrey-Simmons-10"
                },
                {
                    "user_id": "Zoe A",
                    "user_href": "/profile/Zoe-A-29"
                },
                {
                    "user_id": "Rudy Moon",
                    "user_href": "/profile/Rudy-Moon-2"
                },
                {
                    "user_id": "Karen Mitchell",
                    "user_href": "/profile/Karen-Mitchell-64"
                },
                {
                    "user_id": "Ara Skeit",
                    "user_href": "/profile/Ara-Skeit"
                },
                {
                    "user_id": "Polly Matthews",
                    "user_href": "/profile/Polly-Matthews-6"
                },
                {
                    "user_id": "Bastian Gahler",
                    "user_href": "/profile/Bastian-Gahler"
                },
                {
                    "user_id": "Chantell Blanchard",
                    "user_href": "/profile/Chantell-Blanchard"
                },
                {
                    "user_id": "Angel Miguel",
                    "user_href": "/profile/Angel-Miguel-38"
                },
                {
                    "user_id": "Josephine Barclay",
                    "user_href": "/profile/Josephine-Barclay"
                },
                {
                    "user_id": "Celine GREFFIER",
                    "user_href": "/profile/Celine-GREFFIER"
                },
                {
                    "user_id": "Renee Lloyd",
                    "user_href": "/profile/Renee-Lloyd-25"
                },
                {
                    "user_id": "Laura Mullen",
                    "user_href": "/profile/Laura-Mullen-16"
                },
                {
                    "user_id": "Carol Reed",
                    "user_href": "/profile/Carol-Reed-70"
                },
                {
                    "user_id": "Rebecca Nichols",
                    "user_href": "/profile/Rebecca-Nichols-12"
                },
                {
                    "user_id": "Dan Zimmerle",
                    "user_href": "/profile/Dan-Zimmerle-1"
                },
                {
                    "user_id": "Siddhartha Sah",
                    "user_href": "/profile/Siddhartha-Sah-3"
                },
                {
                    "user_id": "Lee Lord",
                    "user_href": "/profile/Lee-Lord-2"
                },
                {
                    "user_id": "Denis D",
                    "user_href": "/profile/Denis-D-43"
                },
                {
                    "user_id": "Sarah Efird",
                    "user_href": "/profile/Sarah-Efird-3"
                },
                {
                    "user_id": "Mile Navrsale",
                    "user_href": "/profile/Mile-Navrsale"
                },
                {
                    "user_id": "Adrianna Ta",
                    "user_href": "/profile/Adrianna-Ta"
                },
                {
                    "user_id": "Jean Bénichou",
                    "user_href": "/profile/Jean-Bénichou-2"
                },
                {
                    "user_id": "Nikki Fife",
                    "user_href": "/profile/Nikki-Fife-2"
                },
                {
                    "user_id": "Elisa S. T. Gillies",
                    "user_href": "/profile/Elisa-S-T-Gillies"
                },
                {
                    "user_id": "Gail Logan",
                    "user_href": "/profile/Gail-Logan-9"
                },
                {
                    "user_id": "Kaylee Ikari",
                    "user_href": "/profile/Kaylee-Ikari"
                },
                {
                    "user_id": "Carl Wheezer",
                    "user_href": "/profile/Carl-Wheezer-60"
                },
                {
                    "user_id": "Ilias Gioldasis",
                    "user_href": "/profile/Ilias-Gioldasis"
                },
                {
                    "user_id": "Jacob Garrison",
                    "user_href": "/profile/Jacob-Garrison-11"
                },
                {
                    "user_id": "Sabat Umar",
                    "user_href": "/profile/Sabat-Umar-1"
                },
                {
                    "user_id": "Solange Wilkins",
                    "user_href": "/profile/Solange-Wilkins"
                },
                {
                    "user_id": "Kleopatra Fuentes",
                    "user_href": "/profile/Kleopatra-Fuentes"
                },
                {
                    "user_id": "Heather Stark",
                    "user_href": "/profile/Heather-Stark-6"
                },
                {
                    "user_id": "Hovhannes W. Letman",
                    "user_href": "/profile/Hovhannes-W-Letman"
                },
                {
                    "user_id": "Hamza Muhammad",
                    "user_href": "/profile/Hamza-Muhammad-69"
                }
            ]
        },
        {
            "author_info": {
                "name": "Mikaila Straatsma",
                "href": "/profile/Mikaila-Straatsma"
            },
            "answer_text": "How to induce schizophrenia in a predisposed brain: Be predisposed - have mental illness or addiction in your family? Have a few neurotic people that are hard to get along with? Strange relatives? Great.Trigger your epigenetics.Chemically: Smoke methamphetamine for 3 days straight, do 3 blotters of LSD alone at night, take 10 grams of psilocybin, stay up for 4 days without sleep, take a copious dose of MDMA or an SSRIEnvironmentally: Constantly watch tragedies on the news, listen closely to the radio - it’s telling you something special, live in a busy city, listen to the noise in the background - something is there, enter dangerous situations to activate your HPA and get some adrenaline in that brain of yours, read into conspiracy theories, watch out for your phone, STAY AWAKESocially: Join a cult, never talk to anyone ever again - they want to hurt you, don’t tell your secrets to your family - they won’t believe youBehaviourally: Write excessively at night, sit in silence to stir up your mind to over-interpret latent information, engage in risky behaviour, stay away from people - they know.Cognitive tricksYes, they DID know what you were thinking when you thought it and yes you DID put that into their mind because you ARE who you think you are",
            "date": "Answered November 30, 2018",
            "views": "55",
            "upvotes": " View 16 Upvoters",
            "upvoters": [
                {
                    "user_id": "Vivienne Bonnaire",
                    "user_href": "/profile/Vivienne-Bonnaire"
                },
                {
                    "user_id": "Dominic Woodruff",
                    "user_href": "/profile/Dominic-Woodruff-2"
                },
                {
                    "user_id": "Ricky Inguanti",
                    "user_href": "/profile/Ricky-Inguanti"
                },
                {
                    "user_id": "Dasha Alkina",
                    "user_href": "/profile/Dasha-Alkina"
                },
                {
                    "user_id": "Fabian Gamaiev",
                    "user_href": "/profile/Fabian-Gamaiev"
                },
                {
                    "user_id": "Lizette Williams",
                    "user_href": "/profile/Lizette-Williams-5"
                },
                {
                    "user_id": "Kristi Leone",
                    "user_href": "/profile/Kristi-Leone"
                },
                {
                    "user_id": "Liz Scurry",
                    "user_href": "/profile/Liz-Scurry"
                },
                {
                    "user_id": "Carol Busato",
                    "user_href": "/profile/Carol-Busato"
                },
                {
                    "user_id": "Jason Jackson",
                    "user_href": "/profile/Jason-Jackson-121"
                },
                {
                    "user_id": "Dan Dank Meme",
                    "user_href": "/profile/Dan-Dank-Meme"
                },
                {
                    "user_id": "Martina Sax",
                    "user_href": "/profile/Martina-Sax-1"
                },
                {
                    "user_id": "Oliver Wiliam Makower",
                    "user_href": "/profile/Oliver-Wiliam-Makower"
                },
                {
                    "user_id": "Adrian Deheza",
                    "user_href": "/profile/Adrian-Deheza"
                },
                {
                    "user_id": "Giovanni Bordner",
                    "user_href": "/profile/Giovanni-Bordner-2"
                },
                {
                    "user_id": "Bernard David",
                    "user_href": "/profile/Bernard-David-12"
                }
            ]
        },
        {
            "author_info": {
                "name": "Louise Sackville",
                "href": "/profile/Louise-Sackville"
            },
            "answer_text": "The main symptom of schizophrenia is being disconnected from reality, aka psychosis: having frightening hallucinations such as hearing voices talking to you or about you when there is no other person there, seeing things such as people, animals or terrifying entities that aren’t there, or smelling odors or feeling the touch of something that isn’t really there. It isn’t likely that a non-schizophrenic person can simply will himself or herself to experience things that aren’t really there, aka have psychotic breaks with reality. It’s possible, but not likely to give yourself the brain damage necessary to induce psychosis, unless drug or alcohol abuse is also in the picture. I have heard that those who take dangerous street drugs like “bath salts” instantly become permanently psychotic and dangerously violent due to brain damage from that drug. You could also try damaging your brain with physical force, like hitting yourself on the head repeatedly with a baseball bat, or perhaps you could try growing a brain tumor due to repeated exposure to radiation. Brain damage might induce psychosis, but it is equally likely to simply paralyze you, or put you in a state of permanent, unrelenting physical pain, or kill you. I hope that none of these suggestions sound good to you and that you don’t attempt any of them; don’t damage your brain and make a train wreck out of the one and only life you will ever have, permanently. ",
            "date": "Updated May 13, 2019",
            "views": "17",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Arj Subanandan",
                "href": "/profile/Arj-Subanandan"
            },
            "answer_text": "Schizophrenia is not the product of a brain defect. It's a wide range of mental phenomena of which some are based on a biological difference - not a defect - and some are based on psychosocial causes but it's all biopsychosocial model of cause not the biomedical model of mental health and illness. Mental illness is not real but it's justified by looking at brain differences and calling them defects. It's like if skin colour is purported to be caused by a biological defect - like when doctors invented the diagnosis of negritude - then it's biological differences misrepresented as biological defects and disease. But the cruelty done to schizophrenics is very real. A good example is what happened to Jesus. If he were born today he would be a victim of the cruelty of psychiatrists and the rest of the monsters who call themselves the human race. In his own time he had a radically different way of thinking that was very different to the thinking of average individuals and he had personal experience of the gods - these would be called a symptom of schizophrenia. In my personal experience of being a schizophrenic doctors will use my difference and my experience of the supernatural to be a symptom of a brain defect. Is a schizophrenic a real thing is a much harder question to answer if you believe schizophrenia is a real thing because what the diagnostic label means - therefore the specific mental diversity that's prejudiced against and this prejudice is fundamental to what doctors do in their role in mental health oppression - has covered so many different types of mental diversity since the term was coined by...Bleuler?...as mental phenomena that are distinctly different to the types of mental diversity covered by the label dementia praecox that was defined by Emil Kraeplin (sorry I might have misspelt the names). The label of schizophrenia has been used to oppress capitalist thinkers in communist USSR (Richard Bentall in the inappropriately named book Madness Explained mentions this) . It's been used to oppress sexually promiscuous women. This is nothing to do with brain defects, simply the prejudice of cultural norms. In England black men are over diagnosed with schizophrenia seven times more than their white counterparts but this doesn't happen in the West Indies. I'm not trying to take away from the pain schizophrenics face and the cruelty we face. This is very real. But any scientists worth anything will understand that the lie of mental illness is a lie, and the biomedical model of mental illness is pseudoscience. Even something as evil as the Royal College of Psychiatry would say the biopsychosocial model of cause is the scientific truth. But it's fundamentally different to the lie of mental illness that stands at the foundation of this institution and the psychiatric profession. For example the biopsychosocial model gives schizophrenics rights whereas the biomedical model takes away rights. But you really should consider what happens to schizophrenics before dementia praecox was invented to class this highly stigmatised part of natural mental diversity to understand what is real and what's not real about schizophrenia. Back then it was 'diagnosed' in the West by the Church. I think it's mentioned in Accepting Voices by Romme and Escher that schizophrenics would be labelled as heretics or witches but some were canonised if their mental differences and their unusual experience of consciousness fitted in with the Church. But again it's a very wide range of natural diversity that is oppressed and subjugated and prejudiced against by the label of schizophrenia and the types of mental diversity change over time in history and geographical location. But what's most important is that you'll never learn to understand schizophrenics and the natural mental diversity we represent if you believe in the lie of mental illness. If your question is are there a wide range of mental diversity that's classified as schizophrenia that are worth you learning to understand not as individuals labelled as having the mental illness of schizophrenia but as individuals like you who have commonality with your mental diversity and differences that are worth understanding from a humanising way of thinking then my answer would be very short. It would be “yes”. It is the same answer to how you understand a black skinned individual. But if your question is have doctors murdered their victims including those labelled with schizophrenia in their pursuit of forced normalisation then my answer is also “yes”. ",
            "date": "Answered September 3, 2019",
            "views": "816",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Jay May",
                    "user_href": "/profile/Jay-May-132"
                },
                {
                    "user_id": "C Baka",
                    "user_href": "/profile/C-Baka"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/D-R-R"
                },
                {
                    "user_id": "John Doe",
                    "user_href": "/profile/John-Doe-12090"
                }
            ]
        },
        {
            "author_info": {
                "name": "Norbert Schlottmann",
                "href": "/profile/Norbert-Schlottmann"
            },
            "answer_text": "It is real and I have published works on how to treat it so that the symptoms go away. Fix all treatment for Schizophrenia, Schizoaffective, and Anxiety Disorders By: Dr. Norbert Schlottmann, PhD, MD Contributors: Dr. Laraine Lideman, MD Dr. Larry Kubiak, PhD, MD Dr. Ricardo Ayala, MD Miriam DeJesus, RN MSCS Wayne Denton, MD Note: CT Scans made possible by: Contributors and other medical doctors. Medical Records of patients are not for sale. Case study conducted by contributors and more. This data is part of a medical study of consenting patients. All patients were asked to share data that included CT scans, blood labs, and other tests/scans which are shared doctor to doctor as part of the international partial blind study. Symptoms should go away with the proper dose on all of these. If not, join the study. Symptoms include: Google Paste Schizophrenia is characterized by thoughts or experiences that seem out of touch with reality, disorganized speech or behavior, and decreased participation in daily activities. Difficulty with concentration and memory may also be present. Paranoia and Trust issues may be a symptom as well. People may experience: Behavioral: social isolation, disorganized behavior, aggression, agitation, compulsive behavior, excitability, hostility, repetitive movements, self-harm, or lack of restraint Cognitive: thought disorder, delusion, amnesia, belief that an ordinary event has special and personal meaning, belief that thoughts aren't one's own, disorientation, memory loss, mental confusion, slowness in activity, or false belief of superiority Mood: anger, anxiety, apathy, feeling detached from self, general discontent, loss of interest or pleasure in activities, elevated mood, or inappropriate emotional response Psychological: hallucination, paranoia, hearing voices, depression, fear, persecutory delusion, or religious delusion Speech: circumstantial speech, incoherent speech, rapid and frenzied speaking, or speech disorder Also common: fatigue, impaired motor coordination, or lack of emotional response End Google Paste FIX ALL TREATMENT, DISPENSE AT THE PROPER DOSE EVERYONE FOR FOCUS & ANXIETY: Atarax (Hydroxyzine HCL) OR Vistaril (Hydroxyzine PAM) Buspar (Buspirone) Others that have problems with focus and anxiety just get people to tickle them anywhere if they are Schizophrenic or Schizoaffective FOR SCHIZOPHRENIA OR SCHIZOAFFECTIVE NEEDING NOREPINEPHRINE: Risperdal (Risperidone) does the opposite from Paxil (Paroxetine) and Celexa (Citalopram) Prescribe when there are waves in the middle in the CT scan. (for Schizophrenia) (made possible by Laraine Lideman) Prescribe when there is a cut on the right side in the CT scan. (for Schizoaffective) (made possible by Laraine Lideman) CT scan discoveries made possible by Laraine Lideman. FOR TRANQUILIZER OR SCHIZOAFFECTIVE: Lithium Prescribe when there is a cut on the right side in the CT scan. (made possible by Laraine Lideman) CT scan discoveries made possible by Laraine Lideman. FOR SCHIZOPHRENIA NEEDING SEROTONIN: Celexa (Citalopram) does the opposite from Risperdal (Risperidone) Paxil (Paroxetine) does the opposite from Risperdal (Risperidone) Prescribe when there is a cut in the middle in the CT scan. (made possible by Laraine Lideman) Prescribe when the eyes move from left to right. Prescribe when there is heavy breathing most of the time. CT scan discoveries made possible by Laraine Lideman. THE DIFFERENCE BETWEEN NOREPINEPHRINE AND SEROTONIN: serotonin patients behave similar to each other and opposite to Norepinephrine patients. serotonin and Norepinephrine cancel each other if taken by the same patient. One treats anxiety and the other depression. They send signals from the left part of the brain to the right and vice versa. Norepinephrine also known as atypical antipsychotics is Risperdal serotonin is Celexa or Paxil. THERE IS A NEW DISCOVERY BY LARAINE LIDEMAN, Houston, TX. Laraine’s Finding: CT Scans read by her are a proven way to discover which patient need Serotonin and need Norepinephrine with Lithium. Wavy lines need Risperdal and those that cut need Serotonin. I’ll let her explain in her publication when it comes. Norbert’s Suggestion: Great discovery Laraine Lideman. Just another way to skin the cat. We already check the breathing in psychology/psychiatry and check the eyes in Neuro. In Neurology you check to see if the eyes go left to right, if they do, it’s Serotonin. I’m all for new ideas, and I suggest EEG and MRI for further interpretation. Neurology may be able to get a clearer reading. For the checking the eyes in Neuro. I credit that to Larry Kubiak to teaching me that. Some credit to my learning comes from Dept. of Neurology, TMH, Ricardo Ayala, and some of it was analysis of Schizophrenia. OTHER MEDS THAT MAY BE NEEDED: Latuda (Lurasidone) & Abilify (the pill) (Aripiprazole) Other schizophrenic meds to supplement. Please send feedback on developments if you have any. Case studies on this? Keep me posted. Some of this is still in testing phases, but there is enough success that I think it is a fix all at this point. Abilify the pill is reported to treat schizophrenia, bipolar disorder, depression, and Tourette syndrome. It can also treat irritability associated with autism. Does Latuda do the same? Recent findings say that Latuda even though it’s newer than Abilify the pill also is reported to treat the same conditions.. 1. Analyzing Marital Problems 2. Ethics vs Morals vs Finance 3. Keys to a Successful Relationship or Marriage 4. The 3 Big Secrets To A Successful Relationship 5. Friend to Family Analyzing Marital Problems By Dr. Norbert Schlottmann MSW, LCSW, LMFT, MD Psychiatry, PhD Psychology, PhD Engineering For those nature lovers out there: Talk about wrangling wildlife, this is wrangling marital problems. This is also titled Brother to Brother Problems. The reason for the change is that we found the CBT Thought Record also can fix problems related to family that you were born with such as brothers of yours. The idea here is to bring the problems out in the open and discuss them with your family. You may get into a fight at first by filling out the sheets and bringing the sheets for the other to read as a group or as a couple in this exercise, but when things come to the surface, it’s healthier than bottling it up and not discussing it. Google these: 1.\tCBT a.\tType thought record in psychology tools search field. b.\t(CBT Thought Record is the name of the document) – Free CBT Worksheets For Professionals And Self-Help - Psychology Tools i.\tThe green one and select English ii.\tNext step for CBT: Choose English(US) in Full Pack. iii.\tcbt_thought_record_en-us.pdf iv.\tPDF sold separately by Free CBT Worksheets For Professionals And Self-Help - Psychology Tools London, UK. c.\tSimple Thought Record is preferred more sometimes cause it’s not as detailed. i.\tChoose the right one. ii.\tNext step for CBT: Choose English(US) in Full Pack. d.\tI haven’t explored the others but it isn’t a bad idea to explore them either. e.\tThe more you use from that site, the better to use a Professional license. f.\tThought Monitoring Records & Thought Challenging Records Sections are what you need. 2.\tDBT 3.\tNohari Window (The Nohari Window) 4.\tJohari Window (take the test online) 5.\tOnline compatibility tests in Interests, Personality, Communication, Sex, Romance, and Commitment a.\thttps://similarminds.com/cgi-bin/compbig5.pl b.\tNot that easy to find some of these tests. Health Anxiety you don’t have to worry about. That was a mistake on my part. Next step for CBT: Choose English(US) in Full Pack. Those are the things that can help. My advice is that if you see a problem in your marriage that you try these first before going to a marriage counselor. It’ll speed things up if you and your partner do this first and then come to the table with all the cards on the table. It may save you a trip to the counselor. This document was written primarily to get to the root of fixing a personality clash problem, but it can help others too. Another thing I’ve also noticed is that you should consider talking about the deeper problems before getting engaged. i.e. Financials, Ethics, Religion, Politics. However getting back to personality clashes: The way I fixed the personality clash is that I asked them to check themselves in the mirror by looking at these things in Google, and trying to see what they can change about themselves first before seeing me. Focus on the differences between the two people in the relationship and be willing to give in a little for the sake of the relationship is what I told them. I also said focus on strengthening the strengths and building on those. Improve on communication, romance, and commitment. Remember everything is give and take. 1)\tIf you have problems that are leading to a personality clash, read above and have yourself and the other person try self help of these things I’ve asked you to Google. You may find the answer in your answers to these tools or in the answer of the other person’s answers to these questions. 2)\tIf it’s a matter of you not telling the other person that you need more or less of a certain thing, such as sex, or romance, or commitment maybe it’s just a matter of discussing it with the other person. 3)\tHit the tough subjects before engagement is advisable. a.\tEthics b.\tFinance i.\tJoint Accounts or separate c.\tPolitics d.\tReligion e.\tEtc. 4)\tIn a musical couple: a.\tI encourage them to get creative i.\tCreate a song about their problems ii.\tTalk about their problems through song 1.\tThat’s the makeup routine 5)\tIn a artistic couple: a.\tThe creative side should prompt them to write cartoons or something artsy. b.\tTalk about their problems through art. 6)\tIn another couple a.\tThe creative side should prompt them to do something that both people can connect with. It may not be art or music, it may be something else. b.\tCreativity can also be used to spice up the relationship. 7)\tSpicing up your marriage: a.\tCreative thinking is the way to go b.\tBe a gentleman and a lady if you’re straight c.\tLady & Lady for lesbians d.\tGentleman & Gentleman for Gays 8)\tIf you're a musical couple it is as simple as making music out of your \"making up\". If it's art it's as simple as making cartoons out of your \"making up\" with each other. Keep in mind that the other person in the couple has to be able to understand what you are trying to say. See my other related publications: 1.\tAnalyzing Marital Problems 2.\tEthics vs Morals vs Finance 3.\tKeys to a Successful Relationship or Marriage 4.\tThe 3 Big Secrets To A Successful Relationship 5.\tFriend to Family ",
            "date": "Answered October 4, 2019",
            "views": "439",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Joey Lusk",
                "href": "/profile/Joey-Lusk"
            },
            "answer_text": "It depends heavily on genetics, epigenetics and environment. Schizophrenia is polygenic, meaning lots of gene variations (or deletions) are involved. A recent study of twin cohorts (data from the Danish Twin Register on identical and non-identical twins) found that if one identical twin had schizophrenia, the chances of the other twin developing it was about 30%. For non-identical twins, the risk dropped to about 7%. Genetics seem to account for about half of the variance in schizophrenia, with shared environmental factors accounting for about 15% of variation, and non-shared environmental factors for about 35%. This means environment and epigenetic factors weigh as much as genetics. If you do not have the genetics, your chances of developing the condition are quite slim. While your chances of developing schizophrenia do increase if you have a first or second tier relative with the disorder, it doesn't mean you will necessarily develop it. Look back at the twin studies. Even if you share identical genomes with someone who has it, you still have up to a 67% chance of not developing the disorder. As a final comment, I'd like to note that schizophrenia-related prevalence, symptom severity and health outcomes appear to vary significantly in different cultures. Culture (and sub-culture) plays a role. Interestingly enough, people with schizophrenia tend to live fuller and healthier lives in less industrialized cultures and religious subcultures where shamanic, liminal, or prophetic/revealing social roles are retained. This is shaping up to be a vital area of research. ",
            "date": "Answered April 28, 2020",
            "views": "226",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Matt Smith",
                "href": "/profile/Matt-Smith-1030"
            },
            "answer_text": "You can’t. As others have said it’s a very complex disorder, caused by a combination of genetic and environmental factors. To be at higher risk than the general population for schizophrenia, you would likely need to have some of these: a big genetic change, like 22q11.2 deletion syndromea high polygenic risk (lots of small changes that together increase your risk)environmental risk factors, like childhood abuse, problems in utero etc.They might put you at high risk, but you could also get it without them, or not get it with them; they just increase risk in the population. The combination of genetics and environment means that you might develop schizophrenia as a result of your genetics, time in the womb and childhood, but you probably couldn’t acquire it later. You could acquire temporary psychosis as an adult, but this is not the same thing. I also really don’t think you should want to anyway. Schizophrenia is debilitating, life-long and currently untreatable. Psychotic symptoms may go away, cognitive and negative ones do not. ",
            "date": "Answered January 16, 2018",
            "views": "29",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Jay May",
                    "user_href": "/profile/Jay-May-132"
                },
                {
                    "user_id": "C Baka",
                    "user_href": "/profile/C-Baka"
                },
                {
                    "user_id": "Elisa Moore",
                    "user_href": "/profile/Elisa-Moore"
                },
                {
                    "user_id": "Joeys Williams",
                    "user_href": "/profile/Joeys-Williams"
                }
            ]
        },
        {
            "author_info": {
                "name": "David Galipeau",
                "href": "/profile/David-Galipeau-1"
            },
            "answer_text": "One of my friend told me that his brother suffered from schizophrenia. He told me it was because he smoked drugs when he was a teenager. Even smoking weed can trigger schizophrenia for individuals at risk. Schizophrenia is a terrible illness. I’m not an expert in schizophrenia, but I’ve seen many patients with it at the hospital. I was a patient myself at that time and I’ve heard pretty bad things about it. I know there is scientific evidence that says it’s a neurodegenerative disease, but let’s stop focusing on the science and more on the power of the human spirit to over come challenges. This TED-talk is about an Yale law student suffering from the disease that managed to over come the difficulties. Like she said if she didn’t receive the help she had, she could have been homeless. I share that thought as well. If it wasn’t for the help the army gave me, I would probably be dead now. A tale of mental illness -- from the inside  ",
            "date": "Answered May 21, 2018",
            "views": "64",
            "upvotes": " View 13 Upvoters",
            "upvoters": [
                {
                    "user_id": "Kayla T",
                    "user_href": "/profile/Kayla-T-80"
                },
                {
                    "user_id": "Morgan Kephart",
                    "user_href": "/profile/Morgan-Kephart-4"
                },
                {
                    "user_id": "Charlotte Freeman",
                    "user_href": "/profile/Charlotte-Freeman-35"
                },
                {
                    "user_id": "Tierra Gilmore",
                    "user_href": "/profile/Tierra-Gilmore-2"
                },
                {
                    "user_id": "Steve Skepnek",
                    "user_href": "/profile/Steve-Skepnek"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/Alphie-Less"
                },
                {
                    "user_id": "Jacques Felix",
                    "user_href": "/profile/Jacques-Felix"
                },
                {
                    "user_id": "Alex Kovac",
                    "user_href": "/profile/Alex-Kovac-3"
                },
                {
                    "user_id": "Thejas Gowda",
                    "user_href": "/profile/Thejas-Gowda-8"
                },
                {
                    "user_id": "James Bishop",
                    "user_href": "/profile/James-Bishop-7"
                },
                {
                    "user_id": "Tuan Nguyen",
                    "user_href": "/profile/Tuan-Nguyen-355"
                },
                {
                    "user_id": "Anastasia Waters",
                    "user_href": "/profile/Anastasia-Waters"
                },
                {
                    "user_id": "Joshua Sytsma",
                    "user_href": "/profile/Joshua-Sytsma"
                }
            ]
        },
        {
            "author_info": {
                "name": "Albin Gustafsson",
                "href": "/profile/Albin-Gustafsson-3"
            },
            "answer_text": "Meet a psychiatrist who believes it exists, (not everyone does). Exhibit symptoms he/she is looking for to label you. Voilà! You don’t get it, because it doesn’t really exist. Given the right amount of environmental/social trauma and stress everyone can ”get it”. They want a diagnosis as a way to give you medication. ”Treating” your illness, instead of healing your trauma and helping you be yourself. If you never met a psychiatrist, you will never ”get it”. Struggling mentally is of course something to seek help for. A psychologist, spirual teacher, etc is a wiser way to go. Doctors mostly are just middlemen for popping pills sadly ",
            "date": "Answered August 17, 2019",
            "views": "648",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Peggy J. Rees Raser-Gross",
                    "user_href": "/profile/Peggy-J-Rees-Raser-Gross"
                },
                {
                    "user_id": "Kayla T",
                    "user_href": "/profile/Kayla-T-80"
                }
            ]
        },
        {
            "author_info": {
                "name": "Stephen Comer",
                "href": "/profile/Stephen-Comer-4"
            },
            "answer_text": "Zero to none. Schizophrenics are born, not made. If you were going to be schizophrenic,you’d have done so already and wdn’t be asking this question on Quora. Of course, you might be having other mental problems, and if so, the first thing to do would be to see your county social worker, who can steer you on your new path. ",
            "date": "Answered April 24, 2020",
            "views": "175",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Daniel Trump",
                "href": "/profile/Daniel-Trump-3"
            },
            "answer_text": "I have schizophrenia. I developed it at 24 and have it. I talk to myself in my head. I would consider the people I talk to voices. It’s a real thing - it can be inherited, or it can be something that one can develop. I have had it for fifteen years. It is a terrible and debilitating mental illness which can cause other factors than hearing voices. One can have trouble shaving, showering, doing laundry, cleaning, working out, or even understanding what is real. In a very real sense, schizophrenia is an actual condition which one can have. ",
            "date": "Answered June 29, 2016",
            "views": "424",
            "upvotes": " View 11 Upvoters",
            "upvoters": [
                {
                    "user_id": "Peggy J. Rees Raser-Gross",
                    "user_href": "/profile/Peggy-J-Rees-Raser-Gross"
                },
                {
                    "user_id": "C Baka",
                    "user_href": "/profile/C-Baka"
                },
                {
                    "user_id": "Inaba Katsusuke",
                    "user_href": "/profile/Inaba-Katsusuke"
                },
                {
                    "user_id": "Brendie Harrison",
                    "user_href": "/profile/Brendie-Harrison-2"
                },
                {
                    "user_id": "Matt Brown",
                    "user_href": "/profile/Matt-Brown-78"
                },
                {
                    "user_id": "Christine Pickford",
                    "user_href": "/profile/Christine-Pickford-5"
                },
                {
                    "user_id": "Jason Snyder",
                    "user_href": "/profile/Jason-Snyder-39"
                },
                {
                    "user_id": "Brett Cooper",
                    "user_href": "/profile/Brett-Cooper-2"
                },
                {
                    "user_id": "Ashley Buckler",
                    "user_href": "/profile/Ashley-Buckler-1"
                },
                {
                    "user_id": "Vrica Vij",
                    "user_href": "/profile/Vrica-Vij"
                },
                {
                    "user_id": "Kathy Moran",
                    "user_href": "/profile/Kathy-Moran-4"
                }
            ]
        },
        {
            "author_info": {
                "name": "Dhirendra Giri",
                "href": "/profile/Dhirendra-Giri-5"
            },
            "answer_text": "Well, i want to tell you that schizophrenia possible such a person who have to live along by any reasons like jobs & study. Whenever you go out far from your home town towards any big city .your economical condition is sound. You have some such habits which proof that you are fond of many art's & you have introvert type person ,don't pay heed towards your neighborhood. Some criminal can watch your silence & activities & than they produced such noises which create tension in your mind.you began to think i have not done bad for any body. Than slowly you can come influence of t so called illness schizophrenia. ",
            "date": "Answered April 24, 2019",
            "views": "283",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Justice Marino",
                "href": "/profile/Justice-Marino"
            },
            "answer_text": "For what possible realson could you want to experience this illness? It’s terible. I live in fear of suffering an episode and having my own mind betray me. Psychosis is scary and very fucking real while it’s happeneing. If you want to fake a mental illness then go to the WR and tell them you’re suicidal. Are you trying to make a disability claim or something? ",
            "date": "Answered March 14, 2019",
            "views": "477",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Tyamkea Sanderlin",
                    "user_href": "/profile/Tyamkea-Sanderlin"
                },
                {
                    "user_id": "Glenna Yn",
                    "user_href": "/profile/Glenna-Yn"
                },
                {
                    "user_id": "Carmen Johnson",
                    "user_href": "/profile/Carmen-Johnson-61"
                }
            ]
        },
        {
            "author_info": {
                "name": "Panos Shady",
                "href": "/profile/Panos-Shady"
            },
            "answer_text": "No. Similar to Alzheimer's, you must have the gene for schizophrenia in order to \"gain\" it. If you have the gene, you are most likely to see your first schizophrenic episode as you grow older in your early 20's. But if you don't have the genes, regardless of what you do in life, you can never become schizophrenic. ",
            "date": "Updated July 5, 2016",
            "views": "396",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Peggy J. Rees Raser-Gross",
                    "user_href": "/profile/Peggy-J-Rees-Raser-Gross"
                },
                {
                    "user_id": "Butter Scotch",
                    "user_href": "/profile/Butter-Scotch-42"
                }
            ]
        },
        {
            "author_info": {
                "name": "Simay Fidan",
                "href": "/profile/Simay-Fidan"
            },
            "answer_text": "Psychiatry is a field with many question marks still in place but studies done on schizophrenia report that there are some common risk factors. Smoking marijuana might increase the chances of being schizoprenic by 8 times if someone has the genetic predisposition.Growing up in a big city rather than a small town.Having stressful childhood and teenage years.Being in a not-so-friendly environment growing up.Genetic predisposition. Having a family member who is schizoprenic, the closer the relative higher the risk but that is not a certainty. There are schizoprenic patients whose identical twins are perfectly healthy.",
            "date": "Answered July 2, 2016",
            "views": "823",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Crystal Ellis",
                    "user_href": "/profile/Crystal-Ellis-61"
                }
            ]
        },
        {
            "author_info": {
                "name": "Sue Hanson",
                "href": "/profile/Sue-Hanson-10"
            },
            "answer_text": "There is probably an outside chance that anybody could have it. Stop trying to diagnose yourself. It is possible to talk oneself into “symptoms” of just about any type of mental illness. Get on with your life. ",
            "date": "Answered June 17, 2019",
            "views": "213",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Elizabeth Penrose",
                    "user_href": "/profile/Elizabeth-Penrose-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Josie Sing",
                "href": "/profile/Josie-Sing"
            },
            "answer_text": "I'm not exactly sure what you're really asking. Do you mean is it possible to get schizophrenia? The factors to consider are a genetic predisposition for it, and social factors. Schizophrenia Cause and Prevention  ",
            "date": "Answered June 28, 2016",
            "views": "491",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Shaina Deutsch",
                    "user_href": "/profile/Shaina-Deutsch"
                },
                {
                    "user_id": "Lory Guy",
                    "user_href": "/profile/Lory-Guy"
                }
            ]
        },
        {
            "author_info": {
                "name": "Susan Canaday",
                "href": "/profile/Susan-Canaday-1"
            },
            "answer_text": "People don’t really ‘get’ or ‘acquire’ it. It’s genetic, and a person is born with it. We don’t have any say over what misspellings our genes make. What we do control is our response to it - getting treatment helps immensely. ",
            "date": "Answered August 29, 2018",
            "views": "20",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Cate Durden",
                "href": "/profile/Cate-Durden"
            },
            "answer_text": "It's a mental disorder that you should get a doctor's evaluation on. You can have it based on environmental factors mixed with a genetic disposition for having it. ",
            "date": "Answered July 18, 2019",
            "views": "192",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Bob Martin",
                    "user_href": "/profile/Bob-Martin-37"
                }
            ]
        },
        {
            "author_info": {
                "name": "Jenna Ravenstone",
                "href": "/profile/Jenna-Ravenstone"
            },
            "answer_text": "Smoking marijuana significantly increases your chances of getting it, as do various other factors. But you can’t simply induce it via behavioral choices. You can’t will it to happen. ",
            "date": "Answered February 1, 2018",
            "views": "11",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Brian Y. Kuo",
                    "user_href": "/profile/Brian-Y-Kuo"
                },
                {
                    "user_id": "Hilal Gültekin",
                    "user_href": "/profile/Hilal-Gültekin-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Lisa Anne McBride",
                "href": "/profile/Lisa-Anne-McBride"
            },
            "answer_text": "Why would you want to get Schizophrenia? Just so you know, Schizophrenia is not contagious. You can't catch it. It's something you are born with. At least the disposition ",
            "date": "Answered August 6, 2019",
            "views": "126",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Mikaela Platt",
                    "user_href": "/profile/Mikaela-Platt-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Bala Krishnan",
                "href": "/profile/Bala-Krishnan-97"
            },
            "answer_text": "Yes. One of my family member is diagnosed with Paranoid Schizophrenia. I have to tell you. Life is hell for him, if he is not on meds. He believes everyone is conspiring against him. People with this sort of paranoia are normally hard to deal with. Their immense distrust along with poor judgement skills makes it difficult to understand their problem. Yeah. It’s for real. ",
            "date": "Answered April 28, 2019",
            "views": "208",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "K. Colin",
                    "user_href": "/profile/K-Colin"
                }
            ]
        },
        {
            "author_info": {
                "name": "Elizabeth Penrose",
                "href": "/profile/Elizabeth-Penrose-1"
            },
            "answer_text": "Ask most of the people with schizophrenia wish they didn’t have it. Indeed, few of the risk factors for schizophrenia — including fetal exposure of disease, violently abusive parents or other adults, and a childhood of lower-than-average grades — are things we choose, or would wish to. ",
            "date": "Answered July 2, 2016",
            "views": "372",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Timothy Campbell",
                "href": "/profile/Timothy-Campbell-29"
            },
            "answer_text": "By going to a psychiatrist and telling them a bunch of crazy stuff, wait for a diagnosis - suggest schizophrenia, sit back and let the government paychecks roll in ",
            "date": "Answered March 24, 2018",
            "views": "104",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Mile Navrsale",
                "href": "/profile/Mile-Navrsale"
            },
            "answer_text": "What are the chances of SZ? 1.1% in general 4.4% if you live in a big city ",
            "date": "Answered April 24, 2020",
            "views": "93",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Kathy Moran",
                "href": "/profile/Kathy-Moran-4"
            },
            "answer_text": "Yes Schizophrenia is real. You can only develop schizophrenia from drug addiction, or its genetic, or chemical imbalance in the brain. ",
            "date": "Answered July 12, 2016",
            "views": "138",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Abhishek Mitra",
                "href": "/profile/Abhishek-Mitra-172"
            },
            "answer_text": "Is schizophrenia possible. Yes. Know in details at this link -Abhishek Mitra's answer to What is it like to have schizophrenia? ",
            "date": "Answered October 4, 2019",
            "views": "149",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Greg Trial",
                "href": "/profile/Greg-Trial"
            },
            "answer_text": "Yes. It's mainly drug born. Meth is known to cause a psychosis that may or may not be schizophrenic. ",
            "date": "Answered January 14, 2018",
            "views": "67",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Sarah Cohan",
                "href": "/profile/Sarah-Cohan-6"
            },
            "answer_text": "pot and psychedelics can cause an early onset of schizophrenia. ",
            "date": "Answered April 14, 2018",
            "views": "285",
            "upvotes": "0"
        }
    ]
}