{
    "title": "How can a teenager get a book published? - Quora",
    "tags": [
        "Fiction Writing",
        "Book Writing",
        "Book Publishing",
        "Literature",
        "Writing",
        "Teenagers and Teenage Years"
    ],
    "response": [
        {
            "author_info": {
                "name": "Shawn Bell",
                "href": "/profile/Shawn-Bell"
            },
            "answer_text": "Anyone can publish a book, and it doesn’t cost any money to do so. First, you need to write the book.  That’s the easy part. Next, you can use free tools like LibreOffice with the Writer2ePub extension to create your formatted book. Create your (full size) cover - front, back, and spine using a graphics design program like iDraw, Photoshop, etc.  Export the whole thing to a PDF file, and export the cover to a .jpg file. In LibreOffice export it to PDF and create the ePub file (you’ll need the .jpg file of the cover). If you have any changes to the file, you can use free tools like Sigil to edit the ePub file. Once you’ve finished your edits, use Kindlegen to create the Amazon file. You’ve now got the cover and interior files (in PDF format) that you’re going to upload to Createspace to make your physical book. You’ve also got the ePub file that you’re going to upload to Smashwords to distribute to Barnes & Noble, Apple iBookstore, and everywhere except Amazon. Finally, you’ve got the Amazon ebook file that you’re going to upload to Kindle Direct Publishing.  Once you do that, you’ve put your book out pretty much everywhere in the world. And the cost? Zero.  Zip. Zilch.  Nada.  You’re a published author. Now, you can (and should) spend money getting a cover professionally done.  You should also get your book edited. Now comes the hard part: you have to market your book.  The good news is that there are plenty of places to get help doing this.  Alli is a great resource. BookBub is a great thing to look into.  Amazon has a Select program that - if used correctly - can greatly increase your sales.  Goodbooks is a place to review. As far as the other stuff mentioned:  You don’t have to register your book with any “ISBN agency” nor do you have to pay for any ISBN number.  Createspace, KDP, and Smashwords all offer free ISBN numbers.To create a physical book, you don’t have to send any text or any artwork anywhere.  You can do it all in LibreOffice.  You don’t have to have any batches printed, and there’s no upfront cost to set up your book through Createspace.  None at all.Do NOT use Calibre to create your eBook; Amazon has rejected Calibre formatted ebooks.Do NOT send any kind of file to Kindle Direct Publishing (not Amazon).  Send only the Kindlegen generated file.  NEVER send Word or TXT files to KDP.  They will not get formatted correctly, and Word files are full of “Word Bloat” - a nice way of saying that Word fills your file with all kinds of unnecessary formatting.You don’t “register” your book (or eBook) with Amazon.  You set up an account at Createspace, Kindle Direct Publishing, and Smashwords.  You upload your file. That’s it; no “register” stuff involved.You don’t need (or want) to ‘crowdfund’ your work.  Write it and publish it yourself.  That way you don’t have to fulfill any crowdfunding promises.  If you add up all the money you spend doing fulfillment for crowdfunding projects, you’ll find out that you end up with about 1/5 of the money your “raised” crowdfunding.Googling “self-publishing” - while a good idea to get an overview - isn’t really going to help you.  If you follow the advice given, you’ll end up buying ISBN numbers, spending money on printer/distributors, and wasting both time and money doing things the wrong way.  You really need to find someone who can give you advice or help sherpa you through the (many) pitfalls of doing things the wrong way.Also, you NEVER EVER send your book to an agent.  You send a query letter.  No legitimate agent will accept an unsolicited manuscript; it goes right in the shredder.  The Writers Digest has a list of agencies if you want to go the traditional route.  Just know in advance that the “traditional” route will net you about 14.5% in royalties per book sale.  Going the indie-publishing route will get you much closer to 70% royalties - and you’ll have to do the same amount of marketing.",
            "date": "Answered December 1, 2014",
            "views": "28",
            "upvotes": " View 17 Upvoters",
            "upvoters": [
                {
                    "user_id": "Lelin Lalchan",
                    "user_href": "/profile/Lelin-Lalchan-1"
                },
                {
                    "user_id": "Cj Galang",
                    "user_href": "/profile/Cj-Galang-3"
                },
                {
                    "user_id": "Chenmeng Butterfly",
                    "user_href": "/profile/Chenmeng-Butterfly"
                },
                {
                    "user_id": "Jackson Zurn",
                    "user_href": "/profile/Jackson-Zurn-1"
                },
                {
                    "user_id": "Athira Krishnan",
                    "user_href": "/profile/Athira-Krishnan-10"
                },
                {
                    "user_id": "Joneisha Zuniga",
                    "user_href": "/profile/Joneisha-Zuniga"
                },
                {
                    "user_id": "Maryam L",
                    "user_href": "/profile/Maryam-L-4"
                },
                {
                    "user_id": "Melissa Desveaux",
                    "user_href": "/profile/Melissa-Desveaux"
                },
                {
                    "user_id": "Shashank Singh",
                    "user_href": "/profile/Shashank-Singh-933"
                },
                {
                    "user_id": "Shivansh Verma",
                    "user_href": "/profile/Shivansh-Verma-29"
                },
                {
                    "user_id": "Thomas Wan",
                    "user_href": "/profile/Thomas-Wan-12"
                },
                {
                    "user_id": "Samantha Ng",
                    "user_href": "/profile/Samantha-Ng-29"
                },
                {
                    "user_id": "Santoshrajha S",
                    "user_href": "/profile/Santoshrajha-S"
                },
                {
                    "user_id": "Rahul Chhabra",
                    "user_href": "/profile/Rahul-Chhabra-47"
                },
                {
                    "user_id": "Mae Rosete",
                    "user_href": "/profile/Mae-Rosete"
                },
                {
                    "user_id": "Ambrose Lewis",
                    "user_href": "/profile/Ambrose-Lewis"
                },
                {
                    "user_id": "Alex Deva",
                    "user_href": "/profile/Alex-Deva"
                }
            ]
        },
        {
            "author_info": {
                "name": "Jody Lebel",
                "href": "/profile/Jody-Lebel"
            },
            "answer_text": "In order to try to sell your book you will need an agent.  An agent has the contacts to pitch your book to the publishing houses.  One good site to try is www dot querytracker dot com.  Find literary agents and publishers with our free database. That is a free website that lists agents and publishers and tells you which ones take which genres and what their requirements are and how to submit to them. Not every agent in the world is listed here but there's around 1400 of them on this site. Do your homework and find publishers on that site that take on new writers that don't have an agent. Query them.  If you don't know what a query letter is Google it...there are many sites that show you how to write that letter.  Smaller publishing houses may be more willing to take a chance on a new writer than one from the Big 5.  To get the attention of an agent or editor you MUST write a book they want to represent. With that said, only query the ones that represent the genre your book is in. That makes sense, right?  Someone who only represents romance novels doesn't want to hear a pitch for a mystery. The query letter is the industry standard. Learn to write a killer query that hooks the agent and makes him/her want to read your work. I always (even though it says not to) include the first 5 pages of my ms (manuscript) along with the query. If they are interested, they will read them. If they read the first few pages and I can hook them, I'll get a request for a partial, which is 3 chapters. So there's your in... a killer query and a grab-em-by-the-throat first five pages. Just make sure the rest of the ms (manuscript) is as good as the first 5 pages. ",
            "date": "Answered April 9, 2016",
            "views": "17",
            "upvotes": " View 4 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Georgie",
                    "user_href": "/profile/Georgie-42"
                },
                {
                    "user_id": "Chenmeng Butterfly",
                    "user_href": "/profile/Chenmeng-Butterfly"
                },
                {
                    "user_id": "KJ Heale",
                    "user_href": "/profile/KJ-Heale"
                },
                {
                    "user_id": "Denise Vega",
                    "user_href": "/profile/Denise-Vega-2"
                }
            ]
        },
        {
            "author_info": {
                "name": "Marva Dasef",
                "href": "/profile/Marva-Dasef"
            },
            "answer_text": "Follow all the steps (outlined in hundreds, if not thousands, of easily located blogs and websites).  When your book is polished and edited, then go through all the documented steps for publishing (still easy to find plenty of advice). When writing your query letter (go look it up), if your age makes your book more sellable, then include it as an asset. For example, if your story is about a person of your own age and includes information you specifically encountered. If Anne Frank had lived to submit her diary, a publisher would certainly consider her age and personal experiences an asset to the book. If your age has no particular relevance to the book's content, then don't mention it. That includes any books written for children, middle-grade, or young adult. Unless your own experience is pertinent, you shouldn't mention your age until necessary. If a publisher or agent shows interest, you should then reveal your age and indicate you have a parent who will be the responsible contract signer since kids under 18 cannot legally sign an enforceable contract. Good luck! ",
            "date": "Answered May 11, 2016",
            "views": "11",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Wynter Rosen",
                    "user_href": "/profile/Wynter-Rosen"
                }
            ]
        },
        {
            "author_info": {
                "name": "Ayush Srivastava",
                "href": "/profile/Ayush-Srivastava-22"
            },
            "answer_text": "In simplest words, you can go for self-publishing or traditional publishing. Traditional publishing has been explained by User-13574788118874627179, so my advice in terms of self-publishing is as follows: a. Complete the book. b. Sit on it for some time, preferably around a month. You do nothing about it. Try to be too busy on other projects or work. c. Re-read it and edit it. Because first drafts almost always are. Repeat ‘b’ and ‘c’ until you are satisfied. d. (Optional) Release the initial chapters on online reading-writing site, like Wattpad or Fiction or some other site, so that you can get feedback on whether it is interesting enough (and some more grammar testing). e. Look into publishing via Smashwords, Amazon or some other such site. (I recommend Smashwords because of multiple distribution channels). Also, promote your book. (The reader base from step ‘d’ will be very helpful here.) f. Cry, if you did all this for money. Because unless you turn out to be a hidden gem with a best-seller, you won’t be earning enough for anything. ",
            "date": "Answered June 13, 2016",
            "views": "917",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Aditya Tiwari",
                    "user_href": "/profile/Aditya-Tiwari-1366"
                }
            ]
        },
        {
            "author_info": {
                "name": "Marty Agather",
                "href": "/profile/Marty-Agather"
            },
            "answer_text": "I don’t know whether or not there are publishers who specialize in youth authors or not, but Christopher Paolini published Eragon when he was about 18. He and his family did self publish, but that proves that a young adult can write a book that is commercially successful. Less important than your age is the quality of the writing and story. An editor can be a great resource to guide you, sometimes an author can be too close to their own work and overlook flaws. Good luck with your book! ",
            "date": "Answered May 31, 2017",
            "views": "442",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Ben Coco",
                    "user_href": "/profile/Ben-Coco-3"
                }
            ]
        },
        {
            "author_info": {
                "name": "Emma Hixson",
                "href": "/profile/Emma-Hixson"
            },
            "answer_text": "Hi! I'm a teen writer as well. I've self published two books through Amazon's create space program. This is definitely not the best if you want to publish for money or become famous, but you can do it for free. (Free isbn, free cover etc.)You must do your own formatting and editing. The only cost will be ordering your books, which are printed on demand. Let me know if you would like more info and I'd be glad to help! ",
            "date": "Answered July 19, 2016",
            "views": "400",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Chenmeng Butterfly",
                    "user_href": "/profile/Chenmeng-Butterfly"
                },
                {
                    "user_id": "Samantha Ng",
                    "user_href": "/profile/Samantha-Ng-29"
                }
            ]
        },
        {
            "author_info": {
                "name": "Saurabh Mittal",
                "href": "/profile/Saurabh-Mittal-93"
            },
            "answer_text": "The best and easiest way to publish a book in India is to log on to Pblishing.com We are a book publisher that has readers decide which books to publish and which not. We publish any work that successfully hits the 150 pre-order target. By “publish” we mean that we edit, design, print, distribute and market your book. In addition to this, we also give an exclusive platform to writers to interact and connect with their readers and have their works available to a wider audience. Users will be able to post stories, fan-fiction, poems etc., either through the web-portal or the mobile app. We also have partnership with the major book distributors in India like IBH and IBD and have Amazon, Flipkart, Paytm, Crosswords, Landmark and many others as our retailers, giving you a wide reach for your book. For more details visit : FAQ | Pblishing.com You can also get a FREE consultation by contacting us at info@pblishing.com or calling us at +91 9717835777 ",
            "date": "Updated May 26, 2017",
            "views": "381",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Brian Armstrong",
                "href": "/profile/Brian-Armstrong-51"
            },
            "answer_text": "Teenagers have their books published the same way as everyone else. Submit your manuscript to a company known for releasing books in your genre. Do some research on various publishing houses, read some of the books they have published, and determine if they are a good fit for your work. Once you’ve found the right publisher, read, and follow their submission guidelines explicitly. I hope this answer was of value to you. ",
            "date": "Answered June 1, 2017",
            "views": "428",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Laurence Lu",
                    "user_href": "/profile/Laurence-Lu-3"
                }
            ]
        },
        {
            "author_info": {
                "name": "Derek Murphy",
                "href": "/profile/Derek-Murphy-8"
            },
            "answer_text": "I would publish on Wattpad first and try to get people to read it, join some communities. You can submit it to an agent who reps YA fiction, there are lots of them, but if it's your first novel, and it hasn't been professionally edited, it's probably not ready to be published. You can self-publish it though, but I'd get some serious feedback from total strangers first. ",
            "date": "Answered November 22, 2015",
            "views": "846",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Chenmeng Butterfly",
                    "user_href": "/profile/Chenmeng-Butterfly"
                },
                {
                    "user_id": "Ben Coco",
                    "user_href": "/profile/Ben-Coco-3"
                }
            ]
        },
        {
            "author_info": {
                "name": "Alton Adam",
                "href": "/profile/Alton-Adam"
            },
            "answer_text": "It is so simple. Nowadays everyone can publish their book easily through grace point publishing. Karen and Michelle combined 60 years of experience in entrepreneurship, publishing, and marketing to help authors and visionary leaders promote their work. You can publish your book through them also they will help you to get more sell of your book. ",
            "date": "Answered June 25, 2020",
            "views": "58",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Hashmi Ahtesham",
                "href": "/profile/Hashmi-Ahtesham"
            },
            "answer_text": "if it is you who has written a novel, many congratulations to you. Doesn't matter how it is (though I hope it would be great), it's quite an achievement. Now coming to the point, as I have never written any novel, and I certainly do not have any idea about getting it published as well, but I know a person who may help you Awdhesh Singh (अवधेश सिंह) (he is a published writer and a very nice person). hope ‘he’ helps ;) Thanks for asking :) . ",
            "date": "Answered April 22, 2017",
            "views": "324",
            "upvotes": " View 2 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Ann Mary Benny",
                    "user_href": "/profile/Ann-Mary-Benny"
                },
                {
                    "user_id": "Neha Halwai",
                    "user_href": "/profile/Neha-Halwai"
                }
            ]
        },
        {
            "author_info": {
                "name": "Bandini Singh",
                "href": "/profile/Bandini-Singh"
            },
            "answer_text": "Playstore offers an option to self-publish the book. You can get the book published without getting any publisher. The Book is published in EPU format and you can even claim a copyright for it. You can checkout the link below for more detials: https://support.google.com/books/partner/checklist/4489282?hl=en ",
            "date": "Answered September 20, 2018",
            "views": "132",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Chenmeng Butterfly",
                    "user_href": "/profile/Chenmeng-Butterfly"
                },
                {
                    "user_id": "Abhishek Ojha (अभिषेक ओझा)",
                    "user_href": "/profile/Abhishek-Ojha-अभिषेक-ओझा"
                }
            ]
        },
        {
            "author_info": {
                "name": "Lucy Barge",
                "href": "/profile/Lucy-Barge"
            },
            "answer_text": "A teen can publish a book just the same as anyone else can! But if you’re worried about getting rejected by a publisher, I suggest publishing an ebook. That’s what I’ve done (I am a teen author). If you want any more help on teen publishing go to TheWrittenWord | LucyBarge | Home and click on Writing Tips. ",
            "date": "Answered November 20, 2017",
            "views": "162",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Philip Anderson",
                "href": "/profile/Philip-Anderson-34"
            },
            "answer_text": "Google this post by James Altucher and read it carefully:  How to Self-Publish a Bestseller: Publishing 3.0. He talks in detail about the 11 books he has published, both in traditional methods and self-published.  ",
            "date": "Answered April 4, 2016",
            "views": "166",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Varun Katiyar",
                "href": "/profile/Varun-Katiyar-13"
            },
            "answer_text": "to publish your book, make sure that your novel is ready, then contact to any self book publisher in india who publish your book and can give book to you on print on demand. ",
            "date": "Answered April 23, 2017",
            "views": "157",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "James H. Kelly",
                "href": "/profile/James-H-Kelly"
            },
            "answer_text": "Don't write several. Write one at a time and self publish as you go. ",
            "date": "Answered April 21, 2014",
            "views": "310",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Mercedes R. Lackey",
                "href": "/profile/Mercedes-R-Lackey"
            },
            "answer_text": "I didn’t. I was 35. ",
            "date": "Answered June 12, 2016",
            "views": "210",
            "upvotes": " Answer requested by Noah Hicks and Eunice Kim",
            "upvoters": [
                {
                    "user_id": "Chenmeng Butterfly",
                    "user_href": "/profile/Chenmeng-Butterfly"
                },
                {
                    "user_id": "Sandi Hudson",
                    "user_href": "/profile/Sandi-Hudson-2"
                }
            ]
        }
    ]
}