{
    "title": "How to read and download a book for free - Quora",
    "tags": [
        "Free Books",
        "Free Products",
        "Reading",
        "Downloading"
    ],
    "response": [
        {
            "author_info": {
                "name": "Jessica Wiggins",
                "href": "/profile/Jessica-Wiggins-16"
            },
            "answer_text": "There is one way that no one has mentioned, but you might not get to read the entire book sometimes. Google Scholar is sort of like the 120+ IQ cousin of Google. If you have a book, paper, journal entry, etc., that you want to read, simply go there and type in the title of the book, or simply a topic for books. The only things is, sometimes, due to some violation that might happen, they have to omit pages from the books (I guess so you will go buy the book). It is a good way to find out if you like a book before buying it, and also I believe most of the classics are there in full because there is no violation due to their age. I would suggest you check it out, not only for that, but also i you are in school. Google Scholar helps to find lots of actually good sources quite quickly. https://scholar.google.com/  Also, they usually have some really cool quotes in green (this one is from an expression said by Isaac Newton in 1676. Hope this helps! Cheers (and keep digging), Jess ",
            "date": "Updated July 12, 2017",
            "views": "23",
            "upvotes": " View 2 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Chirag Dhaifule",
                    "user_href": "/profile/Chirag-Dhaifule"
                },
                {
                    "user_id": "Sanat Singh",
                    "user_href": "/profile/Sanat-Singh-10"
                }
            ]
        },
        {
            "author_info": {
                "name": "André Leandro",
                "href": "/profile/André-Leandro-3"
            },
            "answer_text": "If you have a mobile (Tablet/Cellphone) you can download ‘Aldiko Reader’ (An app), it comes with dozens of free books, most of them really good, and all of them classics. You can also look in google for free .epub books (.epub is a filename extension, if you don’t know what a filename extension is you can read it here: Filename extension - Wikipedia), and read them in your Aldiko app. Most browsers also support .epub readers extensions, so you can also read them in your PC/Mac. You can always illegaly download books using torrents, but keep in my that you would be commiting a crime and you’re indirectly damaging the author. PS.: There is another file extension that you could look for in case you use iOS, that is .mobi ",
            "date": "Answered March 19, 2017",
            "views": "426",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Pat Sonti",
                    "user_href": "/profile/Pat-Sonti"
                }
            ]
        }
    ]
}