{
    "title": "How to write a summary - Quora",
    "tags": [
        "Essay Writing Skills",
        "Critical Reading",
        "Reading Comprehension",
        "Summaries",
        "Essay Writing Help",
        "Writing Advice",
        "How-to Question",
        "Grammar"
    ],
    "response": [
        {
            "author_info": {
                "name": "Martina Crosber",
                "href": "/profile/Martina-Crosber"
            },
            "answer_text": "A summary is a fairly brief restatement--IN YOUR OWN WORDS--of the contents of a passage. Report back what the other writer has said. Do not make a value judgments about the \"rightness\" or \"wrongness\" of what (s)he says. (That would be a different kind of paper--a summary-response, a critique, or a position paper). While it is hard to give concrete guidelines for length, many good summaries are about 1/4 to 1/3 the length of the original. Some steps in writing a summary Read through the whole piece--carefully. Annotate (underline, highlight, asterisk, star, flag things; comment in the margins anything that stands out to you as relevant information) as you read. Look back for 1-2 sentences that state the author's main point. This is the article's thesis statement. The thesis may appear early or late in the essay. Reread the selection, dividing it into sections of thought; it’s likely that each section may be several paragraphs. Write a sentence or two summarizing each section of thought. (Try writing a summary sentence for each paragraph and then revising where you see yourself repeating ideas). Write a first draft of your summary, including the following items: In the first sentence or two-- 1. the author's name. 2. the article's/ chapter's name (perhaps even the magazine's or book's name in which the article or chapter appeared). 3. the author's thesis statement. Here's an example: \"In the excerpt from The Idea of a University, John Henry Newman argues that the real purpose of a university education is to help students become wise, enable each one to understand as much as possible of the world in which (s)he lives and to see clearly how each piece of knowledge relates to each other piece of knowledge.\" Summary sentences for each paragraph or section should be written in same order that the author presents the essay. You should make every effort to inform the reader of the author's ideas in your own words—Be sure to avoid plagiarism. If you quote a point directly from the author, be sure to place quotation marks around what you have borrowed and cite your page number. Include occasional supporting details, if and only if they are the most significant ones and apply to the thesis and are imperative for further understanding of the topic. Check the draft against the original piece for accuracy. Revise the summary to \"smooth out\" its choppiness. In other words, link your section summary sentences together with good transitional words or phrases (like “in addition,” “moreover,” “on the other hand,” “however,” “finally”). Proofread, spell-check and seek assistance at the writing workshop. ",
            "date": "Answered February 15, 2017",
            "views": "21",
            "upvotes": " View 14 Upvoters",
            "upvoters": [
                {
                    "user_id": "Bhargav Jp",
                    "user_href": "/profile/Bhargav-Jp-1"
                },
                {
                    "user_id": "Akosua Nyarkoa Wiafe-Akenten",
                    "user_href": "/profile/Akosua-Nyarkoa-Wiafe-Akenten"
                },
                {
                    "user_id": "Shubheksh Pratap Singh",
                    "user_href": "/profile/Shubheksh-Pratap-Singh-1"
                },
                {
                    "user_id": "Leo Aj",
                    "user_href": "/profile/Leo-Aj"
                },
                {
                    "user_id": "Grace Valentine",
                    "user_href": "/profile/Grace-Valentine-1"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/Phil-Phil-221"
                },
                {
                    "user_id": "Sonali Singh",
                    "user_href": "/profile/Sonali-Singh-301"
                },
                {
                    "user_id": "Samuel Sam",
                    "user_href": "/profile/Samuel-Sam-200"
                },
                {
                    "user_id": "Hetansh Pala",
                    "user_href": "/profile/Hetansh-Pala"
                },
                {
                    "user_id": "Anu Sharma",
                    "user_href": "/profile/Anu-Sharma-876"
                }
            ]
        },
        {
            "author_info": {
                "name": "Albion Emma",
                "href": "/profile/Albion-Emma"
            },
            "answer_text": "By definition, a summary is “a brief statement or account of the main points of something.” Writing a good summary indicates that you clearly understand a text and that you can effectively communicate that understanding to your readers. It’s a technical skill that demonstrates reading comprehension and writing ability. A well-written summary is not an analysis of the text; rather, it's a condensed overview of the original piece.  In a summary, you want to identify the main idea of the article and put this information into your own words. To do this, you must be willing to read the article several times. On the first reading, try to gain a general notion of what the article is trying to say. Once you've done this write down your initial impression. This is most likely the thesis, or main idea, of the article. Also, be sure to include the author's first and last name and the title of the article in your notation for later reference. Write your summery from best site. When trying to identify the central idea, you should ask yourself, \"Why was this essay written and published?\" Clues to help determine this include the following. How to Identify the Main Idea of an Article Gather information from the title.Identify the place it was published, as this can help you determine the intended audience.Determine the date of publication.Determine the type of essay. (Is it expository, argumentative, literary, scholarly?)Take note of the tone of the piece.Identify certain notions or arguments that seem to be repeated throughout.Applying these methods of identification, let's take a look at the article \"Bypass Cure\" by James Johnson. We can assume the subject of the article from the title. Upon further examination, it becomes clear that the author is arguing that new research suggests the best cure for diabetes is the surgical solution of a gastric bypass. Good luck. ",
            "date": "Answered September 15, 2019",
            "views": "532",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Bhargav Jp",
                    "user_href": "/profile/Bhargav-Jp-1"
                }
            ]
        }
    ]
}