{
    "title": "How do people with ADHD get themselves to read books on ADHD? - Quora",
    "tags": [
        "Adult ADHD/ADD",
        "Attention Deficit Hyperactivity Disorder",
        "Mental Illness"
    ],
    "response": [
        {
            "author_info": {
                "name": "Ron Hunter",
                "href": "/profile/Ron-Hunter-9"
            },
            "answer_text": "If you’re interested in the subject, then it probably will not be much of a problem. While ADHD is characterized by a lack of focus, for a number of folks they also have a sort of “hyper-focus.” The can zoom in on something and stay with it in an almost compulsive fashion. I heard a story of someone who was so hyper-focused on a subject that they didn’t acknowledge a fire alarm in their building and the emergency responders had to get them to evacuate. If you find ADHD books that fascinating, then many ADHD people will devour them. I love just about any writing on the brain. I’ve never had a problem reading books on ADHD. ",
            "date": "Answered June 17, 2016",
            "views": "454",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Clint Sebastian",
                    "user_href": "/profile/Clint-Sebastian"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/Allaboutthatbass"
                },
                {
                    "user_id": "Chandramouli Parasuraman",
                    "user_href": "/profile/சந்திரமௌலி-பரசுராமன்-Chandramouli-Parasuraman"
                }
            ]
        },
        {
            "author_info": {
                "name": "Andy Kerr",
                "href": "/profile/Andy-Kerr-1"
            },
            "answer_text": "I’m currently reading Understanding Girls with ADHD, Updated and Revised: How They Feel and Why They Do What They Do by Kathleen Nadeau, Littman, and Quinn, because, hey, may daughter is awesome, and even more ADD than I am. I leave the book on my chair, or a shelf, or anyplace I’m likely to see it. Whenever I do, I pick it up and read a few pages. Then I go do something else while I think about it. Having to pick it up and move it in order to sit down actually reminds me to read it. ",
            "date": "Answered January 19, 2017",
            "views": "151",
            "upvotes": "0"
        }
    ]
}