{
    "title": "How accurate is 'The Hurt Locker'? - Quora",
    "tags": [
        "Accurate",
        "The Hurt Locker (2008 movie)",
        "Movie Scripts",
        "Screenwriting",
        "Movie Story and Plot Themes"
    ],
    "response": [
        {
            "author_info": {
                "name": "Witch Doctor",
                "href": "/profile/Witch-Doctor-4"
            },
            "answer_text": "BLUF: It is a terribly inaccurate movie. You can interpret what the screenwriter and director “intended\" all year, as well as read into the “realism and accuracy of the stress and intensity\" as much as you want. However, in regards to the accuracy of how soldiers (EOD) and others, live, work, relax, and relate to each others and their families, it is incredibly inaccurate. It is also B-movie scale inaccurate with the uniforms, equipment, and vehicles. The jargon is accurate however dated and overplayed. (No one in 2003 called a flashlight a “torch\", except the Brits. It's simply a light.) The operations and conduct of the Soldiers (the EOD team and Infantryman) are off the scale of accuracy as is the depiction of the Private Mercenary Headhunters collecting bounties (here's a secret, they didnt exist). The most egregious offense the movie made in racking up accolades was continually espousing its realism. And not in the sense that “the main character symbolized this, and this scene was a metaphor for that” as critical apologists say. The director claimed multiple times that the movie was intended to be realistic, visceral, and accurate in its depiction of Soldiers and the conditions of the Iraq War. And as they all took the stage they thanked the Soldiers they parodied while collecting their little statues Which is why consumers voted with their paycheck. It received scathing reviews from the veteran community and never gained momentum. It is the lowest grossing best picture of all time. That says something. If you want drama, intense action and realism, watch Black Hawk Down, men who showed courage, not arrogance in the face of danger. If you want visceral realism on Soldiers, their interactions and their operations, watch Restrepo. If you want to kill 2 hours of your life on a “critically acclaimed\" war movie that has only loose ties to reality, watch Inglorious Bastards. Leave the Hurt Locker alone. ",
            "date": "Answered February 18, 2019",
            "views": "780",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "F. Dorgan",
                    "user_href": "/profile/F-Dorgan"
                },
                {
                    "user_id": "James Wood",
                    "user_href": "/profile/James-Wood-169"
                },
                {
                    "user_id": "Nkosana Khumalo",
                    "user_href": "/profile/Nkosana-Khumalo"
                }
            ]
        },
        {
            "author_info": {
                "name": "Gabriel Bruskoff",
                "href": "/profile/Gabriel-Bruskoff"
            },
            "answer_text": "Whether The Hurt Locker is “accurate” in its depiction of operations in Iraq (according to US soldiers, it isn’t), is not the point, as deep down, at the film’s heart, it isn’t about operations in Iraq at all. The film isn’t meant to be taken literally, we are meant to look at what the film represents, namely that the US (not US soldiers, but the US as a whole) is addicted to war, and that this addiction hurts people at home and abroad. I would say this deeper level truth is quite accurate, even though the surface level plot is not. I actually made a video on this very topic, one that goes into far more detail than this post:  ",
            "date": "Updated August 16, 2018",
            "views": "770",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Martin McNally",
                    "user_href": "/profile/Martin-McNally-9"
                }
            ]
        },
        {
            "author_info": {
                "name": "Jeff Wilson",
                "href": "/profile/Jeff-Wilson-19"
            },
            "answer_text": "Not very accurate at allhttp://www.huffingtonpost.com/kate-hoit/the-hurt-locker-doesnt-ge_b_449043.html This guy says Inglorious Basterds was more honest, and he has a point.http://www.huffingtonpost.com/richard-allen-smith/the-hurt-lockeri-inaccura_b_489976.html ",
            "date": "Answered September 25, 2015",
            "views": "506",
            "upvotes": "0"
        }
    ]
}