{
    "title": "How can someone improve their financial outlook in five easy steps? - Quora",
    "tags": [
        "Financial Outlook"
    ],
    "response": [
        {
            "author_info": {
                "name": "John Cousins",
                "href": "/profile/John-Cousins-8"
            },
            "answer_text": "The Four Basic Steps to Wealth Creation There are four necessary steps to improve your finances. They are all related to managing money: · Spend less than you make · Eliminate debt · Save · Invest That’s it. Let that sink in. If you stop reading here, you have the plan. It probably looks overwhelming and impossible, and you are probably thinking: “duh, no shit, I knew that.” Everyone knows the path, but few walk it. I want to get that out of the way so you aren’t hopeful that I am going to provide some get-rich-quick secret formula. The way to wealth takes work, discipline, and time. It’s simple, but not easy. The good news is this practice has the benefit of near certitude. Consistency is crucial, so develop habits and plans and goals to make it happen. Don’t rely on enthusiasm. Habit is more dependable. It’s persistence in practice. Even if you are on the path to making riches in sports, or entertainment, or winning the lottery, these fundamental steps are still essential. Once you reach those summits and achieve those goals, you must be prepared to keep your hard-earned riches. It’s not what you make but what you keep. There are too many stories of talented people being ripped off by their accountants, managers, friends, lovers, or making foolish speculative money decisions and losing it all. Too many people that win the lottery are back at zero in a short amount of time. If you don’t manage and keep your money, you will lose it. A fool and money are soon parted. A cautionary tale from mountain climbing shows a similar disregard for post-success preparation. Most tragedies and deaths in mountaineering occur after summiting, on the descent journey. People focus so much on achieving the summit that they don’t prepare for the trip back down to safety. Take a lesson from that scenario. Educate yourself now and be prepared for what happens after you successfully summit or achieve your goals. It’s not what you make; it’s what you keep. \"Get what you can, and what you get hold\" Ben Franklin I learned these lessons, and this approach the hard way. I want to help you not to make the same mistakes I made. Make different mistakes. I look back and see how much more relaxed I could have made my life if I had known this stuff early on. I was lucky early in my career. I worked hard and achieved dreams. But I also played hard and spent recklessly. I was undisciplined in how I managed money. I could make lots more. It’s not what you make; it’s what you keep. I ended up going through bankruptcy and then later divorce and ended up a pauper. I went through savings that I shouldn’t have touched. I have been the poster child for poor money management. I scrambled to create the next home run with entrepreneurship and startups, and I stumbled with those trying to do too much too fast. But I changed it around. I stopped relying on the next big home run and started focusing on hitting solid singles. I have achieved financial freedom and am beholden to no one for a paycheck. I can pursue my interests and do what I want when I want. That is an incredible feeling. It took a long time and a lot of heartaches, worry, and frustration. Had I known then what I now know, I could have avoided financial pitfalls and the attendant anxiety. This advice is what I would give my younger self. It’s the advice I now follow. You can avoid common pitfalls and get there sooner and easier. Spend less than you make, eliminate high-interest debt like credit cards, save, and invest. Don’t save what’s left after spending. Spend what’s left after saving. Pay yourself first. Keep investing simple and straightforward. Don’t get caught up in any convoluted schemes. If you don’t understand it, don’t invest in it. Invest in the stock market and real estate. Knowing you have a plan and are working that plan will make you feel so much more in control. It will relieve anxiety about the future and replace it with excitement and empowerment. You will plan the work and work the plan. You will see if you are on track and make adjustments along the way toward your feasible and achievable goals. Being wealthy is having the financial freedom of not having to rely on a paycheck to meet your monthly obligations. Trim back your overhead expenses and buy income-producing assets like dividend-yielding stocks and rental properties. When that passive income covers your monthly costs, you are officially wealthy. That independence is what they call fuck you money. In the book Noble House, the author James Clavell termed it 'screw you' money. It is having enough money to say screw you to anyone or anything you don’t want to do. It’s enough money to decline or say no politely. Manners and measured speech are essential now that you are on your way to being wealthy. If you want to be wealth, start acting like it now. Winners act like winners before they’re winners. Covering your monthly expenses with passive investment income does not take an outrageously huge sum of money. It is doable. The financial independence it provides will also help you stick to your principles and ethics. You won’t find yourself tempted to do something you know is wrong to make ends meet. Money isn’t the root of evil. Not having money is. Not having cash makes us desperate and more liable to make poor decisions. I hope this gives you a simple road map to getting your financial house in order. The way to wealth isn’t about gaining knowledge and understanding as much as putting that newfound knowledge to work for you. The way to wealth is about action and doing. The key is to get started and be consistent. Make a simple plan and stick to it. ",
            "date": "Answered October 3, 2019",
            "views": "235",
            "upvotes": " View 2 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Chase Edwards",
                    "user_href": "/profile/Chase-Edwards-12"
                },
                {
                    "user_id": "Miguel Camino",
                    "user_href": "/profile/Miguel-Camino-2"
                }
            ]
        },
        {
            "author_info": {
                "name": "Difu Wu",
                "href": "/profile/Difu-Wu"
            },
            "answer_text": "Spend less by living below your means.Save more of what you earn.Get rid of high cost debt (>6%APR), starting with the highest cost debt first.Invest in stocks (once you have eliminated all high cost debt), best through a low cost total stock market index fund.Stay the course.",
            "date": "Answered September 30, 2019",
            "views": "13",
            "upvotes": " Answer requested by Miguel Camino"
        }
    ]
}