{
    "title": "How to get over the feeling that I'm unlovable - Quora",
    "tags": [
        "Unlovable",
        "Love and Friendship",
        "Love and Friendships",
        "Self-Esteem",
        "Understanding Love",
        "Friendship Advice",
        "How-to Question",
        "Love Life Advice",
        "Friendship",
        "Love"
    ],
    "response": [
        {
            "author_info": {
                "name": "Mike Leary",
                "href": "/profile/Mike-Leary"
            },
            "answer_text": "Unlovable is a shame conclusion you came to because your original caregivers couldn't, or wouldn't, give it. The typical response is trying to get others to give you that value but they are unable to, even though they may try. Your interpretation of this is to confirm what you already believe through experience, ie: You're unlovable. All the performing you do will ultimately be futile because they cannot make up for what you believe you need. Namely your parent-Gods were supposed to love you unconditionally. Love isn't supposed to be something you earn. To heal that soul-wound, you have to trump your original (Gods’) messages about your worth, you received as an experience. In addition, it really isn't the adult you who needs the validation. It is that little ghost-child inside who is still lonely and insecure. That kid needs you to create an experience where the blessing is a given. That is why most all societies have Priests, Shaman, or Holy people to help people discover the truth of who they are. You can't be subjective and objective at the same time. So to get over it, or heal it, You have to find someone skilled in helping you find the truth. That little ghost-child was lovable \"just the way they are\", to quote Mr. Rogers. The child was lovable just because it exists and belongs in this world. It is not a truth you are unlovable, just a feeling. Your feeling can be changed with a new paradigm. There are a number of therapies and processes designed to change that. Find one that works for you. ",
            "date": "Updated October 11, 2018",
            "views": "68",
            "upvotes": " View 32 Upvoters ",
            "upvoters": [
                {
                    "user_id": "William Allan Shearer",
                    "user_href": "/profile/William-Allan-Shearer"
                },
                {
                    "user_id": "Alex Rivera",
                    "user_href": "/profile/Alex-Rivera-584"
                },
                {
                    "user_id": "Craig D. Dugan",
                    "user_href": "/profile/Craig-D-Dugan"
                },
                {
                    "user_id": "Selin Tarık",
                    "user_href": "/profile/Selin-Tarık"
                },
                {
                    "user_id": "Alice Dell'antoglietta",
                    "user_href": "/profile/Alice-Dellantoglietta"
                },
                {
                    "user_id": "Ren C",
                    "user_href": "/profile/Ren-C-6"
                },
                {
                    "user_id": "Ashlyn Barnard",
                    "user_href": "/profile/Ashlyn-Barnard"
                },
                {
                    "user_id": "Adriana Capalbo",
                    "user_href": "/profile/Adriana-Capalbo"
                },
                {
                    "user_id": "Sarah Young",
                    "user_href": "/profile/Sarah-Young-557"
                },
                {
                    "user_id": "Jennifer Mallory",
                    "user_href": "/profile/Jennifer-Mallory-5"
                },
                {
                    "user_id": "Hằng Lam",
                    "user_href": "/profile/Hằng-Lam"
                },
                {
                    "user_id": "Kirstin Huiber",
                    "user_href": "/profile/Kirstin-Huiber"
                },
                {
                    "user_id": "Alee Alee",
                    "user_href": "/profile/Alee-Alee"
                },
                {
                    "user_id": "Lomax Bridges",
                    "user_href": "/profile/Lomax-Bridges"
                },
                {
                    "user_id": "Marissa Ealey",
                    "user_href": "/profile/Marissa-Ealey"
                },
                {
                    "user_id": "Chris Breece",
                    "user_href": "/profile/Chris-Breece-1"
                },
                {
                    "user_id": "Kat",
                    "user_href": "/profile/Kat-1588"
                },
                {
                    "user_id": "Tazavia Davis",
                    "user_href": "/profile/Tazavia-Davis"
                },
                {
                    "user_id": "Robert Foenix",
                    "user_href": "/profile/Robert-Foenix"
                },
                {
                    "user_id": "James Flint",
                    "user_href": "/profile/James-Flint-30"
                },
                {
                    "user_id": "David de la Fuente",
                    "user_href": "/profile/David-de-la-Fuente"
                },
                {
                    "user_id": "Benjamin Dara",
                    "user_href": "/profile/Benjamin-Dara"
                },
                {
                    "user_id": "Carlos Carbajal",
                    "user_href": "/profile/Carlos-Carbajal"
                },
                {
                    "user_id": "Donald Kirby",
                    "user_href": "/profile/Donald-Kirby"
                },
                {
                    "user_id": "Viorel Smeu",
                    "user_href": "/profile/Viorel-Smeu"
                },
                {
                    "user_id": "Angela Luzardo",
                    "user_href": "/profile/Angela-Luzardo"
                },
                {
                    "user_id": "Samrach Phon",
                    "user_href": "/profile/Samrach-Phon"
                },
                {
                    "user_id": "Cathy Thorsen",
                    "user_href": "/profile/Cathy-Thorsen"
                },
                {
                    "user_id": "Jan Leadbetter",
                    "user_href": "/profile/Jan-Leadbetter"
                },
                {
                    "user_id": "Czen de la Serna-Limbago",
                    "user_href": "/profile/Czen-de-la-Serna-Limbago"
                },
                {
                    "user_id": "Marc Bodnick",
                    "user_href": "/profile/Marc-Bodnick"
                },
                {
                    "user_id": "Gary Stein",
                    "user_href": "/profile/Gary-Stein"
                }
            ]
        },
        {
            "author_info": {
                "name": "Elin Hansson",
                "href": "/profile/Elin-Hansson-4"
            },
            "answer_text": "I was asked to answer for the first time, thanks for that. I think first and foremost that no one is truly unlovable so I think I'd rather answer “how do you cope with *feeling* unlovable?” because I have some experience in that and that may still be of help to you. I have felt unlovable many times during my not so long life. There are notes I've written at thirteen, fourteen, fifteen (you get the idea) that ask this very question: what is is about me that's so awful that no one can love me? The answer was: nothing. I wasn't unlovable. I grew up thinking that my parents didn't love me, which I now think they do in some way even if they're far from the best parents in the world. This, I applied to everyone as a rule since I also wasn't very popular in school, didn't have many friends, some people made fun of me, I was always pickes last in PE, the list goes on. As far as romatic relationships go I only recently had experience with that (at twenty) but I still haven't been kissed (long distance). I think the reason I have such trouble with people is that I am a bit different than them, especially people my age. Growing up the way I did made me have to grow up very quickly, I always felt older than my peers and I think they could tell too that I had other values than they did. That's why my romatic interest is eleven years older than I am… whoops… My mother hates it but I have never met anyone who accepts me like he does and I've realised that I would've settled for a lot less than that. I still don't have that many friends due to my living situation but I am hoping that'll change and I think it could. So. How do you cope? You realise that you're a bit more of an acquired taste than others might be and that you just have to find the people who'll appreciate you for it. Unless there's something critical in your behaviour, like that you don't treat people well for instance, you should be fine. Finding people with similar interests is always a good start to get to know people and -here's the cliché- you have to try to push yourself to accept yourself as you are, despite what past you have that makes you feel this way. It's just a feeling in your head, you control your head in this case. That's not to say it's easy, I still struggle almost every day to stay positive, but it's worth fighting for, it really is. I hope you find a way to cope! ",
            "date": "Answered March 19, 2017",
            "views": "43",
            "upvotes": " View 13 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Priya Philip",
                    "user_href": "/profile/Priya-Philip-9"
                },
                {
                    "user_id": "Laura Silov",
                    "user_href": "/profile/Laura-Silov"
                },
                {
                    "user_id": "Mary Müller",
                    "user_href": "/profile/Mary-Müller-6"
                },
                {
                    "user_id": "JUlia DeMeo",
                    "user_href": "/profile/JUlia-DeMeo"
                },
                {
                    "user_id": "Ejison Jessy",
                    "user_href": "/profile/Ejison-Jessy"
                },
                {
                    "user_id": "Ashlyn Barnard",
                    "user_href": "/profile/Ashlyn-Barnard"
                },
                {
                    "user_id": "Natalie Roworth",
                    "user_href": "/profile/Natalie-Roworth"
                },
                {
                    "user_id": "Ramnik Kaur",
                    "user_href": "/profile/Ramnik-Kaur-8"
                },
                {
                    "user_id": "Michael Cosentino",
                    "user_href": "/profile/Michael-Cosentino-9"
                },
                {
                    "user_id": "Destiny Springer",
                    "user_href": "/profile/Destiny-Springer-2"
                },
                {
                    "user_id": "Priya Chawla",
                    "user_href": "/profile/Priya-Chawla-1"
                },
                {
                    "user_id": "Troy Mason",
                    "user_href": "/profile/Troy-Mason-5"
                },
                {
                    "user_id": "Karthee Karths",
                    "user_href": "/profile/Karthee-Karths"
                }
            ]
        },
        {
            "author_info": {
                "name": "Zachary Gottlieb",
                "href": "/profile/Zachary-Gottlieb"
            },
            "answer_text": "Hard to answer a question like this without finding out some more about you, but I'll give it a shot. To elucidate the concept of self-love (without which you will never be able to understand how others could love you), most psychologists use the analogy of two cisterns providing water for the same village. Both collect the same amount of rainwater, but when a draught hits one day, only one of them continues to supply the villagers, as it has access to an underground reservoir that it can draw from until the rains come back. Following are just a handful of strategies for acquiring (\"rediscovering\" would be a more accurate term, since we are all born with it as children) that underground reservoir, and for learning to draw from it when the world might not be as kind to you as it has been in the past:   Nurture relationships. As much as you can, try to make sure you are surrounding yourself with people whom you value. There are few substitutes for good relationships - be they with friends, family or romantic partners - to make you feel a sense of belonging and that you are loved. You may think that you don't have enough of these... Well, then it's time to go out and look for more. There is a chicken and egg problem here (i.e. How do I put myself out there if I don't have anything to offer?), but force yourself to do it and you may surprise yourself.Focus on personal qualities. Most people have certain skills or attributes that make them more valuable than others in the eyes of society (I have met very few people in life who do not have at least some... Make sure you are being honest with yourself). Whatever they are in your case, spend time reflecting on the things that make you unique, or the things that you have accomplished, and learn to recognize your worth in that way. The easiest time to do this is of course when exercising the qualities in question, but it is a good practice to make a list or otherwise encourage yourself to concentrate on them at other times, too.Consider meditating. As another answerer suggested, explore meditation as a path to feeling more compassion towards yourself. \"Love\" in the way that most of us consider it is a very ego-based construct, whereas meditation is an excellent teacher of loving yourself as part of an interconnected whole, thereby gaining a more authentic understand of the expression \"no man is an island.\" It's not for everyone, but buy a book called \"Mindfulness in Plain English\" and see if you can't put aside 15-20 minutes per day for just a couple of months to see if this would help you.Look after your body. At times when I have thought little of myself, I noticed that one of the first things to happen was that I stopped caring about my physical wellbeing. If this body doesn't house anything of value, why waste time on its upkeep? It's a logical argument, and impossible to refute on its own merit. The mind-body relationship runs much deeper than a lot of people think, however... In the same way that smiling for long enough can serve to make you feel happier, taking small steps whenever possible to care for your body will help you to feel better about your self-image. It will also help to lift your spirits on a physiological level.Build will power. This is a big one -  arguably the most important of the list. Whenever you are down on yourself, you will not feel like telling yourself how great you actually are - and naturally, since the very reason you're feeling down is because you don't think that about yourself. By simply forcing yourself to get up and engage in an activity to divert your mind from negativity -  or in any of the other strategies I've mentioned - you're giving yourself the biggest leg up you possibly could. The first few times you try to distance yourself from yourself in this way will be the hardest, and you probably won't succeed. Will power is like muscle, however, and the more times you manage to exercise it successfully, the more reference points you'll be giving yourself to make it that much easier the next time.Ultimately, if you've tried many suggestions such as these, and nothing seems to be working, then I would recommend seeking out professional guidance. There is zero shame in this and you would by no means be \"giving up\":  many high successful people receive counseling of some form or another on a continuous basis, and most of us have sought this kind of help at some point in our lives. When all is said and done, you must accept (and it's by no means an easy task) that you are the only one who can increase your self-esteem and appreciation for your qualities that I'm sure you richly deserve. Once you have fully acknowledged that no other person can, or indeed should, be relied on to help you achieve this, you will already be on your way to building that self-replenishing reservoir, which is probably the biggest key to happiness in life. ",
            "date": "Answered August 17, 2011",
            "views": "115",
            "upvotes": " View 21 Upvoters",
            "upvoters": [
                {
                    "user_id": "Sharon Ringdahl",
                    "user_href": "/profile/Sharon-Ringdahl"
                },
                {
                    "user_id": "Selin Tarık",
                    "user_href": "/profile/Selin-Tarık"
                },
                {
                    "user_id": "Ren C",
                    "user_href": "/profile/Ren-C-6"
                },
                {
                    "user_id": "Lana Wills",
                    "user_href": "/profile/Lana-Wills-1"
                },
                {
                    "user_id": "Natalia Markanovic",
                    "user_href": "/profile/Natalia-Markanovic-1"
                },
                {
                    "user_id": "Ausias Gaula",
                    "user_href": "/profile/Ausias-Gaula"
                },
                {
                    "user_id": "Jason Zhou",
                    "user_href": "/profile/Jason-Zhou-89"
                },
                {
                    "user_id": "Lily E",
                    "user_href": "/profile/Lily-E-6"
                },
                {
                    "user_id": "Cindy Carpenter",
                    "user_href": "/profile/Cindy-Carpenter-9"
                },
                {
                    "user_id": "Kat",
                    "user_href": "/profile/Kat-1588"
                },
                {
                    "user_id": "Venti Baggins",
                    "user_href": "/profile/Venti-Baggins"
                },
                {
                    "user_id": "Fiona Fang",
                    "user_href": "/profile/Fiona-Fang"
                },
                {
                    "user_id": "Tazavia Davis",
                    "user_href": "/profile/Tazavia-Davis"
                },
                {
                    "user_id": "David de la Fuente",
                    "user_href": "/profile/David-de-la-Fuente"
                },
                {
                    "user_id": "James Earl Adams III",
                    "user_href": "/profile/James-Earl-Adams-III"
                },
                {
                    "user_id": "Cathy Thorsen",
                    "user_href": "/profile/Cathy-Thorsen"
                },
                {
                    "user_id": "Nick Ashcroft",
                    "user_href": "/profile/Nick-Ashcroft"
                },
                {
                    "user_id": "Lisa Kaka",
                    "user_href": "/profile/Lisa-Kaka"
                },
                {
                    "user_id": "Czen de la Serna-Limbago",
                    "user_href": "/profile/Czen-de-la-Serna-Limbago"
                },
                {
                    "user_id": "Kat Li",
                    "user_href": "/profile/Kat-Li-7"
                },
                {
                    "user_id": "Marc Bodnick",
                    "user_href": "/profile/Marc-Bodnick"
                }
            ]
        },
        {
            "author_info": {
                "name": "Prashant Jijyal Verma",
                "href": "/profile/Prashant-Jijyal-Verma"
            },
            "answer_text": "You know what love is the most beautiful thing. When you love someone you just love her. ( I love her ;) ) But the most destructive thing is one sided love. I have waited for her for last 4 years. And then finally… she was with me . The heart always skipped a beat whenever she held my hand. I loved the way she used to tease me. And I loved the way she used to keep on texting me . I still remember when I was out of station for 7 days and there was no phone at all with me . And when my phone started working , there were blunder of messages by her. But….. She loves someone else.. Maybe someone… who is perfect. Maybe someone. . whom she thinks is the best. At one night… I called her .. a long time ago…and when I heard her crying my heart just got broken. She was crying just Coz of him. And I swear of Mahadev, if were there I would have punched in the face of that guy. But you know what.. you feel completely broken and helpless when your love compares your love with someone's else love. The most beautiful day of my life was when she said “ i love you Prashant”.  I just can't express that feelings in words. And the next day… she said “ i am sorry Parshant. I don't have feelings for you. I still love him” And seriously… it seemed like a sword just hit my chest. Her words just cut deeper than knife. I was so broken that I didn't sleep for straight 7 nights. And when you are unloved by someone… you just start hating yourself. You either become a poet or a writer. And yes.. I wrote 7 poems for her. And then what happened next… she made fun of my feelings (poems). But I don't know why I can't stop loving her. I don't know why I just can't stop thinking about her. I don't know why can't she see my feelings.. I don't know why … I don't know why. .. But yes….. I still love her… And I fall in love with her everyday…. Every moment spent with her is bliss. And the most important thing…. I still love holding her hands .  ",
            "date": "Answered October 31, 2017",
            "views": "5",
            "upvotes": " View 67 Upvoters",
            "upvoters": [
                {
                    "user_id": "Chris Homere",
                    "user_href": "/profile/Chris-Homere"
                },
                {
                    "user_id": "Yamini Verma",
                    "user_href": "/profile/Yamini-Verma-11"
                },
                {
                    "user_id": "Sirapuram Rahul Raj",
                    "user_href": "/profile/Sirapuram-Rahul-Raj"
                },
                {
                    "user_id": "Maheshwari Tanwar",
                    "user_href": "/profile/Maheshwari-Tanwar-1"
                },
                {
                    "user_id": "Aryan Sontake",
                    "user_href": "/profile/Aryan-Sontake"
                },
                {
                    "user_id": "Anshul Kaushik",
                    "user_href": "/profile/Anshul-Kaushik-18"
                },
                {
                    "user_id": "KHUSHI SINGH",
                    "user_href": "/profile/KHUSHI-SINGH-213"
                },
                {
                    "user_id": "Sagar Jaiswal",
                    "user_href": "/profile/Sagar-Jaiswal-20"
                },
                {
                    "user_id": "Preeti Bajwa",
                    "user_href": "/profile/Preeti-Bajwa-3"
                },
                {
                    "user_id": "Komal Preet Kaur",
                    "user_href": "/profile/Komal-Preet-Kaur-14"
                },
                {
                    "user_id": "Niranjan",
                    "user_href": "/profile/Niranjan-101"
                },
                {
                    "user_id": "Priyanka Singh",
                    "user_href": "/profile/Priyanka-Singh-1887"
                },
                {
                    "user_id": "Juned Sheikh",
                    "user_href": "/profile/Juned-Sheikh-7"
                },
                {
                    "user_id": "Jimmy Vishwakarma",
                    "user_href": "/profile/Jimmy-Vishwakarma-1"
                },
                {
                    "user_id": "Janak Kadadas",
                    "user_href": "/profile/Janak-Kadadas"
                },
                {
                    "user_id": "Maresh Nani",
                    "user_href": "/profile/Maresh-Nani-1"
                },
                {
                    "user_id": "Jyothi Soruban",
                    "user_href": "/profile/Jyothi-Soruban"
                },
                {
                    "user_id": "Arjun",
                    "user_href": "/profile/Arjun-1023"
                },
                {
                    "user_id": "Priyanka",
                    "user_href": "/profile/Priyanka-1246"
                },
                {
                    "user_id": "Apoorva Singh",
                    "user_href": "/profile/अपूर्वा-सिंह-Apoorva-Singh"
                },
                {
                    "user_id": "Sonu",
                    "user_href": "/profile/Sonu-187"
                },
                {
                    "user_id": "Naveen Kumar",
                    "user_href": "/profile/Naveen-Kumar-9185"
                },
                {
                    "user_id": "Chayan Mourya",
                    "user_href": "/profile/Chayan-Mourya"
                },
                {
                    "user_id": "Janki Singh",
                    "user_href": "/profile/Janki-Singh-2"
                },
                {
                    "user_id": "Dhanashree Badhe",
                    "user_href": "/profile/Dhanashree-Badhe-1"
                },
                {
                    "user_id": "Ashima",
                    "user_href": "/profile/Ashima-40"
                },
                {
                    "user_id": "Shubham Saini",
                    "user_href": "/profile/Shubham-Saini-6"
                },
                {
                    "user_id": "M A Bintory",
                    "user_href": "/profile/M-A-Bintory"
                },
                {
                    "user_id": "Arunima Bhattacharjee",
                    "user_href": "/profile/Arunima-Bhattacharjee-6"
                },
                {
                    "user_id": "Stuti Agrawal",
                    "user_href": "/profile/Stuti-Agrawal-22"
                },
                {
                    "user_id": "Ranu Jha",
                    "user_href": "/profile/रानू-झा-Ranu-Jha"
                },
                {
                    "user_id": "Himani Gupta",
                    "user_href": "/profile/Himani-Gupta-68"
                },
                {
                    "user_id": "Deepshikha Singh",
                    "user_href": "/profile/Deepshikha-Singh-114"
                },
                {
                    "user_id": "Geetha Jaya",
                    "user_href": "/profile/Geetha-Jaya"
                },
                {
                    "user_id": "Rajdeep Anand",
                    "user_href": "/profile/Rajdeep-Anand-1"
                },
                {
                    "user_id": "Siva Mallajosyula",
                    "user_href": "/profile/Siva-Mallajosyula"
                },
                {
                    "user_id": "Parag Bansal",
                    "user_href": "/profile/Parag-Bansal-1"
                },
                {
                    "user_id": "Shubham Arora",
                    "user_href": "/profile/Shubham-Arora-203"
                },
                {
                    "user_id": "Nancy Parmar",
                    "user_href": "/profile/Nancy-Parmar-5"
                },
                {
                    "user_id": "Vanya Gupta",
                    "user_href": "/profile/Vanya-Gupta-8"
                },
                {
                    "user_id": "Aastha Singh",
                    "user_href": "/profile/Aastha-Singh-199"
                },
                {
                    "user_id": "Satya",
                    "user_href": "/profile/Satya-207"
                },
                {
                    "user_id": "Antariksha Kumar",
                    "user_href": "/profile/Antariksha-Kumar-2"
                },
                {
                    "user_id": "Harsh Mistry",
                    "user_href": "/profile/Harsh-Mistry-56"
                },
                {
                    "user_id": "Rutuja Jadhav",
                    "user_href": "/profile/Rutuja-Jadhav-11"
                },
                {
                    "user_id": "Neha Bisht",
                    "user_href": "/profile/Neha-Bisht-73"
                },
                {
                    "user_id": "Vaishali Chandwani",
                    "user_href": "/profile/Vaishali-Chandwani"
                },
                {
                    "user_id": "Neha Verma",
                    "user_href": "/profile/Neha-Verma-421"
                },
                {
                    "user_id": "Shreya Chotaliya",
                    "user_href": "/profile/Shreya-Chotaliya"
                },
                {
                    "user_id": "Manisha Singh",
                    "user_href": "/profile/Manisha-Singh-532"
                },
                {
                    "user_id": "Vishal Singh",
                    "user_href": "/profile/Vishal-Singh-2268"
                },
                {
                    "user_id": "Anjan S",
                    "user_href": "/profile/Anjan-S-7"
                },
                {
                    "user_id": "Venkatesh Jagannathan",
                    "user_href": "/profile/Venkatesh-Jagannathan"
                },
                {
                    "user_id": "Garima Harsole",
                    "user_href": "/profile/Garima-Harsole"
                },
                {
                    "user_id": "Tanweer",
                    "user_href": "/profile/Tanweer-7"
                },
                {
                    "user_id": "Sushil Gahlot",
                    "user_href": "/profile/Sushil-Gahlot-2"
                },
                {
                    "user_id": "Chitha Ranjan",
                    "user_href": "/profile/Chitha-Ranjan-2"
                },
                {
                    "user_id": "Dhanurshreshtha Karn",
                    "user_href": "/profile/Dhanurshreshtha-Karn-1"
                },
                {
                    "user_id": "Adithya kamath",
                    "user_href": "/profile/Adithya-kamath-8"
                },
                {
                    "user_id": "Rigved Bhashkar",
                    "user_href": "/profile/Rigved-Bhashkar"
                },
                {
                    "user_id": "Prajeeth",
                    "user_href": "/profile/Prajeeth"
                },
                {
                    "user_id": "Biswa Ranjan",
                    "user_href": "/profile/Biswa-Ranjan-20"
                },
                {
                    "user_id": "Deepankar Mandloi",
                    "user_href": "/profile/Deepankar-Mandloi"
                },
                {
                    "user_id": "Parvathi Vijay",
                    "user_href": "/profile/Parvathi-Vijay"
                },
                {
                    "user_id": "Raunak Singh",
                    "user_href": "/profile/Raunak-Singh-129"
                },
                {
                    "user_id": "Chandra Shekhar Pal",
                    "user_href": "/profile/Chandra-Shekhar-Pal-5"
                },
                {
                    "user_id": "Hemant Rai",
                    "user_href": "/profile/Hemant-Rai-9"
                }
            ]
        },
        {
            "author_info": {
                "name": "Dave Crisp",
                "href": "/profile/Dave-Crisp-2"
            },
            "answer_text": "First recognize that this is a feeling. You quite likely cannot be certain you are or aren’t, but if the feeling is there all the time, it is the fact that counts and you need to take some action to fix things because life is painful without feeling love. If you’re in one or more relationships then look at each, decide if this feeling has been going on long term. Decide whether you can talk with (each) person about it. If you it has been long term, can’t be talked about, then try to figure out how to move away from that person permanently. That will give you a time goal for solving that lack and freeing up time to form new relationships in place of the old. If you’re not in a relationship or are planning to move away from old one(s), then take some time to figure out as best you can why the old didn’t provide feelings of love, how new ones might and whether you need to learn or change any behavior of your own that may be getting in the way. That might require some counseling, perhaps from a friend or even professional. But the key thing about planning and taking action is that it by itself starts you on the path to feeling better, starting to believe there are better times ahead and you’re taking positive steps to improve things. Many people delay such steps because they feel it will take too long to make a difference. There are two answers to this - first, if you don’t start, you will never make progress. But more comfortingly, the second is that it almost always takes far less time than you expect and that time will pass quite quickly the more effort and thinking time you put into planning a better future right now. ",
            "date": "Answered October 30, 2019",
            "views": "536",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Craig D. Dugan",
                    "user_href": "/profile/Craig-D-Dugan"
                }
            ]
        },
        {
            "author_info": {
                "name": "Ruchi Vashisht",
                "href": "/profile/Ruchi-Vashisht-1"
            },
            "answer_text": "Firstly, I sit back, relax my mind and think about the reason of this feeling. If it is because of someone else like less attention from husband or family then I calmly and gently remind myself of the theory which I preach that we should not be dependent on someone else for happiness or love. Its our own duty to make our life loved and fulfilled. No one is responsible to keep us happy ALL THE TIME. It is such an unrealistic expectations.Sometimes it is because of me like not spending enough alone time, or doing way too much for the family or loved ones and not getting enough appreciation in return. Then I jot down mentally all the big or small things which are leading to all the negative thoughts in my mind. It can be due to husband not doing any particular thing in the way I want him to do, or maid not doing her job properly. And then I let go of the control which I feel I have over these things or others. I let them free and be the way they want to be. I let go of any behavioral expectations I have from others. This single step can stop lot of negative feelings from getting generated. Next, I focus on doing things which gives me peace, calmness, happiness like reading a good book, writing a gratitude journal, cooking one of my favorite things, or just sleeping for some time. There are so many such small things which bring me back on track. I spend some time thinking good thoughts about future, thinking about excelling in my career or having a beautiful home of our own. Positive visualization of future creates lots of excitement and happiness and I automatically tend to work towards achieving these things instead of wasting my time on thinking who loves me less and why. ",
            "date": "Answered August 10, 2020",
            "views": "262",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Cathy Thorsen",
                "href": "/profile/Cathy-Thorsen"
            },
            "answer_text": "Questioning my thoughts did it for me, a la Byron Katie and also Access Consciousness. I don't think there is usually anyone who tells us we are unlovable. We just get an idea of what love looks like, and when we don't see that coming from anyone in our lives, we conclude that we are unlovable. Or it may be based on judgments that are so prevalent in pretty much any society, or even on media which tells us certain things about us are unacceptable. By the way, there is no feeling that can be labeled \"unlovable\". We basically feel sad or despairing or hopeless in response to the thought that we are unlovable. I remember observing one day that I believed I was unloved and unlovable, even while surrounded by people who would literally die for me. Therefore, it couldn't be true. The error must had to be in my perception. Now, I know that all the love I will ever feel is already here, inside my heart. I don't have to wait for someone else to demonstrate love to feel it. I can feel it any time I choose. This can take practice if you're used to only feeling love when some outside action stirs the awareness of love within you. Sometimes, it helps to begin with a memory of feeling love, and recreate that memory until you're in touch with the feeling. But whatever you do, know that the fact that you care at all is evidence of your lovability. In fact, that you exist at all is evidence of the same. Love is not something to earn, but something to receive. ",
            "date": "Answered June 4, 2013",
            "views": "29",
            "upvotes": " View 6 Upvoters",
            "upvoters": [
                {
                    "user_id": "William Allan Shearer",
                    "user_href": "/profile/William-Allan-Shearer"
                },
                {
                    "user_id": "Craig D. Dugan",
                    "user_href": "/profile/Craig-D-Dugan"
                },
                {
                    "user_id": "Sarah Young",
                    "user_href": "/profile/Sarah-Young-557"
                },
                {
                    "user_id": "Virginia Clark",
                    "user_href": "/profile/Virginia-Clark-13"
                },
                {
                    "user_id": "Dowon Lee",
                    "user_href": "/profile/Dowon-Lee-2"
                },
                {
                    "user_id": "David de la Fuente",
                    "user_href": "/profile/David-de-la-Fuente"
                }
            ]
        },
        {
            "author_info": {
                "name": "Rico Port",
                "href": "/profile/Rico-Port-1"
            },
            "answer_text": "First, you must ask yourself why you consider yourself to be unlovable. Although I may not know your circumstances, I do know that you are a wonderful, beautiful, unique human being who deserves to be loved and respected. For me personally, whenever I may find myself thinking in this sort of way, I am reminded of my faith in Jesus; and how much he loves and cares for me even though the world may not. We should not cope, we should overcome. Let me tell you something that you may have not heard before: You can overcome anything, and you are in control of your life, your destiny is in your own hands. You are not unlovable, maybe you may not feel loved now, maybe from your family, friends, or by the world, but that shouldn’t stop you from finding those who love you for who you are. When I didn’t feel loved by my friends, I eventually decided that I wasn’t going to allow their negativity towards me to affect my happiness, so I moved on and found new ones. Now that I have friends that truly love and care for me, I’ve never felt so alive. I don’t want you to think that this was just a happy story for another persons happy ending. No. You can make your own happy ending, and while I am a man of faith, I recognize that my destiny is in my own hands on this earth. Either I could have chosen to remain complacent and abused by my “friends” and the world, or I could roll up my sleeves and make my own happiness. Whenever you may find yourself thinking you are unable to achieve what you want in life, or that you can’t do something, remember this quote, “Yesterday is history, tomorrow is a mystery, but today is a gift. That is why it is called the present.” - A wise man. Please, I don’t want you to think you are unlovable, every human being has lovable aspects about themselves. If you find yourself isolated from the world around you, keep in mind that it is impossible to fit in when you where born to stand out. If you may find yourself unable to connect with others solely because you are unique, remember that there are millions of others who sing the same song. And trust me, you’ll know when you find those people that were eager to meet someone who understands them. Remind yourself not to lose hope, and that there are 7 billion people on this planet, all with their own complex fears, desires, philosophies, and motivations throughout this lifetime. Try not to think that you will never meet someone who would ever be able to love you or understand you, every human is broken in some way, in nature, we are all inevitably fallible. Try not to allow bad relationships in your past define your future relationships with others. If you may find yourself blinded by your own future, or not sure of what you may want or can do, take the Enneagram and Myers Briggs evaluations to aid you in discovering what may come naturally to you as a potential career path. Introspection and meditation helps with finding your passions by evaluating previous experiences and an evaluation of your personality to provide potential insight for your future. If you may find yourself prisoner to these type of thoughts, and find it affecting your overall perception on life, your mood, appetite, and overall well being, please, do not hesitate to seek help from a professional who’s top priority is to put you into a position to become the best and happiest version of yourself possible. When I found myself at my lowest, I decided that I could either wallow in my own self pity and unhappiness, or I could take control of my life and admit that I needed help for my crushing anxiety. My therapist taught me how to keep myself in the present moment, face my fears, maintain a positive attitude, and live life courageously and with purpose. You are not unlovable. You are worthy of love. You are beautiful. You are unique. You are strong. You are intelligent. You are not a quitter, you are a dreamer. You’ll never be regular, you’re spectacular. Final question, how many times do you get to live life? Twice? Three times? Five times? Nope, you guessed it, once. So live life every day courageously, and remind yourself that life is too short to spend it fearfully, or unhappily, remind yourself that you CAN. And that you can find happiness in this world, one way or the other, you can. Life is a gift, you can laugh, cry, create, destroy, think, experience, learn, and most importantly love. Please remember, you are loved. ",
            "date": "Answered September 6, 2019",
            "views": "548",
            "upvotes": " View 6 Upvoters",
            "upvoters": [
                {
                    "user_id": "Camille Gilissen",
                    "user_href": "/profile/Camille-Gilissen"
                },
                {
                    "user_id": "Lauza Lashes",
                    "user_href": "/profile/Lauza-Lashes"
                },
                {
                    "user_id": "James Bryce",
                    "user_href": "/profile/James-Bryce-25"
                },
                {
                    "user_id": "Cicely Jefferson",
                    "user_href": "/profile/Cicely-Jefferson"
                },
                {
                    "user_id": "Ashlyn Barnard",
                    "user_href": "/profile/Ashlyn-Barnard"
                },
                {
                    "user_id": "Denise Serafin",
                    "user_href": "/profile/Denise-Serafin"
                }
            ]
        },
        {
            "author_info": {
                "name": "Koonani Chockalingam Muralidhar",
                "href": "/profile/Koonani-Chockalingam-Muralidhar"
            },
            "answer_text": "Hi Swati, tough question indeed. The fact that love and affection involved in any type of relationship- personal, friendship, family- get expressed mainly through feelings and emotions makes it a bit difficult to deal with.Though the role of intelligence has always been minimal in those tight situations involving relationship, it is necessary to understand the significant role it can play when properly employed. Take a deep breath and think about it. Try to identify your priorities in your love life. What is it you loved/wanted/longed to do/feel/experience always but couldn't and didn’t. Locate and list it in a proper order. Look for possibilities and opportunities to get your top priorities active. Accept responsibility for your choices/rejections and get ready to enjoy or suffer in the process. Dive deep. A word about love and being loved. It is always complicated… shackles made of gold makes no difference. We know that people generally fall short of expectations. But if you choose to attach a tag of genuinity to your love then the next best thing you can do is to ignore the faults of your beloved and be realistic. Best. ",
            "date": "Answered December 4, 2018",
            "views": "147",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Jayasree Padmanabhan",
                "href": "/profile/Jayasree-Padmanabhan-2"
            },
            "answer_text": "The first thing here is to start loving yourself. Only if you love yourself, you can love others. Observe yourself, away from emotions. What is the thing that makes you feel you are unlovable? Your career? Your negativity fostering friends? Your toxic office environment? Or some behaviors you have take up in the journey of life? Find it. Start working on it. Discard it, change it or transform it. Now after this start talking to yourself (looking at your eyes in the mirror if you feel like), how beautiful, gorgeous and talented you are. Keep at it. After a few months, your mind will say back to you, the exact words you repeated. There! Now you are totally in love with yourself! Now go and get some other beautiful souls to surround yourself with. All the very best! Regards, Swaroopa Blog. ",
            "date": "Answered May 13, 2018",
            "views": "519",
            "upvotes": " View 4 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Mary Müller",
                    "user_href": "/profile/Mary-Müller-6"
                },
                {
                    "user_id": "Elena RObertson",
                    "user_href": "/profile/Elena-RObertson-7"
                },
                {
                    "user_id": "Ying Kuklos",
                    "user_href": "/profile/Ying-Kuklos"
                },
                {
                    "user_id": "Ram K",
                    "user_href": "/profile/Ram-K-104"
                }
            ]
        },
        {
            "author_info": {
                "name": "Marie Ring",
                "href": "/profile/Marie-Ring-5"
            },
            "answer_text": "Transmute feeling unloved by OTHERS into finding more ways to love YOURSELF. When you have love for your self (and I do not mean being selfish, that is different) no one can injure you in that way. That is the short answer. The long answer is, that feeling of being unloved (romantic or otherwise) is due to your own thought filter. You have placed intrinsic value upon that feeling. Feeling loved is good; feeling unloved is bad. Somewhere along the way (and many of our paths) we have been told that feeling unloved is an external force that is unpleasant. What I can say is, there are likely MANY people who love you and it just isn’t verbalized as much as you would like to hear. If there is someway that you can change your perspective on that thought filter, you will see improvements on that. That is the reason many people will tell you to look within for that unconditional love. Seeking it from external sources will often lead us to a dry watering hole. “Teach a man to fish” kind of thought process involved in deeper thinking about love. Love is spiritual; it is internal before it can become external. If you do not love yourself, how can others love you if the energy you are emitting - the lower frequency of negative emotions - is covering that beautiful person underneath. It’s not the cycle - it’s the filter you place on it. Here is the quote that inspired me to learn to transmute some of my own inner-dialog: “If you are distressed by anything external, the pain is not due to the thing itself, but to your estimate of it; and this you have the power to revoke at any moment.” ~ Marcus Aurelius I hope this helps you. ♥ ",
            "date": "Answered October 30, 2019",
            "views": "270",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Topher Burns",
                "href": "/profile/Topher-Burns-2"
            },
            "answer_text": "I found myself staring at this question for sometime. Love can be a rare feeling to share with someone else, and feeling love for yourself tends to be a greater challenge these days. Loneliness is a battle for a good amount of people. After all, when we are fully conscious arguments in our head are found to be two sides of the same coin. Love has more depth than words can describe for some people. And the urge to be desired by another person is a natural human feeling. It is truly unfortunate that in its place we use addiction and anger to fill the void created by the lack. I suppose the best advice I can give is to create and grow socially, while at the same time working on increasing your self love. Go out of your way to say yes to friends when asked to go out. Find new people to talk with by doing new things on a regular basis. Things like meetup, or weekly events, are a great place to start as long as there is a common crowd to get over the uncomfortable hump of stranger status. By reaching out and getting involved with those around you, it should give you more of a sense of togetherness. Even if you don't like crowds, make it a point to go. Look for opportunities for new conversations. Personally, I don't believe you should be looking for a way to 'get over' the feeling. Instead, focus on fixing the situation and find the belief that you can do such a thing for yourself. I wish you the best of luck, and I hope you find that feeling you crave. Best wishes, Topher ",
            "date": "Answered October 25, 2016",
            "views": "709",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "William Allan Shearer",
                    "user_href": "/profile/William-Allan-Shearer"
                },
                {
                    "user_id": "Maome K Muller",
                    "user_href": "/profile/Maome-K-Muller"
                }
            ]
        },
        {
            "author_info": {
                "name": "Marvin Glover",
                "href": "/profile/Marvin-Glover"
            },
            "answer_text": "The way you cope with being unlovable is the way Hellen Keller coped with being born deaf, dumb and blind. You find your purpose. You take refuge in having a purpose. Nothing is more attractive than someone with a purpose. Do not lose your purpose once people start noticing you and start to be attracted to you. If you do you'll be back where you started. Stick to your purpose and let it attract people who like you are sheltered by it and take refuge in it. Do not confuse their attraction to your purpose with their attraction to you. Never-the-less they will be attracted to you as a channel to the higher purpose. The highest purpose is to be Enlightened. Other high purposes are to know God and to save the world. The path to these high purposes begins with the introductory purpose to exercise all you talents and abilities so as to make yourself a complete instrument of the highest purpose. ",
            "date": "Answered March 17, 2017",
            "views": "17",
            "upvotes": " View 10 Upvoters ",
            "upvoters": [
                {
                    "user_id": "LR",
                    "user_href": "/profile/LR-80"
                },
                {
                    "user_id": "David King",
                    "user_href": "/profile/David-King-197"
                },
                {
                    "user_id": "Ashlyn Barnard",
                    "user_href": "/profile/Ashlyn-Barnard"
                },
                {
                    "user_id": "Ramnik Kaur",
                    "user_href": "/profile/Ramnik-Kaur-8"
                },
                {
                    "user_id": "Lynne Henry",
                    "user_href": "/profile/Lynne-Henry"
                },
                {
                    "user_id": "Destiny Springer",
                    "user_href": "/profile/Destiny-Springer-2"
                },
                {
                    "user_id": "Karin Seager Cockram",
                    "user_href": "/profile/Karin-Seager-Cockram"
                },
                {
                    "user_id": "Karthee Karths",
                    "user_href": "/profile/Karthee-Karths"
                },
                {
                    "user_id": "Troy Mason",
                    "user_href": "/profile/Troy-Mason-5"
                },
                {
                    "user_id": "Shankey Ahirwar",
                    "user_href": "/profile/Shankey-Ahirwar"
                }
            ]
        },
        {
            "author_info": {
                "name": "Dushka Zapata",
                "href": "/profile/Dushka-Zapata"
            },
            "answer_text": "If a parent is always comparing you to a sibling or a cousin neither your parent nor the comparison is a measure of your worth. If a teacher blurts out you will never amount to much your teacher is not a measure of your worth. If your friends declare you are not cool enough to hang out with them their assessment is not a measure of your worth. If a boss tells you your work is not good this is not the measure of your worth (even if your work is not good.) If a significant other or a lover doesn’t want you anymore their departure is not a measure of your worth. If your spouse seems endowed with magical insight and says anything that sounds like foreshadowing her fear is not the measure of your worth. You, just by virtue of being you, of being human, are in possession of inherent worth. So, let me take it a step further. If you are certain you are worthless not even you are a measure of your worth. ",
            "date": "Updated October 7, 2020",
            "views": "42",
            "upvotes": " View 199 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Jenn Evans",
                    "user_href": "/profile/Jenn-Evans-25"
                },
                {
                    "user_id": "En Dul",
                    "user_href": "/profile/En-Dul"
                },
                {
                    "user_id": "Sushma",
                    "user_href": "/profile/Sushma-154"
                },
                {
                    "user_id": "Alexander Skow",
                    "user_href": "/profile/Alexander-Skow"
                },
                {
                    "user_id": "Eliza Shiffman",
                    "user_href": "/profile/Eliza-Shiffman"
                },
                {
                    "user_id": "Andrea Mercadante",
                    "user_href": "/profile/Andrea-Mercadante"
                },
                {
                    "user_id": "Lindac Chen",
                    "user_href": "/profile/Lindac-Chen"
                },
                {
                    "user_id": "Kimothy Wu",
                    "user_href": "/profile/Kimothy-Wu-1"
                },
                {
                    "user_id": "Rain Snow",
                    "user_href": "/profile/Rain-Snow"
                },
                {
                    "user_id": "Madangi",
                    "user_href": "/profile/Madangi"
                },
                {
                    "user_id": "Judith Hoth",
                    "user_href": "/profile/Judith-Hoth"
                },
                {
                    "user_id": "Bijou Celeste",
                    "user_href": "/profile/Bijou-Celeste-1"
                },
                {
                    "user_id": "Janani Venugopalan",
                    "user_href": "/profile/Janani-Venugopalan-2"
                },
                {
                    "user_id": "Arun",
                    "user_href": "/profile/Arun-1739"
                },
                {
                    "user_id": "Chaitanya Chekuri",
                    "user_href": "/profile/Chaitanya-Chekuri"
                },
                {
                    "user_id": "Aroojfatima Tariq",
                    "user_href": "/profile/Aroojfatima-Tariq"
                },
                {
                    "user_id": "Reyes Aguilar",
                    "user_href": "/profile/Reyes-Aguilar-3"
                },
                {
                    "user_id": "Ally Thomas",
                    "user_href": "/profile/Ally-Thomas-42"
                },
                {
                    "user_id": "Roxie Siding",
                    "user_href": "/profile/Roxie-Siding"
                },
                {
                    "user_id": "Carmen Alcaniz",
                    "user_href": "/profile/Carmen-Alcaniz"
                },
                {
                    "user_id": " Harshitha",
                    "user_href": "/profile/Harshitha-261"
                },
                {
                    "user_id": "Lucy Linh",
                    "user_href": "/profile/Lucy-Linh"
                },
                {
                    "user_id": "Cait Mals",
                    "user_href": "/profile/Cait-Mals"
                },
                {
                    "user_id": "Mahesh Sagar",
                    "user_href": "/profile/Mahesh-Sagar-48"
                },
                {
                    "user_id": "Ashley Ow",
                    "user_href": "/profile/Ashley-Ow-1"
                },
                {
                    "user_id": "Suncica N",
                    "user_href": "/profile/Suncica-N"
                },
                {
                    "user_id": "Ida Wibber",
                    "user_href": "/profile/Ida-Wibber-1"
                },
                {
                    "user_id": "Lina Wilson",
                    "user_href": "/profile/Lina-Wilson-11"
                },
                {
                    "user_id": "Juwairia I",
                    "user_href": "/profile/Juwairia-I"
                },
                {
                    "user_id": "Nisha Shafi",
                    "user_href": "/profile/Nisha-Shafi-2"
                },
                {
                    "user_id": "Tejaswi Kamble",
                    "user_href": "/profile/तेजस्वी-कांबळे-Tejaswi-Kamble"
                },
                {
                    "user_id": "Fahi",
                    "user_href": "/profile/Fahi-4"
                },
                {
                    "user_id": "Rochi Zalani",
                    "user_href": "/profile/Rochi-Zalani"
                },
                {
                    "user_id": "Basia Oughton",
                    "user_href": "/profile/Basia-Oughton"
                },
                {
                    "user_id": "Venkat Ponnada",
                    "user_href": "/profile/Venkat-Ponnada-2"
                },
                {
                    "user_id": "Shuchi Bhardwaj",
                    "user_href": "/profile/Shuchi-Bhardwaj-3"
                },
                {
                    "user_id": "Blanka Lichtnerová",
                    "user_href": "/profile/Blanka-Lichtnerová"
                },
                {
                    "user_id": "Be Happy",
                    "user_href": "/profile/Be-Happy-575"
                },
                {
                    "user_id": "Ramalakshmi Pendyala",
                    "user_href": "/profile/Ramalakshmi-Pendyala"
                },
                {
                    "user_id": "Swathi Suresh",
                    "user_href": "/profile/Swathi-Suresh-12"
                },
                {
                    "user_id": "Stella Tsautse",
                    "user_href": "/profile/Stella-Tsautse"
                },
                {
                    "user_id": "Suryakant Sahu",
                    "user_href": "/profile/Suryakant-Sahu-31"
                },
                {
                    "user_id": "Harsh Sharma",
                    "user_href": "/profile/Harsh-Sharma-121"
                },
                {
                    "user_id": "Audrey Pugach",
                    "user_href": "/profile/Audrey-Pugach"
                },
                {
                    "user_id": "Becky Hall",
                    "user_href": "/profile/Becky-Hall-194"
                },
                {
                    "user_id": "Amanda Lane",
                    "user_href": "/profile/Amanda-Lane-67"
                },
                {
                    "user_id": "Aarathi Ann",
                    "user_href": "/profile/Aarathi-Ann"
                },
                {
                    "user_id": "Lalitha Kancherla",
                    "user_href": "/profile/Lalitha-Kancherla"
                },
                {
                    "user_id": "Anandika Gupta",
                    "user_href": "/profile/Anandika-Gupta"
                },
                {
                    "user_id": "Sravasti Guha Thakurta",
                    "user_href": "/profile/Sravasti-Guha-Thakurta"
                },
                {
                    "user_id": "Abirami Ramalingam",
                    "user_href": "/profile/Abirami-Ramalingam-4"
                },
                {
                    "user_id": "Ritu Vrijender",
                    "user_href": "/profile/Ritu-Vrijender"
                },
                {
                    "user_id": "Erika Wieder",
                    "user_href": "/profile/Erika-Wieder"
                },
                {
                    "user_id": "Stella de Haan",
                    "user_href": "/profile/Stella-de-Haan"
                },
                {
                    "user_id": "Subhashish Borah",
                    "user_href": "/profile/Subhashish-Borah"
                },
                {
                    "user_id": "Amisha Singh",
                    "user_href": "/profile/Amisha-Singh-597"
                },
                {
                    "user_id": "Kabiru Salami",
                    "user_href": "/profile/Kabiru-Salami"
                },
                {
                    "user_id": "Pri",
                    "user_href": "/profile/Pri-139"
                },
                {
                    "user_id": "Anwesha",
                    "user_href": "/profile/Anwesha-16"
                },
                {
                    "user_id": "Archana Sharma",
                    "user_href": "/profile/Archana-Sharma-826"
                },
                {
                    "user_id": "Anand Shekhar Singh",
                    "user_href": "/profile/Anand-Shekhar-Singh-1"
                },
                {
                    "user_id": "Sanket Suman Dash",
                    "user_href": "/profile/Sanket-Suman-Dash"
                },
                {
                    "user_id": "Tapati Chakravorty",
                    "user_href": "/profile/Tapati-Chakravorty"
                },
                {
                    "user_id": "Stephen Sholtas",
                    "user_href": "/profile/Stephen-Sholtas"
                },
                {
                    "user_id": "Tina Magondo",
                    "user_href": "/profile/Tina-Magondo"
                },
                {
                    "user_id": "Shawna Wood",
                    "user_href": "/profile/Shawna-Wood-28"
                },
                {
                    "user_id": "Hiruni Perera",
                    "user_href": "/profile/Hiruni-Perera-24"
                },
                {
                    "user_id": "Aishwarya",
                    "user_href": "/profile/Aishwarya-364"
                },
                {
                    "user_id": "Sergiu Topan",
                    "user_href": "/profile/Sergiu-Topan"
                },
                {
                    "user_id": "Poorva Rn",
                    "user_href": "/profile/Poorva-Rn"
                },
                {
                    "user_id": "Wanda DSouza",
                    "user_href": "/profile/Wanda-DSouza-1"
                },
                {
                    "user_id": "Vinaya Bhat",
                    "user_href": "/profile/Vinaya-Bhat-3"
                },
                {
                    "user_id": "Ameena Shekh",
                    "user_href": "/profile/Ameena-Shekh"
                },
                {
                    "user_id": "Rimsha",
                    "user_href": "/profile/Rimsha-29"
                },
                {
                    "user_id": "Sally Alter",
                    "user_href": "/profile/Sally-Alter"
                },
                {
                    "user_id": "Adarsh Jha",
                    "user_href": "/profile/Adarsh-Jha-43"
                },
                {
                    "user_id": "Mishal Baranwal",
                    "user_href": "/profile/Mishal-Baranwal"
                },
                {
                    "user_id": "Shivangi Gautam",
                    "user_href": "/profile/Shivangi-Gautam-44"
                },
                {
                    "user_id": "Carrie Harris",
                    "user_href": "/profile/Carrie-Harris-16"
                },
                {
                    "user_id": "Laarni Tadeo",
                    "user_href": "/profile/Laarni-Tadeo"
                },
                {
                    "user_id": "Ashok Kumar",
                    "user_href": "/profile/Ashok-Kumar-1778"
                },
                {
                    "user_id": "Samiksha Srivastava",
                    "user_href": "/profile/Samiksha-Srivastava-7"
                },
                {
                    "user_id": "Greg Read",
                    "user_href": "/profile/Greg-Read-4"
                },
                {
                    "user_id": "Lyz Anne Hampton",
                    "user_href": "/profile/Lyz-Anne-Hampton"
                },
                {
                    "user_id": "Muskan Varshney",
                    "user_href": "/profile/Muskan-Varshney-16"
                },
                {
                    "user_id": "Xiaojun Dai",
                    "user_href": "/profile/Xiaojun-Dai-2"
                },
                {
                    "user_id": "Atish Jaientilal",
                    "user_href": "/profile/Atish-Jaientilal"
                },
                {
                    "user_id": "Anjali Mishra",
                    "user_href": "/profile/Anjali-Mishra-585"
                },
                {
                    "user_id": "Golu Ujjain",
                    "user_href": "/profile/Golu-Ujjain"
                },
                {
                    "user_id": "Lopita Banerjee",
                    "user_href": "/profile/Lopita-Banerjee"
                },
                {
                    "user_id": "Ngoc Anh Le",
                    "user_href": "/profile/Ngoc-Anh-Le-12"
                },
                {
                    "user_id": "Shreyas",
                    "user_href": "/profile/Shreyas-146"
                },
                {
                    "user_id": "Aditi Chanda",
                    "user_href": "/profile/Aditi-Chanda"
                },
                {
                    "user_id": "Valentine Kaka Okeke",
                    "user_href": "/profile/Valentine-Kaka-Okeke"
                },
                {
                    "user_id": "Viraj Ramaiya",
                    "user_href": "/profile/Viraj-Ramaiya"
                },
                {
                    "user_id": "Shrutika Pathak",
                    "user_href": "/profile/Shrutika-Pathak"
                },
                {
                    "user_id": "Vanessa Popova",
                    "user_href": "/profile/Vanessa-Popova"
                },
                {
                    "user_id": "Rashmi Jha",
                    "user_href": "/profile/Rashmi-Jha-278"
                },
                {
                    "user_id": "Serena Keyeoh",
                    "user_href": "/profile/Serena-Keyeoh"
                },
                {
                    "user_id": "Arpit Ghosh",
                    "user_href": "/profile/Arpit-Ghosh-7"
                },
                {
                    "user_id": "Pippa Evans",
                    "user_href": "/profile/Pippa-Evans-11"
                },
                {
                    "user_id": "Aashima Sharma",
                    "user_href": "/profile/Aashima-Sharma-54"
                },
                {
                    "user_id": "Pranav Malhotra",
                    "user_href": "/profile/Pranav-Malhotra-3"
                },
                {
                    "user_id": "Sakshi Arora",
                    "user_href": "/profile/Sakshi-Arora-33"
                },
                {
                    "user_id": "Shweta Kashyap",
                    "user_href": "/profile/Shweta-Kashyap-58"
                },
                {
                    "user_id": "Swati Bhattacharya",
                    "user_href": "/profile/Swati-Bhattacharya-1"
                },
                {
                    "user_id": "Neha Deshmukh",
                    "user_href": "/profile/Neha-Deshmukh-79"
                },
                {
                    "user_id": "Sherin Santosh",
                    "user_href": "/profile/Sherin-Santosh-2"
                },
                {
                    "user_id": "Sundeep Arumalla",
                    "user_href": "/profile/Sundeep-Arumalla"
                },
                {
                    "user_id": "Mitali Acharya",
                    "user_href": "/profile/Mitali-Acharya-2"
                },
                {
                    "user_id": "Prem Sharma",
                    "user_href": "/profile/Prem-Sharma-968"
                },
                {
                    "user_id": "Gregorio Juliet",
                    "user_href": "/profile/Gregorio-Juliet"
                },
                {
                    "user_id": "Monika Yadav",
                    "user_href": "/profile/Monika-Yadav-939"
                },
                {
                    "user_id": "Khushi Shah",
                    "user_href": "/profile/Khushi-Shah-594"
                },
                {
                    "user_id": "Shubhrata Yadav",
                    "user_href": "/profile/Shubhrata-Yadav-1"
                },
                {
                    "user_id": "Ramya Annadurai",
                    "user_href": "/profile/Ramya-Annadurai-3"
                },
                {
                    "user_id": "Samatha Gowrisetti",
                    "user_href": "/profile/Samatha-Gowrisetti"
                },
                {
                    "user_id": "Clairessa Brown",
                    "user_href": "/profile/Clairessa-Brown-1"
                },
                {
                    "user_id": "Paola Espejo",
                    "user_href": "/profile/Paola-Espejo"
                },
                {
                    "user_id": "Akash Khond",
                    "user_href": "/profile/Akash-Khond"
                },
                {
                    "user_id": "Vidit Lakhotia",
                    "user_href": "/profile/Vidit-Lakhotia"
                },
                {
                    "user_id": "Aditi Khedkar",
                    "user_href": "/profile/Aditi-Khedkar-1"
                },
                {
                    "user_id": "Yomna Kamel",
                    "user_href": "/profile/Yomna-Kamel-7"
                },
                {
                    "user_id": "Siddhartha Pundit",
                    "user_href": "/profile/Siddhartha-Pundit"
                },
                {
                    "user_id": "Shibasish Gupta",
                    "user_href": "/profile/Shibasish-Gupta"
                },
                {
                    "user_id": "Bhavya Saxena",
                    "user_href": "/profile/Bhavya-Saxena-13"
                },
                {
                    "user_id": "SudharaniTPR",
                    "user_href": "/profile/SudharaniTPR-1"
                },
                {
                    "user_id": "Manish Bodra",
                    "user_href": "/profile/Manish-Bodra"
                },
                {
                    "user_id": "Hannah Frome",
                    "user_href": "/profile/Hannah-Frome"
                },
                {
                    "user_id": "Nisha Jhajhria",
                    "user_href": "/profile/Nisha-Jhajhria"
                },
                {
                    "user_id": "Zeshalyn Capindo",
                    "user_href": "/profile/Zeshalyn-Capindo"
                },
                {
                    "user_id": "Hyo Jin Kim",
                    "user_href": "/profile/Hyo-Jin-Kim-11"
                },
                {
                    "user_id": "Tam Bui",
                    "user_href": "/profile/Tam-Bui-65"
                },
                {
                    "user_id": "Sreeraksha P.S",
                    "user_href": "/profile/Sreeraksha-P-S"
                },
                {
                    "user_id": "Dhruvin Rathod",
                    "user_href": "/profile/Dhruvin-Rathod"
                },
                {
                    "user_id": "Jeff Sturm",
                    "user_href": "/profile/Jeff-Sturm-2"
                },
                {
                    "user_id": "Akshay Jain",
                    "user_href": "/profile/Akshay-Jain-626"
                },
                {
                    "user_id": "Sarah Samaroo",
                    "user_href": "/profile/Sarah-Samaroo-2"
                },
                {
                    "user_id": "Emily Ng",
                    "user_href": "/profile/Emily-Ng-22"
                },
                {
                    "user_id": "Andrew Houston Vaughan",
                    "user_href": "/profile/Andrew-Houston-Vaughan"
                },
                {
                    "user_id": "Melissa Trenary",
                    "user_href": "/profile/Melissa-Trenary"
                },
                {
                    "user_id": "Keldon Alleyne",
                    "user_href": "/profile/Keldon-Alleyne-1"
                },
                {
                    "user_id": "Kiru Ravi",
                    "user_href": "/profile/Kiru-Ravi-1"
                },
                {
                    "user_id": "Ash Driscoll",
                    "user_href": "/profile/Ash-Driscoll-1"
                },
                {
                    "user_id": "Hema Gos",
                    "user_href": "/profile/Hema-Gos"
                },
                {
                    "user_id": "Shaique Khan",
                    "user_href": "/profile/Shaique-Khan-5"
                },
                {
                    "user_id": "Beverly Cox",
                    "user_href": "/profile/Beverly-Cox-13"
                },
                {
                    "user_id": "Edmond Liew",
                    "user_href": "/profile/Edmond-Liew-1"
                },
                {
                    "user_id": "Hanna Gee",
                    "user_href": "/profile/Hanna-Gee"
                },
                {
                    "user_id": "Srinivas Adapa",
                    "user_href": "/profile/Srinivas-Adapa-4"
                },
                {
                    "user_id": "Krishna Prasad",
                    "user_href": "/profile/Krishna-Prasad-281"
                },
                {
                    "user_id": "Steve Yurka",
                    "user_href": "/profile/Steve-Yurka-1"
                },
                {
                    "user_id": "Gabby O'Connor",
                    "user_href": "/profile/Gabby-OConnor"
                },
                {
                    "user_id": "Arushi Arora",
                    "user_href": "/profile/Arushi-Arora-33"
                },
                {
                    "user_id": "Jordan Yates",
                    "user_href": "/profile/Jordan-Yates-4"
                },
                {
                    "user_id": "Nayana Bhat",
                    "user_href": "/profile/Nayana-Bhat-3"
                },
                {
                    "user_id": "Bindi Shakya",
                    "user_href": "/profile/Bindi-Shakya"
                },
                {
                    "user_id": "Diana Macedo",
                    "user_href": "/profile/Diana-Macedo"
                },
                {
                    "user_id": "Naturepreet Benipal",
                    "user_href": "/profile/Naturepreet-Benipal"
                },
                {
                    "user_id": "Alex Rupp-Coppi",
                    "user_href": "/profile/Alex-Rupp-Coppi"
                },
                {
                    "user_id": "Mary Müller",
                    "user_href": "/profile/Mary-Müller-6"
                },
                {
                    "user_id": "Pooja Nagaraj",
                    "user_href": "/profile/Pooja-Nagaraj-2"
                },
                {
                    "user_id": "Kathy Kang",
                    "user_href": "/profile/Kathy-Kang-9"
                },
                {
                    "user_id": "Daniel Ngenegbo",
                    "user_href": "/profile/Daniel-Ngenegbo"
                },
                {
                    "user_id": "Doruntina Azemi",
                    "user_href": "/profile/Doruntina-Azemi"
                },
                {
                    "user_id": "Amelia Klinger",
                    "user_href": "/profile/Amelia-Klinger"
                },
                {
                    "user_id": "Silvia R",
                    "user_href": "/profile/Silvia-R-9"
                },
                {
                    "user_id": "Donald Upton",
                    "user_href": "/profile/Donald-Upton-1"
                },
                {
                    "user_id": "Paul Ryberg",
                    "user_href": "/profile/Paul-Ryberg"
                },
                {
                    "user_id": "Adam Brian Raynes",
                    "user_href": "/profile/Adam-Brian-Raynes"
                },
                {
                    "user_id": "Kamali Mohan",
                    "user_href": "/profile/Kamali-Mohan-1"
                },
                {
                    "user_id": "Kinjal",
                    "user_href": "/profile/Kinjal-23"
                },
                {
                    "user_id": "Aarti",
                    "user_href": "/profile/Aarti-433"
                },
                {
                    "user_id": "Greg Burns",
                    "user_href": "/profile/Greg-Burns-5"
                },
                {
                    "user_id": "Alyssa Shick",
                    "user_href": "/profile/Alyssa-Shick-1"
                },
                {
                    "user_id": "Kelly Schweighsr",
                    "user_href": "/profile/Kelly-Schweighsr"
                },
                {
                    "user_id": "Nandarani Abril",
                    "user_href": "/profile/Nandarani-Abril-1"
                },
                {
                    "user_id": "Ankita Sinha",
                    "user_href": "/profile/Ankita-Sinha-517"
                },
                {
                    "user_id": "Lidia Raquel",
                    "user_href": "/profile/Lidia-Raquel-2"
                },
                {
                    "user_id": "Kristina Lee",
                    "user_href": "/profile/Kristina-Lee-24"
                },
                {
                    "user_id": "Swarajya Singh",
                    "user_href": "/profile/Swarajya-Singh-1"
                },
                {
                    "user_id": "Amani",
                    "user_href": "/profile/Amani-61"
                },
                {
                    "user_id": "Amrita Mukhopadhyay",
                    "user_href": "/profile/Amrita-Mukhopadhyay-1"
                },
                {
                    "user_id": "George Ramos",
                    "user_href": "/profile/George-Ramos-1"
                },
                {
                    "user_id": "Susan Williams",
                    "user_href": "/profile/Susan-Williams-794"
                },
                {
                    "user_id": "Shreya S",
                    "user_href": "/profile/Shreya-S-83"
                },
                {
                    "user_id": "Gayathri S",
                    "user_href": "/profile/Gayathri-S-193"
                },
                {
                    "user_id": "Bittu Sharma",
                    "user_href": "/profile/Bittu-Sharma-513"
                },
                {
                    "user_id": "Martín Martínez",
                    "user_href": "/profile/Martín-Martínez-9-1"
                },
                {
                    "user_id": "Debaraty Chakraborty",
                    "user_href": "/profile/Debaraty-Chakraborty"
                },
                {
                    "user_id": "Ashley Wilkinson",
                    "user_href": "/profile/Ashley-Wilkinson-14"
                },
                {
                    "user_id": "Dina Peltz",
                    "user_href": "/profile/Dina-Peltz"
                },
                {
                    "user_id": "Charlotte April",
                    "user_href": "/profile/Charlotte-April-2"
                },
                {
                    "user_id": "Siddhesh Kadam ( सिध्देश कदम)",
                    "user_href": "/profile/Siddhesh-Kadam-सिध्देश-कदम"
                },
                {
                    "user_id": "Adriano Santos",
                    "user_href": "/profile/Adriano-Santos-6"
                },
                {
                    "user_id": "Saman Jawaid",
                    "user_href": "/profile/Saman-Jawaid-1"
                },
                {
                    "user_id": "Arunima Pande",
                    "user_href": "/profile/Arunima-Pande-2"
                },
                {
                    "user_id": "Shivram Swaminathan",
                    "user_href": "/profile/Shivram-Swaminathan"
                },
                {
                    "user_id": "Peter Sherman",
                    "user_href": "/profile/Peter-Sherman-11"
                }
            ]
        },
        {
            "author_info": {
                "name": "Azrion Blog",
                "href": "/profile/Azrion-Blog"
            },
            "answer_text": "Is this having people not love you or have you not love yourself? My family is pretty unlovable so I understand how it feels to not be loved it’s freaking tiring when all you want is love, warmth, and kindness from others. And you may have friends or don’t and they are just friends they don’t provide the love you want or need. Understand that love, kindness and appreciation can come from anyone and anywhere. Going online to seek a loving friend isn’t a bad thing, great friendships you never knew you could have may happen. Use an app like talklife to engage with others feeling and going through the same thing, also Reddit if you find the right subreddit. If it’s self-love and you personally cannot find the love in yourself. Start complimenting yourself. Google compliments to tell yourself and say them all because you are downright beautiful /maleorfemale doesn’t matter, you are smart… If you keep holding excuses against yourself that you not and you feel you are lying to yourself. You really not. Enjoy your own company, love yourself, self-love goes a long way. You won’t need others to love you because you are your own champion and your own hero… Someone is going to find you so damn lovable and irresistible and your children will love the person you are. Look forward to the future and love it for what it is about to give to you. Unconditional love. ",
            "date": "Answered September 6, 2019",
            "views": "305",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Ashlyn Barnard",
                    "user_href": "/profile/Ashlyn-Barnard"
                }
            ]
        },
        {
            "author_info": {
                "name": "Michael Powell",
                "href": "/profile/Michael-Powell-98"
            },
            "answer_text": "That happens to many of us. Think about who do you want love from. There are people who show they dont care, and if you look at them and really think. WHO CARES. If you’re talking about family, unfortunately, we can pick friends but not relatives. Try doing things you love and surround yourself by positive things and places. The feeling never goes away specially if you feel a relative or partner doesn't care. You have to not care in terms of knowing you are not the only one in this world that feels this way. Many people feel unloved. Because the world the way it is, has become too cynical and selfish. Instead give love, and that can make you feel good. Try not to focus too much to that otherwise you will feel worse. Focus on what makes you happy and try to be as much independent as possible, so you dont need anything from no one.. I know it can sound a bit bad or sad, it is not— it is simply a survival tip. Good luck. ",
            "date": "Updated November 22, 2016",
            "views": "12",
            "upvotes": " View 5 Upvoters",
            "upvoters": [
                {
                    "user_id": "Andrea Herman",
                    "user_href": "/profile/Andrea-Herman-7"
                },
                {
                    "user_id": "Ampy Pampeehlove",
                    "user_href": "/profile/Ampy-Pampeehlove"
                },
                {
                    "user_id": "Megan Langley",
                    "user_href": "/profile/Megan-Langley-2"
                },
                {
                    "user_id": "Maome K Muller",
                    "user_href": "/profile/Maome-K-Muller"
                },
                {
                    "user_id": "Isra Khan",
                    "user_href": "/profile/Isra-Khan-13"
                }
            ]
        },
        {
            "author_info": {
                "name": "Matthew Smith",
                "href": "/profile/Matthew-Smith-555"
            },
            "answer_text": "It is such an overwhelmingly empty and powerless feeling that even when you find a social circle that is supportive you still dont feel lovable, just fucked up and broken, like a dead weight everyone has to deal with. At the same time, you're torn between wanting to be alone, wanting to be with people, not sure how to communicate it, and not sure how you can contribute to a social circle. Its socially paralyzing and really very overwhelming. The worst part is usually you're totally fine externally, people like you (hence being a social circle seeking to include you), and they are just completely confused by what's going on, while you feel crushed under all this weird anxiety. ",
            "date": "Answered February 15, 2020",
            "views": "293",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Benjamin Fuqua",
                    "user_href": "/profile/Benjamin-Fuqua"
                },
                {
                    "user_id": "Boris Georgiev",
                    "user_href": "/profile/Boris-Georgiev-14"
                }
            ]
        },
        {
            "author_info": {
                "name": "Paul Heinowski",
                "href": "/profile/Paul-Heinowski"
            },
            "answer_text": "If you feel this way all the time, you are going through a very bad patch. You have to look out for a break in the clouds and grab it with both hands. It might be a particular person who brings the ray of sunshine, or it might be a particular thought or memory that makes you smile. You can return to these and you need to make a particular note of them. Activities also play a useful part in this, such as going to the shop, visiting the library, playing cards, etc. You will notice that some of them make you feel more at home with the world. You don't need to do anything special to be lovable, quite the opposite in fact. If you are at home in your everyday activities, you will attract the interest and sympathy of other everyday people. This might be just a nod, or a grunt etc, but you will notice it, and take it as a cue for feeling lovable. ",
            "date": "Answered May 12, 2018",
            "views": "259",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Rodney Smith",
                "href": "/profile/Rodney-Smith-19"
            },
            "answer_text": "Hi Ariel, Feeling like a mouse doesn't make you a mouse. Feeling ugly doesn't mean others will think you are ugly. And feeling unlovable doesn't mean others will not be able to love you. Who told you that? There is actually a contest for the ugliest dog and a dog wins it! (Look it up!) However, that dog is still loved very much. But let's say you had a beautiful dog that bit you every time you touched him. How long would you keep loving him if he always just wanted to hurt you? Would his being beautiful be more important for loving him than his biting you every time you got close to him? A person who is pretty on the outside but mean and hateful on the inside would be hard to love like the biting dog. The person who doesn't look so pretty, but is kindhearted and thoughtful would be much easier to love; just like the ugliest dog in the world. You are not unlovable if you are thoughtful and nice. But if you are mean and bite people, you may have trouble finding someone to love you. I hope this helps. Thanks for asking. ",
            "date": "Answered May 12, 2018",
            "views": "371",
            "upvotes": " View 2 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Lakshmi",
                    "user_href": "/profile/Lakshmi-381"
                },
                {
                    "user_id": "Ying Kuklos",
                    "user_href": "/profile/Ying-Kuklos"
                }
            ]
        },
        {
            "author_info": {
                "name": "Kimberly Goodwin",
                "href": "/profile/Kimberly-Goodwin-17"
            },
            "answer_text": "Please don’t feel that you are unloved. Perhaps you feel lonely because you are surrounded by the wrong people. First of all, please don’t believe that you are in any way unlovable. Just seeing how total strangers are concerned about your wellbeing and want you to NOT feel unloved speaks volumes. Love yourself and focus on your interests and what makes YOU happy whether it’s a favorite hobby, tv shows, reading, movies (especially funny ones :D), music, exercise….etc. It can be anything under the sun that YOU truly enjoy. Find what makes YOU happy and you will shine from within. Happiness, love and companionship are sure to follow. Wishing you all the best and lots of LOVE. Reply ",
            "date": "Answered October 30, 2019",
            "views": "270",
            "upvotes": " View 5 Upvoters",
            "upvoters": [
                {
                    "user_id": "Diana Osman",
                    "user_href": "/profile/Diana-Osman-9"
                }
            ]
        },
        {
            "author_info": {
                "name": "Anubhav Jain",
                "href": "/profile/Anubhav-Jain-179"
            },
            "answer_text": "If you can't love yourself, nobody will love you. If you love yourself, you would need nobody to love you. If you are satisfied and happy with what you did, you would not seek external appreciation. If you are sure of your decision, you would never seek approval of people.  It's all about you, how complete you are, how you look at yourself, how much you respect yourself, how determined you are, how confident you are. If you feel secure and confident in your skin, others will automatically respect you and even if they don’t, it won't matter much! Thanks for A2A Swati Sarangi. ",
            "date": "Answered December 7, 2018",
            "views": "36",
            "upvotes": " View 168 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Cassie Reader",
                    "user_href": "/profile/Cassie-Reader"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/PG-65"
                },
                {
                    "user_id": "Khushi Chouksey",
                    "user_href": "/profile/Khushi-Chouksey-3"
                },
                {
                    "user_id": "Alice Maine",
                    "user_href": "/profile/Alice-Maine"
                },
                {
                    "user_id": "Marc Bodnick",
                    "user_href": "/profile/Marc-Bodnick"
                }
            ]
        },
        {
            "author_info": {
                "name": "Sreenath Gopalakrishnan",
                "href": "/profile/Sreenath-Gopalakrishnan-6"
            },
            "answer_text": "Unlove doesn’t exist. Unlove is not possible. Any body who loved you can never unlove you. As a corollary, you cannot unlove your dear ones either. May be you might feel unloved… and that’s when you need to remind yourself that - unlove is not possible. and that .. it is not the love, but circumstances and priorities, that have changed … May be you badly want to unlove some one to move on… and that’s when you need to remind yourself that - unlove is not possible… and that… attempting(unsuccessfully) to unlove some one will only leave you bitter and incomplete. ",
            "date": "Answered October 31, 2017",
            "views": "820",
            "upvotes": " View 6 Upvoters",
            "upvoters": [
                {
                    "user_id": "Alex Rivera",
                    "user_href": "/profile/Alex-Rivera-584"
                },
                {
                    "user_id": "Sai Anirudh Kavattur",
                    "user_href": "/profile/Sai-Anirudh-Kavattur"
                },
                {
                    "user_id": "Craig D. Dugan",
                    "user_href": "/profile/Craig-D-Dugan"
                },
                {
                    "user_id": "Katariina Telling",
                    "user_href": "/profile/Katariina-Telling"
                },
                {
                    "user_id": "Jenifer Ratna",
                    "user_href": "/profile/Jenifer-Ratna"
                }
            ]
        },
        {
            "author_info": {
                "name": "Josh Kerger",
                "href": "/profile/Josh-Kerger"
            },
            "answer_text": "If it bothers you enough then don’t. Make a conscious effort to be more pleasant and helpful. When somebody talks, you listen and make that obvious by making eye contact when they do. Ya don’t have to agree with them or do what they suggest or anything but the reason why a person talks is most likely to be that they want somebody else to hear it, so at the very least humour them and pretend you are hearing what their saying. If you want to go all out, even sympathise with them. If you see people that are in need of help, you see them deserving and you feel that you are capable of such help, then help ’em. Think of it as helping yourself by helping them. Not that I think you will but you can’t help everybody and be aware that there are alot of people out there that want to take advantage of you. Good luck trying to differ the two. ",
            "date": "Answered December 11, 2017",
            "views": "661",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Mathew Davidson",
                "href": "/profile/Mathew-Davidson-7"
            },
            "answer_text": "This is a good question. I struggle too. Please keep fighting one day at a time. Not all the days are as hard as others. We can slowly build up worth by teeating ourselves well even though others may not. Please try to make friends and stsy close, look after yourself, look your best and treat your home with respect. I was raised without family or.love. We face a real fight for self respect. The Op is right, God does love us, but its not something we can just believe because we are told. If we are created to be loved it makes sense our Creator understands love better than anyone. Its just sad this world doesnt reflect his will and love for us. There has to be a reason he has allowed it though temporarily. Please keep an open mind to finding answers to these questions. They do exist x ",
            "date": "Answered October 30, 2019",
            "views": "202",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Yvonne Tetley",
                    "user_href": "/profile/Yvonne-Tetley"
                },
                {
                    "user_id": "Hayat Parwez",
                    "user_href": "/profile/Hayat-Parwez-2"
                },
                {
                    "user_id": "Aradhana Gupta",
                    "user_href": "/profile/Aradhana-Gupta-12"
                },
                {
                    "user_id": "Sravasti Guha Thakurta",
                    "user_href": "/profile/Sravasti-Guha-Thakurta"
                },
                {
                    "user_id": "Aastha Varyani",
                    "user_href": "/profile/Aastha-Varyani"
                },
                {
                    "user_id": "Amrata Shinde",
                    "user_href": "/profile/Amrata-Shinde"
                },
                {
                    "user_id": "Satyam Pandey",
                    "user_href": "/profile/सत्यम-पाण्डेय-Satyam-Pandey"
                },
                {
                    "user_id": "Swarnim Bhardwaj",
                    "user_href": "/profile/Swarnim-Bhardwaj"
                },
                {
                    "user_id": "Prabhu Vedha",
                    "user_href": "/profile/Prabhu-Vedha"
                },
                {
                    "user_id": "Raj",
                    "user_href": "/profile/Raj-971"
                },
                {
                    "user_id": "Nitish B",
                    "user_href": "/profile/Nitish-B-8"
                },
                {
                    "user_id": "Anurag Gogoi",
                    "user_href": "/profile/Anurag-Gogoi-12"
                },
                {
                    "user_id": "Amani",
                    "user_href": "/profile/Amani-80"
                },
                {
                    "user_id": "Anirudh Gaurav",
                    "user_href": "/profile/Anirudh-Gaurav-2"
                },
                {
                    "user_id": "Annu Priya",
                    "user_href": "/profile/Annu-Priya-13"
                },
                {
                    "user_id": "Huma Beg",
                    "user_href": "/profile/हुमा-Huma-Beg"
                },
                {
                    "user_id": "Kavya Subramanyam",
                    "user_href": "/profile/Kavya-Subramanyam"
                },
                {
                    "user_id": "Tejal Patel Parikh",
                    "user_href": "/profile/Tejal-Patel-Parikh"
                },
                {
                    "user_id": "Rham-Yeah",
                    "user_href": "/profile/Rham-Yeah"
                },
                {
                    "user_id": "Ratnamala Kamath",
                    "user_href": "/profile/Ratnamala-Kamath"
                },
                {
                    "user_id": "Ashish Kumar",
                    "user_href": "/profile/Ashish-Kumar-18120"
                },
                {
                    "user_id": "Ashish Kumar",
                    "user_href": "/profile/Ashish-Kumar-513"
                },
                {
                    "user_id": "Ritika Singh",
                    "user_href": "/profile/Ritika-Singh-75"
                },
                {
                    "user_id": "Manab Singha",
                    "user_href": "/profile/Manab-Singha"
                },
                {
                    "user_id": "Anamika Kushwah",
                    "user_href": "/profile/Anamika-Kushwah-1"
                },
                {
                    "user_id": "Rohit Pokarna",
                    "user_href": "/profile/Rohit-Pokarna"
                },
                {
                    "user_id": "Divya Ram",
                    "user_href": "/profile/Divya-Ram-28"
                },
                {
                    "user_id": "Rajeev Vikram Shah",
                    "user_href": "/profile/Rajeev-Vikram-Shah"
                },
                {
                    "user_id": "Ravi Yadav",
                    "user_href": "/profile/Ravi-Yadav-40"
                },
                {
                    "user_id": "Rachita Satapathy",
                    "user_href": "/profile/Rachita-Satapathy-1"
                },
                {
                    "user_id": "Tejashwini Muler",
                    "user_href": "/profile/Tejashwini-Muler"
                },
                {
                    "user_id": "Sai Swaroop",
                    "user_href": "/profile/Sai-Swaroop-175"
                },
                {
                    "user_id": "Prabha",
                    "user_href": "/profile/Prabha-79"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/Dr-saira-2"
                },
                {
                    "user_id": "Vijeta Kumari",
                    "user_href": "/profile/Vijeta-Kumari-30"
                },
                {
                    "user_id": "Swati Sarangi",
                    "user_href": "/profile/Swati-Sarangi-स्वाति-षड़ंगी"
                },
                {
                    "user_id": "Ram Chakravarti",
                    "user_href": "/profile/Ram-Chakravarti"
                },
                {
                    "user_id": "Vamshi Krishna",
                    "user_href": "/profile/Vamshi-Krishna-901"
                },
                {
                    "user_id": "Adnan Wasi",
                    "user_href": "/profile/Adnan-Wasi-2"
                },
                {
                    "user_id": "Tirtho Sagar Mazumdar",
                    "user_href": "/profile/Tirtho-Sagar-Mazumdar"
                },
                {
                    "user_id": "Vyakhya Saxena",
                    "user_href": "/profile/Vyakhya-Saxena"
                },
                {
                    "user_id": "Harene Senthoor",
                    "user_href": "/profile/Harene-Senthoor"
                },
                {
                    "user_id": "Sukanya Muley",
                    "user_href": "/profile/Sukanya-Muley"
                },
                {
                    "user_id": "Niks Kj",
                    "user_href": "/profile/Niks-Kj"
                },
                {
                    "user_id": "Shrikant Rao",
                    "user_href": "/profile/Shrikant-Rao-25"
                },
                {
                    "user_id": "Mahesh Funde",
                    "user_href": "/profile/Mahesh-Funde-2"
                },
                {
                    "user_id": "Hiren T. Solanki",
                    "user_href": "/profile/Hiren-T-Solanki"
                },
                {
                    "user_id": "Ankitha Gudlar",
                    "user_href": "/profile/Ankitha-Gudlar"
                },
                {
                    "user_id": "Harshit Raj",
                    "user_href": "/profile/Harshit-Raj-122"
                },
                {
                    "user_id": "Preetish Nayak",
                    "user_href": "/profile/Preetish-Nayak-1"
                },
                {
                    "user_id": "Chaitanya Hajare",
                    "user_href": "/profile/Chaitanya-Hajare-1"
                },
                {
                    "user_id": "Aman",
                    "user_href": "/profile/Aman-935"
                },
                {
                    "user_id": "Mamta Soni",
                    "user_href": "/profile/Mamta-Soni-29"
                },
                {
                    "user_id": "Rohini Ro",
                    "user_href": "/profile/Rohini-Ro-3"
                },
                {
                    "user_id": "Amlani Priyal",
                    "user_href": "/profile/Amlani-Priyal"
                },
                {
                    "user_id": "Sai Prasuna",
                    "user_href": "/profile/Sai-Prasuna-4"
                },
                {
                    "user_id": "Rakshana",
                    "user_href": "/profile/Rakshana-11"
                },
                {
                    "user_id": "Rahul Yadav",
                    "user_href": "/profile/Rahul-Yadav-649"
                },
                {
                    "user_id": "Prachi Pranamya",
                    "user_href": "/profile/Prachi-Pranamya"
                },
                {
                    "user_id": "Payal Dhiman",
                    "user_href": "/profile/Payal-Dhiman-19"
                },
                {
                    "user_id": "Subhra Priyadarshinee",
                    "user_href": "/profile/Subhra-Priyadarshinee"
                },
                {
                    "user_id": "Chitranshi Nayak",
                    "user_href": "/profile/Chitranshi-Nayak"
                },
                {
                    "user_id": "Somnath Korde",
                    "user_href": "/profile/Somnath-Korde-2"
                },
                {
                    "user_id": "YK",
                    "user_href": "/profile/YK-74"
                },
                {
                    "user_id": "Rajni Kalra",
                    "user_href": "/profile/Rajni-Kalra-17"
                },
                {
                    "user_id": "Dhruv Verma",
                    "user_href": "/profile/Dhruv-Verma-9"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/Richa-440"
                },
                {
                    "user_id": "Pragati Fageria",
                    "user_href": "/profile/Pragati-Fageria"
                },
                {
                    "user_id": "Chintu",
                    "user_href": "/profile/Chintu-44"
                },
                {
                    "user_id": "Vinaykumargoudkalal",
                    "user_href": "/profile/Vinaykumargoudkalal"
                },
                {
                    "user_id": "Ashish Sukhija",
                    "user_href": "/profile/Ashish-Sukhija"
                },
                {
                    "user_id": "Prashant Soni",
                    "user_href": "/profile/Prashant-Soni-33"
                },
                {
                    "user_id": "Aruna Durai",
                    "user_href": "/profile/Aruna-Durai"
                },
                {
                    "user_id": "Amadu Lukman",
                    "user_href": "/profile/Amadu-Lukman"
                },
                {
                    "user_id": "Shagun Sharma",
                    "user_href": "/profile/Shagun-Sharma-58"
                },
                {
                    "user_id": "Abdulakeem Sanusi",
                    "user_href": "/profile/Abdulakeem-Sanusi"
                },
                {
                    "user_id": "Bollepalli Hritvik",
                    "user_href": "/profile/Bollepalli-Hritvik"
                },
                {
                    "user_id": "Dhirendra Kumar",
                    "user_href": "/profile/Dhirendra-Kumar-275"
                },
                {
                    "user_id": "Utkarsh Rai",
                    "user_href": "/profile/Utkarsh-Rai-14"
                },
                {
                    "user_id": "Dhaveen J",
                    "user_href": "/profile/Dhaveen-J-1"
                },
                {
                    "user_id": "Kunal Ghogare",
                    "user_href": "/profile/Kunal-Ghogare"
                },
                {
                    "user_id": "Dhivya Sadasivam",
                    "user_href": "/profile/Dhivya-Sadasivam-1"
                },
                {
                    "user_id": "Siva G",
                    "user_href": "/profile/Siva-G-136"
                },
                {
                    "user_id": "Rahul Saxena",
                    "user_href": "/profile/Rahul-Saxena-385"
                },
                {
                    "user_id": "Anupreeti Mahadik",
                    "user_href": "/profile/Anupreeti-Mahadik"
                },
                {
                    "user_id": "Anjali",
                    "user_href": "/profile/Anjali-676"
                },
                {
                    "user_id": "Parth Mehta",
                    "user_href": "/profile/Parth-Mehta-168"
                },
                {
                    "user_id": "Krishna Mudhiraj",
                    "user_href": "/profile/Krishna-Mudhiraj"
                },
                {
                    "user_id": "Veni",
                    "user_href": "/profile/Veni-16"
                },
                {
                    "user_id": "Julius Smith",
                    "user_href": "/profile/Julius-Smith-4"
                },
                {
                    "user_id": "Mehakpreet Kaur",
                    "user_href": "/profile/Mehakpreet-Kaur-40"
                },
                {
                    "user_id": "Rahul Mandiwal",
                    "user_href": "/profile/Rahul-Mandiwal"
                },
                {
                    "user_id": "Yashaswini Yadav",
                    "user_href": "/profile/Yashaswini-Yadav-4"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/Meghlu"
                },
                {
                    "user_id": "Jerry Sorrell",
                    "user_href": "/profile/Jerry-Sorrell"
                },
                {
                    "user_id": "Anuj Srivastava (अनुज श्रीवास्तव )",
                    "user_href": "/profile/Anuj-Srivastava-अनुज-श्रीवास्तव"
                },
                {
                    "user_id": "Deobrat Mallick",
                    "user_href": "/profile/Deobrat-Mallick-1"
                },
                {
                    "user_id": "Bhavitha Regunta",
                    "user_href": "/profile/Bhavitha-Regunta"
                },
                {
                    "user_id": "Anushka S",
                    "user_href": "/profile/Anushka-S-9"
                },
                {
                    "user_id": "Nahmed Nissar",
                    "user_href": "/profile/Nahmed-Nissar"
                },
                {
                    "user_id": "Neha",
                    "user_href": "/profile/Neha-1178"
                },
                {
                    "user_id": "Riya Prem",
                    "user_href": "/profile/Riya-Prem"
                },
                {
                    "user_id": "Kichu Kumar",
                    "user_href": "/profile/Kichu-Kumar"
                },
                {
                    "user_id": "Sakshi Mundra",
                    "user_href": "/profile/Sakshi-Mundra"
                },
                {
                    "user_id": "Shajahan Sheriff",
                    "user_href": "/profile/Shajahan-Sheriff"
                },
                {
                    "user_id": "Sonam Dolma",
                    "user_href": "/profile/Sonam-Dolma-2"
                },
                {
                    "user_id": "Vimaladarshan Mohanram Rao",
                    "user_href": "/profile/Vimaladarshan-Mohanram-Rao"
                },
                {
                    "user_id": "Sasmita Singh",
                    "user_href": "/profile/Sasmita-Singh-1"
                },
                {
                    "user_id": "Kshitij Mehrotra",
                    "user_href": "/profile/Kshitij-Mehrotra-4"
                },
                {
                    "user_id": "Muthu Krishnan",
                    "user_href": "/profile/முத்து-கிருஷ்ணன்-Muthu-Krishnan"
                },
                {
                    "user_id": "Ram K Reddy",
                    "user_href": "/profile/Ram-K-Reddy"
                },
                {
                    "user_id": "Praveen Chowdhary",
                    "user_href": "/profile/Praveen-Chowdhary-2"
                },
                {
                    "user_id": "Saurav Soam",
                    "user_href": "/profile/Saurav-Soam"
                },
                {
                    "user_id": "Gayatri A",
                    "user_href": "/profile/Gayatri-A-4"
                },
                {
                    "user_id": "Rishi (ऋषि)",
                    "user_href": "/profile/Rishi-ऋषि"
                },
                {
                    "user_id": "Rishabh Gupta",
                    "user_href": "/profile/Rishabh-Gupta-191"
                },
                {
                    "user_id": "Anita Nehra",
                    "user_href": "/profile/Anita-Nehra-3"
                },
                {
                    "user_id": "Mohit Garg",
                    "user_href": "/profile/Mohit-Garg-31"
                },
                {
                    "user_id": "Sushmitha Vk",
                    "user_href": "/profile/Sushmitha-Vk"
                },
                {
                    "user_id": "Monish Revuri",
                    "user_href": "/profile/Monish-Revuri"
                },
                {
                    "user_id": "Reguvaran Madhavan",
                    "user_href": "/profile/Reguvaran-Madhavan"
                },
                {
                    "user_id": "Prithvi Krishnavanshi",
                    "user_href": "/profile/Prithvi-Krishnavanshi"
                },
                {
                    "user_id": "Sanchita Mishra",
                    "user_href": "/profile/Sanchita-Mishra-2"
                },
                {
                    "user_id": "Anupam Verma",
                    "user_href": "/profile/Anupam-Verma-12"
                },
                {
                    "user_id": "Ananya Verma",
                    "user_href": "/profile/अनन्या-वर्मा-Ananya-Verma"
                },
                {
                    "user_id": "Himani Sharma",
                    "user_href": "/profile/HImani-Sharma-300"
                },
                {
                    "user_id": "Pragathi B R",
                    "user_href": "/profile/Pragathi-B-R"
                },
                {
                    "user_id": "Priyanka Reddy",
                    "user_href": "/profile/Priyanka-Reddy-631"
                },
                {
                    "user_id": "Kanchan Kumari",
                    "user_href": "/profile/Kanchan-Kumari-418"
                },
                {
                    "user_id": "Vivek Mishra",
                    "user_href": "/profile/Vivek-Mishra-913"
                },
                {
                    "user_id": "Linny Simon",
                    "user_href": "/profile/Linny-Simon-1"
                },
                {
                    "user_id": "Saket Gupta",
                    "user_href": "/profile/Saket-Gupta-134"
                },
                {
                    "user_id": "Radha",
                    "user_href": "/profile/Radha-93"
                },
                {
                    "user_id": "Aman Garg",
                    "user_href": "/profile/Aman-Garg-301"
                },
                {
                    "user_id": "Yashika Jain",
                    "user_href": "/profile/Yashika-Jain-16"
                },
                {
                    "user_id": "Kaur Hardeep",
                    "user_href": "/profile/Kaur-Hardeep-1"
                },
                {
                    "user_id": "Hemanth Durga Saiesh",
                    "user_href": "/profile/Hemanth-Durga-Saiesh"
                },
                {
                    "user_id": "Pavithirah S",
                    "user_href": "/profile/Pavithirah-S"
                },
                {
                    "user_id": "Abhijit Sarkar",
                    "user_href": "/profile/Abhijit-Sarkar-117"
                },
                {
                    "user_id": "Rahul Kodithaala",
                    "user_href": "/profile/Rahul-Kodithaala"
                },
                {
                    "user_id": "Vishal Singh",
                    "user_href": "/profile/Vishal-Singh-1742"
                },
                {
                    "user_id": "Lakshminarayanan Chakravarthy",
                    "user_href": "/profile/Lakshminarayanan-Chakravarthy"
                },
                {
                    "user_id": "Aradhana Mourya",
                    "user_href": "/profile/Aradhana-Mourya-3"
                },
                {
                    "user_id": "Vandana Dohre",
                    "user_href": "/profile/Vandana-Dohre"
                },
                {
                    "user_id": "Teja P",
                    "user_href": "/profile/Teja-P-18"
                },
                {
                    "user_id": "Rajesh Kumar",
                    "user_href": "/profile/Rajesh-Kumar-1470"
                },
                {
                    "user_id": "Priya",
                    "user_href": "/profile/Priya-1366"
                },
                {
                    "user_id": "Pratiksha Petkar",
                    "user_href": "/profile/Pratiksha-Petkar"
                },
                {
                    "user_id": "Tom Ramsay",
                    "user_href": "/profile/Tom-Ramsay-3"
                },
                {
                    "user_id": "Shweta Purswani",
                    "user_href": "/profile/Shweta-Purswani-1"
                },
                {
                    "user_id": "Amit Agrawal",
                    "user_href": "/profile/Amit-Agrawal-359"
                },
                {
                    "user_id": "Piyush Bele",
                    "user_href": "/profile/Piyush-Bele"
                },
                {
                    "user_id": "Bidisha Dash",
                    "user_href": "/profile/Bidisha-Dash-3"
                },
                {
                    "user_id": "Sagar Kafle",
                    "user_href": "/profile/Sagar-Kafle-13"
                },
                {
                    "user_id": "Vikas Singh",
                    "user_href": "/profile/Vikas-Singh-461"
                },
                {
                    "user_id": "Mathew Sam Pullampallil",
                    "user_href": "/profile/Mathew-Sam-Pullampallil-1"
                },
                {
                    "user_id": "Raghav Manglik ( राघव मांगलिक)",
                    "user_href": "/profile/Raghav-Manglik-राघव-मांगलिक"
                },
                {
                    "user_id": "Anshuman",
                    "user_href": "/profile/Anshuman-171"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/Radhika-308"
                },
                {
                    "user_id": "Mohiit Yadav",
                    "user_href": "/profile/Mohiit-Yadav"
                },
                {
                    "user_id": "Lavina",
                    "user_href": "/profile/Lavina-19"
                },
                {
                    "user_id": "Vanajakshi Mulimani",
                    "user_href": "/profile/Vanajakshi-Mulimani"
                },
                {
                    "user_id": "Vibhuti Sapru",
                    "user_href": "/profile/Vibhuti-Sapru"
                },
                {
                    "user_id": "Kanya Dev",
                    "user_href": "/profile/Kanya-Dev-1"
                },
                {
                    "user_id": "Negan Sawlani",
                    "user_href": "/profile/Negan-Sawlani"
                },
                {
                    "user_id": "Meghna Das",
                    "user_href": "/profile/Meghna-Das-65"
                },
                {
                    "user_id": "Rakhi Singh Tomar",
                    "user_href": "/profile/Rakhi-Singh-Tomar"
                },
                {
                    "user_id": "Pooja Yadav",
                    "user_href": "/profile/Pooja-Yadav-1427"
                }
            ]
        },
        {
            "author_info": {
                "name": "Ciprian Nita",
                "href": "/profile/Ciprian-Nita"
            },
            "answer_text": "Hey, Loveable …express your expectation to be loved. This is not love, this is deep pain in disguise. Become aware of this pain and manifest compassion toward your inner child that assimilate this feeling. This compassion will free yourself from this pain. Now, Real love is what you generate yourself. Is what you spread around yourself. That is your responsibility, not others. :), god bless you. ",
            "date": "Answered May 12, 2018",
            "views": "212",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Phafoo Jeans",
                    "user_href": "/profile/Phafoo-Jeans"
                },
                {
                    "user_id": "Tamica Lewis",
                    "user_href": "/profile/Tamica-Lewis"
                },
                {
                    "user_id": "Saurabh Jha",
                    "user_href": "/profile/Saurabh-Jha-18"
                },
                {
                    "user_id": "Priyanka Singh",
                    "user_href": "/profile/Priyanka-Singh-1887"
                },
                {
                    "user_id": "Tanweer",
                    "user_href": "/profile/Tanweer-7"
                },
                {
                    "user_id": "Sravani Amudala",
                    "user_href": "/profile/Sravani-Amudala-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "David O'Malley",
                "href": "/profile/David-OMalley-25"
            },
            "answer_text": "Very sad and terrifying. Makes you feel like you are a piece of garbage. Makes you feel very afraid and alone. You go through life but then again not really living because nobody cares about you. Makes you feel like you are a machine and not an individual. Just imagine how life would be if every single person you meet looks at you in disgust and tells you that you are a useless piece of junk. ",
            "date": "Answered November 22, 2018",
            "views": "519",
            "upvotes": " View 5 Upvoters",
            "upvoters": [
                {
                    "user_id": "Alex Rivera",
                    "user_href": "/profile/Alex-Rivera-584"
                },
                {
                    "user_id": "Craig D. Dugan",
                    "user_href": "/profile/Craig-D-Dugan"
                },
                {
                    "user_id": "Jenifer Ratna",
                    "user_href": "/profile/Jenifer-Ratna"
                }
            ]
        },
        {
            "author_info": {
                "name": "Madhavi Parashar",
                "href": "/profile/Madhavi-Parashar-2"
            },
            "answer_text": "When i feel unloved ,i just enjoy my company and i think i relate to this pic 🤣😅😅😅  According to me ,,,,i am bestfriend of myself because no one can know me better than myself . Thank u ",
            "date": "Answered August 10, 2020",
            "views": "13",
            "upvotes": " View 19 Upvoters ",
            "upvoters": [
                {
                    "user_id": "DeepHappiness",
                    "user_href": "/profile/DeepHappiness"
                },
                {
                    "user_id": "Ying Kuklos",
                    "user_href": "/profile/Ying-Kuklos"
                }
            ]
        },
        {
            "author_info": {
                "name": "Nicole Alexander",
                "href": "/profile/Nicole-Alexander-30"
            },
            "answer_text": "I’ve been in your shoes before. I know that you can have such regret that you feel undeserving of love. Even though you feel unlovable, I think it’s important to remember that you are lovable. Everyone is. Even if by some strange circumstance you’re not loved by others, you are loved by God. Whenever you feel unlovable, just remember that you’re still loved. ",
            "date": "Answered October 3, 2018",
            "views": "79",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Zara Kovaks",
                    "user_href": "/profile/Zara-Kovaks"
                },
                {
                    "user_id": "Boris Georgiev",
                    "user_href": "/profile/Boris-Georgiev-14"
                },
                {
                    "user_id": "Isabel Gutierrez",
                    "user_href": "/profile/Isabel-Gutierrez-63"
                },
                {
                    "user_id": "Pavlos Daskalakis (Παύλος Δασκαλάκης)",
                    "user_href": "/profile/Pavlos-Daskalakis-Παύλος-Δασκαλάκης"
                },
                {
                    "user_id": "Martin Wilter",
                    "user_href": "/profile/Martin-Wilter-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Eric Pepke",
                "href": "/profile/Eric-Pepke"
            },
            "answer_text": "The idea that you are unlovable is a frame.  It's a deep neurological structure that does not grow out of reason but rather is reinforced by simple repetition.  Every time you access it, it grows stronger. Affirmations do work.  Repeat to yourself \"I am lovable.\"  I found it useful to do this along with some repetitive motion, such as walking or exercise on a stair climber. ",
            "date": "Answered October 9, 2012",
            "views": "15",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Asterophile",
                    "user_href": "/profile/Asterophile"
                },
                {
                    "user_id": "Rajanya Chakraborty",
                    "user_href": "/profile/Rajanya-Chakraborty-5"
                },
                {
                    "user_id": "Somu",
                    "user_href": "/profile/Somu-66"
                },
                {
                    "user_id": "Sumaiya",
                    "user_href": "/profile/Sumaiya-56"
                },
                {
                    "user_id": "Saurabh",
                    "user_href": "/profile/Saurabh-994"
                },
                {
                    "user_id": "Deepa Desai",
                    "user_href": "/profile/Deepa-Desai-41"
                },
                {
                    "user_id": "Hai Sai",
                    "user_href": "/profile/Hai-Sai-3"
                },
                {
                    "user_id": "Aditya Aarti Parashar",
                    "user_href": "/profile/Aditya-Aarti-Parashar"
                },
                {
                    "user_id": "Sapna Mastkar",
                    "user_href": "/profile/Sapna-Mastkar"
                },
                {
                    "user_id": "Vishal Singh",
                    "user_href": "/profile/Vishal-Singh-5621"
                },
                {
                    "user_id": "Anurag Gupta",
                    "user_href": "/profile/Anurag-Gupta-1835"
                },
                {
                    "user_id": "Sanchitha Bhat",
                    "user_href": "/profile/Sanchitha-Bhat"
                },
                {
                    "user_id": "Suhani",
                    "user_href": "/profile/Suhani-106"
                },
                {
                    "user_id": "Madhav",
                    "user_href": "/profile/Madhav-219"
                },
                {
                    "user_id": "KHUSHI VISHWAKARMA",
                    "user_href": "/profile/KHUSHI-VISHWAKARMA-27"
                },
                {
                    "user_id": "Mannu Chauhan",
                    "user_href": "/profile/Mannu-Chauhan-11"
                },
                {
                    "user_id": "Aravind",
                    "user_href": "/profile/Aravind-297"
                },
                {
                    "user_id": "Kartikey Siwach",
                    "user_href": "/profile/Kartikey-Siwach"
                },
                {
                    "user_id": "Mannat",
                    "user_href": "/profile/Mannat-65"
                }
            ]
        },
        {
            "author_info": {
                "name": "Marcus Lundgren",
                "href": "/profile/Marcus-Lundgren-1"
            },
            "answer_text": "You may or may not be unlovable, but I am. After 42 years on this Earth, not a single woman has even wanted to hold my hand. Is it because I’m a nasty person? No, it’s because I’m ugly. And being ugly has made me give up hope of finding someone who’ll have me, because I don’t want to be loved if I’m ugly. I want to be able to give a woman the man she wants; someone that I actually want to be. I don’t want to be me, and that’s why I’m unlovable. How about you? ",
            "date": "Answered March 20, 2019",
            "views": "436",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Prashant Kumar Singh",
                "href": "/profile/Prashant-Kumar-Singh-62"
            },
            "answer_text": "Actually if you feel such feeling just think at once, about yourself, and the people who really cares for you no matter how wrong or right you are, and second thought must be, think about yourself , just you, you will feel sad than talk to your friend who always abuse you no matter what, this remedy definitely works. You just need to love yourself anyhow. Surround yourself with the people who love you. ",
            "date": "Answered October 1, 2018",
            "views": "64",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "William Allan Shearer",
                "href": "/profile/William-Allan-Shearer"
            },
            "answer_text": "Not a joke, but in my case I was nearly killed in a car wreck and comatose afterwards, and woke to find myself surrounded by people who showed they loved me by being there and telling me in words as well. Not saying you should die to see if others love you, but you might make a break from your repetitve thoughts and allow yourself to see yourself as lovable. I learned a lot about overthinking from a woman who truly Did Not love me who pointed out to me that I was ignoring my feelings to my detriment ",
            "date": "Updated August 20, 2020",
            "views": "111",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Nishtha Jain",
                "href": "/profile/Nishtha-Jain-109"
            },
            "answer_text": "Actually, you have already accepted that you are unlikeable. That's the reason you are asking this question. But believe me, if a person or a group of people (irrespective, to the size of group), dislikes you, it doesn't mean that you are unlikeable. There are still some people on this earth who like you. Just keep on doing the good work you are doing. Stop JUDGING yourself. One day everything, good or bad, eventually comes to end. ",
            "date": "Answered December 11, 2017",
            "views": "794",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Serena James",
                    "user_href": "/profile/Serena-James-9"
                },
                {
                    "user_id": "Christina Wilson",
                    "user_href": "/profile/Christina-Wilson-137"
                }
            ]
        },
        {
            "author_info": {
                "name": "Mary Bowerman",
                "href": "/profile/Mary-Bowerman-3"
            },
            "answer_text": "Find ways to be more loving to yourself. Treat yourself as if you are a beloved friend or sibling. “Being unloved” by other people can be very freeing. If nobody else is loving you, then they have no claim on your time and energy. That frees you to focus on yourself, and get your needs met the way you want. Find ways to be more loving towards others. Reaching out to genuinely help others can bring warmth and satisfaction. And lead to more positive interactions. ",
            "date": "Answered October 30, 2019",
            "views": "101",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Ashlyn Barnard",
                    "user_href": "/profile/Ashlyn-Barnard"
                },
                {
                    "user_id": "Kat",
                    "user_href": "/profile/Kat-1588"
                },
                {
                    "user_id": "Cathy Thorsen",
                    "user_href": "/profile/Cathy-Thorsen"
                },
                {
                    "user_id": "Salem Al-Mansoori",
                    "user_href": "/profile/Salem-Al-Mansoori"
                }
            ]
        },
        {
            "author_info": {
                "name": "Jess Reynaga",
                "href": "/profile/Jess-Reynaga"
            },
            "answer_text": "Embracing the love you can provide yourself. We are not meant to be with somebody forever, do not expect others to provide what you can achieve. We as humans need to live in groups but in order to love somebody you must learn and appreciate what you are, or to change what you absolutely don't like. You feel unloved, where do feeling come?, from thoughts, learn to control what you are thinking, avoid harmful thoughts, work everyday to improve it. As an example: “Nobody provokes you to be upset, you take the decision to be upset under certain circumstances”. When you start understanding everything you are derives from the good or bad decisions you make, it all makes sense. ",
            "date": "Answered October 26, 2016",
            "views": "334",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Elaine Goetz",
                "href": "/profile/Elaine-Goetz"
            },
            "answer_text": "Help others. My family threw me away through no fault of my own. My daughter was stolen from me by my mother. I cried every night for 10 years. I was so broken. I was always helpful to others. I prayed a lot too. I had to painfully realize that my family didn't want me. After not speaking to them for 20 years, I now realize that was what was best for me. I am okay now. Many of my family members are suffering from so much dysfunction. God has a plan for all of our pain and suffering. ",
            "date": "Answered October 26, 2016",
            "views": "217",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Alex Rivera",
                    "user_href": "/profile/Alex-Rivera-584"
                },
                {
                    "user_id": "Craig D. Dugan",
                    "user_href": "/profile/Craig-D-Dugan"
                },
                {
                    "user_id": "Naitik Chandak",
                    "user_href": "/profile/Naitik-Chandak-नैतिक-चांडक"
                }
            ]
        },
        {
            "author_info": {
                "name": "Max Boettger",
                "href": "/profile/Max-Boettger-2"
            },
            "answer_text": "It is depressing being lonely. I really don’t miss the company all that much, I just miss the sex to be honest.I am a very independent person and I do so much I don’t have time to take care of other people. But I cope by filling the void with something else. It generally works, but like I said, I miss aspects of relationships. ",
            "date": "Answered March 20, 2017",
            "views": "536",
            "upvotes": " Answer requested by Troy Mason",
            "upvoters": [
                {
                    "user_id": "Shivani Shah",
                    "user_href": "/profile/Shivani-Shah-451"
                }
            ]
        },
        {
            "author_info": {
                "name": "Ritesh Sheth",
                "href": "/profile/Ritesh-Sheth-6"
            },
            "answer_text": "Realize you are love. My meditation teacher, Sri Sri Ravi Shankar, says love is not an emotion, it’s your very existence. He says give and give and give love! Be of service to others. Realize love is everywhere, even in gravity. The earth and gravity loves you so much, that’s why it keeps you grounded. Realize there are many types of love, like siblings, romantic partners, parents, children, and the divine. If you do not feel love with another person, feel love with God. Many people will say I love you because of this / that / for some reason, but realize you have unconditional love from god and you are capable of unconditionally loving others. Hope this helps. Help others less fortunate and you will realize love. Love, ",
            "date": "Answered October 30, 2019",
            "views": "194",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Pamela A. Brooks",
                    "user_href": "/profile/Pamela-A-Brooks"
                },
                {
                    "user_id": "Durga Prasad",
                    "user_href": "/profile/Durga-Prasad-1196"
                }
            ]
        },
        {
            "author_info": {
                "name": "Arnaud Saint-Paul",
                "href": "/profile/Arnaud-Saint-Paul"
            },
            "answer_text": "Love yourself, have fun with yourself, love the others whoever they are. Play! Be grateful! Oh yes, immensely grateful for all that you are. Open your heart to yourself and you will see before your very eyes life's magic. You will change and transform into a new you, one who loves, and ...is loved in return.In other words, listen to your Heart. ",
            "date": "Answered October 9, 2012",
            "views": "22",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Craig D. Dugan",
                    "user_href": "/profile/Craig-D-Dugan"
                },
                {
                    "user_id": "Tom Pony",
                    "user_href": "/profile/Tom-Pony"
                }
            ]
        },
        {
            "author_info": {
                "name": "McCoy Shoals II",
                "href": "/profile/McCoy-Shoals-II"
            },
            "answer_text": "I go to the shower an turn the water to as hot as I can take an turn my music to comfortable sound preferably Sade is my all time favorite an I think about a beautiful woman an that we are about tooooo while I have my 🖐 where I think it’s best comfortable for the song an thought…so I’m loved when I’m feeling unloved…get it☺️ ",
            "date": "Answered March 4, 2020",
            "views": "16",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Lisa Galarneau",
                "href": "/profile/Lisa-Galarneau"
            },
            "answer_text": "Do you love?  Then you are loveable. ",
            "date": "Answered February 1, 2012",
            "views": "14",
            "upvotes": " View 6 Upvoters",
            "upvoters": [
                {
                    "user_id": "Tazavia Davis",
                    "user_href": "/profile/Tazavia-Davis"
                }
            ]
        },
        {
            "author_info": {
                "name": "Katherine Monet",
                "href": "/profile/Katherine-Monet"
            },
            "answer_text": "There’s no way to really stop feeling unlovable without a lot of professional help. You can help it however, by spending time with family and your very best friends. Talk to people. Try to get out of your own head and really start to look at and help other people. ",
            "date": "Answered May 12, 2018",
            "views": "118",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Vassil Sotirov",
                    "user_href": "/profile/Vassil-Sotirov-1"
                },
                {
                    "user_id": "Ashlyn Barnard",
                    "user_href": "/profile/Ashlyn-Barnard"
                },
                {
                    "user_id": "Lana Wills",
                    "user_href": "/profile/Lana-Wills-1"
                },
                {
                    "user_id": "D B",
                    "user_href": "/profile/D-B-1675"
                },
                {
                    "user_id": "Robin Kidds",
                    "user_href": "/profile/Robin-Kidds"
                },
                {
                    "user_id": "Cathy Thorsen",
                    "user_href": "/profile/Cathy-Thorsen"
                }
            ]
        },
        {
            "author_info": {
                "name": "Ashish Makwana",
                "href": "/profile/Ashish-Makwana-5"
            },
            "answer_text": "It is damn simple . Just think about your family. I can bet there is no mother and father they don't love their own child and there is no child who don't love his parents. Do not think that you are unloved because there are people love you more then your own self. ",
            "date": "Answered October 26, 2016",
            "views": "170",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Ying Kuklos",
                    "user_href": "/profile/Ying-Kuklos"
                }
            ]
        },
        {
            "author_info": {
                "name": "Ann Viju",
                "href": "/profile/Ann-Viju"
            },
            "answer_text": "Know that it's your job to love yourself and make yourself happy, no one else's. Take responsibility for your actions. Develop your hobbies, skills and mindset. Be busy bettering yourself. “An idle mind is the devil's workshop.” ",
            "date": "Answered August 5, 2020",
            "views": "28",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Joseph Davis",
                "href": "/profile/Joseph-Davis-212"
            },
            "answer_text": "Its easy because the people in my circle dont know how to love . So I keep to my own and only worrie about me and my happiness. The world is full of hate now and there is nothing I can to do change that or anyone really . So I consider myself to be Special in the fact that I love myself first ! ",
            "date": "Answered October 30, 2019",
            "views": "26",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Christie Combs",
                "href": "/profile/Christie-Combs"
            },
            "answer_text": "Someone always loves you. It may not be family. It may not be friends. It could be the stranger sitting on the other side of the screen on the other side of the world…. But someone always loves someone…. Always…. ^^Question rendered invalid^^ ",
            "date": "Answered March 18, 2017",
            "views": "319",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Maome K Muller",
                    "user_href": "/profile/Maome-K-Muller"
                }
            ]
        },
        {
            "author_info": {
                "name": "Marilyn Guhl",
                "href": "/profile/Marilyn-Guhl"
            },
            "answer_text": "Ariel, You have to love yourself first and you begin that by finding ways of showing yourself love. Behavior is louder than words, if you love yourself, you should be able to see it. M ",
            "date": "Answered May 13, 2018",
            "views": "52",
            "upvotes": " Answer requested by Ying Kuklos",
            "upvoters": [
                {
                    "user_id": "Troy Mason",
                    "user_href": "/profile/Troy-Mason-5"
                }
            ]
        },
        {
            "author_info": {
                "name": "Tony Fennelly",
                "href": "/profile/Tony-Fennelly"
            },
            "answer_text": "If that is an accurate photo of you, you sure can’t blame your looks. Go out and love someone or something that needs loving. You can start with an abandoned old dog. ",
            "date": "Answered October 30, 2019",
            "views": "15",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Luna Grace",
                "href": "/profile/Luna-Grace-13"
            },
            "answer_text": "You don’t cope. You understand that no one can love you based on your idea of what love looks like. Everyone loves differently. Every idea is different. ",
            "date": "Answered October 30, 2019",
            "views": "17",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Sheharyar JHEhub",
                "href": "/profile/Sheharyar-JHEhub"
            },
            "answer_text": "well dont care if your unloved as people dont get any thing free in this world you need to prove your self of worthy of what u want in life . ",
            "date": "Answered October 31, 2019",
            "views": "17",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Afonso Wolfgang Kafka",
                "href": "/profile/Afonso-Wolfgang-Kafka"
            },
            "answer_text": "by making yourself likable and stop thinking about that ",
            "date": "Answered December 11, 2017",
            "views": "126",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Theresa Wilt",
                "href": "/profile/Theresa-Wilt"
            },
            "answer_text": "Like yourself then you won’t have to. ",
            "date": "Answered December 11, 2017",
            "views": "124",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Annie",
                "href": "/profile/Annie-341"
            },
            "answer_text": "It's them not me ",
            "date": "Answered March 17, 2017",
            "views": "40",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Nina Crespi",
                "href": "/profile/Nina-Crespi"
            },
            "answer_text": "Get a dog. ",
            "date": "Answered May 9, 2015",
            "views": "19",
            "upvotes": "0"
        }
    ]
}