{
    "title": "How much do books cost on Audible? - Quora",
    "tags": [
        "Audible Books",
        "Audible",
        "Audiobooks",
        "eBooks",
        "Pricing",
        "Costs",
        "Reading"
    ],
    "response": [
        {
            "author_info": {
                "name": "Tom Crosley",
                "href": "/profile/Tom-Crosley-1"
            },
            "answer_text": "Audible.com charges either a monthly fee, or an annual fee depending on the plan. Gold members get one credit per month; Platinum members get two. You use the credits to get one book. In the past, I used to see some very expensive (retail price over $50) or long (e.g. 70 hours) books require two credits, but I haven’t run into that recently. However most audio books retail for $25-$30 and are between 8 and 12 hours in length. Since credits end up costing from between $9.57 and $14.95 apiece, depending on the plan, you are getting a significant savings over the retail price. You can also buy any book outright at a 30% discount. If a book, after the discount costs less than the price of a credit, I usually pay for it directly (e.g. a book retailing for $14.95 would cost $10.46) There are also a limited number of free books every month, and various special sales every so often (buy two, get one free etc.). Up to one-half year’s credits roll around to the next month. In 12 1/2 years, I have downloaded around 390 books, so it appears I have bought 90 books over and above what I have received in credits. Once you buy a book, it’s yours, even if you quit the program. Plans are: Gold: 1 credit per month. $14.95/month. $14.95/credit. Gold Annual: 1 credit per month. $119.50 first yr. $9.96/credit. After that, $149.50/yr. $12.46/credit. Platinum: 2 credits per month. $22.95/month. $11.48/credit. The one I have. Platinum Annual: 2 credits per month. $229.50/yr. $9.57/credit. ",
            "date": "Answered April 16, 2020",
            "views": "641",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Richard Wolfli",
                    "user_href": "/profile/Richard-Wolfli"
                }
            ]
        },
        {
            "author_info": {
                "name": "Sherry Lawrence",
                "href": "/profile/Sherry-Lawrence"
            },
            "answer_text": "Each book costs a credit. The cost per credit is determined by your subscription. the cheapest monthly subscription is the most costly per credit. It is $14.95 monthly and gets you a single credit. There is a platinum suscription that you pay $22.95 monthly and get 2 credits, so just $11.48 per credit. These subscriptions are available at a discount for purchasing on a yearly basis. 12 credits billed yearly is $149.50, or $12.46 per credit. And 24 credits billed yearly is $229.50, coming to $9.57 per credit. All audiobooks can be purchases without credits, and are 30% off retail price. Audible also has periodic sales in which you can get 2 audio books for 1 credit, etc. But they choose which books are eligible for such sales. They offer multiple original recordings of which you could have 2 such recordings per month included in your subscription. Once you purchase an audio book in this manner, it is yours even if you cancel your subscription and can be downloaded to any device you own. ",
            "date": "Answered April 14, 2019",
            "views": "13",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "AD Majora",
                    "user_href": "/profile/AD-Majora"
                }
            ]
        }
    ]
}