{
    "title": "How many essays did Montaigne write? - Quora",
    "tags": [
        "MIchel De Montaigne",
        "Writing"
    ],
    "response": [
        {
            "author_info": {
                "name": "David Graham",
                "href": "/profile/David-Graham-149"
            },
            "answer_text": " A better question would be, how many essays did Michel de Montaigne publish? After all, who knows how many drafts Montaigne—a fastidious writer—tossed in the fire? The Complete Essays of Montaigne translated by Donald M. Frame (Palo Alto, California: Stanford University Press, 1989) lists 107 essays from 1572-1588. That’s 57 essays in Book I, 37 in Book II and 13 in Book III. Donald Murdoch Frame, professor emeritus of French at Columbia, says in his Notes on the Translation that he based it on the Bordeaux Copy. That is the copy of the 1588 (fifth) edition in which Montaigne wrote annotations and marginalia in his own hand. My own copy, alas, is of a much more recent vintage:  Anyway, Donald Frame earned his doctorate with a dissertation on Montaigne. If he says the collection is complete, I’m inclined to take his word for it. Dr Frame does say that he included “variants of earlier editions of the Essays (1580, 1582, 1587), as well as post-1588 additions that were deleted after being written.” He made these available in the footnotes “whenever they seemed interesting enough to mention (italics mine).” So Montaigne’s translator tossed some drafts in the fire himself, metaphorically speaking. I love Paul Landowski’s statue of Montaigne at the Square Paul Painlevé on rue des Ecoles. It’s in the 5th arrondissement, across the street from the Sorbonne. See the shiny toe of Montaigne’s slipper? That’s from generations of anxious students rubbing Montaigne’s foot for luck on the way to their exams. I’m superstitious, so I rubbed it myself (I stayed at the Hotel Sully Saint Germain on rue des Ecoles, a few blocks from this statue). Image: Guilhem Vellut: Statue of Montaigne in Paris | (CC BY 2.0) ",
            "date": "Answered March 12, 2017",
            "views": "910",
            "upvotes": " View 6 Upvoters",
            "upvoters": [
                {
                    "user_id": "Melanie Gutierrez",
                    "user_href": "/profile/Melanie-Gutierrez-42"
                },
                {
                    "user_id": "Maya Kaiser",
                    "user_href": "/profile/Maya-Kaiser"
                },
                {
                    "user_id": "Ivan Braun",
                    "user_href": "/profile/Ivan-Braun-1"
                },
                {
                    "user_id": "Naren Senaratna",
                    "user_href": "/profile/Naren-Senaratna"
                },
                {
                    "user_id": "Kevin Lin",
                    "user_href": "/profile/Kevin-Lin-66"
                },
                {
                    "user_id": "Jay Wacker",
                    "user_href": "/profile/Jay-Wacker"
                }
            ]
        }
    ]
}