{
    "title": "How to read 80ish books a year and actually remember them - Quora",
    "tags": [
        "Non-Fiction Books",
        "Non-Fiction",
        "Reading Recommendations",
        "Reading Advice",
        "Memory (information storage)",
        "Fiction",
        "Human Memory",
        "Reading",
        "Book Recommendations"
    ],
    "response": [
        {
            "author_info": {
                "name": "Eric Levit",
                "href": "/profile/Eric-Levit"
            },
            "answer_text": "I freelance as professional reader for a couple of publishers in Spain. For those who don’t know, the job consists on reading the manuscripts before the editor to advise about its quality and market possibilities. If it gets past me, the editor will consider it. In my line of work, I get anywhere between one and three manuscripts a week, every week -way more if we are on prize season- and I still need to read them carefully to avoid wasting my client’s time. That means writing a report explaining in detail any relevant aspect of the book, from its plot to the techniques used on the writing. There lies the secret to remembering every bit of what you read. Between my personal readings and those I do for a living I probably read a hundred and twentish books in 2018 and I can tell you about the plot and some details of any of the ones that I reported but not that much about the ones I took on for my enjoyment. I don’t really get why there’s this obsession with numbers and speed on reading lately -I would preffer a thousand times taking a year just reading À la recherche du temps perdu than use that time to read a hundred of bad to mediocre self improvment books- but if you want to make the time employed reading count, take a couple of hours writing about every book just after you’re done with it. That will not only help engrave the content on your mind but it will also force you to actually pay attention during the process. It may not be the most practical thing to do but, after some time, it will become second nature and you will have built your own helpful repository to revisist anytime you may need a refresher. ",
            "date": "Answered February 28, 2019",
            "views": "197",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "John-Pierre Maeli",
                    "user_href": "/profile/John-Pierre-Maeli"
                }
            ]
        },
        {
            "author_info": {
                "name": "Don MacFarlane",
                "href": "/profile/Don-MacFarlane"
            },
            "answer_text": "Doable. Richard Burton apparently read a book a day his whole life. You need to first establish a cadence for the reading itself: How many pages do you need to complete per day. Next, you need to make notes after your reading. These notes should elicit in your mind the concepts you have read. For 20 pages of text, you may just have 5–10 sentences. Your notes, kept as, say, a diary, do not as such replace the text but help you remember what you have read. You will need to return to these repeatedly. You might look them over the day after a particular reading and then 3 days later and then a week later and then continue this every 2–3 weeks for each reading. As you read more books you will, of course, have more review to do. You will be using something called ‘spaced repetition’ learning. However, all of this is just guesstimating on my part. I would suggest starting with a pilot program. Start with three books and develop a diary and repetition technique or cadence that works for you. You will need to give yourself some sort of objective criteria for success. For example, without looking at the books or your notes, can you recall their content. Try to refrain from writing overly extensive notes as they just become replacements for the original text. Instead, the notes should act as short labels that remind you of the far larger content in the primary readings themselves. Also, make sure you make the notes when the content is fresh in your mind. Look at your notes the day after to determine if the notes were extensive enough or too extensive. Just after reading, the ideas from the text are fresh in your mind so it can be tempting to write too little or too much. You need enough notes to elicit the content but refrain from writing so much that you are just copying the text. You may choose to write margin notes but make sure to not look at the text while you write these and never ever use a highlighter! ",
            "date": "Answered February 26, 2019",
            "views": "296",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Autumn Schmidt",
                    "user_href": "/profile/Autumn-Schmidt-15"
                }
            ]
        }
    ]
}