{
    "title": "How to know if I need a financial advisor - Quora",
    "tags": [
        "Financial Advisors",
        "Wealth Management",
        "Financial Planning"
    ],
    "response": [
        {
            "author_info": {
                "name": "Cody Shirk",
                "href": "/profile/Cody-Shirk"
            },
            "answer_text": "Right now. As soon as you can. And don’t pay for it.  I know that I am going to get all kinds of hate comments for saying this… but it’s the truth… so here it goes… First, it takes a lot of work to become a certified financial planner or any type of licensed investment professional. However, have you ever wondered why someone who is an expert at investing money charges you to invest your money? I mean, if they were so good at investing, why wouldn’t they just focus all their time on investing their own money? Hmmm… Well, I won’t speculate too much on that. Instead I’ll give you a couple options. If you are gung-ho about tackling your own financial destiny, then there are a ridiculous amount of free resources out there. There are all kinds of investing websites, blogs, resource centers, and videos all over YouTube that will give a ton of free information. Of course not all the information will be good, but that’s why you look at lots of stuff, to give yourself a balanced viewpoint. If you spend a little bit of money you can buy some great books that will take your learning ever further. But, let’s say you don’t want to learn about investing. You just want someone to take your money and invest it for you. You don’t want to deal with the hassles of watching the stock market everyday and worrying about what decisions the Fed is going to make. Well… if you fall into that category, there are a couple options for you... You can invest in a Vanguard Index Fund that has a fee of less than a tenth of a percent. These index funds perform very well and charge almost nothing for it. You can also invest in a service like Betterment or Wealthfront. These are basically robo-advisors and will take all of the complicated investing strategies out of your hands, in a good way. However… here is the bottom-line: If you don’t get a financial advisor (whether it’s you, an index fund, a robo-advisor, or an actual human), you will be seriously jeopardizing all of the hard work that you are doing. I write several times a week about investing and wealth building, all for free. I fortunately realized at a younger age that I was the only person who was going to save my financial situation - so I did something about it, and it’s worked great. ",
            "date": "Answered December 16, 2016",
            "views": "63",
            "upvotes": " View 145 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Chris Whitman",
                    "user_href": "/profile/Chris-Whitman-20"
                },
                {
                    "user_id": "Tamika Burns",
                    "user_href": "/profile/Tamika-Burns-1"
                },
                {
                    "user_id": "Karen Nelson",
                    "user_href": "/profile/Karen-Nelson-53"
                },
                {
                    "user_id": "Jagmohan Chawla",
                    "user_href": "/profile/Jagmohan-Chawla-1"
                },
                {
                    "user_id": "Charls Joseph",
                    "user_href": "/profile/Charls-Joseph"
                },
                {
                    "user_id": "Juan Pablo Bárcenas",
                    "user_href": "/profile/Juan-Pablo-Bárcenas"
                },
                {
                    "user_id": "Vlad Nutovich",
                    "user_href": "/profile/Vlad-Nutovich"
                },
                {
                    "user_id": "Bruno Guardia",
                    "user_href": "/profile/Bruno-Guardia-1"
                },
                {
                    "user_id": "Mike Williamson",
                    "user_href": "/profile/Mike-Williamson-109"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/Peter-Fox-220"
                }
            ]
        },
        {
            "author_info": {
                "name": "Andres Garcia-Amaya, CFA",
                "href": "/profile/Andres-Garcia-Amaya-CFA"
            },
            "answer_text": "I get this question a fair bit since for years I consulted thousand of financial advisors across the country. Deciding when you should get an advisor depends on a number of different factors such as life stage, age, income, how busy you are among others. To help give you an idea, I’ve taken a couple of difference personal profiles from my blog - see which is closest to you and use that as a starting point. Sarah - single, 24 years old  Does Sarah need a Financial Advisor? No Sarah is young, has no debt, no dependents or partner and she is saving every month. Instead of spending the $1,000 she might spend on an advisor, she should contribute this amount directly towards building an emergency fund. If she wants to get more organized, she can download our free budget excel spreadsheet, use free online finance software options like Mint and read our free guides to educate herself as her life stage starts to change. Michael and Stephanie – engaged, both 29 years old  Do they need a Financial Advisor? Maybe After they marry, their individual finances merge, and considering the number one cause for stress in relationships is money, a great financial advisor can help set some good financial habits as a couple from the start. At this stage, there is probably no need to hire an advisor that manages their investments, as most of their savings are in their current 401k plans. Getting a one time fee financial plan or hiring an advisor on a retainer is probably best in their case, since their investable assets are below $50,000. The advisor’s expertise should include holistic financial planning for young couples, consolidation of student loan debt and counsel on short term goals such as buying a house and building a more robust emergency fund. Mark and Kerry – married with 1 child, Mark is 34 and Kerry is 32  Do they need a Financial Advisor? Yes, they can definitely use one! Mark and Kerry could use a great advisor that can help them with their budgeting and debt consolidation. They are in dire need of saving towards an emergency fund before they even get started on student loan repayments or retirement planning. Considering that they have a young child, the advisor can also help them find the appropriate coverage of their term life insurance. Steve and Jon – married with 1 kid, Steve is 45 and Jon is 40  Do they need a Financial Advisor? Yes, for investment advice Steve and Jon have their monthly expenses well under control, but they could use a financial advisor that has strong experience in retirement planning and investments. A great advisor can improve their haphazard portfolio by incorporating their personal risk tolerance and goals to construct a portfolio with realistic return expectations. He or she can also examine the investment fees and investment taxes that they are currently paying to ensure they are being cost and tax efficient. Lastly, a great advisor can educate Steve & Jon on the importance of setting up a Power of Attorney and a Will and can connect them with the right Estate Advisor to do so. Dave and Claire – married with 2 kids, Dave is 55 and Claire is 54  Do they need a Financial Advisor? Yes Yes, Dave and Claire should look for a financial advisor that has strong experience in retirement planning and investments. A great advisor can help them take a more strategic approach to their investment portfolio by analyzing their risk tolerance and adjusting the risk/return profile of their portfolio. He or she can help them set realistic expectations of the income they will receive when they retire in 10-12 year’s time. The advisor can also educate them on the importance of, and the steps involved in, setting up a proper estate plan. Perhaps you can relate to one of our profiles? Perhaps not. The point however is that no matter what life stage you are in, you can always use some help improving your situation. But that does not mean that everyone should hire a financial advisor! When your money is more valuable than your time, which tends to be when you are younger and have less income, it might make more sense to educate yourself on how to develop good saving habits, rather than doling out money to hire an expert. As your income rises and your life becomes more complicated (in a good way) with marriage, children, home ownership etc., time becomes a scarcer resource and it might make more sense to outsource the task of the household CFO by hiring someone to help you. To figure out where you stand, we offer a free financial assessment with our director of financial planning. He can assess whether or not you need any professional help and, if so, discuss the most important areas and who would be best suited to help you. To check out the full bog series, click here. ",
            "date": "Updated October 23, 2017",
            "views": "32",
            "upvotes": " View 14 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Christine Light",
                    "user_href": "/profile/Christine-Light-12"
                },
                {
                    "user_id": "Christopher VanLang",
                    "user_href": "/profile/Christopher-VanLang"
                },
                {
                    "user_id": "Keith Mmipi",
                    "user_href": "/profile/Keith-Mmipi-1"
                },
                {
                    "user_id": "Sébastien Ho",
                    "user_href": "/profile/Sébastien-Ho-1"
                },
                {
                    "user_id": "Ashley Foster",
                    "user_href": "/profile/Ashley-Foster-62"
                },
                {
                    "user_id": "Kay Hitchcock",
                    "user_href": "/profile/Kay-Hitchcock-1"
                },
                {
                    "user_id": "Andelfo Garcia",
                    "user_href": "/profile/Andelfo-Garcia"
                },
                {
                    "user_id": "Astrid Amaya",
                    "user_href": "/profile/Astrid-Amaya-1"
                },
                {
                    "user_id": "Robert Mugen Williams-Taylor",
                    "user_href": "/profile/Robert-Mugen-Williams-Taylor"
                },
                {
                    "user_id": "Alejandro Garcia-Amaya",
                    "user_href": "/profile/Alejandro-Garcia-Amaya"
                }
            ]
        },
        {
            "author_info": {
                "name": "Chris Grande",
                "href": "/profile/Chris-Grande-2"
            },
            "answer_text": "I think everyone can benefit from some advice. And at every level, there is an adviser with a client profile that matches. For example, some advisers help people on the low end with debt elimination or starting a savings plan. On the other end, there are ‘family offices’ that manage the entire financial situation for 1 or a few wealthy families (depends on the wealth). If you have significant wealth, I would absolutely recommend that you interview advisors to get an idea of the value they can add. In fact, I just answered a Quora question that asked: What value does a “financial plan” add to your life? (link). I also decided to answer it via a Youtube video HERE because I thought it was something I wanted to rant about a bit! The point behind my answer was that many people don’t really understand all the different things that a comprehensive adviser team would look out for for you. Furthermore, some people prefer to delegate financial management for this reason, and because they have better things to do with their time. One Cautionary Step to Take The one thing that you could do that might cause you problems is giving any advisor (financial, lawyer, etc) custody of your assets. In this I mean, the ability to actually cash out and direct your money as you would. I don’t accept this responsibility from clients - always leaving to them the final decision on spending, cashing out etc. This also offers the clients a layer of protection and it’s how Madoff made off with the funds. It’s ok to allow ‘investment discretion,’ meaning the advisor can buy and sell investments (require an ok though on anything that isn’t ‘standard’) but not full custody where they could withdraw funds without your approval. Helpful Guide I created a helpful guide to give people some assistance on choosing the best advisory relationship for them, if having a relationship at all would be a good fit. It works through such factors as your personality type, advisor types, compensation, etc. You can request that HERE. And in case you are wondering, if you follow the guide, there is a 85–90% chance it will tell you NOT to work with someone like me:) ",
            "date": "Answered May 17, 2019",
            "views": "69",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Omar Francisco",
                    "user_href": "/profile/Omar-Francisco-2"
                }
            ]
        },
        {
            "author_info": {
                "name": "Don Shaughnessy",
                "href": "/profile/Don-Shaughnessy"
            },
            "answer_text": "People tend to be their own worst enemy when it comes to finance. An advisor may know little more than the client knows about some aspects of the situation, but they are more objective. They help the client control their inevitable emotional responses to both good and bad financial news. They help the client stay focused on their goals. They help the client avoid goal destroying diversions. They provide context for surprises. Clients need financial tools. Tools are methods distilled from experience into a product. Things like life and disability insurance, investment vehicles and information about the containers they fit within. Tax deferred, or not being common. They help with arithmetic decisions like pay debt or invest in a deferred income plan. They help with assessing the financial environment. When it is your business to keep up, you do it. Most clients have their own important things to keep up with. Advisors share information about the environment. Context for decisions. Advisors have hundreds of people trying to do more or less the same thing. Some have already gotten to their goals. Advisors can connect theory to observed outcomes. Think of an advisor as someone who can keep you in touch with your goals,aware of trends and change,focused,motivated,communicatingchanging for the better as things around you change,emotionally centered andlearningMost of all advisors have access and know about more tools than the client. Always true. The facts don’t matter as much as the emotional support and guidance as to the context of your particular situation. Tools come along as needed. ",
            "date": "Answered August 1, 2019",
            "views": "105",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Omar Francisco",
                    "user_href": "/profile/Omar-Francisco-2"
                },
                {
                    "user_id": "Raymond Cleboski",
                    "user_href": "/profile/Raymond-Cleboski"
                }
            ]
        },
        {
            "author_info": {
                "name": "Pam Krueger",
                "href": "/profile/Pam-Krueger"
            },
            "answer_text": "Personally, I would want to work with an advisor when I feel like it’s time to get serious about organizing my whole financial life and/or to invest like I mean it. You may seek out professional advice because you simply want to look at your cash flow or you might want someone with whom you can collaborate or you may want to turn over the portfolio management to someone else. This could happen when you’re young and your financial life isn’t complicated and you want to get the planning off on the right track, but more likely as you get into your 40’s and 50’s when your savings starts to pile up and you’re anticipating retirement. At that point, that’s when an excellent advisor can add tremendous value by helping you make informed decisions about investing, taxes, family issues or about your business. The key is who? Number one, an advisor must be willing to take full fiduciary responsibility for his advice, and put that in writing. No one working for a brokerage firm or insurance company can accept that level of accountability. That means you have to find the right fiduciary advisor, or planner, who is independent and will work only and directly for you. And that individual advisor must be able to demonstrate competency. This is the whole reason I developed Wealthramp to simplify the search for vetted, fiduciary advisors. When you’re ready to work with an advisor he or she will help you invest and keep your fees as low as possible, and to the extent you want to learn, your advisor should be happy to educate you all along the way so you can operate with knowledge and confidence. ",
            "date": "Answered May 17, 2018",
            "views": "150",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Steve Adcock",
                "href": "/profile/Steve-Adcock-1"
            },
            "answer_text": "Probably when you no longer feel comfortable with that financial advisor. If you feel like you’re being screwed over by a financial advisor, that’s probably a good sign that you need to start looking for other options. Usually, you’ll get that gut feeling that something isn’t right, but sometimes it’s pretty obvious, too: If the advisor doesn’t return your callsIf the advisor’s advice isn’t tailored to YOUR specific situationIf the advisor doesn’t ask what your future goals areOr, if the advisor’s advice just plain stinksFrom my article (linked above) on this subject: To get the very best financial advice from advisors, you need to do two things: Get 2nd, 3rd, and 4th opinions; visit every advisor in town if need be.Don’t show any advisor what the other advisors recommended.It does not matter if the Advisor is a CFP, Fiduciary, Registered Representative, Hybrid, Fee-Only, or whatever. They all have one goal: they want you to work with them and not someone else and there is not a credential or compensation method that is any more or less impartial or fundamentally more altruistic. Advisors do this exceptionally well, and that’s to pick apart someone else’s work. If you go into a meeting with an advisor and the previous advisor recommended ABC funds, well then, you are about to get a lesson on why ABC funds are the “great Satan”. Ask every advisor to design what they believe is the best plan possible, then you can take all the plans and compare the pros and cons of each on your own. If an advisor really has your best interest at heart and knows the best way to help you reach your goals, they should have no issue with putting their best foot forward without knowing what everyone else in town is recommending. ",
            "date": "Answered December 21, 2018",
            "views": "185",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Mohammed Azharuddin",
                    "user_href": "/profile/Mohammed-Azharuddin-96"
                },
                {
                    "user_id": "Ron Leavitt",
                    "user_href": "/profile/Ron-Leavitt"
                }
            ]
        },
        {
            "author_info": {
                "name": "Doug Mewhirter",
                "href": "/profile/Doug-Mewhirter"
            },
            "answer_text": "First of all, if you are seriously asking, that might be the first clue! Other reasons (of many) to seek another financial advisor may include the following: The financial advisor relies on commissions for more than 10% of his revenue. Your advisor should preferably be “fee only.”You don’t understand how your advisor is investing your money.(Really 2a) When you ask her to explain how your investments are handled, your advisor is either unable or unwilling(!) to explain the program in plain english to your satisfaction.Your advisor is a “hammer in search of a nail,” and will force his “solution” to fit everyone’s “problem.”Your advisor cannot adequately explain the growth (or lack thereof) in the context of your overall financial plan.She did a comprehensive financial plan, right? Right?Your financial advisor does not 100% act in a fiduciary capacity. This is a very specific word…they can’t legally say “fiduciary” if they don’t meet very specific standards.Your advisor holds your money. This is a HUGE red flag. A reputable financial advisor will NEVER have direct access to your money. It should be kept at a 3rd party custodian, such as Schwab, Fidelity, etc.Your advisor promises high returns. Another big red flag.(Related to #4 above). Your advisor pushes hard to sell you variable annuities, fixed indexed annuities, and/or whole life as the answer to all of your financial problems. In reality, these “products” (which pay huge up front commissions to the “advisor”) are only useful in very few, very specific circumstances.Your advisor cannot show you exactly how he is compensated, to the penny.I’m sure that there are many more, but, if even one of these pops up, I would seriously consider looking for another advisor. ",
            "date": "Answered December 26, 2018",
            "views": "108",
            "upvotes": " Answer requested by Mariann Williams Bennett",
            "upvoters": [
                {
                    "user_id": "John Smith",
                    "user_href": "/profile/John-Smith-15528"
                },
                {
                    "user_id": "Eashan Roy",
                    "user_href": "/profile/Eashan-Roy"
                }
            ]
        },
        {
            "author_info": {
                "name": "Michael LeBoeuf",
                "href": "/profile/Michael-LeBoeuf-4"
            },
            "answer_text": "You should talk to a financial advisor if you believe you need one, but be very, very careful. The only thing required to declare one’s self as a financial advisor is a suit and a sales pitch. Be wary of stockbrokers, insurance salesmen and especially somone trying to sell, annuities, limited partnerships and other so-called, “investments.” They will tell you that they want to make money for you, but most of the time their true purpose is to make money from you. Do not invest in anything that you don’t understand or can’t explain to a 12-year-old. Your best defense is to learn the simple basics of money management and follow them. Read a good book or two on the subject. If you know a CPA or someone well versed in financial planning, ask them for reading suggestions. Here are the simple basics to get you started. It begins with saving a part of every paycheck. Good luck. 9 Simple Money Rules All On 1 Index Card P.S. - One more bit of advice: Get your financial planning advice and financial products from different sources. The first rule of expert advice is, “Never ask the barber if you need a haircut.” 😀 ",
            "date": "Answered September 19, 2020",
            "views": "17",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Rajyashree (Raji) Tripathi",
                "href": "/profile/Rajyashree-Raji-Tripathi"
            },
            "answer_text": "In college or as soon as you get your first job, take some courses on personal finances. Learn how the stock market works, different types of investments out there, importance of knowing your risk tolerance, and diversifying your investment portfolio, the benefits of sticking out long enough to reap rewards, not buying and selling with every hiccup and burp in the market, and, most importantly, fully partcipating in your employer-sponsored/tax-deferred 401(k) Plan. Even better, if you get matching contribution from your employer. Then, learn to budget, stay within your means, stop impulsive buying and getting in debt. Save for vehicles or get manufacturer's deals 0% for 5 years or cash rebate. When you buy a home, opt for a 15-year mortgage. If you get a 30-year loan, add an extra couple of hundred dollars towards principle to reduce the loan term, and save a ton in interest payments. Most significantly, stay away from HELOCs unless the sole purpose of borrowing money against your home is for putting it bavk in the house--for home improvement. Many fall in the trap of using HELOC as a GIANT CREDIT CARD. You are set for an early retirement. However, as you plan and save, don't forget to enjoy life. There are no guarantees life. ",
            "date": "Answered November 14, 2019",
            "views": "274",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Hari Pandit",
                    "user_href": "/profile/Hari-Pandit-1"
                },
                {
                    "user_id": "David Cardoza",
                    "user_href": "/profile/David-Cardoza-3"
                }
            ]
        },
        {
            "author_info": {
                "name": "L&T Mutual Fund (L&T Investment Management)",
                "href": "/profile/L-T-Mutual-Fund-L-T-Investment-Management"
            },
            "answer_text": "Once you have identified the area of your finances you want to improve, you should think about whether you can realistically manage that issue on your own. You need to ask yourself these three basic questions: Do I have the time, patience and interest in educating myself about personal finance topicsDo I have the technique, or technical knowledge, to understand how to avoid mistakes and leverage the best financial strategies?Do I have the temperament to make wise financial decisions without outside advice or counsel? Can I make investing decisions without letting emotions drive my decision making?If you cannot clearly answer the above questions, then you should absolutely consider getting a financial advisor. This information is for general information only and does not have regard to specific investment objectives, financial situation and the particular needs of any specific person who may receive this information. L&T Investment Management Limited, the asset management company of L&T Mutual Fund or any of its associates; does not guarantee / indicate any returns / and shall not be held liable for any loss, expenses, charges incurred by the recipient. The recipient should consult their legal, tax and financial advisors before investing. Recipient of this information should understand that statements made herein regarding future prospects may not be realized or achieved. Mutual Fund investments are subject to market risks, read all scheme related documents carefully. ",
            "date": "Answered July 28, 2020",
            "views": "39",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Adam Fayed",
                "href": "/profile/Adam-Fayed"
            },
            "answer_text": "Have a process! For everybody reading this, I would say you should narrow down your investment and financial planning needs to 5-10 core things, probably 5-6 at best. You don’t need to focus on other objectives. I would suggest you focus on the following things. Some of these things will apply for you, and some won’t depending on your situation. Some apply to all: 1). Focus on getting at least a middle-income job. Whilst it is easier than you think, in fact very easy, to become financially free and/or a multi-millionaire on a middle-class income, it isn’t easy to become financial free if you are unemployed of course or don’t have an online income or another form of income. For people who are 18 or very young, getting the skills needed to earn must be priority number 1. 2). Watch your spending habits. They matter more than your income. This applies to everybody, full stop. 3). Read the academic evidence with an open-mind on finance, including then reasons why DIY investors tend to fail. Knowing the evidence isn’t good enough.Doctors know you shouldn’t smoke, be fat or drink, but most of them do at least one of these habits! Most people in financial services also struggle with these `human nature issues`. Be very candid with yourself. Do you have the needed character to face the challenges of becoming financial independent? If you can’t face volatility for example, or are the type of person who easily panics or gets greedy, it would be better to delegate this task to a professional. 4). Don’t ignore wealth protection. Health insurance isn’t needed if you are in many European countries, but it is needed in countless others. Life cover and income protection can be very useful, depending on your specific circumstances. Protection is dead money if nothing happens so limit yourself to a small fraction of your income on these products but don’t neglect them entirely. 5). Take advantage of tax efficient structures. If you are British living in the UK, that means using ISAs. If you are British living overseas, that may mean investing in SIPPS and so on. The same applies to Dutch, Americans and many other citizens. Depending on your nationality and residency, make sure you take advantage of tax-efficient structures. 6). After you retire, don’t withdraw more than 4% of your portfolio per year. If you don’t follow this rule, you risk either running out of funds or your kids may not get the inheritance hoped for. To simplify matters further you could reduce this to just 2-3 steps: Read the academic evidence including evidence on investing, tax efficient structures, wealth protection and why DIY investors failGet a middle-income (average) or better job if you don’t alreadyThen decide if you want to DIY or use a professional to help you. Especially read the evidence on why DIY investors fail and why even those who read the evidence don't usually implement it - Does DIY investing work?Of course simple and easy are two different things. Knowing something isn’t as complicated as it first seems, however its great to imagine a better and more stress free future. ",
            "date": "Answered July 4, 2018",
            "views": "179",
            "upvotes": " View 2 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Emre Buruk",
                    "user_href": "/profile/Emre-Buruk-1"
                },
                {
                    "user_id": "Vishesh Supariwala",
                    "user_href": "/profile/Vishesh-Supariwala"
                },
                {
                    "user_id": "Ivan Gautama",
                    "user_href": "/profile/Ivan-Gautama"
                },
                {
                    "user_id": "Calvin Yang",
                    "user_href": "/profile/Calvin-Yang-25"
                },
                {
                    "user_id": "Yini Ch",
                    "user_href": "/profile/Yini-Ch"
                },
                {
                    "user_id": "Jeet Kewalramani",
                    "user_href": "/profile/Jeet-Kewalramani"
                },
                {
                    "user_id": "Vasudev Krishna",
                    "user_href": "/profile/Vasudev-Krishna-4"
                },
                {
                    "user_id": "Martin Stabler",
                    "user_href": "/profile/Martin-Stabler"
                },
                {
                    "user_id": "Christos Miltiadous",
                    "user_href": "/profile/Christos-Miltiadous-1"
                },
                {
                    "user_id": "Kaushal",
                    "user_href": "/profile/Kaushal-90"
                }
            ]
        },
        {
            "author_info": {
                "name": "Hayden Burrus",
                "href": "/profile/Hayden-Burrus-1"
            },
            "answer_text": "As you can see by the other answers, people define financial advisor to mean lots of different things. If you define “financial advisor” as a person who takes your money and invests it for you then I like Cody Shirk ‘s answer the best. The only commentary I have on that is that he implies that managing investments is the only thing that CFP’s and other financial advisors do for their clients. A good financial advisor provides so much more than investment management. Investment management is an incidental service for good financial advisors. Good financial advisors do the following: Prepare a finaContinue Reading",
            "date": "Answered December 24, 2016",
            "views": "0",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Josh Scandlen",
                "href": "/profile/Josh-Scandlen"
            },
            "answer_text": "man, do I ever wish I could answer this question easily. But because there are so many daggum “financial advisors” out there, it’s tough. If your “financial advisor” is just going to manage your investments, you shouldn’t hire one. They add no value. Yes, some will argue they keep you from making big emotional mistakes, i.e., keep you from selling when the markets are down and buying when the markets are high, but I haven’t seen that behavior as much as people like to claim it exists. Just make sure you stay the course for your investments and you’ll be fine. Secondly, if the ‘financial advisor’  Continue Reading",
            "date": "Answered August 9, 2018",
            "views": "0",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Fredric Garms",
                "href": "/profile/Fredric-Garms"
            },
            "answer_text": "I didn’t hire an advisor until five years before I retired. The amount had grown to a point where I decided to find an advisor to manage it more efficiently than me. It was definitely the best decision I ever made. I put my pride aside and knew that this firm specialized in people in retirement or close to retirement. It’s like going to a doctor or dentist when you need help. Since I hired them they have grown the account significantly. They are a fee only investment firm. That means they make more money when I make more money. If the market goes south and I make less money, they make less mon Continue Reading",
            "date": "Answered June 10, 2020",
            "views": "0",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Ray Skwarek",
                "href": "/profile/Ray-Skwarek"
            },
            "answer_text": "Probably most people will tell you to do it sooner rather than later. And I can’t refute that advice except to say if you want to get much personalized service from an advisor you need to have at least $100K-$200K to invest. My response to you is instead of trying to determine when to get a financial advisor, instead focus on educating yourself on investments. Build a few virtual portfolios for yourself and see how they do over the next few years. if you are knowledgeable and educated on investments, you will be better positioned to decide if and when you may want to consider an advisor, and mor Continue Reading",
            "date": "Answered July 25, 2020",
            "views": "0",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Joshua Wilson",
                "href": "/profile/Joshua-Wilson-211"
            },
            "answer_text": "When you are starting to earn enough to make decisions on where your money is going. If you are very successful, that’s probably in your 20’s to early 30’s. The sooner the better. Robos are a nice start to just get in the habit of saving, but other than that, they are limited if you want real advise. Also, all of the robos started in business after the financial crisis. So their track records were all made during an amazing bull market when it’s been easy. They all stay invested all the time, so if you are worried about a stock market crash, they aren’t for you. Look for a fee-only advisor, not  Continue Reading",
            "date": "Answered May 2, 2018",
            "views": "0",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Norman D. Pappous",
                "href": "/profile/Norman-D-Pappous"
            },
            "answer_text": "David Bruno’s answer is one I would agree with so this answer is only provided to supply some more texture. Do you have resources that will affect the way other people will be able to live? If it is you alone and you fit into the typical profile of a 28 year-old just starting a 401k, then I would send you to Vanguard. However if your financial resources will be used to affect the quality of life for your parents, spouse, children, employees or a charity you may want to fund - then you may wish to consult with a financial advisor. We have two mantras at Grade My Advisor - Welcome Your portfolio’s bContinue Reading",
            "date": "Answered May 30, 2016",
            "views": "0",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Ross Ledehrman",
                "href": "/profile/Ross-Ledehrman"
            },
            "answer_text": "You should get one if you have the intellectual ability to challenge a financial advisor on his work, yet do not have the time to do the work he’s supposed to do. This is regardless of your income and savings. One could argue, that you could apply that to all subjects, but I believe finance, in regards of other subjects, like law and medicine is a much easier subject to learn and while I would trust a doctor while he’d be operating me, when a financial advisor gives ‘advise’ I would not trust this unless I know what he’s talking about. ",
            "date": "Answered August 20, 2018",
            "views": "29",
            "upvotes": " View 19 Upvoters"
        },
        {
            "author_info": {
                "name": "David Phillips",
                "href": "/profile/David-Phillips-491"
            },
            "answer_text": "You should have a financial advisor as soon as you land a good py paying job.  The most important thing you can do when you get a job, is to start saving money.  A financial advisor will help you invest in a variety of investments, such as stocks, bonds, u mutual funds and CDs. (certificates of deposit). Start out small saving around 4% of your take home pay, and then increase as you get raises and promotions on your job(s).  Keep doing this until you are saving around 15% or more of your take home salary, The best savings vehickle vehicle is an IRA (individual retirement account) as there are Continue Reading",
            "date": "Answered July 28, 2020",
            "views": "0",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Nancy Henker",
                "href": "/profile/Nancy-Henker"
            },
            "answer_text": "Maybe never. No one cares as much about your future or your money than you do. You must look out for yourself, whether or not you have “advisors.” Advisors make money off of you. Many work for banks and companies that just want to sell you stuff. Most have some razzle-dazzle charts that they misrepresent or misinterpret to wow the uninitiated. Most have some financial formula that “works over time” but may not work for your lifetime. Ask hard questions, like “Show me how this worked during the recession.” If they scowl, RUN! ",
            "date": "Answered January 29, 2020",
            "views": "66",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Guzman Safon",
                "href": "/profile/Guzman-Safon"
            },
            "answer_text": "When you need financial and investing help. Let’s say that you have a good living including saving some money. Many people say “oh just buy a Vanguard small cost fund or ETF”. I’ve met many people that don’t know what you’re talking about and don’t have the time nor will to learn it. That person needs an advisor, maybe not a permanent one, but at least one consultation to clarify some things. You may need help in organizing your budget, tax and financial strategies, insurance, retiring, wealth protection, etc. The definition of needing financial help varies between people, of course. I’ve met middle Continue Reading",
            "date": "Answered August 9, 2018",
            "views": "0",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Michael Minter",
                "href": "/profile/Michael-Minter-16"
            },
            "answer_text": "Not everyone needs a financial advisor. As a financial advisor , I know I can't help every prospective client who comes through the door. For individuals who aren't particularly interested in the topic of investing, the amount of research required to feel comfortable investing may be prohibitive. It is not uncommon for high-earning individuals to be sitting on a few hundred thousand dollars in a bank account, simply because they didn't know what to do with it. Depending on your comfort level with investments and the time you're willing to devote to it, it may be worthwhile to explore working with Continue Reading",
            "date": "Updated April 2, 2019",
            "views": "0",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Brian C. Beasley",
                "href": "/profile/Brian-C-Beasley"
            },
            "answer_text": "Keep it simple. Hire an advisor when the value you receive from them exceeds their fee. An advisors value could be numerical (cost savings, tax savings, or risks mitigated). Their value might be more difficult to quantify, like time saved or peace-of-mind. What's most important is that you get what you value for a reasonable cost. Consider searching for advisors that fit your needs, interview them, and then you may have a better idea. If their potential value doesn't justify their fee, move on. ",
            "date": "Answered July 30, 2019",
            "views": "150",
            "upvotes": "0"
        }
    ]
}