{
    "title": "How to get book reviews as a new author - Quora",
    "tags": [
        "Book Reviews",
        "Book Publishing",
        "Publishing",
        " Reviews",
        "Writers and Authors",
        "Literature",
        "Reading",
        "Writing",
        "Book Recommendations"
    ],
    "response": [
        {
            "author_info": {
                "name": "Shayne Laughter",
                "href": "/profile/Shayne-Laughter"
            },
            "answer_text": "When my novel came out from a small publishing house, I did what was mentioned by another here: researched book bloggers who posted reviews, queried them to get them interested in my book, and then mailed them a physical copy. These days sending a .pdf or giving free access to an e-book works just as well. If you have the money, you can pay for a review at three popular web sites: Kirkus Book Reviews, Sites, Romance, Fantasy, Fiction | Kirkus Reviews , BookLife - Resources and tools for book publishers and writers , which is connected with Publisher’s Weekly, and Foreword Reviews ( Get Your Book Reviewed ). WARNING: There is no guarantee that just because you paid for a review, you’ll get a good review. These paid reviewers are honest. Goodreads (The Goodreads Author Program ) lets you set up an author page to plug your books. People who by your book then post their own reviews, and are not paid for it. ",
            "date": "Answered July 31, 2019",
            "views": "82",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Tania Fey",
                "href": "/profile/Tania-Fey"
            },
            "answer_text": "I answered this because some authors send me a DM in Instagram, asking for book review and they'd send me ebook version of their book, for free. I only accepted once because the author is so kind. And I know some of our local author sent their physical book for free to who they think is worthy and would do a good review / having lots of followers. My friend got some, and it was okay I think. So maybe you guys as new author could join your local bookstagram community and choose some of them to read and write a review for your books. Good luck! :) ",
            "date": "Answered July 29, 2019",
            "views": "82",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "John Porter",
                "href": "/profile/John-Porter-218"
            },
            "answer_text": " Image from TeamGolfwell It isn’t hard. We do free book reviews and the requests we receive are all read but we only choose to read and review the books that interest us. The emails that are polite and not a form of mass email are best received by us. Tell us about yourself and be respectful and you will get more attention than the usual Dear Sir or Dear Reviewer or Hi that we receive too many of. We have been doing book reviews for several years now. Good luck and tell yourself it isn’t hard and be positive and happy about your book! Here is our book review link in the footnote[1]  Image from TeamGolfwell Footnotes[1] https://www.teamgolfwell.com/free-book-reviews.html",
            "date": "Answered May 4, 2020",
            "views": "62",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Henry Martin",
                "href": "/profile/Henry-Martin-16"
            },
            "answer_text": "I would suggest doing giveaways, reaching out to bloggers, and running a free book promo. Whatever you do, please do not spam readers, do not promote in readers’ forums, and do not hawk your books every chance you get. As a reader, unsolicited emails, messages, and posts just put me off. There are enough ‘authors’ doing that, and I will not consider their books even if the books sound interesting. ",
            "date": "Answered July 29, 2019",
            "views": "30",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Jeanette Ioannou",
                    "user_href": "/profile/Jeanette-Ioannou"
                }
            ]
        }
    ]
}