{
    "title": "How to get better at Judo - Quora",
    "tags": [
        "Judo",
        "Martial Arts"
    ],
    "response": [
        {
            "author_info": {
                "name": "Eric Meger",
                "href": "/profile/Eric-Meger"
            },
            "answer_text": "After 50 years with Judo a part of my life, I have some thoughts. The obvious answer is practice… but how much? Twice a week leads to slow but steady progress. Three times a week leads to much more rapid advancement of skills. To be a serious competitor requires cross training and additional focus on competitive skills under a sensei who has been a winner. But don’t forget to let your body rest and use your mind to reflect on what is working and what is not matching your expectations (hansei). Although I once made it to the US nationals I was never a serious competitor. You don’t need to win Shiai matches to get better at Judo or to gain life enhancing skills. Practice kata and techniques as well as randori. Kano (Judi’s founder) focused heavily on kata early, not just at grading time. Uchi kome practice is how you develop the skills for randori and shiai. You cannot gain the muscle memory you need without repetition and focus on the small corrections every technique requires. Learn and internalize the guiding principles of Judo: Jita Kyoei means mutual welfare and benefit. It means you help your Uke take the fall. You give them a chance to tap out of an arm lock. And you help each other to learn. This principle applies in all aspects of life. Sei ryoku zenyo means maximum efficiency with minimum effort. It means BEND YOUR KNEES. It means apply kuzushi FIRST (off balance your opponent). When a technique is done right it is almost effortless. You can FEEL the flow of momentum when you get it right. Pay attention to the small details of your body and your uke to find the Sei ryoku zenyo. One thing I love about Judo is that it is a sport of an inch or two. Put your foot HERE and it takes huge effort to complete the throw. Put it one inch further back or turn it 20 degrees to face the right direction and suddenly the throw becomes effortless. This is hard to teach. First learn the basics of each technique so it becomes one movement. Then you are ready to learn how it really works. Look for the placement and angle of the feet. Watch the flow of uke’s center of gravity through the whole throw. Tiny changes can make all the difference. Learn to be a good uke. Judo techniques and training are designed to allow you to fight at full force without getting hurt. That’s why we learn to fall first. Falling skills are far more likely to help you than tachi waza or ne waza. My falling skills have kept me out the hospital at least three times. When you good at falling you can relax in randori. Then you won’t telegraph your intentions through body tension. Your sword (body) becomes inscrutable as the zen master Munenori said. Show respect and demonstrate discipline. Bow properly (heels together, face forward, no slouching nods). Enter and leave the mat and bow in and out of class with your judogi neat and squared and your obi tied correctly. When not actively practicing, sit in seiza or cross legged and watch and learn. Genchi genbutsu means Go Look Go See. Resting does not mean learning stops. Never turn down a request to practice from a higher rank - they are trying to help you learn. In randori, practice with higher ranks or bigger judoka than you. You learn much more from someone better than you. As you advance, change this and share your knowledge with lower ranks too (jita kyoei). In ne waza (ground fighting), technique is equally important but they often do not have names. I have learned more from my current sensei about this in the past 3 years than in the past 30 years. Find a sensei who can explain what he or she is doing and why. Balance and leverage are even more important on the ground. Finally, pay attention to the fact that most judo techniques are defensive. Uke attacks, tori GIVES WAY, then takes control by applying kuzushi using uke’s momentum, fits in (tsuri) to restablish solid kyosei (balance in the presence of opposing tensions) and then applies the kake (complete the throw). These are all one smooth movement when fully learned. Learning to counter an opponent’s attack is essential once the basics of techniques have been absorbed. Judo is as much a philosophy as a martial art. It can influence all aspects of life and make you a more fulfilled and confident person. It has done that and more for me I hope you found these thoughts useful. ",
            "date": "Answered February 25, 2019",
            "views": "16",
            "upvotes": " View 7 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Fred Melo",
                    "user_href": "/profile/Fred-Melo-5"
                },
                {
                    "user_id": "Apen Ap",
                    "user_href": "/profile/Apen-Ap"
                },
                {
                    "user_id": "Orji Michael",
                    "user_href": "/profile/Orji-Michael-2"
                },
                {
                    "user_id": "Ronald Meltzer",
                    "user_href": "/profile/Ronald-Meltzer"
                },
                {
                    "user_id": "Omargeldi Atanov",
                    "user_href": "/profile/Omargeldi-Atanov"
                },
                {
                    "user_id": "Miguel Garcia",
                    "user_href": "/profile/Miguel-Garcia-52"
                },
                {
                    "user_id": "Viktor Milovanovic",
                    "user_href": "/profile/Viktor-Milovanovic"
                }
            ]
        },
        {
            "author_info": {
                "name": "Angel Plata",
                "href": "/profile/Angel-Plata"
            },
            "answer_text": "With 28 years in love with Judo this is my advice: Judo is not different from any other martial art or sport in this matter, only intense, continued practice and study can make progress in Judo, just to support my words take this video as I did, like the answer to most of my questions relate to Judo Masahiko Kimura  But to be more sensitive to your concerns, the uchi komi  practice is just wonderful to success, don't try to make yourself good many techniques, just pick one favorite (Tokui Waza), one to counter your opponents  resistance and one to counter their techniques (Kaeshi Waza). How to pick your favorite technique?, easy, don’t do it, let your Sensei to take one the suits you, is simple to pick any one that impress you or others, but the thru is that maybe the right one for you, is not the one you like, but once you give it a chance and strain yourself really hard, to make it your favorite technique, you’ll find the soft way.  And best of all Sensei's are just humans and can be wrong, but it's easier for him to evaluate the error and give you another technique because he can see at both, you and your opponent, and he have more experience than you. There are times when you get frustrated because you feel that you are not progressing or your strategy is not working with a particular opponent, in these moments increase your body resistance, do more repetitions and try work on principles, for example: “The inner circle”, you can give your entire life to only this principle and won’t be a waste of time and just one, but the one.  You’ll be always progressing inclusive when you don’t feel it, keep training ",
            "date": "Answered January 29, 2016",
            "views": "25",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Adam Lat",
                    "user_href": "/profile/Adam-Lat-3"
                },
                {
                    "user_id": "Nicholas Varela",
                    "user_href": "/profile/Nicholas-Varela-4"
                },
                {
                    "user_id": "Bob Lefevere",
                    "user_href": "/profile/Bob-Lefevere"
                },
                {
                    "user_id": "Max Loh",
                    "user_href": "/profile/Max-Loh"
                }
            ]
        },
        {
            "author_info": {
                "name": "Lesley Harrison",
                "href": "/profile/Lesley-Harrison"
            },
            "answer_text": "The only way to really improve it to train under a good instructor. Ideally you should be doing a combination of compliant drilling and randori - pick a couple of techniques, drill them extensively and apply them in randori too, then when you've built up muscle memory try another set of techniques, and so on, until you're confident in a few different ones. You need to train regularly to improve - it will take a long, long time to get even a basic level of competence if you're training only once a week. If you increase that to twice a week, you'll make progress much, much faster. Three times a week seems to be the optimum for someone training recreationally who wants to do a bit of competition - you make progress faster, your fitness levels improve faster, and you still have plenty of time to rest/recover and stay on top of any family/social/study/work commitments you might have. It helps to train with a range of abilities - you learn a lot whether you're training with a relative beginner or someone much better than you. Get as much exposure to different styles and body types as you can and as much time on the mats as you can. ",
            "date": "Answered February 22, 2015",
            "views": "15",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Nahuel Calderara",
                    "user_href": "/profile/Nahuel-Calderara"
                }
            ]
        },
        {
            "author_info": {
                "name": "Lewis Nakao",
                "href": "/profile/Lewis-Nakao"
            },
            "answer_text": "Don't miss practice. After practicing so long, I found that you will not see the improvements immediately, but I suddenly found myself better after so long; probably after high school. It's tough when the people you practice with continue to beat you the same way, but they're likely getting better as well. I eventually briefly started teaching judo and saw that judo is not easily grasped; however, those who kept showing up improved. The learning curve is steep where physical strength and endurance will only take you so far, which makes the path to mastering judo that much more frustrating. That said, I understood why people stopped showing up. However, the whole process teaches you how to lose and I think that's the most important because it teaches discipline and respect for those who stick it out. ",
            "date": "Answered February 24, 2015",
            "views": "1",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Ed Lam",
                    "user_href": "/profile/Ed-Lam-8"
                }
            ]
        },
        {
            "author_info": {
                "name": "Roy Javelosa",
                "href": "/profile/Roy-Javelosa"
            },
            "answer_text": "The best quote I can think of to help you improve is “Practice puts brains in your muscles” I forgot where I read it but it is very true specially in Judo. You only have a split second to react to the opponents shift in body movements force and direction, so having the muscle memory to correctly react to a given situation is very important. (when to attack or counter) Also do not just practice for the sake of practicing, what I mean is be conscious of your form and understand the fundamentals and purpose of each technique. If your a beginner focus on uchikomi and your entry techniques, solo and with a partner and have someone to comment on your form and technique. ",
            "date": "Answered August 31, 2016",
            "views": "739",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Marcos Vinicius Monteiro",
                "href": "/profile/Marcos-Vinicius-Monteiro"
            },
            "answer_text": "Apart from the obvious answers (practice as much as you can, with as many people as you can, as seriously as you can), I'll give you a weird one, but which helped me a bit: Study Japanese. At least, study the meaning of the throws in Japanese. It helped me a lot to think of things as \"Reaping - Hip - throw\" (Harai-Goshi), for example. And the obvious things, the difference between a \"Barai\"/\"Harai\" (a sweep) and a \"Gari\" (a reap), or \"If there is 'Koshi/Goshi', I must use the hip. If there's 'Seoi', the opponent must pass through my back\", etc. It even helped my double-leg, in jiu-jitsu. \"Morote-Gari\" (a \"Gari\" - reap - using both \"moro\" hands \"te\"), for me, is almost a short explanation. And I got that with a couple of days of searching for words and meanings, I'm not talking about years of serious grammar study. Try and see if it works! ",
            "date": "Answered January 10, 2016",
            "views": "559",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Timo Sivula",
                    "user_href": "/profile/Timo-Sivula"
                }
            ]
        },
        {
            "author_info": {
                "name": "Shannon Sofield",
                "href": "/profile/Shannon-Sofield"
            },
            "answer_text": "Find a good uke. A training partner with no ego who understands that being thrown is as important as throwing. One who understand that being stiff as a board is not helping either of you. There is a saying, \"the hardest person to throw is a white belt\". That is because they are purely defensive and petrified to get thrown. Neither tori or uke will improve in this scenario. ",
            "date": "Answered February 24, 2015",
            "views": "11",
            "upvotes": " View 3 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Ed Lam",
                    "user_href": "/profile/Ed-Lam-8"
                },
                {
                    "user_id": "Leia Hok",
                    "user_href": "/profile/Leia-Hok-1"
                },
                {
                    "user_id": "Nick Layon",
                    "user_href": "/profile/Nick-Layon"
                }
            ]
        },
        {
            "author_info": {
                "name": "Tom Wetz",
                "href": "/profile/Tom-Wetz"
            },
            "answer_text": "I dont have sufficient experience in Judo to directly answer your question but it applies to some problems I had worked my way through quite recently. I was struggling for a long time with my spinning hook kick (ill spare you the korean translation). So ive decided one day that I have to get this kick right. From that point on whenever my teacher would instruct us to practice this kick, I would sit back and observe the other practitioners in my dujo do it. And I've emphasized observe because I havent just looked at them with tears of jealousy rolling down my cheek, I would put in the mental effort of analyzing everything they do, from the beginning to the end of the kick. Ive asked them why they do things the way they do (e.g \"why do you lift your elbow to shoulder height\"), and after a while I would apply what ive learned to my kick. To this day, one of my strongest and most accurate kicks is the Dwi Huryeo Chagi, also known as the spinning hook kick. ",
            "date": "Answered January 10, 2016",
            "views": "625",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "James Kerr",
                "href": "/profile/James-Kerr-34"
            },
            "answer_text": " The first thing I did when I moved to Japan as a young man was join the judo club. I thought I could use my size and strength to overpower all of the students. I was wrong. When people ask what it's like to learn judo, I tell them the truth:  It's like dirty laundry. When you change clothes, you just take it off and toss it across the room.  That's what judo is like - except you are the laundry :) So to improve your judo, look for the strongest, meanest, biggest students in class and practice with them. Enjoy! JKerr  ",
            "date": "Answered January 9, 2016",
            "views": "601",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Timo Sivula",
                    "user_href": "/profile/Timo-Sivula"
                },
                {
                    "user_id": "Aaron Shbeeb",
                    "user_href": "/profile/Aaron-Shbeeb"
                },
                {
                    "user_id": "M Markus Harrison",
                    "user_href": "/profile/M-Markus-Harrison"
                }
            ]
        },
        {
            "author_info": {
                "name": "Phua Ming Weii",
                "href": "/profile/Phua-Ming-Weii"
            },
            "answer_text": "Do your motions slowly. As slow as you can without reducing fluidity. Your aim is to slow it down as much as you can.  Aiming to reduce speed while maintaining fluidity develops, (1) balance (2) muscle memory (3) understanding of movement/technique mechanicsBody mechanics is one of those things you practice slowly. .Take a small handful of techniques (say...3 to 5?...enough to keep you interested but not bored), and work with this method until you get absolutely bored sh*tless. By the time you hit the \"ok screw this, I'm tired of this crap\" phase, you'd have progressed many notches. .I write in the context of individual, deliberate practice. ",
            "date": "Answered February 22, 2015",
            "views": "902",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Dean Leysen",
                "href": "/profile/Dean-Leysen"
            },
            "answer_text": "Practice judo. :) A lot of people want to get better at something by doing something else, thinking there is some magical shortcut to be found there. There usually isn't. The best way to get better at just about anything is by practicing it over and over, by pushing your limits in it. Needless to say, this should happen under the supervision of a good teacher so that you don't learn techniques incorrectly. ",
            "date": "Answered February 20, 2015",
            "views": "898",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Luke Crocker",
                    "user_href": "/profile/Luke-Crocker-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Harshit Madan",
                "href": "/profile/Harshit-Madan-2"
            },
            "answer_text": "I have been  a judo player as wellThe first thing is training of coarse But there are some stuff too which can make your skill better Don't worry it's nothing difficult neither it is expensive It is just help your mom in the household work.....It will help..Made me storng Atleast ",
            "date": "Answered March 2, 2015",
            "views": "411",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Vishal Gogia",
                "href": "/profile/Vishal-Gogia"
            },
            "answer_text": "Watch \"Never Back Down\" before and between every training sessions and bouts. Just for you:Never Back Down (2008) ",
            "date": "Answered February 23, 2015",
            "views": "479",
            "upvotes": "0"
        }
    ]
}