{
    "title": "How much do YouTubers make when each of their videos get 50k, 100k, 500k, 1m, and 1.5m views? What about even more than that? - Quora",
    "tags": [
        "Making Money on YouTube",
        "YouTube Personalities"
    ],
    "response": [
        {
            "author_info": {
                "name": "Logan Rapp",
                "href": "/profile/Logan-Rapp"
            },
            "answer_text": "My answer comes from the side of YouTubers. While some say consistent 50k views per video = rich, that's not entirely true.  The reality is that YouTube will adjust your CPM. Jason Alleger is in the ballpark, but it's not exact as far as the take-home of YouTubers. The Play Doh Sparkle video may garner more views, but YouTube doesn't juice that, partially because they can't predict. They may have made a lot of money on that video alone, but their CPM is likely lower -- because YouTube doesn't actually look at straight numbers. They look at engagement.  Their game isn't just to get a lot of views from one. Reason for that is, okay, you have a viral video, everyone watches that, but then the bounce rate is such that you have millions of people going on that video, and then they leave.  That's why PewDiePie is making wayyyyyy more off of YouTube. And he most certainly is. Because his bounce rate is incredibly lower, because he has engagement. People comment, they check out other videos of his, they stay in gaming videos and maybe go to Markiplier. So PDP's CPM is way higher, meaning his per-view worth is way higher than any viral video, because YouTube sees him as a known quantity. Some viral thing comes out of nowhere, they aren't going to magically change the rate to give away more money. Why would they?  They raise the value of views for established, popular and consistent YouTubers like PDP, like Rosanna Pansino, like JennxPenn, because they know that each video is going to bring people back, and they aren't going to LEAVE YouTube afterward. And they don't want those people who strengthen that community to leave.  All this to say -- anyone who has a clear idea of the takehome of a YouTuber doesn't know what they're talking about, really. We can see the silhouette of what it MIGHT look like, but YouTube is aggressively quiet about that and YouTubers are actually barred from giving out that information, lest they lose their channel. ",
            "date": "Answered September 8, 2015",
            "views": "1147",
            "upvotes": " View 42 Upvoters",
            "upvoters": [
                {
                    "user_id": "Sarahephigenia Ursula",
                    "user_href": "/profile/Sarahephigenia-Ursula"
                },
                {
                    "user_id": "Jonathan Belmares",
                    "user_href": "/profile/Jonathan-Belmares"
                },
                {
                    "user_id": "Evina Zhang",
                    "user_href": "/profile/Evina-Zhang"
                },
                {
                    "user_id": "S.J. Hollist",
                    "user_href": "/profile/S-J-Hollist"
                },
                {
                    "user_id": "Sen Corby",
                    "user_href": "/profile/Sen-Corby-1"
                },
                {
                    "user_id": "Monique Alexander",
                    "user_href": "/profile/Monique-Alexander-46"
                },
                {
                    "user_id": "Gary Rush",
                    "user_href": "/profile/Gary-Rush-3"
                },
                {
                    "user_id": "Robert Ellis Walters",
                    "user_href": "/profile/Robert-Ellis-Walters"
                },
                {
                    "user_id": "Micheal Wong",
                    "user_href": "/profile/Micheal-Wong-14"
                },
                {
                    "user_id": "Srikanth Karan",
                    "user_href": "/profile/Srikanth-Karan-2"
                }
            ]
        },
        {
            "author_info": {
                "name": "Shimmy Morris",
                "href": "/profile/Shimmy-Morris"
            },
            "answer_text": "I’ll start by saying I currently have a YouTube account which is making money so I think I’m somewhat qualified to give an accurate answer. There are other great answers here as well! If you have a monetized youtube account which as of now you need at least 1000 subscribers and 4000 hours of watch time then you’ll be able to receive YouTube Ad Revenue for every 1000 views. The way it’s worked out is dependant on your channel niche. If you’re in the jokey, vlog niche you might have a CPM of about $3–5If you’re in the business and entrepreneurship niche you could have a CPM of $15+ (This is the niche I am in and currently my CPM is at $40.71 for the last 28 days)The screenshot below is my CPM per 1000 Views  Why is this? Generally, YouTube hold the entrepreneur, business niche to be more valuable as they will have older audiences ready to and advertisers spend more money on ads in those niches for that reason. What is CPM and how is that calculated. Well, you get paid per 1000 video views, and CPM is what those video views are worth to you. So if your CPM is $3 then 3000 views would be worth $9 to you. Does this make sense? So I’m going to take your question and base it directly on my average all-time CPM which is $19.48. This means for every 1000 views I get, I will receive $19.48 from Google Adsense. Google Adsense is linked up with YouTube and it’s how you get paid. The screenshot below is my all-time average CPM   Now that we have all that info out the way, let’s work out what 50k, 100k, 500k, 1m, and 1.5m views would get based on my CPM. Assuming for every 1000 views I get $19.48 1000 views = $19.48 50,000 views = $974 100,000 views = $1,948 500,000 views = $9,740 1 Million Views = $19,480 1.5 Million Views = $29,220 … and for a little fun 10 Million Views = $194,800 100 Million Views = $1,948,000 1 Billion Views = $19,480,000  I hope I’ve helped answer your question! :D ",
            "date": "Answered December 31, 2019",
            "views": "776",
            "upvotes": " View 169 Upvoters ",
            "upvoters": [
                {
                    "user_id": "A Nicholson",
                    "user_href": "/profile/A-Nicholson"
                },
                {
                    "user_id": "Joyish Viral",
                    "user_href": "/profile/Joyish-Viral"
                },
                {
                    "user_id": "Rahul Bhandari",
                    "user_href": "/profile/Rahul-Bhandari-53"
                },
                {
                    "user_id": "Paul Harris",
                    "user_href": "/profile/Paul-Harris-345"
                },
                {
                    "user_id": "Max Payne",
                    "user_href": "/profile/Max-Payne-516"
                },
                {
                    "user_id": "Technical Mobile",
                    "user_href": "/profile/Technical-Mobile-21"
                },
                {
                    "user_id": "Abdumalik G'anijonov",
                    "user_href": "/profile/Abdumalik-Ganijonov"
                },
                {
                    "user_id": "Siham",
                    "user_href": "/profile/Siham-5"
                },
                {
                    "user_id": "Naveeda Safdar",
                    "user_href": "/profile/Naveeda-Safdar"
                },
                {
                    "user_id": "Lukas Valantikonis",
                    "user_href": "/profile/Lukas-Valantikonis-1"
                }
            ]
        }
    ]
}