{
    "title": "How old should I be when I read Misery by Stephen King? - Quora",
    "tags": [
        "Stephen King (author)",
        "Writers and Authors",
        "Reading"
    ],
    "response": [
        {
            "author_info": {
                "name": "Joe Bell",
                "href": "/profile/Joe-Bell-41"
            },
            "answer_text": " The other answers seem legit, the overall message being that SOME twelve year olds would be fine if they read Misery. No one here can tell you if it'll be OK for you when you read it but I can do a little more to help you set your expectations than the other answers have offered; hopefully without spoiling the plot too much. The raw “scariness” of this book is low to medium-low. Have you read much King? He’s very good at getting under your skin; insidious really. So don't take the aforementioned comments about the low level of scariness as a negative. Misery is a psychologically jarring ride.  The book is full of abuse and manipulation. There are sledge hammers and saws (I think) used, drug addiction, and many other things done in the book. It is graphic, shocking, and certainly 100% adult content.  I think that's enough info for you to decide, if you're really still unsure after reading this than I would say don't read it. ",
            "date": "Answered May 20, 2017",
            "views": "27",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Emily ASHMORE",
                    "user_href": "/profile/Emily-ASHMORE-6"
                },
                {
                    "user_id": "Andrew Ortega",
                    "user_href": "/profile/Andrew-Ortega-21"
                },
                {
                    "user_id": "Melissa Hoy",
                    "user_href": "/profile/Melissa-Hoy-2"
                },
                {
                    "user_id": "Rebecca Wilova",
                    "user_href": "/profile/Rebecca-Wilova"
                }
            ]
        },
        {
            "author_info": {
                "name": "Olga Akselrad",
                "href": "/profile/Olga-Akselrad"
            },
            "answer_text": "Thanks for the A2A… But what a strange question! Whether you should read a book or not, doesn’t much have to do with how many tours around the sun you have on you… More like how mature you are mentally… but it also has to do with personal taste. It’s a dramatic thriller, with very dark themes. And some VERY disturbing scenes. So, for example, I read Misery when I was about 13–14. I thought it was fantastic. Does that help? However my mother could never read it. She still can’t, and she is 74. I wouldn’t give it to a 10-year-old; there are SOME things in that book that I would want them not to read. But… again. It depends on the 10-year-old! :) ",
            "date": "Answered September 14, 2017",
            "views": "18",
            "upvotes": " View 2 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Emily ASHMORE",
                    "user_href": "/profile/Emily-ASHMORE-6"
                },
                {
                    "user_id": "Nudhan Jahan",
                    "user_href": "/profile/Nudhan-Jahan"
                }
            ]
        }
    ]
}