{
    "title": "How to read a novel in a short time - Quora",
    "tags": [
        "Fast Reading",
        "Novels",
        "Literature",
        "Reading"
    ],
    "response": [
        {
            "author_info": {
                "name": "Anuchandra Shah",
                "href": "/profile/Anuchandra-Shah"
            },
            "answer_text": "1.Determine your time frame. Consider how many hours you can dedicate to reading per day. Take into consideration all of your obligations. Write down your routine to determine how much time you can realistically set aside for reading. Calculate the time you spend: SleepingWorkingAttending schoolDoing misc. activities (sports, extra curricular activities, studying, homework, etc)Having free time where you will not be reading 2.Calculate how many pages you have to read. Once you have a dedicated amount of time you have set aside to read, consider how many pages you have to read every day to finish the book by the end of a week. For example, if you have a 300 page book to read in 7 days, you can realistically expect to have to read about 43 pages per day. That is 300 pages divided by 7 days. If you want to determine how many pages you have to read per hour using this calculation, divide number of pages per day by hours you expect to read per day.[4]For example, if you plan on reading for two hours a day, that would be 21.5 pages per hour. You may need to spend more or less time reading every day depending on the length of your book and how fast you can read.Consider reading as much as you can in the first day or two of the week. Rather than spacing out your reading evenly, you might try to read most of the book in the first two days of the week. This will give you a head start and provide a cushion in case you have to skip a day. For example, if you have a 300 page book to read, try reading 100 pages on the first day of the week and 75 on the second day. Then you will only have to read 125 pages over the next five days. 3.Speed Read This technique requires you to train your eyes to make less movements when reading a page. To learn to speed read, try to: Cover text you have already read by using an index card.Train your eyes to stop on fewer words by trying to not focus on each individual word.Try RSVP (reading rapid serial visual presentation) software. This software will flash a single word at a time on the screen, training your brain to recognize words more quickly. 4.Find a quiet spot. To really “sink into” a good book, you must first find a comfortable spot. Try different locations around your home to see what relaxes you the most. Try some of these spots: A quiet, infrequently used room.A sunny spot outside.In the bath.The living room on your favorite couch. 5.Commit. If you enjoy reading, do not let it become something you give up because something else comes up. If you have scheduled time to read, then read. If you are having a stressful day and would rather do something else, force yourself to read for a short period of time. Chances are, it will help to de-stress you and help calm you down. By committing yourself to reading, you will more likely read more and more quickly.Scientists suggest that it takes 21 days to break or build a habit. Try and a keep consistent reading habit for 21 days to ingrain reading as a daily habit. ",
            "date": "Answered September 27, 2017",
            "views": "265",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Victor Hugh",
                    "user_href": "/profile/Victor-Hugh-1"
                },
                {
                    "user_id": "Sonam Mishra",
                    "user_href": "/profile/Sonam-Mishra-29"
                },
                {
                    "user_id": "Pooja Chopra",
                    "user_href": "/profile/Pooja-Chopra-32"
                }
            ]
        }
    ]
}