{
    "title": "How easy is it to learn Judo? - Quora",
    "tags": [],
    "response": [
        {
            "author_info": {
                "name": "Philip Lovelace",
                "href": "/profile/Philip-Lovelace"
            },
            "answer_text": "Physically demanding at first, but not hard to learn. Jigoro Kano designed it for the general public, so the basics are pretty easy to pick up. That’s especially true if you have a little prior martial arts experience or at least good body awareness/kinesthetic intelligence. Core basics are stuff like: Movement/falling safely/rollingOne or two basic throws/sweeps, like osotogari and ippon seoi nageThe real key to these is learning to understand timing and kuzushi (“off-balancing” or using your opponent’s center of gravity to aid your throw or sweep)Note: Tomoe nage looks hella cool, but there’s a reason it’s classed as a “sacrifice” throw. It doesn’t work unless you do it perfectly, and even then it puts both you and your uke in a dangerous position. It’s not a good beginner technique, and you should be skeptical of anyone who says it is.Basic newaza (groundwork/grappling), like basic defenses, kesa-gatame (scarf hold/pin), and hadaka-jime (rear naked choke/carotid choke).Arm bars are very useful, but there’s a reason most dojos don’t let beginners do them.Whether you can perform those skills effectively in randori (live sparring), let alone in an urgent self-defense situation is a whole other ball of wax. That’s where hundreds or even thousands of hours of practice become critical. If you can perform even the basic techniques smoothly, effortlessly, and instinctively, then they’ll serve you well whenever you need them. The hard part isn’t learning the skills, it’s perfecting them. That’s what takes time. ",
            "date": "Answered June 9, 2020",
            "views": "152",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Xavi Hernandez",
                    "user_href": "/profile/Xavi-Hernandez-31"
                }
            ]
        },
        {
            "author_info": {
                "name": "Darren Robinson",
                "href": "/profile/Darren-Robinson-99"
            },
            "answer_text": "Actually, in a way it is easy to learn. Judo is specifically designed to be teachable and easy to understand. Judo was the first martial art to effectively organize instruction method and is now copied to some degree by most martial arts because it is so effective. For example, the belt system was created for judo, as a way to measure progress. Now, everyone does that. There are only 40 throws in judo as part of what is called the gokyo. You learn them one at a time by practicing with a partner. It gets more complex as you can combine and modify the different throws, but at its core, once you know those 40, you know basic judo. There are also holds and submissions, to learn, but the throws are really the heart of judo. The thing that makes judo especially effective and easy to understand is something called randori. Judo’s greatest contribution was a safe and controlled way to practice judo against resisting opponents. There is an objective point system do determine the winner of an engagement. This is a big deal. Live sparing brings meaning and real effectiveness to judo training and teaches the application of judo techniques in a way that no amount of normal instruction can. And since it is relatively safe, you can do it alot and really accelerate the development of your skills. Now, when I say Judo is easy to learn, I mean compared to other martial arts which have adopted less effective teaching methods. Its like saying it is easy to learn French through Rosetta Stone when compared to learning by using only a French to English dictionary. It will still take lots of time, effort, and focus, and have to get thrown 1000 times, but there is a clear, organized, and efficient method to achieving mastery. This is what makes judo effective and in a way, easy to learn. ",
            "date": "Answered March 17, 2020",
            "views": "273",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Amritesh Mukherjee",
                    "user_href": "/profile/Amritesh-Mukherjee"
                },
                {
                    "user_id": "Xavi Hernandez",
                    "user_href": "/profile/Xavi-Hernandez-31"
                },
                {
                    "user_id": "John Elliott",
                    "user_href": "/profile/John-Elliott-26"
                }
            ]
        }
    ]
}