{
    "title": "How does an economy lead to doomsday? - Quora",
    "tags": [
        "Doomsday (DC Comics)",
        "Economic Collapse",
        "Economies",
        "Doomsday",
        "Apocalyptic and Post-Apocalyptic Hypothetical Scenarios",
        "The Economy",
        "Macroeconomics",
        "International Economics",
        "Economics of Everyday Life"
    ],
    "response": [
        {
            "author_info": {
                "name": "Raphael Parambi",
                "href": "/profile/Raphael-Parambi-1"
            },
            "answer_text": "Lack of Prudence in expenditure. It's like a family using it's finances for a month. Wouldn't the family exercise prudence in spending? It's the same principle everywhere. It's like this. Unless one has exercised caution and prudence in using finances within the family, for the family, and learnt it's lessons, it's not possible and should never be attempted with someone else's finances. It will lead to disaster. That is why, merely obtaining some qualification in financial management or operations, I feel, won't be sufficient. One has to get into the habit of Micro-management at a lower level and work your way up. Any job can be done by anyone, provided two factors are fulfilled for that person - one, complete information should be provided, and two, all the resources should be provided. Having said that, what that person will need now is Prudence and understanding to manage the finances. Simply tasking somebody to manage the finances of a family or company or any body, is a perfect recipe for disaster. There's a lot that has to go in, and if one is not upto the mark, however qualified he/she may be, do not entrust the person with this onerous responsibility. ",
            "date": "Answered June 29, 2020",
            "views": "126",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Deep Kaur",
                    "user_href": "/profile/Deep-Kaur-729"
                }
            ]
        }
    ]
}