{
    "title": "How do books have two authors? - Quora",
    "tags": [
        "Writers and Authors",
        "Writing"
    ],
    "response": [
        {
            "author_info": {
                "name": "Peter Badovinatz",
                "href": "/profile/Peter-Badovinatz"
            },
            "answer_text": "How do books have two authors? By having two people share the writing duties. Harry Kriewaldt’s answer isn’t bad, the other answers (that may have been collapsed) had better be joke answers. Especially the one claiming only husband-wife teams would co-author a book or it’s only done if one author fails to sell the book and another rewrites it. Sigh. This answer will focus on only fiction but non-fiction books of all types also can have multiple authors. This isn’t all that rare and examples are easy to find. In fact, one is in front of us in bright lights since it’s both an eight-book series (with the last book coming soon) and a continuing television series, “The Expanse.” The ‘author’ is listed James S.A. Corey but it’s actually two people, from: The Expanse: How a Game Became a Book and Then A Show | Den of Geek “Television producers love adaptations like The Expanse because there is a proven property behind the development of the series. But as the space drama films its second season, the writers behind the source material, Ty Franck and Daniel Abraham (collectively writing under the pen name James S. A. Corey), shared at New York Comic Con what makes their partnership unique and their novels so adaptable.”This link is slightly dated but it reveals how they work together (it doesn’t list all of the 3rd-person limited POV characters): The Expanse (novel series) - Wikipedia “Franck writes all the Holden, Bobbie, and Anna chapters, while Abraham writes the Miller, Melba, Avasarala, Bull, and Prax chapters. The writers meet weekly to discuss upcoming chapters and swap completed chapters for the other to edit.”Similarly, another book, “The Rise and Fall of D.O.D.O.” By Neal Stephenson and Nicole Garland: Author Interview - Neal Stephenson, author of The Rise and Fall of D.O.D.O. Again, each author focused on writing sections that focused on ‘their’ characters.They developed the plot lines, time lines, etc., as a cooperative endeavour.There are other models. For example, James Patterson creates detailed outlines and notes and hands those to other authors who write the book while Patterson reviews, critiques and edits: https://www.washingtonpost.com/lifestyle/style/james-patterson-doesnt-write-his-books-and-his-newest-readers-dont-read/2016/06/06/88e7d3c0-28c2-11e6-ae4a-3cdd5fe74204_story.html I believe many of Tom Clancy’s later books were like this. In these cases, the books will usually list the ‘big name’ (Patterson or Clancy) and a ‘with’ the lesser-known author. This is not ghost-writing, where an author is hired and paid to write a book but their name does not appear on the finished work. Many celebrities do this, they provide anecdotes, tales, personal history but the ghostwriter writes the book based on all this but the celebrity (or whomever) is the name who appears as the author. Note that the above examples also aren’t anthologies. These are novels or stories written by multiple authors usually from a single, central idea. But each work stands mostly alone, except for the shared universe or the shared theme. As a rule, the authors don’t interact with the others. An editor (or two or more editors) gather these and edit for consistency to the theme. One of my favourites is edited by John Joseph Adams and Hugh Howey, The Apocalypse Triptych: The Apocalypse Triptych - Wikipedia The same set of authors contributed to each of the three anthologies.The first anthology is prior to some pending apocalypse, each author was allowed to choose whatever they wanted (robots, asteroids, disease, supernatural, etc.) The second was during the author’s apocalypse. The third was after, be it a week, months or years.Back to the primary subject of this answer, a couple of useful links: Collaborative fiction - WikipediaIt Takes Two To Make a Thing Go Right: 15 Great Books with Two Authors",
            "date": "Answered August 25, 2020",
            "views": "100",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Chris A. Baird",
                "href": "/profile/Chris-A-Baird"
            },
            "answer_text": "Hi, Great Question! Usually you would split up the chapters so that each one covers different topics in the book. If it is a story by a famous author. They sometimes will allow a lesser known author to try to write the book in their voice and they will skim it afterwards to make sure everything looks good. Then, the popular author will sign off on it and they publish it as co-authors. That gives the secondary author credit of writing a book with someone famous and the famous author actually gets people to write books for them and make money off of it. Win-Win! Was this answer helpful? ☆★☆ Click on my Profile for answers to all of your self-publishing questions! ",
            "date": "Answered August 30, 2020",
            "views": "81",
            "upvotes": " Answer requested by Cierra M.Johnson"
        }
    ]
}