{
    "title": "How does my subconscious mind work? - Quora",
    "tags": [
        "Subconsciousness",
        "The Mind"
    ],
    "response": [
        {
            "author_info": {
                "name": "RC Beena",
                "href": "/profile/RC-Beena"
            },
            "answer_text": "Your subconscious mind is like a huge memory bank. Its capacity is virtually unlimited. It permanently stores everything that ever happens to you.By the time you reach the age of 21, you’ve already permanently stored more than one hundred times the contents of the entire Encyclopedia Britannica.Under hypnosis, older people can often remember, with perfect clarity, events from fifty years before. Your unconscious memory is virtually perfect. It is your conscious recall that is suspect.The function of your subconscious mind is to store and retrieve data. Its job is to ensure that you respond exactly the way you are programmed. Your subconscious mind makes everything you say and do fit a pattern consistent with your self-concept, your “master program.”Your subconscious mind is subjective. It does not think or reason independently; it merely obeys the commands it receives from your conscious mind. Just as your conscious mind can be thought of as the gardener, planting seeds, your subconscious mind can be thought of as the garden, or fertile soil, in which the seeds germinate and grow.Your conscious mind commands and your subconscious mind obeys.Your subconscious mind is an unquestioning servant that works day and night to make your behavior fits a pattern consistent with your emotionalized thoughts, hopes, and desires. Your subconscious mind grows either flowers or weeds in the garden of your life, whichever you plant by the mental equivalents you create.Your subconscious mind has what is called a homeostatic impulse. It keeps your body temperature at 98.6 degrees Fahrenheit, just as it keeps you breathing regularly and keeps your heart beating at a certain rate. Through your autonomic nervous system, it maintains a balance among the hundreds of chemicals in your billions of cells so that your entire physical machine functions in complete harmony most of the time.Your subconscious mind also practices homeostasis in your mental realm, by keeping you thinking and acting in a manner consistent with what you have done and said in the past.All your habits of thinking and acting are stored in your subconscious mind. It has memorized all your comfort zones and it works to keep you in them.Your subconscious mind causes you to feel emotionally and physically uncomfortable whenever you attempt to do anything new or different, or to change any of your established patterns of behavior.You can feel your subconscious pulling you back toward your comfort zone each time you try something new. Even thinking about doing something different from what you’re accustomed to will make you feel tense and uneasy.",
            "date": "Answered October 25, 2017",
            "views": "968",
            "upvotes": " View 5 Upvoters",
            "upvoters": [
                {
                    "user_id": "Raj Kumar",
                    "user_href": "/profile/Raj-Kumar-10162"
                },
                {
                    "user_id": "Suresh Chandra Pandey",
                    "user_href": "/profile/Suresh-Chandra-Pandey-3"
                },
                {
                    "user_id": "Munib Turkanovic",
                    "user_href": "/profile/Munib-Turkanovic-1"
                },
                {
                    "user_id": "Shreya Chaudhary",
                    "user_href": "/profile/Shreya-Chaudhary-33"
                },
                {
                    "user_id": "Ranjeet Singh Thakur",
                    "user_href": "/profile/Ranjeet-Singh-Thakur-2"
                }
            ]
        },
        {
            "author_info": {
                "name": "Arpit Jajoo",
                "href": "/profile/Arpit-Jajoo-1"
            },
            "answer_text": "The subconscious mind plays a very important role in affecting your behaviour, shaping your personality and your entire life. Many people don't have an idea how the subconscious mind works or what mechanisms govern its operation. In order to understand how the subconscious mind works you should consider it the part of your mind that contains information that you are not consciously aware of. For example, the main reason you fear public speaking might be an unconscious belief that you are unattractive and that people won't like your looks. While you won't be aware of that belief while talking in front of the public still it will affect your performance to a great extent. In this article i will tell you how the subconscious mind works and how to make it work for you in order to help yourself achieve your life goals. The inner works of the subconscious mind The subconscious mind is a like a big memory bank that stores your beliefs, memories and life experiences. This information that is stored in your subconscious mind always affects your behaviour and actions in different situations. Here is another example that will help you understand how the subconscious mind works. If you lack self confidence because of certain beliefs that you have about yourself (that are stored in your subconscious mind) then you might start to feel anxious around people. In this case you felt anxious because your subconscious mind had false information that made you believe that you were in danger while in fact you were not. One of the very interesting facts about the way the subconscious mind works is that it won't only affect your behaviour but it will also affect your perception of events. If in the previous case you saw two people smiling while looking at you then you might believe that they were making fun of you. Your subconscious mind follows a rule called \"you get what you focus on\". Because you had a false belief about yourself you found a proof for it even though it wasn't real. ",
            "date": "Answered October 25, 2017",
            "views": "435",
            "upvotes": "0"
        }
    ]
}