{
    "title": "How old is Harry Potter? - Quora",
    "tags": [
        "Harry Potter (Wizarding World character)",
        "Harry Potter (book series)",
        "Harry Potter (movie series)"
    ],
    "response": [
        {
            "author_info": {
                "name": "Victoria Green",
                "href": "/profile/Victoria-Green-63"
            },
            "answer_text": "So Harry James Potter, was born on the 31st July 1980. So when he starts at Hogwarts on the 1st September 1991 he would have been 11 years old. Only a little kid :)  The battle of Hogwarts ended 3rd May 1998, so by the end of Harry Potter and the Deathly Hallows (excluding the epilogue) he would have been 17.  In the epilogue takes place on the 1st of September 2017. At this date Harry Potter would be 37 years old.  So that means since it is currently 2017 (although not for long) Harry James Potter is 37 years old! But if you are talking about the actor Daniel Radcliffe then it is a totally different story! He was born on the 23rd July 1989. He landed his role as Harry Potter, when he was 11 years old, but he started filming when he was 12.  And while he was in the last movie he was actually 21 years old. This is because of how they split up the movies, and also the time it takes to make sure they get Harry Potter right!  And currently Daniel Radcliffe is 28 years old, and has a very successful career in acting! ",
            "date": "Answered December 5, 2017",
            "views": "831",
            "upvotes": " View 62 Upvoters",
            "upvoters": [
                {
                    "user_id": "Anne Sattgast",
                    "user_href": "/profile/Anne-Sattgast"
                },
                {
                    "user_id": "Aryaman Sharma",
                    "user_href": "/profile/Aryaman-Sharma-50"
                },
                {
                    "user_id": "Miraflores Tindall",
                    "user_href": "/profile/Miraflores-Tindall"
                },
                {
                    "user_id": "Matthew Presland",
                    "user_href": "/profile/Matthew-Presland-3"
                },
                {
                    "user_id": "Tua Holem",
                    "user_href": "/profile/Tua-Holem"
                },
                {
                    "user_id": "Daniel Pschaida",
                    "user_href": "/profile/Daniel-Pschaida"
                },
                {
                    "user_id": "Cedric Saintas",
                    "user_href": "/profile/Cedric-Saintas"
                },
                {
                    "user_id": "Jhio Soriano",
                    "user_href": "/profile/Jhio-Soriano"
                },
                {
                    "user_id": "Sam Brenard",
                    "user_href": "/profile/Sam-Brenard"
                },
                {
                    "user_id": "Simone Esther Kate Nelson",
                    "user_href": "/profile/Simone-Esther-Kate-Nelson"
                }
            ]
        },
        {
            "author_info": {
                "name": "Robert Waldbauer",
                "href": "/profile/Robert-Waldbauer"
            },
            "answer_text": "How old is Harry Potter? A number of answers are possible, and all can be ‘correct’, determined by what incarnation one chooses. Jo Rowling has stated that she first imagined the character in 1990 while on a train. That incarnation of Harry Potter would be approximately 28 years and a few months at the time of this writing. Harry’s birthday as a character is given as July 31st, 1980, making him 38 years, 5 months, and 15 days of age at the date of this writing. “Harry Potter and the Philosophers Stone” was published in Great Britain on June 26th, 1997, thus introducing the character to the reading public. That incarnation would be 21 years, 6 months, and 19 days as of the date this writing. The American version, :Harry Potter and the Sorcerers Stone” was published September 1st, 1998, making that incarnation 20 years, 4 months, an 14 days of age as of the date of this writing. Other answers given to this question refer to Daniel Radcliff, who portrayed Harry in the films, and those answers are also considered to be correct. ",
            "date": "Answered January 15, 2019",
            "views": "105",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Enni Emilia",
                    "user_href": "/profile/Enni-Emilia"
                },
                {
                    "user_id": "Daniel Pschaida",
                    "user_href": "/profile/Daniel-Pschaida"
                }
            ]
        }
    ]
}