{
    "title": "How should I start my preparation for the IAS exam? - Quora",
    "tags": [
        "Indian Administrative Service Aspirants",
        "Indian Administrative Service Preparation",
        "Indian Administrative Service"
    ],
    "response": [
        {
            "author_info": {
                "name": "Sudhir Gahlot",
                "href": "/profile/Sudhir-Gahlot-1"
            },
            "answer_text": "I have always believed that starting anything is its most difficult part. I am Sudhir Gahlot and secured AIR 42 in CSE 2017 at age of 23. I am your average guy who has done BSC from Delhi University and then jumped into UPSC preparation. This was my second attempt in CSE. I didn't take coaching for General Studies or interview and prepared solely from my home, though we live in joint family of 10 members. I never stayed in Delhi because it was simply unaffordable. Clearing CSE had been a childhood dream, which became only strong with time and maturity. So, I was itching to become 21 and take this exam. However, when I completed my graduation in June 2014, and finally thought about preparing for CSE, I understood that its not as easy as it seems and there are many challenges to tackle. I am from a small town, a semi rural one. I didn't have anyone even remotely related to civil services field - no relative, friend, senior or anyone. You won't believe that I had not met any civil servant till I cleared this exam myself in 2018. So, I spent my next 3 months in understanding the requirements of this exam, the nuances and everything related to it. I made my mind clear that what I have to do to ace this exam. I had to tread my own made path as I decided not to take coaching or live in Delhi. I want to share it with you all, especially people like me who had no source of guidance and have to make their own path. 1.Creating interest and passion I believe that to ace anything easily, you must be totally interested and passionate about that idea. I scouted almost whole internet in 3 months to become totally interested, curious about this exam, service. I read almost all toppers’ blogs, watched many videos, attended 2–3 open sessions and wrote my all learnings in a notebook. Then, I shut everything up and just kick started my preparation with a bang. There was no looking back after it. Once i understood the rules of game,I knew I will overtake everyone. I had too much internal fire to become IAS as my purpose for clearing this exam was clear. a) to work directly among people and be a common man’s officer to solve their problems. I have seen a common man’s struggle in Indian system from very close quarters. b) to make my parents proud and to prove myself. I have always believed that its size of fight in a dog that matters. 2. Choosing Optional Subject I took Sociology optional after seeing last five years question papers, reading syllabus of some of humanities optional. I felt most comfortable and natural in sociology. My interest lay there. So, I took it. Your job is half done if you choose the right optional according to your aptitude and liking. Trust me. 3.Making a booklist and sticking to it religiously Market and Internet are flooded with so many material, books, coaching notes that its so easy and natural to be lost in this sea. So, I made my booklist and followed it sacredly. I read all my books,material atleast 10 times before my first attempt. I believe in reading less books for umpteen nunber of times till you understand between the lines. Then,best answer comes out naturally. Here is my booklist. Sudhir Gahlot's answer to What are some 'must-read' books for UPSC civil services aspirants? 4. Making daily timetable and long term plan This step is important as otherwise you will lose track.You will have to plan well in advance for prelims and Mains. Start your preparation with Mains syllabus and cover your optional well in time before prelims.Before prelims, devote 3 months exclusively to prelims preparation. You are good to go. Read my this answer for timetable. Sudhir Gahlot's answer to What was your timetable while preparing for UPSC? 5.Make your notes of current issues and your optional subject.Please do this. 6.First quickly read the NCERTs that I have mentioned in the booklist and then start reading Newspaper.The Hindu is a good one.You will understand the newspaper in a better way after reading NCERTs. 7. Join GS Mains test series before prelims for better answer writing. I didnt write any answer other than tests written. 7.Consider yourself worthy of UPSC We people from small town have inferiority complex that UPSC is not made for us. Understand that though competition is brutal but you are better than your competitors. Confidence is biggest quality needed.Give your heart and soul to this exam for one year. Be totally honest with yourself and assess yourself continuously. Manage your time judiciously. Average people clear UPSC with sincere hard work. Trust me. Read my this answer. Sudhir Gahlot's answer to Is the UPSC not for the average people? Now, you are good to go for this exam. You will understand many nitty gritties only by your known. Jump into the preparation well armoured and you will clear all challenges that this exam will present before you. I want to share a short story from my life that how we can turn challenges into opportunities. When I started preparation, I said to my family that I want to meet some selected person for guidance. They found a girl in our relation who had got some allied Group A service in civil services exam. They setup a meeting with her. However, she changed her plan at last moment and kept me waiting at her home. I didn't say anything. Same happened in the next instance. I didn't like this haughty attitude of her and her father. I decided not to run after anyone and make my path. It benefited me immensely. I said to her father, “Uncle I am going to be an IAS before I turn 25. But I will not fly in sky like your daughter. Keep your IRS daughter with you”.And yes, her father sheepishly comes to my home and in my felicitation functions now and says, “bache ka talent shuru se hi pata tha”. Lol, Success shows funny faces of people. Best of luck and keep total trust in your abilities. You will make it surely. ",
            "date": "Updated August 10, 2018",
            "views": "4367",
            "upvotes": " View 6.1K Upvoters ",
            "upvoters": [
                {
                    "user_id": "Prince Charan",
                    "user_href": "/profile/Prince-Charan-4"
                },
                {
                    "user_id": "Baba",
                    "user_href": "/profile/Baba-153"
                },
                {
                    "user_id": "Krishna Prasad",
                    "user_href": "/profile/Krishna-Prasad-2656"
                },
                {
                    "user_id": "M S Akhil",
                    "user_href": "/profile/M-S-Akhil-1"
                },
                {
                    "user_id": "Chandini Snair",
                    "user_href": "/profile/Chandini-Snair"
                },
                {
                    "user_id": "Sayan Ghosh",
                    "user_href": "/profile/Sayan-Ghosh-234"
                },
                {
                    "user_id": "Durgesh Kesharvani",
                    "user_href": "/profile/Durgesh-Kesharvani"
                },
                {
                    "user_id": "Chandra Mohan Murmu",
                    "user_href": "/profile/Chandra-Mohan-Murmu-2"
                },
                {
                    "user_id": "Khem Singh",
                    "user_href": "/profile/Khem-Singh-15"
                },
                {
                    "user_id": "Harshal Deshpande",
                    "user_href": "/profile/Harshal-Deshpande-17"
                }
            ]
        },
        {
            "author_info": {
                "name": "Utpal Sannyashi",
                "href": "/profile/Utpal-Sannyashi-1"
            },
            "answer_text": "Thank you for the A2A. In this answer, I'll try to address most of the common doubts and confusions which I faced as a beginner and I believe others who are just starting out will face as well. I’ll try to cover multiple dimensions in this regard (so please bear with me as the answer is on the longer side) Motivation -All aspirants who seek to clear the exam are driven by an initial spark which encourages them to take up the challenge of clearing the exam. I'd suggest writing it down in half a sheet of paper and keep it somewhere safe (I have it in my wallet). One'll have to revisit it numerous times, especially when the going gets tough. Over the course of the journey, your motivations will change. I'd suggest writing them down on the same piece of paper. Not only will it be helpful while preparing for the interview, but when everything is done and dusted, you'll understand how far you have matured and grown as a person during the course of the exam preparation.Identify your position - I feel that self-awareness is an essential aspect of the exam preparation. If one is aware of her condition (mental, physical, social, financial etc.) as it will help the aspirant plan their preparation in such a way that nasty surprises can be reduced to the minimum. An aspirant may want to ask themselves the following questions - 1. Whether they have done well in college and whether they can find a job at any time? 2. Whether they'll have the financial backing of their families during the preparation phase or whether they'll need to support their families?3. Whether one is married or in a job and how much time they can realistically devote towards preparation?4. Whether one can afford to go to any of the metro cities and spend money on coaching, rent, books etc.?5. Whether one plans to prepare for other exams simultaneously like State PSCs, SSC CGL etc.?and so on..I'd suggest that aspirants should try to find honest answers to such questions so that the preparation strategy can be streamlined to ensure there are minimal hiccups during preparation. This will also help one to set realistic goals (e.g. number of hours one can devote, amount of time one can stay in Delhi or any city, number of attempts one is planning to give before going for their backup plan etc.) and provide the peace of mind as well as the push which is extremely crucial during prep.Identify your strengths and weaknesses - CSE is not a test only of knowledge. There are many other criteria which are tested as well such as the ability to interlink topics, logical and rational analysis of issues, creativity, empathy etc. Hence, one needn't feel demotivated if she comes across another candidate with much higher knowledge levels. A candidate may be strong in multiple other traits which will matter immensely during the process even if they don't get tested.Also, I believe knowing about one's strengths and weaknesses will be helpful in deciding which successful candidate's strategy one should follow as such strategies are essentially the process of conversion of the specific candidate's weaknesses into strengths. This will help an aspirant to arrive at an ideal strategy sooner. However, for this one needs to go through numerous blogs/Quora answers etc. to understand the challenges the successful candidate faced and whether they are similar to the challenges the aspirant is facing.Coaching - After identifying one's position, the aspirant should be capable of taking a decision whether to go for coaching or not. To be honest, coaching will not make a huge difference to your preparation. In concrete terms, GS coaching classes will ensure that an aspirant has some notes for all the topics and has some practice in solving MCQs and answer writing. Some coaching centers may have helpful teachers and good doubt-clearing sessions. But it is not something which aspirants can find out through Google or discussions with other aspirants. Hence, I'd suggest going for coaching only if you need some regimentation to streamline your preparation and a peer group. The story is a bit different for Optional as coaching classes and notes can be very helpful. This is primarily because the questions in Optional are more of a standard nature and concrete strategies for optional prep can be chalked out. GS is too dynamic and one needs to focus on being updated with current affairs, having a macro view of topics and the capacity to build interlinkages and arrive at a logical conclusion.Also, it is probably better if one doesn't stay in any of the coaching hubs (MN or ORN) when they are in Delhi. The prices in such 'Nagars' are exorbitant and at the same price one will not only find a bigger flat (one-two Metro stations away) but will also be able to purchase the services of a cook and pay for a library membership. The two and fro commute may require some time but one can use it effectively by listening to AIR Spotlight news, RSTV videos etc.Syllabus and time-table - CSE syllabus can be overwhelming to many. But I'd suggest going through it carefully. You'll realize that though there are many topics, all of them may be clubbed together into a few broad subjects such as:For instance, GS1 consists of Art and Culture, History, Society and Geography and GS2 consists of Polity, Governance, Social Justice and IR and so on.This macro view of topics will help one in constructing an optimized timetable (e.g. reading topics under Society from GS1 and Social Justice from GS2 may help one in getting a better understanding of social issues, reading IR from GS2 and Economy from GS3 together can help one understand how global events have a bearing on Indian economy, reading governance and Public/Civil Service Values and Ethics in Public Administration may help one to develop a better understanding of the underlying factors which determine the efficiency of the government and so on.However, to reach this stage one needs to be thorough with the standard books. If one is giving the exam next year, I'd suggest focusing primarily on the static sources and Optional until December. This will ensure that one doesn't have to revisit the books again and again next year and the focus can be on Current Affairs, answer writing practice, Test series etc. However, those who have less than 6 months until Pre will have to do all of these together.Sources -It is very important to know which sources one must go through and the ones which one must avoid. This is essential so that one doesn't end up spending too much time on books/websites/notes which don't add value to your preparation in any way. I've mentioned above that knowledge is only one of the criteria which the exam tests. Hence, one needs to focus on other aspects of preparation as well such as developing interlinkages, rational analysis etc. One must remember that more is not necessarily better. And in this regard, a condensed booklist can be very helpful. You may follow the sources I've mentioned in this write-uphttp://www.insightsonindia.com/2018/06/09/toppers-strategy-utpal-sannyashi-rank-76-cse-2017-insights-online-student-bottom-up-approach-second-attempt/.I'd also suggest going through the booklist of a successful candidate who has had the same Optional as yours as the choice of optional also has a bearing on the books one decides to follow.Test-series - Test-series are essential for two purposes - it encourages one to follow a time-bound approach while preparing the topics and it gives essential feedback which can be helpful in plugging the gaps in knowledge, understanding the pattern of questions asked, formulating specific strategies for specific questions etc.Hence, I'd recommend solving test papers for Prelims, GS as well as Optional. However, new aspirants may find it a bit difficult to solve the Prelims test-papers (i.e. get a good score) in the first 4-5 months of their preparation. Further, coaching classes/job and the need to read newspapers and class-notes regularly may lead one to overburden herself. Hence, I'd suggest solving test papers from November-December onwards and focusing exclusively on going through the standard books, making notes from newspapers, revising class notes and so on.Newspaper notes - Current affairs form the core of CSE prep. Hence, this aspect of preparation should be given a lot of attention. Although there are numerous sources to study Current affairs, I've always felt that the tried and tested method of reading newspapers and making notes from the events is news is the best way to go about it as it a more hands-on approach. I've explained the process of making notes in detail in the link I've posted above. However, I'd like to add one more point not mentioned in the write-up. Note-making for Prelims and Mains has to be integrated. For instance, let's say you are making notes on FSSAI - Mains related questions should be: How FSSAI helps in promoting food processing industries, how effective has FSSAI been as a regulatory body, whether FSSAI can play a role in improving health indicators etc? Prelims related questions: When was it setup? Under which Act? Under which Ministry? How many offices etc?This will help one to develop the ability to look into an issue from multiple sources and develop her critical thinking abilities which will ultimately be immensely beneficial during the Interview as well.Optional - One needs to have absolute clarity about the optional they want to clear the exam with. I've suffered in my first attempt because I took up an optional which I underestimated and couldn't do justice to, resulting in poor performance of the subject. While choosing an optional interest shouldn't be the only criteria, one should also consider the availability of coaching classes, notes, test-series etc. as well as the length of the syllabus and its overlap with GS while choosing the optional. Also, as I've mentioned above coaching classes for optional can be helpful. However, if one is unable to attend optional classes, I'd suggest getting topper notes (or notes of some reputable institute) and the standard books to prepare the base and later joining a test series to fine-tune one's answer writing skills. Solving past year's papers can also be very helpful (more helpful than in GS at least) as standard questions are often repeated on many occasions.Micro-strategies - One may adopt one or more of the strategies I've mentioned below to increase the recalling ability which in turn reduce the time needed for revision and reduce the drudgery of preparation.1. Creating mind maps, especially to revise complicated topics in a short duration. I used XMind for this purpose (I'll share a file in a later post). However, they can be made on notebooks as well2. Voice recordings of topics which can be used for revision while traveling, eating etc.3. Some software like Evernote/Onenote (for making notes), Highly (to highlight important sections of webpages), Google Translate (will help students from non-English backgrounds in making effective use of websites like Insights, IASBaba etc.), RSS Readers (to stay updated on news items) etc. may also be helpful4. Using the mind-palace technique to enhance the recalling capacity may also be adopted. You may go through the video prepared by UNAcademy to get some insight on it.Social life - Here I'd suggest adopting a middle-path approach in one's interactions with other. Aspirants may feel that they may need to put their social life on hold to prepare well, and to a certain extent, it is true. However, going into a shell and completely cutting off all contacts with others may be counter-productive as social contact can provide mental nourishment and can help reduce the stress one experiences while preparing.Physical fitness - ﻿﻿A healthy mind resides in a healthy body. Hence, taking care of one's health is essential to not only deal with the pressure of preparation but also ensure that one can give her best on the D-day. I'd suggest playing sports on weekends or going for a jog or yoga daily for at least an hour to ensure that the body and mind are fit and can take the rigours of preparation for extended periods of time.General biases - While preparing for CSE, one often needs to operate in the grey area as there are numerous variables and factors which influence the thinking of aspirants. As a result, there is a possibility that aspirants may develop certain biases in their thinking which can harm their preparation without even them being aware of it. I'll mention some of the common ones and the ones I've experienced myself while preparing - In my first attempt, I had Chemistry as my optional (I moved to Pol Sc in the second attempt). I was good at Chemistry during my school days and often performed well in the subject in the engineering entrance exams. However, I paid very little attention to Chemistry while preparing for CSE as I probably underestimated the subject. This is because I didn't have sufficient knowledge of Chemistry to accurately assess my capabilities. This cognitive bias, where one overestimates one's abilities is called the Dunning-Kruger effect. Hence I'd suggest that if one finds a subject or paper too easy, they should take a step back and analyze if their abilities in the subject are genuinely at par with the requirement of CSE.Another issue is that of bandwagoning. During my first attempt, I joined a number of test series and solved questions from a number of websites without considering if they actually add value to my preparation or not. I joined so many tests because everyone else was doing it. In my second attempt, I only joined PSIR test series and depended on my own questions and Vision test papers (which I evaluated myself after looking at the topper booklets of previous years). This reduced my burden to a large extent as I planned my preparation after analyzing my strengths, weaknesses, time constraints, knowledge levels in different subjects etc. Hence, I believe that one should come up with a strategy based upon one’s strength and weaknesses instead of following the general trends.Yet another problem I faced was that of having outcome bias. I remember that during my first attempt, I performed well in a test after watching Mrunal Sir's economy videos. This led me to think that I can achieve the same outcome (i.e. performing well in tests) by following the same procedure (i.e. watching videos of the concerned subject). Hence, I spent a disproportionate amount of time watching videos on IR, S&T, Environment etc. which could have been prepared in much lesser time by just going through newspapers or doing a simple Google search for some topics. Here, my point is that there needn't be and generally isn't a single strategy which can be recycled to learn a topic in the best possible way in the shortest amount of time. One needs to be flexible with their strategies depending on the subject they are studying.So these are some of the biases one needs to be careful about while preparing so that the aspirant doesn't waste her time and energy needlessly.Value-addition - CSE expects a certain degree of creativity and innovativeness from aspirants in their answers. Hence, when an aspirant is sufficiently comfortable with the syllabus and has a good grasp of majority of the topics, I'd suggest incorporating some creativity in their answers. These can include mindmaps, graphs, venn-diagrams, flowcharts, rough geographical maps etc. which should be liberally used to say more in fewer words. This will not only save time during the exams but will also help one to make new interlinkages which will convince the examiner that the aspirant has dwelled upon the issues in the syllabus. I believe this is pretty much everything an aspirant needs to keep in mind at the beginning of their preparation. I understand that all of this may seem overwhelming, but one should remember that if one has a strong foundation, the superstructure built upon it will be much more stable and sustainable. Hence, the strategy an aspirant comes up after the initial stage will have more clarity and the aspirant will have more faith on it. I hope this write-up is able to give some direction to the beginners. However, if anyone has any doubts, do let me know. Good luck and all the best! ",
            "date": "Answered August 6, 2018",
            "views": "439",
            "upvotes": " View 288 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Rajesh Kumar",
                    "user_href": "/profile/Rajesh-Kumar-3424"
                },
                {
                    "user_id": "Raghav Sarkar",
                    "user_href": "/profile/Raghav-Sarkar-4"
                },
                {
                    "user_id": "Priyanshi",
                    "user_href": "/profile/Priyanshi-126"
                },
                {
                    "user_id": "Abhishek Nath",
                    "user_href": "/profile/Abhishek-Nath-85"
                },
                {
                    "user_id": "Rahul Kumar",
                    "user_href": "/profile/Rahul-Kumar-2073"
                },
                {
                    "user_id": "Dhananjay Bhardwaj",
                    "user_href": "/profile/Dhananjay-Bhardwaj-12"
                },
                {
                    "user_id": "Sonu Kumar",
                    "user_href": "/profile/Sonu-Kumar-15746"
                },
                {
                    "user_id": "Shivam Agrawal",
                    "user_href": "/profile/Shivam-Agrawal-184"
                },
                {
                    "user_id": "Anil Kumar",
                    "user_href": "/profile/Anil-Kumar-4685"
                },
                {
                    "user_id": "Srishti Thakran",
                    "user_href": "/profile/Srishti-Thakran"
                }
            ]
        }
    ]
}