{
    "title": "How does Zero to One (Peter Thiel's book) compare to the lecture notes from his Stanford class? Are they identical? - Quora",
    "tags": [
        "Books Published in 2014",
        "Silicon Valley in 2014",
        "Zero to One (2014 book)",
        "Peter Thiel (businessman)"
    ],
    "response": [
        {
            "author_info": {
                "name": "Sean Rose",
                "href": "/profile/Sean-Rose"
            },
            "answer_text": "Most of the core ideas and messages are the same. The notes have been edited in order to make them more concise (the book is 191 pages of medium-large print). The editing helped with length; there are 19 classes vs. 14 chapters in the book. Moreover, the various interviews of third parties from the class notes were not included, which also seemed to help with keeping the book focused and shorter. All of the graphs and charts have been redone in a consistent, more professional manner. As far as I can tell, most of the editorial changes have been made with the intention of broadening the ideas to be more accessible to people outside of Silicon Valley. For example, in the lecture notes there is this passage:  Humanities majors may well learn a great deal about the world. But they don’t really learn career skills through their studies. Engineering majors, conversely, learn in great technical detail. But they might not learn why, how, or where they should apply their skills in the workforce. The best students, workers, and thinkers will integrate these questions into a cohesive narrative. This course aims to facilitate that process.  Clearly commentary on Silicon Valley's typical perception of the value of technical vs. non-technical background. However, in the book, it became:  College students can become extremely skilled at a few specialties., but many never learn what to do with those skills in the wider world. My primary goal in teaching the class was to help my students see beyond the tracks laid down by academic specialties to the broader future that is theirs to create. which is more or less a broader statement of the same idea. Despite the retention of the ideas from the course notes, I still highly recommend buying the book. The reorganization and editing have made the relatively complex ideas a lot easier to process. Despite reading the complete course notes multiple times, I still feel like I've learned a lot from the book. Buy here: Zero to One: Notes on Startups, or How to Build the Future eBook: Peter Thiel, Blake Masters: Kindle Store Note: this is based on the advanced reader's edition ",
            "date": "Answered September 17, 2014",
            "views": "877",
            "upvotes": " View 7 Upvoters",
            "upvoters": [
                {
                    "user_id": "Jeremy Senseng",
                    "user_href": "/profile/Jeremy-Senseng"
                },
                {
                    "user_id": "Emilio Cecconi",
                    "user_href": "/profile/Emilio-Cecconi"
                },
                {
                    "user_id": "David Hwang",
                    "user_href": "/profile/David-Hwang-4"
                },
                {
                    "user_id": "Saswat Panda",
                    "user_href": "/profile/Saswat-Panda"
                },
                {
                    "user_id": "Jared Krouss",
                    "user_href": "/profile/Jared-Krouss"
                },
                {
                    "user_id": "Alexander Silverman",
                    "user_href": "/profile/Alexander-Silverman"
                },
                {
                    "user_id": "Marc Bodnick",
                    "user_href": "/profile/Marc-Bodnick"
                }
            ]
        }
    ]
}