{
    "title": "How does being creative help you? - Quora",
    "tags": [
        "Creative Ideas",
        "Creativity",
        "Artists and Creative Professions",
        "The Arts",
        "Self-Improvement",
        "Life and Living"
    ],
    "response": [
        {
            "author_info": {
                "name": "Lynda Filler",
                "href": "/profile/Lynda-Filler"
            },
            "answer_text": "Creativity spills over into all things in my life. First, it is part of who I am. Whether I’m placing plants on a patio, picking dishes for my kitchen or thinking of creative ways to fix the refugee crisis plaguing the Universe, I use creative thinking. It worked in management and sales because there has to be more than one way to look at the challenges we have in the work force. If you can think outside the box or around the box or delete the box entirely, you will find solutions to the challenges in running a company. I used creative ways in parenting my children. There are the inevitable issues that we face as parents, the challenges of each generation. Creative solutions and again, outside-the-norm thinking helped me tremendously. But more than anything, being a creative has given me an outlet I could not live without: an outlet for my tremendous emotions. I feel so many things so deeply. Without poetry, prose, reading, photography, painting and music, I could not exist. Design is a part of my life. I rejoice in new shiny objects and stroke seashells and try to imagine the thousands of miles they may have traveled before they were picked up by me. I photograph sunrises and sunsets every single day of my life … I inhale the coffee at Starbucks, and taste the tacos on the street, and—don’t laugh—I lovingly stroke my new iPhoneXS loving the smooth screen and noveling in the facial recognition, the beauty of design and how it feels when I hold it. Haha, I’m crazy but I absolutely love myself this way. I have so much gratitude for something that is so much a part of my life that I can’t even begin to explain. But excuse me a moment, I’m listening to the Coors and a great drum Mix that requires me to dance. TTYL ",
            "date": "Answered December 17, 2018",
            "views": "220",
            "upvotes": " View 2 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Delaney Washburn",
                    "user_href": "/profile/Delaney-Washburn"
                },
                {
                    "user_id": "Charles Rolston",
                    "user_href": "/profile/Charles-Rolston-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "John Sampson",
                "href": "/profile/John-Sampson-50"
            },
            "answer_text": "Being creative requires me to think laterally, out of the box, unconventionally, to not take anything at face value, not to rely on anyone else’s opinons /views. It teaches, and requires me to be intellectually self-reliant and to keep pushing the envelope and boundaries of what is known. It requires me to make a contribution to the body of knowledge in the disciplines that I am familiar with, in those that I am qualified and in those that I enjoy pursuing. Creativity is like a magnet to which I am drawn, it is the vehicle through which I make a contribution to my family and to society. Without being creative it would be very difficult to bring meaning to my life. I am not interested in the scientific desciplines, they have no interest for me, I have very little aptitude for science, despite having huge admiration for people who make our world a better place through advances in technology. But, civilization is not just reliant on science and technology. Just look at the contribution that art and culture have made. We have laboritories and science faculties, but we also have museums and art galleries. We need both. I and my interests and talents fall into one of them. Keep in mind that our brains are divided into two distinct halves, each controlling very different aspects our who we. They do not compete with each other, they complement each other. So, you need to have a wholistic knowledge of what motivates and drives us in certain directions. Psychology is useful discipline through which to understand the brain and how it functions. Give it a shot and do some research. ",
            "date": "Answered December 18, 2018",
            "views": "94",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Delaney Washburn",
                    "user_href": "/profile/Delaney-Washburn"
                }
            ]
        }
    ]
}