{
    "title": "How to sell copyrights of a self published book that I own - Quora",
    "tags": [
        "Self-Publishing",
        "Book Publishing",
        "Copyright Law",
        "Publishing"
    ],
    "response": [
        {
            "author_info": {
                "name": "Travis Casey",
                "href": "/profile/Travis-Casey-4"
            },
            "answer_text": "I don’t. If you own the copyrights, I can’t sell them, unless you authorize me to do so as your agent. It’d be like me selling your house. I can’t do that unless you authorize me to do so. In general, though, publishers don’t buy copyrights for books. They license the copyrights, which the author retains. The primary exception is when an author approaches a publisher to sell them a book which is a derivative work of something the publishing company owns. For example, if you send your script for an issue of Superman to DC comics, and they decide to buy it, they’d buy the copyright, because Superman is already their property, so it simplifies things greatly. In that case, however, it would not be a self-published book, since you would not be able to legally self-publish a Superman comic without permission, since it is legally a derivative work. ",
            "date": "Answered December 3, 2018",
            "views": "732",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "David Lascelles",
                    "user_href": "/profile/David-Lascelles"
                },
                {
                    "user_id": "Harry Kevin Hillman",
                    "user_href": "/profile/Harry-Kevin-Hillman"
                },
                {
                    "user_id": "William D. Richards",
                    "user_href": "/profile/William-D-Richards"
                }
            ]
        },
        {
            "author_info": {
                "name": "Lawrence Watt-Evans",
                "href": "/profile/Lawrence-Watt-Evans"
            },
            "answer_text": "Ordinarily, you wouldn’t. You would lease various subsidiary rights, such as book rights, film rights, translation rights, etc. Seriously, if you sell a copyright, you are giving up all claim to the work, forever and ever. In the United States you won’t even have the right to insist your name be on it. (In Europe, droit morale gives you that option, but in the U.S. we don’t have droit morale.) If you seriously intend to sell a copyright outright… well, it’s your right to do it, but I will not do anything to assist anyone in doing something so stupid. ",
            "date": "Answered February 11, 2019",
            "views": "654",
            "upvotes": " View 7 Upvoters",
            "upvoters": [
                {
                    "user_id": "David Lascelles",
                    "user_href": "/profile/David-Lascelles"
                },
                {
                    "user_id": "Avishek Sharma",
                    "user_href": "/profile/Avishek-Sharma-40"
                },
                {
                    "user_id": "Harry Kevin Hillman",
                    "user_href": "/profile/Harry-Kevin-Hillman"
                },
                {
                    "user_id": "Tim White",
                    "user_href": "/profile/Tim-White-375"
                },
                {
                    "user_id": "John Hart",
                    "user_href": "/profile/John-Hart-18"
                },
                {
                    "user_id": "Mercedes R. Lackey",
                    "user_href": "/profile/Mercedes-R-Lackey"
                },
                {
                    "user_id": "Jason Patterson",
                    "user_href": "/profile/Jason-Patterson-86"
                }
            ]
        }
    ]
}