{
    "title": "How is Jerry Seinfeld the richest actor? - Quora",
    "tags": [
        "Jerry Seinfeld (comedian, actor)",
        "Comedians",
        "Wealthy People and Families",
        "Wealth",
        "Celebrities"
    ],
    "response": [
        {
            "author_info": {
                "name": "Jon Mixon",
                "href": "/profile/Jon-Mixon-1"
            },
            "answer_text": "Question: How is Jerry Seinfeld the richest actor? Jerry Seinfeld, along with his series co-creator Larry David, managed to create Seinfeld, have it become extremely popular, and then syndicate it at the zenith of the television series syndication market. Had they done so a few years earlier, or a few years later, they would be “wealthy” along the lines of Tim Allen and Ray Romano (who are worth roughly $100 and $150 million respectively) but not uber wealthy like they are now. Seinfeld help create a series which was able to command the highest syndication rates and best syndication packages in the history of television. His show is (or rather was, as it has been in syndication for more than two decades and its appeal in the North American market is dimming) the most popular fictional narrative syndicated history in American television and his wealth reflects that fact. It also helps that Seinfeld was never divorced, has avoided problems substance abuse and gambling, and has also led a rather discreet personal life. Anyone of those could have easily halved his current fortune, or resulted in the litigation and imprisonment issues that have caused so many other celebrities to lose their wealth. ",
            "date": "Answered November 28, 2018",
            "views": "115",
            "upvotes": " View 50 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Ishaan Hajela",
                    "user_href": "/profile/Ishaan-Hajela"
                },
                {
                    "user_id": "Joel Goldstein",
                    "user_href": "/profile/Joel-Goldstein-7"
                },
                {
                    "user_id": "Savyasachi Semwal",
                    "user_href": "/profile/Savyasachi-Semwal"
                },
                {
                    "user_id": "Joan McDermott",
                    "user_href": "/profile/Joan-McDermott-2"
                },
                {
                    "user_id": "Steven Cateris",
                    "user_href": "/profile/Steven-Cateris"
                },
                {
                    "user_id": "Sam Cox",
                    "user_href": "/profile/Sam-Cox-84"
                },
                {
                    "user_id": "Joyce Baskind",
                    "user_href": "/profile/Joyce-Baskind"
                },
                {
                    "user_id": "John Mayers",
                    "user_href": "/profile/John-Mayers-32"
                },
                {
                    "user_id": "Neilalohith Sharma",
                    "user_href": "/profile/Neilalohith-Sharma"
                },
                {
                    "user_id": "Febin Thomas",
                    "user_href": "/profile/Febin-Thomas-7"
                }
            ]
        },
        {
            "author_info": {
                "name": "Friends Best Fan",
                "href": "/profile/Friends-Best-Fan"
            },
            "answer_text": "Bankrate reports that after Jerry Seinfeld spent 15 years as a stand-up comedian, he created the pilot for Seinfeld with Larry David. The “show about nothing” aired for nine years, and the publication reports that it “accounts for the vast majority of Jerry Seinfeld’s net worth, and has made him one of the wealthiest entertainers in the industry.” One factor is the eye-popping salary that Seinfeld made on the show. Seinfeld is also a best-selling author and a public speaker. And he’s also had some lucrative endorsement deals, including a $10 million deal to make ads for Microsoft in 2008. As you might expect for someone who earned $69 million in a single year, Jerry Seinfeld’s net worth is pretty impressive. Celebrity Net Worth puts Jerry Seinfeld’s net worth at $950 million, thanks in part to what the publication characterizes as “the most successful television show of all time.” ",
            "date": "Answered March 31, 2019",
            "views": "750",
            "upvotes": " View 4 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Steven Cateris",
                    "user_href": "/profile/Steven-Cateris"
                },
                {
                    "user_id": "David Zarrick",
                    "user_href": "/profile/David-Zarrick"
                },
                {
                    "user_id": "Smeet Almeida",
                    "user_href": "/profile/Smeet-Almeida"
                },
                {
                    "user_id": "VJ Barrath",
                    "user_href": "/profile/VJ-Barrath"
                }
            ]
        }
    ]
}