{
    "title": "How should I read comic books? - Quora",
    "tags": [
        "Image Comics",
        "Graphic Novels",
        "Comic Books",
        "Comics (narrative art)",
        "Reading"
    ],
    "response": [
        {
            "author_info": {
                "name": "Liam Doyle",
                "href": "/profile/Liam-Doyle-7"
            },
            "answer_text": "I’ve read comics all my life. I find that I read pages of comics slower than books. It’s difficult to say. I got into a bad habit at one point where I would scroll down to the bottom of the page and then go back to read it, which can spoil the story a bit. All in all, the pointers everyone has given so far are great. Do try and absorb the panel on its own merit - ie take in the picture and the dialogue. Linger, too - no need to rush. If you find the flow a little confusing (it happens sometimes), go back and reread slowly. Digital editions do help here. Hey, enjoy. When I was 9 and we (my brother and I) had 300 comics, what was great was that those would be read and reread and we totally absorbed (and reabsorbed) our collection. With over 5000 comics now (we haven’t counted in over a 15 years, so I don’t know how many are still at out mom’s place, and each of our apartments have many, many squirreled away - my wife is so great haha), the revisiting is much more seldom, as I mainly get collected editions and miscellaneous missing copies. So if you’re starting out, reread. If something grabbed you,enjoy going back. Art and writing are generally in an amazing place right now, getting complete stories was such a luxury for us when we were young. I can’t tell you how many times Spider-Man/Batman/Thunerbunny/You Name It was to meet certain death, and we NEVER found out how they survived. We just saw them happy and healthy 5 issues later, so hey, they made it. Enjoy. If you haven’t, try and make a point to read Maus (only comic work to win a Pulitzer), The Dark Knight Returns, and Watchmen. If you’re able to get your hands on them, see if you can get Gruenwald and Dwyer’s run on the 80’s Captain America, leading up to #350. They crafted some of the best fight scenes ever committed to the medium. And I’m pretty sure you an get them on the cheap. Probably over-stepped, should have asked what are you reading now? ",
            "date": "Answered December 6, 2016",
            "views": "512",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Sabitha Sudarshan",
                "href": "/profile/Sabitha-Sudarshan"
            },
            "answer_text": "Thanks for the A2A, though this is a little odd for me, considering the fact that I have never given much thought  to the 'how' of reading comics. Nevertheless, I shall attempt to the best of my ability to give a few pointers 1. DO NOT READ THE TEXT AND THE ART SEPARATELY - I've always been a voracious reader, so when I started reading comics about 4 years back, I'd assumed that I would take to reading comics as easy as fish to water. Boy, was I wrong. A common tactic that a lot of the uninitiated do is to finish with the writing, and then go back to the art- a mistake that I tried, only to realize that it was completely spoiling the joy of the narrative for me. The thing about comics (and here I do not mean comic strips or webcomics or the likes of Archies and Friends, but more 'highbrow' stuff from the likes of Alan Moore, Neil Gaiman, Garth Ennis, Grant Morrison, etc.) is that the art at times can be completely at odds with the speech bubble, giving you more cues into what's going on. Unlike a novel, things can get far less self-explanatory, and the readers are left to their own devices to figure things out. In the case of a non-linear narrative, say an Enigma by Peter Milligan or a Lost Girls by Alan Moore, things can get even more crazy- so you need to really, really absorb the two parts together. Take your time with comics. 2. LINGER ON THE PAGE AWHILE- This is basically an elaboration upon the first point. In the hurry to finish off the story, a lot of readers fail to appreciate the nuances that add to the depth and richness. Personally, since I sketch on and off, I find that habit an insult to the illustrator because it's the art that suffers in the process. Take in each panel as a micro-story in itself-you'd find that it'd be easier to connect the dots too.Sketching, inking and illustrating constitute the bulk of a comic, and the art is truly the soul of the book- marvel at it, ponder upon it, and try to decipher its mysteries.  3.GO BACK A FEW PAGES- This always helps, especially if it's a long piece divided into chapters and sub-plots. Unlike a novel, you don't have the cumbersome worry of sometimes following the whole book all over again,and it's a quick reminder of things that have led upto that point. Moreover, a lot of comics contain denouement which is constantly cued in subtly throughout, more so than even movies. It's always a delight to stumble upon it again. I am going to plug in a few other resources that you might find useful. Hannah Berry elaborates on the points that I have mentioned in a far more delightful manner than I ever can right here: Page on booktrust.org.uk User-9687849511466834987's post on the Visual Language of Comic Books should help you in understanding how comic book lovers navigate a piece of work as you try to make sense of the art and the narrative simultaneously. Space Post For more technical details on how pages are distributed in comic books, the potential that comics offer as narratives, etc, I'd suggest a reading of Scott McCloud's Understanding Comics. I hope these help. Have fun! ",
            "date": "Answered July 9, 2014",
            "views": "18",
            "upvotes": " View 7 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Saqib Fazal",
                    "user_href": "/profile/Saqib-Fazal"
                },
                {
                    "user_id": "Patrick Coholan",
                    "user_href": "/profile/Patrick-Coholan"
                },
                {
                    "user_id": "Akshay Deshpande",
                    "user_href": "/profile/Akshay-Deshpande"
                },
                {
                    "user_id": "Aditya Vivek",
                    "user_href": "/profile/Aditya-Vivek"
                },
                {
                    "user_id": "Waqim Aziz",
                    "user_href": "/profile/Waqim-Aziz"
                },
                {
                    "user_id": "Chris Beckman",
                    "user_href": "/profile/Chris-Beckman-1"
                },
                {
                    "user_id": "Neil Sarver",
                    "user_href": "/profile/Neil-Sarver"
                }
            ]
        }
    ]
}