{
    "title": "How to remember a book in one reading - Quora",
    "tags": [
        "Human Memory",
        "Reading",
        "Book Recommendations"
    ],
    "response": [
        {
            "author_info": {
                "name": "Grant Smith",
                "href": "/profile/Grant-Smith-34"
            },
            "answer_text": "It depends on what you mean by \"remember\" and \"one reading\". Remembering a book's content can be thought of as a layering process. You can recall the book's title, the general intent/subject, the structure/main themes, main events and points, and then finally the details of events and points. Recalling the book's title from just \"one reading\" isn't hard, but being able to functionally recall most of the details will take some skill. I can recommend two books on this: Breakthrough Rapid Reading (9780735200197): Peter Kump: Books and The Classic Guide to Intelligent Reading (A Touchstone book): Mortimer J. Adler, Charles Van Doren: 0042516291251: Amazon.com: Books The first will teach you how to not only read faster and more effectively, but also teaches how to segment the content in your brain for easy retrieval. The latter book will teach you how to consume books from a basic, yet relatively advanced, level and then how to approach different genres of books. If you have the legend to a map, then you can more effectively use a map. Different genres of books are structured differently, so you need to understand what the book's purpose is and how to utilize the content in the right way, just like with a map. Quick hint that both books talk about: read books multiple times, descending the levels of abstraction as you go, i.e. peruse for familiarity of the content and structure the first time, then look for more the following times. Reading a book five times through. ",
            "date": "Answered July 23, 2015",
            "views": "13",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Sheila Donaldson",
                    "user_href": "/profile/Sheila-Donaldson-2"
                },
                {
                    "user_id": "Ivan Dolphin",
                    "user_href": "/profile/Ivan-Dolphin"
                },
                {
                    "user_id": "Dickson Otieno",
                    "user_href": "/profile/Dickson-Otieno"
                }
            ]
        },
        {
            "author_info": {
                "name": "Ahmad Ismail",
                "href": "/profile/Ahmad-Ismail-42"
            },
            "answer_text": "Please remember that remembering or recalling is actually an event driven process. What i mean is, You do not need to remember a recipe before you go to the kitchen. And you need to remember the recipe when you go there. Here going to kitchen is an event which needs to trigger/reveal the recipe. We do not need to remember everything every time. But we need to remember it when we need it. Go Old School: Create \"cheat sheet\" / \"checklist\" / \"todo list\" etc Just remember to pull the right repository at the right time. Here you can associate the repository with the event. For example - Stick the recipe on the kitchen wall. This is just an idea. You can scale the idea as much as you want. Ex. \"todo list\" to remind to cook something & remind yourself about the checklist on the next step.Checklist for the ingredients & remind yourself about the cheat sheetCheet Sheet on the kitchen wallCreate a personal wiki. Remember, when writing, write for others. So that anyone can understand the topic. Remember, you will be the other person after couple of days. For books, Bookmarks is a good idea. Take note on the book itself as well. If you use another notebook for note taking then write down the details of the reference note book on the book itself. For electronics readers, things can be easier. However, I must admit that most of the e-readers do not focus on recalling information as and when needed. Though it is the most important thing in learning. If a peace of info does not come to use when needed, then what is the point of acquiring it at the first place. ",
            "date": "Answered August 17, 2016",
            "views": "412",
            "upvotes": "0"
        }
    ]
}