{
    "title": "How to finish a 1,000-page book without getting bored - Quora",
    "tags": [
        "Boredom",
        "Reading"
    ],
    "response": [
        {
            "author_info": {
                "name": "Priya Chander",
                "href": "/profile/Priya-Chander-9"
            },
            "answer_text": "Its not about the number of pages. Its about how the author is able to sustain the interest of the reader in every page and this interest differs from person to person. It could be a science fiction, a historical fiction, a biopic, a thriller, adventure, murder mysteries, romance, comedies, stories based on real life incidents, self help books or even a simple children's fairy tale or a comic book. You need to find out what interests you and for this, you can try out books on different genres by the popular writers of that particular genre. You can search online for author suggestions. And another thing. You don't need to think of finishing the whole book at one shot. Read a few pages, bookmark it and keep it aside. Again, when you get some free time, read a few pages and so on. Don't treat it like a job or a burden. You are reading for your own sake. Hence, it should be like a relaxation. The real secret is, once you start liking the book, you will yourself start making time to read it and the question of boredom wouldn't arise at all. ",
            "date": "Answered August 11, 2020",
            "views": "90",
            "upvotes": " View 4 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Jagdip Madaan",
                    "user_href": "/profile/Jagdip-Madaan"
                },
                {
                    "user_id": "Mani Shankar",
                    "user_href": "/profile/Mani-Shankar-36"
                },
                {
                    "user_id": "Bob Wheeler",
                    "user_href": "/profile/Bob-Wheeler-9"
                },
                {
                    "user_id": "Mohamed Ali",
                    "user_href": "/profile/Mohamed-Ali-2218"
                }
            ]
        },
        {
            "author_info": {
                "name": "Valkyrie Raven",
                "href": "/profile/Valkyrie-Raven"
            },
            "answer_text": "Well if you want to read it for fun then you should already like reading and not get bored by it. You could chose an interesting book if you have the choice and just read when you feel like it. If you get bored easily then don’t try to read too much at once. If you don’t like reading then maybe don’t read a 1000 page book. If you have to read it, then try reading somewhere quiet where you won’t get distracted. Only read when you feel like it and don’t try to read too quickly. Try to think about it in a way that interests you. Otherwise there isn’t really much you can do to not get bored. ",
            "date": "Answered August 11, 2020",
            "views": "43",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Mohamed Ali",
                    "user_href": "/profile/Mohamed-Ali-2218"
                }
            ]
        }
    ]
}