{
    "title": "How to read two books in a day - Quora",
    "tags": [
        "Reading",
        "Book Recommendations"
    ],
    "response": [
        {
            "author_info": {
                "name": "Solanki Samanta",
                "href": "/profile/Solanki-Samanta"
            },
            "answer_text": "Don’t read books just because you have to and it’s there in your curriculum.I think if you really like reading then you can really read two books a day. Ultimately it’s your will which drives you to cross all boundaries.I remember when I was young(to be more specific 13–14 years maybe),I was presented with a detective novel and I got so attached with it that I used to carry that book everywhere I went and it was like while having lunch or supper I kept on reading and reading and was not able to think of anything else other than what is going to come next and in case if you are asking about your text books then I would say that these days you don’t have to rely on a text book solely,there are lot many options like you can google about the topic or even watch you tube videos to enhance your knowledge. ",
            "date": "Answered March 15, 2018",
            "views": "711",
            "upvotes": " View 5 Upvoters",
            "upvoters": [
                {
                    "user_id": "Avranil Maity",
                    "user_href": "/profile/Avranil-Maity"
                },
                {
                    "user_id": "Abhinandan Samanta",
                    "user_href": "/profile/Abhinandan-Samanta"
                },
                {
                    "user_id": "Srijita Chakraborty",
                    "user_href": "/profile/Srijita-Chakraborty-13"
                },
                {
                    "user_id": "Sandeep Rajoriya",
                    "user_href": "/profile/Sandeep-Rajoriya-3"
                },
                {
                    "user_id": "Srija Raha",
                    "user_href": "/profile/Srija-Raha"
                }
            ]
        },
        {
            "author_info": {
                "name": "Pranjal Bajaj",
                "href": "/profile/Pranjal-Bajaj-2"
            },
            "answer_text": "Two books, total 600 pages approximately (300 each), so the question boils down to how to read 600 pages in a day, well google this question and you can find thousands of links which will suggest you methods to achieve this target. But, I would suggest you not to read for a target or to just finish a book, read for pleasure for the joy of reading, let the words slip into your viens , let the characters connect with you and let your imagination weave a magic in the backdrop of story. If you start enjoying reading, you will not have to keep the track of time and soon you will realize that you are reading much more than you actually thought. ",
            "date": "Answered March 15, 2018",
            "views": "410",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Dhruv Arora",
                    "user_href": "/profile/Dhruv-Arora-60"
                },
                {
                    "user_id": "Diksha Dubey",
                    "user_href": "/profile/Diksha-Dubey-6"
                }
            ]
        }
    ]
}