{
    "title": "How to get best books about health - Quora",
    "tags": [
        "Book Recommendations",
        "Books"
    ],
    "response": [
        {
            "author_info": {
                "name": "Andrew Grisham",
                "href": "/profile/Andrew-Grisham-1"
            },
            "answer_text": "You should first learn human anatomy and physiology, microbiology, molecular biology, biochemistry, etc. You'll have to be about the level of a university undergraduate, which might take a few years of dilligent study in the maths and sciences. Perhaps look at the curriculum of a degree in human anatomy and phyiology or cellular and molecular biology from a top university to get an idea of what your curiculum should be. You might even look at graduate medical school preparatory courses. After you've accomplished that and have that knowledge and understanding established in your mind, then you'll be ready for the best books on health. That curriculum can be obtained by looking at the course requirements and book lists at the top medical schools in the world: MIT, ETH Zurich, Harvard, Cambridge, Shanghai Jiao Tong, Johns Hopkins, Singapore, Oxford, Stanford, U Tokyo, I could go on and on but the curriculums are pretty similar. Learning about health is a good and noble goal, and it takes a lot of courage and dedication. I'm not sure what your motivation is, but good luck! ",
            "date": "Answered November 9, 2017",
            "views": "336",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Alaw Sloan",
                "href": "/profile/Alaw-Sloan"
            },
            "answer_text": "Outer Order, Inner Calm: Declutter and Organize to Make More Room for Happiness Gretchen Rubin knows firsthand that creating order can make our lives happier, healthier, more productive, and more creative. But for most of us, a rigid, one-size-fits-all solution doesn't work. When we tailor our approach to suit our own particular challenges and habits, we can find inner calm. With a sense of fun, and a clear idea of what’s realistic for most people, Rubin suggests dozens of manageable tips and tricks for creating a more serene, orderly environment, including: • Never label anything “miscellaneous.”• Ask yourself, “Do I need more than one?”• Don’t aim for minimalism.• Remember: If you can’t retrieve it, you won’t use it.• Stay current with a child’s interests.• Beware the urge to “procrasticlear.” By getting rid of things we don’t use, don’t need, or don’t love, we free our minds (and our shelves) for what we truly value. ",
            "date": "Answered June 2, 2019",
            "views": "66",
            "upvotes": "0"
        }
    ]
}