{
    "title": "How easy is it to publish an e-book? - Quora",
    "tags": [
        "eBook Publishing",
        "Self-Publishing",
        "Book Publishing",
        "Publishing"
    ],
    "response": [
        {
            "author_info": {
                "name": "EJ Knapp",
                "href": "/profile/EJ-Knapp"
            },
            "answer_text": "Well that depends. Do you want it to be a good book or do you just want to toss it into the glut like so many other self-pub books out there? If you favor the latter, you can save yourself some time and ignore the rest of this answer. If you favor the former and would at least like to see your book have - maybe - a snowballs chance in hell of earning enough money to buy a cup of coffee it’s going to take some work and some money and then some more work when you have to take off your writers hat and put on your salesperson hat. That one you’re gonna wear ALOT so make sure it’s comfortable. First thing you have to do is write the thing. Once you have bled yourself dry and the wounds on your head heal (from all the head banging you will do), you need to find a good - read rather expensive - editor. Having your book edited by a competent editor can be a daunting experience for your ego but it is a necessary part of producing a book someone might want to read to the end rather than teach it to fly 2 chapters in. And it’s a hell of a learning experience to boot. While editing is going on, start looking around for a good cover artist. You can spend a lot or a little though I would strongly advise avoiding the little. A good price range to consider is 200 to 500 USD. Trust me, no one pays attention to that old adage ‘don’t judge a book by its cover’. Everyone does. Everyone. Once editing is complete, you need to find a formatter. Yeah, there are a lot software programs out there that will take your Word file and turn it into an eBook. I format e and print books for a living and believe me, the majority of those programs are crap and the ones that aren’t put so much overhead in the finished file that there’s a good chance the book will ‘break’ on some eReaders. Once you find the designer/formatter you want, make sure to tell them you want a Kindle version and an ePub version. The Kindle version is for Amazon, the ePub for the rest of the world. Figure on spending 100 to 300 USD for design and formatting. You can get it cheaper but you’ll get what you paid for. You now have the two versions sitting on your hard drive and you are ready to rock. Your best bet there is to get an account with Kindle Direct Publishing (Amazon) and Smashwords. Once you have your accounts, you want to create titles on both sites. It’s a fairly easy process which I won’t detail here. I advise Smashwords because they distribute to Apple, Kobo, B&N, several library distributors and a subscription service (ScribD) and a whole lot more. You can upload a Word file to them but I strongly suggest you go with just the ePub. There are a few other things you can do along the way. Or not. Find an author in your same genre willing to read your book and give you a blurb you can use. Find some one to read your book and work on the jacket copy. An author should never ever do their own jacket copy. Indeed, the author is the worst possible person to do the jacket copy. Once you’ve completed your journey down this bumpy and hazardous trail, it’s time to break out that salesperson hat. Oh, and stock up on coffee because the majority of your time will be spent promoting and about the only time you’ll actually have to write that next one is the time you used to spend on sleep. And don’t quit your day job right away. You might need it. ",
            "date": "Answered June 25, 2018",
            "views": "372",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Manjinder Singh",
                    "user_href": "/profile/Manjinder-Singh-213"
                },
                {
                    "user_id": "Ishan Aranjikal",
                    "user_href": "/profile/Ishan-Aranjikal"
                },
                {
                    "user_id": "Mike Chandler",
                    "user_href": "/profile/Mike-Chandler-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Deanna Blanchard",
                "href": "/profile/Deanna-Blanchard"
            },
            "answer_text": "Quite easy. You simply go to Amazon’s Kindle Direct Publishing page, register for an account, and follow the steps to upload your manuscript. Or, you can go to Draft2Digital, register for an account, and upload your manuscript in e-book format to Kindle, Nook, Apple Books, Kobo and more at one time. Just a couple of thoughts… I’ve said this in Quora several times before, but I recommend you hire an editor and cover designer before uploading your manuscript. A lame cover and a ton of errors will hurt your sales. Also, consider uploading the paperback version of your book as well. You can do this on Amazon’s KDP platform or with IngramSpark. There are still a lot of people that want to hold a book in their hands. If you don’t also sell your book in paperback, you’ll lose some potential sales. ",
            "date": "Answered April 28, 2020",
            "views": "52",
            "upvotes": "0"
        }
    ]
}