{
    "title": "How and why you became a Harry Potter fan? - Quora",
    "tags": [
        "Wizarding World Fandom",
        "Fanfiction",
        "J.K. Rowling (author)",
        "Harry Potter (Wizarding World character)",
        "Characters of the Wizarding World",
        "Fans and Supporters",
        "Harry Potter (book series)",
        "Harry Potter (movie series)",
        "Harry Potter (creative franchise)"
    ],
    "response": [
        {
            "author_info": {
                "name": "Priya choudhary",
                "href": "/profile/Priya-choudhary-Priya-Choudhary-2"
            },
            "answer_text": "Well , before reading the books or watching the movies with understanding…i remembered some short scene of the movies. Not much I didn't even knew the name just that a four eyes flies a broom or a great hall where a guy(auror) is pacing at the entrance. Untill.i was introduced to it in 9th grade. When my sister was in 12th she started reading it and after that I did too. We would both discuss the events and all. For me it was hard to cope with the philosopher's stone as it was a little bit loose but after reading the chamber of secrets of was amazed . Both with the power and the ability of the wizarding world. I became potter fan after I realised that I started using spells and charms in my real life. And I would go into my fictional world at night. I would curse someone of they made me feel bad/angry or anything good I will use the Blimey catchphrase.. And then I started looking for the merchandise…i can't buy it yet but I have my own harry potter bracelet and watch!! (So less for a potterheads) (+_+) ",
            "date": "Answered April 9, 2019",
            "views": "57",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Ojas Agarwal",
                "href": "/profile/Ojas-Agarwal-2"
            },
            "answer_text": "I guess I was either in class 6th or 7th (12–13 years old) when my elder sister showed me a DVD which had the first 5 parts of Harry Potter Movies in original english. My sister was a big Harry Potter fan at that time, still she made me sit with her and she would pause after each scene and translated the whole thing to me so that I was able to understand what was going on. It was a huge thing for me at that time as before this, I had seen English movies only in hindi dub. After that I re-watched those 5 movies many times till I was able to understand things on my own! This is how I was introduced to the Potter world. After that due to some reasons, I was unable to continue on following Harry Potter. But after my 12th exams(in 2015) were over and I was done by all the competitive exams, I started reading Harry Potter novels, and I completed the whole set of 7 books in around 10–12 days. At that time I was able to understand the depth and the beauty of the potter-world. After that I have re-read the books many a times, watched the movies uncountable times but still I am always ready for a re-run to the whole series. So, I would say that though I was introduced to the potter-world when I was 12 years old, I became a fan when I was 18. Hence, Potterhead since 2015! ",
            "date": "Answered May 3, 2019",
            "views": "144",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Saurabh Baranwal",
                    "user_href": "/profile/Saurabh-Baranwal-29"
                }
            ]
        },
        {
            "author_info": {
                "name": "Dhanabalan",
                "href": "/profile/Dhanabalan-4"
            },
            "answer_text": "How: Before 2015, I knew nothing about HP world. When I was in my room staying alone, one day I have watched the HP third movie and became very interested in Ron and Hermione interaction in that movie. So I searched about them in website and came across the books. I have read all HP books within a week. I haven't slept two straight days. Then I got to know about fanfic. Afterwards my day to day life never completed without Romione stories. I have read HP stories and will read only for Romione and also for Ron. ",
            "date": "Answered May 3, 2019",
            "views": "74",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Jonathan Homafar",
                    "user_href": "/profile/Jonathan-Homafar-1"
                }
            ]
        }
    ]
}