{
    "title": "How has a financial advisor helped you? - Quora",
    "tags": [
        "Financial Advisors",
        "Financial Planning",
        "Financial Advice"
    ],
    "response": [
        {
            "author_info": {
                "name": "Bob Baerker",
                "href": "/profile/Bob-Baerker"
            },
            "answer_text": "Has a financial adviser helped me? Well, yes and no. Because I retired young, about 20 years ago I bought two variable annuities. I am now taking the payout and they are paying for all of my living expenses and will continue to do so until the day I die. I also took out a 10 pay long term care policy (paid off in 10 years) with a 5% COLA that will pay for my medical needs should I become disabled and need some degree of assistance (shopping, dressing, bathing, cooking, etc.) or even round the clock care. I hope to never make that claim but I'm covered I need to. As for investing and growing my assets, I've done that for nearly 40 years and will continue to do so until my mind is fried :->) ",
            "date": "Answered September 1, 2018",
            "views": "60",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Matt Espina",
                    "user_href": "/profile/Matt-Espina"
                }
            ]
        },
        {
            "author_info": {
                "name": "C.J. Ressler",
                "href": "/profile/C-J-Ressler"
            },
            "answer_text": "Prior to retirement, I was a financial planner and my spouse was an attorney. We regularly seek the advice of our CPA and estate planning attorney, as well as the financial advisors at Vanguard and Northwestern Mutual Life, before finalizing our current financial decisions or rebalancing our portfolio. Since retirement, our CPA’s estate planning advice regarding taxation saved us a large sum of money when settling an estate. A CLU, ChFC (who has since also retired) balanced the risk of maximizing my spouse’s pension and provided long-term care insurance. I would not hesitate to seek financial advice from current professionals. ",
            "date": "Answered August 23, 2019",
            "views": "54",
            "upvotes": " View 2 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Matt Espina",
                    "user_href": "/profile/Matt-Espina"
                },
                {
                    "user_id": "Anum Nadeem",
                    "user_href": "/profile/Anum-Nadeem-8"
                }
            ]
        }
    ]
}