{
    "title": "How true is the 10,000 hour rule which was proposed by Malcolm Gladwell? - Quora",
    "tags": [
        "Malcolm",
        "Outliers (2008 book)",
        "10,000 Hours Rule",
        "Malcolm Gladwell (author)",
        "Non-Fiction"
    ],
    "response": [
        {
            "author_info": {
                "name": "Robert Frost",
                "href": "/profile/Robert-Frost-1"
            },
            "answer_text": "It isn’t a rule. The simplified idea that it takes 10,000 hours to become an expert at performing some task is from a book by Malcolm Gladwell. In that book, he is describing research by Ericsson, Krampe, and Tesch-Romer. Specifically, he is summarizing their paper The Role of Deliberate Practice in the Acquisition of Expert Performance. In that paper, they never explicitly say 10,000 hours. What they say is that their data indicates that people who are expert performers in some task got to that level by performing deliberate practice for up to 4 hours a day, five days a week for 10 years. 4 x 5 x 50 (assume they take two weeks of vacation) x 10 equals 10,000. That’s where Malcolm got his tag line number. A key point in their paper is that deliberate practice is required. Deliberate practice is focused. It requires that the persons involved be motivated, it requires that they perform tasks that stress the areas in which they require improvement, and it requires immediate feedback and contemplation of performance. So, just playing basketball every day for four hours isn’t going to turn you into Michael Jordan. Playing golf for four hours a day isn’t going to turn you into Tiger Woods. Playing songs for four hours a day isn’t going to make you a Beatle. Coding for four hours a day isn’t going to make you another Bill Gates. Writing for four hours a day isn’t going to make you Charles Dickens. You would need constant feedback and practice that focused on your weaknesses. They also talk about how the data shows diminishing returns for more than four hours of practice per day. You can’t rush the process. Their message is that, with a few exceptions, the idea of natural talent is overstated. In reality, the people who are experts at what they do got there by hard work and focused improvements. They make clear that there are biological and societal advantages and disadvantages that individuals have. Not everyone who follows the process is going to become an expert. But if you’re looking for the best path to follow, they detail it. Their research is good. Their data is good. Their arguments are good. And it really isn’t that surprising an idea - it comes right out of instructional design. ",
            "date": "Answered December 16, 2018",
            "views": "113",
            "upvotes": " View 352 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Eric Perkins",
                    "user_href": "/profile/Eric-Perkins-6"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/Ketul-5"
                },
                {
                    "user_id": "Murat Çelik",
                    "user_href": "/profile/Murat-Çelik-6"
                },
                {
                    "user_id": "Summer Abs",
                    "user_href": "/profile/Summer-Abs"
                },
                {
                    "user_id": "Gabriel Gamboa",
                    "user_href": "/profile/Gabriel-Gamboa-5"
                },
                {
                    "user_id": "Jonathan Kariv",
                    "user_href": "/profile/Jonathan-Kariv"
                },
                {
                    "user_id": "Refanda Setyaguna Sutrisno",
                    "user_href": "/profile/Refanda-Setyaguna-Sutrisno"
                },
                {
                    "user_id": "Bruno Dal Santo Neto",
                    "user_href": "/profile/Bruno-Dal-Santo-Neto"
                },
                {
                    "user_id": "Gaurav Upasani",
                    "user_href": "/profile/Gaurav-Upasani"
                },
                {
                    "user_id": "Feryal deravi",
                    "user_href": "/profile/Feryal-deravi"
                }
            ]
        },
        {
            "author_info": {
                "name": "Vinnie Tieto",
                "href": "/profile/Vinnie-Tieto-2"
            },
            "answer_text": "Long story short: Yes, the 10,000 hours rule is real. I enjoyed Gladwell’s book “Outliers,” where he presented this, but it’s not his concept. It comes from a 1993 paper written by Anders Ericsson, a professor at the University of Colorado, called The Role of Deliberate Practice in the Acquisition of Expert Performance. 10,000 hours is, of course, a rough estimate. One thing Gladwell misses in his book is the concept of “deliberate practice.” It’s not just spending time doing the skill—it’s *how* you work at the skill that matters. I highly recommend you Google search “deliberate practice” or check out a book called “Talent is Overrated” which does an even better job than Gladwell’s book of explaining all this. In short, you must be constantly striving to push beyond your current skill level, to the point where you’re in a near-constant state of striving and struggling. If it doesn’t sound fun, that’s because it’s not. For example, it’s more fun to just go out and play a round of golf than it is taking 30 or 40 balls into the sand trap and practicing chipping them up onto the green from various positions and angles, over and over again. But if you want to be a well-rounded player, including things like being good at escaping from sand traps, that’s the way to do it. Naturally, not all skills are equally challenging and therefore the amount of time needed to “master” them, or at least get proficient enough to qualify as “professional,” varies. It doesn’t take an incredible amount of skill to play rhythm guitar in a rock band; most rock songs are harmonically simple and you could expect to get up and running in a short amount of time. On the other hand, if you want to play jazz and improvise solos over complex harmonic structures at very fast tempos, you can expect to put in years before you sound halfway decent so in that instance, the 10,000 hour rule is more relevant. You can apply this to most domains. Learning to design a web page using HTML is going to require a lot less skill (and therefore less time) than having the ability to create an e-commerce site on the level of Amazon.com. Becoming a neurosurgeon will require a lot more skill than becoming a nurse, etc. ",
            "date": "Answered September 3, 2018",
            "views": "961",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Fatima Saleh",
                    "user_href": "/profile/Fatima-Saleh-79"
                },
                {
                    "user_id": "Eyup Cetin",
                    "user_href": "/profile/Eyup-Cetin"
                }
            ]
        }
    ]
}