{
    "title": "How to reference a paper which has been accepted but not published yet - Quora",
    "tags": [
        "Academic Publishing",
        "Academic Research Papers",
        "Academic Papers",
        "Academic Research"
    ],
    "response": [
        {
            "author_info": {
                "name": "Alex Coninx",
                "href": "/profile/Alex-Coninx"
            },
            "answer_text": "For accepted papers where you are just waiting for the journal issue to be published, you can use “in press” in place of the year in the in-text citation, for example (Smith et al., in press). (I have also seen “forthcoming” but it’s less common.) And in the references section you can give details, for example “Accepted for publication in Journal of XYZ on 23 January 2017.”) Considering the publishing delays and the amount of backlog some journals have, it is a quite well accepted practice. It is nice to make a draft of the paper available online if you cite it, though. ",
            "date": "Answered February 6, 2017",
            "views": "52",
            "upvotes": " View 6 Upvoters",
            "upvoters": [
                {
                    "user_id": "Renan Prasta Jenie",
                    "user_href": "/profile/Renan-Prasta-Jenie"
                },
                {
                    "user_id": "Martina Michalikova",
                    "user_href": "/profile/Martina-Michalikova"
                },
                {
                    "user_id": "Renuk Lakshman",
                    "user_href": "/profile/Renuk-Lakshman"
                },
                {
                    "user_id": "Barbara Robson",
                    "user_href": "/profile/Barbara-Robson-1"
                },
                {
                    "user_id": "Jessica Wang",
                    "user_href": "/profile/Jessica-Wang-156"
                },
                {
                    "user_id": "Andrew Boysen",
                    "user_href": "/profile/Andrew-Boysen"
                }
            ]
        },
        {
            "author_info": {
                "name": "Shern Ren Tee",
                "href": "/profile/Shern-Ren-Tee"
            },
            "answer_text": "In addition to the previous answers, some disciplines may have a “preprint” server where papers awaiting publication can be made available to a general audience. If your journal permits, you could upload the paper to that server, and then cite that copy of the paper. For example, in physics the arXiv holds preprints and can very much be cited - indeed, one fairly well-cited paper in the field of polymer statistical physics only exists on arXiv, having apparently never made into publication despite being very useful for a very specific problem. ",
            "date": "Answered February 6, 2017",
            "views": "43",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Renan Prasta Jenie",
                    "user_href": "/profile/Renan-Prasta-Jenie"
                },
                {
                    "user_id": "Jessica Wang",
                    "user_href": "/profile/Jessica-Wang-156"
                }
            ]
        }
    ]
}