{
    "title": "How much of a $100 do publishers keep when you publish a book? - Quora",
    "tags": [
        "Book Publishers",
        "Publishing Companies",
        "Publishers",
        "Self-Publishing",
        "Book Publishing",
        "Publishing",
        "Writers and Authors",
        "Writing"
    ],
    "response": [
        {
            "author_info": {
                "name": "Doris Booth",
                "href": "/profile/Doris-Booth-1"
            },
            "answer_text": "In the traditional publishing world, a publisher keeps about $20 out of $100 after paying the wholesaler and distributor. Out of that $20 the publisher must pay all overhead and production expenses as well as your royalties. This varies widely depending on what deals the publisher makes with the distributor and other costs. Below is an example from my book, Unlocking the Secrets of E-Book Publishing, that may help. HOW ROYALTY PLANS IMPACT YOUR EARNINGS It is important that you clearly understand how royalties are calculated by retailers. What may seem like a great deal could in fact, cost you more earnings in the long run. Here are some basic definitions. List Price: The advertised full retail price of the book. Net price: The publisher’s income AFTER the retailer has taken its cut. Additional fees may be deducted from the net price, such as printing costs. Wholesale discount rate: The discounted rate (price off) at which a book is offered by the publisher to the retailer is usually 55%. That’s not the percentage of the sale you get to keep. It is the percentage you are giving to the retailer off the list price. Whether a royalty rate is based on the list price of a book or the net price makes a huge difference in what you earn. Believe it or not, a 70% royalty rate may not earn you as much as a 35% royalty rate depending on whether the retailer calculates the royalty at the net price of the book or the gross price. Be aware as you evaluate individual retailers. Some examples will help you see how this works. Assume a book sale price of $9.99 and wholesale discount @ 55%: Vendor A (Smashwords) pays 70% of net = $3.15 Vendor B (Amazon 35% plan) pays 35% of list/gross= $3.50 Where are you likely to make more money? Authorlink ",
            "date": "Answered September 1, 2019",
            "views": "387",
            "upvotes": " View 2 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Carlos Arana",
                    "user_href": "/profile/Carlos-Arana-13"
                },
                {
                    "user_id": "Sethuraman Ramanujam",
                    "user_href": "/profile/Sethuraman-Ramanujam"
                }
            ]
        },
        {
            "author_info": {
                "name": "Andrew Chapman",
                "href": "/profile/Andrew-Chapman-75"
            },
            "answer_text": "Your question is smart to ask, but confusing. If you publish a book, then you are the publisher — so who are you referring to? And is this money from sales of the book? Or are you referring to a publisher’s income from an author (i.e., hybrid or vanity publishing)? You might even be referring to paying for publishing services (editing, design, etc.), which is not the same as being published. So again, this is confusing, and there are too many potential answers. I’ll give you the simplest one, in case it’s what you were asking. For $100 worth of retail sales of books in the United States, in a trade-publishing deal, here are approximate allocations of the money: Distributor/wholesaler — $55Author — $15So, that leaves $30 to the publisher. BUT… Keep in mind that this $30 is not profit or “free and clear” to put in the publisher’s pocket. This $30 needs to recover all the money invested to produce the book (edit, design, etc.). It needs to cover general business expenses, such as office rent, staff payroll, business development, trade shows and conferences, and taxes. And it needs to include enough of a margin (profit) to allow for the fluctuations of revenue and, ideally, to grow the business. Worth noting as well: in trade publishing, roughly 8 out of 10 titles do not earn back the publisher’s investment; one breaks even or does just okay; and one earns decent to great revenue. So, that $30 from $100 in retail sales also has to cover the losses on titles that don’t earn enough money. And on top of that, the publisher may have lost money (more expenses than revenue) for a number of years to start, which effectively has to be earned back. So, all of this essentially explains why authors get turned down so much by publishers. As you can see from my simplified breakdown above, publishers need to be very diligent about what authors/books they accept — or they’ll be out of business quickly. I’ve mentioned many times in my seminars, classes, and talks that book proposals are turned down as often (if not more often) for financial reasons as for literary/quality reasons. But most authors have absolutely zero clue about the economics and risks of book publishing. They see their meager royalty percentages and naively think their publishers are greedy. They get rejected and think publishers are insensitive and heartless. They see the bestsellers of the world and think their publishers aren’t doing enough. Ultimately, what a publisher typically “keeps” (i.e., profits) is $5–7 of that $100 in retail sales — if this publisher has been in business for a few years, has developed a solid catalog of titles, the business is going well, and it’s managing its money smartly. In other words, this is a successful publisher. [Answered: How much of a $100 do publishers keep when you publish a book?] ",
            "date": "Answered August 29, 2019",
            "views": "367",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Eileen M. Gormley",
                    "user_href": "/profile/Eileen-M-Gormley"
                }
            ]
        }
    ]
}