{
    "title": "How to publish a book on my own in India - Quora",
    "tags": [
        "24by7publishing.com",
        "ISBN India",
        "Pothi.com",
        "Self-Publishing"
    ],
    "response": [
        {
            "author_info": {
                "name": "Bhargava Adepalley",
                "href": "/profile/Bhargava-Adepalley"
            },
            "answer_text": "Hi there, Disclaimer First: I am one of the founders @ Notion Press Publishing. If you have already written your book, you have a few options. 1. You could approach traditional publishers like Penguin, Harper Collins, Hachette etc. who are all renowned names in traditional publishing, and submit your manuscript for a review. However, traditional publishers get bombarded with hundreds of manuscripts and take a long time to even go through them ( if at all they do ). More often than not, they also reject first time authors such as yourself due to a perceived risk of publishing an unknown name. 2. You could subsequently approach any self-publishing platform similar to Notion Press and work with a team of book experts who will take care of the entire publishing process and bring both the print and eBook version of your book out to the market. In this guided publishing model, you will own 100% of the rights to the book and take home 100% of the profits from book sales. Notion Press has published close to 4000 first time writers so far in the span of 6 years. To know more about how this works you can check out the website link given above. 3. Your third option would be to publish it by yourself by using platforms like Kindle Direct Publishing or Createspace. These are essentially do-it-yourself platforms which would essentially require you to take care of every aspect of publishing ie. cover design, interior formatting, editing etc by yourself. Once you have all these things in place, you can just upload it onto the platform and they will compile it as a book and you can start selling it on online stores. Such platforms are mostly free to use and take a commission from each book’s sale and pay remaining profit as royalty. ",
            "date": "Answered March 30, 2018",
            "views": "3588",
            "upvotes": " View 1.4K Upvoters ",
            "upvoters": [
                {
                    "user_id": "Ganesh Ashwin",
                    "user_href": "/profile/Ganesh-Ashwin-1"
                },
                {
                    "user_id": "Dirghayu Kaushik",
                    "user_href": "/profile/Dirghayu-Kaushik-2"
                },
                {
                    "user_id": "Isha Kachhap",
                    "user_href": "/profile/Isha-Kachhap-1"
                },
                {
                    "user_id": "Keshav Mehrotra",
                    "user_href": "/profile/केशव-मेहरोत्रा-Keshav-Mehrotra-1"
                },
                {
                    "user_id": "Aryan Kumar Prasad",
                    "user_href": "/profile/आर्यन-कुमार-प्रसाद-Aryan-Kumar-Prasad"
                },
                {
                    "user_id": "Syed Ahmed Sohaib Hashmi",
                    "user_href": "/profile/Syed-Ahmed-Sohaib-Hashmi"
                },
                {
                    "user_id": "Kridha Sadhwi",
                    "user_href": "/profile/Kridha-Sadhwi"
                },
                {
                    "user_id": "Sathish Kathiravan",
                    "user_href": "/profile/Sathish-Kathiravan-1"
                },
                {
                    "user_id": "Mitu Kumar",
                    "user_href": "/profile/Mitu-Kumar-7"
                },
                {
                    "user_id": "Harsh Pradhan",
                    "user_href": "/profile/Harsh-Pradhan-8"
                },
                {
                    "user_id": "Roshan Deepak Pinto",
                    "user_href": "/profile/Roshan-Deepak-Pinto"
                },
                {
                    "user_id": "Anand Kumar",
                    "user_href": "/profile/Anand-Kumar-3045"
                },
                {
                    "user_id": "Vini Sharma",
                    "user_href": "/profile/Vini-Sharma-23"
                },
                {
                    "user_id": "Preeti L",
                    "user_href": "/profile/Preeti-L-2"
                },
                {
                    "user_id": "Megha Chovatiya",
                    "user_href": "/profile/Megha-Chovatiya"
                },
                {
                    "user_id": "Subham Swami",
                    "user_href": "/profile/Subham-Swami-3"
                },
                {
                    "user_id": "Bhoomika Dekate",
                    "user_href": "/profile/Bhoomika-Dekate"
                },
                {
                    "user_id": "Siddhant Wadhwa",
                    "user_href": "/profile/Siddhant-Wadhwa-5"
                },
                {
                    "user_id": "Trupti Lad",
                    "user_href": "/profile/Trupti-Lad-2"
                },
                {
                    "user_id": "Kumar Chetan",
                    "user_href": "/profile/Kumar-Chetan-2"
                },
                {
                    "user_id": "Indrazith Shantharaj",
                    "user_href": "/profile/Indrazith-Shantharaj"
                },
                {
                    "user_id": "Krishnamoorthy Muniyan",
                    "user_href": "/profile/Krishnamoorthy-Muniyan"
                },
                {
                    "user_id": "Gauthem Raam",
                    "user_href": "/profile/Gauthem-Raam"
                },
                {
                    "user_id": "Shiva Boora",
                    "user_href": "/profile/Shiva-Boora"
                },
                {
                    "user_id": "Yoshida Rao",
                    "user_href": "/profile/Yoshida-Rao"
                },
                {
                    "user_id": "Jay Vivekanand",
                    "user_href": "/profile/Jay-Vivekanand"
                },
                {
                    "user_id": "Satam Roy",
                    "user_href": "/profile/Satam-Roy"
                },
                {
                    "user_id": "Hamsika",
                    "user_href": "/profile/Hamsika"
                },
                {
                    "user_id": "Randhir Pandey",
                    "user_href": "/profile/Randhir-Pandey-8"
                },
                {
                    "user_id": "Blessy Asari",
                    "user_href": "/profile/Blessy-Asari"
                }
            ]
        },
        {
            "author_info": {
                "name": "Shreya Pandey",
                "href": "/profile/Shreya-Pandey-23"
            },
            "answer_text": "You don’t really need any formal qualifications to be a published author (unless you’re writing an academic text or a self-help book. For fiction, you only need to be a good story teller with an interesting book.) I’ll be talking about traditional publishing (where you approach an established publishing house) a work of fiction. One can self-publish if they like, but I’m not well versed with that. There are pros and cons to self publishing as well as traditional publishing. So make sure to do your research first. Alright so, the steps—  You write a book, duh. You edit it to the best of your abilities. You make sure the plot is well structured and the characters are well-constructed. Also keep an eye out on the genre and the length of your book and research a little. For instance, Contemporary Romance novels are generally 60,000 to 90,000 words in length. Make sure to find out a little about the ideal length for your genre and try not to exceed it too much.  Scope out publishers. Of course, we’d all like to get published by one of the big publishing houses but it’s not that easy. So to be on the safe side, look up some smaller publishing houses too. Check out their websites (don’t trust publishing houses that don’t have a decent and informative website, in my opinion.) See the kind of books they’ve published in the past. Check their ratings, sales and reviews on amazon and goodreads to get some idea of their success. If you’ve written a science-fiction novel, pay attention to their scifi books. How well did they perform in the market? Read a sample on amazon if it’s available to figure out the level of writing this publishing house seeks. Another thing you should try to find out are their marketing strategies. Look up their social media handles. See how they’ve promoted books in the past. Have they held any events? What are their techniques. If the publishing house seems to have a good marketing strategy and has had decent amount of sales for books in your genre, you should consider it.  Next, the procedure. You can find manuscript submission guidelines on the publisher’s website itself. They might differ from publisher to publisher, but usually all of them have similar requirements. They either have an in-built form for manuscript submission or they provide an email. Some of them actually demand physical copies instead of soft-copies. Some of them (usually the big ones) do not accept manuscripts from writers at all. Instead, they demand the author should have a literary agent who pitches the novel first (this is rare in India though.) Basically, read the submission guidelines. It’ll give you all the information.  What you’ll generally have to do is write an email to the publisher. Every publisher has their own requirement but usually you’ll have to write a synopsis for your novel, a summary of the novel and attach a designated number of chapter (3–5 usually.) Some publishers directly ask you to send the whole novel. Basically, read the submission guideline carefully and follow it up properly otherwise your email won’t even be read. I won’t get into giving you tips to write that email, I’m not experienced enough. But it’s basically you marketing your own book to the publisher. You must be able to convince them with your synopsis or pitch (which is basically a 30–50 word long para that accurately describes what your book is about, that your book is worth reading and that they ought to give it a chance. This is extremely important with big publishing houses who get lots of manuscripts and emails, so they cannot read all of them.  If your book is rejected, you might get an email stating so in a few weeks time from small publishing houses. The big ones might not even reply. The publishers usually mention a time period on their website, stating if you don’t get a response by then, you can assume your book was declined. In case you are accepted, someone from the publishing house will contact you and ask you to send the rest of the manuscript so they can do a close reading of it. Now this doesn’t mean your book has been approved. But it means they are interested, that they found your book marketable and it appears to be well-written. If the rest of your book is as promising as the first few chapters, you’ll probably get a publishing deal. Now publishing houses are very adamant about one thing—if they’re doing a close reading of your manuscript, no other publisher should be doing it. They don’t want to waste their energy on reading your book only to find out you rejected them later for another publisher. So you’re expected to inform them at this point if any other publisher has also shown interest. In the rare occasion that you have more than one publishers interested, you’ll have to make a decision and say no to one. This is why it’s not advised to send your book to too many publishers at the same time, especially if you’re dealing with larger publishing houses. Also tip, don’t immediately send out your first email to your number one publisher. Start with a smaller house. In case you get rejected by them, you’ll know you need to work on your book or improve your pitch (you could ask them for feedback/review.) In case you’re accepted, you can either go ahead with them or take a risk and send your work to a bigger publisher.  Big publishing houses usually take six months to read your manuscript closely. Smaller publishing houses might take lesser time. You can inquire from time to time, but don’t pester them with emails. Let them take their time. Unfortunately, you could still get rejected after six months of waiting and then you’ll have to start all over again with other publishers. In case you’re accepted, they’ll offer you a publishing contract. Make sure to read it very carefully. Do your research and don’t be afraid of asking them questions and clarifications. You might be able to negotiate the contract with smaller publishing houses, but don’t even try with the big ones. Once you find everything to your liking, you can sign it and you’ve gotten your contract. But there’s still a lot to be done!  They’ll probably provide you with detail feedback for your novel. They might request you to re-edit your book or make some changes, after which your book will be sent to an in-house publisher who will edit it further and then probably send it back to your for a final look-over. Your work load from here will probably decrease. Since it’s the traditional way, just sit back and relax a little. The publisher will figure out when the book can be launched, they’ll figure out marketing tactics and the cover (they might ask for your input in this but they’re not obliged to.) They’ll even set up your website or Facebook page if you don’t have one.  Once everything is planned and ready, they’ll get ready to launch your book. They’ll hold some promos and marketing events if they have enough resources. You might or might not have to be a part of these events, it depends on their strategy. They might even give out pre-published copies of your book for free to select reviewers to generate discussion around your book in media and to generate reviews on amazon and goodreads to further promote sales. They might hold a book launch event if they’re a big publishing house.  Once your book gets launched, you don’t have to do much. They’ll handle reviews and advertisements. You might be asked to post stuff from time to time or engage with your readers. Once your book generates the decided amount (stated in the contract) through sales, you’ll be eligible to get paid. You might be paid once or twice a year in bulk (this varies from publisher to publisher.) I guess that’s about it! Hope this was helpful. Just make sure to do your research. Don’t get too excited and jump into a publishing deal.  ",
            "date": "Answered May 3, 2018",
            "views": "167",
            "upvotes": " View 117 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Debajyoti Das",
                    "user_href": "/profile/Debajyoti-Das-14"
                },
                {
                    "user_id": "Chalapathi Valle",
                    "user_href": "/profile/Chalapathi-Valle-1"
                },
                {
                    "user_id": "Athira Athi",
                    "user_href": "/profile/Athira-Athi-13"
                },
                {
                    "user_id": "Tanyut Sharma",
                    "user_href": "/profile/Tanyut-Sharma-3"
                },
                {
                    "user_id": "Vimal Gedam",
                    "user_href": "/profile/Vimal-Gedam"
                },
                {
                    "user_id": "Krishnakumar Shetti (ಕೃಷ್ಣಕುಮಾರ್ ಶೆಟ್ಟಿ)",
                    "user_href": "/profile/Krishnakumar-Shetti-ಕೃಷ್ಣಕುಮಾರ್-ಶೆಟ್ಟಿ"
                },
                {
                    "user_id": "Souhardya De",
                    "user_href": "/profile/Souhardya-De-4"
                },
                {
                    "user_id": "Aleena",
                    "user_href": "/profile/Aleena-41"
                },
                {
                    "user_id": "Saman Singh",
                    "user_href": "/profile/Saman-Singh-2"
                },
                {
                    "user_id": "Madhurima Dutta",
                    "user_href": "/profile/Madhurima-Dutta-7"
                },
                {
                    "user_id": "Anju Nikhil",
                    "user_href": "/profile/Anju-Nikhil"
                },
                {
                    "user_id": "Suhrid Paul",
                    "user_href": "/profile/Suhrid-Paul-2"
                },
                {
                    "user_id": "Sumit Bara",
                    "user_href": "/profile/Sumit-Bara-1"
                },
                {
                    "user_id": "Komal Khedkar",
                    "user_href": "/profile/Komal-Khedkar-3"
                },
                {
                    "user_id": "Pradip Karmakar",
                    "user_href": "/profile/Pradip-Karmakar-46"
                },
                {
                    "user_id": "Survi Bharadwaj",
                    "user_href": "/profile/Survi-Bharadwaj"
                },
                {
                    "user_id": "Aditya Goyal",
                    "user_href": "/profile/Aditya-Goyal-57"
                },
                {
                    "user_id": "Krishna Bindu",
                    "user_href": "/profile/Krishna-Bindu-1"
                },
                {
                    "user_id": "Ojasvin Education",
                    "user_href": "/profile/Ojasvin-Education"
                },
                {
                    "user_id": "Sai Vamshi",
                    "user_href": "/profile/Sai-Vamshi-14"
                }
            ]
        },
        {
            "author_info": {
                "name": "Ayushmann Bajpayee",
                "href": "/profile/Ayushmann-Bajpayee"
            },
            "answer_text": "Its complicated. You will get various types of publishing processes when you Will come across the web. But I don't want anyone to be in such trouble in which I was. Traditional- Penguin, Roopa, Srishti. These are few publishers which will first ask for your book's summary and few sample chapters and then Will take some months or weeks. Penguin takes 6 months while others take few weeks. And If they will be interested they will ask the whole book from you and then they will review it and tell the final decision l. And its completely free if approved. You even get advance. Self publish- In paperback- Free and paid both are there but truly there is no free option yet. Notion and white falcon are two of such publishing house. They will definitely publish your book If you will choose a paid publishing package. It ranges fron 25k to 1lakh. Ebook self publish- In Indian companies I don't have quite good knowledge but smashwords is the one and easiest way to publish your book for free remember its ebook. You have ro sign up there and fill the required form like synopsis and about the book fillings and your main file and cover page. Within a minute your book will be on web. A better option will be kDP. Its a free service by amazon and a bit liberalized too. Same process as Smashwords but it takes 1 day to be available on web. You can pay a fee to promote your ebook. Print on demand- Again kdp is the option for your book will be at lwleastast od price 5 dollars to you and your reader. Its free but not good for sales. Freeself publish its a website which may help you. Remember it may. So these are some suggestions by me from my personal experiences. My ebook is available in smashwords and Amazon. Since u have gained entry in the premium catalogue of smashwords its available in some more platforms. ",
            "date": "Answered July 11, 2017",
            "views": "24",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Charu Bhatnagar",
                    "user_href": "/profile/Charu-Bhatnagar-15"
                },
                {
                    "user_id": "Swat Gill",
                    "user_href": "/profile/Swat-Gill"
                },
                {
                    "user_id": "Devansh Agrawal",
                    "user_href": "/profile/Devansh-Agrawal-66"
                },
                {
                    "user_id": "Khushboo Chaturvedi",
                    "user_href": "/profile/Khushboo-Chaturvedi-5"
                }
            ]
        },
        {
            "author_info": {
                "name": "Manoj Kumar Mandloi",
                "href": "/profile/Manoj-Kumar-Mandloi-1"
            },
            "answer_text": "Hi, this is one of the most asked questions all around the world. That how can I become an author? How can I publish my own book? No publishing company wants to work with me……. and so on. The reason why all the publishing company or let say few of them don't want to work with an amateur is that they don’t know the reaction of the readers about that particular author. Similarly, in our Bollywood, you have to work hard to make your place similarly is the literature world. Either you have a great fan following on social media or you are a well-known writer of the century then only the publishing house wants to gamble on you. So, the question is how I can publish my own book without going to a publishing house and the answer for you is to go for self-publishing. Now the case is that you might be the best storyteller in the world and I believe you are. But you can’t be a one-man army, what I want to say is you can’t be your own editor, beta-reader, book cover designer, book interior designer, social media marketer, and so on. Suppose you have finished your manuscript and you know what you have completed it because you love the storyline since it was in your mind you think that the story is believable since you wrote it you think there are no mistake because it’s human nature that we cannot point out our own mistakes. Am I correct? Yup, that is what human nature is. So, first of all, go for the beta-readers, you can find them on Instagram or any other social media platform, or else you can higher them from Fiverr or any other freelancing site. After beta reading you should go for editor, you will find lots of them who are willing to work and can find out the mistake and improve them at the same time. Once you are done with them start looking for someone who can format your book for KDP, Createspace, Lullu. These all are the self-publishing platforms where you can publish your book without any hesitation. Also at the same time ask a graphic designer to design a cover for your book as per the industrial requirement. Hire a social media marketer to do marketting of your book on social media because “जो दिखता है वही बिकता है\" Upload the details on the website on kindle or Createspace or any of the self-publishing platform that you like. Hit publish and you are done. Hope this helps! ",
            "date": "Answered August 6, 2020",
            "views": "12",
            "upvotes": " View 7 Upvoters",
            "upvoters": [
                {
                    "user_id": "Sunita Singh",
                    "user_href": "/profile/Sunita-Singh-402"
                },
                {
                    "user_id": "Sona Bhatnagar",
                    "user_href": "/profile/Sona-Bhatnagar-1"
                },
                {
                    "user_id": "Bismay Behura",
                    "user_href": "/profile/Bismay-Behura"
                },
                {
                    "user_id": "Vel Vignesh",
                    "user_href": "/profile/Vel-Vignesh-3"
                },
                {
                    "user_id": "Jahnvi Singh",
                    "user_href": "/profile/Jahnvi-Singh-21"
                },
                {
                    "user_id": "Anjali Kumar",
                    "user_href": "/profile/Anjali-Kumar-43"
                },
                {
                    "user_id": "Chalapathi Valle",
                    "user_href": "/profile/Chalapathi-Valle-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Harsh Adani",
                "href": "/profile/Harsh-Adani"
            },
            "answer_text": "I have seen many writers aspiring to self-publish their book which is really great to see. But the major drawback I feel is that none of them ever know the true method of self-publishing. I don’t blame anyone for that because, when it comes to self-publishing, the first results which the google would produce are all the vanity publishers, who claim to publish your book by offering some fancy packages (Which aren’t really fancy) and few worthwhile services. PLEASE NOTE, THAT IS NOT THE ENTIRE CONCEPT OF SELF-PUBLISHING! They are what you say the middlemen who’d help you with all the services you require in return for your money and also royalty on every sale! Want to know what is REAL SELF-PUBLISHING? READ ALONG. A self-publishing author or more commonly known as an Indie-Author would finish his manuscript, Find an editor by himself, find a cover artist by himself and then instead of approaching any publishing company he/she would approach the PRINTING PRESS. Any local as well as well-known printing company will offer to print your books at reasonable rates if you order in bulk. I’d say they’d offer you between 500 copies, 1000 or 2000 copies. Print on Demand (POD) would be too costly for you. By far I am guessing that since you are opting for self-publishing your book that means you’d at least have a budget of around 1 lac rupees which is more than enough and which could be easily recovered in the 1st or 2nd month of your book release (If you have good sales, that is if you have a ready made audience or marketing plan). That’s it! Once you make a deal with the printing company. take care of all other requirements such as Typesetting your book and ebook creation (Generally a professional would offer both things hand in hand at a reasonable rate). Next step is to get copyrights which is easy if you just google it and lastly, ISBN number which can be obtained for free as well. And there you go! Get your book printed, start an Amazon seller account, boost your sales through pre-orders and follow your marketing plan lead. Once you have a decent sale on amazon, you can approach the local book stores as well who’d be willing to keep your books as far as it is returnable*. THIS PROCEDURE IS THE REAL WAY OF SELF-PUBLISHING. For some of you it may sound as a lengthy or a tiresome process but trust me if you really believe in your story and the years/months of hard-work which you have done for it, then this approach would be one of the best experience for you and WAY BETTER than those vanity publishers who claim to be NO. 1 publishers. Look at the reality, how many authors have fallen for their traps and almost given up on their writing careers. Things are really different in India when it comes to the publishing industry, so beware, look for the right things, right approach. I’ll soon post an article on my website about this matter. I hope whoever reads this, it helps you and trust in yourself and your story, You can do it (: ",
            "date": "Answered April 27, 2020",
            "views": "18",
            "upvotes": " View 17 Upvoters",
            "upvoters": [
                {
                    "user_id": "Sunita Singh",
                    "user_href": "/profile/Sunita-Singh-402"
                },
                {
                    "user_id": "Devansh Saluja",
                    "user_href": "/profile/Devansh-Saluja-1"
                },
                {
                    "user_id": "Srishti Raj",
                    "user_href": "/profile/Srishti-Raj-7"
                },
                {
                    "user_id": "Sona Bhatnagar",
                    "user_href": "/profile/Sona-Bhatnagar-1"
                },
                {
                    "user_id": "Siva Kumar",
                    "user_href": "/profile/Siva-Kumar-1923"
                },
                {
                    "user_id": "Preet Singh",
                    "user_href": "/profile/Preet-Singh-768"
                },
                {
                    "user_id": "Jinia Mondal",
                    "user_href": "/profile/Jinia-Mondal-1"
                },
                {
                    "user_id": "Aditya Raj",
                    "user_href": "/profile/Aditya-Raj-638"
                },
                {
                    "user_id": "Kevin Zenith",
                    "user_href": "/profile/Kevin-Zenith"
                },
                {
                    "user_id": "Vishal Panchal",
                    "user_href": "/profile/Vishal-Panchal-150"
                },
                {
                    "user_id": "Aakash Ingal",
                    "user_href": "/profile/Aakash-Ingal"
                },
                {
                    "user_id": "Tanyut Sharma",
                    "user_href": "/profile/Tanyut-Sharma-3"
                },
                {
                    "user_id": "Vishnu",
                    "user_href": "/profile/Vishnu-845"
                },
                {
                    "user_id": "Lalita Kumari",
                    "user_href": "/profile/Lalita-Kumari-244"
                },
                {
                    "user_id": "Sasha Khan",
                    "user_href": "/profile/Sasha-Khan-47"
                },
                {
                    "user_id": "Speak Your Heart",
                    "user_href": "/profile/Speak-Your-Heart-1"
                },
                {
                    "user_id": "Lois Mendelsohn",
                    "user_href": "/profile/Lois-Mendelsohn"
                }
            ]
        },
        {
            "author_info": {
                "name": "Praveen Venkiteswara Annu",
                "href": "/profile/Praveen-Venkiteswara-Annu"
            },
            "answer_text": "There are two ways you could publish your book: Traditional publishingSelf-publishingI do not have experience with traditional publishing. However, you could consider self-publishing, like I did. All major self-publishing platforms also support authors from India. Here are some that you can try. Self-publish your book to Amazon's Kindle Store - free to self-publishEbooks from independent authors and publishers - free to self-publishDraft2Digital | Welcome - free to self-publishGoogle Books - free to self-publishFor print books, a print on demand service like CreateSpace (free to self-publish) is probably the best bet, but delivery to India might be expensive compared to the US, Canada and Europe. If you are looking for an Indian company to help with publishing, Self Publishing and Print on Demand in India (free service if you can provide fully formatted content) or Book Publishers in India (paid service) could be considered. Royalties on KDP, the largest marketplace for eBooks vary from 35% to 70% depending on the pricing of the book, the country in which the purchase is made and also based on whether you enroll in KDP Select (where you have to keep your books exclusive to Amazon). Details are available at the link provided above. Royalties on other platforms vary from 30% to 60%. There are no legal issues that I am aware of, other than the fact that income from royalties will be taxable in India. Also look at the pros and cons of self-publishing vs. traditional publishing below. Self Publishing Pros Better control of the publishing process - complete creative freedom to choose what you want to include and howBetter royalties - no cut for the publisher. You decide your pricing and royalties. eBook royalties can be as high as 70%.Faster to market - you can self-publish an eBook that you have ready in a matter of minutes and make it available worldwideNo restrictions for newbie authorsCons Discoverability - your book is the proverbial needle in the haystackMarketing - you are responsible for all marketing effortsIf you are opting for a print edition, there might be an upfront cost involved - except in the case of Print-on-demand optionTraditional Publishing Pros You have the backing of a reputed publishing house - better discoverabilityMarketing is part of the book publishing deal and the publisher helps to an extentProfessional editing, formatting and cover designMade available through all major bookstores and online retailersCons Can take a significant amount of time (months) to get a book to the marketNew authors might find it difficult to get the backing of a good publisher - others might charge a one time publishing fee starting from INR 25,000.Lower royalties - 10 - 15% of selling price for print editionsDo feel free to let me know if you have any specific questions. Good luck with your book! ",
            "date": "Answered June 13, 2016",
            "views": "126",
            "upvotes": " View 41 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Vivek Srivastava",
                    "user_href": "/profile/Vivek-Srivastava-152"
                },
                {
                    "user_id": "Amita Kubal",
                    "user_href": "/profile/Amita-Kubal"
                },
                {
                    "user_id": "Preet Singh",
                    "user_href": "/profile/Preet-Singh-768"
                },
                {
                    "user_id": "Vel Vignesh",
                    "user_href": "/profile/Vel-Vignesh-3"
                },
                {
                    "user_id": "Sai Vamshi",
                    "user_href": "/profile/Sai-Vamshi-14"
                },
                {
                    "user_id": "Charu Bhatnagar",
                    "user_href": "/profile/Charu-Bhatnagar-15"
                },
                {
                    "user_id": "Kartik Bhalla",
                    "user_href": "/profile/Kartik-Bhalla-8"
                },
                {
                    "user_id": "Bhaskar Aggarwal",
                    "user_href": "/profile/Bhaskar-Aggarwal"
                },
                {
                    "user_id": "Sàmàr Jöshî Pràdhàn",
                    "user_href": "/profile/Sàmàr-Jöshî-Pràdhàn"
                },
                {
                    "user_id": "Jibran Suhail",
                    "user_href": "/profile/Jibran-Suhail"
                },
                {
                    "user_id": "Punam Singh Chandel",
                    "user_href": "/profile/Punam-Singh-Chandel"
                },
                {
                    "user_id": "Shubham Singhal",
                    "user_href": "/profile/Shubham-Singhal"
                },
                {
                    "user_id": "Bharat Arya",
                    "user_href": "/profile/Bharat-Arya-21"
                },
                {
                    "user_id": "Balambika G",
                    "user_href": "/profile/Balambika-G"
                },
                {
                    "user_id": "Amit Kumar Maurya",
                    "user_href": "/profile/Amit-Kumar-Maurya-27"
                },
                {
                    "user_id": "Sk Academy",
                    "user_href": "/profile/Sk-Academy"
                },
                {
                    "user_id": "Pranav Mishra",
                    "user_href": "/profile/Pranav-Mishra-242"
                },
                {
                    "user_id": "Suyash Pandey",
                    "user_href": "/profile/Suyash-Pandey-71"
                },
                {
                    "user_id": "Sumeru roy Chaudhury",
                    "user_href": "/profile/Sumeru-roy-Chaudhury"
                },
                {
                    "user_id": "Aishah Murshida",
                    "user_href": "/profile/Aishah-Murshida"
                },
                {
                    "user_id": "Ankita Ghosh",
                    "user_href": "/profile/Ankita-Ghosh-280"
                },
                {
                    "user_id": "Muhammed Adedokun",
                    "user_href": "/profile/Muhammed-Adedokun"
                },
                {
                    "user_id": "Saivamsi Svkl",
                    "user_href": "/profile/Saivamsi-Svkl"
                },
                {
                    "user_id": "Kumar L Author",
                    "user_href": "/profile/Kumar-L-Author"
                },
                {
                    "user_id": "Yadu Hemanth",
                    "user_href": "/profile/Yadu-Hemanth"
                },
                {
                    "user_id": "Ashish Malhotra",
                    "user_href": "/profile/Ashish-Malhotra-118"
                },
                {
                    "user_id": "Debojyoti Roy (দেবজ্যোতি রায়)",
                    "user_href": "/profile/Debojyoti-Roy-দেবজ্যোতি-রায়"
                },
                {
                    "user_id": "Kunal Doshi",
                    "user_href": "/profile/Kunal-Doshi-56"
                },
                {
                    "user_id": "Varun Mishra",
                    "user_href": "/profile/Varun-Mishra-40"
                },
                {
                    "user_id": "Ashok Muthuhia",
                    "user_href": "/profile/Ashok-Muthuhia"
                },
                {
                    "user_id": "Punam Sutar",
                    "user_href": "/profile/Punam-Sutar-2"
                },
                {
                    "user_id": "Jiavudeen Zia Ud Din",
                    "user_href": "/profile/Jiavudeen-Zia-Ud-Din"
                },
                {
                    "user_id": "Devansh Gupta",
                    "user_href": "/profile/Devansh-Gupta-43"
                },
                {
                    "user_id": "Keshav Singh",
                    "user_href": "/profile/Keshav-Singh-124"
                },
                {
                    "user_id": "Kundan Kumar Jha",
                    "user_href": "/profile/Kundan-Kumar-Jha-20"
                },
                {
                    "user_id": "Vara Prasad Sauske",
                    "user_href": "/profile/Vara-Prasad-Sauske"
                },
                {
                    "user_id": "Yash Shandilya",
                    "user_href": "/profile/Yash-Shandilya-3"
                },
                {
                    "user_id": "Josh Levs",
                    "user_href": "/profile/Josh-Levs"
                },
                {
                    "user_id": "Anjana Chinta",
                    "user_href": "/profile/Anjana-Chinta"
                },
                {
                    "user_id": "Balakumaran",
                    "user_href": "/profile/Balakumaran-1"
                },
                {
                    "user_id": "Aswin Cheerath",
                    "user_href": "/profile/Aswin-Cheerath"
                }
            ]
        },
        {
            "author_info": {
                "name": "Krishma Shah",
                "href": "/profile/Krishma-Shah-45"
            },
            "answer_text": "Follow these 6 straightforward strides to independently publish your book all the more effectively 1. Make Your Book: Regardless of whether you're composing a novel or curating an assortment of pictures in a photograph book, the underlying advance is to make and format your book's substance. On the off chance that this is your first time making a book without any preparation, this may appear to be somewhat overwhelming, however, Prowess causes you in the book distributing procedure to make it simpler for a tenderfoot or prestigious writer. 2. Make a Stunning Cover: On the off chance that anything will represent the deciding moment a potential book deal, it's the intro page. Your independently published book's spread ought to be attractive and charming, making enough enthusiasm for a peruser. This applies to both, eBooks and soft cover as well. Thus, we prescribe our writers to look for proficient assistance from our in-house innovative fashioners to make a book spread that will hang out in the challenge. For a superior thought, take a gander at a portion of our preferred book covers. 3. Alter and Proofread Your Book: This is a significant phase of any book distributing process, however, it doesn't need to include paying for an expert manager. With committed time and care, you can guarantee that your independently published book hits the racks as the most ideal variant of itself. Ask a companion or relative whose assessment you trust to peruse your book and give input on the stream, structure, and consistency. Inquire as to whether it was anything but difficult to follow and get it? In light of the input got you can alter it as needs be. 4. Digital book Creation and Printing: In the good 'ol days before the period of electronic gadgets, softcover books are the main source to peruse. In any case, in the present computerized world, both the renditions are well known at this point the eBooks are favored more. So at Prowess, we prescribe each writer to distribute in both the organizations to arrive at most extreme perusers. We give the best paper and print quality for each book we distribute and for eBooks we distribute in any arrangement like pdf, Epub, and Mobi. 5. Book Distribution: Improving your book's online perceivability and web crawler positioning is one of the best things you can do to help your book deals. What's more, it won't cost you anything. ",
            "date": "Answered August 7, 2020",
            "views": "287",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Krishma Shah",
                    "user_href": "/profile/Krishma-Shah-49"
                },
                {
                    "user_id": "Naina Shah",
                    "user_href": "/profile/Naina-Shah-79"
                }
            ]
        },
        {
            "author_info": {
                "name": "Ved Aitharaju ( వేద్ అఐతరాజు)",
                "href": "/profile/Ved-Aitharaju-వేద్-అఐతరాజు"
            },
            "answer_text": "A few years ago, I had an idea for a novel. Well back when I was 16 years old (now I'm 18) I was in Film School back then. I decided to publish it myself and market it myself. I wrote a 70-page marketing strategy involving everything from online advertising to real life advertising, printing books for a minimal cost and selling them to stores. Basically I decided to start my own book publishing house, and run it from my computer/tablet and my brain. I had a well planned to out strategy to make my novel a bestseller. The only problem? I never finished the novel. I couldn't. I became fascinated with screenplays instead and found them to be more interesting then those boring novels with endless descriptions. I became more comfortable with visual storytelling, and spent my time making short films and screenplays instead of novels. But if you manage to finish your novel bro. I'll help you publish it, I'll invest in the printing and the advertising. Not I'm not kidding. It's been my dream to start a book publishing firm. But I can't write a novel myself. I find it amusing that there are ambitious youngsters out there like me. I was often ridiculed, when I was in film school for dreaming to make a feature film before I was 19. Looks like that's gonna come true soon, because I already got the funding and writing a script. You can DM on Quora about your novel. I'm serious. I'll help you publish it bro. ",
            "date": "Answered June 6, 2017",
            "views": "42",
            "upvotes": " View 33 Upvoters",
            "upvoters": [
                {
                    "user_id": "NUSRAT ALI",
                    "user_href": "/profile/NUSRAT-ALI-71"
                },
                {
                    "user_id": "Jahnavi Prasad Srirampurapu",
                    "user_href": "/profile/Jahnavi-Prasad-Srirampurapu"
                },
                {
                    "user_id": "Fastest Faraz",
                    "user_href": "/profile/Fastest-Faraz"
                },
                {
                    "user_id": "Aditya Goyal",
                    "user_href": "/profile/Aditya-Goyal-57"
                },
                {
                    "user_id": "Sai Vamshi",
                    "user_href": "/profile/Sai-Vamshi-14"
                },
                {
                    "user_id": "Neha Thanki",
                    "user_href": "/profile/Neha-Thanki-1"
                },
                {
                    "user_id": "Ar Nil",
                    "user_href": "/profile/Ar-Nil"
                },
                {
                    "user_id": "Annapurna Krishjeev",
                    "user_href": "/profile/Annapurna-Krishjeev"
                },
                {
                    "user_id": "Charu Bhatnagar",
                    "user_href": "/profile/Charu-Bhatnagar-15"
                },
                {
                    "user_id": "The Rajwadu",
                    "user_href": "/profile/The-Rajwadu"
                },
                {
                    "user_id": "Pooja Vora",
                    "user_href": "/profile/Pooja-Vora-12"
                },
                {
                    "user_id": "Anurag Tiwari",
                    "user_href": "/profile/Anurag-Tiwari-645"
                },
                {
                    "user_id": "Varsha Vivek",
                    "user_href": "/profile/Varsha-Vivek-10"
                },
                {
                    "user_id": "Nikita Rathore",
                    "user_href": "/profile/Nikita-Rathore-74"
                },
                {
                    "user_id": "Sumit Kumar Yadav",
                    "user_href": "/profile/Sumit-Kumar-Yadav-70"
                },
                {
                    "user_id": "Nikita Pandey",
                    "user_href": "/profile/Nikita-Pandey-206"
                },
                {
                    "user_id": "Pranav Thomre",
                    "user_href": "/profile/Pranav-Thomre"
                },
                {
                    "user_id": "Balambika G",
                    "user_href": "/profile/Balambika-G"
                },
                {
                    "user_id": "Dewesh Chopra",
                    "user_href": "/profile/Dewesh-Chopra"
                },
                {
                    "user_id": "Vikram Parikh",
                    "user_href": "/profile/Vikram-Parikh-8"
                },
                {
                    "user_id": "Asds",
                    "user_href": "/profile/Asds-8"
                },
                {
                    "user_id": "Tim Gordon",
                    "user_href": "/profile/Tim-Gordon-114"
                },
                {
                    "user_id": "Neeti Yadav",
                    "user_href": "/profile/Neeti-Yadav-5"
                },
                {
                    "user_id": "Akshay Gill",
                    "user_href": "/profile/Akshay-Gill-4"
                },
                {
                    "user_id": "Trina Agarwal",
                    "user_href": "/profile/Trina-Agarwal"
                },
                {
                    "user_id": "Ahana Louzado",
                    "user_href": "/profile/Ahana-Louzado"
                },
                {
                    "user_id": "Malsawmtluanga Hmar",
                    "user_href": "/profile/Malsawmtluanga-Hmar"
                },
                {
                    "user_id": "Vaishali Tyagi",
                    "user_href": "/profile/Vaishali-Tyagi-6"
                },
                {
                    "user_id": "Vanshika Bhagat",
                    "user_href": "/profile/Vanshika-Bhagat-2"
                },
                {
                    "user_id": "Pranan Subba",
                    "user_href": "/profile/Pranan-Subba"
                },
                {
                    "user_id": "Shashank Gupta",
                    "user_href": "/profile/Shashank-Gupta-198"
                },
                {
                    "user_id": "Ajay Kumar Devendran",
                    "user_href": "/profile/Ajay-Kumar-Devendran"
                },
                {
                    "user_id": "Teja P",
                    "user_href": "/profile/Teja-P-18"
                }
            ]
        },
        {
            "author_info": {
                "name": "Mishu The Wandering Wolf",
                "href": "/profile/Mishu-The-Wandering-Wolf"
            },
            "answer_text": "To Publish a book on your own, you must first get a license for publication.Self-Publishing process involves a number of steps including editing, formatting, cover designing, proofreading etc. So, either you need to hire someone who is expert in this field and then after getting a copy ready, approach a printing press to get it printed under your Imprint. This is basically the gist of Self-Publishing process. However, there are a number of self-publishing agencies that charge you or sell you a package including a few services associated with the processes mentioned above and get your printed. These agencies act as the mediator and this doesn’t make you a self-published author. You get published under a self-publishing company. Might seem confusing but self-publishing actually means getting your published under your own publication house. In India, there are many self-publishing agencies. A few of them charge hefty sums and provide services of book publishing and a few can do it for free but in that case, you’ll have to prepare your book in the print ready format along with the cover. They will do nothing but give it an ISBN and put it on sale under their imprint. You can also get your book published in E-book format and for that, I’d suggest you to opt Amazon Kindle. The platform is easy to use and you won’t have to face much troubles. But for paperback, you can either start your own publication house (Which of course is another BIG deal) or go for any of these middle agents. Caution: Choose your publisher wisely as many of these vanity publishers are the scavengers on hunt. Feel free to drop in for any other query. All The Best! ",
            "date": "Answered August 19, 2020",
            "views": "311",
            "upvotes": " Answer requested by N K Jain",
            "upvoters": [
                {
                    "user_id": "Survi Bharadwaj",
                    "user_href": "/profile/Survi-Bharadwaj"
                },
                {
                    "user_id": "Somraj Saha",
                    "user_href": "/profile/Somraj-Saha-3"
                },
                {
                    "user_id": "Satyakki Bhattacharjee",
                    "user_href": "/profile/Satyakki-Bhattacharjee"
                },
                {
                    "user_id": "Malini Chopra",
                    "user_href": "/profile/Malini-Chopra-3"
                },
                {
                    "user_id": "Preeti Goyal",
                    "user_href": "/profile/Preeti-Goyal-209"
                },
                {
                    "user_id": "Ketan Deshmukh",
                    "user_href": "/profile/Ketan-Deshmukh-25"
                },
                {
                    "user_id": "Sahana Nagaraja",
                    "user_href": "/profile/Sahana-Nagaraja-2"
                },
                {
                    "user_id": "Shamshad Chohan",
                    "user_href": "/profile/Shamshad-Chohan"
                }
            ]
        },
        {
            "author_info": {
                "name": "Meenakshi Verma",
                "href": "/profile/Meenakshi-Verma-403"
            },
            "answer_text": "You can do it by self-publishing. Self Publishing is a process by which the author himself/herself brings out the book in printed or digital form. Many popular authors do this way. There can be a situation where a traditional publisher is also involved. However, the expenses for the production of the book are borne by the author.  How to do? You get a page layout specialist to set your bookYou get a PDF file madeGet the book (PDF file) printed using Print On Demand (POD) service that is available in all citiesGet as many copies as you need (even 2 copies can be printed)Quality is very good (as it is a digital printer output)Start selling the booksPutting your books online  You can publish your books on digital platforms like Amazon Kindle, Google Play Books, Apple iTunes etc.Signup with themGive all your details like PAN, Bank account etc.Submit the ePub file or PDF fileStart sellingPromoting your books Being an author you are already an influencerUse your social media postings and followers to promote your bookEmploy reviews, shares and some free content to generate traffic that may culminate in a saleAs traditional bookstores are extinct today, sell through online stores and digital content",
            "date": "Answered October 10, 2020",
            "views": "36",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Richa Saxena",
                "href": "/profile/Richa-Saxena-49"
            },
            "answer_text": "Your book is the fruit of your toil - Days and nights spent brainstorming, thinking, writing, editing, proofreading, reediting and what not. The task of choosing the right publisher therefore is a crucial step in ensuring that your book reaches the reader's platform the right way with the right message. And for that to be possible, you need to be well versed in the various factors and criteria you should be putting your attention to, while choosing the best publisher for your book.Researching publishers is an important step in the entire process to choosing a good publisher for your book - It helps you keep tabs on the requirements, marketing strategies and ethos, book contacting terms and conditions, the various steps to publishing in different publishing companies to be able to calculate on your own the suitability of a particular publisher for your book. The editor's compatibility with the vision of your book, the publisher's track record with similar books, the financial terms and conditions including advance and royalty considerations are important aspects to be examined before settling on a publisher for your book. It is therefore really necessary that you do your homework and research well before deciding on a publisher for your book. 105 Views · View Upvoters · ",
            "date": "Answered November 22, 2018",
            "views": "174",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Deepak Singh Bisth",
                "href": "/profile/Deepak-Singh-Bisth"
            },
            "answer_text": "Cross the river when you reach it. There is a big difference in writing a book and having a finished book. Every guy has an idea, ideas are available at dime a dozen. Unless an idea is worked on it has no value. Finish the book and then send it to publishers and keep sending them till it is accepted. Or hire an agent who will guide you accordingly. You can self publish it but again any Tom dick and harry can self publish it in today’s time, it is your business/money the self publishing company is getting. There is no guarantee that the book will sell. I know a lot of people who have their printed books sitting at home and no one is willing to buy them except friends and family out of courtesy. So finish the book and then seek help from the right people. Seek advice from published authors or people in this business already. Goodluck. ",
            "date": "Answered June 6, 2017",
            "views": "22",
            "upvotes": " View 8 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Shubham Singhal",
                    "user_href": "/profile/Shubham-Singhal"
                }
            ]
        },
        {
            "author_info": {
                "name": "Freddy M Thomas",
                "href": "/profile/Freddy-M-Thomas"
            },
            "answer_text": "One option  for you is to approach a regular publishing house to print your manuscript. You should also be willing to take the risk of getting rejected since that is quite a regular occurrence. Another option for you is to go self-publishing your novel. This will enable you to print your material swifter .There is a self-publishing company who can print your piece of work. Have you tried https://notionpress.com/ ? They facilitate your publishing by offering packages. Ranging from Silver to Ruby wherein you get a set of fixed facilities and you can choose add-ons like e-book creation, illustrations, retail distribution etc. There are a lot of value additions which is offered to you by them such as a dedicated account manager per author. The most important feature, however, is that you get 100% royalty for your books. There is an option to calculate your royalty per book as well to set the MRP.You can get your manuscript printed in less than 3 months. The Accelerator option also helps you brand /reposition your book. Do check it out! ",
            "date": "Answered April 19, 2016",
            "views": "952",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/MISBA-Masoodi"
                },
                {
                    "user_id": "Nilesh Chogle",
                    "user_href": "/profile/Nilesh-Chogle-2"
                },
                {
                    "user_id": "Ajai Banerji",
                    "user_href": "/profile/Ajai-Banerji"
                },
                {
                    "user_id": "Mridu Bhatnagar",
                    "user_href": "/profile/Mridu-Bhatnagar-1"
                },
                {
                    "user_id": "Ashwani Verma",
                    "user_href": "/profile/Ashwani-Verma-20"
                },
                {
                    "user_id": "Dipanshu Rawal",
                    "user_href": "/profile/Dipanshu-Rawal"
                },
                {
                    "user_id": "Phillip Yip",
                    "user_href": "/profile/Phillip-Yip"
                },
                {
                    "user_id": "Atul Gupta",
                    "user_href": "/profile/Atul-Gupta-6"
                },
                {
                    "user_id": "Vishnu H Prasad",
                    "user_href": "/profile/Vishnu-H-Prasad"
                },
                {
                    "user_id": "Hitesh Sajnani",
                    "user_href": "/profile/Hitesh-Sajnani-1"
                },
                {
                    "user_id": "Deb Bhattacharya",
                    "user_href": "/profile/Deb-Bhattacharya-2"
                },
                {
                    "user_id": "Vishnu Jayavel",
                    "user_href": "/profile/Vishnu-Jayavel"
                },
                {
                    "user_id": "Yashasvee Ardeshana",
                    "user_href": "/profile/Yashasvee-Ardeshana"
                },
                {
                    "user_id": "Rishabh Poddar",
                    "user_href": "/profile/Rishabh-Poddar"
                },
                {
                    "user_id": "Sharon Ravindran",
                    "user_href": "/profile/Sharon-Ravindran"
                },
                {
                    "user_id": "Pratham Maliwad",
                    "user_href": "/profile/Pratham-Maliwad-1"
                },
                {
                    "user_id": "Lokesh Bhaskar",
                    "user_href": "/profile/Lokesh-Bhaskar-1"
                },
                {
                    "user_id": "Aravindh Arumugam",
                    "user_href": "/profile/Aravindh-Arumugam"
                },
                {
                    "user_id": "Edhaya Chandran",
                    "user_href": "/profile/Edhaya-Chandran"
                },
                {
                    "user_id": "Divenita Er",
                    "user_href": "/profile/Divenita-Er"
                },
                {
                    "user_id": "Khalid Khan",
                    "user_href": "/profile/Khalid-Khan-4"
                },
                {
                    "user_id": "Kartik Singhal",
                    "user_href": "/profile/Kartik-Singhal"
                },
                {
                    "user_id": "Abhinav Bhaskar",
                    "user_href": "/profile/Abhinav-Bhaskar-1"
                },
                {
                    "user_id": "Sujoy Chaudhary",
                    "user_href": "/profile/Sujoy-Chaudhary"
                },
                {
                    "user_id": "Vaibhaw Singh Chandel",
                    "user_href": "/profile/वैभव-सिंह-चंदेल-Vaibhaw-Singh-Chandel"
                },
                {
                    "user_id": "Julie Prentice",
                    "user_href": "/profile/Julie-Prentice"
                },
                {
                    "user_id": "Jenee Hughes",
                    "user_href": "/profile/Jenee-Hughes"
                },
                {
                    "user_id": "Mohamed Riyaz",
                    "user_href": "/profile/Mohamed-Riyaz"
                },
                {
                    "user_id": "Prakhar Singh",
                    "user_href": "/profile/Prakhar-Singh"
                },
                {
                    "user_id": "Gauraw Singh Chandel",
                    "user_href": "/profile/Gauraw-Singh-Chandel"
                },
                {
                    "user_id": "Sathappan Muthu",
                    "user_href": "/profile/Sathappan-Muthu"
                },
                {
                    "user_id": "Jerrin Elanjikal",
                    "user_href": "/profile/Jerrin-Elanjikal"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/Sandhya-Chetan"
                },
                {
                    "user_id": "Hitesh Sajnani",
                    "user_href": "/profile/Hitesh-Sajnani"
                },
                {
                    "user_id": "Emilya Burd",
                    "user_href": "/profile/Emilya-Burd-1"
                },
                {
                    "user_id": "Varun Deshpande",
                    "user_href": "/profile/Varun-Deshpande-2"
                },
                {
                    "user_id": "Adeel Arif",
                    "user_href": "/profile/Adeel-Arif-1"
                },
                {
                    "user_id": "Krishnam Raju",
                    "user_href": "/profile/Krishnam-Raju-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Gayle Laakmann McDowell",
                "href": "/profile/Gayle-Laakmann-McDowell"
            },
            "answer_text": "You can purchase an ISBN either from an organization like Bowker or from a self-publishing company (see How do I obtain an ISBN Number? and How can I get an ISBN number in India? How long does it usually take? Are there any good agencies that will get it done for me?). There is a difference with where you buy your ISBN from. If you buy your ISBN from a self-publishing company, they own the ISBN typically. This means that you can only print your books through them. I caught by this myself, and it forced me to switch ISBNs. It's much cheaper though ($10 US typically).If you buy your ISBN directly from Bowker, you will pay a lot more for it ($250 US). But, you'll have a lot more flexibility with it. You can then take your book to anyone to print -- or to multiple people at the same time.Once you have an ISBN, you can print the book from a self-publishing company. In India, Abhaya Agarwal's company Pothi.com is fantastic. I've had a great experience with them. You can print on demand, so you don't have to pay upfront for large print runs. They can also help you get your book up on websites like Flipkart.com. Within the US, you can use CreateSpace, which will help you get your book up on Amazon. That's it. There's no special legal work or anything like that to go through. (However, if you're serious about this, I do recommend investing in professional layout, editing, etc. It does get expensive though.) ",
            "date": "Answered November 7, 2012",
            "views": "99",
            "upvotes": " View 38 Upvoters",
            "upvoters": [
                {
                    "user_id": "Shambhu Nath Roy",
                    "user_href": "/profile/Shambhu-Nath-Roy-3"
                }
            ]
        },
        {
            "author_info": {
                "name": "Mohak Bhambry",
                "href": "/profile/Mohak-Bhambry-2"
            },
            "answer_text": "There are multiple ways to publish your books. First of all you need to be thorough with your storyline, the first draft & the synopsis of your work. Once, you are done with it. You can start working on approaching traditional publishing houses. You can literally make a list of these houses and approach them to get your book going. It might take some time & can have difficult to reach to their editor’s/reviewer’s desk. So, an alternate way is to do it a self publish way. With the eruption of so many budding authors & development of publication industry in India, there are lot many platforms providing self publishing & print on demand(POD) services that you can approach. Most writers & authors have a hard time working on their novels at the initial stage itself. They are confused as to what proper software or writing tech they can avail in order to craft their drafts into final manuscripts. MS Word has been a great companion for authors in this dire time. However, it does not provide an exposure of how readership might perceive their books. So, VoiceVerso has come up with a 2D curl based book writing & publishing technology(one of it’s kind), wherein writers can interact with their initial book drafts by immersive & interactive book writing canvas. The basic idea for the same can be explored here. It gives you a digital experience of writing & publishing your book that reciprocates the physical handling of a book. This can be an experience for authors & publishing houses to publish their books too. Disclaimer - I am the founder & CEO of Voice Verso ",
            "date": "Answered December 3, 2018",
            "views": "664",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Rashmi Karadalli",
                    "user_href": "/profile/Rashmi-Karadalli"
                }
            ]
        },
        {
            "author_info": {
                "name": "Rakesh Deshpande",
                "href": "/profile/Rakesh-Deshpande-1"
            },
            "answer_text": "Hi Upcoming Authors, I am Rakesh Deshpande, Author of What’s the Sunshine of Your Life? Connect with me: @rakesh_deshpande | Linktree I have chosen Traditional Publishing to Publish my Book. Here are the things I was involved in: I started my research from Self publishing. I had no idea what the “traditional” or “Self” publishing mean! After spending a couple of days, I understood the difference and chose Traditional Publishing.What did I get?Cover design - ’n’ number of times.Interior design approval - 3 iterations. I did approve the 3rd time.Price setting. MRP, Royalty calculation.Designing the font of your Title.Support and answers to my 100s of questions.Complimentary copies.Hardcopy and Ebook availability.Author DashboardMy book is available inFlipkart:What s The Sunshine Of Your Life: Buy What s The Sunshine Of Your Life by Rakesh Deshpande at Low Price in India | Flipkart.comAmazon:Buy What s The Sunshine Of Your Life Book Online at Low Prices in IndiaPlaystore:What s The Sunshine Of Your Life by Rakesh Deshpande - Books on Google PlayEverything has its own pros and cons which I don’t want to highlight and waste your time. In short, if you’re looking to have your hardcopy in Amazon etc sites and ebooks on Kindle or play store then go for Traditional Publishing. Greater visibility compared to Self Publishing. If you’re looking to just publish what you’ve written then go for Self Publishing. As you rightly guessed, there won’t be much visibility here unless you invest in promotions. Happy to clarify any questions! FYI, I did research for 2 long months before I finalize and trust me, lot many decisions were changed! All the best! ",
            "date": "Answered March 5, 2019",
            "views": "786",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Survi Bharadwaj",
                    "user_href": "/profile/Survi-Bharadwaj"
                },
                {
                    "user_id": "Sai Vamshi",
                    "user_href": "/profile/Sai-Vamshi-14"
                },
                {
                    "user_id": "Vengadessin Mourougayan",
                    "user_href": "/profile/Vengadessin-Mourougayan"
                },
                {
                    "user_id": "Annapurna Krishjeev",
                    "user_href": "/profile/Annapurna-Krishjeev"
                },
                {
                    "user_id": "Akash K",
                    "user_href": "/profile/Akash-K-30"
                },
                {
                    "user_id": "Aniket Kapoor",
                    "user_href": "/profile/Aniket-Kapoor"
                }
            ]
        },
        {
            "author_info": {
                "name": "Author's Ink Publications",
                "href": "/profile/Authors-Ink-Publications"
            },
            "answer_text": "Publishing a book in India is quite simple if you have a great manuscript. Let’s be honest, finding a good publishing house is becoming hard because most of them are not honest and don’t respond when it come to paying your royalty. This was the reason I created Author’s Ink Publishing 3 years ago and today after having published so many books and trying to break the traditional dishonesty prevailing in publishing industry after graduating from my college, I feel proud. Here’s to another year filled with new books and amazing authors. We provide every possible thing that you want to get your baby published. Yes a book is like a child for the author, which he reproduces with all he has. Following your passion to be an author is not easy, courageous are the ones who take this road, the less taken. So, we support you in every way, either be it managing time or providing you with the best project managers, marketing team, editors, designers. If you are thinking of getting your book published, let us serve you. You can whatsapp your query at- 8950970646 ",
            "date": "Answered June 30, 2019",
            "views": "1",
            "upvotes": " View 6 Upvoters",
            "upvoters": [
                {
                    "user_id": "Benita Sehgal",
                    "user_href": "/profile/Benita-Sehgal"
                },
                {
                    "user_id": "Damick Publications",
                    "user_href": "/profile/Damick-Publications-1"
                },
                {
                    "user_id": "Chandra Kant Jaisansaria",
                    "user_href": "/profile/Chandra-Kant-Jaisansaria"
                },
                {
                    "user_id": "Sharthkumar Sabarish",
                    "user_href": "/profile/Sharthkumar-Sabarish"
                }
            ]
        },
        {
            "author_info": {
                "name": "Damini Aggarwal",
                "href": "/profile/Damini-Aggarwal-1"
            },
            "answer_text": "Hello there, Disclaimer First: I am one of the founders @ Damick Publications. Publishing these days is quite easy. You just need to look out for Self Publishers in India and choose the Best among them. These Self Publishers in India offers various publishing services depending upon your requirements and budget. However, choosing a Self Publishing Company depends on how the Self Publishing company fulfills your requirements. Generally, we check the following to analyse: Services Available (Quality of Publishing)Packages AvailableMRP of the books already published by the PublisherPeople behind the publishing houseThe level of online presence of the Publishing housePost Publishing SupportRegular Payments and Updates of RoyaltyTheir Channels of Distribution andMarketing Help they provide.Damick Publications is the most Transparent Publishing house in India that provides quality publishing services and Marketing guidance to the Debut Authors. We started with an aim of helping the new entrants and save them from being misguided in the entire process of publishing and making it easy and accessible to everyone, and 2 years down the line we have ensured that more than 240+ authors have realised their dream of getting their book published. As far as publishing is concerned, We follow a unique publishing format where you will be assigned your own dedicated team of book experts who will take care of your end to end publishing and marketing requirements. We offer complete set of publishing, editing, marketing, distribution and post publishing services and have you covered on all fronts so you don't have to worry about any aspect of your publishing process. With Damick Publications you retain 100% of the rights to your book and also take home 100% of the profits from book sales. We also provide you with periodic sales reports so that you can keep a track of your performance. Transparency in sales, customized packages, innovative marketing and dedicated support is some of the reasons why authors prefer Damick Publications. Here is a report of how we've been working since last 2 years. Damick Publications Feedback ",
            "date": "Answered December 8, 2018",
            "views": "811",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Amish M",
                    "user_href": "/profile/Amish-M-3"
                }
            ]
        },
        {
            "author_info": {
                "name": "Saish Shinde",
                "href": "/profile/Saish-Shinde-5"
            },
            "answer_text": "After you have written your book, contact us so we can suggest an optimum process that will reduce both time and costs. We could have given you a fixed cost to begin with but we believe we can help you save costs by choosing a process that works best specifically for your book. So email us at contactus@[http://cinnmonteal.in] and let us help you arrive at a plan on how to proceed. After we arrive at the costs and a tentative timeline, and you decide to proceed with us, we will send you an agreement to sign. After you sign the agreement, the publishing process will begin. That means we will start working on the processes you have chosen for your book. You pay only for these processes, and nothing more. Typically, an author opts to for have the book edited, its cover and pages designed, copies printed (in bulk or on-demand), and for the marketing and distribution of the book. Some authors also opt for e-book development. CinnamonTeal offers readers the widest range of self-publishing services available in India, including marketing support and distribution in India and abroad. Here is a full list of pre- and post-publishing services. We also have a list of FAQs to help you. If you still cannot find what you are looking for, please do not hesitate to contact us, using the contact form at the bottom of this page, or by email us at contactus@[http://cinnmonteal.in]. Direct-link : The Publishing Process | CinnamonTeal Design and Publishing ",
            "date": "Answered March 2, 2018",
            "views": "115",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Arbaaz Khan",
                    "user_href": "/profile/Arbaaz-Khan-27"
                },
                {
                    "user_id": "Yamini Shekar",
                    "user_href": "/profile/Yamini-Shekar"
                }
            ]
        },
        {
            "author_info": {
                "name": "Naveen Valsakumar",
                "href": "/profile/Naveen-Valsakumar"
            },
            "answer_text": "Full disclosure, am one of the founders of https://notionpress.com - a self publishing launch pad for writers in India. There are two ways to get your manuscript published. 1. Get a traditional publishing contract - Make a list of publishers who publish books in the genre you have written, visit their website to learn their submission guidelines, submit your manuscript and other information in the format they require and then wait... Alternatively, you could also pitch your book to literary agents who could then represent your book to publishers. 2. Self publish your book - You could contact a self publishing company like Notion Press to have your book edited, designed and published. Most self publishing companies also offer marketing services. This approach is faster and you could collaborate with our experts to first publish a really good book and grow your reader base. ",
            "date": "Answered August 28, 2015",
            "views": "317",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Bnm",
                    "user_href": "/profile/Bnm-3"
                },
                {
                    "user_id": "Pragati Jain",
                    "user_href": "/profile/Pragati-Jain-8"
                },
                {
                    "user_id": "Archana Natarajan",
                    "user_href": "/profile/Archana-Natarajan-4"
                },
                {
                    "user_id": "Abhinav Sharma",
                    "user_href": "/profile/Abhinav-Sharma-75"
                },
                {
                    "user_id": "Akash KJ Bhat",
                    "user_href": "/profile/Akash-KJ-Bhat"
                },
                {
                    "user_id": "Satwik Sree Gokina",
                    "user_href": "/profile/Satwik-Sree-Gokina"
                }
            ]
        },
        {
            "author_info": {
                "name": "Gurnoor Pannu",
                "href": "/profile/Gurnoor-Pannu-1"
            },
            "answer_text": "You can also get your book self-published. Try at bookpublisher-asia, powerpublishers, notionpress, or self-publish. There are many publishing houses available. It works in following steps:1. You submit a sample, say 2 chapters of your book to the publisher.2. They sent you a review report highlighting the problem areas or basic feedback. Finally when the manuscript is approved, you pay for self-publishing and select a package.3. An editor is usually assigned at this stage to edit your book. 4. A team of designers and experts in various fields, sit together to work on making it more marketable.5. Finally, the book is made available on various channels online or offline or both (as chosen by you in the package). 6. Finally, you get royalty on sales. All the best for your future. Happy publishing! :) ",
            "date": "Answered December 19, 2014",
            "views": "15",
            "upvotes": " View 6 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Ashya Shukla",
                    "user_href": "/profile/Ashya-Shukla-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Amar Vyas",
                "href": "/profile/Amar-Vyas"
            },
            "answer_text": "Amit, It depends on what you define as \"book publishing\". In my (uneducated) opinion, a book today can have seven incarnations: a. Print book (no surprises here)b. e-Book (pick the format you prefer: kindle/ epub - google play- if they open up for new publisher registrations, Kobo, Newshunt, etc..)c. Audiobookd. Serialized form online- Wattpad, Scriggler, Table, blog posts, etc..e. Serialized form- audio (say through iTunes) - or upload it on Librivox or a similar sitef. Video (narrate it on Youtube!) g. Combination of the above Typically, print books might account for 90% (even 95% of the distribution as the preferred type of publishing), all other forms combined account for the rest.  Depending on the path you choose, you have multiple options. For print and e-book, as others have noted, the courses are quite well known. For the rest: one only has to look up some of the sites I mentioned. Note that I do not have any affiliations with any of the sites mentioned above, I self published my book in print and e. Best wishes in your publishing journey. ",
            "date": "Answered December 10, 2015",
            "views": "11",
            "upvotes": " Answer requested by Amit Tawale",
            "upvoters": [
                {
                    "user_id": "Aditya Swaroop",
                    "user_href": "/profile/Aditya-Swaroop-50"
                }
            ]
        },
        {
            "author_info": {
                "name": "Ruchika Verma",
                "href": "/profile/Ruchika-Verma-45"
            },
            "answer_text": "You can self-publish, it is all the rage nowadays. Kindle Direct Publishing might be the best way to do it. It offers great royalty and is quite easy to do once you have editing, formatting and marketing planned out. The drawback is, you will inadvertently spend more money and time on Marketing than you'll do on actually writing your book. Marketing is probably the most difficult part of publishing. Also, you'll have to spend time editing and formatting your book - from the grammar to book cover - you will be responsible for all. I suggest hiring editors and graphical designers for it. You can try Fiverr for that. If you are ready to shell out money, you can try Vanity Publishing Houses, they will take a lot of money from you but will perform all the functions I've mentioned. It can be riskh though, you must choose the Vanity Publishing House with utmost care because there are several ready to rip you off. You can try maybe StoryMirror for it. Traditional Publishing is another route you can take. But it won't be on your own. If you want to have full control over everything regarding your book - go for self-publishing on Kindle. Set your own price, do your own stuff and control the entire process. Hope this was of help. All the best of your book! ",
            "date": "Answered August 4, 2020",
            "views": "44",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Pearl Jones",
                "href": "/profile/Pearl-Jones"
            },
            "answer_text": "You can self publish your book, choosing from a wide network of online book/e-book publishing websites.There are few things you should keep in mind before you choose a publisher.Even if you are a new author you should not opt for a publisher who is new.Trust me.Choose a publisher who has at least published 2 books similar to the genre of your book,& if you opt for self publishing your work then I would suggest Sazmick books UK.For more options please visit the link below.http://www.sazmickbooks.com/I hope this is useful.Thank you. ",
            "date": "Updated June 8, 2015",
            "views": "583",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Nilesh Chogle",
                    "user_href": "/profile/Nilesh-Chogle-2"
                }
            ]
        },
        {
            "author_info": {
                "name": "Ravi Chaudhari",
                "href": "/profile/Ravi-Chaudhari-75"
            },
            "answer_text": "Do you mean that you would publish it without any publisher, by yourself as publisher? You may do so. You consult any professional printing press, book stalls, libraries, other concerning departmentments for purchasing your book. In a way you will have to do canvasing for your book. All these people would advise you, help you perhaps in getting it printed and brought to market up to them if they are willing and usually experienced. ",
            "date": "Answered August 6, 2020",
            "views": "19",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Survi Bharadwaj",
                    "user_href": "/profile/Survi-Bharadwaj"
                },
                {
                    "user_id": "Eshaan Rathi",
                    "user_href": "/profile/Eshaan-Rathi"
                },
                {
                    "user_id": "Yogesh Singh",
                    "user_href": "/profile/Yogesh-Singh-675"
                }
            ]
        },
        {
            "author_info": {
                "name": "Sara Rajput",
                "href": "/profile/Sara-Rajput"
            },
            "answer_text": "At some point in your writing process the thoughts of how to publish my own book will inevitably arise. Though the answer can be quite complicated, there are a number of things you can do to get your book published. I have got my book published on The Write Place and it is the destination for authors to come up with a raw manuscript and see it being converted into a finished book. Not only the prepress services are taken care of, the write place also takes care of design, production, distribution, marketing, logistics and sales at most of the online bookstores in India. I am a story writer, but the write place helped me turn my story into a book. Therefore, I will strongly recommend the write place for aspiring authors for online book publishing to get their stories transformed into a finished book. ",
            "date": "Answered November 6, 2018",
            "views": "502",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Gayle Laakmann McDowell",
                    "user_href": "/profile/Gayle-Laakmann-McDowell"
                },
                {
                    "user_id": "Charu Bhatnagar",
                    "user_href": "/profile/Charu-Bhatnagar-15"
                },
                {
                    "user_id": "Shambhu Nath Roy",
                    "user_href": "/profile/Shambhu-Nath-Roy-3"
                },
                {
                    "user_id": "Ajai Banerji",
                    "user_href": "/profile/Ajai-Banerji"
                },
                {
                    "user_id": "ShashikantaNingthoujam",
                    "user_href": "/profile/ShashikantaNingthoujam"
                },
                {
                    "user_id": "Rahul",
                    "user_href": "/profile/Rahul-2059"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/S-H-I-V-R-A-J-शिवराज"
                },
                {
                    "user_id": "Sudha Kuruganti",
                    "user_href": "/profile/Sudha-Kuruganti"
                },
                {
                    "user_id": "Hitesh Sajnani",
                    "user_href": "/profile/Hitesh-Sajnani-1"
                },
                {
                    "user_id": "Kishor Bharti",
                    "user_href": "/profile/Kishor-Bharti"
                },
                {
                    "user_id": "Ashish Agarwal",
                    "user_href": "/profile/Ashish-Agarwal-8"
                },
                {
                    "user_id": "Stephen McDonald",
                    "user_href": "/profile/Stephen-McDonald-18"
                },
                {
                    "user_id": "Sachin Choudhari",
                    "user_href": "/profile/Sachin-Choudhari-2"
                },
                {
                    "user_id": "Divenita Er",
                    "user_href": "/profile/Divenita-Er"
                },
                {
                    "user_id": "Puneet Gangrade",
                    "user_href": "/profile/Puneet-Gangrade"
                },
                {
                    "user_id": "Jitender Sharan",
                    "user_href": "/profile/Jitender-Sharan"
                },
                {
                    "user_id": "Vaibhaw Singh Chandel",
                    "user_href": "/profile/वैभव-सिंह-चंदेल-Vaibhaw-Singh-Chandel"
                },
                {
                    "user_id": "Gauraw Singh Chandel",
                    "user_href": "/profile/Gauraw-Singh-Chandel"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/Sandhya-Chetan"
                },
                {
                    "user_id": "Ravi Handa",
                    "user_href": "/profile/Ravi-Handa"
                },
                {
                    "user_id": "Jaya Jha",
                    "user_href": "/profile/जया-झा-Jaya-Jha"
                }
            ]
        },
        {
            "author_info": {
                "name": "Saurabh Mittal",
                "href": "/profile/Saurabh-Mittal-93"
            },
            "answer_text": "The easiest way to publish a book is to log on to pblishing.com We are a book publisher that has readers decide which books to publish and which not. We publish any work that successfully hits the 300 pre-order target. By “publish” we mean that we edit, design, print, distribute and market your book. In addition to this, we also give an exclusive platform to writers to interact and connect with their readers and have their works available to a wider audience. Users will be able to post stories, fan-fiction, poems etc., either through the web-portal or the mobile app. We also have partnership with the major book distributors in India like IBH and IBD and have Amazon, Flipkart, Paytm, Crosswords, Landmark and many others as our retailers, giving you a wide reach for your book. For more details visit : FAQ | Pblishing.com ",
            "date": "Answered March 16, 2017",
            "views": "172",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Sarvesh Jain",
                "href": "/profile/Sarvesh-Jain-7"
            },
            "answer_text": "I’m sure, you’ll find many questions quite similar to this. That might help you in a better ways. Still, I’ll mention few points to guide you through publishing and making your dream come true. First step, complete your writing.Get it Proofread from outside.Write all the various part other than your manuscript, like dedication, acknowledgment, introduction, glossary, about the author, and more.Send your few chapters to different publishing house through emails.As much as I know, meeting them personally won’t do you any good.Send everyone your writing, no matter the size of their business.If nothing comes in the way, go for self publishing.Save your money to invest in self publishing, somewhere from 50,000–1,00,000 for a decent self publishing. ",
            "date": "Answered May 12, 2018",
            "views": "1",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Amish M",
                    "user_href": "/profile/Amish-M-3"
                }
            ]
        },
        {
            "author_info": {
                "name": "Abhaya Agarwal",
                "href": "/profile/Abhaya-Agarwal"
            },
            "answer_text": "You do not need to register anywhere for printing and selling a book. The registrations is only required if this is a periodical, magazine or newspaper kind of thing. In India, ISBN numbers are assigned by the Raja Ram Mohan Roy ISBN agency in Delhi. You can either apply as a publisher and get a block assigned to you or apply as an author and get a single ISBN number for one book. You can find more details and addresses here: http://pothi.com/pothi/isbn ",
            "date": "Answered November 7, 2012",
            "views": "48",
            "upvotes": " View 21 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Shubhika Sharma",
                    "user_href": "/profile/Shubhika-Sharma-3"
                }
            ]
        },
        {
            "author_info": {
                "name": "Kevin Frederick",
                "href": "/profile/Kevin-Frederick-1"
            },
            "answer_text": "You can self-publish your book through Kindle Direct Publishing from Amazon, and sell your book to world markets through it. I am a self published author on Amazon. You can see it being done for real by going to my channel on YouTube by the name of Power User. I’m posting the video for you to get started. (It’s a series of videos , designed to get you up and running in less than an hour) :)  I'll get the NotionPress and NewsDog experience and put them as videos with time for you to see, so that the process can become clear and easy. But in the meantime , I feel you can get started with KDP. ",
            "date": "Answered September 4, 2016",
            "views": "390",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Yash Shandilya",
                    "user_href": "/profile/Yash-Shandilya-3"
                },
                {
                    "user_id": "Juggernaut Books",
                    "user_href": "/profile/Juggernaut-Books"
                }
            ]
        },
        {
            "author_info": {
                "name": "Kiran",
                "href": "/profile/Kiran-1346"
            },
            "answer_text": "You’ll need someone to be invested in your book as much as you are. This is where the position of a Self-Publishing house becomes crucial. Self-Publishing in India is not difficult and does not require much time. A Self-Publishing company is different from a Traditional Publishing House. The former is Author oriented and will be more suitable for you. Once you are done with your manuscript, contact a Self-Publishing company Like BecomeShakespeare and now wait for their response. Their publishing expert will get back to you within a day. They will explain to you all the book publishing services that they provide and solve any queries that you have. They will also help you select a package for publication of your book within your budget. ",
            "date": "Answered November 17, 2019",
            "views": "118",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Cambridge University Press India",
                "href": "/profile/Cambridge-University-Press-India-1"
            },
            "answer_text": "You can approach publishing a book in many ways but the following two are most common approaches- 1. Through an Agent Agents are basically people who have contacts in the publishing houses. If you can get an agent interested in your book, you can leave the liaising with the publisher to your agent and get your book published in due course. It saves your time and efforts as the agents take all publishing related responsibilities. 2. Through Publishers There are many book publisher in india, to choose from including international publishers like Cambridge University Press India known for publishing well-researched non-fiction books. Cambridge University Press India is renowned for its quality books and study material and you may contact them with your book proposal. ",
            "date": "Answered May 19, 2016",
            "views": "15",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Amish M",
                    "user_href": "/profile/Amish-M-3"
                },
                {
                    "user_id": "Hitesh Sajnani",
                    "user_href": "/profile/Hitesh-Sajnani-1"
                },
                {
                    "user_id": "Yardeny Miriam",
                    "user_href": "/profile/Yardeny-Miriam"
                }
            ]
        },
        {
            "author_info": {
                "name": "Tanya Rai",
                "href": "/profile/Tanya-Rai-23"
            },
            "answer_text": "Writing a book is a passion that may be all that a writer needs but to not get published is one nightmare that not many authors can survive. But there are some publishing houses like Prints Publishing that is a relief in sight. They publish on a wide-ranging subjects relevant to Economics, Botany, Social Science, History, Sociology, Psychology, Laws, Education, Religion, Terrorism, Buddhism, Islam, Women Studies, Philosophy, Human Rights, International Relations, Mathematics, Statistics, Anthropology and Sociology, Geography and Environment, Aquaculture and Fisheries, Politics and International Relations among others. They are the the largest book distributor in India. Actively exports books to over 100 countries from over 5,000 Indian Publishers. They can publish your book in no time. ",
            "date": "Answered June 30, 2017",
            "views": "429",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Suhail Khan",
                "href": "/profile/Suhail-Khan-760"
            },
            "answer_text": "You can directly approach a publisher if you have a good network or you can higher an agent to do the job for you and ofcourse it’ll be really good if the book you write gets awesome feedbacks Also you can check out some websites, who offer publishing at some cost, there are some available that do it for free as well ",
            "date": "Updated August 9, 2020",
            "views": "36",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Siddhesh Prabhugaonkar",
                "href": "/profile/Siddhesh-Prabhugaonkar-1"
            },
            "answer_text": "Contact Juggernaut who publish books on both digital and physical platforms, or BookStruck: We Tell Stories who publish digitally.While the former is more more experienced writers, you could approach latter with relatively less or no experience in writing.All the best! Do let us know when you publish your book:) ",
            "date": "Answered December 9, 2015",
            "views": "973",
            "upvotes": " View 2 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Shambhu Nath Roy",
                    "user_href": "/profile/Shambhu-Nath-Roy-3"
                },
                {
                    "user_id": "Amish M",
                    "user_href": "/profile/Amish-M-3"
                },
                {
                    "user_id": "Ganesh Kumaar",
                    "user_href": "/profile/Ganesh-Kumaar"
                },
                {
                    "user_id": "Lyubomyr (Lou) Reverchuk",
                    "user_href": "/profile/Lyubomyr-Lou-Reverchuk"
                }
            ]
        },
        {
            "author_info": {
                "name": "Divenita Er",
                "href": "/profile/Divenita-Er"
            },
            "answer_text": "In case you have already printed your book and you are not going to get your book published via any other platform, please apply for the ISBN first as it takes some time. Also suggest you to get your book edited before getting it out. ",
            "date": "Answered May 5, 2014",
            "views": "28",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Sulaksh More",
                    "user_href": "/profile/Sulaksh-More"
                },
                {
                    "user_id": "Heena Gupta",
                    "user_href": "/profile/Heena-Gupta-13"
                }
            ]
        },
        {
            "author_info": {
                "name": "Prasanjit Saha",
                "href": "/profile/Prasanjit-Saha"
            },
            "answer_text": "If you are open to innovative options, i would suggest you try woXpert.com. This website provides you platform to publish your book online for free, where readers can read for free, but you as an author earn royalty everytime the book is read. The startup is based in India and is gaining strong traction. It is taking applications now. For more info, do visit www.woXPert.com. ",
            "date": "Answered November 3, 2016",
            "views": "17",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Indu Wary",
                    "user_href": "/profile/Indu-Wary"
                }
            ]
        },
        {
            "author_info": {
                "name": "Priyansh Gupta",
                "href": "/profile/Priyansh-Gupta-9"
            },
            "answer_text": "Now Publishing a book is an easy task in India. Livre Publication is India’s self publishing platform which will publish your book for FREE. Entire cost starting from editing,cover design, printing and distribution of book is bear by Livre Publication.Not only this, they also provide a good royalty on the book sale. They publish paperback as well as e-book also. You can reach them on their website www.livrepublication.com ",
            "date": "Answered September 4, 2016",
            "views": "647",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Tulika Chandra",
                    "user_href": "/profile/Tulika-Chandra-6"
                },
                {
                    "user_id": "Sourabh Chourasia",
                    "user_href": "/profile/Sourabh-Chourasia-17"
                },
                {
                    "user_id": "Vishwanath Tarali",
                    "user_href": "/profile/Vishwanath-Tarali"
                },
                {
                    "user_id": "Prakash Koli",
                    "user_href": "/profile/Prakash-Koli-3"
                },
                {
                    "user_id": "Hitesh Sajnani",
                    "user_href": "/profile/Hitesh-Sajnani-1"
                },
                {
                    "user_id": "Mayank Sharma",
                    "user_href": "/profile/Mayank-Sharma"
                }
            ]
        },
        {
            "author_info": {
                "name": "Varun Malik",
                "href": "/profile/Varun-Malik-115"
            },
            "answer_text": "Thanks for the question. I arrived here after Google pointed out the direction. I have extensive traditional/and self-publishing experience and these pointers may help you make an informed decision. I have dealt with several major self-publishers both in India and overseas. In India, before deciding on any particular publishing company I did some homework. I found Blue Pencil Publishers pretty clued up, prior to actually publishing the translated books. . The company is super amazing to reach into worldwide markets. ",
            "date": "Answered July 27, 2020",
            "views": "23",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Rita",
                "href": "/profile/Rita-426"
            },
            "answer_text": "It depends on whether you want to self publish for free on pothi.com, print on demand or whether you want to pay self publishers..as in Norton Publishers, Chennai and many other like them. The traditional publishers in India today are focusing on mainly celebrity figures and will rarely even look at your book, just to be honest, so I quit even trying. Hope that helps. You would need to send them some information. A summary of your book, the number of words, the theme, etc and a little bio about yourself. Sometimes they require a few lines on each chapter ",
            "date": "Answered December 15, 2018",
            "views": "254",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Prasad Prasad",
                    "user_href": "/profile/Prasad-Prasad-86"
                }
            ]
        },
        {
            "author_info": {
                "name": "Roma Sharma",
                "href": "/profile/Roma-Sharma-2"
            },
            "answer_text": "I self-published my book last year. I followed the instructions on ISBN for Self Publishers in India and applied for an ISBN at the Raja Ram Mohun Roy Instt for ISBN. I got my ISBN in 1.5 months. Sometimes it could take upto 6 months. There is no way to contact them (unless you are in Delhi and go to their office). ",
            "date": "Answered May 16, 2014",
            "views": "27",
            "upvotes": " View 6 Upvoters",
            "upvoters": [
                {
                    "user_id": "Systoo",
                    "user_href": "/profile/Systoo"
                }
            ]
        },
        {
            "author_info": {
                "name": "Kunal Kavthekar",
                "href": "/profile/Kunal-Kavthekar"
            },
            "answer_text": "You need no qualifications to be a writer, just be a good writer and find a good editor. Google publishing houses. Visit them to get the details about getting your prose printed. There are two methods of getting your book's to the newsstands, either a publisher likes your work and puts her money in it or you wage your own money on it. Best of luck, hope this helps ",
            "date": "Answered May 3, 2018",
            "views": "250",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Eric DaCosta",
                    "user_href": "/profile/Eric-DaCosta"
                }
            ]
        },
        {
            "author_info": {
                "name": "Varun Katiyar",
                "href": "/profile/Varun-Katiyar-13"
            },
            "answer_text": "Its simple. You can choose any Self book publishing in india and given your manuscript to them and they will do all things including cover designing, book editing, book formatting, allot ISBN number against your book title and in last publish it on amazon kindle, google play google book as ebook and as well paper back. 1- Complete Your Book 2- Take ISBN for Your Book 3- Choose Publisher and publish your book (some publisher also provides ISBN for books) ",
            "date": "Updated July 23, 2019",
            "views": "86",
            "upvotes": " View 1 Upvoter"
        },
        {
            "author_info": {
                "name": "Pinaki Ghosh",
                "href": "/profile/Pinaki-Ghosh-48"
            },
            "answer_text": "For first time or new writers, Power Publishers : Indian book publisher | publish a book in India | self publishing in India may be a good option to get their book published with all India (and international) distribution and promotion. They offer packages of pre-press, printing, national and international distribution, including offline bookstore distribution, with promotion to new talented authors. There is an author dashboard, where authors can sign in to see their book sales figures and royalty they have earned. ",
            "date": "Answered March 4, 2018",
            "views": "223",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Rahul Jha",
                "href": "/profile/Rahul-Jha-3"
            },
            "answer_text": "Here are options.  1. Independent publishing 2. Amazon3. Publishing start ups like half baked beans will be happy to have authors under their belt.  Suit yourself. ",
            "date": "Answered January 18, 2014",
            "views": "95",
            "upvotes": " View 1 Upvoter"
        },
        {
            "author_info": {
                "name": "Shreekant Shiralkar",
                "href": "/profile/श्रीकांत-शिराळकर-Shreekant-Shiralkar"
            },
            "answer_text": "Wishing you all the success in publishing your work in India. I find the question is answered in the forum earlier. Here are link to few of them; Johnson C. Philip's answer to How do you write a book (steps) and publish it?Vikrant Shaurya's answer to How do you write a book (steps) and publish it?Hope it helps. ",
            "date": "Answered March 26, 2017",
            "views": "199",
            "upvotes": " Answer requested by Sagarkumar Jain"
        },
        {
            "author_info": {
                "name": "Indra Neel",
                "href": "/profile/Indra-Neel-9"
            },
            "answer_text": "A2A. Hi Armaan, it’s actually a pretty detailed answer. As I’ve previously answered similar questions, I’ve compiled a specific list for writers on my profile page. I request you to check them. If there are further queries, or anything that I’ve not covered in them, you are welcome to reach out to me. :) Indra Neel ",
            "date": "Answered May 5, 2018",
            "views": "152",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Manisha Gala",
                "href": "/profile/Manisha-Gala-14"
            },
            "answer_text": "Get your book edited by a good editor. Then find a printer, who will print a book for you. ",
            "date": "Answered August 2, 2020",
            "views": "18",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Aditya Kochhar",
                "href": "/profile/Aditya-Kochhar-2"
            },
            "answer_text": "You can publish it yourself: There are many self publishing companies in India. One example: Self-publishing in India | Book Publishers | Online Publishing ",
            "date": "Answered November 24, 2018",
            "views": "84",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Jayaseelan Samuel",
                "href": "/profile/Jayaseelan-Samuel"
            },
            "answer_text": "Contact Casteilla Private Limited ",
            "date": "Answered March 24, 2018",
            "views": "114",
            "upvotes": "0"
        }
    ]
}