{
    "title": "How effective was Senator Joseph McCarthy as a politician? - Quora",
    "tags": [
        "Kevin McCarthy (US politician)",
        "Joseph McCarthy",
        "Politicians and Government Leaders of the United States of America",
        "U.S. Senators",
        "U.S. Senate",
        "U.S. Congress",
        "Politicians and Government Leaders",
        "History of the United States of America",
        "Politics"
    ],
    "response": [
        {
            "author_info": {
                "name": "Chris Record",
                "href": "/profile/Chris-Record-1"
            },
            "answer_text": "Senator McCarthy was never effective but, indeed, he was powerful for a period dominating the early 1950s’ political landscape and causing near mass hysteria and witch hunts looking for communists in government. Like other politicians, “Tail-Gunner Joe”, who wasn’t, had a penchant for prevarication, hyperbole and the abuse of populism by multiple lies. If one lie was challenged another was tossed out to confuse and replace, as he moved on. He was powerful enough in Wisconsin, his home state that presidential candidate Dwight Eisenhower decided not to condemn McCarthy in a speech, as Ike had intended. Eisenhower later stated this was a great failure on his part as McCarthy had unfairly attacked Ike’s dear friend and mentor General George Marshall. (Ike was going to support Marshall and fight back for him but he tabled those comments.) Later, during the televised Senate-McCarthy Hearings, McCarthy and his counsel Roy Cohn were embarrassed by their lies and hypocrisy leading to McCarthy's downfall. Oddly, Roy Cohn who was a closet homosexual constantly accused others of being one. Cohn later became an attorney and friend of Donald Trump representing him in various legal matters. Cohn’s mantra was never apologizing and always punch back twice as hard as your opponent no matter whether they spoke the truth or not. Go figure how much an influence McCarthy and Cohn might have been on 45. Be Best, ",
            "date": "Answered December 12, 2019",
            "views": "84",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Oscar Mayorga",
                    "user_href": "/profile/Oscar-Mayorga-9"
                },
                {
                    "user_id": "Ed Bell",
                    "user_href": "/profile/Ed-Bell-9"
                }
            ]
        },
        {
            "author_info": {
                "name": "Harvey Ardman",
                "href": "/profile/Harvey-Ardman-1"
            },
            "answer_text": "Frighteningly effective—for awhile. He spread distrust throughout America and destroyed the lives of many innocent people, damaging freedom of speech and association. and undermining many US institutions. ",
            "date": "Answered December 12, 2019",
            "views": "110",
            "upvotes": " View 13 Upvoters",
            "upvoters": [
                {
                    "user_id": "Lesa Osborne",
                    "user_href": "/profile/Lesa-Osborne"
                },
                {
                    "user_id": "Randall W. Jordan",
                    "user_href": "/profile/Randall-W-Jordan"
                },
                {
                    "user_id": "Oscar Mayorga",
                    "user_href": "/profile/Oscar-Mayorga-9"
                },
                {
                    "user_id": "Suzanne Baker",
                    "user_href": "/profile/Suzanne-Baker-10"
                },
                {
                    "user_id": "Ruth Sanders",
                    "user_href": "/profile/Ruth-Sanders-3"
                },
                {
                    "user_id": "Jennie Balfour",
                    "user_href": "/profile/Jennie-Balfour-1"
                },
                {
                    "user_id": "Jeffrey Hayden",
                    "user_href": "/profile/Jeffrey-Hayden-7"
                },
                {
                    "user_id": "Tony Hartzell",
                    "user_href": "/profile/Tony-Hartzell"
                },
                {
                    "user_id": "Darrell Blank",
                    "user_href": "/profile/Darrell-Blank"
                },
                {
                    "user_id": "John Knight",
                    "user_href": "/profile/John-Knight-19"
                }
            ]
        }
    ]
}