{
    "title": "How many main characters should I have? - Quora",
    "tags": [
        "Fictional Characters"
    ],
    "response": [
        {
            "author_info": {
                "name": "Mike Sweeney",
                "href": "/profile/Mike-Sweeney-135"
            },
            "answer_text": "How many do you actually need? There are exceptions — good ones — but you probably want a Protagonist. Because the story needs to be about someone. A Protag can’t protag without an Antagonist. Doesn’t have to be a character. “The Winter” works just fine. But Antagonists who are personal are more interesting. Is also nice to have a supporting character. I forgot the term. Some people like to separate these into foils (who seem to be in the Protagonist’s way but are actually helping them) and Allies. A podcaster I follow calls these Relationship characters. Which doesn’t mean they are in a Relationship, per se; Mentor characters fall into the same place. So we got a Hero, a Villain, a Mentor, and a Rival…that’s really all we need to tell a story. Which is all a roundabout way of saying that you don’t need a head count, you need to have the right cogs to make the plot machinery move. And all else being equal, the fewer — the more efficient — the better. Sally Spacepilot has an Academy Rival and a hotshot pilot at her first assignment who is always giving her trouble and a brooding guy who gives her tingles when he forgets to act nasty towards her? Roll them all into one. She has a childhood friend and an alien bud she met in training and a genius she turns to in times of need? Whoops, that’s all one character too. And there’s the teacher at flight school who mentored her and the Flight Leader who came out of retirement in this time of crisis and…oh, you got the picture already. Teal deer? Wrong question. Fill roles, not bunk assignments. ",
            "date": "Answered July 20, 2020",
            "views": "53",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "James M Ridley",
                    "user_href": "/profile/James-M-Ridley"
                },
                {
                    "user_id": "Efrayim Bulka",
                    "user_href": "/profile/Efrayim-Bulka-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Michael Drakich",
                "href": "/profile/Michael-Drakich"
            },
            "answer_text": "One of the questions that must be asked before giving you an answer. In what style are you writing? First-person? Third-person? Omniscient? Or some other variation? Different styles lend themselves better for more or fewer protagonists. With first-person, the obvious answer is one. If you are attempting more than one with alternating chapters you are probably fouling up the thing. Stick to one. If you are writing in third-person, although not in stone the recommended maximum is three. When you get into a higher number you risk losing the reader’s empathy with the characters. If you are writing in omniscient, you can go higher because the story is told from the POV of the narrator so character empathy is not as critical. If you are in some odd variation, such as head-hopping, it won’t matter because empathy is impossible in a disjointed style. ",
            "date": "Answered July 20, 2020",
            "views": "23",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Elite Choice Awards",
                    "user_href": "/profile/Elite-Choice-Awards"
                }
            ]
        }
    ]
}