{
    "title": "How to claim school books on taxes - Quora",
    "tags": [
        "Tax Law",
        "Income Taxes",
        "Tax Policy",
        "Taxes"
    ],
    "response": [
        {
            "author_info": {
                "name": "Jonathan Monahan",
                "href": "/profile/Jonathan-Monahan-1"
            },
            "answer_text": "You can’t. The Trudeau government scrapped the textbook credit in 2017. They also scrapped the student amount credit which was worth around four times as much in the same year. This is despite promising help to students in the 2015 election platform. Students who voted for him en masse. In fact, it was the highest amount of young voters in the past 40 years of Canadian politics. Oddly, I never hear anyone bring this up, not even students. My guess is that they don’t learn about it in school, and in general are unaware. I worked part time during university, and had zero family support. If it weren’t for those credits, I don’t think I would have managed. It seems as though students still love him though, he’s back for anther round. ",
            "date": "Answered November 16, 2019",
            "views": "87",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Kathleen Lang",
                "href": "/profile/Kathleen-Lang-2"
            },
            "answer_text": "If you are claiming the American Opportunity Tax Credit (for yourself/spouse/dependent in the first 4 years of a degree program) or the Lifetime Learning Credit (basically training to improve job skills), you can claim required course materials, including textbooks, as part of your expenses. ",
            "date": "Answered November 16, 2019",
            "views": "90",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Gene Buettner",
                    "user_href": "/profile/Gene-Buettner-1"
                }
            ]
        }
    ]
}