{
    "title": "How do fans of Dan brown's Inferno (book) feel about the changed ending in the movie adaptation? - Quora",
    "tags": [
        "Inferno (2013 book)",
        "Dan Brown (author)",
        "Movie Adaptations"
    ],
    "response": [
        {
            "author_info": {
                "name": "Swarnayan Chakraborty",
                "href": "/profile/Swarnayan-Chakraborty"
            },
            "answer_text": "Before answering this question, I want to put forth a very important fact. A book and a film are different mediums, so when they both decide tell the same story, some changes have to be made. The novel had a decidedly bleak ending. Langdon finds the virus's hiding place in Istanbul, but it's revealed that the entire treasure hunt has been in vain: the bag containing the virus has decayed weeks before, unleashing a selective virus which will make a third of the planet's human population sterile. The film’s climax on the other hand, is more action packed and more Hollywood. After a bit of action and tussle, the crisis is averted, Sienna disappears in an explosion and the virus is safely contained. Its a much neater ending when seen in context of the film. The literary ending worked, because it felt like a natural conclusion to the story-arc of a 500-page novel, it wouldn’t have worked for the movie, because a film reaches out to a larger audience. The amount of exposition required to adapt the original ending would have bogged down the pace of the film. In other words, the novel’s ending wasn’t very cinematic. The advantage of the film’s ending is that, assuming another Langdon movie gets the green light, the story won't have to address the glaring issue of a virus that is slowly eroding the world's population. So, the cinematic ending also works, since it requires less exposition, is much neater, more explosive and leaves the audiences on a high note. P.S - By ‘ending’, I refer to the events inside the Hagia Sophia, and not the god-awful Langdon-Sinskey romance. ",
            "date": "Answered November 2, 2016",
            "views": "34",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Sayam Bhatia",
                    "user_href": "/profile/Sayam-Bhatia"
                },
                {
                    "user_id": "Shweta Singhania",
                    "user_href": "/profile/Shweta-Singhania-11"
                },
                {
                    "user_id": "Balaji Viswanathan",
                    "user_href": "/profile/Balaji-Viswanathan-4"
                }
            ]
        },
        {
            "author_info": {
                "name": "Saksham Goyal",
                "href": "/profile/Saksham-Goyal-22"
            },
            "answer_text": "Well , INFERNO is one of the best of dan Brown's thrillers which concentrated on the overpopulation of earth. The book depicts a person named Bertrand zobrist who realized that the population of earth was growing very fast . SO that person,in the shield of a secret ORGANIZATION creates a deadly plague virus which would control the planet's population. SO fearing about the loss of lives , the WHO recruits Harvard professor Robert Langdon to help them find and locate the plague virus before it harms any of the people. Now according to the book when Robert Langdon locates it and tries to contain it they find that the plague has already striked the whole planet and had made 1/3 of the population sterile. But now according to the movie , the virus , before spreading gets well contained by the WHO and saves the world from a major disaster. SO i find the end of the book more interesting than the movie. ",
            "date": "Answered November 23, 2016",
            "views": "23",
            "upvotes": " View 9 Upvoters",
            "upvoters": [
                {
                    "user_id": "Marco Peretti",
                    "user_href": "/profile/Marco-Peretti"
                },
                {
                    "user_id": "Subramnanian Karthik",
                    "user_href": "/profile/Subramnanian-Karthik"
                },
                {
                    "user_id": "Praveen Pahadey",
                    "user_href": "/profile/Praveen-Pahadey"
                },
                {
                    "user_id": "Tanishq Varshney",
                    "user_href": "/profile/Tanishq-Varshney-2"
                },
                {
                    "user_id": "Rajesh Goyal",
                    "user_href": "/profile/Rajesh-Goyal-81"
                },
                {
                    "user_id": "Archit Goyal",
                    "user_href": "/profile/Archit-Goyal-14"
                },
                {
                    "user_id": "Balaji Viswanathan",
                    "user_href": "/profile/Balaji-Viswanathan-4"
                },
                {
                    "user_id": "Swarna Deepika",
                    "user_href": "/profile/Swarna-Deepika"
                },
                {
                    "user_id": "Maahi Gupta",
                    "user_href": "/profile/Maahi-Gupta-3"
                }
            ]
        }
    ]
}