{
    "title": "How many books on KDP are actually successful? - Quora",
    "tags": [
        "Amazon KDP",
        "Amazon Kindle Direct Publishing",
        "Self-Publishing",
        "Book Publishing",
        "Publishing",
        "Becoming Successful"
    ],
    "response": [
        {
            "author_info": {
                "name": "Timothy Ellis",
                "href": "/profile/Timothy-Ellis-4"
            },
            "answer_text": "What Kevin McLaughlin said. Although I’d go as far as saying many tens of thousands of them. The top 200,000 of the paid Kindle store is where most of them live. They release and rise to something in the top 1500, and then sink back to something around 50,000, and then as they get older, they start bouncing around the top 200k, depending on what else in the same catalogue is selling. Anything in the top 200,000 is selling multiple books daily, or being multiply fully read daily in Kindle Unlimited. Anything which never falls out of that top 200k is successful. Last time I tried to figure it out, there was some 50 MILLION books on Kindle. About 15 million of them have a paid rank. Anything in the top 200k of 15000k is successful. The next 300k could be called mildly successful, if before sinking down there they were up in the top 50k at release. In terms of money, there are a some Indie authors making 7 figures a year. More making mid to high 6 figures, and a lot making low to mid 6 figures. A great deal more making high 5 figures. All of them are writing what people want to read, and at varying levels, treat writing as a full time job. ",
            "date": "Answered September 30, 2020",
            "views": "53",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Evan Solomonides",
                    "user_href": "/profile/Evan-Solomonides"
                }
            ]
        },
        {
            "author_info": {
                "name": "Kevin McLaughlin",
                "href": "/profile/Kevin-McLaughlin-170"
            },
            "answer_text": "Many, many thousands of them. Right now, there are more writers making a living from fiction than ever before in human history. A supermajority of those full time writers use KDP to get their work to their readers. (Many also use Kobo, Apple, and other ebook retailers as well - some go exclusive to Amazon to take advantage of Kindle Unlimited. Both methods can work.) That doesn’t mean it’s easy. ;) Living as a full time writer is as much work as any other job. I just finished this month with over 100,000 words done. I’m almost at 800k for the year. Now, I write more than most indie writers, but the bottom line is pretty simple: If you want success at writing, like real career success? It means working at it as seriously as you would any other career. I spent about as many hours working my way up to being full time as I would have going to medical school and finishing a doctor’s internship. It was a LOT of hours of work. Was the work fun? Sure! :) I love writing new stories. But fun or not, it’s still a lot of effort. KDP is how most serious novelists make a living today. It’s the easiest and most sure way to get your work out in front of readers and making you money. But it’s not automatic. Most people give up after a couple of failed books, missing the fact that they’ve been earning their proverbial spurs, learning to write and market. ",
            "date": "Answered September 30, 2020",
            "views": "51",
            "upvotes": " View 3 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Melani Matejak",
                    "user_href": "/profile/Melani-Matejak-2"
                },
                {
                    "user_id": "David Inman",
                    "user_href": "/profile/David-Inman-54"
                },
                {
                    "user_id": "Evan Solomonides",
                    "user_href": "/profile/Evan-Solomonides"
                }
            ]
        }
    ]
}