{
    "title": "How did you start your financial journey? - Quora",
    "tags": [
        "Financial Planning",
        "Financial Advice",
        "Personal Finance Advice",
        "Entrepreneurship",
        "Personal Finance",
        "Finance",
        "Startup Strategy",
        "Visiting and Travel",
        "Experiences in Life"
    ],
    "response": [
        {
            "author_info": {
                "name": "Paul Richard",
                "href": "/profile/Paul-Richard-3"
            },
            "answer_text": "My journey started when I was still in single digits. Seeing how my mother managed the house expenses and later bringing me to the bank to open a savings account in my own name. My mother used an envelope system. She had a number of envelopes for different expenses and every month she would fill the envelopes with cash. If there was money in the envelope then there was money for that expense, if it was empty then she couldn’t make that purchase. Each of us kids also had an envelope for our weekly allowance. We could let the money build in the envelope or spend it. My next revelation on my financial journey was the power of allotments. When I was in the military we purchased our first car and in financing the car we got a better intertest rate by setting up an allotment from my military paycheck. Later I was assigned to Germany and kept the allotment going. I missed or ignored the letter stating that the car was paid off and we kept the allotment going. The credit union that financed the car just sent the money to a savings account. When we returned from Germany that account had half the money needed to purchase a new car. That demonstrated to me that you don’t miss money that you don’t see. A few years later when I was with my final company, prior to retirement, I contributed to my company 401k. When I maxed what the company would contribute I started contributing to the ESOP (Employee Stock Ownership Program) and to an IRA and a taxable account. Each time I received a raise at least 1% of that raise went toward my investments. All with the understanding that money you don’t see in your take home paycheck is not missed. By the time I retired I was contributing 23% of my pay to investments, both taxable and tax advantaged. If a person wants to retire early, they must contribute to taxable investments. Otherwise you will be hit with early withdrawal penalties. ",
            "date": "Answered October 22, 2020",
            "views": "105",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Arvind Dandotiya",
                    "user_href": "/profile/Arvind-Dandotiya-5"
                }
            ]
        },
        {
            "author_info": {
                "name": "Surya Someshwara",
                "href": "/profile/Surya-Someshwara"
            },
            "answer_text": "Hey,  When I started my financial Journey, My dad had 20 lakhs worth of loan on him, and just a home as assets, I had about a 1 Lakh worth of Education loan. We were about to be sent from a 3 BHK home to a 1BHK home (As we just couldn’t afford it). We were paying more interest on a loan than we were spending on ourselves (Crazy) Starting Salary Rs 12,000 - The year 2010 I earned, I earned even overtime and performed well (Best of the Best), I made 24,000/Month (including Incentives & OT), Worked 12 hours sometimes, and even 24 hours at some point due to some issue in the office.Slowly started clearing loan after loans, Slowly saved as well not much maybe 2K to 3K / month, I didn’t spend on anything, Didn’t buy anything for two years.Now, I knew earning, clearing debt and saving will not make me financially stable. I started investing my savings (I started learning in college days, as I knew I needed money to solve problems in the family)At one point, I was earning almost 60,000 / Month (This was 7 years ago) After 3 years of working my Ass off, Cleared most of the loans, Came back to 3 BHK home, and lived like a typical middle-class family (Could have been bankrupt if I hadn’t started working) But I wanted more, I wanted to get out of Middle-Class Life, I wanted to be Financially free. I quit my high paying job as I wanted to understand the business world, I wanted to understand money.I worked in a startup, I invested money, and I worked even harder for less pay.But this time I went bankrupt (fate !!), Thankfully It was only me!I went back to a corporate job, Worked again for the next 3 years, Cleared 90% of all family loans.This time my investments were actually able to help me out, my investments were paying another 50% of my salary basically. I had enough money.One more big break in investing, I would basically become financially very stable and along with that even my family.That Big Break did come and I was able to buy 4 floor X 1BHK home for myself, Invested in a passive income business, and even was able to quit my corporate job to again start working in small businesses.In the next 2 years, I will be worth 1 Crore (In Real Estate), I will have two tiny passive income business and zero debt (Excluding my family) - By the age of 34! I will most probably earn more than I would have in the IT industry with less pressure and more time, but most importantly I will be financially free from basic needs (Already I am kinda free) How did I start my Financial Journey? By earning, saving, Learning, and most importantly investing (Taking Risk). MY ADVICE: BE SERIOUS ABOUT MONEY AND FINANCIAL STABILITY. Hope this helps Regards Surya Someshwara ",
            "date": "Answered October 18, 2020",
            "views": "106",
            "upvotes": " View 78 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Vipul Gadhvi",
                    "user_href": "/profile/Vipul-Gadhvi"
                },
                {
                    "user_id": "Harikaran Selvavinayagam",
                    "user_href": "/profile/Harikaran-Selvavinayagam"
                },
                {
                    "user_id": "Bharath Kumar",
                    "user_href": "/profile/Bharath-Kumar-48"
                },
                {
                    "user_id": "Yugesh Kumar",
                    "user_href": "/profile/Yugesh-Kumar-5"
                },
                {
                    "user_id": "Bhavik Dhami",
                    "user_href": "/profile/Bhavik-Dhami"
                },
                {
                    "user_id": "Poonam Bhandari",
                    "user_href": "/profile/Poonam-Bhandari-70"
                },
                {
                    "user_id": "Nikhil Kulkarni",
                    "user_href": "/profile/Nikhil-Kulkarni-199"
                },
                {
                    "user_id": "Saravanan Kannan",
                    "user_href": "/profile/Saravanan-Kannan-16"
                },
                {
                    "user_id": "Vivek Soni",
                    "user_href": "/profile/Vivek-Soni-127"
                },
                {
                    "user_id": "Rajesh Jaybhaye",
                    "user_href": "/profile/Rajesh-Jaybhaye"
                }
            ]
        }
    ]
}