{
    "title": "How to read a book without getting bored instantaneously after you begin - Quora",
    "tags": [
        "Self-Help Books",
        "Dealing with Boredom",
        "Boredom",
        "Literature",
        "Reading",
        "Books",
        "Life Advice"
    ],
    "response": [
        {
            "author_info": {
                "name": "Nela Canovic",
                "href": "/profile/Nela-Canovic"
            },
            "answer_text": " Instead of thinking of reading as a task that you need to complete, start treating it like a skill that you possess. When you make this subtle shift in your mindset, you’ll feel like you have more power over it. Why? Because, like with any other skill, this is one that you can develop, practice, improve, and master. Here are 3 tips that can help you develop your reading skill so that you can concentrate better at whatever you’re learning. Tip #1. Start writing things down. Why? If you want to keep track of what you read, it’s a good idea to create a system for it. In other words, you can give your reading experience more structure so that you can process, retrieve, and recall the material more easily. A good way to do it is to take notes. What are the benefits? Taking notes is a valuable skill to learn not just for the sake of giving your reading experience more structure. It’s also really good for your brain because it helps to amplify your focus and concentration, makes retaining and recalling information easier, boosts your cognitive skills, strengthens memory, and engages your critical thinking skills. How do you do it? Dedicate a notebook to your reading. Then, as you read through articles and books, start a note on each one by writing the title, author’s name, and date when you read it (I usually just write the month and year), which can be an added memory boost when you look at your notes later.Focus on key concepts, ideas, and topics. Don’t make it a goal to write down every little thing you read. That will take forever and you won’t benefit from your notes. Instead, boost your critical thinking skills by identifying what is relevant to the topic. If you’re not sure how to begin, try the Cornell Method of taking notes.Write notes in list format. This saves time, enables you to skim the material when you need it, helps you locate information faster, and makes the review process easier.Get creative with drawing and color. Your notes don’t need to be only in text format. You can draw squares, rectangles, or circles around the main topics, ideas and concepts. Use markers or highlighters to prioritize concepts, with one color to mark those that are top priority (for example, main ideas) and another to denote second level priority items (examples or application of an idea). This helps the most important information to stand out and makes it easier to find later when you need it. Tip #2. Tell someone a story about it. Why? The very act of storytelling makes the material come alive. It’s a great way to take the next step in the learning process. It’s being proactive about what you’re absorbing, instead of passively reading and just moving on to the next thing. What are the benefits? Telling a story about what you read is easy to practice because it’s not formal so there isn’t pressure to make it perfect. It also gives you confidence by strengthening your knowledge of the study material, and it boosts your memorization. You can review, recall, and retain what you’ve learned better and more effectively. How do you do it? Find your audience. It can be a friend, roommate, study partner, sibling, or parent.Find the right time. Don’t just assume everyone will want to pause what they’re doing and pay attention to you. Pick a time when they’re not in the middle of working or finishing up a task, so they can also enjoy the story. For example, you can talk while taking a walk together, having dinner, or just chilling out in the evening.Make it concise. Nobody wants to sit through an hour’s worth of lecture, especially if it’s during their downtime and not an obligation to do so. Think about what is the main point of what you read that you’d like to share, and then explain it in a few minutes. This will force you to prioritize what is the most important piece of the material you read.Make it lively. Your story doesn’t have to be a list of important concepts. It’s a story, remember? And a good story always has something extra in it to keep our attention and boost our imagination. To make your story interesting, mention an example you really liked and say why you liked it. Add a detail that you found fascinating or unusual. If there’s something that was not clear to you, mention that too. It’s an excellent way to prompt your friend to give their take on what they heard.Encourage dialogue. OK, so you told your story. What next? Use the opportunity to get your friend’s opinion and point of view. Ask them if they heard or read anything similar, and you might get a recommendation of what to read next. Share your opinions and turn it into a conversation so that you can both benefit from the experience by making it more meaningful. Tip #3. Incorporate it into your day. Why? Chances are much greater that you’ll remember details of what you read if you apply them to your life in some way. It’s another example of being proactive with what you are reading. What are the benefits? When you apply the details of what you’ve read to your life, it means you are making a connection between learning something new and the way you think, study, work, or communicate with others. In other words, you are applying that knowledge to something concrete and tangible that can benefit you. How do you do it? Reinforce your knowledge throughout the day. When you are on your commute or walking or running errands, ask yourself what were the key concepts from the article or book you just finished. Go over them, remembering what you wrote in your notes and how you emphasized each point. This added repetition of newly learned material will reinforce your knowledge of it even more.Use it to generate more ideas. Sometimes reading an article can give us ideas on how to do our job better or how to improve one area of our life. For example, we can learn about developing a new habit, practicing a skill, achieving mastery at something, or just going more in depth on a topic that we find fascinating. It’s an excellent starting point to do more research on what interests us.Take one idea or concept, then practice it. Of course, every piece of new material you read, whether it’s an article from a news website or a classic work of literary fiction, will be full of details and new information. Don’t think that you need to practice every little detail or idea. Instead, find one idea that you liked, then find ways to practice it at work or school. It can be learning a different technique to getting your job done, or practicing a small habit to make your day more productive. Whatever it is, select something that can help you improve your life in some way so that you can really feel the benefit of learning something new.",
            "date": "Answered July 22, 2017",
            "views": "98",
            "upvotes": " View 108 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Azalea Cleo",
                    "user_href": "/profile/Azalea-Cleo"
                },
                {
                    "user_id": "Dilly Mackey",
                    "user_href": "/profile/Dilly-Mackey"
                },
                {
                    "user_id": "Calvin K B",
                    "user_href": "/profile/Calvin-K-B"
                },
                {
                    "user_id": "Vyshakh Ashok",
                    "user_href": "/profile/Vyshakh-Ashok"
                },
                {
                    "user_id": "Vishal Kumar",
                    "user_href": "/profile/Vishal-Kumar-7477"
                },
                {
                    "user_id": "Chirag More",
                    "user_href": "/profile/Chirag-More-3"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/PREM-KUMAR-5232"
                },
                {
                    "user_id": "Galina Ivanova Georgieva",
                    "user_href": "/profile/Galina-Ivanova-Georgieva"
                },
                {
                    "user_id": "Abhinav Mandal",
                    "user_href": "/profile/Abhinav-Mandal-4"
                },
                {
                    "user_id": "Francisco Carlos da Silva",
                    "user_href": "/profile/Francisco-Carlos-da-Silva"
                }
            ]
        },
        {
            "author_info": {
                "name": "Thomas Packer",
                "href": "/profile/Thomas-Packer-5"
            },
            "answer_text": "I imagine being in the story that is being told: I picture what is said in my own mind, as if I was watching a movie, but more than that, as if it were happening to me. I look for books and authors with good ratings, and reading mystery/suspense/thrillers help because you want to learn what happens. Audiobooks are nice because the story is being told to you, but you can develop imagination to provide this for yourself with the written word. Some books get off to a slow start. I like to look up information and words in the book that I don’t know about. I help the book to roll along by gradually increasing the amount read in a sitting. My OCD method is by dividing the book in quarters: e.g. for a book with 48 chapters I’ll read chapters 1–12 a single chapter at a time; chapters 13–24, I read 2 chapters at a time; chapters 24–36, 3 at a time, & 37–48, 4 at a time. Stories usually build to help as you move along in the book. Find reading for what you enjoy and learn to expand the topics you enjoy. Ask a librarian, ask a friend, read a book with someone you know who enjoys similar things. Talk about what is in the book. Reading is so wonderful if you can allow yourself to get into it. It’s like a flight simulator that pilots use when they are learning to fly, only the simulations are emotional relationships with a variety of people and situations (you get better at being empathetic with the wonderful diversity, yet similitude, of people and situations available to us in this world). This allows you a growth and acceptance of Love and understanding through your own, and others, unique contribution - heart healing for all involved. Best wishes for you as you learn to enjoy working this muscle, assisting you in allowing you to be actively passive versus passively active.  ",
            "date": "Answered July 28, 2019",
            "views": "316",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Selin Çiçek",
                    "user_href": "/profile/Selin-Çiçek"
                },
                {
                    "user_id": "Marwa Abdelazeem",
                    "user_href": "/profile/Marwa-Abdelazeem"
                }
            ]
        }
    ]
}