{
    "title": "How did you feel about God after reading the entire Bible? - Quora",
    "tags": [
        "Bible Reading",
        "The Bible",
        "God"
    ],
    "response": [
        {
            "author_info": {
                "name": "Donald Propp",
                "href": "/profile/Donald-Propp"
            },
            "answer_text": "When I first read the Bible, I read it from the perspective of a Christian, with the assumptions that it was 100% true, that God was righteous and all-powerful and could do anything. That, often with help from other Christians, allowed me to rationalize away passages that didn’t make sense (like the approval of slavery, and of rape and murder in times of war). And contradictions, like the different accounts of creation in Genesis. And God’s evil treatment of people and commands to His prophets to do evil things (like genocide, including killing babies). And all the other things that didn’t make sense (like the contradiction between creation in Genesis and evolution, which has been proven scientifically; deep subject!). Then, after I had gained more education and life experience, I reconsidered the Bible objectively and logically. I didn’t accept that it was true just because it says it is true. A light came on, and it was a new revelation to me (no pun intended). Then I reconsidered all that the Bible says God has done. I also looked around me at nature, and wondered why God couldn’t have created a world where animals didn’t have to kill and rip apart weaker animals just to survive. And why despite claiming to love us, God allowed evil things to happen like babies dying of cancer and AIDS, even though He could stop them with a word. So given all that, I don’t think the Bible is true, or right about who God is. Because if it is true, God should be brought up on charges for murder, child abuse, and many other terrible things. Not the kind of God I wanted to believe in. So to answer your question, that is how I feel about God after reading the entire Bible. ",
            "date": "Answered September 28, 2017",
            "views": "982",
            "upvotes": " View 7 Upvoters",
            "upvoters": [
                {
                    "user_id": "Jonas Mercelis",
                    "user_href": "/profile/Jonas-Mercelis"
                },
                {
                    "user_id": "Sam Bradley",
                    "user_href": "/profile/Sam-Bradley-109"
                },
                {
                    "user_id": "Abhishek Chatterjee",
                    "user_href": "/profile/অভিষেক-চট্টোপাধ্যায়-Abhishek-Chatterjee"
                },
                {
                    "user_id": "Lawrence Bloom",
                    "user_href": "/profile/Lawrence-Bloom-2"
                },
                {
                    "user_id": "Fred Welton Hill",
                    "user_href": "/profile/Fred-Welton-Hill"
                },
                {
                    "user_id": "Ira Van den Heuvel",
                    "user_href": "/profile/Ira-Van-den-Heuvel"
                },
                {
                    "user_id": "Talon Lynn",
                    "user_href": "/profile/Talon-Lynn"
                }
            ]
        },
        {
            "author_info": {
                "name": "Joshua Wofford",
                "href": "/profile/Joshua-Wofford-1"
            },
            "answer_text": "I guess that depends person to person. I for one find myself in awe of the Creator God that made us, pursued relationship with us, and even died for us to satisfy his just nature. Now, there are those who claim to be turned into atheists by reading the Bible cover to cover, and will proceed to claim that anyone who does will become an atheist. However, this generalization is disproven by the conversion stories of people like C.S. Lewis and J. Warner Wallace, who were intense atheists/skeptics and ate up all the resources they could in finding out the truth about God/Christianity ",
            "date": "Answered September 28, 2017",
            "views": "358",
            "upvotes": " View 5 Upvoters",
            "upvoters": [
                {
                    "user_id": "Jason Hodge",
                    "user_href": "/profile/Jason-Hodge-20"
                },
                {
                    "user_id": "David McKay",
                    "user_href": "/profile/David-McKay-22"
                },
                {
                    "user_id": "Diane Brownback Ungerer",
                    "user_href": "/profile/Diane-Brownback-Ungerer"
                },
                {
                    "user_id": "Rune ELUZAi Hinoxosa",
                    "user_href": "/profile/Ruben-ELUZAi-Hinoxosa"
                },
                {
                    "user_id": "Cristina Valentin",
                    "user_href": "/profile/Cristina-Valentin-1"
                }
            ]
        }
    ]
}