{
    "title": "How many laws are there in America, and why are there so many? - Quora",
    "tags": [
        "Laws in the United States of America"
    ],
    "response": [
        {
            "author_info": {
                "name": "John Barrett",
                "href": "/profile/John-Barrett-206"
            },
            "answer_text": "No one knows how many laws there are in the United States. Apparently, no one can count that high. They’ve been accumulating, of course, for more than 200 years. When federal laws were first codified in 1927, they fit into a single volume. By the 1980s, there were 50 volumes of more than 23,000 pages. And today? Online sources say that no one knows. The Internal Revenue Code alone, first codified in 1874, contains more than 3.4 million words and, if printed 60 lines to the page, is more than 7,500 pages long. There are about 20,000 laws just governing the use and ownership of guns. New laws mean new crimes. From the start of 2000 through 2007, Congress had created at least 452 new crimes, so that at that time the total number of Federal crimes exceeded 4,450. Of course, times change and laws need to be updated. But many laws detract from, rather than contribute to, our quality of life and overall well-being. It is impossible for anyone to know all of the laws that affect them and it is, therefore, impossible to not break any laws. How many of the 4,450 crimes have you broken? ",
            "date": "Answered August 20, 2018",
            "views": "25",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Steve Draggat",
                    "user_href": "/profile/Steve-Draggat"
                },
                {
                    "user_id": "Damian Stevenson",
                    "user_href": "/profile/Damian-Stevenson-9"
                },
                {
                    "user_id": "Brendan D' Aubergine",
                    "user_href": "/profile/Brendan-D-Aubergine"
                },
                {
                    "user_id": "Lance Smith",
                    "user_href": "/profile/Lance-Smith-155"
                }
            ]
        },
        {
            "author_info": {
                "name": "Bill Combs",
                "href": "/profile/Bill-Combs-13"
            },
            "answer_text": "You may not know the half of it Ms. Morrow. If you have access, try visiting a university library’s room(s) of hardbound copies of the Federal Register, where all federal laws are compiled. Bring a magnifying glass, because the print is tiny in the over-sized volumes that can fill a large room on floor-to-ceiling bookshelves. Then, consider the volumes of State laws, rules, and regulations. They all keep piling up, centuries at a time, without any reasonable mechanism for regularly weeding out laws that are antiquated, unused, ill-advised, or even found unconstitutional. And ignorance of the law is still no excuse… ",
            "date": "Answered April 23, 2019",
            "views": "540",
            "upvotes": " View 2 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Gunnar Chitwood",
                    "user_href": "/profile/Gunnar-Chitwood-1"
                },
                {
                    "user_id": "Steve Draggat",
                    "user_href": "/profile/Steve-Draggat"
                }
            ]
        }
    ]
}