{
    "title": "How is comicsgate similar to gamergate? - Quora",
    "tags": [
        "Comicsgate",
        "GamerGate (Fall 2014)",
        "Controversies",
        "Video Game Industry",
        "Journalism"
    ],
    "response": [
        {
            "author_info": {
                "name": "Stephanie Smith",
                "href": "/profile/Stephanie-Smith-101"
            },
            "answer_text": "It seems to me they are only tangentially related to one another. They share similar names and a similar distaste for SJW activism. That seems to be where the similarities end. It seems Comicsgate is related to consumer dissatisfaction rather than concerns about ethics like Gamergate is. Not only that, but they don't seem to like each other very much. The few people in Gamergate I managed to get answers about Comicsgate seemed regretful that anyone would relate the two of them at all. Worse distaste than I'd seen even for Milo Yiannopoulus. I was surprised, to say the least. It is rare for me to come across such animosity for a subject on the servers I swing through. Though, personally, I'm not ready to write off ComicsGate yet. Full disclosure, I don't read comics. The only western comics I have put any effort into is Spawn, American Vampire, and Unnatural. Unnatural being one of the comics that seems to be under scrutiny.  However, I keep my ear to the ground and I am aware that there has been a push toward forced diversity in comics recently. Now in Gamergate, this is not an issue if it is additional content like it seems to be with Comicsgate, only if it is altering an established character. Though, due to the medium difference, I think the characters end up in the same universe. So it is possible that that is part of the upset. Like I said, this seems like more of a quality control issue and it may well be valid. Especially after the things I ran across researching for this answer…  [Why would you have ANY opinions about Israel? Why would anyone bring real-world politics into this scenario, especially something like the whole Israel-Palestine situation?]  [Okay, so why is the villain more concerned about the life of your child than you are miss empowered pregnant black woman commander and possibly CEO of a Fortune 500 company sir?Just to add, yes, the pregnant one is meant to be the good guy in this scenario. Not the guy with firing hands doing the loony tunes stop to avoid hitting the pregnant lady. His benign sexism of not smacking a pregnant lady is not welcome here. Marel demands you abort that child with a high kick.]  [Oh thank you, I really wanted to be reminded of Jessica Valenti]  [Genuinely do not know how to feel about a comic about school shootings and do not want to know why Spiderman is involved. Also mildly concerned that the girl with the green hair near the woman in the burqa has no pupils.]  [Meninist Terrorists!? MENINIST TERRORISTS!? I don’t even know where to begin, probably by trying to stop laughing. Meninism isn’t even a real movement, it’s just a genderswap version of feminism to show that feminism is gendered. Also what the heck is wrong with Wonder Woman’s face.]  [Mister school shooter, you just need to check your privilege. ^o^ What am I reading!? It’s not even accurate/ hard truth.] I’d be generous to call it propaganda. Oh, and little alarm bells raised when I saw how vocal Polygon, the bastion of honest journalism as it is, seemed to be rolling around like a pig at the idea of Comicsgate’s humiliation. Not to mention the similarly petty tactics being deployed against them that were used against gamergate. I mean I even stumbled across Comicsgate being ‘humiliated’ as some little moo draws a white supremacist mascot for their movement. Little early to be reaching for Nazi I thought.  You see, stuff likes this immediately makes me think that Comicgate are probably the good guys in this scenario. These kinda tactics (Making the opposition look like Nazis) are used by people who can’t argue against the ideas. That’s why they have to paint these people in such a way. It happened to Gamergate, it happens to anyone not toeing the line. So seeing this makes me more inclined to take comicsgate’s side than ever.  Not only that but it seems like they have got together and proactively raised money for their own comic called Cyberfrog. I mean, I’m looking at things saying that My Little Pony is releasing better comics than Marvel right now and that just boggles my mind. So while the movements are fundamentally different, they are both concerned with the quality of their medium. I would say the main difference is that gamergate focusing on the reporting of that medium and the ethics and such, whereas comicgate is striking at production choices. Their grievance is literally with the medium losing quality. I predict they’ll probably win their fight fairly quickly, since as with gaming, the people crying out for diversity in the medium aren’t supporting it when they get it. For once it isn’t just me pointing it out Comics: You’ve Got Your Diversity, So Why Don’t You Buy Them? Power to them. In a capitalist society, if you want something to succeed you have to support it. If you aren’t going to support it than you forfeit your wallet’s vote. Simple as. Update Woke up to this r/KotakuInAction - [Meta] Does ComicsGate need a subreddit it can call its own? “I feel like comicsgate is enough of its own thing and only really deals with comics being crappy, not actual ethical issues of the comics press most of the time.” Just wanna say. called it. ",
            "date": "Answered September 4, 2018",
            "views": "27",
            "upvotes": " View 37 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Nicole Diaz",
                    "user_href": "/profile/Nicole-Diaz-14"
                },
                {
                    "user_id": "Frank Lee",
                    "user_href": "/profile/Frank-Lee-137"
                },
                {
                    "user_id": "Jason Abalaka",
                    "user_href": "/profile/Jason-Abalaka"
                },
                {
                    "user_id": "Darren Blair",
                    "user_href": "/profile/Darren-Blair-15"
                },
                {
                    "user_id": "Alexander Novosibirsk",
                    "user_href": "/profile/Alexander-Novosibirsk"
                },
                {
                    "user_id": "Eric Cao",
                    "user_href": "/profile/Eric-Cao-43"
                },
                {
                    "user_id": "João Pedro Sousa",
                    "user_href": "/profile/João-Pedro-Sousa-11"
                },
                {
                    "user_id": "Michael Guy",
                    "user_href": "/profile/Michael-Guy"
                },
                {
                    "user_id": "Zach Neuman",
                    "user_href": "/profile/Zach-Neuman"
                },
                {
                    "user_id": "Châu Trương",
                    "user_href": "/profile/Châu-Trương-1"
                }
            ]
        }
    ]
}