{
    "title": "How to learn to write a novel? How do you get started? Is there a format or a set of rules and procedures to follow - Quora",
    "tags": [
        "Fiction Writing",
        "Novel Writing",
        "Creative Writing",
        "Novels",
        "Writing Advice",
        "Learning New Things"
    ],
    "response": [
        {
            "author_info": {
                "name": "Vicki Boykis",
                "href": "/profile/Vicki-Boykis"
            },
            "answer_text": "There is no one right way to go about writing a novel.  It depends entirely on how you function best.  Some people will start writing immediately and worry about details later.  Some people will research for months, only settling on a topic once they are absolutely sure.  Some people will edit as they write, some people will complete drafts and drafts.  Some people scribble on notebooks, some people need Scrivener software to organize themselves.  All of these are things that can be \"done\" in order to write a novel.  Really, the only two things that you absolutely HAVE to do are:   write and rewrite.  Sit down in a quiet place, or a loud place, or on your lunch break at work or after you've put the kids to bed, and start cranking out the words.  Just put down one preposition after another, and write a sentence. Then another. And now you have a paragraph and maybe your main character is in it.  It will be ugly and hideous and messy at first and this character won't match up with that character and this chapter will be too short and it might not seem like the plot is really going anywhere at all.  The first paragraph of what you write will not be the opening page.  It might be. But it might also be in the middle. It might not even get included at all.  The other most important thing to write a novel, other than writing, is to recognize that you're going to go through millions of rewrites.  Everyone does. No one sits down and cranks out Freedom or The Three Musketeers as they are.  Every book is the result of hundreds of re-thoughts and people offering input.  Just hundreds of words are going to be purely terrible and you're going to wish you'd never written them.  You are going to feel miserable and like you're a terrible writer, so read Bird by Bird by Anne Lamott from end-to-end.Out of all of the books on writing I've read (Zissner, etc.), she is the only one who truly encompasses what it means to write and the struggles of the creative process, and she'll make you feel like you're going to make it after all.  Then, keep going.    As  Jonathan Avidan said above, writing is like a muscle.  Don't do it just when you feel the pull from the muse.  Do whatever you need to do to consistently write a certain amount of words a day. A novel is about 100,000 words.  Forget about that.  Just concentrate on the next 500.  If you can do 500 or 1000 words a day, you can write an entire novel.  Be aware of the word count, but somewhere dimly in the back of your mind.  Focus more on what the characters are telling you, where they're trying to get you to do, and what the Big Message you want to send out to the world is. When you're not just writing, cranking out the words, moving, moving forward, you can be doing other stuff, like reading books about writing novels, participating in novel-writing forums, going to writing workshops and maybe even reading bits of your work to other people, doing research if what you're writing about requires research, and generally making everyone close to you miserable because you have this great big truth inside of you that you want to let loose in its purest form, but it requires translation from your soul to the page.  Keep doing all of this this for up until the point where it seems like you're getting to the end of the story you set out to tell.  You now have written the first draft of what will be your novel.  Now, you rewrite. You check for consistencies. You check for character names and places.  Is there a spot where the plot is slow?  Delete it and rewrite the new spot.  Pick at parts that seem like they're going to come loose. Throw pages in the trash can or in a virtual trash can on your monitor.  Weep from time to time, curl up the fetal position.  Read chapters at a time and wow, it really does seem better. But still not quite there.   But enough to give you hope and forward motion.  You're done with the first rewrite.   After 100 more edits, maybe just you, maybe with an editor, you will feel like there's more you can do, but you just don't want to do it.  You've done as much as you could, and you just feel a sense of release. all the characters are colored and lively.  All the writing stands up. Your voice is YOUR voice instead of the garbled mess you started out with.  You have something complete and it is so great that you now want to show it to other people.  Congratulations, you've written a novel. ",
            "date": "Answered July 31, 2012",
            "views": "168",
            "upvotes": " View 190 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Sheri Fresonke Harper",
                    "user_href": "/profile/Sheri-Fresonke-Harper"
                },
                {
                    "user_id": "Ellen Vrana",
                    "user_href": "/profile/Ellen-Vrana"
                },
                {
                    "user_id": "Laura Muñoz-Larbig",
                    "user_href": "/profile/Laura-Muñoz-Larbig"
                },
                {
                    "user_id": "Sok Neang Ta",
                    "user_href": "/profile/Sok-Neang-Ta"
                },
                {
                    "user_id": "Ryan Monahan",
                    "user_href": "/profile/Ryan-Monahan-14"
                },
                {
                    "user_id": "Maanav Seetal-Parsad",
                    "user_href": "/profile/Maanav-Seetal-Parsad"
                },
                {
                    "user_id": "William Goble",
                    "user_href": "/profile/William-Goble-7"
                },
                {
                    "user_id": "Cathy Williams",
                    "user_href": "/profile/Cathy-Williams-27"
                },
                {
                    "user_id": "Tenali Naveen",
                    "user_href": "/profile/Tenali-Naveen"
                },
                {
                    "user_id": "Yuvraj Aditya Kapoor",
                    "user_href": "/profile/Yuvraj-Aditya-Kapoor"
                }
            ]
        },
        {
            "author_info": {
                "name": "Christopher Meeks",
                "href": "/profile/Christopher-Meeks"
            },
            "answer_text": "This is a huge question, but I have to assume that your desire to write fiction is because you love reading fiction. If you don't read much, that's the first place to start. Find books that sound appealing and read them. Especially at first, if you're not enjoying a book, put it down and find another.  Get so that you really love reading novels and/or short stories. In this way, you'll notice certain techniques and feel what works and what doesn't. You won't be reinventing the wheel. Once you have a sense of what you like, you will have a goal: to write as well as your favorite authors.  Next consider your work habits. Are you someone, once deciding to do something, does it? Or are you the type to join a health club and never go? This is where you have to be honest with yourself. If you realize, for instance, that taking fiction writing classes or workshops will help, then sign up for a first one. Many universities have extension classes, as do community colleges, and other places. Colleges, universities, and Writer's Digest have online classes and workshops. A class, by the way, teaches certain basics and advanced skills. A workshop focuses more on people turning in stories, and workshop members and an instructor critique them. Classes often have a workshop component. Another way to go is get books on the subject. Some of the books I've found valuable include Bird by Bird by Anne Lamott,  Writing Fiction by Janet Burroway, Story by Robert McKee, Writing in General and the Short Story in Particular by L. Rust Hills, The Art and Craft of Fiction by Michael Kardos, The Scene Book by Sandra Scofield, On Writing by Stephen King, and From Where You Dream by Robert Olen Butler.  Then just write and get feedback on it. If you have friends who write well, get their feedback. Classes and workshops offer feedback. So do writing groups. Some contests offer feedback. To ask friends and relatives who don't write fiction may support your ego, but a pat on the back alone isn't going to push you. You need knowledgeable feedback from those who write and understand the creative process.  Then just keep reading and writing. You will grow. You may not become a best-selling author next week or even in this lifetime, but if you can find people, books, and ideas that inspire you, you will get better. You will find fans. ",
            "date": "Answered July 30, 2015",
            "views": "13",
            "upvotes": " View 16 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Sheri Fresonke Harper",
                    "user_href": "/profile/Sheri-Fresonke-Harper"
                },
                {
                    "user_id": "DERICK DSOUZA",
                    "user_href": "/profile/DERICK-DSOUZA-19"
                },
                {
                    "user_id": "Ryan Monahan",
                    "user_href": "/profile/Ryan-Monahan-14"
                },
                {
                    "user_id": "William Goble",
                    "user_href": "/profile/William-Goble-7"
                },
                {
                    "user_id": "Cathy Williams",
                    "user_href": "/profile/Cathy-Williams-27"
                },
                {
                    "user_id": "Gregg Arius",
                    "user_href": "/profile/Gregg-Arius"
                },
                {
                    "user_id": "Maryam L",
                    "user_href": "/profile/Maryam-L-4"
                },
                {
                    "user_id": "Amy Elledge",
                    "user_href": "/profile/Amy-Elledge-6"
                },
                {
                    "user_id": "Ioannes Mioakis",
                    "user_href": "/profile/Ioannes-Mioakis"
                },
                {
                    "user_id": "Robyn Esto",
                    "user_href": "/profile/Robyn-Esto"
                }
            ]
        }
    ]
}