{
    "title": "How to always remain happy - Quora",
    "tags": [
        "Developing and Maintaining Happiness",
        "Happiness",
        "How-to Question",
        "Philosophy of Everyday Life"
    ],
    "response": [
        {
            "author_info": {
                "name": "Jack Yu",
                "href": "/profile/Jack-Yu-1"
            },
            "answer_text": "I'm going to answer this question a bit differently, using the little that I know about Buddhism.  To answer this question though, we're going to need to better define our terms. I'm going to use the word \"happiness\" as a positive emotion that is experienced when things go well for us. For example, seeing a cute puppy on the street might make you happy; that person you had a crush on or your spouse/lover paying you special attention might make you happy; doing well on an exam or performance or getting a raise might make you happy.  In America, for several decades people have pursued the question, \"How do I be happy?\" Some people think pursuing the answer to this question will give the \"meaning of life.\" However, this is the wrong question. Happiness is only an emotional state triggered by events. It feels good, but it is fleeting. After some time, the happiness fades. Wanting to always feel happy is an attachment to a drug, like the heroin addict always wanting the next high: each dose of happiness feels very good, but it's short-lived and leaves the addict wanting the next hit.  In contrast, there's another mental state. I'm going to use the word \"non-being\" to denote this mental state, though this might sound like jargon at the moment. I'll try to explain it, but actually I don't know enough to know how to put a definition to it. Instead, I'll give examples of what being in the perspective of the mental state of \"non-being\" is like.  Praise: When other people praise us (or, for example, when they like us, or give us validation, or tell us we're cool, or tell us we're popular, or smile at us, or are warm and friendly to us), we might feel good (and happy). Let's say we do. However, there's something interesting here: nothing about us has fundamentally changed. Likely, we were the same person we were 5 minutes ago, before they gave us that praise and validation. Their praise does not change who we are fundamentally; it does not \"affect our nature\". It was only our own perceptions in our mind that tied their praise to feeling good, that gave us a temporary \"hit\" of emotion. Someone in the state of \"non-being\" would indeed feel happy and warm and fuzzy at praise, but then let it go when the feeling naturally ends. They wouldn't cling on to needing this fix of happiness that praise brought, and wouldn't be swayed from what they were doing because of it.  Success, big and small: This analogy holds for success as well. You can tell many people on Quora really want to be successful, because there are so many questions asking about success. \"What's it like being rich? Beautiful? Attend a prestigious school? In a fulfilling relationship?\" \"How did you make your first million?\" Or put in other words, \"How can I make my first million?\" ;)  But what is success? Where is the boundary that you draw? If you have $1M in cash in your bank account, are you successful? What if you only have $999,999-- are you not successful? Or is $1M too low; do we need $1B? In addition to money, do you also need a hot wife/husband/boyfriend/girlfriend/whatever to be successful? Do you need several of them? Thousands of them? What if you have all of that but didn't go to Harvard; are you still successful? What if you do, but don't have the rest? As you probably think is obvious, success is a slippery concept. In fact, the concept of success is a trap: there is no one idea of success. The idea of \"success\" exists in your mind, or alternatively, it exists in your mind that the idea of \"success\" exists in others' minds (and that you should/can figure out what it is). Fundamentally though, \"success\" does not alter YOU.  Those big goals are what I call \"big successes.\" But we can also talk about what I'm going to call \"small successes\": for your startup, you found a co-founder (success!) You raised a few million in VC funding (success!) You are doing enormously better than last year in revenue (success!) You exited for a bajillion dollars (success!) These small steps feel good, but what's to say that they are really successes? What if you are wrong in your estimate of your co-founder and they actually don't have any of the great traits to help you on your startup, and you don't know it? What if a few million in VC funding was nothing and you really needed to raise much more than that? These \"small successes\" might give pleasure, but aren't necessarily successes. They shouldn't alter your course or who you are. Blame and failure:The reverse of the above is true for blame and failure. When people are mean to you, or blame you for something, or are aggressive toward you, or reject you, etc: someone in \"non-being\" looks inside and realizes that those actions don't change who they are. They might feel temporarily startled, but let it pass. In fact, often times it's because the people blaming you are actually not in \"non-being\" that they are blaming you! They might be a people-pleaser who is too attached to needing praise from other people, and perhaps you accidentally didn't give them that praise, and they are lashing out in anger. That has nothing to do with your fundamental state though.  Failure is the same. Who defines failure? Much of what we might deem as failures in our lives actually aren't failures. Perhaps we were just brought up with the conditioning from bigger figures (parents, teachers, adults) that certain things are failures and should bring shame, humiliation, resentment, sadness, discouragement. How do you really know it's \"failure\" though-- because someone else said so? Because someone blamed you? Because lots of people blamed you? Because everyone else is pointing at and laughing and excluding you?  Who says they're right? Someone in \"non-being\" wouldn't let this label of \"failure\" be applied to what they do, and just continue on their way (internally... though they'd obviously deal with the external situation if everyone else was laughing at them).  \"Success\" and \"failure\" are just often false distinctions, words that are empty and don't really have meaning, but these concepts have the potential to hurt us if we're confused about them, and I don't want you to be hurt.  So perhaps someone in \"non-being\" casually monitors their thoughts and emotions. You see your thoughts rise and fall and your emotions come and go, naturally, without being too attached to the pleasure or too averse to the pain. Emotionally, you're not like an addict, who feels that pleasure is good, but then craves more and more. You're not like the emotionally detached person, who feels that pain is bad, but then tries to close off or avoid the pain, sorrow, and hurt that they feel--that just makes them numb and decreases their ability to connect with people and things around them.  Mentally, you observe the labels and thoughts that come up in your mind, their associations, and the conclusions you come up with. You realize that some of the labels make false distinctions, or are meaningless labels, or just aren't quite right. You develop a kind of self awareness, of what you think, how you feel, what you say, what you do, how you react to people, what habits you're building over time.  It seems like a bit of effort at first, for some people, who aren't used to it. Sometimes it's tricky because a lot of emotional responses and thought systems are patterns that we've had for years, decades, or most of our whole lives. But as a result, you aren't bound by false ideas of happiness or sadness anymore; you aren't attached and addicted to pleasure or avoidant and closed off to pain, and you are just normal and content. ",
            "date": "Answered February 16, 2013",
            "views": "217",
            "upvotes": " View 122 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Kajal Lulla",
                    "user_href": "/profile/Kajal-Lulla-1"
                },
                {
                    "user_id": "Sam New",
                    "user_href": "/profile/Sam-New-24"
                },
                {
                    "user_id": "Julian Garcia",
                    "user_href": "/profile/Julian-Garcia-183"
                },
                {
                    "user_id": "Tammi Fuentes",
                    "user_href": "/profile/Tammi-Fuentes"
                },
                {
                    "user_id": "April Leonard",
                    "user_href": "/profile/April-Leonard-6"
                },
                {
                    "user_id": "Chandrakant Verma",
                    "user_href": "/profile/Chandrakant-Verma-14"
                },
                {
                    "user_id": "Roguer",
                    "user_href": "/profile/Roguer-1"
                },
                {
                    "user_id": "Jelyn Baron",
                    "user_href": "/profile/Jelyn-Baron"
                },
                {
                    "user_id": "George Pohner",
                    "user_href": "/profile/George-Pohner"
                },
                {
                    "user_id": "Andreas Nathanael",
                    "user_href": "/profile/Andreas-Nathanael"
                }
            ]
        },
        {
            "author_info": {
                "name": "Sachin Singh",
                "href": "/profile/Sachin-Singh-947"
            },
            "answer_text": "Thanks for A2A.. Happiness is an elusive goal; everyone seems to want it, but if it were easy to attain, the whole world would be happy and we wouldn’t need to keep searching for it. It’s not easy to be happy most of the time, but there are some tips that we can apply to make us happier. Here are ten scientific ways you can change your life to make your days just a bit more joyful: 1. Do More Physical Exercise It is one of the most common New Year’s Resolutions, and science has proven why exercise is very important in our life. A study cited in the book: “The Happiness Advantage” also confirmed the importance of exercise on our happiness level. Basically, this study looks into three groups of depressed patients. These three groups of depressed patients are each treated with medication, exercise, or a combination of the two. Here’s what they found: “The groups were then tested six months later to assess their relapse rate. Of those who had taken the medication alone, 38 percent had slipped back into depression. Those in the combination group were doing only slightly better, with a 31 percent relapse rate. The biggest shock, though, came from the exercise group: Their relapse rate was only 9 percent!” This study shows that exercise has the biggest effect in reducing depression. Here’s another study in the Journal of Health Psychology that also found that people who exercised are happier because they feel better about their bodies. All the evidence has shown that the benefits of exercise include a happy life, so what are you waiting for? Start exercising now. Start small and build a habit of routine exercising, so that you will be happier. 2. Get More Quality Sleep We spend roughly one third of our lives sleeping, so you cannot underestimate the importance of sleep for the quality of our lifes. Here’s an interesting study in 2011 from BPS Research Digest that shows how sleep affects our happiness. The research found that people who take an afternoon nap are desensitized to negative emotions yet more responsive to positive ones. This research shows that not only does sleep deprivation cause emotional problems, a sleep boost can bring emotional advantage. In other words, a good quality sleep does make people more positive and overally happier. 3. Put down your cellphone A study by Kent State University surveyed more than 500 students and found that frequent cellphone use was associated with lower grades, higher anxiety, and reduced happiness. “It’s likely that people spending more time on devices have less frequent contact with live social networks, and may be more vulnerable to social comparison that leaves them with a sense of emptiness,” says Ramani Durvasula, PhD, licensed clinical psychologist and professor of psychology at California State University in Los Angeles. “And anxiety may be due to the ‘I don’t want to miss out on anything’ effect – seeing everyone else’s social calendar makes it difficult to stay present in their own lives.” Even Aristotle extolled moderation in all things. Cell phone and technology is no exception. Excessive use of even the best technologies reduces our happiness in meaningful ways. So, put down your cellphone and your happiness level will surely improve. 4. Take More Social Time Perhaps you have heard about it before, but one of the top five regrets of the dying people is not spending enough time or staying in touch with friends and family. Spending more time with the people we care about is very beneficial to improving our happiness and our overall quality of life. Dan Gilbert, a Professor of Psychology in Harvard University explains it very well: “We are happy when we have family, we are happy when we have friends and almost all the other things we think make us happy are actually just ways of getting more family and friends.” Interestingly, not only that your social relationship can make you happier, it will also make you live a richer life. A study published in the Journal of Socio-Economics used a shadow pricing method and estimates that your relationships are worth around an additional $131,232 a year. So, just call your cousin who lives in another city and catch up with them on the phone. That will actually make you happier. 5. Spend More Time Outdoors Shawn Achor, who has lectured at Harvard University and Wharton School of Business, wrote in his book: ”The Happiness Advantage”, that spending as little as 20 minutes outside in a good weather not only boosts positive mood, but also broadens thinking and improves the working memory. Another study from The London School of Economics and Political Science also supports this claim. It mentioned that being outdoors, near the sea, on a warm, sunny weekend afternoon is the perfect spot for most. In fact, the participants of the study were found to be substantially happier outdoors in all natural environments than they were in urban environments. If you wonder what’s the best temperature that maximizes our happiness, you will be amazed that a research by the American Meteorological Society found that happiness is maximized at 13.9°C. 6. Help others for two hours per week You might be surprised to hear this, but spending money on other people (also called “prosocial spending”) boost happiness more than buying things for ourselves. A 2012 Harvard study gave away some money to participants of the study. Half of them were asked to spend it on buying things for themselves, while the other half was asked to spend the money by buying things for others. Here’s what they found: “Participants assigned to recall a purchase made for someone else reported feeling significantly happier immediately after this recollection; most importantly, the happier participants felt, the more likely they were to choose to spend a windfall on someone else in the near future. Thus, by providing initial evidence for a positive feedback loop between prosocial spending and well-being, these data offer one potential path to sustainable happiness: prosocial spending increases happiness which in turn encourages prosocial spending.” No wonder most millionaires and billionaires are very active in philanthropy. Philanthropy has been proven to increase happiness. Helping others does not always mean you need to spend money; you can also spend your time (for example via volunteering). Here’s a study in Zurich, Switzerland that supports the notion that volunteering is rewarding in terms of higher life satisfaction. So, how much time should you spend helping others? Buffer Blog has concluded that 100 hours per year (or two hours per week) is the optimal time we should dedicate to helping others, in order to enrich our lives and be happier 7. Meditate You might have heard that meditation is very important. The truth is, yes, meditation helps you improve focus, clarity, attention span, calmness, and, you guessed it right, your happiness. A research team from Massachusetts General Hospital looked at the brain scans of 16 people before and after they participated in an eight-week course in mindfulness meditation. This study concluded that after completing the course, parts of the participants’ brains associated with compassion and self-awareness grew, and parts associated with stress shrank. So, what are you waiting for? Start meditating now and you will live a happier life. 8. Practice Gratitude Gratitude is the act of being thankful for simple things in our life. Practicing gratitude has been proven to increase happiness. There’s a study from Journal of Personality and Social Psychology that suggests that a conscious focus on blessings (in other words: practicing gratitude) have emotional and interpersonal benefits. So, be grateful of the every little thing in your life, because there are a lot more people that are not as fortunate as you. 9. Spend money on experience, not things Everyone knows that money can’t buy happiness per se, but if you’re going to spend money in search of satisfaction, splurge on an experience, not an expensive toy. A study in Psychological Science found that those who tended to spend their money on doing, as opposed to having, were better off in the long run. This effect was chalked up to the perceived superiority of anticipating an experience (like a trip) to anticipating owning an object (like shoes). 10. Practice Your Spirituality Or Faith Though religion alone isn’t a great predictor of happiness, a study published in Frontiers In Psychology found that those who actively practiced their faith were happier than both those who had a religion but didn’t practice, and those who were non-religious. This isn’t to say that you have to be religious to be happy, but if you DO have theological inclinations, you may want to make spirituality a habit. An Additional note: An epic Harvard study about happiness that was conducted for a time period of more than 75 years (it is called Harvard Grant Study) has concluded: “Love is really all that matters for humans to be happy”. Similarly, the 10 happiness hacks mentioned above in this article pretty much have a single common theme: “LOVE”. Love the Universe (God), love other humans, and most importantly love yourself. As a health coach I personally think loving yourself is one of the most forgotten things in today’s society. Many people have been neglecting their own body, mainly by eating food that is deficient in key nutrition and not making exercise a habit. I believe that we all want to have a healthy body, a “dream body”. Some of us might have tried to achieve it, but got no results. The key reason on why we failed is because we have been focusing on the wrong stuff all along. We didn’t focus enough on behavioral and psychological science. We all know that our life is shaped by our habits, and yet we are neglecting them. Conclusion:- You are fully in control of your own habits, your own body, and your own life. Use the information above as a guide to live a happier and more fulfilling life Thanks for reading… for more help you can followe on qoura.. keep reading,keep learning.. ",
            "date": "Answered August 31, 2018",
            "views": "28",
            "upvotes": " View 9 Upvoters ",
            "upvoters": [
                {
                    "user_id": "April Leonard",
                    "user_href": "/profile/April-Leonard-6"
                },
                {
                    "user_id": "Good Love",
                    "user_href": "/profile/Good-Love-18"
                },
                {
                    "user_id": "Alan Lobo",
                    "user_href": "/profile/Alan-Lobo-26"
                },
                {
                    "user_id": "Steven Borkowski",
                    "user_href": "/profile/Steven-Borkowski-2"
                },
                {
                    "user_id": "Mark Foerderer",
                    "user_href": "/profile/Mark-Foerderer"
                },
                {
                    "user_id": "Zannatun Zinat",
                    "user_href": "/profile/Zannatun-Zinat-1"
                },
                {
                    "user_id": "Sarah Rogers",
                    "user_href": "/profile/Sarah-Rogers-10"
                },
                {
                    "user_id": "Connie Knoblick",
                    "user_href": "/profile/Connie-Knoblick"
                },
                {
                    "user_id": "Naresh Bangani",
                    "user_href": "/profile/Naresh-Bangani"
                }
            ]
        }
    ]
}