{
    "title": "How does it feel to be high on heroin? - Quora",
    "tags": [
        "Heroin",
        "Psychedelic Drugs",
        "Recreational Drugs",
        "Emotions"
    ],
    "response": [
        {
            "author_info": {
                "name": "James Martin",
                "href": "/profile/James-Martin-182"
            },
            "answer_text": "All pressumimg you did an adequate yet safe dose of decently pure heroin (diacetylmorphine) or similar opiate (e.g prescribed Dilaudid or Morphine)…and NOT the so called “white china” - much of which (nowadays anyway. Before white China used to be A grade Heroin until fentanyl came along) is fentanyl from China & is responsible for the sharp rise in OD's recently… Look into it / basically don't touch the fent or fake “white china” aka easy to make in a lab fent powder. Btw fent isn't always white… However the chineese gov despite proof that the majority is coming from there refuse to admit it. Also note that just because it's not white it doesn't mean it's legit heroin either. I've seen brown , purple and grey heroin being passed off as fent too. Anyways…ive written an answer on the whole fentanyl thing, it coming from china, chineese gvt refusing to recognize the problem & a sharp rise in overdoses as fent is cheaper to produce , smuggle etc than Heroin. And most importantly so very much stronger milligram for milligram - but despite being stronger it's lacks a certain enjoyable feeling that most other opiates have. And it doesn't last long… So if me or many prior or currently addicted people could choose an opiate to fix up with I would pick uncut heroin or morphine any day to shoot up over fent. That for enjoyment and safety wise as well. And it keeps you well much longer/isn't as fiendish. It's very easy to OD on fentanyl and the withdrawals also start faster and are often worse. However douchebags continue to make and sell fentanyl -_- . But yes… For me it feels like I'm in my living room, wrapped in a cosy blanket by a fireplace looking outside and its like -50.Imagine that cosy feeling you get from that x100. You're worst enemy, war, famine, corruption & all the problems of the world dont seem so bad now. You kind of just want to lie there and enjoy it. Maybe have a little nod off if you want. You also feel a little itchy too but in a good way. The itchyness and relief you get from mosquito bites - the itchyness you get is similar to that and the relief you get when you itch mosquito bites. But it's not like a bad way like I said aka like meth where you may feel bugs crawling under skin. If you fall asleep on it you will have the best night sleep of your entire life. You may feel a little nauseated your first time but if you puke it actually feels good. Everything that bothers you is gone and you feel so happy in the moment and don't want it to end. Unlike MDMA I don't feel as talkative on it. Well not as much as MDMA. Don't get me wrong though I'm energized to work my crappy 12 hour shift mundane job - that shift flies by (if I'm on a moderate dose. Higher dose I wouldn't recommend unless you want to be fired or have a tolerance) . Without it that job makes me want to kill myself lol. And of course any social interaction is somewhat improved and social anxiety is reduced on opiates/heroin... But hey that's Heroin for ya. I don't feel that it has a psycadellic effect tbh.Just sedation, relaxation and pure euphoria/bliss. Don't reccomend trying it though. Especially not injecting it (Its a whole other level - Better yes. but what comes with it is the chance of a serious addiction. It feels so good that it's hard to stop and before you know it you've sold everything to carry on feeling good and not face withdrawl and are at rock bottom.). What comes with the injecting vs snorting, popping etc of many opiates one being heroin is they give u an extra rush. An amazing rush. As soon as the needle is plunged its like an orgasm x100 then that mellows out after usually a few mins into the the rest of the high described. The reason for injecting being superior & most effective (also most dangerous) is because it going right into your bloodstream to your brain in a matter of seconds at max bioavailability (with the exception of oxycodone and some other opiates - with those injecting them actually carries less bioavailability surprisingly.) therefore giving you a nice warm hug rush which will make you never really want to go back to taking it any other way but with a needle. Snort it or smoke it if you MUST . But even then just stick to weed. Not as bad for you and no where near as addictive.Like its seriously addictive for a reason. It's because it is the best feeling ever ... ... Especially for those dealing with some form of emotional or physical pain… while it lasts anyways… But then coming back to the normal world where you dont feel like the best you have ever felt anymore can be pretty damn hard. Eventually if and when your addiction gets really bad you can forget what I said above about what it feels like as at this point it will just make you feel normal… Or not get you nearly as high as I just described above. It has been shown to hardwire and change the reward circuit in your brain significantly. It stimulates it so much that things like love, excitement, energy and more aren't felt as strongly by the brain of an ex opiate user. This whole answer goes for any strong opiate when injected from Heroin to Hydromorphone to Morphine...(Don't support crappy, cheap to make & smuggle fentanyl. Only reason it's slowly becoming more popular. In terms of effects it's more dangerous and feels less euphoric but is sadly still an opiate.) Of course each opiate has their slight differences (e.g mg for mg each has a different potency. And more.) but at the end of the day they all feel kinda similar when taken in their relative dose as they are all opiates. They're the perfect drug for many. Just too perfect - And anything usually to good to be true usually is. Hence the downward spiral of heroin addiction if you use it often enough just for a few weeks. At first it is the perfect drug. There's no hangover, you aren't cracked out like stimulants, not shy, calm, cool,. a little pin eyed but it's literally the perfect drug . Heroin or morphine which u can obtain in pure form more often and is safer to inject. Then eventually after some time your body starts to become tolerant/dependent/adjust to it - And if it gets bad enough your doing it just to feel normal or get out of bed. You successfully quit then try doing it once in a while & most can't use just once already addicted. If you've never used it before and are going to use it anyways this is why you should only expirement with it and not use it more than a couple times (& that's if you must)…. That or if you are in pain. I don't support drs who completley refuse to prescribe opiates for people with chronic pain. Sure try other meds first and opiates last but for many it's honestly the only thing that works…. Go through chronic pain yourself before questioning this. It's no walk in the park physically ofc or emotionally…. I've tried alot of medications including medical marijuana too and opiates honestly were the best for pain… If you have the discipline to take them as prescribed. Which I know I can't do but know many who can and have… soo im clean yay but also suffer with chronic pain now. ",
            "date": "Updated October 22, 2018",
            "views": "883",
            "upvotes": " View 166 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Nisan jet",
                    "user_href": "/profile/Nisan-jet"
                },
                {
                    "user_id": "Stephanie Park",
                    "user_href": "/profile/Stephanie-Park-34"
                },
                {
                    "user_id": "Moises Gutierrez",
                    "user_href": "/profile/Moises-Gutierrez-20"
                },
                {
                    "user_id": "Karatel Online",
                    "user_href": "/profile/Karatel-Online"
                },
                {
                    "user_id": "Ke Dar",
                    "user_href": "/profile/Ke-Dar-2"
                },
                {
                    "user_id": "Hailey P",
                    "user_href": "/profile/Hailey-P-1"
                },
                {
                    "user_id": "Bhanu Verma",
                    "user_href": "/profile/Bhanu-Verma-19"
                },
                {
                    "user_id": "Jan Calder Frank",
                    "user_href": "/profile/Jan-Calder-Frank"
                },
                {
                    "user_id": "Joanna McNally Burgess",
                    "user_href": "/profile/Joanna-McNally-Burgess"
                },
                {
                    "user_id": "Eric Gibson",
                    "user_href": "/profile/Eric-Gibson-124"
                }
            ]
        },
        {
            "author_info": {
                "name": "Jeff Mellinger",
                "href": "/profile/Jeff-Mellinger-3"
            },
            "answer_text": "Personally I can't tell you what it's like, but what I can say is that Satan has many disguises and I have tried almost all of them. From alcohol to Xanax and everything in between, if it could be abused then I would raise my hand. My addictions started at about the age of 12 when I got drunk for the first time at my sister's wedding reception. My father found out about it and beat the hell out of me, but the damage was done, there was no turning back now. I had found my true love and it was anything that would get me high and in the sixties it was as simple as could be. Almost everyone at school was experimenting with some kind of drug or alcohol. At first I was a little hesitant about popping pills but that didn't last long. First it was cross tops aka mini whites (speed) then downers (barbiturates) and then soon after that it was anything that I could get my hands on especially my favorite LSD. I loved acid! Of course I dropped out of school and joined the Army. It wasn't my idea but my parents were sick and tired of me stealing from them to get the drugs that I wanted but was to lazy to work for. To my pleasant surprise there were more drugs available in the Army than I would have ever thought. It was the Vietnam era and it was part of the Army life and boy was I happy, for a while anyway. Being afraid that I would be sent to a war zone I found a way to get kicked out of the service. Boy were my parents proud. After getting out of the service I couldn't find a job but I was receiving a small amount of unemployment benefits so I decided to invest it in drugs for resale. Back then drugs were easy to get, cheap, and even easier to sell. I had found my calling I was going to be a drug dealer and live at the beach. What a dream come true, all the drugs that I wanted and more money than I knew what to do with. I was getting high on something almost everyday of my life. I was not a good looking guy but when you had cocaine it never mattered at all. With a beautiful woman on my arm and loads of money in my pocket I was invincible and on my way to a life of leisure and a very early retirement. Bullshit!!! One thing about drugs is that they don't discriminate. They don't care if you're Male or female, rich or poor, smart or stupid, they don't care sooner or later they want you to pay the Devil his dues, and when that time comes there is no way to stop it. I went to jail and lost all of my money, my beach house, my beautiful wife (she was a strip club girl) and my Porsche. Everything that I barely worked for was gone including my drugs. I was forced to get clean in jail and detoxing in jail back then was no picnic. There were no rehab programs for inmates back then and the police could care less if you were heaveing your guts out and drenched in sweat while crapping your pants. To a smart person this incident would have probably been a big wake up call, but let's admit it drugs have never ever made anyone a rocket scientist and I was no exception. Now you would think that after a stint in the slammer and now clean for longer than I have ever been since my early teens that I would take the opportunity to get my life together and maybe find a different way of living. Like I said, drugs will never agree with a smart move on your part. I got high my first day out of jail and never looked back. Granted, I was not in the same position as before but I was determined to not let that hold me back, the road to Hell was an easy one to find and I was in the driver's seat, pedal to the metal so to speak. I had never had a regular job since I had left the Army. I was now in my mid thirties with no job skills or talent for anything. I knew that I needed to find something to make some money cause all of my connections had dropped me after the run in with the law. It's amazing how fast your so called good friends will disappear when you have been arrested. I was still able to get alcohol so I didn't have to go sober until I got some cash to operate with. I was determined to ruin my life and no one was going to stop me. I know by now that you are probably wondering were is this story going? So I will speed it up. No I have never done heroin by mainline though I did smoke it a few times and never felt like it was my thing. I loved to go in the other direction, fast and furious with coke until I found prescription drugs. This was a whole new world to be explored and I was ready, willing and able. Back in the 80s and early 90s there were many doctors in downtown Los Angeles that would write you a script for whatever you wanted for a small fee. There used to be lines of people down the street waiting for their turn to get stuff and there was always a pharmacy near by. Qualudes were the most popular and they were easy to get and easy to sell. This is where my life goes to hell and I was in for the ride. Since then I have been addicted to some kind of pain medication up until now. No I have never shot heroin but I have taken an enormous amount of Oxycodone and Oxycontin. Anywhere from 5 to 7 hundred milligrams a day for a long time. I have been through rehab 3 times and have detoxed at home another 5. As I'm writing this I am detoxing off suboxone for the 4th time. I have had open heart surgery, kidney surgery, aortic aneurysm surgery and I'm a diabetic. I just found out last month that I have stage 3 kidney disease. I turn 67 in a few days but I feel like I'm 90. So was it worth it? You tell me! I have ruined my life with drugs and alcohol. It's only by the Grace of God that I'm still alive and am able to afford medical insurance for my wife and I. If I could turn back the clock I would hope that I would have made better decisions and made something of myself. I'm actually a fairly intelligent man who made the wrong choices years ago. I hope that by writing this article that maybe someone who is on the edge will take heed and change their minds about using. It's not worth it guys… ",
            "date": "Answered March 26, 2019",
            "views": "113",
            "upvotes": " View 88 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Ar Kr",
                    "user_href": "/profile/Ar-Kr-2"
                },
                {
                    "user_id": "Cameron Rich",
                    "user_href": "/profile/Cameron-Rich-10"
                },
                {
                    "user_id": "Levente Schiller",
                    "user_href": "/profile/Levente-Schiller-2"
                },
                {
                    "user_id": "No-Posts McGee",
                    "user_href": "/profile/No-Posts-McGee"
                },
                {
                    "user_id": "Corina Cummings",
                    "user_href": "/profile/Corina-Cummings-1"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/Staci-A-4"
                },
                {
                    "user_id": "Ke Dar",
                    "user_href": "/profile/Ke-Dar-2"
                },
                {
                    "user_id": "Shivam Vohra",
                    "user_href": "/profile/Shivam-Vohra-11"
                },
                {
                    "user_id": "Jan Calder Frank",
                    "user_href": "/profile/Jan-Calder-Frank"
                },
                {
                    "user_id": "Dianne Fedoruk",
                    "user_href": "/profile/Dianne-Fedoruk"
                }
            ]
        }
    ]
}