{
    "title": "How to learn by reading - Quora",
    "tags": [
        "Buddha and His Dhamma",
        "Educational Books",
        "Reading Recommendations",
        "Learning New Things",
        "Learning",
        "Reading",
        "How-to Question",
        "Books"
    ],
    "response": [
        {
            "author_info": {
                "name": "Say Keng Lee",
                "href": "/profile/Say-Keng-Lee"
            },
            "answer_text": "Learning by reading is just a small part of the equation. I call this part of yours as having \"word experience\". Putting what you have learned from all your reading to work in your life is the more important part. I call this part of yours, if you do it, as having \"world experience\". By doing so, you know what had worked, what didn't work, and possibly, what could work better the next time. With constant adaptation and continually evolving it on your part in many different ways, and also, in numerous different application contexts, you gradually build up your \"world experience\". This is he true basis of having knowledge. Cumulative knowledge over time brings you to the expertise level. Discerning usage of your expertise over time is likely to bring you to wisdom. Then again, as a word of caution, not everything can be learned by reading.  Sometimes, you have got to get yourself a competent instructor or a kind mentor as needed. How? Just be ready with all your learning pursuits, and working practices.  When the student is ready, the teacher always appears. It's a wise maxim, and it is real! ",
            "date": "Answered July 5, 2015",
            "views": "16",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Mahmod Erfan",
                    "user_href": "/profile/Mahmod-Erfan"
                },
                {
                    "user_id": "Bernadette Cormier",
                    "user_href": "/profile/Bernadette-Cormier"
                },
                {
                    "user_id": "Papu Das",
                    "user_href": "/profile/Papu-Das-5"
                }
            ]
        },
        {
            "author_info": {
                "name": "Dominique Fitzgerald",
                "href": "/profile/Dominique-Fitzgerald-6"
            },
            "answer_text": "English language. There was a study done by Cambridge university on reading and grades at school. It found even 15 mins a day of reading improved study results. When I was in yr 11 and 12 I put this to the test. I made a goal to try and read the most books in the school by the end of yr 12. The only catch was it had to be novels and series books. Book included medieval fantasy with difficult words and words created by the author. My English grades in yr 10 were average score of C or Sound. By the end of yr 12 I was between A and B or VHA and HA. This had a flow on effect with other classes, achieving higher grades in those classes also. It improved memory as I had to remember the story line and where I was up to. I found my English improved and ended up having to study less. It improved my focus in class helping me to remember my studies better. The librarian began asking me which books were good and occasionally review some of the new books for her. Later, during my spare time I went on to do some book reviews for an author in America of which I enjoyed. Some books including fiction may also include real historical or other facts on many subjects. The truth is you never stop learning, whether it's school, work, a hobbie or just something random you read online or in the news. ",
            "date": "Answered December 1, 2018",
            "views": "16",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Ali Adnan",
                    "user_href": "/profile/Ali-Adnan-210"
                },
                {
                    "user_id": "Elena Morocica",
                    "user_href": "/profile/Elena-Morocica-2"
                }
            ]
        },
        {
            "author_info": {
                "name": "Sipoy Satish",
                "href": "/profile/Sipoy-Satish"
            },
            "answer_text": "Learn by Reading (By Books - I don't know much about academic books, but my acedemic books are useful for my profession)First: Believe that book will change your life (Never Doubt)Second thing is applying what ever you learn from books. Without applying those Principles and Advice it is waste of time.Third: make a practice what ever you do for continuosly for 21 days or 41 days then it will turn into your habit I feel this three basic steps are enough to learn anything by reading.Sorry for my bad English ",
            "date": "Answered September 16, 2015",
            "views": "739",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/Ankireddypalli-sai-Kumar-Reddy"
                },
                {
                    "user_id": "Sajida Salma",
                    "user_href": "/profile/Sajida-Salma"
                }
            ]
        },
        {
            "author_info": {
                "name": "William Beeman",
                "href": "/profile/William-Beeman"
            },
            "answer_text": "Reading is just a vehicle for conveying information. In order to learn from reading you have to \"work through\" your material. If you are reading a light novel for entertainment of course you don't have to do this.  By \"working through\" I mean taking notes, posing questions to yourself about the material, looking up facts or words with which you are unfamiliar. If you are working with foreign language material, you can learn a huge amount by reading it aloud.  In short the page of a book should be a kind of launching pad for further exploration of ideas or material. ",
            "date": "Answered September 10, 2015",
            "views": "11",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Emma Lofthouse",
                    "user_href": "/profile/Emma-Lofthouse-1"
                },
                {
                    "user_id": "Red Augwal",
                    "user_href": "/profile/Red-Augwal"
                }
            ]
        },
        {
            "author_info": {
                "name": "Mohamed Ahmed Said",
                "href": "/profile/Mohamed-Ahmed-Said-1"
            },
            "answer_text": "Hello. I strongly recommend you to take this course Page on coursera.org . It would really help ypu in terms of studying, reading and learning. I wish you the best. ",
            "date": "Answered September 10, 2015",
            "views": "516",
            "upvotes": "0"
        }
    ]
}