{
    "title": "How should you prepare to meet a financial advisor? - Quora",
    "tags": [
        "Financial Advisors",
        "Financial Planning",
        "Meeting New People",
        "Financial Advice",
        "Personal Finance Advice",
        "Personal Finance",
        "Finance",
        "Investing",
        "Interpersonal Interaction"
    ],
    "response": [
        {
            "author_info": {
                "name": "Asanee Brogan, Ph.D",
                "href": "/profile/Asanee-Brogan-Ph-D"
            },
            "answer_text": "Thanks for the question Cameron. It is best to start by collating all of your financial documents that paint a holistic picture of your income, expenses, and debt. This way your advisor will know what you have available to save and invest. It is also imperative for you to have a clear vision of what your financial goals are. Do you want to save, invest, and/or plan for retirement. It is also very important to have a solid understanding of how much risk you are willing to take with your money. These are personal questions that only you can answer. If you don’t have a clear answer to them prior to speaking with an advisor, you should really give them some thought. Your advisor can help you answer them but chances are he or she will ask you these types of questions and if you are not prepared your advisor will give you the opportunity to think about this prior to your next session. You don’t have to be knowledgeable about investment options or things of this nature as your advisor will guide you in these matters. But to have an effective relationship with your advisor I definitely suggest that you have your financial goals outlined as best as possible. ",
            "date": "Answered May 17, 2020",
            "views": "32",
            "upvotes": " Answer requested by Cameron Ruddick"
        },
        {
            "author_info": {
                "name": "Prashanth Prabhu",
                "href": "/profile/Prashanth-Prabhu-35"
            },
            "answer_text": "A financial advisor, like the name suggests, understands your financial situation and advises on the same. He/She is an expert who understands your present situation i.e., your cash flows. He/She works on channelising your savings into a fruitful source, thereby organising and adding structure to your finances. Watch this video to understand how to you choose a financial advisor in the first place. It is important to keep in mind that the intent for a long-term commitment to your adviser is to build a wealth corpus or subject's to one's goal. Hence, it is important to gauge certain factors like trust, comfort, reliability with your advisor before committing to a long time goal plan. Watch this video for more: https://www.youtube.com/watch?v=q7_28MjtJ4A This video also has a checklist attached to filter your requirements while looking for a financial advisor better. There has to be a certain amount of groundwork that needs to be done by an individual even though the financial advisor handles most of the major work through their expertise. It is a commitment from both ends, and a financial advisor can deliver if and only if a client cooperates and works together consistently. For getting in touch with a Financial Adviser, reach out to 29k Investment Advisers Pvt. Ltd. ",
            "date": "Answered May 28, 2020",
            "views": "46",
            "upvotes": "0"
        }
    ]
}