{
    "title": "How to make my girlfriend talk more - Quora",
    "tags": [
        "Girlfriends",
        "How-to Question",
        "Love Life Advice",
        "Dating Advice"
    ],
    "response": [
        {
            "author_info": {
                "name": "Stuart Davis",
                "href": "/profile/Stuart-Davis-3"
            },
            "answer_text": "First up: You can't *make* your girlfriend do anything. Perhaps you mean \"encourage\"? Second: It depends very much on what you mean by \"talk more\". Are you talking about being chatty, or discussing relationship issues, or talking more during sex? There are different answers to each... If it's just being chatty, and if she is by nature not very talkative, why are you trying to change her? If she is comfortable not chatting much then that is who she is - can you accept her the way she is? If it's about communicating effectively in your relationship then that is a larger issue - good relationships rely on good communication skills - effectively expressing ones own needs and checking on the needs of the other. Maybe she has had bad experiences in the past, maybe she is a natural introvert, maybe she hasn't had much relationship experience. I have too many questions about this to be able to really provide much of an answer beyond this. ",
            "date": "Updated January 31, 2019",
            "views": "53",
            "upvotes": " View 8 Upvoters",
            "upvoters": [
                {
                    "user_id": "Uzo Nwanegbo",
                    "user_href": "/profile/Uzo-Nwanegbo"
                },
                {
                    "user_id": "Mâñïşh Ķümäř",
                    "user_href": "/profile/Mâñïşh-Ķümäř"
                },
                {
                    "user_id": "Gilbert Simanjuntak",
                    "user_href": "/profile/Gilbert-Simanjuntak"
                },
                {
                    "user_id": "André Lima",
                    "user_href": "/profile/André-Lima-25"
                },
                {
                    "user_id": "Nilesh Rathod",
                    "user_href": "/profile/Nilesh-Rathod-35"
                },
                {
                    "user_id": "Ati Uttam",
                    "user_href": "/profile/Ati-Uttam"
                },
                {
                    "user_id": "Hemant Pandey",
                    "user_href": "/profile/Hemant-Pandey"
                },
                {
                    "user_id": "Eric Samuel Hibba",
                    "user_href": "/profile/Eric-Samuel-Hibba"
                }
            ]
        },
        {
            "author_info": {
                "name": "Deepak C",
                "href": "/profile/Deepak-C-29"
            },
            "answer_text": "Yup yup yup I love this question. Firstly please do some more work and know your girlfriend from inside out.what i mean to say is to know her personality. Know what she likes and what she doesn't.if she is an introvert then the only way you can make here talk to you more is by getting her out of house and go with her for a date or trips of casual walks .give her space to open up to you.she shall feel secure being with you and talking to you.build up that trust factor in your relationship. Lastly please understand your girlfriend also is a human being and have her own personality. Don't be too dependent on her for your emotional needs and talk's Give her space and let her reciprocate too ",
            "date": "Answered September 12, 2016",
            "views": "22",
            "upvotes": " View 2 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Rohit Maskey Newar",
                    "user_href": "/profile/Rohit-Maskey-Newar"
                },
                {
                    "user_id": "Mâñïşh Ķümäř",
                    "user_href": "/profile/Mâñïşh-Ķümäř"
                }
            ]
        },
        {
            "author_info": {
                "name": "Gwen Sawchuk",
                "href": "/profile/Gwen-Sawchuk"
            },
            "answer_text": "Don’t feel you have to fill every silence. Ask open ended questions, questions that can’t be answered with a yes or no. Listen carefully when she does speak - so you learn her true interests and goals Value her input. Make sure to tell her how much you appreciate what she has shared with you. ",
            "date": "Answered July 9, 2017",
            "views": "21",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Mujeeb Adekunle",
                    "user_href": "/profile/Mujeeb-Adekunle"
                }
            ]
        },
        {
            "author_info": {
                "name": "Abinezer Kunjukutty",
                "href": "/profile/Abinezer-Kunjukutty"
            },
            "answer_text": "Make her more interested in you . Show her how much you love her . If she finds out how much you love her she will find more time to talk to you. ",
            "date": "Answered May 18, 2018",
            "views": "454",
            "upvotes": " Answer requested by Manish Reddy"
        },
        {
            "author_info": {
                "name": "Nid HiMiss Nee",
                "href": "/profile/Nid-HiMiss-Nee"
            },
            "answer_text": "what have you done on your side till now to make her talk more? ",
            "date": "Answered May 7, 2016",
            "views": "182",
            "upvotes": " Not for Reproduction "
        }
    ]
}