{
    "title": "How to write a book review - Quora",
    "tags": [
        "Book Reviews",
        " Reviews"
    ],
    "response": [
        {
            "author_info": {
                "name": "Aaryaveer",
                "href": "/profile/Aaryaveer"
            },
            "answer_text": "A structured book review, i am just giving a general skeleton which is most precise and apposite:- Name of the book- Name of the Author- Paragraph 1: Begin the review with a very catchy opening line, something which is the essence of the book, maybe one of the lines from the book which sums up the theme of the book. And then continue writing a medium length paragraph describing the rough idea of the book. Paragraph 2: This paragraph has to be dedicated to the author. The first line about his life and few works and then write a short to medium para about the author in close connection with the book. Para 3: This has to be a very short para, describing the setting of the story, its main character, ( cleverly write one descriptive adjective for each character ), the time period it is set in, historical allusions if any, etc. Para 4: The most important one, this has to be the main thing, you will have to describe the main themes of the book in a close knit association with the story, you have to be descriptive but not philosophical. Write as if you are criticizing as well as praising the book, also include how have the themes been brought out in the book, make allusions to some good dialogue from the book and in general give a detailed describing thematic storyline without turning as i said philosophical. Para 5: not in a very negative sense describe what's missing in the book, appreciate the sincere effort of the author but state what is left out and use words to state whether it becomes too lengthy or morose at points, etc. i.e make a very verbose critical appreciation of the book. Para 6: write something about the background of the book, the genre of the book and how successful has the author been in carrying out this genre.Write about the characters and what do they stand for In the book.make it a long one. Conclusion: Write about the impact of the book, how eloquent or insipid is it , whatoral message it gives , whether its worth reading, has the author won in his effort to weave a wordy net to entangle the reader's mind. You can obviously add or remove paragraphs, but this would suffice, it includes everything about the book. ",
            "date": "Answered October 10, 2016",
            "views": "37",
            "upvotes": " View 39 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Christana Janel Meñez",
                    "user_href": "/profile/Christana-Janel-Meñez"
                },
                {
                    "user_id": "Karen Perez",
                    "user_href": "/profile/Karen-Perez-454"
                },
                {
                    "user_id": "Swaroop",
                    "user_href": "/profile/Swaroop-115"
                },
                {
                    "user_id": "Shashank Awasthi",
                    "user_href": "/profile/Shashank-Awasthi-25"
                },
                {
                    "user_id": "Rahulraj Singh",
                    "user_href": "/profile/Rahulraj-Singh-13"
                },
                {
                    "user_id": "Pratibha Singh",
                    "user_href": "/profile/Pratibha-Singh-299"
                },
                {
                    "user_id": "Md Raihan",
                    "user_href": "/profile/Md-Raihan-93"
                },
                {
                    "user_id": "Mayumi Miura",
                    "user_href": "/profile/Mayumi-Miura-1"
                },
                {
                    "user_id": "Sonalika Shaw",
                    "user_href": "/profile/Sonalika-Shaw-1"
                },
                {
                    "user_id": "Smera Sarnath",
                    "user_href": "/profile/Smera-Sarnath"
                }
            ]
        },
        {
            "author_info": {
                "name": "Nick Lan",
                "href": "/profile/Nick-Lan"
            },
            "answer_text": "Write a good review that people will love is not that diffucult, you can finish it within just 10 steps.Step 1. Try to dig out some clues about this book without reading it. For example: Does the book having an elegant typography? Can you figure out what the book will tell you from the cover? Is the book advertised exaggeratedly? In which genre does the publisher classify it? All these will tell you who is the target-reader of this book.Step 2. Open the book and scan it fast, and find out how the author organizes the sentences, there are how many pages and chapters, the paragraphs are long or short in average, and whether there are many dialogs in the content. From the elements above, you can have a rough idea about if this book is easy to read, and how the author builds the structure.Step 3. Create a frame to take notes, this will help you concentrate on some details when you read the book. You must have already drawn a outline for this book through the preparations above, then you can divide the entire book into several parts upon chapters or how the story goes, you can even sort them out by roles in the story. And you can write down some questions, like \"Why this book ranks top 5 in the list\", \"Why the editor recommends this book\" and all other questions you want to know.Step 4. Read this book over.Step 5. Concentrate. This is the biggest challenge for most readers, when you read a book, you need to be aware of the reading experience. Which part attracts you most? Which one make you feel boring? Which chapter is the key-point of the story? Which role you like most? And why?Step 6. It's time to fulfill the frame which you created in step 3. Now you backward to the beginning of the book, and take notes with the questions. What happened in the first chapter? How did it affect the story and how you feel about this chapter? Repeat this work one chapter by one chapter, and don't forget to mark those highlights. Finally answer these questions: \"How does this book affect you on the whole?\" \"How does the author achieve this?\" \"How does each role affect the story?\"Step 7. Sum the book up. This is the beginning of your book review, you have to keep it short and to the throat.Step 8. Judge the book. This is the other part of your book review, you should tell your readers do you think this book is good or bad? And don't just give the result, you need to explain why. Now it is the show time for all your notes, you should use those notes, questions and answers to support your points from every angle.Step 9. Spend some time on the book's related information as the supplement for your book review. For instance, in which genre will you classify this book? Is this book a pioneer in this kind of style, or it's just a simulation? Is this the first book of the author? If not, compare it to other works of the same author. And compare it to other works of the same genre.Step 10. Now you have almost finished your book review, time to look back and test your points. Have you covered all the important elements of the book? Who are your target reader? Are you writing this review to serve someone? Is your review outstanding among all the reviews of this book? If not, then you need to check the previous 9 steps and enhance your book review; if yes, your book review is finished!link:http://www.epubor.com/how-to-write-a-book-review.html ",
            "date": "Answered December 26, 2013",
            "views": "42",
            "upvotes": " View 24 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Karim Uddin",
                    "user_href": "/profile/Karim-Uddin-34"
                },
                {
                    "user_id": "Dithsa Sanyal",
                    "user_href": "/profile/Dithsa-Sanyal"
                },
                {
                    "user_id": "Eromeni On",
                    "user_href": "/profile/Eromeni-On"
                },
                {
                    "user_id": "Rahulraj Singh",
                    "user_href": "/profile/Rahulraj-Singh-13"
                },
                {
                    "user_id": "Như Quỳnh Phạm",
                    "user_href": "/profile/Như-Quỳnh-Phạm"
                },
                {
                    "user_id": "Mayumi Miura",
                    "user_href": "/profile/Mayumi-Miura-1"
                },
                {
                    "user_id": "Ramandeep Kaur",
                    "user_href": "/profile/Ramandeep-Kaur-871"
                },
                {
                    "user_id": "Ojedokun Bukky",
                    "user_href": "/profile/Ojedokun-Bukky"
                },
                {
                    "user_id": "Meidy Fangelene",
                    "user_href": "/profile/Meidy-Fangelene"
                },
                {
                    "user_id": "Bevara Santosh",
                    "user_href": "/profile/Bevara-Santosh-1"
                }
            ]
        }
    ]
}