{
    "title": "How does a new author get book reviews? What people would they get book reviews from and how does a new author go about contacting these potential reviewers? - Quora",
    "tags": [
        "Book Reviews",
        "Product Reviews",
        "Book Publishing",
        "Publishing",
        " Reviews",
        "Writers and Authors",
        "Literature",
        "Writing",
        "Book Recommendations"
    ],
    "response": [
        {
            "author_info": {
                "name": "Michael Lowrey",
                "href": "/profile/Michael-Lowrey-7"
            },
            "answer_text": "His or her publisher sends (or at least offers) review copies to book reviewers such as myself who are known to review that type of book. That’s part of how a publisher earns their shares of the book’s profits (if any). They may do the same with experts in the field, book trade people who might order the book in quantity or recommend it to their purchasing staff, people whom the author has informed them might be interested (either because of the nature of the work or because they are familiar with the author), and/or occasionally people who write the same kind of book AND ARE KNOWN BY THE PUBLISHER TO BE RECEPTIVE. (Stephen King is known to be a very sympathetic reviewer of less-known writers’ work.) ",
            "date": "Answered June 22, 2020",
            "views": "46",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Will Greenway",
                "href": "/profile/Will-Greenway-1"
            },
            "answer_text": "How does a new author get book reviews? What people would they get book reviews from and how does a new author go about contacting these potential reviewers? Just be very careful of trying any review schemes at Amazon. They have ways of detecting behaviors and even knowing if it’s relative commenting on the work… they will take them down… and if it’s too egregious they will take you down … and it can take 6 months to a year to be reinstated. To give you a sense of how draconian this can be, I was in a Amazon exclusive agreement. Someone pirated my book and posted it. We got a strike. We were informed after we thought it was taken down, that it popped up again. Handed strike number 2. Mind you, this is outside of my power. I can’t control the internet and what people do. I hunted sites for days… thought it was clean. Before I could even report back they gave me a third strike. And banned me from any promotions or any sales programs. It took a year to get my privileges back after we managed to get all the pirated copies taken down. So, be careful… if you plan to work with them… don’t work with anyone else before hand… you’ll get messed up like I did.  ",
            "date": "Answered June 23, 2020",
            "views": "155",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Dirk Patze",
                    "user_href": "/profile/Dirk-Patze"
                }
            ]
        }
    ]
}