{
    "title": "How come movies are never like the books? - Quora",
    "tags": [
        "Book to Film Adaptations",
        "Reading",
        "Books"
    ],
    "response": [
        {
            "author_info": {
                "name": "David Melon",
                "href": "/profile/David-Melon-2"
            },
            "answer_text": "Because they are an entirely different format. It's like asking a cat to behave like a dog: the results are pathetic.  Novel adaptations have to adapt and alter the story so that the same events happen in a sensory, not mental way. This means that characters have to say and do everything that, in a novel, is thought and perceived by means of internal speech. Just watch the David Lynch version of Dune and compare it to the television two-part miniseries, and you will see what I mean. Then, there is time limit. There is no real limit to how long a book can be. It can be 50 to 1.000 pages long, and it's still a novel. You read it individually, at your own pace. Not so with films. Moviegoing is, usually, a much more social experience, since you can watch the same film at the same time along with friends, family or couple. A film has a limited, specific time. Everyone who watches the film at the same time, starts and finishes it at the same time. And very few people are willing to sit through more than 3 consecutive hours of the same thing.  Consequently, the story itself often has to be streamlined so that it fits better within that time limit. Many small events have to be eschewed. Some character development has to be ignored. It just happens. Last but not least, there is a tendency in mainstream cinema to often (not always) dumb down their own movies. This can either be because of moviemakers and studios distrusting their spectator's intelligence or simply to appeal to a larger, broader audience. Choose your pick. Ultimately, I believe that maybe films and movies shouldn't be the same, at least not too much. A film adaptation that takes key ideas and spins new, fresh takes on an old story can be really satisfying too, as long as it makes sense. Just a thought. ",
            "date": "Answered January 24, 2016",
            "views": "565",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "E. Khan",
                    "user_href": "/profile/E-Khan-10"
                }
            ]
        },
        {
            "author_info": {
                "name": "Christine Gilbert",
                "href": "/profile/Christine-Gilbert-3"
            },
            "answer_text": "Because books and movies are completely different mediums. Movies are visual. Exposition must be done through dialogue, or occasionally by well-placed vignettes or off-screen narration. We can't know a characters thoughts directly; there must be an action or word to tell us what's going on in his head. ",
            "date": "Answered October 27, 2016",
            "views": "660",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Jack Lou",
                    "user_href": "/profile/Jack-Lou-16"
                },
                {
                    "user_id": "Jacob Grindel",
                    "user_href": "/profile/Jacob-Grindel"
                }
            ]
        }
    ]
}