{
    "title": "How great a leader was Harold Geneen? - Quora",
    "tags": [
        "Harold Geneen",
        "Corporate Executive Leadership",
        "Corporate Leaders",
        "Leadership Development",
        "Leaders"
    ],
    "response": [
        {
            "author_info": {
                "name": "Vijay Jeste",
                "href": "/profile/Vijay-Jeste-1"
            },
            "answer_text": "I would not call him a “Great Leader” by any measure. Sure, he grew ITT Corporation from $765 Million to $17 Billion However, he did it with acquisitions of too many disparate businesses that had nothing in common with the core business and strength of the original ITT Corporation. For instance, he acquired companies in insurance, hotel, and real estate management businesses. As soon as he stepped down from the CEO’s position, his successors, particularly Rand Araskog, steadily sold off parts of the business. He also played dangerous political games to oust leaders in foreign countries such as Brazil and Chile. Declassified documents released by the CIA in 2000 reveal that ITT financially helped opponents of Salvador Allende's government in Chile prepare a military coup. Under Geneen's leadership, ITT funneled $350,000 to Allende's opponent, Jorge Alessandri. When Allende won the presidential election, ITT offered the CIA $1,000,000 to defeat Allende, though the offer was rejected. These are not the signs of a true leader of a corporation, in my opinion. ",
            "date": "Answered September 14, 2019",
            "views": "34",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Momenul Ahmad",
                    "user_href": "/profile/Momenul-Ahmad"
                }
            ]
        },
        {
            "author_info": {
                "name": "Algis Ratnikas",
                "href": "/profile/Algis-Ratnikas-1"
            },
            "answer_text": "You can judge fore yourself based on his accomplishments. Harold \"Hal\" Sydney Geneen (b.1910), American businessman, died on 1997 Nov 21. He is most famous for serving as president of the ITT Corporation. From 1959–1977 he was the president and CEO of International Telephone and Telegraph Corp. (ITT). He grew the company from a medium-sized business with $765 million sales in 1961 into an international conglomerate with $17 billion sales in 1970. He extended its interests from manufacturing of telegraph equipment into insurance, hotels, real estate management, and other areas. Under Geneen's management, ITT became the archetypal modern multinational conglomerate. ITT grew primarily through a series of approximately 350 acquisitions and mergers in 80 countries. Some of the largest of these were Hartford Fire Insurance Company (1970) and Sheraton Hotels. (Harold Geneen - Wikipedia) ",
            "date": "Answered September 13, 2019",
            "views": "45",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Momenul Ahmad",
                    "user_href": "/profile/Momenul-Ahmad"
                }
            ]
        }
    ]
}