{
    "title": "How will I get The Book of Joy: Lasting Happiness in a Changing World PDF for free? - Quora",
    "tags": [
        "Free Ebooks",
        "PDF (file format)",
        "eBooks",
        "Free Products"
    ],
    "response": [
        {
            "author_info": {
                "name": "Asiya Rodgers",
                "href": "/profile/Asiya-Rodgers"
            },
            "answer_text": " An instant New York Times bestseller Two spiritual giants. Five days. One timeless question. Nobel Peace Prize Laureates His Holiness the Dalai Lama and Archbishop Desmond Tutu have survived more than fifty years of exile and the soul-crushing violence of oppression. Despite their hardships—or, as they would say, because of them—they are two of the most joyful people on the planet. In April 2015, Archbishop Tutu traveled to the Dalai Lama's home in Dharamsala, India, to celebrate His Holiness's eightieth birthday and to create what they hoped would be a gift for others. They looked back on their long lives to answer a single burning question: How do we find joy in the face of life's inevitable suffering? They traded intimate stories, teased each other continually, and shared their spiritual practices. By the end of a week filled with laughter and punctuated with tears, these two global heroes had stared into the abyss and despair of our time and revealed how to live a life brimming with joy. This book offers us a rare opportunity to experience their astonishing and unprecendented week together, from the first embrace to the final good-bye. We get to listen as they explore the Nature of True Joy and confront each of the Obstacles of Joy—from fear, stress, and anger to grief, illness, and death. They then offer us the Eight Pillars of Joy, which provide the foundation for lasting happiness. Throughout, they include stories, wisdom, and science. Finally, they share their daily Joy Practices that anchor their own emotional and spiritual lives. The Archbishop has never claimed sainthood, and the Dalai Lama considers himself a simple monk. In this unique collaboration, they offer us the reflection of real lives filled with pain and turmoil in the midst of which they have been able to discover a level of peace, of courage, and of joy to which we can all aspire in our own lives. ",
            "date": "Answered December 18, 2018",
            "views": "456",
            "upvotes": "0"
        }
    ]
}