{
    "title": "How are first- edition books distributed? What stores get first edition books to sell to the public? - Quora",
    "tags": [
        "First Edition Books",
        "Rare First Edition Books",
        "Book Sales",
        "Book Collecting",
        "Book Stores",
        "Book Publishing",
        "Publishing"
    ],
    "response": [
        {
            "author_info": {
                "name": "Thomas P. Buehner",
                "href": "/profile/Thomas-P-Buehner"
            },
            "answer_text": "Most books are first edition, and stay first edition, never getting a second. Why? Not enough copies of the first edition are sold. This is the typical history of a book that is sold enough to be worth a second edition: First edition, first print run. On the book’s copyright page, you see something like “8 7 6 5 4 3 2 1”. This is a relict from the olden times of Letterpress printing, lasting for around five hundred years. In your job as a printer, you created a page-to-be-printed by filling a copper frame with Movable type, i.e. individual letters made of lead, tin, and antimony. Why the reverse order of numbers? You will see in a moment.The book sells like candy. On the publisher goes and pays the printer to do a …First edition, second print run. If the printer had been told by the publisher that the book was expected to be a success, the printer stored the frames, one frame per page, in a shed. So, the pages are all set to go already. This second print run is just like the first, with only one modification: The printer takes away the last letter on the copyright page. Now it looks like “8 7 6 5 4 3 2”. So, the last number in this sequence indicates the print run. Why is it helpful to be able to differentiate between print run one and two? It might turn out that the printer’s apprentice kicked over the frame for page 23, did not mention it, and tried to recreate the page from memory. Weeks later this is found out, when readers complain about the strange text on page 23. Now at least the printer and the publisher know that the second print run of the first edition has errors on page 23, while the remaining not-yet-sold books of the first print run are fine.The book keeps selling. The frame for page 23 is corrected, and a number of print runs follow, each with an increasing number of books printed, as the publisher is comfortable ordering more books per run — they know that most will be sold. To create new hype for the book, the publisher asks a celebrity to write a foreword. This leads to the …Second edition, first print run. To save effort, the printer lets the page numbers in the old frames stay the same. The foreword’s pages are just numbered differently, in Roman numerals, like “Page I”, “Page II”, etc. This saves time and keeps the production cost down. And the print run numbering starts fresh, like “Second edition 8 7 6 5 4 3 2 1”.One day during stocktaking the publisher discovers a crate with old, never shipped first edition, first print run books. The publisher will keep a few copies for their own Hall of Fame exhibition. This is a room that people are shown when the publisher wishes to impress someone. For example a promising writer who is not sure yet which publisher would be the right one to work with. They will send a copies to other notable exhibitions, like the “Museum of (famous writer of your choice)”. Some copies will go to people the publisher wants to impress desperately. Like a world famous literary critic. Or maybe even a book seller who has excellent relations with the publisher.Will that book seller ever sell their copy? Even if they deeply despised that author, it is still a first edition book that gives you bragging rights. It is likely to go into a display cabinet.So, how are first edition books distributed? When the book just came out, like any other book, as nobody knows yet that it will be a success. When the book is successful already, the few remaining copies are usually distributed through social relationships. And which copies are the most expensive? Those printed in the second print run of the first edition. Misprints are rare, and thus (comparatively) precious. A late gratification for the former printer’s apprentice, now the respected owner of a print shop. With a story to tell, how they created the most valuable edition of a book everyone has heard of. ",
            "date": "Answered September 3, 2020",
            "views": "49",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Mary Krupka",
                "href": "/profile/Mary-Krupka"
            },
            "answer_text": "Any bookstore that orders from that publisher. It just means the original print run ol a given book. For a well established author with a track record of good sales,the original print run of their latest book might be in the tens of thousands. For a new author the publisher might only print a few thousand. If new guy has a big hit the second printing will be many more. If that author goes on to fame and fortune with subsequent books the lucky people who bought the first edition of the first book may be in clover. As are the lucky people who bought the first run of Harry Potter when no one had heard of J.K.Rowling. If new guy flopped,and the next book does no better the publisher will drop him and a first edition is worthless ",
            "date": "Answered September 3, 2020",
            "views": "62",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Terah B",
                    "user_href": "/profile/Terah-B"
                }
            ]
        },
        {
            "author_info": {
                "name": "Brad Ferguson",
                "href": "/profile/Brad-Ferguson-4"
            },
            "answer_text": "“How are first-edition books distributed? What stores get first edition books to sell to the public?” This question is oddly worded. All books are first edition, at least, until such time as a second edition is produced, which often never happens. Is it possible the question is confusing the term “first edition” with something else? ",
            "date": "Answered September 3, 2020",
            "views": "28",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Joe Biel",
                "href": "/profile/Joe-Biel"
            },
            "answer_text": "Any store that will take them. You are inversing supply and demand here. The publisher wants the book to be made available to as many readers as possible, not to manufacture collector’s items. ",
            "date": "Answered September 3, 2020",
            "views": "48",
            "upvotes": "0"
        }
    ]
}