{
    "title": "How to know who you really are - Quora",
    "tags": [
        "Self-Awareness",
        "Psychology of Everyday Life",
        "Philosophy of Everyday Life",
        "Life and Living"
    ],
    "response": [
        {
            "author_info": {
                "name": "Mike King",
                "href": "/profile/Mike-King-51"
            },
            "answer_text": "You have asked a very good question and I’ll give you the best shot I have because you deserve it. We are defined by our values and how we put them to use in our day to day lives, no matter what our present calling in life, those same values that define us now will define us in the future. What are those values to hold onto and cherish both now and for all time?  Your parents taught you to be honest and not to steal another’s property, which means you always give good weight.  All your transactions in life must be judged on a scale that is calibrated to not be off, even by a fraction of a gram. Treat your loved ones as though they are precious cargo, especially parents who sacrifice more than you’ll ever know, and love you unconditionally. Be a good friend who is there through thick and thin and who doesn’t question but follows through because that’s what friends do. Whether you get your values from a source such as the Ten Commandments, or you don’t believe in any higher power at all, be true to your beliefs and have answers when you are questioned about them. Follow your heart, whether it’s your life’s work or your life’s love. You only get one chance to come around and you won’t be coming round again. Never let mistakes or a single failure or more cause you to stumble and fall.  Get back up and continue with your plan.  Always remember who you are, unique, different in many ways, standing like an oak tree, ready to hold your loved ones and your friends close and for all time. Thanks for the request. ",
            "date": "Answered August 12, 2016",
            "views": "332",
            "upvotes": " View 3 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Vidurshi Majithia",
                    "user_href": "/profile/Vidurshi-Majithia"
                },
                {
                    "user_id": "Meheret Girma",
                    "user_href": "/profile/Meheret-Girma"
                },
                {
                    "user_id": "Bart Scantlin",
                    "user_href": "/profile/Bart-Scantlin-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Sidharth Choudhury",
                "href": "/profile/Sidharth-Choudhury"
            },
            "answer_text": "Everyone in this world fall into 3 categories. The Winner, The Quitter and The Champion. Now how to analyze yourself? Let's take a short story to understand that. There's a boy down the lane named Robert. Robert is an excellent, well-behaved,smart ass who has dreams to fulfill and goals to achieve. Let's suppose he wants to be a writer. So he sets a goal, works day and night, writes a damn awesome book which gets popularity and praises from every corner of the world. He wrote so well that he got publishers right after he finished his project. His debut novel got fame and his talent never got rejected by any of the publishers. Which category does Robert falls in? Second case. Robert dreams of becoming a world renowned writer. But all he did was dream. He tried writing something. Something which couldn't attract the publisher's attention and eventually got booed off. He gave up on his dream. Started working 9-5.got married and settled off thinking he did what he could and that was it. Maybe he wasn't choosen to be a writer. Which category does this Robert fall into? Third case. Well let's make this quick. Robert writes something that gets rejected.Modified his story but unfortunately got rejected again. So many rejections but he still choose to hone his writing skills and had decided not to give up. What happened next? His will and hard work finally showed up and his debut novel which was nothing till now was on everyone's reading list. Which category does this Robert fall into!? Well I guess you would have categorized them by now and if not then let me tell you. Robert 1 falls into the winners category. Robert 2 falls into the quitters category. Robert 3 straight away moon-walks into the third category. It's only when you have undergone some of the worst situations of life you actually know who you really are. You either give up and go along the flow or you grind again and fight against all the odds. That's when you really get to know yourself.By the way, the champion is more respected than a winner and champ is the one who knows the real taste of winning. Cheers!! ",
            "date": "Answered May 17, 2017",
            "views": "11",
            "upvotes": " View 16 Upvoters",
            "upvoters": [
                {
                    "user_id": "Ikem Obidiaso",
                    "user_href": "/profile/Ikem-Obidiaso"
                },
                {
                    "user_id": "Sekhar",
                    "user_href": "/profile/Sekhar-159"
                },
                {
                    "user_id": "Surya Narayan",
                    "user_href": "/profile/Surya-Narayan-95"
                },
                {
                    "user_id": "Arpana Singh Thakur",
                    "user_href": "/profile/Arpana-Singh-Thakur"
                },
                {
                    "user_id": "Viswanathan K M (விஸ்வநாதன் க ம)",
                    "user_href": "/profile/Viswanathan-K-M-விஸ்வநாதன்-க-ம"
                },
                {
                    "user_id": "Rohan Seth",
                    "user_href": "/profile/Rohan-Seth-11"
                },
                {
                    "user_id": "Siddarth Srinivas",
                    "user_href": "/profile/Siddarth-Srinivas-1"
                },
                {
                    "user_id": "Archisman Kar",
                    "user_href": "/profile/Archisman-Kar"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/Papaeva"
                },
                {
                    "user_id": "Deepak Sahani",
                    "user_href": "/profile/Deepak-Sahani-15"
                }
            ]
        }
    ]
}