{
    "title": "How to convert a physical book to an ebook - Quora",
    "tags": [
        "Digital Publishing",
        "Amazon Kindle (product)",
        "eBooks",
        "How-to Question"
    ],
    "response": [
        {
            "author_info": {
                "name": "John Chapman",
                "href": "/profile/John-Chapman-103"
            },
            "answer_text": "First establish if you can legally do this: If this is for personal use only scan and create a PDF. Although PDF is a pain to use as an ebook - too much scrolling involved - it really isn’t worth the effort to do a proper job of making an epub or mobi file.If this is a book you have written and own the copyright to then you are better starting with an original word processed file.If this is an old, out of copyright book check Projem to ct Gutenberg before trying to make your own ebook. You may find it has already been converted.If non of these apply and you intend to make the book available to others then you are asking for trouble! Assuming you wish to continue I suggest these steps: Scan the bookUse an OCR program to convert the files to text. There are a number of these programs available, some free. Your scanner may include some in its software. MS Onenote, part of the MS Office suite will do this.Your OCR program will output a text file. Import this into a word processor and use its spell checking to find and fix many of the errors the OCR program will have introduced.Manually read through the file looking for errors which are not spelling mistakes. For example the errors ‘Giinthur clear’ may be shown when the actual text is ‘Günthur dear’. The ‘Giinthur’ will probably be picked up as a spelling error but ‘clear’ will not.Go through the document adding in appropriate styles in the text. For example chapter headings as heading 1 style, any italics and text separators. You may include effects such as initial drop capitals, paragraph indents, text separators and set paragraphs after a heading or text separator to not be indented. Save the file as a .doc or docx file.Import the doc/docx file into the open source program ‘calibre’Get calibre to convert the file into an EPUB3 file.Add meta data to the file. You’ll need a book description, tags, a cover image, author name etc.I would NOT suggest using InDesign to produce an EPUB file. It’s an expensive option and doesn’t seem to produce as good results. ",
            "date": "Answered May 23, 2018",
            "views": "112",
            "upvotes": " View 14 Upvoters",
            "upvoters": [
                {
                    "user_id": "Rafay Ansari",
                    "user_href": "/profile/Rafay-Ansari"
                },
                {
                    "user_id": "Mirsha Mohammed",
                    "user_href": "/profile/Mirsha-Mohammed"
                },
                {
                    "user_id": "Drake Banerjee",
                    "user_href": "/profile/Drake-Banerjee"
                },
                {
                    "user_id": "Isnaldo Enrique López Rincón",
                    "user_href": "/profile/Isnaldo-Enrique-López-Rincón"
                },
                {
                    "user_id": "Aaron Pereira",
                    "user_href": "/profile/Aaron-Pereira-7"
                },
                {
                    "user_id": "Lsl Kl",
                    "user_href": "/profile/Lsl-Kl"
                },
                {
                    "user_id": "Dipak Chauhan",
                    "user_href": "/profile/Dipak-Chauhan-93"
                },
                {
                    "user_id": "Ashish Mishra",
                    "user_href": "/profile/Ashish-Mishra-3028"
                },
                {
                    "user_id": "Emma Verma",
                    "user_href": "/profile/Emma-Verma"
                },
                {
                    "user_id": "Casey Gruman",
                    "user_href": "/profile/Casey-Gruman"
                }
            ]
        },
        {
            "author_info": {
                "name": "Dhebi Siconolfi",
                "href": "/profile/Dhebi-Siconolfi-1"
            },
            "answer_text": "First, send the book to get it scanned. There are many companies that do this, you can find them on Google. Look at reviews, and ask about character recognition rates of accuracy. You can have it done fairly cheaply, anywhere from 25 to 100 dollars. Just remember the cheaper scans may leave you with a lot of proofing and “fixing” to do later because the character recognition accuracy may not be the best. You need the scan to be in a PDF editable form. When you get the PDF from the scanning company, you will have to proofread like crazy and make corrections. Many scan systems do not recognize certain characters correctly. For example, the system may see rn as an m. Corner will become comer. That sort of thing. You will have to search the PDF for those types of errors created by the scan. After you have proofed the PDF, you will have to format the text and create the proper file that is appropriate for the vendor. Kindle will need a mobi file, all others take epubs. You can also take an epub and convert it to a mobi. Although it may appear that your book looks perfectly fine in the PDF form, it is very often NOT fine. You cannot simply convert that to an epub and have it come out the way you like it. It’s because formatting/coding that you cannot see is operating in the background and it will make spaces where you don’t want them, and other weird things. If you get frustrated and your book does not look nice, there are many professionals who will format an ebook for you from that corrected PDF. They will do both mobi and epubs, and it will cost you approximately 300 to 500 dollars depending upon page count, number of images, etc. It’s worth it! Good luck! ",
            "date": "Answered June 1, 2016",
            "views": "59",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Bhishm Sharma",
                    "user_href": "/profile/भीष्म-शर्मा-Bhishm-Sharma"
                }
            ]
        }
    ]
}