{
    "title": "How long is the average audiobook? - Quora",
    "tags": [],
    "response": [
        {
            "author_info": {
                "name": "Simon Taylor",
                "href": "/profile/Simon-Taylor-1"
            },
            "answer_text": "The average length of novels varies between 75,000 and 120,000 words. It varies a bit by genre. Since the average audio book narrator averages 150 words per minute this therefore equates to the average audiobook being between 8 and 13 hours. In the past when you used to buy audiobooks on tape shorter, abridged novels would sell more because the price point was lower. Since Audible there’s been a reversal to this trend. Because most audiobooks are bought on Audible using Credits it means that people tend to err towards longer books equating the length as a sign of quality and therefore getting more bang for their buck. As a result the longer books sell better so the perceived average length has crept up. ",
            "date": "Answered November 21, 2017",
            "views": "85",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Robert Cathcart",
                    "user_href": "/profile/Robert-Cathcart-7"
                },
                {
                    "user_id": "Tukos",
                    "user_href": "/profile/Tukos"
                }
            ]
        },
        {
            "author_info": {
                "name": "Nicola Alter",
                "href": "/profile/Nicola-Alter"
            },
            "answer_text": "The shortest audiobook I've ever listened to so far is The Hitchhiker’s Guide to the Galaxy at 5hrs 51mins, and the longest is The Passage at 36hrs 52mins (though of course there are longer and shorter books out there - as was already mentioned, Ken Follett ones can be very long). However, most books I read are between 8 hours and 26 hours long, with a lot falling in the 11–13 hour range. If I averaged out the lengths of all the books I've listened to it'd come to around 16hrs per audiobook. ",
            "date": "Answered March 18, 2017",
            "views": "59",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Peeyush Verma",
                    "user_href": "/profile/Peeyush-Verma-22"
                },
                {
                    "user_id": "Matthew Gordon",
                    "user_href": "/profile/Matthew-Gordon-7"
                }
            ]
        }
    ]
}