{
    "title": "How to lose weight fast without going to the gym - Quora",
    "tags": [
        "Weight Loss Techniques",
        "Body Weight",
        "Weight Loss"
    ],
    "response": [
        {
            "author_info": {
                "name": "Juan Sarmiento",
                "href": "/profile/Juan-Sarmiento-33"
            },
            "answer_text": "Believe it or not, exercise is not an effective way of losing weight. Obesity is not the result of lack of exercise, rather, lack of exercise is the result of our body’s attempt to conserve energy, because of the energy storage hormone, insulin. Obesity and Diabetes are caused by hyperinsulinemia, which is turn is the result of a high carb diet on one side, and our inability to use our own body fat for energy. We have excessively stored energy for times of scarcity. This mechanism made our species survive in primitive eras, but now we have infinite sources of carbohidrates. We simply have not trained our bodies for scarcity, let alone how to use all, practically infinite, energy we have accumulated in our bodies. We are told by our doctors to reduce our caloric intake and increase our exercise, but our bodies simply do not understand this approach. We have adapted our bodies to obtain all our energy from our food, and to store the excess in our body fat. When we reduce our caloric intake, our insulin tries to conserve energy, the way it has always done. Since there is not much energy to save in this paradigm, our bodies through insulin, to conserve the energy usage. We become slow and easily tired, which limits our ability to exercise. So what is the solution? The Metabolic Switch. Ten years ago, I was obese and could not do a whole lot more than a 45 min walk without getting exhausted. My body simply could not do anymore, regardless of my determination. Conventional wisdom from the medical community was to eat a low-fat diet to avoid heart disease. Our bodies compensated for this low supply of energy from fat by increasing our carbohidrate intake. Carbohidrates kept our insulin high and led to obesity and diabetes. Then in an interview of General Stanley McChrystal, I learned that he ate one meal a day, that he jogged for 7 miles every day, and that he was only 2 years older than me. I was 53 years old and without a hope to ever stop gaining weight through the years. This is why, I started my own One-Meal-A-Day regimen, without even known if it would work of the scientific basis of it. Today, I am 64 years old, I am in the best shape of my life and in perfect health. I have posted a series of pictures of myself through the years in a short instagram video here (Login • Instagram). I am veterinarian with a PhD in Pathology, and have a career in science. So I started to look for an explanation for my change. Only recently (last 3 years), I have learned about the Metabolic Switch, and began to understand the changes my body had undergone. I never dreamed in my wildest dreams that I would reduce my body weight and gain muscle like never before, not evey in my teens or twenties. Then I began to learn about the many benefits of intermittent fasting, and OMAD in particular. I have been eating only OMAD for these many years, and intend to keep it going for the rest of my life. Among the benefits is the secretion of growth hormone and autofagy, as well as the use of my own body fat for energy. The use of body fat as a source of energy in the form of Ketones, have increased my fisical performance, at an age when people retire and settle into a couch-based existance. Even my wife, diagnosed with diabetes, transformed her life and with OMAD was able to revers the disease. Using ketones for energy on one side, renewing your mitochondria every day through autophagy on the other, and facilitating muscle anabolism by increasing growth hormone, I am a new, more muscular and fit man, at age 64, compared to any other time in my life. Here are some videos that show the science that explain my tranformation and how anyone can change their life too:     ",
            "date": "Answered October 17, 2020",
            "views": "151",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Paisley Smith",
                    "user_href": "/profile/Paisley-Smith-25"
                }
            ]
        },
        {
            "author_info": {
                "name": "Isaac Pruitt",
                "href": "/profile/Isaac-Pruitt-3"
            },
            "answer_text": "Lose weight quickly without going to the gym. Just follow the right slimming tips First tip to follow: drink water. Lots of water to remove. Fruit juices and other sodas are forgotten. These contain on average a hundred calories per glass. Without realizing it, we can easily gain weight or retain water if we abuse sugary drinks; while drinking a lot of water (pure and still) eliminates the excess water. And rest assured: even if it may seem paradoxical, drinking water can overcome water retention and say goodbye to bloating and other swollen legs. Eat less often than usual No mystery. If you want to lose weight quickly, you should not snack. Stick to three meals a day, breakfast, lunch and dinner. And if you feel the craving coming, also have a snack to last until the evening meal. Eat in a calm environment Sit down to the table, and leave aside your smartphone, TV or laptop! Because it is proven: when we eat while being distracted, we eat a lot more! More details on how to lose weight fast without going to the gym ",
            "date": "Answered October 18, 2020",
            "views": "73",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Mark Hurley",
                "href": "/profile/Mark-Hurley-41"
            },
            "answer_text": "Exercise increases the efficiency of the organ system. Consider the organ system like an engine running the car. We feed it with fuel (micronutrients, enzymes, co-factors, antioxidants, etc). In the process, we assimilate this fuel as energy that is distributed to many activities and responsibilities that we take on each day. If the organ system works efficiently, the fuel with be assimilated well for nourishment, growth, metabolism, energy, detoxification, etc. So, you can burn fat without exercise depending on the current status of the body. There is a strong relationship between liver health, brain function, and metabolism (fat-burning potential). The liver not only cleanses the blood to reduce inflammation, but it assist with nutrient uptake and assimilation. If the liver is stagnant, metabolism will inevitably suffer. Since the liver assists and works in synergy with all other organs, it follows that optimizing liver function will ease the burden throughout the body. To optimize liver function, start consuming more bitters such as dandalion, burdock root, etc. These help regulate and reduce the viscosity of bile via the gallbladder. Bile is essential for detoxification and fat assimilation. Fat is the precursor to cholesterol production (via the liver), which is a precursor to hormones such as estrogen and testosterone. These vital hormones play a crucial role in metabolism. A healthy balance of estrogen, testosterone , and growth hormones dictate the fat burning potential within the body. The adrenal glands help control the resistance to stress. Healthy adrenal gland function helps maintain growth hormone and dhea production - two hormones needed for lean muscle mass and energy. Consuming copious amounts of b-vitamins and limiting caffeine intake can help restore balance within the adrenal gland axis. Ashwagandha (Indian Ginseng) is a well-known and extensively studied herb that helps the organ system build or restore balance. Putting this all together…If you listen to your body and eat only when hungry, it will conserve more energy to deal with other processes. Digestion can be a huge burden on the organ system when food is consumed too frequently. Therefore, fasting or taking a break once in a while can be very beneficial. Note that fasting for too long will cause the body to revert to starvation mode, which dampens the metabolism in the process to conserve energy or fat reserves. Drinking lemon water, detoxing the liver, eating a balanced and varied diet, maintaining a positive outlook, obtaining enough sunlight, and listening to the body will yield a positive outcome in terms of losing weight. It can definitely take some time for the body to slowly heal and work towards a more optimized state, so be patient and enjoy the process. ",
            "date": "Answered October 16, 2020",
            "views": "141",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Shweta Khedkar",
                "href": "/profile/Shweta-Khedkar-5"
            },
            "answer_text": "Weight loss is simple. Calorie in vs calorie out. You will have to walk for an hour at least or do some sort of exercise to burn calories. On the other end, eat in smaller proportion than what you eat currently. Substitute your snacks with fruits and nuts, kefir, etc. Drink 3 to 4 liters of water daily. Have your multivitamins regularly. That will reduce fats, sugars and carbs from your diet. Make sure to eat 15–20 gms of proteins minimum assuming you are an adult. This protein had to be lean protein and not processed protein. Eat healthy , move around, work out , don't have a sedentary life style. Do all these for few months religiously. You will see the difference. ",
            "date": "Answered October 16, 2020",
            "views": "102",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Eric Desjardins",
                "href": "/profile/Eric-Desjardins-13"
            },
            "answer_text": "I do three things besides going to the gym that everyone can do. In thier own room if they have enough room or if they dont do it in the living room, I do crunches and pushups. I also upped my protien intake by eating 120 gr of protien a day. Then i went on walks every morning when k got up. Now it is getting colder i do the inside exercises and eat more protien. Also i watch chris heria on youtube and learn from him to do exercises for calisthenics. I try to do those 2x a week. I do stretch before i workout so i dont tear a muscle like i have in the past. Muscles dont heal quickly. So i am careful and do it correctly if i do an exercise. This is what i personally do and have gone from 235 to 195 in 8 months. I do intermittent fasting but not very much as it does not fit in my life very well. This is my personal weightloss tricks i am using. ",
            "date": "Answered October 19, 2020",
            "views": "114",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Efrayim Bulka",
                    "user_href": "/profile/Efrayim-Bulka-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Brity Carson",
                "href": "/profile/Brity-Carson"
            },
            "answer_text": "Slow and steady wins the race. If you want to maintain this weight loss for years to come. If you dont want to go to the gym start tracking your calories to see how much you are eating in a day. If you eat let's say 3,000 calories a day and you arent active you should subtract 500 from that. If you eat 1400 calories add 500 calories. Eating too less and too much can make you gain weight. So dont deprive or starve yourself you would lose weight that way. Also you have to keep in mind what types of food you are eating. You have to eat healthy calories like veggies, lean meats, fruit, and healthy fats. And take your vitamins if you are deficient. Stay away from fast food. Try to cook all of your meals. If you have a hard time cooking everyday try to prep your meals for the week. Cooking at home will save you money as well. ",
            "date": "Answered October 22, 2020",
            "views": "85",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Nick Smith",
                "href": "/profile/Nick-Smith-1901"
            },
            "answer_text": "RUN. It’s that simple. You can get decent running shoes for $30 on Amazon if you don’t have some. Put in your headphones and go run as long as you can. Find a local greenway, track, or trail. You’ll feel absolutely amazing after your first run. Get up and do it again tomorrow. Run 4–5 days a week. Try and go faster and farther each time. Clean up your diet and do this for a couple weeks. If you stick with it everyday and keep pushing yourself you will shed the weight. I did it. Many of my fiends did it. Good luck and have fun! ",
            "date": "Answered October 16, 2020",
            "views": "79",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Efrayim Bulka",
                    "user_href": "/profile/Efrayim-Bulka-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Dajana Ramirez Andrade",
                "href": "/profile/Dajana-Ramirez-Andrade"
            },
            "answer_text": "I haven’t tried this diet but people who tried it they said that they were amazing results: Important 1. Keep the cup covered throughout the procedure. 2. Hand out copies of this diet according to the pounds you want to lose. 3. Start the diet on Wednesday not before all copies have been distributed. 4. You can distribute the diet to anyone. 5. Don't go on a diet even if it's amazing, IT WORKS. Note: If you do it as indicated, you respect everything and do not put 70 grains of rice but 5 or 7, a logical number, from already in a month depending on the organism, you lose those kilos without even realizing it. But keep in mind to have \" FAITH\". ",
            "date": "Answered October 20, 2020",
            "views": "33",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Efrayim Bulka",
                    "user_href": "/profile/Efrayim-Bulka-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Tilman Fliegel",
                "href": "/profile/Tilman-Fliegel"
            },
            "answer_text": "By eating less. Excercise or beeing generally active (not sitting all day) is certainly more healthy, but doesn’t directly do too much for weight loss, especially if you think you can eat more because you exercised.In my own experience, once your obese exercise is not fun. Much better to lose some weight first by monitoring your calories and start exercising when it becomes fun. ",
            "date": "Answered October 23, 2020",
            "views": "68",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Efrayim Bulka",
                    "user_href": "/profile/Efrayim-Bulka-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Captain Stay Healty",
                "href": "/profile/Captain-Stay-Healty"
            },
            "answer_text": "Apart from loosing weight through Excercise, you can also lose weight through natural supplement… One of the Product I recommend due to USAGE is PROVEN… A natural supplement that can help our lose weight… Click on the link below to get a Reviews of the Product… PROVEN REVIEWS ",
            "date": "Answered October 17, 2020",
            "views": "32",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Smit More",
                    "user_href": "/profile/Smit-More-2"
                }
            ]
        },
        {
            "author_info": {
                "name": "Dale Grillot",
                "href": "/profile/Dale-Grillot"
            },
            "answer_text": "90% of weight loss is diet. The best diet for loosing weight is Low Carbohydrate. It is carbs that are converted into fat, and to unlock them, you have to stop eating them. The Current Atkins book is written by carbohydrate experts. ",
            "date": "Answered October 16, 2020",
            "views": "63",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Efrayim Bulka",
                    "user_href": "/profile/Efrayim-Bulka-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Nishchal Shrivastava",
                "href": "/profile/Nishchal-Shrivastava-3"
            },
            "answer_text": "Weight loss is not Gym dependant, but Calorie intake & Burnt… gives results.Lot of exercises can be substituted for Gym, which can be selected as per your requirements.But ensure Calories are tracked, analysed on regular basis. ",
            "date": "Answered October 18, 2020",
            "views": "40",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Efrayim Bulka",
                    "user_href": "/profile/Efrayim-Bulka-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Smart World",
                "href": "/profile/Smart-World-71"
            },
            "answer_text": "no need to gym but lite exercise should be include in your daily plan, away from junks food and sugar, and i recommend you Qalbi Jadeed , is the best product for fast weight loss, and ",
            "date": "Answered October 17, 2020",
            "views": "50",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Miller Amanda",
                "href": "/profile/Miller-Amanda-4"
            },
            "answer_text": "How about walking after meals everyday? It’s easier than sport at gym. Also, you should avoid to eat some fast food like KFC and Mcdonald’s. ",
            "date": "Answered October 18, 2020",
            "views": "39",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Ragnar Belial",
                "href": "/profile/Ragnar-Belial"
            },
            "answer_text": "Fast? By surgery. You don’t need the gym to lose weight, you need to maintain a calorie deficit diet. ",
            "date": "Answered October 22, 2020",
            "views": "11",
            "upvotes": "0"
        }
    ]
}