{
    "title": "How closely is the Japan in the anime world related to the real Japan? - Quora",
    "tags": [
        "Culture of Japan",
        "Animation",
        "Japan"
    ],
    "response": [
        {
            "author_info": {
                "name": "Rahul Venugopal",
                "href": "/profile/Rahul-Venugopal-10"
            },
            "answer_text": "I would say it totally depends on what anime you are watching… Obviously shounen anime is a very poor example of Japanese culture. It shows over the top stuff, and is meant for purely entertainment purposes. But having said that, there are many slice of life anime, which show interactions between normal human beings. Those might give a look into japanese culture. But it is also not 100% accurate, as TV tropes are always there that exist to give viewers a sense of familiarity and entertainment value. Some stuff that does come out about japanese culture is how they use honorifics while speaking, how respect is given to peers and elders, how they have a system of personal Honor, and the reserved nature of their culture. I would say that don't consider anime culture to be a reflection of life in Japan. Culture in Japan is a bit more stricter than shown in anime. But at the end of the day all fiction is based on truth, and Anime is a great place to start learning about japanese culture. ",
            "date": "Answered October 10, 2017",
            "views": "221",
            "upvotes": " View 4 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Vishwesh Kumar",
                    "user_href": "/profile/Vishwesh-Kumar-1"
                },
                {
                    "user_id": "Aatish Kamble",
                    "user_href": "/profile/Aatish-Kamble"
                },
                {
                    "user_id": "Pratik Dash",
                    "user_href": "/profile/Pratik-Dash"
                },
                {
                    "user_id": "Mohanish Tikekar",
                    "user_href": "/profile/Mohanish-Tikekar"
                }
            ]
        },
        {
            "author_info": {
                "name": "Torres Jack",
                "href": "/profile/Torres-Jack"
            },
            "answer_text": "Well never think japan lifestyle or daily life is just like anime!! Well if you see Anime like shounen , it’s absoluty wrong to compare it to real life! Anime shows exaggeration of happy life, enjoying club activities, students being perfect or best in some part! Well this all is obvious but just to make clear. In real life Japan , people are little conservative at first rather than being so open like anime!Japan is full of culture and busy life too depending on city you live in whereas anime doesn’t show this!Student life is almost same ass that of some anime but not soo good. They have to work real hard like us to get admission in good colleges and universities!Life is a Japanese student and adult is much more busy and hardworking than shown in anime!But for me life there is amazing because i understand the ups and downs ,good and bad and basic things plus i love the culture too! If you love anime life of Japan , i am sure you will love real life too there but with hard work and little maturity! And Anime girls are not like in real life so i hope i didn’t disappoint you ",
            "date": "Answered October 10, 2017",
            "views": "146",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Mohanish Tikekar",
                    "user_href": "/profile/Mohanish-Tikekar"
                }
            ]
        }
    ]
}