{
    "title": "How much of the Aeneid story is by Virgil? - Quora",
    "tags": [
        "Virgil",
        "Aeneid",
        "Classics",
        "Mythology",
        "Writers and Authors"
    ],
    "response": [
        {
            "author_info": {
                "name": "Steve Theodore",
                "href": "/profile/Steve-Theodore"
            },
            "answer_text": "The one sentence answer is 'we don't know.'  The Aeneid is a big book, packed with lots of real or imagined historical assertions and we can't usually be sure about either how 'accurate' they were or where they came from.  That said, though, there are several layers of background that can give some idea where the different strands in the poem might come from. Italy and Troy The tradition linking the Trojan War and Italy predates Vergil by several hundred years. In antiquity it was a common (though not universal ) view that the Etruscans were Tyrrhenians : a group that may have come from the eastern Mediterranean. This is sometimes cited as evidence for a historical reality underlying the story of Aeneas. We know that Greek cities in southern Italy had extensive trade contacts with early Latium and the Etruscans, so if there's some truth to the Tyrrhenian identification it's no big stretch to see the Greeks morphing \"our ancestors came from the East\" into \"your ancestors must be the people we call Trojans\" Once that link is made it becomes an easy fulcrum for trade and diplomacy so it tends to be reinforced over time.  Everybody who was in contact with the Greek world ended up getting pulled into the Greek myth-making machinery : Gauls, Carthaginians and Egyptians as well as Romans ended up with mythological tie-ins. The historicity of the connections is often impossible for us to disentangle because, once accepted, different national traditions started to flow together. For example it's highly likely that the association of Hercules and the western Mediterranean (the 'Pillars of Hercules' , his visit to the Atlas mountains) in Greek myth is really a borrowing from Phoenician stories about Melqart.  The process was almost compulsive, but not just random: finding mythological parallels and then expanding on them was just how they tried to understand foreign cultures.   So, there was a lively conversation linking 'Italy' in general and the Etruscans in particular with the Trojan war well before Vergil. For example, here's an Etruscan tomb painting from the 4th c. BC depicting Achilles sacrificing Trojan prisoners: note the very Etruscan winged angels and Charun  (blue, with his stunning hammer) center, in this otherwise Greek scene.  and a vase from the 6th century, roughly the same time as the foundation of the Republic, depicting Paris choosing between Athena, Aphrodite and Hera:  Of course if you do accept a real Trojan connection Virgil is still transferring it from the Etruscans to the Romans.  On the other hand it's not hard to see how that could happen, since the Etruscans dominated early, pre-Republican Rome.  It's also possible, in fact likely, that the Trojan story was synthesized to help the Etruscans deal with the Greeks and the took on a life of its own as the Etruscans were eclipsed by the Romans.  In general the vaguely recorded generations in between Aeneas and the founding of Rome proper (by Romulus and Remus, 14 generations after the events of the Aeneid) act as a kind of buffer zone between the somewhat theoretical, heavily Greek influenced mythological background of the Trojan story and the much more local, purely Italian stories unique to Rome.   Italy and Carthage Carthage also figures very largely in the background of the Aeneid.  Again, there's a long pre-history to the association of Rome and Carthage that Virgil drew on. As the most important naval power in the western Mediterranean  the Carthaginians were familiar to everyone.   A very Hellenized Tanit from North Africa The most important goddess in Carthage was Tanit.  More familiar to mythology students under her east-mediterranean name Astarte,  Tanit was a regal  presence (In Roman North Africa she was 'Juno Caelestis' : the same identification with Juno  (Homer's Hera) that Virgil made.  Although most Greek writers identified Astarte/Tanit with Aphrodite (focusing on her role as a goddess of sex) the Carthaginian Tanit was emphasized the regal, dangerous and somewhat vindictive nature of the Astarte stories: a good match for Hera in the Iliad and a perfect foil for Virgil who needed a relentless, operatic villain to persecute his hero.    The Pyrgi tablets, in Etruscan and Punic  Interestingly, the Juno-Tanit identification predates the Roman Republic too. The Etruscan/Punic Pyrgi Tablets, dating from right around the time when Rome drove out the kings, show the Etruscan magistrate Thefarias Velianas (= \"Tiberius Velianus\")  making an offering to 'Uni-Astre' (the punic text gives 'Astoreth') . Since Many scholars derive Latin Juno from Etruscan Uni, that suggests that  Carthaginian cultural influence was significant in the 6th C BC and may have shaped more than a few Italian  traditions -- and perhaps that Virgil will have had first-hand access to second-hand or Italianized Carthaginian lore.*   Virgil could very well have visited Juno's chariot, taken from Carthage at  the end of the  Punic wars.** Greek tradition With all that said, the biggest influence on Vergil was the Greek literary tradition.  The Aeneid is a very self-conscious effort to provide Rome with a national epic to set alongside the Iliad and the Odyssey: a bit of literary nationalism.  Virgil, in a very Roman toga, flanked by two Muses in modish Greek silk dresses. Vergil of course followed on three centuries of other Roman writers trying to adapt Greek literary modes to Italian needs. Latin-language literature really took off only in the mid 3rd century BC with Livius Andronicus , a Greek captive turned Roman poet who, among other things, translated the Odyssey into Latin and also staged translated Greek tragedies. A generation or two later Ennius wrote an Annales (now lost except for a few quotations) which told the story of Rome beginning with the Trojan War down to the end of the Third Punic War. Later Romans referred to Ennius and Livius as semigraeci, \"half Greeks\" which shows how much they operated in a foreign mode.  Ennius, ca 200 BC  The Greek literary scene of Vergil's day was dominated by Alexandria, a  scholarly and rather pedantic culture which prized attention to detail and mastery of obscure references. Not a few of the cameos and asides in Vergil are clearly shout-outs,  highlighting particularly obscure bits of Homeric lore or Greek erudition to demonstrate the poet's mastery of the classical tradition.    Vergil ransacked not only Homer but also Apollonius of Rhodes.  Apollonius updated the old Greek epics in two ways: first, he humanized his characters, providing interior monologues and emphasizing their inner states. Second, he made an effort to set his adventures in recognizable locales, tied in to various local origin-stories (\"aitia\" )  around the Greek world from the Black Sea to Marseille.  Vergil clearly used the same technique both to tie the Latin world into the mythological fabric of the Greek world... but also to weave his own literary prestige into the dominant mode in Greek writing. So... It is, like I said, very hard to say in general 'where the Aeneid comes from'.  It was a melange of real history (possible links between Etruria and Asia Minor) and cultural borrowings (old contacts between Carthage and Italy) all filtered through Roman Latin oral tradition and then topped off with a thick layer of imported Greek styles and interests.   There's not just one stream here, there are many and they are full of echoes and mirror images: not great for historians but providing an artist like Virgil with many similar-but-different narratives to choose from. Book I of Dionysius of Halicarnassus' Roman Antiquities gives a good idea of the 'state of the art' view of early Italian history around the time Virgil wrote -- it's full of interesting speculations,  mythological mish-mashes and general confusion. I would bet -- though its hard to prove -- that a lot of the more obscure or inexplicable material actually did hark back to \"authentic\" (not the same thing as \"true!\")  local Latin legends. The Alexandrian aesthetic that drove so many Latin writers put a high premium on the collection of obscure facts and local oddities.  Of course those traditions themselves are also a mishmash of oral storytelling, poorly understood legends and probably more than a few frauds and inventions too*** -- but that's a whole separate question: Virgil obviously had access to a lot of material lost to us and he was working in a mode where showing off your knowledge was considered a key piece of literary flair.  The Aeneid is less 'historical' than the Iliad, because it's a much more self conscious piece of literary artifice.  But it probably preserves a lot of little snippets of interesting, otherwise silent Italian lore. * the Wiki page linked above for Juno just scratches the surface of all the different aspects Juno wore in Italy.  Even by the loose theological standards of Greco-Roman polytheism, the traditions surrounding her were complex, contradictory and hard to unravel.  But she was clearly a bigger force in Italy than in Greece. ** Macrobius 3.9   includes what's supposed to be the ritual which 'evoked' or 'called out' the guardian deities of Carthage *** Ovids' Fasti give a good example of the kind of myth-busting (or at least, myth-cataloguing) that was high Alexandrian style. ",
            "date": "Answered December 28, 2015",
            "views": "17",
            "upvotes": " View 32 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Kenneth VanDewark",
                    "user_href": "/profile/Kenneth-VanDewark"
                },
                {
                    "user_id": "Anand Venigalla",
                    "user_href": "/profile/Anand-Venigalla"
                },
                {
                    "user_id": "Chris Bahr",
                    "user_href": "/profile/Chris-Bahr"
                },
                {
                    "user_id": "Spencer Alexander McDaniel",
                    "user_href": "/profile/Spencer-Alexander-McDaniel"
                },
                {
                    "user_id": "Francisco Manuel Bernal",
                    "user_href": "/profile/Francisco-Manuel-Bernal"
                },
                {
                    "user_id": "Ishaan H. Jajodia",
                    "user_href": "/profile/Ishaan-H-Jajodia"
                },
                {
                    "user_id": "Edward Conway",
                    "user_href": "/profile/Edward-Conway"
                },
                {
                    "user_id": "Saara Katyal",
                    "user_href": "/profile/Saara-Katyal"
                },
                {
                    "user_id": "Gilles Peret",
                    "user_href": "/profile/Gilles-Peret"
                },
                {
                    "user_id": "Shashank Das",
                    "user_href": "/profile/Shashank-Das"
                }
            ]
        }
    ]
}