{
    "title": "How to get my 8-year-old to read more - Quora",
    "tags": [
        "Child Development",
        "Reading",
        "Children"
    ],
    "response": [
        {
            "author_info": {
                "name": "Masayo Hanyuda",
                "href": "/profile/Masayo-Hanyuda"
            },
            "answer_text": "Do not force any child but teach them by yourself to study with your own child and have them interested in it. It may take time but the way you proceed with your own children may have a lot of reason that the child won’t even do what they need to do. Do you remember when you were 8 years old and how it was? Kids are like yourself when you were a child. You may use good strategies to help your kids to learn well. However, I would talk to my kids about the benefits out of learning about many things in life and the shooling is one of remedy to develop how to learn, study, and be ready for their future life. I truly believe in every parent to get to know your own children what they are thinking and feeling about everything in life. It is an important part of being a parent. Many parents think they know their own children but not. IT is the downfall that when kids grow up to be a teenager, they too, think they know everything but not. This is the reason I emphasize “Education Starts at Home.” ",
            "date": "Answered October 13, 2020",
            "views": "128",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Klarissa Bautista",
                    "user_href": "/profile/Klarissa-Bautista-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Natalie Jones",
                "href": "/profile/Natalie-Jones-685"
            },
            "answer_text": "Try to center the reading around their personal interests: For example if he/she likes animals, get both fictional and non-fiction books about animals at their reading level (you can ask a librarian for help if needed with that), and play up the titles, pictures, and maybe read the first page, to wet their appetite. If he or she likes an animated Disney character, get books related to that movie or cartoon. It is also a proven fact that if you read expressively and dramatically to children on a regular basis, they will be more likely to enjoy reading themselves. Another idea is to make reading fun and practical - read cereal boxes, children’s magazines, billboards, and any text that is within sight of the child. Label things in the house such as table, chairs, toys, cabinet, desk, bed, etc., and have the child read the labels. One thing that worked for me as a reading tutor, is that I explained to my student that they would be able to succeed in life more if they learned to read more. (Specifically, I told him he could learn more about video games by reading the secret manuals giving secret codes and help to winning the video game, so if your child is interested in sports, you could say that they could learn more about their sport of choice if they knew how to read, and could improve their game ; ) ",
            "date": "Answered October 17, 2020",
            "views": "66",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Roksana Parvin Yasmin",
                    "user_href": "/profile/Roksana-Parvin-Yasmin"
                }
            ]
        },
        {
            "author_info": {
                "name": "Kimberly Desker",
                "href": "/profile/Kimberly-Desker"
            },
            "answer_text": "Read to them! Read with them! We always do what interests us the most, and every 8-year-old wants more time with their parents, what better way to do so than with books! It honestly doesn’t matter what topic it is. It doesn't even have to be from books. Here are some other reading materials you can use or create; handwritten letters to each otherA foreign movie’s subtitlesComic BooksYou don’t even need to tell your child the importance of reading. You could say, “Baby, I read this really interesting story about an alien who flew past the moon on a bicycle! I’m so excited to find out what happens next…” Then read together. When I was young, I didn’t read because it was important. I read because it filled my world with magic and wonder. You want to excite and entice. ",
            "date": "Answered October 19, 2020",
            "views": "80",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "N. Sathyanarayan",
                    "user_href": "/profile/N-Sathyanarayan"
                }
            ]
        },
        {
            "author_info": {
                "name": "Sing Lim",
                "href": "/profile/Sing-Lim-5"
            },
            "answer_text": "You might want to figure out what your child may like. You also shouldn’t put any emphasis on certain books that they should be reading, whether it’s non-fiction, fiction, fantasy, or anything else. For an eight year old, you want to put reading as an option that has a lot of different things. Whether that eight year old will like it is different. I suggest you do some research on any books that they would like. Reading to them would also help. Stories are enjoyed by everyone and more exposure to it will endear them to it. ",
            "date": "Answered October 18, 2020",
            "views": "39",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Roksana Parvin Yasmin",
                    "user_href": "/profile/Roksana-Parvin-Yasmin"
                }
            ]
        },
        {
            "author_info": {
                "name": "Eva Hall",
                "href": "/profile/Eva-Hall-49"
            },
            "answer_text": "Make it a game, or a challenge. Print out a few reading challenge sheets where he/she has to write the amount of minutes they have read and write down what book he/she has read. At the end when they have completed the whole pack then give them a reward. You can do this again with different things, like only writing down titles he/she has finished. Coloring in a box when he/she has finished a book. Or even helping him/her read at night by reading one page, then having your child read the other one. And you switch back and forth. If you do any challenges though, don’t forget to reward your child! I hope this helps! ",
            "date": "Answered October 13, 2020",
            "views": "76",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Roksana Parvin Yasmin",
                    "user_href": "/profile/Roksana-Parvin-Yasmin"
                }
            ]
        },
        {
            "author_info": {
                "name": "Rachel Mitchell",
                "href": "/profile/Rachel-Mitchell-211"
            },
            "answer_text": "Read to them at night before they go to bed. Pick a chapter book that you think they might be interested in and read one chapter, or a set number of pages a night. I would recommend Percy Jackson, Beyonders, I Funny or another chapter book to get them engaged. They may decide to pick up the book on their own. Reading to them not only creates a love of reading but strengthens your bond with your child. You should be laughing and talking over whatever book you choose. ",
            "date": "Answered October 13, 2020",
            "views": "64",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Emma Sohan",
                    "user_href": "/profile/Emma-Sohan"
                },
                {
                    "user_id": "Angela Goudman",
                    "user_href": "/profile/Angela-Goudman"
                },
                {
                    "user_id": "Michael R. Worthington",
                    "user_href": "/profile/Michael-R-Worthington"
                },
                {
                    "user_id": "David Bean",
                    "user_href": "/profile/David-Bean-40"
                }
            ]
        },
        {
            "author_info": {
                "name": "Dogs Rule",
                "href": "/profile/Dogs-Rule-17"
            },
            "answer_text": "Don’t force them to read stuff that you read as a kid. My mom still does this to me and I HATE IT! Let them read whatever she wants. That will encourage her to read more. Maybe you could ask her friend’s parents what their children are reading. Try Diary of a Wimpy Kid, Tom Gates, Roald Dahl books, even some Enid Blyton. Tell me how it goes! ",
            "date": "Answered October 19, 2020",
            "views": "61",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Roksana Parvin Yasmin",
                    "user_href": "/profile/Roksana-Parvin-Yasmin"
                }
            ]
        },
        {
            "author_info": {
                "name": "David Bean",
                "href": "/profile/David-Bean-40"
            },
            "answer_text": "My parents were working all the time and didn’t have time to read to us so, the oldest son got to buy comics and then were passed down. I am a retired teacher and it is good to have you or someone to read an open book with pictures. All the time you can play games 1- What is going to happen next? 2- Have the child re-read the passage. 3- Question and answer of the characters and events. 4- What is the moral of story or what did you learn from this? Very important to see your child’s thought process. ",
            "date": "Answered October 13, 2020",
            "views": "143",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Angela Goudman",
                    "user_href": "/profile/Angela-Goudman"
                },
                {
                    "user_id": "Roksana Parvin Yasmin",
                    "user_href": "/profile/Roksana-Parvin-Yasmin"
                }
            ]
        },
        {
            "author_info": {
                "name": "Jack Torrance",
                "href": "/profile/Jack-Torrance-78"
            },
            "answer_text": "You should take them shopping and look for a book that they might like, depending on there age they would like different genres and different story’s, if your really that serious about it then if they don’t read then take something away that they enjoy, if your not that serious then they will either get into it themselves or there just not a reader. ",
            "date": "Answered October 15, 2020",
            "views": "34",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Roksana Parvin Yasmin",
                    "user_href": "/profile/Roksana-Parvin-Yasmin"
                }
            ]
        },
        {
            "author_info": {
                "name": "Naga Vaishnavi",
                "href": "/profile/Naga-Vaishnavi-8"
            },
            "answer_text": "Children are so fast in grasping things. So first of all make sure you are providing them only good content and morals in the form of books. Children are easily attracted to story books. So start their reading with story books and gradually move to books related to favorite fields. You can also get many children books for free of cost by just paying charges for handling and delivery in Mypustak website. So give them some story books first and slowly they themselves get habituated to reading.  This even worked with my uncle's children. Hope this answer helped you. ",
            "date": "Answered October 15, 2020",
            "views": "40",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Roksana Parvin Yasmin",
                    "user_href": "/profile/Roksana-Parvin-Yasmin"
                }
            ]
        },
        {
            "author_info": {
                "name": "Grace Smith",
                "href": "/profile/Grace-Smith-824"
            },
            "answer_text": "What are his interests? For example if you have a child who loves butterflies, get them books about butterflies. If you have a child who loves fantasy books with dragons and princesses, get them those books. A child will not want to read if they aren't interested ",
            "date": "Answered October 13, 2020",
            "views": "279",
            "upvotes": " View 7 Upvoters",
            "upvoters": [
                {
                    "user_id": "Carol Lee Doeden",
                    "user_href": "/profile/Carol-Lee-Doeden"
                },
                {
                    "user_id": "Maxim Sidko",
                    "user_href": "/profile/Maxim-Sidko"
                },
                {
                    "user_id": "Nancy Brilliant",
                    "user_href": "/profile/Nancy-Brilliant"
                },
                {
                    "user_id": "Arian Kobir",
                    "user_href": "/profile/Arian-Kobir-1"
                },
                {
                    "user_id": "Angela Goudman",
                    "user_href": "/profile/Angela-Goudman"
                },
                {
                    "user_id": "John Darasimi",
                    "user_href": "/profile/John-Darasimi"
                },
                {
                    "user_id": "Amir Exir",
                    "user_href": "/profile/Amir-Exir"
                }
            ]
        },
        {
            "author_info": {
                "name": "Bella Julianna Letey",
                "href": "/profile/Bella-Julianna-Letey"
            },
            "answer_text": "look, I’m 10 years old and i read teen books, and my mom taught me how to read when i was THREE. i LOVE to read. so, you should have thaught him to read sooner, or justgive him/her a better slection of books. see what kind of genre he likes, or just let him pick books in the library. ",
            "date": "Answered October 16, 2020",
            "views": "73",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Carol Lee Doeden",
                    "user_href": "/profile/Carol-Lee-Doeden"
                },
                {
                    "user_id": "Roksana Parvin Yasmin",
                    "user_href": "/profile/Roksana-Parvin-Yasmin"
                }
            ]
        },
        {
            "author_info": {
                "name": "Blair Alee",
                "href": "/profile/Blair-Alee"
            },
            "answer_text": "Have them pick out a fun chapter book about something they like. If they still don’t read more try to set goals with small rewords. It could be something like if the read for twenty minuets they got so many minuets of screen time. Or if they read so many chapters they get a small peace of candy. And the maybe if they finish their book they get a small toy. Try not to force them to read or bribe them too much. Reading should be fun! Start with small things and start giving less and less intell they read for fun! Good luck! ",
            "date": "Answered October 13, 2020",
            "views": "81",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Azelea Anderson",
                    "user_href": "/profile/Azelea-Anderson"
                },
                {
                    "user_id": "Angela Goudman",
                    "user_href": "/profile/Angela-Goudman"
                }
            ]
        },
        {
            "author_info": {
                "name": "Dianne Guthrie",
                "href": "/profile/Dianne-Guthrie-3"
            },
            "answer_text": "Try graphic novels or comics. Librarians used to frown on comics as a way of reading, but now they’ve changed their minds and think it’s a good idea and it attracts kids that don’t want to read just a book with no pictures in it. Some kids are more visual and like pictures and visualising the story. ",
            "date": "Answered October 13, 2020",
            "views": "40",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Madhu Babu",
                    "user_href": "/profile/Madhu-Babu-286"
                }
            ]
        },
        {
            "author_info": {
                "name": "Robyn Eckerman",
                "href": "/profile/Robyn-Eckerman-1"
            },
            "answer_text": "get great chapter books and read them to them. Encourage them to take turns with you. When it’s your turn make the book exciting by using voices. Ask your Children’s Librarian for book recommendations. We loved The Boxcar Children. Google the best books for 8 year olds and up pops a huge great list. ",
            "date": "Answered October 15, 2020",
            "views": "39",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Roksana Parvin Yasmin",
                    "user_href": "/profile/Roksana-Parvin-Yasmin"
                }
            ]
        },
        {
            "author_info": {
                "name": "David Newsom",
                "href": "/profile/David-Newsom-24"
            },
            "answer_text": "Do not go out and buy books that you think would be good for them to read, get books about things that they like such is dinosaurs animals certain people certain activities just anything that they like and they will read it. ",
            "date": "Answered October 13, 2020",
            "views": "43",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Angela Goudman",
                    "user_href": "/profile/Angela-Goudman"
                }
            ]
        },
        {
            "author_info": {
                "name": "Karen Wattie",
                "href": "/profile/Karen-Wattie"
            },
            "answer_text": "Read to the child. Do it every night before bed. Once children learn to love the stories that come from books they will want to read them too. A visit to a library where the child can pick out the books is also a good idea. Beware though that if you try to force the child to read that will backfire. ",
            "date": "Answered October 13, 2020",
            "views": "39",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Lindsay Staniforth",
                    "user_href": "/profile/Lindsay-Staniforth"
                }
            ]
        },
        {
            "author_info": {
                "name": "Vaishnavi Parthasarathy",
                "href": "/profile/Vaishnavi-Parthasarathy-13"
            },
            "answer_text": "When I was young, I always used to read the same books over and over again. So, my mother went online and searched for some good books, and recommended them to me. I was a bit reluctant, but I agreed to read them, and now, I can't resist books. To sum it up, you can go online, check up some lovely books such as Harry Potter, The faraway tree, etc and see if your child is interested 🙂 ",
            "date": "Answered October 14, 2020",
            "views": "44",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Carol Lee Doeden",
                    "user_href": "/profile/Carol-Lee-Doeden"
                },
                {
                    "user_id": "Roksana Parvin Yasmin",
                    "user_href": "/profile/Roksana-Parvin-Yasmin"
                }
            ]
        },
        {
            "author_info": {
                "name": "Safwan Khan",
                "href": "/profile/Safwan-Khan-5"
            },
            "answer_text": "Start reading books yourself read to them every night show them pictures in the books tell them stories make it engaging when reading your own books read it loud to them try this fro a few weeks and they will start enjoying it ",
            "date": "Answered October 17, 2020",
            "views": "33",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Emma Sohan",
                    "user_href": "/profile/Emma-Sohan"
                }
            ]
        },
        {
            "author_info": {
                "name": "Annette Allen",
                "href": "/profile/Annette-Allen-10"
            },
            "answer_text": "I started paying my son a quarter every time he read a Frog and Toad story to me. We had all the Frog and Toad books so there were plenty of stories to choose from. He LOVED it! He was so motivated he started reading to me all the time. Within about 6 months I was able to slowly stop paying him, but by that time he was a strong and avid reader. I know it’s unconventional but it worked and he still remembers it fondly. ",
            "date": "Answered October 13, 2020",
            "views": "66",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Aryan Prabhudesai",
                    "user_href": "/profile/Aryan-Prabhudesai-2"
                },
                {
                    "user_id": "Angela Goudman",
                    "user_href": "/profile/Angela-Goudman"
                }
            ]
        },
        {
            "author_info": {
                "name": "Isabel LeFebre",
                "href": "/profile/Isabel-LeFebre"
            },
            "answer_text": "Hello! I myself have a 9 year old brother that does not want to read or have anything to do with the library, but what my mom and I do is to kinda bribe them at first if they do end up reading some pages maybe they would like it. If that does not work you can try asking them what they really like and what interest them. Then you want to find a book that is most related t what they like. For my little brother he really likes marine animals so I gave him a book series called Who Would Win which is about all kinds of animals fighting and who would win. I hope this helps! - Isa ",
            "date": "Answered October 15, 2020",
            "views": "45",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Roksana Parvin Yasmin",
                    "user_href": "/profile/Roksana-Parvin-Yasmin"
                }
            ]
        },
        {
            "author_info": {
                "name": "Alia Mecham",
                "href": "/profile/Alia-Mecham"
            },
            "answer_text": "Interest him/her in graphic novels. After that they might think they can read thicker books. Also you can try to get them into series with a bit of books. Like I survived or junie b jones. ",
            "date": "Answered October 14, 2020",
            "views": "28",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "TJ Reed",
                "href": "/profile/TJ-Reed-24"
            },
            "answer_text": "Find a book that is interesting for the 8 year old!! If it’s boring he or she would rather not!! You being the parent know their likes dislikes so just pick something that excites the child and sparks an interest!💯👌🏾 ",
            "date": "Answered October 13, 2020",
            "views": "29",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Angela Goudman",
                    "user_href": "/profile/Angela-Goudman"
                }
            ]
        },
        {
            "author_info": {
                "name": "Raechel Allen",
                "href": "/profile/Raechel-Allen-3"
            },
            "answer_text": "Make it fun and enjoyable rather than forcing it on them. Also make sure you child doesn't have learning disabilities that could make reading harder and very uneasily and not enjoyable for them. ",
            "date": "Answered October 14, 2020",
            "views": "26",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Mari Joy Nonato",
                "href": "/profile/Mari-Joy-Nonato"
            },
            "answer_text": "Subscription in amazon books they are good. Schedule reading every 30 minutes before going to bed. Buy him or her the reading light where he can read on the bed off lights just his reading light. ",
            "date": "Answered October 17, 2020",
            "views": "50",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Pauline Newman",
                "href": "/profile/Pauline-Newman-2"
            },
            "answer_text": "Turn off the tv, and take their ipad away and tell them for every 15 min of reading they get 10 min on ipad. Quiz them on the book they are reading to make sure they have read it! ",
            "date": "Answered October 15, 2020",
            "views": "45",
            "upvotes": "0"
        }
    ]
}