{
    "title": "How to prepare for the IBPS Clerk to get selected? What is a good source for it - Quora",
    "tags": [
        "IBPS Clerk Exam",
        "IBPS Exam",
        "Bank Exams",
        "Institute of Banking Personnel Selection"
    ],
    "response": [
        {
            "author_info": {
                "name": "Ketty Vijay Parthasarathy",
                "href": "/profile/Ketty-Vijay-Parthasarathy"
            },
            "answer_text": "Preparation Strategy: There are no hard and fast rules that one can get good score in BANK exams if they start preparation very early. Some of them with just 2 month of rigorous preparation have been able to pull it off. Yes indeed. If you start early, you will have lots of time and can prepare with ease. If not, then it could be pretty strenuous but still you can pull it off provided that you have the sheer determination to do it so. Focus on the Basics/Fundamentals.Then increase the pace and also the level of your preparation.I mentioned some valuable points along with the strategy for preparation below, Simple strategies but could prove to be very effective: Please follow 20 mins strategy. Prepare seriously for 20 mins and then give a small break. Break depends as you can take a 1 min break to an hour. It solely boils down to you.With this strategy, even if you prepare for 10 times a day (10 x 20 mins = 200 mins = 3 hrs 20 mins); then you would be able to put in 3 hrs and 20 mins of valuable effort. More importantly, you will not have any starting problem as some students struggle to even start.One should follow these given tips and tricks to quickly prepare for BANK exams Proper planning – First of all you should have made a plan for your studies. Better understand about your BANK exam syllabus and find that in which weak section you must pay more attention and then prepare a study schedule.Update yourself – You should read the newspaper, magazines regularly and also updated with current affairs, daily events, and activities. Especially from the banking and finance industry.Study Topic wise – Students needs to concentrate on a single topic at a time do not just turn one to another pay serious attention to each and every topic. Practice more questions on the various topics.Make GK a weapon – General Knowledge is one of the best marks gaining subject in all over banking exams. You should command it by daily newspaper reading habit, Try some latest GK books and magazines which also clear your doubt about current affairs. Focus majorly on these topics – Current events, banking awareness, sports, business news, political news and film & television, etc.Proper Time Management – You should practice more and more to be able to solve all questions in good timing. Most of the students ask this question that How much time is required to prepare for BANK Exam? The answer is as you manage. Practice as much as you can don’t waste time in just thinking about the exam. Solve previous year questions and more practice can easily save your time in BANK exam.Trial with the Mock test – You must try yourself with the online mock test. With properly complete your BANK Exam Syllabus you should try some mock tests to judge yourself in the exam with proper time duration. Solve mock test to have a decent idea of the paper.Revision – Revise all your syllabus topics before few days once again and focus more on the weak section at that time.Perform Like a Hero – While entering the examination hall, you should perform as a hero does not hesitate about anything. Take section first on which you have command and less time consuming then go for the long part.Proper Diet & Tension-free – This is the last minute tips for BANK Exam. Students need to be calm during preparation time. Take your love, friendship, and family problems away from your mind for a few days. Feel free and the only target one thing. Avoid junk food it turns you lazier, drinks lots of water and gets enough sleep.The best source is to Join a Coaching Institute as they play an important role in providing predictable topic, tips and tricks to pass this exam with a good score, Factors to be Considered for Classroom Coaching: If someone has to choose coaching institute, then the factors to be considered are 1) Faculty profiles (that also include qualifications) [In my opinion, that's one of the most important factor], 2) Small class size i.e Faculty : Student Ratio (Even this is a very important factor) [It is still fine if the class size is slightly large provided that very good faculties handle the class] 3) Materials, 4) Online Test Series (Since most of the exams are online), Take Mock Tests Further, take lots of Mock Tests (after your preparation) and do a lot of self analysis after each and every test. Through this, you would be able to analyze your strengths and weakness. More importantly, you will not repeat the same mistakes again. ",
            "date": "Answered October 19, 2018",
            "views": "555",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Nishanth Mithran",
                    "user_href": "/profile/Nishanth-Mithran"
                },
                {
                    "user_id": "Anupam Singh",
                    "user_href": "/profile/Anupam-Singh-507"
                }
            ]
        },
        {
            "author_info": {
                "name": "Tanu Vashisht",
                "href": "/profile/Tanu-Vashisht"
            },
            "answer_text": "If you make efforts with a good strategy and effective resource then you can surely get the desired result. I made my preparation in 7 months and cracked the IBPS exam in the first attempt. After having many doubts, I have joined VIDYA GURU online coaching, which proven best for me. I took their 1-year online course and that proved really good for me. 4 months I have spent on course completion and 3 months I have the best revision on my syllabus and all the relevant help I took from VIDYA GURU online coaching only. The faculty and coaching part is very good, after joining VIDYA GURU online course, in the month of Feb I started my preparation and qualified the exam as well. Wherever I found difficulty, Vidya Guru teachers helped me so well. Their teachers were remained very close to the students and provided all possible help. They teach excellent content and they are very supportive. Their video lectures have been developed in such a manner, your syllabus will be completed so nicely if you take help from their video course. The books will prove icing on the cake. Good luck and make the best decision!! ",
            "date": "Answered September 4, 2020",
            "views": "177",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Niharika Jain",
                "href": "/profile/Niharika-Jain-156"
            },
            "answer_text": "Hi, There are two phases of IBPS Clerk Exam prelims and mains (i) You must be aware about the new pattern and complete syllabus of the exam. (ii) Prelims has sectional timing , so your approach play an vital role, you should refer online coaching because they have updated syllabus. I have joined Toprankers [1] “ Banking Gold”, Online classes. Very effective classes and relevant content by expert faculties. Thank You All The Best Footnotes[1] IBPS Clerk Exam Date | Notification | Prelims and Mains 2018 Complete Details",
            "date": "Answered October 23, 2018",
            "views": "33",
            "upvotes": " View 10 Upvoters",
            "upvoters": [
                {
                    "user_id": "Juhi Iyer",
                    "user_href": "/profile/Juhi-Iyer"
                },
                {
                    "user_id": "Suneha Priyadarsini",
                    "user_href": "/profile/Suneha-Priyadarsini"
                },
                {
                    "user_id": "Pranita",
                    "user_href": "/profile/Pranita-20"
                },
                {
                    "user_id": "Swati Raaj Chourasiya",
                    "user_href": "/profile/Swati-Raaj-Chourasiya"
                },
                {
                    "user_id": "Manish Kumar",
                    "user_href": "/profile/Manish-Kumar-15143"
                },
                {
                    "user_id": "Aadi Soni",
                    "user_href": "/profile/Aadi-Soni"
                },
                {
                    "user_id": "Mohseen Khan",
                    "user_href": "/profile/Mohseen-Khan-35"
                },
                {
                    "user_id": "Roli Shrivastava",
                    "user_href": "/profile/Roli-Shrivastava-4"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/VIJAY-BADODE"
                },
                {
                    "user_id": "Kashish Sharma",
                    "user_href": "/profile/Kashish-Sharma-285"
                }
            ]
        }
    ]
}