{
    "title": "How to become a famous singer?Where do I start at 18 - Quora",
    "tags": [
        "Singers",
        "Musicians"
    ],
    "response": [
        {
            "author_info": {
                "name": "Mark Andrews",
                "href": "/profile/Mark-Andrews-56"
            },
            "answer_text": "I' ll be blunt: your motivation would appear to be more a desire for fame than a genuine love of singing and being excellent at it for its own sake. We live unfortunately in a celebrity obsessed culture that is rammed down our throats by so called “talent\" shows replete with low tier “wannabees\". Don' t aspire to be one of those losers! Love first and foremost singing for its own sake, seek professional training to help you make the most of your voice and enjoy it! If fame ever happens, it will come as a by-product of a genuine love for what you do. If fame never comes, it won' t matter anyway, because you will still love to sing. ",
            "date": "Answered May 10, 2020",
            "views": "289",
            "upvotes": " View 3 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Sumeedh Pannalkar",
                    "user_href": "/profile/Sumeedh-Pannalkar-1"
                },
                {
                    "user_id": "Sam Day",
                    "user_href": "/profile/Sam-Day-117"
                },
                {
                    "user_id": "Matthew Weber",
                    "user_href": "/profile/Matthew-Weber-15"
                }
            ]
        },
        {
            "author_info": {
                "name": "Meredith Anne Heart",
                "href": "/profile/Meredith-Anne-Heart"
            },
            "answer_text": "You should never set out to become a famous singer. It would be much easier to just pursue another career if your aim is to be famous. If you want to become a singer, you’ll have to dedicate most of your life to it. If you do, you could achieve state-wide recognition. At 18, you should apply to university’s with music programs. Learn an instrument or 2 and work as something related to singing. Get advice from other people about how you could improve your voice and do highly recommended lessons online. You can also get voice training apps. ",
            "date": "Answered May 13, 2020",
            "views": "273",
            "upvotes": " Answer requested by Jamie Karl"
        }
    ]
}