{
    "title": "How was Harry Potter able to burn Professor Quirrell's body with his hands, in Harry Potter and the Sorcerer's (Philosopher's) Stone? - Quora",
    "tags": [
        "Harry Potter Book 1: Sorcerer's Stone",
        "Harry Potter (movie series)",
        "Harry Potter (creative franchise)"
    ],
    "response": [
        {
            "author_info": {
                "name": "Anthony Stenta",
                "href": "/profile/Anthony-Stenta"
            },
            "answer_text": "So, this is one of the ways the movie strays from the book. Book - Voldemort is forced out of Quirrell's body, and Quirrell body has adapted and dependent on Voldemort. We do not see his death in the book. Movie - Quirrell's body turns to ash once Harry touches him. Why? We first have to recognize in both that Quirrell/Voldemort is cursed, and no I am not talking about the horcruxes (this is a different way Voldemort is cursed). Remember, in both the book & movie they killed and drank the fresh blood of a unicorn. This is a big no no. Also there is this love thing.   \"He  didn't realise that love as powerful as your mother's for you leaves  its own mark... to have been loved so deeply, even though the person who  loved us is gone, will give us some protection forever. It is in your  very skin. Quirrell, full of hatred, greed, and ambition, sharing his  soul with Voldemort, could not touch you for this reason. It was agony  to touch a person marked by something so good.\"—Albus Dumbledore Pretty, much Quirrell dies in the movie because he is cursed, Voldemort can not hurt Harry Potter even through a familiar, and love. ",
            "date": "Answered March 12, 2015",
            "views": "265",
            "upvotes": " View 16 Upvoters",
            "upvoters": [
                {
                    "user_id": "Douglas Weiss",
                    "user_href": "/profile/Douglas-Weiss-2"
                },
                {
                    "user_id": "Massimo Lotruglio",
                    "user_href": "/profile/Massimo-Lotruglio-1"
                },
                {
                    "user_id": "Kaan Türen",
                    "user_href": "/profile/Kaan-Türen"
                },
                {
                    "user_id": "Sakar Sharma",
                    "user_href": "/profile/Sakar-Sharma-4"
                },
                {
                    "user_id": "Johanna D. Robles",
                    "user_href": "/profile/Johanna-D-Robles"
                },
                {
                    "user_id": "Gio Su",
                    "user_href": "/profile/Gio-Su"
                },
                {
                    "user_id": "Chalcy Nadar",
                    "user_href": "/profile/Chalcy-Nadar"
                },
                {
                    "user_id": "Yu Zi Qi",
                    "user_href": "/profile/Yu-Zi-Qi"
                },
                {
                    "user_id": "Jonathan Hirsch",
                    "user_href": "/profile/Jonathan-Hirsch-11"
                },
                {
                    "user_id": "Joshua Ira Norman",
                    "user_href": "/profile/Joshua-Ira-Norman"
                }
            ]
        },
        {
            "author_info": {
                "name": "Yedu Krishnan",
                "href": "/profile/Yedu-Krishnan-1"
            },
            "answer_text": "I'd like to clear a small misconception made by a lot of people who after watching this movie, assume that Harry was able to burn Quirrell's body because he possessed the Philosopher's Stone, which somehow gave him hands of fire. No. At that point of time in the Harry Potter universe, Lord Voldemort was still a shadow of his own self, surviving by possessing Quirrell and drinking Unicorn's blood. When Voldemort tried to kill Harry on Hallowe'en 1980, Lily Potter protected Harry. This invoken an ancient magic, the magic of love. Lord Voldemort - who had never known love - had ripped his soul with the evilest form of magic known to mankind and when he tried to murder an innocent (Harry), Lily Potter's sacrifice caused him to lose his powers and his mortal body. Fast forward to 1991. Harry would still be protected by Lily's magic if : 1. He was underage, i.e under 17 years of age; and 2. As long as he still had a home with the Dursley's. Since both categories were checked, Lily's magic was still strong. This prevented Lord Voldemort (who possessed Quirrell) from touching Harry. So when Quirrell tried to touch Harry, there was a kind of reaction which caused Quirrell's mortal body to burn away.  This prompted Lord Voldemort to regenerate using Harry's own blood at the end of HP & the Goblet Of Fire, which he thought would negate the power of Lily's magic. What he didn't understand that it would also double it, which lead to his eventual downfall. Thank you for the A2A, Virali Modi :) ",
            "date": "Answered March 12, 2015",
            "views": "679",
            "upvotes": " View 73 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Vishal Pannu",
                    "user_href": "/profile/Vishal-Pannu-3"
                },
                {
                    "user_id": "Shravani Dasari",
                    "user_href": "/profile/Shravani-Dasari-1"
                },
                {
                    "user_id": "Kaan Türen",
                    "user_href": "/profile/Kaan-Türen"
                },
                {
                    "user_id": "Hunter Jones",
                    "user_href": "/profile/Hunter-Jones-192"
                },
                {
                    "user_id": "Carol Lee Doeden",
                    "user_href": "/profile/Carol-Lee-Doeden"
                },
                {
                    "user_id": "Alvian Tjhai",
                    "user_href": "/profile/Alvian-Tjhai"
                },
                {
                    "user_id": "Aishwarya Jee",
                    "user_href": "/profile/Aishwarya-Jee-2"
                },
                {
                    "user_id": "Pony Lego",
                    "user_href": "/profile/Pony-Lego"
                },
                {
                    "user_id": "Arjun Sharma",
                    "user_href": "/profile/Arjun-Sharma-1435"
                },
                {
                    "user_id": "Shane Mackintosh",
                    "user_href": "/profile/Shane-Mackintosh-1"
                }
            ]
        }
    ]
}