{
    "title": "How to feel more grateful for the things my parents do for me? I've been feeling very angry and frustrated over small things lately, and that has lead me to act very ungrateful and grumpy. Where does my anger come from? What do I do - Quora",
    "tags": [
        "Frustration",
        "Gratitude",
        "Understanding Anger",
        "Anger Management",
        "Emotional Advice",
        "Parents",
        "Understanding Emotions",
        "Emotions",
        "Human Behavior"
    ],
    "response": [
        {
            "author_info": {
                "name": "Sheryl Luedecke",
                "href": "/profile/Sheryl-Luedecke"
            },
            "answer_text": "Get your 8 hrs of sleep. Don’t mess with electronics one hour before bed. Turn your phone on airplane mode at night. Don’t have it right next to your bed because of temptation. Take a warm shower or bath before bed. journal before you go to sleep about your day. When you get to the end begin writing out your grateful: I’m am so grateful my mom made dinner tonight. Other people do not have the privilege of having their mother cook for them. Some even go to bed hungry. I am so grateful for the food I receive made by my mother who loves me. Thank you so much, God , for the mother you gave me. compliment your parents on occasion. These small things will help you be grateful. sometimes negative friends or schoolmates can wear you down. If they are speaking ugly things about their parents or families can put u in a sour mood and cause u to be ugly to your family. I’m an adult and make sure my friends aren’t to negative. You become who you are with. But don’t be to hard on yourself. Everyone has bad days. ",
            "date": "Answered December 15, 2018",
            "views": "43",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Abbie Q",
                    "user_href": "/profile/Abbie-Q-1"
                },
                {
                    "user_id": "Barbara Meuleman",
                    "user_href": "/profile/Barbara-Meuleman"
                }
            ]
        }
    ]
}