{
    "title": "How to make a player fall in love - Quora",
    "tags": [
        "Falling in Love",
        "Romance (love)",
        "Understanding Love",
        "Love"
    ],
    "response": [
        {
            "author_info": {
                "name": "Adam Taha",
                "href": "/profile/Adam-Taha-3"
            },
            "answer_text": "What makes a player fall and stay in love.. He knows that she is inspired to learn of his goals, dreams whether some passon, business, ideas and even if they are sexual she deeply desires to help him to fulfill them or makes it easier for him to do so. Even by just encouraging in being the best cheerleader there is.She always ask about his work, talks about his dreams, and she’s always looking for opportunity to do that.He feels no fight with her in any shape of form regarding his lustful desires for sexual pleasures. He finds she makes it easy, she intiates. is very sexually confident and will know his deepest sexual desires, his kinks that she has the passion to pleasure him, and for him to experience them even if it’s threesome with other womenShe will use words, images, videos to ignite his imagination when he’s a way to always keep then pulse pounding his mind which strikes at the core of his being. She knows his emotional language is sexual, hardcore sexual and she isn’t intimidated but rather surpasses his expectations if he ever has any.His experiences with her, are far more pleasurable, loving affectionate, sexy to such she never switches off attraction and her flirtatious ways. In fact,she loves doing it because she knows, women out their are not skilled at it and most just don’t do enough of it.She is very submissive and derives pleasure from being so, and this may seem weakness but it is really her power, her strength in which attracts him even closer. She gets extreme pleasure for doing so and he will satisfy her, pleasure her and eat her pussy like it was the first meal he had in weeks.He fnds when he shares what he feels, whether it’s about her behavour or his pain, what he sexually desires….she has empathy and shows it in action. She doesn’t make him feel guilty or accuses him when he shares his feelings. Instead, it is intel information to use and be ahead of women out there to pleasure him.He can trust her with is utmost secretsWhen he fucks up, she doesn’t let anyone know but always protecting him.She knows he is wounded deep inside, so she is careful to avoid any negativtiy as possible, and focuses on positive stimulation, positive affimations and sexinessAnd he will do the same with her. He won’t be able to help doing so. He will grow hungry with a huge appetite to want to see her again and again to pleasure her and show affection, comfort and love.In other words… When he can get from her sexually and emotionally far outweighs what he can get out there… Which by the way isn’t difficult, because everyone out there is either so insecure about sex and held back due to their fears… Or sees him as a challenge and to fix… He will fall in love with…her.  ",
            "date": "Answered July 24, 2017",
            "views": "23",
            "upvotes": " View 47 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Claudia Lam",
                    "user_href": "/profile/Claudia-Lam-4"
                },
                {
                    "user_id": "Eleni Angermeir",
                    "user_href": "/profile/Eleni-Angermeir"
                },
                {
                    "user_id": "GayFor Hyuna",
                    "user_href": "/profile/GayFor-Hyuna"
                },
                {
                    "user_id": "Dheeraj Meena",
                    "user_href": "/profile/Dheeraj-Meena-17"
                },
                {
                    "user_id": "Starr Daniel",
                    "user_href": "/profile/Starr-Daniel"
                },
                {
                    "user_id": "Carmen Rodriguez",
                    "user_href": "/profile/Carmen-Rodriguez-413"
                },
                {
                    "user_id": "Casandra Virk",
                    "user_href": "/profile/Casandra-Virk"
                },
                {
                    "user_id": "Lucie Kline",
                    "user_href": "/profile/Lucie-Kline"
                },
                {
                    "user_id": "Lina Saad",
                    "user_href": "/profile/Lina-Saad-9"
                },
                {
                    "user_id": "Tracey Read",
                    "user_href": "/profile/Tracey-Read-9"
                },
                {
                    "user_id": "Dlbsep",
                    "user_href": "/profile/Dlbsep"
                },
                {
                    "user_id": "Yoon Yoon",
                    "user_href": "/profile/Yoon-Yoon-154"
                },
                {
                    "user_id": "Ereh Hethe",
                    "user_href": "/profile/Ereh-Hethe"
                },
                {
                    "user_id": "Rachel Gn",
                    "user_href": "/profile/Rachel-Gn-1"
                },
                {
                    "user_id": "Dunja Pascoe",
                    "user_href": "/profile/Dunja-Pascoe"
                },
                {
                    "user_id": "Jasmin Campbell",
                    "user_href": "/profile/Jasmin-Campbell-9"
                },
                {
                    "user_id": "Dango Onigiri",
                    "user_href": "/profile/Dango-Onigiri"
                },
                {
                    "user_id": "Lauren Lawless",
                    "user_href": "/profile/Lauren-Lawless-7"
                },
                {
                    "user_id": "Lenah Mehza",
                    "user_href": "/profile/Lenah-Mehza"
                },
                {
                    "user_id": "Sarah Taylor",
                    "user_href": "/profile/Sarah-Taylor-403"
                },
                {
                    "user_id": "Corallie Underhill Ferguson",
                    "user_href": "/profile/Corallie-Underhill-Ferguson-1"
                },
                {
                    "user_id": "Namuungoo Enkhbat",
                    "user_href": "/profile/Namuungoo-Enkhbat"
                },
                {
                    "user_id": "Lisa Callahan",
                    "user_href": "/profile/Lisa-Callahan-4"
                },
                {
                    "user_id": "Cool Summer",
                    "user_href": "/profile/Cool-Summer-4"
                },
                {
                    "user_id": "Bibiana Perez",
                    "user_href": "/profile/Bibiana-Perez"
                },
                {
                    "user_id": "Phan Thị Mai Hương",
                    "user_href": "/profile/Phan-Thị-Mai-Hương"
                },
                {
                    "user_id": "Michelle De La Rosa",
                    "user_href": "/profile/Michelle-De-La-Rosa-7"
                },
                {
                    "user_id": "Sarah Morgan",
                    "user_href": "/profile/Sarah-Morgan-193"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/Wow-258"
                },
                {
                    "user_id": "Glenis Grsy",
                    "user_href": "/profile/Glenis-Grsy"
                },
                {
                    "user_id": "Mikeal Monk",
                    "user_href": "/profile/Mikeal-Monk"
                },
                {
                    "user_id": "Maryanna Batischev",
                    "user_href": "/profile/Maryanna-Batischev"
                },
                {
                    "user_id": "Emily Jones",
                    "user_href": "/profile/Emily-Jones-109"
                },
                {
                    "user_id": "Olivier Roland",
                    "user_href": "/profile/Olivier-Roland"
                },
                {
                    "user_id": "Tridha Chaudhuri",
                    "user_href": "/profile/Tridha-Chaudhuri-1"
                },
                {
                    "user_id": "Adithya Vangari",
                    "user_href": "/profile/Adithya-Vangari-1"
                },
                {
                    "user_id": "N Newsome",
                    "user_href": "/profile/N-Newsome-2"
                },
                {
                    "user_id": "Mattox",
                    "user_href": "/profile/Mattox-2"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/PN-46"
                },
                {
                    "user_id": "Daevion Taylor",
                    "user_href": "/profile/Daevion-Taylor"
                },
                {
                    "user_id": "Erinhilt Schoeller",
                    "user_href": "/profile/Erinhilt-Schoeller"
                },
                {
                    "user_id": "Lê Giang Tường Vân",
                    "user_href": "/profile/Lê-Giang-Tường-Vân"
                },
                {
                    "user_id": "Sahil Prajapati",
                    "user_href": "/profile/Sahil-Prajapati-4"
                },
                {
                    "user_id": "David Graves",
                    "user_href": "/profile/David-Graves-30"
                },
                {
                    "user_id": "Lemmy Gitahi",
                    "user_href": "/profile/Lemmy-Gitahi"
                },
                {
                    "user_id": "Aryan Tandale",
                    "user_href": "/profile/Aryan-Tandale"
                },
                {
                    "user_id": "Amit Doshi",
                    "user_href": "/profile/Amit-2367"
                }
            ]
        },
        {
            "author_info": {
                "name": "Steven Martin",
                "href": "/profile/Steven-Martin-242"
            },
            "answer_text": " It may not work. It will not be easy to make a player love you. It may not be worth the effort. But, it is possible. It will take time, there is no magic bullet. First, you will have to convince him that you know him, and you love him. Do the following: Point out the good things you know about him. The comical habits, and things he likes, like his favorite drink.Point out the things you do for him. You prepare for for trips. You buy him sox. You check his look. You play catch.Tell him how important your relationship truly is. Why it's important.Make plans together, and stay in contact everyday.Tell him why you're the best, and ask him to stop looking.Players are lonely insecure people. They probably don't want you to know that. They are embarrassed about the number of women they have had it will be in the dozens. Keep the conversation light. A real player will be a bit distant. Hot and cold. You won't realize they are lonely and insecure. You won't always know what they are thinking. It won't be easy, but you will have to convince him that you know him and you love him. Point that out to him. You know him, and love him. You love him for who he is. You are his girlfriend! Be at his side, or within shouting distance almost all the time. No free weekends. If he goes to the gym, you go too. Make long term plans with actual dates. Fill up that calendar. He never makes plans longer than a week away, so you need to do it. Get to know his people. Know his family, friends and coworkers. Point out the strength and need of these relationships. The final, and most difficult thing is to get him to talk. He will resist, but get him to talk. Encourage him to talk about anything. Make him talk about Global Warming if you have to. Keep it light and fun. Encourage him, but dont criticize him. He can't easily accept criticism. Sugar coat it, the way you talk to him is important. He will be a fantastic lover. He has learned a lot over the years. That part will be very good. He will probably have two or three ladies ready to take your place, so it won't be easy. That's my best advice. ",
            "date": "Updated June 30, 2020",
            "views": "13",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Laura Schermerhorn",
                    "user_href": "/profile/Laura-Schermerhorn-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Jason Brown",
                "href": "/profile/Jason-Brown-1222"
            },
            "answer_text": "You don’t/ can’t/ shouldn’t/ wouldn’t want to. You won’t change them. Just enable them to use you for sex. They might be with you 99% of the time but may never be faithful. Do they make you drive and go “out of your way, inconvenient” favours all the time? Probably using you if you don’t live together. There have been honest chicks and dudes that did leave the game, I bet their partners laid it out straight. You fuck up, I’m gone. They said it and meant it so well, the player knew it’s now or never. Pimp/player for life or settle down and play the “dad/ mum -life” game. Don’t fool/ mug/ play yourself though, if you’re suspicious and snoop, it actually pushes a partner to cheat. If you’re suspicious you don’t trust them I’m the first place. Pshh please lol. If you’ve slept together and they haven’t hung up the rod and tackle/ given you the key to the city already and put them somewhat in your pocket/ purse (do they listen to you or ignore little instructions.. if you have no authority….) you’re never going to. So lay it on ‘em thick and stern, like those Boston and New York women I do so love hearing on tv. “If yoo want this I’m yoorz, but yoo fuuk uup!” “If yooo fuck up!; I’m Goooone , Aaaaah you’re breakin’ mah haaart.” Haha gotta love ‘em. Do no harm yet take no shit. ✌ ",
            "date": "Answered May 30, 2019",
            "views": "24",
            "upvotes": " View 2 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Jennifer Nguyen",
                    "user_href": "/profile/Jennifer-Nguyen-867"
                },
                {
                    "user_id": "Tanna Moon",
                    "user_href": "/profile/Tanna-Moon"
                }
            ]
        },
        {
            "author_info": {
                "name": "Moshe Ben",
                "href": "/profile/Moshe-Ben-4"
            },
            "answer_text": "I really don’t like these games that people play. Before I explain this to you, you must understand that a player will eventually play with your feelings and eventually dump you when he will have what he came for (usually sex) so be very careful when being attached to such a person. The best thing you can do if you want to get a player to fall for you is respect yourself and refuse to play his games. Make him appreciate you by setting standards for yourself. Use positive reinforcement to make him see what you're worth. Most importantly, Don't make him a priority. When a player calls to make plans, don't drop everything you're doing just for him. If you have plans, don't cancel them. Let him know that you've got a life outside of him, and that you're going to spend time with your friends. If you cancel on your friends to hang out with him, he'll feel like he already has you, and he may soon lose interest. Either way, my personal opinion is that you should find someone who won’t play games with your feelings, because one of you will eventually get hurt and nothing serious will ever come out of childish games. Never expect a player to have a serious relationship with you. ",
            "date": "Answered March 4, 2020",
            "views": "1",
            "upvotes": " View 6 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Lia Alderete",
                    "user_href": "/profile/Lia-Alderete-1"
                },
                {
                    "user_id": "Daphne Neofotistos",
                    "user_href": "/profile/Daphne-Neofotistos"
                },
                {
                    "user_id": "Holly Williams",
                    "user_href": "/profile/Holly-Williams-525"
                },
                {
                    "user_id": "Annie Chen",
                    "user_href": "/profile/Annie-Chen-385"
                },
                {
                    "user_id": "Stephanie Langston",
                    "user_href": "/profile/Stephanie-Langston-5"
                },
                {
                    "user_id": "Astha Sinha",
                    "user_href": "/profile/Astha-Sinha-7"
                }
            ]
        },
        {
            "author_info": {
                "name": "Leo Ambrose",
                "href": "/profile/Leo-Ambrose-5"
            },
            "answer_text": "Good, god, players must be really evil to read these answers. “Players”, like everyone else, fall along a spectrum. You have players who are hardcore narcissists. Smooth, lying, conniving. Run. You have players who use playing to maintain emotional distance. They're scared. They're a tougher nut to crack. However, you can't say they're not worth it from the distance of a quora commentator. You have no idea how shell shocked he is or how soft his inner state is. Know it's risky, but it's not necessarily insurmountable. You do have to be realistic, however. These guys need to put their big boy pants on and grow up. At the other end of the spectrum, you have players like me. When I'm single, I'm a dating and hookup animal, but I also know a good thing when I see it and I'm willing to commit for the right woman. I'm my case, that includes trans women. She got me. I ain't going nowhere.  Leo Ambrose's answer to Women are attracted to bad boys. How can I act like or be a \"bad boy\"? ",
            "date": "Answered February 27, 2020",
            "views": "11",
            "upvotes": " View Sharers",
            "upvoters": [
                {
                    "user_id": "Casandra Virk",
                    "user_href": "/profile/Casandra-Virk"
                },
                {
                    "user_id": "Ereh Hethe",
                    "user_href": "/profile/Ereh-Hethe"
                },
                {
                    "user_id": "Aggie Ledbetter",
                    "user_href": "/profile/Aggie-Ledbetter"
                },
                {
                    "user_id": "Christine Dozier",
                    "user_href": "/profile/Christine-Dozier-2"
                }
            ]
        },
        {
            "author_info": {
                "name": "Ann Patrick",
                "href": "/profile/Ann-Patrick-17"
            },
            "answer_text": "Men know the minute they first see a woman if they are drawn to her. It is based on how she looks. And as they date, ONLY if he was already ready to marry, will he decide to fall in love with her. You want to make a player fall in love with you? This is a very common form of self-punishment and self-created misery. He is not looking for love, is not ready for commitment, and even if he falls in love with how you LOOK he’s not going to commit to you … just play you until he gets bored. ",
            "date": "Answered February 27, 2020",
            "views": "954",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Maadhavneesh",
                "href": "/profile/Maadhavneesh"
            },
            "answer_text": "A player means play boy who is used to consume girls as he is consuming any consumable items,just use & throw. But it's not always a same game for every day,any star batsman can get also clean bold by average bowler same thing also happen with playboy. He got flat by heart & soul by very average looking girl eventhough he had consumed more beautiful girls than her. It's about love of “x” factor that directly hit your DNA & chromosome. Sometimes the simplicity can create miracle in compare with glorified beauty. Sometimes over saturation do such impact on heart & soul that it creates Saint from devil. ",
            "date": "Answered May 19, 2018",
            "views": "77",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Lan Phong",
                    "user_href": "/profile/Lan-Phong-2"
                },
                {
                    "user_id": "Jessica Holness",
                    "user_href": "/profile/Jessica-Holness-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Rebeca Lynn McCoy",
                "href": "/profile/Rebeca-Lynn-McCoy"
            },
            "answer_text": "You can never predict how or what makes any person do anything. For example, you could have the most amazing person in the world who has you meet the important people in their life. They could be the person who makes you laugh and you could really see things going somewhere; and they’ll still take a 180 turn due to things that may be happening in their life. It sucks but I’d say just move on. There’s plenty of other people out there. ",
            "date": "Answered April 18, 2018",
            "views": "46",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Mary Rojas",
                    "user_href": "/profile/Mary-Rojas-33"
                },
                {
                    "user_id": "Chyna .",
                    "user_href": "/profile/Chyna-46"
                }
            ]
        },
        {
            "author_info": {
                "name": "Joanne Hilden",
                "href": "/profile/Joanne-Hilden-2"
            },
            "answer_text": "Play hard to get and dont show them how excited you are about them. Be cool. Usually players are used to have people around them who tries to hit on them. So, when you are different, they will notice you and wonder why theyre “spell” doesnt work on you 🙃 ",
            "date": "Answered September 25, 2020",
            "views": "106",
            "upvotes": " View 2 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Daphne Neofotistos",
                    "user_href": "/profile/Daphne-Neofotistos"
                },
                {
                    "user_id": "Casandra Virk",
                    "user_href": "/profile/Casandra-Virk"
                },
                {
                    "user_id": "Kira Vega",
                    "user_href": "/profile/Kira-Vega-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Anita Munday",
                "href": "/profile/Anita-Munday"
            },
            "answer_text": "I believe maturity is what changes a player. If he is not finished “sowing his wild oats” he is going to continue to play. But even that gets old and at some point, he is going to want something steady and meaningful in his life. That usually comes with maturity, but not until he’s ready. ",
            "date": "Answered April 12, 2018",
            "views": "4",
            "upvotes": " View 3 Upvoters"
        },
        {
            "author_info": {
                "name": "Robbie Goodwin",
                "href": "/profile/Robbie-Goodwin-2"
            },
            "answer_text": "You might, if you didn’t mind lying… and isn’t that the basic quality of Players? Would you mind lying, to make a player fall in love with you? ",
            "date": "Answered February 27, 2020",
            "views": "357",
            "upvotes": " Answer requested by Mary Silverstone"
        },
        {
            "author_info": {
                "name": "Alexander Hogg",
                "href": "/profile/Alexander-Hogg-1"
            },
            "answer_text": "No. ",
            "date": "Answered February 27, 2020",
            "views": "365",
            "upvotes": " Answer requested by Mary Silverstone"
        }
    ]
}