{
    "title": "I am a 2nd year dropper for the NEET. Which books should I use? - Quora",
    "tags": [
        "National Eligibility cum Entrance Test (NEET)",
        "Book Recommendations",
        "Books"
    ],
    "response": [
        {
            "author_info": {
                "name": "Anshul Garg",
                "href": "/profile/Anshul-Garg-15"
            },
            "answer_text": "Use these books: Chemistry: NCERT-most important. Other than that, for reference, use OP Tandon, MS Chouhan, Himanshu Pandey, Pradeeps, Morrison and Boyd, SN Sanyal etc. For Physical and Organic, you need to refer some books. In that too, NCERT will cover 80%+. Refer other books for that 20% left. Otherwise NCERT is brilliant for Chem. BIO: Start with NCERT, . Then go ahead with previous year questions. You can also refer to Trueman’s for that little extra thing. 70-80 % NCERT will do. For that 20-30% extra, you need to refer to books like Truemans. Physics: Start with SL Arora and HC Verma. Then go ahead with previous year Questions directly. Also you can skip doing some questions of HC Verma if NEET is your target as they are meant for Engineering only.. Practice from MTG Books(as they are best for Medical with best solutions and almost all the answers are correct): MTG NEET Champion, NCERT at your fingertips, NEET Guide, MTG AIIMS Assertion and Reasons, MTG NEET 31 Years, MTG AIIMS 25 Years for all three subjects ! And if time permits, practice IIT JEE Mains questions too from Arihant 40 years (because many times questions repeat in Medical from IIT JEE). No need to do any other book!! No modules etc needed after this. But as I said, you should feel confident after this. That should come from within. Till that comes, keep practicing questions. Practice previous year questions MANY TIMES. Become perfect in them. Solve other people’s doubts. That will help you score better :) (Whatever we give to the world comes back many times. Example: If you keep smiling, then people smile at you. That’s the law of nature. You give Soan Papdi in Diwali to people and Soan Papdi will only come back. World is nothing but a reflection of you. Whatever you start thinking, starts manifesting. So always be positive. Be Happy and Spread the knowledge and it will come back to you !) Also, I recommend all my students to practice Sudarshan Kriya of the Art of Living. It gives you very good clarity of mind and keeps you focused in exams. In fact Nishita Purohit (AIIMS Rank 1) used to practice it daily !  Best Wishes Satnara IIT AIIMS Academy (an initiative by IITians.. ) Mayur Vihar, Delhi ",
            "date": "Answered July 16, 2019",
            "views": "121",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Himanshu Dhawan",
                "href": "/profile/Himanshu-Dhawan-26"
            },
            "answer_text": "Hello everyone. First of all remember that doing a book 10 times is much better than doing 10 books in an year. So stick to few books and do them again and again. Here we go Physics 1.Last 20 years neet and aiims questions(MUST) 2.coaching module/DC pandey (if not taking coaching) 3. HC verma for theory (for weak topics) 4. Ncert( if your focus is on aiims) Chemistry 1.Ncert(you are not gonna make it without this) 2. Ncert exemplar 3. Coaching module/ MTG fingertips 4. Last 20 years neet and aiims questions 5. Arihant objective chemistry Biology Ncert (read at least 15–20 times before neet)Mtg fingertips (Must)Last 10 years neet and aiims questionsRemember that it's not the books which will decide your marks in exam ,it's your hard work and dedication which decides your rank. So devote your this year(2nd drop) completely in studies and do your best. Sorry for grammatical mistakes. Cheers. ",
            "date": "Answered July 10, 2019",
            "views": "319",
            "upvotes": " View 3 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Jagdip Madaan",
                    "user_href": "/profile/Jagdip-Madaan"
                },
                {
                    "user_id": "Kusuma Reddy",
                    "user_href": "/profile/Kusuma-Reddy-35"
                },
                {
                    "user_id": "Sanjukta Adhikari",
                    "user_href": "/profile/Sanjukta-Adhikari-4"
                }
            ]
        }
    ]
}