{
    "title": "I am in class 12 and thinking about the approaching boards has started making me anxious and I start to panic. How can I get rid of these feelings? - Quora",
    "tags": [
        "Exam and Test Preparation Advice",
        "Overcoming Anxiety",
        "Educational Exam and Test Advice",
        "Studying Advice",
        "Anxiety",
        "Exam and Test Advice",
        "Academic and Educational Advice",
        "Exams and Tests"
    ],
    "response": [
        {
            "author_info": {
                "name": "Chandan Kumar",
                "href": "/profile/Chandan-Kumar-673"
            },
            "answer_text": "First just be calm and cool…..and just enjoy that's what I do when I feel something like fear. Today is 24 th September only ,and you have approx 5 months in hand which is more than sufficient for the preparation for the 12 th board. Let me tell you my situation at that time ( when I was about to give board exams ) .I had not completed single chapter ,but my chemistry ,computer science and maths was best. So I never use to study those and not even I study other subjects .And when the exam came I just started collecting notes and study those ,all this happen just a month before .And I had clear my board with good marks . So now I guess you will be felling better ,after reading my story . Now let's start about the studying pattern which you may follow ,first you can do read some chapter of chemistry at the day time and try to complete that chapter with full enthusiasm.And as it is easy so you can complete this in short time ,which can make you feel more confident . Then you can start with the subjects which is familiar to you and you might had studied before so that it can also increase your confidence. That's it ….. Feel free to ask any questions related to this. One important saying “count time in seconds and march fast.” Edit: Students in engineering college just complete their paper just a night before the exam and you might had heard about this from somewhere,and it is true also . And you are having more a 5 months ,so imagine what you can do in these months if you utilize these time in a proper way. At last just don't panic ……and if you are panic then you are just wasting your time in thinking that what you can do ,in these small time but count in seconds and then see the no it will be very large , then you might feel this is too much time. Utilize the time in a productive way. ",
            "date": "Answered September 23, 2016",
            "views": "109",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Natasha",
                    "user_href": "/profile/Natasha-73"
                }
            ]
        }
    ]
}