{
    "title": "I am looking into self-publishing my novel. How would you recommend getting started? - Quora",
    "tags": [
        "Self-Publishing",
        "Book Publishing",
        "Publishing",
        "Novels"
    ],
    "response": [
        {
            "author_info": {
                "name": "April McCool",
                "href": "/profile/April-McCool"
            },
            "answer_text": "Thanks for the A2A. My internet has been kludgy for a few weeks now, so my time is limited. Looks the other answers have really covered most of the basics, but there is so much more that I have been learning. There's marketing your novel, making a web presence, all sorts of things. I have found that the Writer's Digest newsletters frequently have helpful articles for self-publishers. I joined a local meet-up group for indie authors and learned a lot there as well. I will stress that you hire an editor. Bad reviews will follow you forever. I have been contacted by authors who self-published and were skewered for plot holes and grammar and spelling errors. NOW they want an editor and plan to publish a \"revised edition\" and give it free to those who bought the previous (mistake-ridden novel).  There were 600,000 indie novels published last year. That's a lot of competition. You need a professional-looking cover to grab attention, but you need to follow that up with a good novel. Hiring an editor and paying for a professional cover--those are just the cost of doing business as an indie novelist. Plan for it, save for it. A friend of mine is self-published. Before his book went live, he posted snippets on his FB page and probably elsewhere to generate buzz and interest. That was cool. It made me want the book. I bought it. But now, he is still posting the same snippets along with pics of his book and people reading his book in various locations. But this has been going on for awhile now and I scroll on by. I am thinking of blocking the posts about his novel because there's nothing new there. And no talk of a follow-up novel (which I would love). So now it's just annoying. My own novel still isn't finished (I actually have 3 in the works), but I am reading voraciously to learn the ins and outs, do's and don't's of marketing my novels when I am finished. Right now, I am spending more time editing other authors' works and not my own. Good luck! ",
            "date": "Answered September 16, 2015",
            "views": "146",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Aubrey Sorenson",
                    "user_href": "/profile/Aubrey-Sorenson"
                }
            ]
        },
        {
            "author_info": {
                "name": "Shirley Thomas",
                "href": "/profile/Shirley-Thomas"
            },
            "answer_text": "Hi, thanks for the A2A. I'm going to answer assuming you have the manuscript finished, and that you want to publish it as an ebook. First, have it edited, or at the very least, proofread. Two pairs of eyes are better than just one. Next, decide if you want to go exclusive with Amazon or upload it to Amazon as well as other multiple vendors (Nook, iBooks, Kobo, Smashwords, Google Play, and OmniLit or ARe.) There are advantages when you go exclusive with Amazon KDP, and you do this by enrolling into KDP Select, which is an opt-in; you can publish on KDP without being exclusive as well. But there are also advantages to publishing on multiple platforms. Most authors say it depends on what you're writing. In my experience, you have to do a lot of tests and experiments yourself. Some of my titles do better in Select, others are thriving on iBooks. * Once you have decided, we can then tackle file conversion. Amazon KDP accepts .docx files; they'll convert those into .mobi. Some authors hire others to convert their files, to make sure everything is in place, as well as having the interior of their ebook professionally designed. This means the beginning of a chapter starting halfway down a fresh page, drop caps, clear separators between important scenes (or even appropriate vectors!) and many other things that will add to your readers' experience. I have my titles uploaded to Nook, iBooks, Kobo and several other vendors via Draft2Digital, which also accepts .docx files. D2D produces such beautiful .epub files, I never bother doing the conversion myself. I also upload to Google Play and All Romance eBooks (their non romance sister company is OmniLit), and I use Calibre to convert my files into pdf, epub and mobi. Google Play asks for the first two; all three types of files are big sellers on ARe. * Then, marketing. The basic is Cover, Product Description and the Look Inside i.e. the things you can and need to do before your book hits the market. Cover: Do some research to determine where your novel fits in the shelves of those ebook vendors. If it's a mystery, is it thriller? Or is it cozy mystery? Look at the best sellers that are your competitors, see what they're doing. (E.g. cozy mysteries have flat, poster color illustrations for their cover; puns on their titles, etc.) You might want to do the same. I am not sure about your budget for marketing but please do invest in a professional cover. Do a search for 'premade covers [your genre]' for starters. Product Description: Study the product descriptions of your competitors. See which one(s) make you want download the novel(s) and try to compose your product description in the same style. The Look Inside: This gives your potential readers a peek into the book. Other than your first chapter (or part of it)—which I hope is clean, engaging and a page turner—you want to make sure the formatting is good, too. This is where all that talk about file conversion comes in. For the most part, readers are fine with clean copy and simple formatting, but if you have the budget for interior ebook design, why not. I know some authors groan and lament the necessity (and the difficulties) of Table of Contents, which is crucial for some genres. * This is what I came up with right now. I wanted to branch out on so many things while I was typing! Feel free to ask further, if any, and good luck! ",
            "date": "Answered September 15, 2015",
            "views": "258",
            "upvotes": " View 5 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Ink Lo",
                    "user_href": "/profile/Ink-Lo"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/Marya-Sholevar"
                },
                {
                    "user_id": "John Kremer",
                    "user_href": "/profile/John-Kremer"
                },
                {
                    "user_id": "Aubrey Sorenson",
                    "user_href": "/profile/Aubrey-Sorenson"
                },
                {
                    "user_id": "Justin Charnell",
                    "user_href": "/profile/Justin-Charnell"
                }
            ]
        }
    ]
}