{
    "title": "I am interested in investing my money in the stock market. What is a simple and good book to understand how to start? - Quora",
    "tags": [
        "Stock Market Advice",
        "Investing Advice",
        "Stock Market Investment Advice",
        "Investing in the Stock Market",
        "Investment Advice",
        "Stocks (finance)",
        "Stock Markets",
        "Book Recommendations",
        "Investing"
    ],
    "response": [
        {
            "author_info": {
                "name": "Sandeep Nayak",
                "href": "/profile/Sandeep-Nayak-37"
            },
            "answer_text": "Instead of reading a book which only offers you theories and  can be difficult to understand at times, be practical. 1. Learn what a share is.(Lots of resources available online) 2. Learn how you can buy shares of a company you are interested. (Demat Account, Trading Account, Brokers, Stock Exchanges etc.). Do the formalities and set it up.  3. After you are done with Point 2, go ahead and buy a single share of any company you are interested to invest. Observe the process to buy a share. Observe for few weeks how the share price fluctuates.  4. You will learn that, stock market is purely speculative. There are ups and downs. But, that is OK, since you have only invested a small amount to be able to buy a share. 5. By now, you will also learn how every decision either direct or indirect the company makes affects its share price. 6. Read up on terminologies associated. For example - Dividends, Bonus, P/E ratio, P/B ratio, Industry P/E, AGM's, Quarterly results and understand what they mean. (All these info are available on the Stock Exchanges the company in which you invested is trading). You will be more comfortable and be able to make a wise decision when you make future buys. 7. Know how shares can be traded for Short Term & Long Term. Learn about the pros and cons of it. 8.  Now that you have a reasonable knowledge on the pros and cons of investing in shares, you can look forward to build a portfolio of stocks. ",
            "date": "Answered August 21, 2015",
            "views": "191",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Shima Mura",
                    "user_href": "/profile/Shima-Mura"
                },
                {
                    "user_id": "Rahul R Khivnsara",
                    "user_href": "/profile/Rahul-R-Khivnsara-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Rajveer Rawlin",
                "href": "/profile/Rajveer-Rawlin"
            },
            "answer_text": "Two other books that are a bit easier to follow are beating the street and one up on wall street both by legendary investor Peter Lynch. ",
            "date": "Answered August 23, 2015",
            "views": "1",
            "upvotes": "0"
        }
    ]
}