{
    "title": "I am terrified of a near-term future event that I can do nothing about. What can I do to calm myself without involving others? - Quora",
    "tags": [
        "Advice About Coping with and Overcoming Fear",
        "Scary Situations",
        "Coping with and Overcoming Fear",
        "Fear",
        "Life Advice"
    ],
    "response": [
        {
            "author_info": {
                "name": "Nora Nasef",
                "href": "/profile/Nora-Nasef"
            },
            "answer_text": "i have learned throughout my life that worrying makes everything worse. sometimes you worry too much and then you find it wasn't worth all that worrying. if you are so sure it's going to happen i say you take the most of today start engaging yourself in stuff you don't usually do, especially if u tried helping other people in pain or in need; it makes u realize how good and beneficial u are while helping you see the bigger picture of how small your problems might be regarding other's pain. also it would be really helpful if u could find someone who has dealt or currently dealing with such problem, because seeing people dealing with the same situation usually help ease it. the last thing i would like to add is try and meditate or turn to god it really helps. ",
            "date": "Answered August 25, 2014",
            "views": "232",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Paizli Palmrose",
                    "user_href": "/profile/Paizli-Palmrose"
                }
            ]
        },
        {
            "author_info": {
                "name": "Allan Power",
                "href": "/profile/Allan-Power"
            },
            "answer_text": "The answer is twofold; your perception of the event is what you fear, 20% probabability. Realize your fear is what you control it to be.  75% chance of being killed in a very painful way is close enough to 100% to hone your suicidal skills then be ready for being in control and operating on your preference. Beat them at their own game ",
            "date": "Answered August 18, 2014",
            "views": "174",
            "upvotes": "0"
        }
    ]
}