{
    "title": "I can speak English but my writing in English is so bad. What should I do ? - Quora",
    "tags": [
        "English Writing",
        "English Language Writing Advice",
        "Advice About Learning English",
        "Speaking English",
        "English as a Second Language (ESL)",
        "Learning English",
        "Language",
        "Writing",
        "English (language)"
    ],
    "response": [
        {
            "author_info": {
                "name": "Stephen Hambleton",
                "href": "/profile/Stephen-Hambleton"
            },
            "answer_text": "I can speak English but my writing in English is so bad. What should I do ? It is usually the opposite case. The foreign student usually has a reasonably good command of written English but struggles to be able to understand spoken native English. I assume you have had a fair amount of opportunity to practice your speaking but not your writing. Find yourself a good book on basic grammar. If you are living in the UK, then your local library would be a good place to find one. Also, while you are there, inquire if there are any ESOL classes available in your area. They usually run from September to June and are usually reasonably cheap. Keep practicing ",
            "date": "Answered January 8, 2019",
            "views": "141",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Jaigobin Shivcharran",
                    "user_href": "/profile/Jaigobin-Shivcharran"
                },
                {
                    "user_id": "Genius Turner",
                    "user_href": "/profile/Genius-Turner"
                },
                {
                    "user_id": "Asep",
                    "user_href": "/profile/Asep-4"
                }
            ]
        },
        {
            "author_info": {
                "name": "Sumita Tah",
                "href": "/profile/Sumita-Tah"
            },
            "answer_text": "If you want to improve your writing skills in English follow these steps. Keep a journal or diary and write every day whatever you have done through out the day. Do this without fail till at least six months. Of course you will be writing in English and in case you cannot find the appropriate word look up the net or a dictionary. You maykeep this journal in your smartphone too.Follow some word power enhancing sites or learn 5 new words from the dictionary every day.Read a lot of story books and enjoy watching English films. Try to write reviews of the books and films.Gradually your writing skills will become polished and you will become an excellent writer. You may click on my website for informative inputs. English Literature and Grammar ",
            "date": "Answered July 19, 2020",
            "views": "83",
            "upvotes": " Answer requested by Meshva Patel"
        }
    ]
}