{
    "title": "I don't want to live anymore. What should I do? - Quora",
    "tags": [
        "Suicidal Thoughts",
        "Suicide Prevention",
        "Suicide",
        "Depression",
        "Life Advice"
    ],
    "response": [
        {
            "author_info": {
                "name": "Beth Tango",
                "href": "/profile/Beth-Tango"
            },
            "answer_text": "What are you going to do when you feel tired of life? As with most things in life, it depends. What is it about life that you’re tired of? If it’s a general malaise or ennui with life in general, perhaps some worthwhile things to consider are: What event(s) might have triggered this? Death in the family, poor grades, work problems, relationship problems, drug use?Might you have depression? either criterion a OR b must be present for at least 2 weeks; pay particular attention to criterion b.Depressed moodAnhedonia (diminished loss of interest or pleasure in almost all activities)Significant weight or appetite disturbanceSleep disturbancePsychomotor agitation or retardation (a speeding or slowing of muscle movement) that is visible to others, not just a subjective senseLoss of energy or fatigueFeelings of worthlessness (low self-esteem)Diminished ability to think, concentrate and make decisionsRecurrent thoughts of death, dying or suicideLongstanding interpersonal rejection ideation (ie. others would be better off without me); specific suicide plan; suicide attemptAre the symptoms of depression:Causing significant distress or severely impact social, occupational or other important life areasNot precipitated by drug useIf you think you have depression, you can judge whether you’re having mild, moderate, or severe depression. If it’s moderate or severe, treatment is likely to be very, very helpful. Please go see a doctor. There’s no need for you to suffer like this. Sometimes the best thing is to just take a little break if you think you’re having a bit of existential crisis without depression. Hopefully you haven’t lost the ability to experience pleasure for everything. It might be helpful to focus attention on self-care: Adequate sleepEating nutritiously and regularlyExercising (!! so helpful)Take note of your social needs and meet themFocus on doing things/hobbies that give you a sense of satisfaction and mastery of your life.The little things that give you pleasure like a great eclair, or tasty blueberries, going shopping for something little, planning a pretend vacation, looking at beautiful flowers, watching sports. Whatever it is.Maybe stop following the news. Sometimes all the negativity that we encounter can make us feel hopeless about the futureI hope that any of this is helpful to you and that your zest for life returns. Namaste. ",
            "date": "Updated August 27, 2017",
            "views": "42",
            "upvotes": " View 5 Upvoters",
            "upvoters": [
                {
                    "user_id": "Faustina Tamuno",
                    "user_href": "/profile/Faustina-Tamuno"
                },
                {
                    "user_id": "Aryana Simon",
                    "user_href": "/profile/Aryana-Simon"
                },
                {
                    "user_id": "Kathy Pottkotter",
                    "user_href": "/profile/Kathy-Pottkotter"
                },
                {
                    "user_id": "Juan Manuel Mendoza López",
                    "user_href": "/profile/Juan-Manuel-Mendoza-López"
                },
                {
                    "user_id": "Ziyadi",
                    "user_href": "/profile/Ziyadi"
                }
            ]
        },
        {
            "author_info": {
                "name": "Rebecca Billy",
                "href": "/profile/Rebecca-Billy"
            },
            "answer_text": "First off, you should get help, preferably from a professional. If you are suicidal, it may feel real to you that things will never get better, but that isn't true. It can become an ingrained way of thinking, where you are so accustomed to it, that the hopelessness feels more real than the possibility of change. That's why you need an outside perspective from someone who will help you to recognize the truth.  I'll tell you a couple stories. When I was working as a massage therapist, I had a client who had attempted suicide. He had been depressed and hopeless, and one day he just decided he would kill himself by driving his car off a bridge. Well, he did drive his car off the bridge, but he didn't die. Two teenaged boys just happened to chance along and saw his car go over the edge. One of them called 911 while the other swam out to him and wrested him out of the car. They saved his life.  I wish I could say the story ended with him suddenly feeling happy just to be alive and with a renewed sense of purpose, the way it happens in movies. But instead, he ended up with chronic pain and disability that would continue for the rest of his life. He then had to figure out how to live and cope with physical pain and impairment to go along with the emotional pain and impairment. \"Stupidest thing I ever did,\" was how he put it. The other story concerns a dear member of my family. She was abused by her husband, but no one around her was aware of it. Because she was closed off and afraid to confide in anyone, she could see no way out of her situation. She took a bunch of pills in an attempt to end her life, because she felt that alone and despairing. It wasn't until after she woke up in the hospital and was able to begin talking that she told anyone about what she had experienced and gained the strength to leave her abuser. She did get the treatment she needed, and found that there was more support and understanding than she could have anticipated. Unfortunately, she lost custody of her kids to their abusive father. Today, just a few years later, she is remarried to a wonderful man, and expecting another child. She's finally getting her college degree and her life is getting better. She is still fighting a battle to gain custody of her kids. I know a lot of other people who've attempted suicide, and, in various ways, they've all gone on with their lives. They had no moment of epiphany when life suddenly seemed worth living. Instead, they made the decision to live life as though there was hope, even if they didn't feel hopeful. They made plans for the future and did what they could to make their lives the way they wanted them to be, step by incremental step. Living like this takes courage, but it is a courage that people have within them. Make the choice to reach out for help. Live as though there is hope. Seek treatment. Your life matters. There are consequences to everything you do, and suicide has permanent consequences, for you and for anyone who cares about you. Take one step at a time and live like tomorrow will be better. Eventually it will be, if you reach for it. ",
            "date": "Answered September 4, 2015",
            "views": "215",
            "upvotes": " View 24 Upvoters",
            "upvoters": [
                {
                    "user_id": "Harry Dickinson",
                    "user_href": "/profile/Harry-Dickinson-26"
                },
                {
                    "user_id": "Rebekah VanLaarhoven",
                    "user_href": "/profile/Rebekah-VanLaarhoven"
                },
                {
                    "user_id": "Skyla Pfeiffer",
                    "user_href": "/profile/Skyla-Pfeiffer"
                },
                {
                    "user_id": "Kritika Khanwal",
                    "user_href": "/profile/Kritika-Khanwal-1"
                },
                {
                    "user_id": "Amy Abreu",
                    "user_href": "/profile/Amy-Abreu-2"
                },
                {
                    "user_id": "Darpan Budukule",
                    "user_href": "/profile/Darpan-Budukule"
                },
                {
                    "user_id": "Faruque Dewan",
                    "user_href": "/profile/Faruque-Dewan"
                },
                {
                    "user_id": "Shashank Singh",
                    "user_href": "/profile/Shashank-Singh-1966"
                },
                {
                    "user_id": "John Houston",
                    "user_href": "/profile/John-Houston-52"
                },
                {
                    "user_id": "Adriana Sutton",
                    "user_href": "/profile/Adriana-Sutton"
                }
            ]
        }
    ]
}