{
    "title": "I feel like my reading speed is slow. Is slow reading speed a fixed thing for some people and it can't increase throughout the lifetime? - Quora",
    "tags": [
        "Speed Reading",
        "Reading Recommendations",
        "Reading Advice",
        "Reading",
        "Academic and Educational Advice",
        "Self-Improvement"
    ],
    "response": [
        {
            "author_info": {
                "name": "Catherine Waldron",
                "href": "/profile/Catherine-Waldron-1"
            },
            "answer_text": "I am a slow reader. When I was in school, I always noticed others finished reading well before I did. It was very frustrating to feel that I was falling behind. As I progressed through school, I made a very interesting discovery: While I was actually understanding, thinking about and remembering what I read, many of my fellow students who were much faster readers were actually just skimming for key facts or to confirm opinions they already had formed. They really were not learning much at all from their reading, nor were they particularly enjoying the experience. So if you read slowly but with solid understanding and enjoyment, be patient with yourself, and give yourself the extra time because it’s definitely worth it not to rush through important and valuable learning experiences. On the other hand, if you read slowly because it is painful or confusing for you to read for longer than a few minutes at a time, or if you are continually losing your place or need to re-read, or if you have difficulty concentrating and need to take frequent breaks - this could be a sign of a vision or attention problem or a reading disability. You can get support services and learn strategies to overcome these kinds of obstacles and although your reading may remain slow, it can become enjoyable and deeply rewarding. And as others have pointed out, the more you read, the more you will improve. Focus on the quality of your reading rather than the quantity. I don’t know if your reading will get faster, but it definitely will get easier. ",
            "date": "Answered May 17, 2016",
            "views": "502",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Amino Gaga",
                    "user_href": "/profile/Amino-Gaga"
                },
                {
                    "user_id": "ILYA KRAVTSOV",
                    "user_href": "/profile/ILYA-KRAVTSOV-3"
                },
                {
                    "user_id": "Katana Hawk",
                    "user_href": "/profile/Katana-Hawk"
                },
                {
                    "user_id": "Cathlyn Ortega",
                    "user_href": "/profile/Cathlyn-Ortega"
                }
            ]
        },
        {
            "author_info": {
                "name": "Daniel Wieser",
                "href": "/profile/Daniel-Wieser"
            },
            "answer_text": "Reading speed is not fixed. Of course it can increase and decrease. This depends on a number of factors: How often do you read? Do you read daily? Do you practice reading in general?What type of books do you read? Are you familiar with the topic? Do you understand the words or do you need a dictionary?Do you actually want to increase your reading speed? Many people read for pleasure and they don’t want to increase it. Increasing the speed takes practice. Skimming, scanning, stopping regression, etc. If you don’t practice, you won’t increase your reading speed.An increased reading speed does not come naturally, just by reading. Same with riding a bike: if you never go faster, every time you ride the bike, you will never increase your speed. You need to go faster every time you ride the bike - same with reading. Read faster every time you read. Practice often. ",
            "date": "Answered July 28, 2016",
            "views": "385",
            "upvotes": "0"
        }
    ]
}