{
    "title": "I have written a novel, how should I approach to any Publisher? - Quora",
    "tags": [
        "Novel Writing",
        "Book Publishing",
        "Publishing",
        "Novels",
        "Writing Advice",
        "Writing",
        "Books"
    ],
    "response": [
        {
            "author_info": {
                "name": "Tina Kapoor",
                "href": "/profile/Tina-Kapoor-44"
            },
            "answer_text": "Commercial publishers these days are not taking a particular interest in publishing the work of new authors. They still prefer to stick to established writers who have already garnered a respect in the industry. This does not mean that new budding authors do not stand a chance. There is always the option of self-publishingyour work instead of waiting to be approved by a publisher. Mentioned below are the reasons that state as to why you should self-publish your book instead of going to an established author. 1. You have the complete ownership over your book, you and only you are responsible for the book you write and publish. 2. The entire profit that you earn through your self-published work is yours. If you go to a publisher to get your book published he will keep most of the profits for himself. When you self-publish everything that is earned through the book comes to you. 3.When you know that the market is not too huge, it is best to self-publish the book instead of relying on a publisher. There is no point spending a large sum of money for a market which is very small. I would suggest you to get in touch with BecomeShakespeare publishing company, They can help with all the things like editing, book cover design, book promotions. ",
            "date": "Answered April 27, 2020",
            "views": "63",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Mosiur Rehman",
                "href": "/profile/Mosiur-Rehman"
            },
            "answer_text": "You can follow the submission process on any publisher’s page but before that you should decide whether you want to retain your copyright or not. If you want the copyright in your name, then its better to self publish or you can try searching any traditional publisher who would be interested to publish your book but in that case you might not have the right to retain the copyright in your name and it can be more expensive if you are in India. Or you can self publish with a publisher who provides better packages and plans. ",
            "date": "Answered May 9, 2019",
            "views": "56",
            "upvotes": "0"
        }
    ]
}