{
    "title": "I have heard many times that there is a fine line between genius and insanity, but is there really? It must be a very thin line. - Quora",
    "tags": [
        "Insanity (fitness regime)",
        "Genius and Geniuses",
        "Mental Illness"
    ],
    "response": [
        {
            "author_info": {
                "name": "James Saker",
                "href": "/profile/James-Saker-1"
            },
            "answer_text": "I think that, in the words of Norman Bates, “We all go a little mad sometimes.” I am a highly gifted teenager (top 0.025% in maths and highly intelligent in other academic areas), and, unfortunately, know very few people in this group of people other than myself. However, I can confirm that I, upon occasion, do go a little insane. I find myself debating things with myself, and I get far more angry with my mistakes than others tend to. I do not go blind with rage, or anything like that, but I do get very excited about things which are boring. And I’m not talking about things like Shakespeare, which some people love and some hate. I’m talking about elastic bands, or other little items, and then I conjure up a load of ridiculous ideas, some mathematical, some inventive, about these. I have sometimes tried getting into this state, but it is near impossible when you are consciously doing it. It is NOT like a trance: you could get out if you wanted, but you just don’t want to, as it is so interesting (it is like a second mind, sometimes). I have met two other people whom I may describe as ‘genius’, and these would be in my top 3 (alongside myself) in the most ‘insane’ people. One is a musical/mathematical genius, and the other mathematical. The former goes mad with rage when he hears Mozart (who is apparently the ‘Knock knock joke of classical musicians’), and tried to persuade me to move to Soviet Russia (in spite of its being destroyed before we were born). The other, whom I have only met once, was so engulfed by (rather simple, for him) mathematics, he wouldn’t answer, or, perhaps, even hear me, when we were having a conversation. I think that one thing that makes a genius a genius is their refusal to care about what others are saying, if they are thinking hard - I have been working on complex algorithms in DT lessons, for example, and frequently don't call ‘yes’ when a teacher is reading the register. So, there is sort of a line between genius and insanity. It is like a gate with a guard, which you can go through at some times, but at others not. ",
            "date": "Answered July 26, 2016",
            "views": "16",
            "upvotes": " View 11 Upvoters",
            "upvoters": [
                {
                    "user_id": "Quế Phương Cao",
                    "user_href": "/profile/Quế-Phương-Cao"
                },
                {
                    "user_id": "Stanley Friend",
                    "user_href": "/profile/Stanley-Friend-2"
                },
                {
                    "user_id": "Higgs Boson",
                    "user_href": "/profile/Higgs-Boson-35"
                },
                {
                    "user_id": "Ian Happy",
                    "user_href": "/profile/Ian-Happy"
                },
                {
                    "user_id": "Mike Euler",
                    "user_href": "/profile/Mike-Euler"
                },
                {
                    "user_id": "Fish Ghoti",
                    "user_href": "/profile/Fish-Ghoti"
                },
                {
                    "user_id": "Youd Like Me",
                    "user_href": "/profile/Youd-Like-Me"
                },
                {
                    "user_id": "Mllk",
                    "user_href": "/profile/Mllk"
                },
                {
                    "user_id": "Trevor Phillips",
                    "user_href": "/profile/Trevor-Phillips-47"
                },
                {
                    "user_id": "Michael Townley",
                    "user_href": "/profile/Michael-Townley-7"
                }
            ]
        },
        {
            "author_info": {
                "name": "Marcus Geduld",
                "href": "/profile/Marcus-Geduld"
            },
            "answer_text": "This is generally a problem in movies but not in real life. Real mental illness tends to be pretty obvious and pretty debilitating. Mentally ill people typically have tremendous difficulty with things that are relatively easy for people who aren’t sick. They have trouble telling voices in their heads from the voices of real people talking to them; they have a hard time resisting self-medicating; they have terrible impulse control; etc. Someone can be both a genius and mentally ill. There are also lots of mentally-ill people who aren’t geniuses and lots of geniuses who aren’t mentally ill. ",
            "date": "Answered December 2, 2018",
            "views": "14",
            "upvotes": " View 13 Upvoters",
            "upvoters": [
                {
                    "user_id": "Denise James",
                    "user_href": "/profile/Denise-James-111"
                },
                {
                    "user_id": "Dimitrij Maslov",
                    "user_href": "/profile/Dimitrij-Maslov"
                },
                {
                    "user_id": "Kwami J.M",
                    "user_href": "/profile/Kwami-J-M"
                },
                {
                    "user_id": "Pravin Perumal",
                    "user_href": "/profile/Pravin-Perumal"
                },
                {
                    "user_id": "Suraj P Singh",
                    "user_href": "/profile/सूरज-प्रकाश-सिंह-Suraj-P-Singh"
                },
                {
                    "user_id": "Vinay Shankar",
                    "user_href": "/profile/Vinay-Shankar-13"
                },
                {
                    "user_id": "Alexei Trebunski",
                    "user_href": "/profile/Alexei-Trebunski"
                },
                {
                    "user_id": "Gaurav Ojha",
                    "user_href": "/profile/Gaurav-Ojha-8"
                },
                {
                    "user_id": "Edward Elric",
                    "user_href": "/profile/Edward-Elric-225"
                },
                {
                    "user_id": "Sullivan Wenger",
                    "user_href": "/profile/Sullivan-Wenger"
                }
            ]
        }
    ]
}