{
    "title": "I have published 100 books on Amazon Kindle but still not a single one is sold. What is the reason? - Quora",
    "tags": [
        "Amazon Kindle (product)",
        "eBooks",
        "Amazon (company)",
        "Books"
    ],
    "response": [
        {
            "author_info": {
                "name": "Andrew Chapman",
                "href": "/profile/Andrew-Chapman-75"
            },
            "answer_text": "This must be a spam question; otherwise, why post as anonymous? Doing so only makes it impossible for us to find your books on Amazon to answer you usefully. Plus, having met, known, worked with, coached, taught, and otherwise interacted with more than a thousand writers and authors, I’ve never once met one who’s written a hundred books and had no sales. So, to put it succinctly, your question smells like bullshit. My guess is, you’ve published perhaps three books on Amazon Kindle with no sales. And then for whatever reason, you feel the need to inflate that to a ridiculous number. Last, to whatever extent you’re genuine — exaggerating or not — then your question itself does point to two likely reasons: Your remaining anonymous means you’re hiding. How can you effectively promote your books if you’re afraid to even share info here on Quora? Hiding ≠ sales success.Asking this question without providing any relevant and helpful details indicates poor thinking skills, which could be reflected in your books, their titles, their covers, and/or their descriptions on Amazon — any of which could be killing sales.Post additional details for us to help, or stop wasting people’s time. [Answered: I have published 100 books on Amazon Kindle but still not a single one is sold. What is the reason?] ",
            "date": "Answered January 20, 2020",
            "views": "86",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Ugochi Igidiogu",
                    "user_href": "/profile/Ugochi-Igidiogu"
                },
                {
                    "user_id": "Lynda Filler",
                    "user_href": "/profile/Lynda-Filler"
                },
                {
                    "user_id": "Elizabeth Denny",
                    "user_href": "/profile/Elizabeth-Denny-9"
                },
                {
                    "user_id": "Laura DeLauder",
                    "user_href": "/profile/Laura-DeLauder"
                }
            ]
        },
        {
            "author_info": {
                "name": "Reba Schneider",
                "href": "/profile/Reba-Schneider-1"
            },
            "answer_text": "I agree with the answers that say marketing is needed to reach potential readers. But I have to ask why on earth you would continue to publish, reaching 100 books, without changing your strategy? If your strategy is simply to get the books published and nothing else, you've seen that doesn't get you readers or sales. If you had everything written in advance, these almost have to be short stories or nonfiction booklets. There's a ton of advice on Quora from self-published authors and from editors, book designers and book publishers. Do some more reading on Quora, and then ask some targeted questions with more details. If you've written 100 of anything, you should know you can pack a lot in the 250 characters Quora allows for a question. I notice you asked this anonymously; no one can offer any useful help if you aren't willing to offer so much as your name. ",
            "date": "Answered October 6, 2019",
            "views": "42",
            "upvotes": " View 14 Upvoters",
            "upvoters": [
                {
                    "user_id": "Elizabeth Denny",
                    "user_href": "/profile/Elizabeth-Denny-9"
                },
                {
                    "user_id": "Ambresh Chowdekar",
                    "user_href": "/profile/Ambresh-Chowdekar"
                },
                {
                    "user_id": "Marc Bedard",
                    "user_href": "/profile/Marc-Bedard-5"
                },
                {
                    "user_id": "Kara Middleton",
                    "user_href": "/profile/Kara-Middleton-6"
                },
                {
                    "user_id": "Mark Lewis",
                    "user_href": "/profile/Mark-Lewis-264"
                },
                {
                    "user_id": "Sharon Sims",
                    "user_href": "/profile/Sharon-Sims-11"
                },
                {
                    "user_id": "Miralee Ferrell",
                    "user_href": "/profile/Miralee-Ferrell"
                },
                {
                    "user_id": "Choon-Ho Yoon",
                    "user_href": "/profile/Choon-Ho-Yoon-1"
                },
                {
                    "user_id": "Clare Celea",
                    "user_href": "/profile/Clare-Celea"
                },
                {
                    "user_id": "Kristin Annexstad",
                    "user_href": "/profile/Kristin-Annexstad"
                }
            ]
        }
    ]
}