{
    "title": "I have a poor vocabulary even if I am reading a lot of books. What can I do? - Quora",
    "tags": [
        "English Language Vocabulary Development",
        "Reading Advice",
        "Advice About Books",
        "Vocabulary Development",
        "Vocabulary of the English Language",
        "Reading",
        "Books"
    ],
    "response": [
        {
            "author_info": {
                "name": "Marlon Regner",
                "href": "/profile/Marlon-Regner"
            },
            "answer_text": "I was a happy father when I saw my eldest daughter was a voracious reader going to library borrowing books and finishing it in a week's time. This father turned sour when the daughter showed her class composition and the result was disappointingly low for an \"avid reader\". So this father went through the composition to find out why. The words used were simple and were repeated several times in consecutive sentences. The sentence was always straight-forward with no variation in structure. Then I asked her how does she read a book. I then found out that there's something lacking in her reading. She is a browse reader meaning she breezes though a book to know the development of story and get to the ending. That's it! And this is what I told her. Reading a book should not be about knowing the story only, it is giving life to the story through your imagination. It is to go along with the story as it progresses. It is to get excited how the characters come out & develop. Appreciate the usage of words and the sentence construction. Find out the meaning of the words new to you and it would be best if she'll write it down. In short, go through the book as if your having your favorite pastries or dessert. You don't scoop it and gobble it up all at once. You let it stay in your mouth to savor the taste, right? Do the same thing in reading. It will definitely improve your vocabulary if you start writing. Answer some questions here in quora. Start a blog and just write. In this way, you can apply what you've learned from reading. ",
            "date": "Answered April 21, 2016",
            "views": "64",
            "upvotes": " View 35 Upvoters",
            "upvoters": [
                {
                    "user_id": "Barbara Mack",
                    "user_href": "/profile/Barbara-Mack-23"
                },
                {
                    "user_id": "Fitri Rozi",
                    "user_href": "/profile/Fitri-Rozi-1"
                },
                {
                    "user_id": "Sanket Singh",
                    "user_href": "/profile/Sanket-Singh-11"
                },
                {
                    "user_id": "Piotr Furga",
                    "user_href": "/profile/Piotr-Furga"
                },
                {
                    "user_id": "Matthew Thomas",
                    "user_href": "/profile/Matthew-Thomas-356"
                },
                {
                    "user_id": "Thanh Võ",
                    "user_href": "/profile/Thanh-Võ-5"
                },
                {
                    "user_id": "R.s",
                    "user_href": "/profile/R-s-1200"
                },
                {
                    "user_id": "Hizatul Akmah",
                    "user_href": "/profile/Hizatul-Akmah"
                },
                {
                    "user_id": "Susovan Chakraborty",
                    "user_href": "/profile/Susovan-Chakraborty-4"
                },
                {
                    "user_id": "Cheng Chong",
                    "user_href": "/profile/Cheng-Chong-6"
                }
            ]
        },
        {
            "author_info": {
                "name": "Julian Northbrook",
                "href": "/profile/Julian-Northbrook"
            },
            "answer_text": "Just reading is rarely enough to see much improvement. It will help. And yes, reading is a great way to build vocabulary, so do more of it. But *just* passively reading, and nothing else is very, very slow. So if that's all you're doing, then it's not surprising that you're still not improving much. Mastering a language comes down to two simple steps (whether reading, speaking, learning vocabulary, or anything else -- it's all the same). Learn the language you need with focused, intensive study (where you're aiming to grow your knowledge of English).Then automate it by actually using it (in just the same way you would your native language).Importantly, once you reach the intermediate stage, both steps are essential to really improve. Just studying by itself will only create conscious, academic knowledge.... passive exposure--like just reading--by itself is incredibly slow and ineffective for actually growing your English. Research shows that an optimal balance of these two things is best. Study opens the door to exposure being effective. This said, one thing I will point out: in my now 14 years of experience helping intermediate and over English learners to improve in English, it's very, very rare that \"more vocabulary\" is the answer to their problems. Even native speakers only use on average 2.5% of the words in English. So it's not about more, more words... but learning \"chunks\" of words (i.e. learning how the words you already have are combined to make native, native like blocks of English). Building fluency when speaking or reading is more about good chunk-knowledge than vocabulary. So I recommend you focus on that primarily. It would take too long to explain how here in this answer, but I made a free training that talks about chunking, as well as the kind of method and materials you need to improve in English quickly -- you can get it here. Hope that helps. Best,Julian Northbrook ",
            "date": "Answered September 28, 2020",
            "views": "892",
            "upvotes": " View 2 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Ngou Hoang Long",
                    "user_href": "/profile/Ngou-Hoang-Long"
                },
                {
                    "user_id": "Betty Rewit",
                    "user_href": "/profile/Betty-Rewit"
                }
            ]
        }
    ]
}