{
    "title": "I just watched a video about quantum entanglement and was wondering where we might find quantum entanglement in nature? - Quora",
    "tags": [
        "Quantum Entanglement",
        "Quantum Mechanics"
    ],
    "response": [
        {
            "author_info": {
                "name": "Bert Willke",
                "href": "/profile/Bert-Willke"
            },
            "answer_text": "Quantum entanglement first existed in the minds of Albert Einstein and Irwin Schrodinger; who coined the term in 1935, then spread throughout most of the physics community. It expresses the fact that throughout the timespan of quantum mechanical systems with only a few degrees of freedom, information is globally available that couldn't have been communicated at speeds ≤c. Nobody seems to have remembered in the succeeding 83 years that all fundamental physics, going back as least as far Newton, is deterministic: [1] the state of a solution at any moment determines the state at every moment throughout a solutions timespan. There's nothing to be communicated: any information present in a solution's state at some moment is present throughout the solution's timespan. The misconception persists because of a general lack of appreciation of the vast difference between time as we experience it and the undirected time of fundamental physics. Reversing t in any solution in fundamental physics gives an equally valid solution with time running the other way. That's not time as we experience it. We cannot affect our past, and we hold information only about our past. In 1926 Arthur Eddington called this vast asymmetry the Arrow of Time and in 1927 identified it with the direction our entropy increases. In 1865 Clausius defined entropy and reexpressed his and our universe's 2nd law of thermodynamics (Clausius 1850) in terms of it. The 2nd law can be stated as: the entropy of every closed system with enough degrees of freedom to yield unique well-defined entropy increases in the same direction in time. The Arrow of Time is universal in that sense. It also applies to open systems with sufficiently limited energy exchange with their surroundings, like rocks and people. Notice that the Arrow does not apply to systems with too few degrees of freedom to give unique well-defined entropy; such as the quantum mechanical systems that bothered Einstein: \"spooky action at a distance\", 1935; followed by Schrodinger's \"quantum entanglement\". It is true that in our universe any system with only a few degrees of freedom will be treated quantum mechanically, but it's their isolation: disentanglement if you like; from the surrounding entropic Arrow of Time that allows the underlying undirected time of fundamental physics to show through. For more details regarding entropy and the 2nd law in our universe, you might check my answer to What is the \"arrow of time\"? [1] For details about determinism in quantum mechanics, check my answer to What is the biggest mistake in the history of science? ",
            "date": "Updated July 5, 2019",
            "views": "192",
            "upvotes": " Answer requested by Alex Hartley",
            "upvoters": [
                {
                    "user_id": "David Decker",
                    "user_href": "/profile/David-Decker-15"
                }
            ]
        },
        {
            "author_info": {
                "name": "Jitendra Yadav",
                "href": "/profile/Jitendra-Yadav-289"
            },
            "answer_text": "Nature of Karma is the best example of Quantum entanglement. Our every act is somewhat interrelated to many ongoing events at various places throughout this cosmos, multiverse or many parallel universes which we get to know latter in the form of consequence payback by the nature. I believe “Hundredth Monkey Phenomenon” is also a form of quantum entanglement. This is applicable not only to monkeys but also to vegetation and humans as well. The 100th (Hundredth) Monkey Try staring at few individual people little far from back especially ladies (holds better receptive to sixth sense). Most probably they would respond by either looking back or try to adjust themselves more cautiously. This all may happen even without their knowledge but their subconscious mind plays the vital role in being sensitive. The sixth sense in women Telepathy is the another example which can be related to quantum entanglement. Mental Telepathy is Real Our own dreams could also be the consequence of quantum entanglement where quantum tunneling may play vital role. Who knows what is real, the characters in dream or the characters here within our sense? May be my reality would be the dream of similar entity within multiverse. Let me think of more examples…..add further if you get some. ",
            "date": "Answered October 8, 2018",
            "views": "132",
            "upvotes": " View 1 Upvoter"
        }
    ]
}