{
    "title": "I love the Stormlight Archive. Can anyone recommend a similar series? - Quora",
    "tags": [
        "The Stormlight Archive (book series)",
        "Love"
    ],
    "response": [
        {
            "author_info": {
                "name": "Julian Bushelli",
                "href": "/profile/Julian-Bushelli"
            },
            "answer_text": "Depends on what you like about it. The series that made me learn about Sanderson in the first place was the Wheel of Time series by Robert Jordan. It has wonderful world-building, and my absolute favourite magic system. However, it’s REALLY long, and some of the later books are a bit slow. I loved the series, though, and have re-read a bunch of the books several times over. Other than that…. well, the Powder Mage Trilogy by Brian McClellan is excellent, with a Sanderson-esque magic system(not as good as Sanderson’s, but still well made). This isn’t terribly surprising, as he’s one of Sanderson’s students. The world building and characters are extremely interesting, too, and I love the dichotomy of magic and firearms. Tad Williams is also good. His books are long and slow, but they’ve blown me away as much in terms of a “Sanderson Avalanche” as have Sanderson’s. His treatment of magic is on par with Sanderson and Jordan’s, the in the opposite direction: Whereas both Sanderson and Jordan explain their magic systems thoroughly before solving problems with them, Williams leaves magic as an arcane backdrop that is untouched by the protagonists. Of these three, I’d first recommend Williams’ Memory, Sorrow, and Thorn series if you like long detailed fantasy, then the Wheel of Time (if you’re willing to invest a ton of time: believe me, though, if you’re a fantasy lover it’s worth it), but if you want something that’s faster paced, go with Powder Mage. ",
            "date": "Answered November 1, 2017",
            "views": "4",
            "upvotes": " View 7 Upvoters",
            "upvoters": [
                {
                    "user_id": "Eric Anderson",
                    "user_href": "/profile/Eric-Anderson-1077"
                },
                {
                    "user_id": "Rayed Khan",
                    "user_href": "/profile/Rayed-Khan-9"
                },
                {
                    "user_id": "Fatih Akturk",
                    "user_href": "/profile/Fatih-Akturk-1"
                },
                {
                    "user_id": "Rishi P Nair",
                    "user_href": "/profile/Rishi-P-Nair"
                },
                {
                    "user_id": "Guojia La",
                    "user_href": "/profile/Guojia-La"
                },
                {
                    "user_id": "David Cardelli",
                    "user_href": "/profile/David-Cardelli-1"
                },
                {
                    "user_id": "Andreas Celaya",
                    "user_href": "/profile/Andreas-Celaya"
                }
            ]
        },
        {
            "author_info": {
                "name": "Charlotte Feyer",
                "href": "/profile/Charlotte-Feyer"
            },
            "answer_text": "I’ve only read the first book in the Stormlight Archive, and I don’t know whether I want to read all the others, since they’re soooo long and complicated, but I’ll try my best to give you recommendations. If you want a series with multiple character’s pov’s that will intertwine at some point, I can really recommend the A Darker Shade of Magic series by V.E. Schwab.  If you don’t mind reading something intended for a younger audience, but nonetheless as beautifully crafted (although it’s not entirely high fantasy), and with a world as rich and fantastical, I would recommend you read the Inkworld trilogy by Cornelia Funke. Now, keep in my mind that this is rather middle grade and it’s neither as dense nor as complicated as Brandon Sanderson.  If you want a high fantasy series that will leave you waiting for the next book even longer than Brandon Sanderson normally does, and that only follows one character’s point of view, but feels probably the most like the Stormlight Archive, I would highly recommend The Name of the Wind by Patrick Rothfuss.  [1] [2] [3] Footnotes[1] Image on pcdn.co[2] Image on blogspot.com[3] Image on dvspress.com",
            "date": "Answered July 4, 2019",
            "views": "14",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Eric Anderson",
                    "user_href": "/profile/Eric-Anderson-1077"
                },
                {
                    "user_id": "Stephen Duffy",
                    "user_href": "/profile/Stephen-Duffy-30"
                }
            ]
        }
    ]
}