{
    "title": "I tend to be drawn to and understand individuals with autism when I am a neurotypical. Could I possibly be on the spectrum? - Quora",
    "tags": [
        "Neurotypicals",
        "High-Functioning Autism",
        "Autism Awareness",
        "Neurotypicality",
        "Autism Spectrum Disorders",
        "Asperger Syndrome",
        "Autism"
    ],
    "response": [
        {
            "author_info": {
                "name": "Lance Berg",
                "href": "/profile/Lance-Berg-2"
            },
            "answer_text": "Well no, of course not, by definition. “The spectrum” is entirely off the “Neurotypical” portion of the map. However, you could be on the spectrum and not be neurotypical… you could be mistaken about being NT. Being drawn to people on the spectrum, however, is a trait found in many NT people. Possibly more so than among ASD people. Understanding people, even ones quite different from yourself, is a trait found in many NT people. Certainly more so than among ASD people. It is very common for people on the spectrum to have a “poor theory of mind” which makes it very difficult to understand what people are thinking and how they think. It is very common for NT people to have a good theory of mind, in fact, “PTOM” is quite rare among them… if someone has it, they many not be on the Spectrum but are probably non-NT in some other way. What prevents most NT from understanding ASD folks is a lack of familiarity and a tendency to generalize and make stereotypes. If you’re drawn to people on the spectrum and have become close to several (something unusual since only about 1 in 20 people ARE on the spectrum) then you’ve probably overcome those barriers. But it is possible that instead you’re someone who is drawn to people who are more like themselves, and who better understand people who happen to think more like they do themselves. So this doesn’t rule your hypothesis out. But the items listed in your question are by no means sufficient to do anything more than suggest this as one possible explanation, and not a high probability one.  If you want to take the word of someone with PTOM that is. ",
            "date": "Answered January 21, 2020",
            "views": "98",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Fenris Wolf",
                "href": "/profile/Fenris-Wolf-11"
            },
            "answer_text": "If you actually understand us? Definitely. While historically autistic minds have had a fairly decent understanding of neurotypical ones, vice versa isn’t true. The neurotypical mindset is absurdly hyperfocused upon only surface level features with no depth beyond that to speak of, this is why neurotypicals can get on the nerves of actually autistic people. I’ll explain. Autistic Person: “These neurotypicals are so loud and they gesticulate like rappers in heat, so I can’t talk to them as being overloaded makes me nonverbal.” Neurotypical: “So you see, ALL autistic people are COMPLETELY lacking in social skills and the desire to socialise. None of them CAN socialise even, with anyine… EVER! How horrible! Let’s cure them with deadly fecal transplants so they’ll be more like us! After all, we’re HEALTHY!” Autistic Person: “I’m feeling too much. I need to get out of here so I can introspectively process my emotions. Stupid empathy. Neurotypicals have it easy, they slap their hand over their mouth then they’ve forgotten about anything sad within ten minutes unless you remind them of it. They don’t have to process or deal with the hell of extreme empathy. The feelings can be so overwhelming sometimes that they’re painful and debilitating. Especially guilt.” Neurotypical: “Hey! That person didn’t slap their hand over their mouth to gesticulate their face! Now they’re just leaving! Because they aren’t like me this must mean they’re autistic, and that they lack Theory of Mind and empathy!” Autistic Person: “The ‘cure’ for autism is for neurotypicals to get their heads out of their very shallow bums and try to understand that we just function differently than they do, and that we have different needs. It would be nice if neurotypicals could tone down their volume and gesticulate less when interacting with us.” Neurotypical: “The best ‘CURE’ for autism is electric shock treatment more PAINFUL than what they allow to be used on prisoners of war in Guantanamo Bay! Ship them ALL off to the Judge Rotenberg Center! That’ll FIX them! It would be so NICE if autistic people could be assimilated to be JUST like us instead of… being so DIFFERENT and weird.” And so on… I mean, just look at the studies of Simon Baron-Cohen to realise how true this all is. Neurotypicals are genetically predisposed to fetishise and obsessively seek out verisimilitude. In general, autistic people can be far more accepting of differences. It might be the combination of empathy and open-mindedness but you’d be hard pressed to find a bigoted actually autistic person. If you do, you’ve found a misdiagnosed sociopath. This is depressingly common despite how they’re essentially our polar opposites. An autistic person will be quiet, introspective, empathetic, observant, and strangely wise beyond their years. Having known a lot of autistic people I know how true this is. But for neurotypicals we’ll always be “lower-functioning,” antisocial troglodytes because we can’t deal with how they overload us and they don’t understand why we shut down. A neurotypical that really understands autistic people is a highly improbable factor, were that true then we’d have seen one in the relevant scientific fields by now. I’m happy to tell you that if you do indeed truly understand actually autistic people then you have some measure of autism yourself. ",
            "date": "Answered January 15, 2020",
            "views": "1",
            "upvotes": " View 13 Upvoters",
            "upvoters": [
                {
                    "user_id": "Stuart Taylor",
                    "user_href": "/profile/Stuart-Taylor-132"
                },
                {
                    "user_id": "R M",
                    "user_href": "/profile/R-M-1-2"
                },
                {
                    "user_id": "Jennifer.",
                    "user_href": "/profile/Jennifer-298"
                },
                {
                    "user_id": "Lama Abdul",
                    "user_href": "/profile/Lama-Abdul-4"
                },
                {
                    "user_id": "Andrea Lord",
                    "user_href": "/profile/Andrea-Lord-12"
                },
                {
                    "user_id": "Hassan Khatoun",
                    "user_href": "/profile/Hassan-Khatoun"
                },
                {
                    "user_id": "Peach Elizabeth",
                    "user_href": "/profile/Peach-Elizabeth"
                },
                {
                    "user_id": "A. E. Irvin",
                    "user_href": "/profile/A-E-Irvin"
                },
                {
                    "user_id": "David Benisch",
                    "user_href": "/profile/David-Benisch"
                },
                {
                    "user_id": "Vincent James",
                    "user_href": "/profile/Vincent-James-78"
                }
            ]
        }
    ]
}