{
    "title": "I thought the end (final third) of Secret Garden was terrible. Do others share this view? - Quora",
    "tags": [
        "The Secret Garden (1911 book)",
        "Children's and Young Adult Books"
    ],
    "response": [
        {
            "author_info": {
                "name": "Joan Hoffman",
                "href": "/profile/Joan-Hoffman-1"
            },
            "answer_text": "The only part that disappointed me was the very end, where Archibald saw Colin, healthy, and they walked off happily together. I expected he would at least apologize for not being much of a father.  But I had wondered a couple of times before why Colin didn't seem to resent his father. So maybe they did have more of a relationship, and the author just didn't choose to describe it. Or maybe she was just done with the part of the story she enjoyed writing, and decided to end it quickly. (The story was first told in serial form in a magazine. She might have been on deadline.) But overall I enjoyed the book for what it was... a positive, hopeful story. It's a children's book, and I saw it as essentially a fable. Fables are about plot and moral, and don't usually provide well-rounded characters. I happily suspend disbelief when reading one, and I'm not at all surprised when there's magic. In this book \"magic\" is a little different... it's positive energy that's manifested in the garden but not limited there. The magic even reached Archibald far away and brought him back home for the aforementioned abrupt ending. ",
            "date": "Answered December 1, 2013",
            "views": "736",
            "upvotes": " View 3 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Poonam Yadav",
                    "user_href": "/profile/Poonam-Yadav-702"
                },
                {
                    "user_id": "Susie Downing",
                    "user_href": "/profile/Susie-Downing"
                },
                {
                    "user_id": "Marc Bodnick",
                    "user_href": "/profile/Marc-Bodnick"
                }
            ]
        },
        {
            "author_info": {
                "name": "Marc Bodnick",
                "href": "/profile/Marc-Bodnick"
            },
            "answer_text": "I felt this way. The first 50-60% of the book was awesome. In the second half, the concept of \"magic\" hijacked the story and made the story implausible and unappealing. I really didn't like: That Archibald Craven somehow suddenly had an emotional change of heart while traveling in Europe. Suddenly, for no good reason, he started to feel better about life and his son. Made no sense.The climax where Archibald sees his son was abrupt and not interesting.",
            "date": "Answered November 24, 2013",
            "views": "691",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Poonam Yadav",
                    "user_href": "/profile/Poonam-Yadav-702"
                },
                {
                    "user_id": "Susie Downing",
                    "user_href": "/profile/Susie-Downing"
                },
                {
                    "user_id": "Shane Ryoo",
                    "user_href": "/profile/Shane-Ryoo"
                },
                {
                    "user_id": "Carolyn Cho",
                    "user_href": "/profile/Carolyn-Cho"
                }
            ]
        }
    ]
}