{
    "title": "I took college level algebra years ago and want to study linear algebra. What specific books should I start with? - Quora",
    "tags": [
        "Linear Algebra",
        "Book Recommendations",
        "Algebra"
    ],
    "response": [
        {
            "author_info": {
                "name": "Tyler Scott",
                "href": "/profile/Tyler-Scott-111"
            },
            "answer_text": "I have two answers for if you want an applied view of things or a pure view of things. For applied linear algebra, I recommend something along the lines of Linear Algebra with Applications by David C. Lay or Introduction to Linear Algebra by Gilbert Strang. Strang even has videos on YouTube from MIT OpenCourseware. For higher level books, there are a number out there on computational linear algebra and matrix theory. I'm more biased towards pure mathematics, so I'm not too knowledgeable on that. For pure linear algebra, I honestly recommend you trying out group theory first. A lot of what you learn in group theory can be applied to linear algebra but just expanded upon. There's a nice book called Groups, Matrices, and Vector Spaces: A Group Theoretic Approach to Linear Algebra by James Carrell that covers a standard undergraduate course in group theory in tandem with a standard undergraduate course in more theoretical linear algebra. If you want solely linear algebra, though, two books that are nice for that are Linear Algebra Done Right by Sheldon Axler (even though it has a small calculus prerequisite but from what I've seen, the calculus stuff can be skipped) and Linear Algebra by Hoffman and Kunze (which is a bit more mathematically mature than Axler's book). Linear algebra is a beautiful subject, and I hope you enjoy learning it! ",
            "date": "Answered December 27, 2018",
            "views": "268",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Martin Hauser",
                    "user_href": "/profile/Martin-Hauser"
                }
            ]
        },
        {
            "author_info": {
                "name": "Nick Cooney",
                "href": "/profile/Nick-Cooney-2"
            },
            "answer_text": "I have not had the opportunity to read many linear algebra books, but I would recommend \"Linear Algebra\" by Georgi E. Shilov. It is not expensive and does a good job of covering the subject. It is available on Amazon here: Linear Algebra (Dover Books on Mathematics): Georgi E. Shilov: 9780486635187: Amazon.com: Books I would also suggest watching 3Blue1Brown's YouTube series on linear algebra. The series provides great visual explanations of topics through eigenvectors and abstract vector spaces. The series is available here: Essence of linear algebra - YouTube Finally, I understand Khan Academy has resources for learning linear algebra. I have not yet had the opportunity to explore this option, so I cannot speak to the quality. Still, I will include the link here: Linear Algebra | Khan Academy Good luck on your linear algebra adventures! ",
            "date": "Answered December 20, 2018",
            "views": "59",
            "upvotes": "0"
        }
    ]
}