{
    "title": "I want to become an avid reader. What are some novels which will pique my interest into books? - Quora",
    "tags": [
        "Novels",
        "Reading",
        "Book Recommendations",
        "Books"
    ],
    "response": [
        {
            "author_info": {
                "name": "Herb Martin",
                "href": "/profile/Herb-Martin"
            },
            "answer_text": "I want to become an avid reader. What are some novels which will pique my interest into books?We really cannot tell you what YOU will find interesting, and we don’t even know anything about your level of reading skill. Here are a few ideas: If you aren’t very advanced as a reader you might try the Harry Potter series, in order as the books start easier and work up as Harry and his friends age. I used them to learn to read in Spanish in a couple of months (along with vocabulary study.) By 2–3 months my reading was entirely fluent. Also, at a more advanced level than the earlier Harry Potter books, I then found Dan Brown’s books such as “The DaVinci Code”. If you like science fiction, read pretty much anything by Robert Heinlein or Pohl Anderson. If your reading level isn’t very advance read “The Hardy Boys” or “Nancy Drew” mysteries. Add something about your interests, age, and more importantly your reading level. Historical fiction can also be quite interesting. ",
            "date": "Answered July 25, 2017",
            "views": "333",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Tim Furgerson",
                    "user_href": "/profile/Tim-Furgerson"
                },
                {
                    "user_id": "Ismail Ibrahim Hasbany",
                    "user_href": "/profile/Ismail-Ibrahim-Hasbany"
                },
                {
                    "user_id": "Archana Shyam",
                    "user_href": "/profile/Archana-Shyam-4"
                }
            ]
        },
        {
            "author_info": {
                "name": "Thomas Musselman",
                "href": "/profile/Thomas-Musselman"
            },
            "answer_text": "We would need to know more about: age, gender, interests, sophistication level, other books you liked, etc. In increasing levels of difficulty try: “Oliver Twist”, “Tom Jones”, “Emma”, “The Golden Bowl”, “The Color Purple”, “Invisible Man” (Ellison), “100 Years of Solitude”, “The French Lieutenant’s Woman”, “the Unbearable Lightness of Being”, “The Brothers Karamazov”. There are also many classic genre novels I did not list. ",
            "date": "Answered July 25, 2017",
            "views": "72",
            "upvotes": "0"
        }
    ]
}