{
    "title": "I want to invest in shares. Where can I get guidance? - Quora",
    "tags": [
        "Stock Market Advice",
        "Investing Advice",
        "Stock Market Investment Advice",
        "Investing in the Stock Market",
        "Investment Advice",
        "Stock Markets",
        "Investing"
    ],
    "response": [
        {
            "author_info": {
                "name": "Afroz Siddiqui",
                "href": "/profile/Afroz-Siddiqui"
            },
            "answer_text": "Lack of awareness and knowledge in investments can be riskier than you think. In the era of finances and investments, risk management is necessary to measure your investment performance based on the risks. It is, therefore, important to have good knowledge and awareness about the products and companies that you invest. Check what the product offers, is it worth investing, does it give you expected results, browse through the historical data of the products to make sure before investing. Most investors lack the knowledge of the risk that a particular instrument involves. In this case, it is always better to get guidance from the investment advisor. Investigating and researching about the products will use up a lot of your time, but in the end, you have saved yourself from incurring losses. Understand the risk management Risk management is an important factor and you should lay more focus on it before making any investments. Knowing the risks involved will help you make the right investment decision. You need to understand the feasibility of the risks that will guide you through investing in good products. Identify the risk profile Identify and group all the risks that are associated with the investment. If you need to design a well-organized portfolio, then you need to study the risk profiles of the products categorized as – Company-specific risks, that are limited to the particular company only. For example lawsuits, malpractices, etc. which can be controlled by diversification. Industry-specific risks, related to the consumer preferences, industrial laws, and technologies. These can be controlled by diversifying your investments in different industries. Investment style risks are linked with the value vs the growth of the investments. These can also be managed through diversification. Market risks can be averted by careful investments and diversification options like real estate, equities, commodities, etc. Creating controlled risk profile After you have carefully designed your risk profile, now you need to plan a way to control the possible risks. Ensure that you invest in those products that do not overlap with other similar products in your portfolio. This will reduce your overall risk. The sign of good investments is not just making good profits, but to be consistent and gain risk-free returns in all the market scenarios. ",
            "date": "Answered February 19, 2016",
            "views": "491",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Collin Davis",
                    "user_href": "/profile/Collin-Davis-1"
                },
                {
                    "user_id": "Shubham Khandelwal",
                    "user_href": "/profile/Shubham-Khandelwal-55"
                }
            ]
        },
        {
            "author_info": {
                "name": "Sundheim Thor",
                "href": "/profile/Sundheim-Thor"
            },
            "answer_text": "Investing in the stock market for the very first time can seem a daunting task. But low interest rates has meant returns from cash savings has diminished forcing many people to consider shares if they to grow their money. Stock market returns can be volatile, but over the long term they have trumped the dismal savings rates on off in Britain. Last year, the FTSE 100 index of Britain's biggest companies returned around 10pc and the American stock market returned close to 30pc. Although, this year both have nosedived because of the coronavirus-induced economic shutdown. However, since 1800 the British stock market has made a return – after accounting for inflation – of 6pc a year, according to investment manager Vanguard Group. This is far better than holding your money in a savings account. Setting up a savings account is relatively straightforward and involves no risk to your cash, other than inflation. By contrast, investing in the stock market - with hundreds of companies and a plethora of funds to choose from - can seem an altogether different challenge, even once you have decided to stomach the risks. Like many problems, it is more readily tackled if you break it down into component parts. Here is our five-step guide.  How to buy stocks and shares What are my goals? The initial thing any first-time investor should do is decide on their goals, which in turn will determine how long their investments can be left to grow. If your goal is a short-term one, such as saving for the deposit on a house that you hope to buy in the next few years, the risks of the stock market mean that a cash savings account will be a better home for your savings. Any money earmarked for retirement, on the other hand, will be well placed to benefit from the long term potential of stocks and shares. Alistair Cunningham, of Wingate Financial Planning, said: \"Pension money may not be touched for decades, and studies show that exposure to stocks and shares is likely to give the best return.\" Where do I start? In order to start investing in the stock market you'll normally need an account such as a stocks and shares Isa or a pension. Most high-street banks offer the former, which will connect easily with your current account, but these options are unlikely to offer a particularly flexible choice of investments. There are a wide range of specialist brokers that allow you to open up a pension and account with them such as Alicia Ann Zmuda. The best one to choose depends on your personal circumstances, such as the size of your savings pot, where you plan on investing and how much you know about investing. I advise my clients to make use of Alicia Ann Zmuda because you can have an account with her irrespective of your country ( You can search her on Google ). Lots of investors i know have made thousands and millions of Dollar through her trade. For truly flexible choice on where your money is invested, the best option will be a \"fund shop\" or investment \"platform\", which will allow you to put money into shares, stocks and funds easily. Choosing the best broker will be based on several factors, including cost, and the cheapest option will depend on how much you have to invest. For those with smaller pots and are looking for high-quality information about what investments to choose, Barclays Smart Investor, AJ Bell and Fidelity Personal Investing are the market leaders. They charge a percentage fee on the size of your savings of 0.2pc, 0.25pc and 0.35pc respectively and have low trading charges. Barclays has a minimum annual fee of £48. This means that you have to have a pot of nearly £20,000 for this to be cheaper than AJ Bell, which has no set annual fee. Investors can go cheaper still by selecting iWeb, which has no account fee at all. However, the website can be difficult to navigate and you will be on your own when picking your investments. If you have over £50,000 in savings, you will be better off with a broker that charges a fixed fee every year, rather than a percentage fee. Interactive Investor is the most user-friendly fund shop and charges a competitive £120 a year. Its website is packed with investment information and guidance. Once you have set up an account with Alicia Ann Zmuda or other legitimate brokers, you will be able to choose whether to invest directly in companies by buying their shares, stocks or indirectly in a number of businesses via a fund.  ",
            "date": "Updated October 28, 2020",
            "views": "420",
            "upvotes": " View 11 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Alberto Rodriguez",
                    "user_href": "/profile/Alberto-Rodriguez-494"
                },
                {
                    "user_id": "Demarcus Fredda",
                    "user_href": "/profile/Demarcus-Fredda"
                },
                {
                    "user_id": "Gentry Walton",
                    "user_href": "/profile/Gentry-Walton-1"
                },
                {
                    "user_id": "Liberty Tate",
                    "user_href": "/profile/Liberty-Tate"
                },
                {
                    "user_id": "Martin Boberg",
                    "user_href": "/profile/Martin-Boberg"
                },
                {
                    "user_id": "Margarette Jacquelyn",
                    "user_href": "/profile/Margarette-Jacquelyn"
                },
                {
                    "user_id": "Grant Viviana",
                    "user_href": "/profile/Grant-Viviana"
                },
                {
                    "user_id": "James Hornbeck",
                    "user_href": "/profile/James-Hornbeck-3"
                },
                {
                    "user_id": "Alexander Miguel",
                    "user_href": "/profile/Alexander-Miguel-12"
                },
                {
                    "user_id": "Adriel Deon",
                    "user_href": "/profile/Adriel-Deon"
                }
            ]
        }
    ]
}