{
    "title": "I watched a mini series on TV, and shortly after I read a book with virtually the exact same plot. It’s not the same writer. Is there someone I should tell? - Quora",
    "tags": [
        "Advice About Books",
        "Writers and Authors",
        "Reading",
        "Television",
        "Writing",
        "Television Series",
        "Books"
    ],
    "response": [
        {
            "author_info": {
                "name": "Will Greenway",
                "href": "/profile/Will-Greenway-1"
            },
            "answer_text": "I watched a mini series on TV, and shortly after I read a book with virtually the exact same plot. It’s not the same writer. Is there someone I should tell? TV and Movie treatments of stories and books are RARELY written by the same author. In fact, it’s rare to even be able catch the brief flash where credit is given to the author usually something like ‘inspired by the work of xxx’. The titles get changes and all manner of stuff happens. Every once in a while something will outright get stolen from an author’s work and not even a nod given. Because visual production and written works are so different, it’s REALLY tough to sue. The likeness of a character to an actor’s portrayal… think about that… how do you prove it in court? If you saw it… likely the author heard about it. Either they were paid for their concept or they weren’t. As a third party… you really have no skin in the game. Best to just move on to the next bit of entertainment.  ",
            "date": "Answered June 18, 2020",
            "views": "323",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Bobbie Johnson",
                    "user_href": "/profile/Bobbie-Johnson-70"
                }
            ]
        },
        {
            "author_info": {
                "name": "Risa Lockwood",
                "href": "/profile/Risa-Lockwood"
            },
            "answer_text": "I went through with a similar thing with THREE separate stories that had very similar plots to the book. The film Passengers, the one about the people on a sleeper ship who wake up earlier than they should have, is similar to a book called Across the Universe, By Beth Revis, the only difference is the book has younger characters in it. The film The Island, about clones used for organ harvest is similar to a book called The House of the Scorpion, by Nancy farmer, the difference is the setting, and the fact that, barring the main clone, the rest of them are essentially vegetables. That film, The Shape of Water, Is similar to a very obscure short film called, The Space Between Us, not to be confused with that other film of the same name about the kid born on Mars. In other words, many stories have similar plots, but the production method is different, and may just be a coincidence. ",
            "date": "Answered June 22, 2020",
            "views": "20",
            "upvotes": "0"
        }
    ]
}