{
    "title": "I want to learn piano. Which books shoud I read? - Quora",
    "tags": [
        "Learning Piano",
        "Book Recommendations",
        "Books"
    ],
    "response": [
        {
            "author_info": {
                "name": "Jan Hajic",
                "href": "/profile/Jan-Hajic"
            },
            "answer_text": "My $0.02: no book is going to make you able to play the piano well without at least some form of hands-on instruction. Learning the piano without guidance from a teacher is not going to get you far. Forget about skirting this and get a (good) teacher. No one has yet come up with a teacher-less way of teaching music. (Maybe the Yousician company is onto something, but what they do is also backed up by a bunch of music teachers they hired to design curricula… don’t know.) Complement their instructions with a book, why not — but there is a lot of room for misinterpreting written instructions if you don’t already have the context of actually being able to play the instrument; before you can do that, this context is provided through the experience of the teacher. You’re quite likely to get stuck in a dead end without a teacher. Especially with respect to technique, unlearning bad habits that block progress is a lot more difficult than shaping good habits right away, even if it seems like unnecessary work. Even if all you do is some easy accompaniments for bands, you’ll still need endurance, and if your hands are not working like they should be, you’ll run into health issues sooner or later. ",
            "date": "Answered March 10, 2018",
            "views": "18",
            "upvotes": " View 5 Upvoters",
            "upvoters": [
                {
                    "user_id": "Piyali Mandal",
                    "user_href": "/profile/Piyali-Mandal-6"
                },
                {
                    "user_id": "Mary Hannah",
                    "user_href": "/profile/Mary-Hannah-22"
                },
                {
                    "user_id": "Edward Lemming",
                    "user_href": "/profile/Edward-Lemming"
                },
                {
                    "user_id": "Leeanne Innes",
                    "user_href": "/profile/Leeanne-Innes"
                },
                {
                    "user_id": "Luke Yoder",
                    "user_href": "/profile/Luke-Yoder-9"
                }
            ]
        },
        {
            "author_info": {
                "name": "Virginia Jenkins",
                "href": "/profile/Virginia-Jenkins-9"
            },
            "answer_text": "Hope these will be useful, Alfred’s Basic Adult All-in-One Piano Course: The Alfred’s collection of piano books is one of the most popular among adult students because it’s easy and enjoyable to use. Each section covers a piano lesson, musical theory, and technical information about the elements of music and the piano itself. This is the most highly recommended adult piano book on the market right now! John Thompson’s Easiest Piano Course: Thompson’s Easiest Piano Course is not an overstatement: this series of piano lessons is perfect for beginners. Thompson introduces each note in his book one at a time and reinforces his lessons with colorful illustrations and characters. This lesson book, complete with writing and reading assignments, is a great supplemental resource when working with a professional teacher one-on-one. The Classic Piano Course Book: Written as a series of piano lesson books, the Classic Piano Course Book starts at the beginning with notes, names, pitches and keys. From the first book in this series, you’ll be guided carefully through the practical exercises, as well as theoretical learning. Beautiful classical songs, like “Swan Lake” and “Fur Elise” are included, which will motivate you to complete the lesson! There’s no better feeling than achieving the ability to play a beautiful piece of music. Understanding classical music fundamentals will also help you to play different genres of piano music, and a piano teacher will be able to show you exactly how these principles apply. Bastien Piano for Adults: The Bastien Piano for Adults lesson book was truly designed with adult learners in mind. Not only does the sample music include songs from all kinds of musical genres and eras — jazz, blues, folk, ragtime and classical — but the lessons are more progressive than children’s versions, at least in terms of musical theory. In addition to the text, the Bastien book includes a CD accompaniment to the lessons. The CD will help you gauge your understanding of tempo and timing, but it still can’t replace the private teacher’s pinpointed guidance. ",
            "date": "Answered March 10, 2018",
            "views": "951",
            "upvotes": "0"
        }
    ]
}