{
    "title": "I want to learn how to invest in stocks. Where do I start? - Quora",
    "tags": [
        "Stock Market Advice",
        "Investing Advice",
        "Stock Market Investment Advice",
        "Investment Strategies",
        "Investing in the Stock Market",
        "Investment Advice",
        "Stocks (finance)",
        "Stock Markets",
        "Investing"
    ],
    "response": [
        {
            "author_info": {
                "name": "Gerry Petencin",
                "href": "/profile/Gerry-Petencin"
            },
            "answer_text": "Google \"tulip mania\".  If you understand that Manias are very REAL you'll be able to avoid some of the foolish mistakes investors make.  Also Google \"ponzi schemes\"  (see Bernie Madoff).  Then focus on Value Investing,  get to know the concept that Price does NOT equal Value.  Realize that a share of stock can be regarded as a small company (since it's a share of a company).  Would you pay $20 for a company that earns $1 (earns = profits, sort of) or $300 for a company that earns nothing?  (like see Tesla stock).  Read \"accounting for dummies\" for some fundamentals.  And know that people, in general, really are wired to buy high (it's exciting) and sell low  (I'm scared). \"Going up\" will always stop and so will \"going down\", unfortunately sometimes at Zero!  Read Buffet, not all of the Intelligent Investor but google what DCF means.  Good Luck! ",
            "date": "Answered February 26, 2016",
            "views": "192",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Sam Kamani",
                "href": "/profile/Sam-Kamani"
            },
            "answer_text": "The best way to learn something is by doing it. My advice is start small. If you are in a country like New Zealand, Australia or most OECD counties, you don't need a share broker, you can go online and buy and sell shares yourself. Rule number 1. Invest in companies that are stable and you think will do well in future. Rule number 2, Do not become a day trader, look for companies that you can see will be there in 10, 15 or 25 years time.  You can read all about how to ride a bike, but unless you go out and do it, you haven't learnt much. ",
            "date": "Answered February 27, 2016",
            "views": "454",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Robert Gitiche",
                    "user_href": "/profile/Robert-Gitiche"
                },
                {
                    "user_id": "Gerry Petencin",
                    "user_href": "/profile/Gerry-Petencin"
                },
                {
                    "user_id": "Sharat Manda",
                    "user_href": "/profile/Sharat-Manda"
                },
                {
                    "user_id": "Piotr Piórkowski",
                    "user_href": "/profile/Piotr-Piórkowski"
                }
            ]
        }
    ]
}