{
    "title": "I want to start investing in stocks. Do you have any book advice? I am 19. - Quora",
    "tags": [
        "Stock Market Advice",
        "Investing Advice",
        "Investing in the Stock Market",
        "Investment Advice",
        "Stocks (finance)",
        "Stock Markets",
        "Book Recommendations",
        "Investing",
        "Books"
    ],
    "response": [
        {
            "author_info": {
                "name": "Thomas Bradley",
                "href": "/profile/Thomas-Bradley-121"
            },
            "answer_text": "Benjamin Graham’s book is the Bible. To understand it may take some supplemental studying as well. Understanding it is the key to deciphering a companies value. If you can do that to some degree, then start looking(or do both together as a study exercise) for a company that is an area you have a major interest in. Don’t look for a heavy industry if you are interested in agricultural. Agriculture has numerous areas to invest and you would study those heavier. When you do invest, invest in owning a company, not in a stock. If you wish to invest, you are long term and expect to hold the stock for a long time. If you wish to follow current trends, that is day trading to some degree and it is not investing, it is more of a fast paced action that reacts to current events. Such as covid. Long term, people eat, sleep, and do things. They always will and companies will always exist to serve them. Investing involves determining which companies do it best and plan for the future the best. I won’t claim credit for this philosophy, it is just derived from Warren Buffett and his philosophy that you can view in a variety of areas if you wish. When you’ve seen all the YouTube videos with him for the last year or so, it can refine your approach to investing. Use it as a foundation and you can succeed nicely, although he suggests index funds for the investor that is unwilling to put the effort into studying the basics. ",
            "date": "Answered June 17, 2020",
            "views": "67",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "J.R. Calcaterra",
                "href": "/profile/J-R-Calcaterra"
            },
            "answer_text": " I want to start investing in stocks. Do you have any book advice? I am 19. There is quite a bit one needs to know to be successful and consistently profitable investing and trading any asset class let alone stocks. If you understand supply and demand and can train your eyes to see it on any chart on any time frame you’ll have an advantage over your competition. Remember, to be successful at doing the business of making money with money you have to prepare yourself to work in a business where you in competition with everyone else but yourself, also remember that you are the only one making you do this business and the only thing you will have control of in the live markets is how much money you don’t lose. I recommend you start off slow and build on success. You don’t need to be in any hurry to rush into the live market it is always going to be there waiting to pay you. Here’s a list of good books for any raw beginner stock trader. WARNING: If you’re considering trying to trade stocks intraday and you are a brand new raw beginner and you wish to save yourself a lot of time, stress and money read anyone of these books first: Day Trading IS Day Gambling By: Mar KetmakerDeath by Day Trading By: Zordi CobreDay Trading Myths Revealed By: Richard ChristopherThe Truth about Day Trading By: Joe SoldiFOR STOCK TRADING BEGINNERS How to Trade Stocks Online on a $500 account By: Giuseppe PicciuliSimple Daily Chart Stock Trading Method By: J. GerutoHow to make Consistent Profits in the Stock Market By: G. Scuti10 Secrets to Get Rich from Stock Trading By: Giuseppe ScutiHow to make a Full Time Income Trading Stocks Online By: J. MoriacoSwing Trading Stocks using the End of Day Method By: Slacker TraderHow to Swing Trade Stocks for High Profits By: Joe MonnaieSimple & Easy Stock Trading Strategies By: Josef FluseHow to make Easy Money Position Trading Stocks By: Slacker TraderTrading Stocks Online By: Joseph MonetaNOTE: None of the above list are available in PDF form to my knowledge so be careful of phishing scams to get your credit card information, if it says “free PDF” beware of giving out any of your personal information. Check out my Quora blog Stock Trading Blogger (Stock Trading Blogger) and click on my profile to find out where else you can find me. I hope this helps Good luck with your trading and investing and remember: Trade smart…OR JUST DON’T TRADE! Stock Trading Blogger ",
            "date": "Answered June 22, 2020",
            "views": "303",
            "upvotes": " View Sharers"
        }
    ]
}