{
    "title": "I want to read books but I am constantly getting distracted, what can I do to focus? - Quora",
    "tags": [
        "Focusing and Concentrating",
        "Reading",
        "Book Recommendations",
        "Books"
    ],
    "response": [
        {
            "author_info": {
                "name": "Kelly Copeland",
                "href": "/profile/Kelly-Copeland-28"
            },
            "answer_text": "I remember feeling this 39 years ago, it was so frustrating. When I was in 9th grade we had to read the book Shane by Jack Schaefer. I remember putting aside my Sunday that week so I could read the entire book. I got comfortable in my bedroom and I read the first paragraph 20 times before I was so bored I gave up. I thought I was stupid because I couldn't, no matter how hard I tried, read Shane. I hated it! I remember going to class on Monday and copying other people's answers to the questions about the book. The good news is I love reading now and I have since I was in 10th grade just a short year after my experience with Shane. I had a super smart friend who read tons of books. You know the type, got straight A’s without even trying when I had to work my ass off to get a C. One day she asked me what my favourite book was. I told her I hated reading. She gave me the best advice. She said read about things you love. She also told me to use my imagination while I was reading. She told me to set the scenery, what the characters looked like, what they were wearing etc. She also said it helps when you read something you have an intrest in. This actually worked for me. She lent ne her copy of Flowers in the Attic by V.C. Andrews and I was hooked. I was so into this book I remember staying up almost all night to try and finish it. This lead me to other types of books as well. Another thing to try is short stories rather than a novel. It can be a lot less overwhelming than a 300 page book. Decide on a topic you like and Google “ short stories about…”. It's worth a try. Also, is there a movie you like that was adapted from a book? I think this could help jump start using you imagination. You'll already know what the scene and characters look like. I don't know how well this will work but it doesn't hurt to try it out. Remember…you are not stupid or incapable, you can do this! I hope my answer has been some help to you :) ♡ ",
            "date": "Answered February 26, 2017",
            "views": "174",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Hamit Goralı",
                    "user_href": "/profile/Hamit-Goralı"
                },
                {
                    "user_id": "Brandon Luco",
                    "user_href": "/profile/Brandon-Luco"
                },
                {
                    "user_id": "Rachel Rachielles",
                    "user_href": "/profile/Rachel-Rachielles"
                },
                {
                    "user_id": "Oluchi Alheri",
                    "user_href": "/profile/Oluchi-Alheri"
                }
            ]
        },
        {
            "author_info": {
                "name": "Preeti K",
                "href": "/profile/Preeti-K-14"
            },
            "answer_text": "There’s a wonderful quote by J.K Rowling, “If you don’t like to read, you haven’t found the right book.” So first things first, find the Right Book. The book that you’d rather be reading than do all other stuff, a story that’d keep you turning pages, and wouldn’t make you feel like you are wasting time. Now how do you go on finding the Right Book? Easy. Think of the genre. What do you like most? Horror? Fantasy? Romance? Mystery? Thriller? Sci-fi? Gothic? Or if not genre, what type of characters. Pirates? Detectives? Magicians? Scientists? Thieves? Murderers? Doctors?….take your pick. Or place/setting. Office? Courtroom? College/school? London? Paris? Distant planet? How about time? Present? Past? Future? Or time-travel? Basically just find the best written book of any of the topics you are most inclined to read. Most clichéd comparison. But true. Do you know that thrill you get during a rollecoaster ride? A Right Book would give you that. And don’t you wanna know what it’s like to just sit in silence or with a soft sigh or with tears in your eyes or smile or laugh or wonder after closing that wonderful Right Book? Yeah, you do. So go on searching. Assuming you have the Right Book, now’s the time to set the mood. Remember, you’re doing this for pure pleasure, for entertainment. You want to get lost. So get cozy. Have some snack around. Turn on some mild music. Preferably related to the book. You must be alone. Now open the book. Start reading. Word after word. Line after line. Page after page. Don’t give up easily though. And before you know it, you are into it. You are simply hooked. And even after reading 25% of the book, if you are still bored, distracted, then leave the book. It’s okay. But don’t give up. Let your quest for the Right Book go on. Good luck. ",
            "date": "Answered February 26, 2017",
            "views": "185",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Brandon Luco",
                    "user_href": "/profile/Brandon-Luco"
                }
            ]
        }
    ]
}