{
    "title": "I want to start reading Batman comic books. Where should I start? Mention the issue numbers along with the titles. - Quora",
    "tags": [
        "DC Comic Books",
        "Reading Advice",
        "Advice About Books",
        "Batman (creative franchise)",
        "Comic Books",
        "Comics (narrative art)",
        "DC Comics",
        "Reading",
        "Book Recommendations",
        "Books"
    ],
    "response": [
        {
            "author_info": {
                "name": "Laura Michet",
                "href": "/profile/Laura-Michet"
            },
            "answer_text": "There are currently fourteen comic books about Batman, Gotham, and Batman's subordinates/family members in print today. If you want to read good Batman stories that don't require \"catching up\" with a year or more of comics, I'd suggest staying away from the comic issues that are currently in print and reading some of the older classics of the Batman corner of the DC universe.     Begin by reading Batman: Year One, written by Frank Miller. It's an influential \"reboot\" of the story that took us back to Batman's roots and the story of the first year he spent under the cowl. It influenced the movie Batman Begins. It was recently published in some kind of \"super edition\" or collector's edition or something-- so you can probably find it at your local comic book shop on the rack of recent hardcover releases.    Next, read The Long Halloween, by Jeph Loeb and Tim Sale. It is my favorite Batman story and it has earned classic status. It is a superb mystery, has fantastic art, and takes us back to Gotham \"before it got crazy\"-- most of the enemies are gangsters, not supervillains. It also influenced Batman Begins. Follow it up with its sequel, Dark Victory, which is also pretty good.    Once you've read these, it's time to read a crazier take on the Batman universe-- Gotham by Gaslight, which asks the question, \"what if Bruce Wayne lived during the Victorian era, and Batman had to solve the Jack the Ripper mystery?\" It is illustrated by MIKE MIGNOLA, the artist behind Hellboy, who is my favorite living comics creator. It's wonderfully atmospheric and is a good (very quick) read.    Next, get a little more bizarre and read The Dark Knight Returns, Frank Miller's incredibly famous take on Batman-as-old-man. It is, rightly so, considered one of Frank Miller's best works, and one of the best superhero graphic novels ever, period.    Finally, finish up with The Killing Joke, Alan Moore's famous Batman story, which pits Batman against the Joker and his extreme sadism. It's also short. It's not one of my favorite stories, but many people adore it, and it's certainly a classic. It features Commissioner Gordon and his family. It's one of the best depictions of Batman's bizarre relationship with the Joker. Edit: I can't believe no one called me out about including Morrison's Arkham Asylum! (And I can't believe I forgot about it last night!)    This is Grant Morrison and Dave McKean's Batman magnum opus-- a baffling, terrifying, thematically-dense exploration of madness. Depending on your temperament, this may or may not be a good book to read in your first pass on Batman books. I read it very early in my exploration of comic books and I LOVED it because it was so goddamn wild, but if this isn't your thing:   ...then you should probably save this book for later-on in your Batman-reading career. Be advised, though: it's very very very very very good. So you should definitely give it a shot. ",
            "date": "Answered July 9, 2012",
            "views": "618",
            "upvotes": " View 347 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Ted Miller",
                    "user_href": "/profile/Ted-Miller-11"
                },
                {
                    "user_id": "Deepak Mehta",
                    "user_href": "/profile/दीपक-मेहता-Deepak-Mehta"
                },
                {
                    "user_id": "Amay Paul Singh",
                    "user_href": "/profile/Amay-Paul-Singh"
                },
                {
                    "user_id": "Talik Middleton",
                    "user_href": "/profile/Talik-Middleton"
                },
                {
                    "user_id": "Shardul Mahesh Pawar",
                    "user_href": "/profile/Shardul-Mahesh-Pawar"
                },
                {
                    "user_id": "Jose De La Cruz",
                    "user_href": "/profile/Jose-De-La-Cruz-92"
                },
                {
                    "user_id": "Divya Krishna Malik",
                    "user_href": "/profile/Divya-Krishna-Malik"
                },
                {
                    "user_id": "Harsha Ganesh",
                    "user_href": "/profile/Harsha-Ganesh-13"
                },
                {
                    "user_id": "Djimon Jones",
                    "user_href": "/profile/Djimon-Jones-2"
                },
                {
                    "user_id": "Irfan",
                    "user_href": "/profile/Irfan-281"
                }
            ]
        },
        {
            "author_info": {
                "name": "Liem Duong",
                "href": "/profile/Liem-Duong"
            },
            "answer_text": "This is an answer as of March 2020. Now there are way too many Batman comics to read out there, so many of them are fantastic to read. But if you want to read Batman in current time, don’t even bother reading canon comics before 2010. This answer will focus on starting to read the current Batman, not all of Batman.  It will freeze your head and will take a long time, and that is what reboots are for. However, if you want some all-star recommendations of Batman whether in canon or not, here are a few of a endless amount of titles: Batman: KnightfallBatman: Tale of the DemonBatman: The Long HalloweenBatman: The Dark Knight ReturnsBatman: Year OneBatman: The Killing JokeBatman: Death in the FamilyBatman: Earth OneBatman: Gotham by GaslightBatman: Under the Red Hood Whew thats out of the way. Now to focus on today’s Batman. Now, even if we are focusing on Batman as of recent, it is still very difficult to read all of the stuff the are great about him. But we have to start somewhere, and the perfect place to start is the New 52 (2011–2016).  Serving as a reboot, this is the perfect place to jump onto Batman. Despite lasting 5 years, it only has like 56 issues total, not very long compared to his other runs that goes in the hundreds. While I recommend you read the entire run cause it honestly one of the best canon Batman runs, I am only going to showcase four specific volumes. If you are going to start reading Batman as of this point onward, start with: Batman (2011) Volume 1: The Court of Owls (#1–7)Batman (2011) Volume 2: The City of Owls (#8–12) This is basically Batman: Year One of the 21st century. It is an absolute essential that dives into the history of Bruce Wayne’s family. It reflect how he came to be where he is, who his family really were, and unravels the dark past within Gotham City. It also reflects Wayne’s relationship with his blood son Damian (Robin), and how Bruce as well as his son are impacted by the secrets of their family. Batman (2011) Volume 3: Death of the Family (#13–17) While I don’t personally rank it as my book I love, it still a great read and another addition to the classic Batman titles. Its a really creepy portrayal of Joker’s return to Gotham, and more violent and psychopathic version that rivals even the Killing Joke. That face detachment should already be scary enough to attract readers. Batman (2011) Volume 8: Endgame (#35–40) This was probably my favorite volume out of the run. The Joker basically takes over all of Gotham Vity with his infamous Joker Gas, making people turn insane and laugh uncontrollably. If you thought the Joker couldn’t get any more evil, he becomes a legend in this run. It fucking fantastic. The whole comic run is fantastic. Now lets move into Batman Rebirth (2016-).  While New 52 Batman proved to be one of the best runs of Batman this century, Batman Rebirth has been arguably one of the most divisive canon runs of Batman. As a result of DC’s change of direction from the New 52, the company when through a relaunch and entered a new age of DC comics known as DC Rebirth. While Rebirth may not live up to the glory of the New 52, there are some key events and great volumes to pick from the present ongoing series. So to start off, Batman (2016) Volume 4: War of Jokes and Riddles (#25–32) While the whole run was mundane, this volume is one of my favorites. The Joker and the Riddler go to war over Gotham, each employing villains to their cause and forming two dominant factions, with Batman and the GCPD losing ground and hope to save the city from its own destruction. Full of action, fun, great character moments (Kiteman) and it has both Joker and Riddler. What can you ask for more. Batman (2016) Volume 5: Rules of Engagement (#33–37) *SPOILERS* This volume strikes at the heart of what this run’s primary focus has been on, Batman and Cat-woman. Yeah, they flirted and fought with each other multiple times, but since Rebirth have entered a serious relationship, and this volume follow their journey to marriage. A light, breezy yet action packed journey of Cat-woman and Batman. It also has Talia Al Ghul as a special guest, which is always fun. This leads into the notorious Volume 6: Bride of Burglar? and more specifically the Wedding Day Issue (#50). If you are invested into Batman and Cat-woman’s relationship, go check it out, but you may find yourself a little disappointed. Batman (2016) Volume 8: Cold Days (#51–57) Now this ongoing run receives a lot of flack for its constant use of deconstruction on Batman to a point where it becomes annoying, boring or out-right abysmal . But one of the few times this deconstruction worked beautifully was in Volume 8: Cold Days. It displays the perspective of both Batman and Bruce Wayne in a very nuanced light, and for the first time actually makes us ponder of how we perceive Batman. The dialogue is amazing in this volume, and it tugs at the heart of who Batman is to us. Batman (2016) Volume 14: Dark Designs (#86-Ongoing) While most of the Rebirth run can be a drag for some people, for older school Batman readers as well as new ones alike can enjoy the current arc going on in Batman Rebirth. *SPOILERS* After the events of the City of Bane arc, Alfred’s death traumatizes Bruce and to honor his name and wishes, sets out plans to redesign the city as Bruce Wayne. But a mysterious figure emerges, setting out to kill Gotham’s underworld and Bruce Wayne, to redesign the city in his new vision. A great arc so far. Lots of action, high intensity and major revelations coming out, its Batman at his finest. So those are some of the volumes I recommend from the DC Universe that you can read to catch up on Batman in continuity as of the New 52 forward. Now lets take a look of some Batman content outside of continuity.  DC Black Label is a relative new imprint founded in 2018 with the intention of non-canon approaches to DC’s classic characters in the hands of the comic industry’s best creative thinkers. Aged 17+, it targets mature readers as well. Batman currently has many titles under DC Black Label, with almost a 3rd of comic titles under his name and almost half of titles dedicated to Batman affiliated characters such as Harley Quinn and Joker in addition to Batman. Here are some recommendations of some of the best modern Batman titles from DC Black Label. Batman: White Knight (#1–7)Batman: Curse of the White Knight (#1–8) Batman: White Knight was a best-selling comic run during 2018 for DC. Taken outside of continuity, what happens if Joker became sane? What happens Batman becomes the villain and Joker becomes the victim? A great concept, already sold people. But then we talk about the art style and writing, it is a modern masterpiece. It was so critically acclaimed, that a sequel was produced, Batman: Curse of the White Knight. Diving into the history of Batman’s identity and his family’s legacy, Joker threatens to end the Batman with the help of a special crusader. With the city in peril and Batman in limbo, he slowly learns of his family’s past, and what the means to him moving forward. The sequel is about to drop its final issue on March 25, 2020. Pick it up and find out what happens to the Dark knight! Batman: Last Knight on Earth (#1–3) Batman in a dystopian world holding the head of the Joker. How can you get any more exciting than that? Batman has to travel across the dystopian remnants of what left of the DC Universe to discover and piece back together who he was and his past. Appearances of different characters within the DC Universe along with the fantastic art and coloring makes the comic series all the more exciting. Batman: Three Jokers (#1–3) On to future plans for the Dark Knight. His next big story arc is the long awaited mini-series dealing with the events after the Darkseid War back in 2016. Batman with the use of the Mobius Chair discovers that there were three Jokers, and in June 2020 will come to answer long awaited question on this theory that alludes the Dark knight to this day. So to recap, here are some recommendations on Batman titles in and out of continuity: New 52 Batman (2011–2016): Batman (2011) Volume 1: The Court of Owls (#1–7)Batman (2011) Volume 2: The City of Owls (#8–12)Batman (2011) Volume 3: Death of the Family (#13–17)Batman (2011) Volume 8: Endgame (#35–40)Batman Rebirth (2016-): Batman (2016) Volume 4: War of Jokes and Riddles (#25–32)Batman (2016) Volume 5: Rules of Engagement (#33–37)Batman (2016) Volume 8: Cold Days (#51–57)Batman (2016) Volume 14: Dark Designs (#86-Ongoing)DC Black Label: Batman: White Knight (#1–7)Batman: Curse of the White Knight (#1–8)Batman: Last Knight on Earth (#1–3)Batman: Three Jokers (#1–3) (Coming Soon) ",
            "date": "Updated March 15, 2020",
            "views": "54",
            "upvotes": " View 19 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Amay Paul Singh",
                    "user_href": "/profile/Amay-Paul-Singh"
                },
                {
                    "user_id": "Mauricio Ortega",
                    "user_href": "/profile/Mauricio-Ortega-22"
                },
                {
                    "user_id": "Ryu 1337",
                    "user_href": "/profile/Ryu-1337"
                },
                {
                    "user_id": "Sharu Punee",
                    "user_href": "/profile/Sharu-Punee-1"
                },
                {
                    "user_id": "Sai Maadesh Kumar",
                    "user_href": "/profile/Sai-Maadesh-Kumar"
                },
                {
                    "user_id": "Divya Krishna Malik",
                    "user_href": "/profile/Divya-Krishna-Malik"
                },
                {
                    "user_id": "Swapnasish Rakshit",
                    "user_href": "/profile/Swapnasish-Rakshit"
                },
                {
                    "user_id": "Hannah Violetka",
                    "user_href": "/profile/Hannah-Violetka"
                },
                {
                    "user_id": "Isaac Holt",
                    "user_href": "/profile/Isaac-Holt-21"
                },
                {
                    "user_id": "Hope Simpson",
                    "user_href": "/profile/Hope-Simpson-3"
                }
            ]
        }
    ]
}