{
    "title": "I want to invest in stocks. What should I do? - Quora",
    "tags": [
        "Investing in the Stock Market",
        "Investing"
    ],
    "response": [
        {
            "author_info": {
                "name": "Neel Jain",
                "href": "/profile/Neel-Jain-10"
            },
            "answer_text": "Get to know a bit about equity trading. Its a simple concept. You need to read news for 15-20 days to get a start. Secondly,  identify companies which have had a good history of dividend payment to  their shareholders. Go for mid cap companies and not large cap  companies (I assume you know these terms). Mid cap have a higher  potential to grow. Large cap companies are already very developed and  their shares are already grown. Don't take recommendations. They will sound very appealing, but, not  great idea. Instead invest in good stocks and be patient. Don't spend the entire amount. Always hold back 30%. You will need it. I can't explain it here but when the time comes you will definitely feel \"if I had some more funds\". So hold some cash. Search  on google: highest dividend paying companies in India. Select a few and  check their balance sheet and profit & loss account. Based on this  select 10-15 companies and invest in them. You can have a  basic understanding within 3-4 hours of reading and you will be ready to  go. ",
            "date": "Answered May 25, 2015",
            "views": "342",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Sandhiya AmudhaVijayaraghavan",
                    "user_href": "/profile/Sandhiya-AmudhaVijayaraghavan"
                }
            ]
        },
        {
            "author_info": {
                "name": "Ramana Rao",
                "href": "/profile/Ramana-Rao-17"
            },
            "answer_text": "1. Open a Demat account after comparing the brokerage charges and the services provided by various brokers.2. Invest only one lakh initially, at an opportune moment and maintain liquidity of another lakh. 3. Have a time horizon for your investment. Meaning, decide how long you can stay invested without liquidating. 4. You cannot time the market but you can leverage your investment by averaging if the need be. Averaging means if your stock  took a dip you may like to buy more at the lower price to bring down your price per share. But whether to average or book losses is a critical decision.5.  Only invest the money you  don't require immediately.6. There is no limit on number of shares you can buy. You can even buy a single share. so put in your money in stages. After testing the performance.You can buy more. Specially buy on dip and sell on raise. 7. You can also invest in exchange traded funds.8. Dont be greedy, Rome is not built in a day. Have realistic targets and you are sure to make profit. ",
            "date": "Answered May 29, 2015",
            "views": "289",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Manjunath Kl",
                    "user_href": "/profile/Manjunath-Kl"
                }
            ]
        }
    ]
}