{
    "title": "I want to invest $3,000 per month for 1 year in the stock market. I have no experience in investing. Where do I start? - Quora",
    "tags": [
        "Stock Market Advice",
        "Investing Advice",
        "Stock Market Investment Advice",
        "Personal Finance Advice",
        "Investing in the Stock Market",
        "Investment Advice",
        "Stocks (finance)",
        "Stock Markets",
        "Investing",
        "Money"
    ],
    "response": [
        {
            "author_info": {
                "name": "Mike Farkas",
                "href": "/profile/Mike-Farkas"
            },
            "answer_text": "Easy. For starters, start looking into a brokerage account. Which company works better for you to entrust your trading/investing activity with? Do you care about fancy graphs technical analysis? Or do you not care about the fancy interface, and just are looking to move your money from point A in your pocket to point B into a stock? *Try to look for deals some brokerage offer. For example, some brokers offer that if you transfer at least $x into your newly opened account, you can get, say, 1,000 free trades. Once you have a brokerage account ready, start to transfer the funds you have available. Ask yourself how much do you need. How much should you try to find every one or two months. What’s your goal? Third, now that you have your funds in your account, you’re locked and loaded. But easy there Private Pile, let’s not get too trigger happy yet. Don’t get too anxious. Don’t simply jump into trades because of the “rush”. Trade/invest only when you have done your homework, and are willing to risk what you have worked so hard for. Step 1, have the money. Step 2, establish your brokerage account. Step 3, learn what you want to invest in, and invest once you have educated yourself thoroughly. Step 4, always keep learning, and be humble. Good luck. ",
            "date": "Answered January 27, 2019",
            "views": "638",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Hong Chew Eu",
                "href": "/profile/Hong-Chew-Eu"
            },
            "answer_text": "Forget about the money first. Would you jump into a car and start driving before learning how to drive? If you don’t do this, then why would you invest real money without first learning how to invest. If you want to invest, you must first learn to invest. There are several investing styles eg technical vs fundamental, quant vs discretionary, indexing vs stock-picking, etc All successful investors focus on one style. It makes sense for you to do likewise. Go to Investopedia and get an overview of the various styles and then select one based on your interest, risk tolerance and other demographics. Thereafter get an in-depth knowledge of the chosen path. When you have mastered it through case studies and paper transactions, you are ready to invest with real money If you want a shortcut to selecting the investment path, search “baby steps into the investment universe Part 1” ",
            "date": "Answered October 23, 2020",
            "views": "124",
            "upvotes": "0"
        }
    ]
}