{
    "title": "I want to become an avid reader. I’m 16 (in case that is of any importance), what books should I start reading first (classic books)? - Quora",
    "tags": [
        "Reading",
        "Book Recommendations",
        "Books"
    ],
    "response": [
        {
            "author_info": {
                "name": "Bill Bryant",
                "href": "/profile/Bill-Bryant-11"
            },
            "answer_text": "The most important thing about becoming a reader is choosing what you want to read,the best thing is look at what interests you. Go to a good local library or your school library or a good book shop, look at the range of books both fiction and factual, decide what you like and borrow or buy it. The second most important thing if you want to become a reader is to set aside some time everyday to do just that. A lot of people do so just before bedtime as a way to wind down after the business of the day. This can sometimes work it depends what your reading. Some books will be calm and slow, others are a more frantic place and the speed of the narrative drives you forward through the book some books have mixture of both. I would tend to start with short fiction, short story collections of one author or anthologies with different authors or shorter novels. Once you get the habit of reading you can use reading to take you anywhere and anywhen in this universe or the tens of thousands of others that the minds of the authors have devised or if you wish you can take up pen and paper or typewriter or screen and keyboard and make your own and if you choose, share it with others. ",
            "date": "Answered December 27, 2019",
            "views": "94",
            "upvotes": " View 2 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Gaby Chapman",
                    "user_href": "/profile/Gaby-Chapman-1"
                },
                {
                    "user_id": "Susan Campbell",
                    "user_href": "/profile/Susan-Campbell-173"
                }
            ]
        },
        {
            "author_info": {
                "name": "Ira Serge",
                "href": "/profile/Ira-Serge"
            },
            "answer_text": "Pick shorter stories over long ones to start with, if you're not used to long novels! It will also give you a chance to work out your preferred genre To add to the other answer: Sherlock Holmes stories (I've read them so many times!)Adventures by Jules Verne (full out novels, maybe don't start with them but definitely worth being on the list)The portrait of Dorian GrayStories by Isaac Asimov about robots and other future stuff. 10/10 top recommend!!Nikolai Gogol (Mykolai Hohol): short stories series. Start with “Christmas Eve” and see how you like it.Tolkien: Hobbit there and back (pretty much the only easily readable book, all the other ones are for fans)Neil Gaiman and Terry Pratchett are modern day classics. Very much recommend. Neil blends fiction and reality into a work of art, while Terry's wit and imagination are unparalleled.Happy reading! PS: Authors to avoid include Tolstoy (plot doesn't move, ever), Lermontov (depressing, unless that's what you're looking for). ",
            "date": "Answered December 27, 2019",
            "views": "89",
            "upvotes": "0"
        }
    ]
}