{
    "title": "I want to read 100 books, (in 8 months). how should I plan to do this? - Quora",
    "tags": [
        "Reading Recommendations",
        "Reading Advice",
        "Planning",
        "Reading",
        "Book Recommendations",
        "Self-Improvement",
        "Books",
        "Life Advice"
    ],
    "response": [
        {
            "author_info": {
                "name": "D.L. Zaragoza",
                "href": "/profile/D-L-Zaragoza"
            },
            "answer_text": "Not sure why you'd want to except for bragging rights. If it's fiction reading, you aren't really savoring the language reading at a rate like that. Nonfiction reading that fast would leave a lot of information on the table. Nonetheless, you seem to have made up your mind. If I had that same goal, I would do a few things first - Decide first which 100 books to read, so decision-making wouldn't slow me down. Get a Goodreads account, and load up your want-to-read list. This is pretty easy to do - I think my own current list has nearly 300 books, and I loaded that list within a week.Take a speedreading course, if you haven't already done so. You will need to read at a quick pace.Remove yourself from all those pesky little things that will interrupt your reading. Things like job, school, family and friends, bathing and meal preparation. I hear Soylent meal replacements are the wave of the future of nutrition…If my dripping sarcasm hasn't already given me away, let me be a little bit clearer. I'm not in favor of dropping all of life to engage in reading immersion just because, and especially if writing is in your future plans. The story of Don Quixote was a bit of a warning against such practices - a good book to place pretty high on that Goodreads list. For true learning, we also need time to savor and digest all those lovely words - time to journal, talk about these concepts with loved ones or book group members over lunch or coffee, and live with these things in real life, and maybe even write your own masterworks that others will put on their own Goodreads list someday.☺ Whichever way you decide to go, good luck to you. ",
            "date": "Answered May 10, 2020",
            "views": "40",
            "upvotes": " Answer requested by M King",
            "upvoters": [
                {
                    "user_id": "M King",
                    "user_href": "/profile/M-King-119"
                }
            ]
        },
        {
            "author_info": {
                "name": "Hannatu Sa'eed",
                "href": "/profile/Hannatu-Saeed"
            },
            "answer_text": "How much time do you have in each day? Reading is an extremely rewarding activity, but time is the enemy or the friend, depending on how you use it. You’d need to figure out a strategy that can work for you based on the free time available to you. Your free time of course would depend on the other responsibilities you have in your life, apart from reading books. For instance, are you someone with a 9–5 job? or a student having to attend classes regularly? or a family man? etc. If you fall under any of this or a similar category, you obviously have other priorities apart form reading, which can be a distraction and eventually chip away at your free time. Of course, the more free time you have, the easier and sooner you can achieve your goal. You can then plan how much to read per day from the amount of free time you have. Set yourself a rule to, for instance, read a book every two days—average books, I assume. If you can do that, you can easily achieve your 100 books in 8 months. For motivation, you can use the “carrot and stick” approach. Put a system in place to reward yourself a little every time you stick to your rule of reading a book in two days OR even punish yourself if you fail by, say, delaying some gratification or even paying a reasonable amount of money in charity. Self-discipline is important for all this. Without it, I’m afraid, you can hardly push yourself to do something you don’t really have to, which I assume this project is. But it’s a good thing you already have the desire to achieve this and are already shopping for ideas on how to realise it. A hundred books in eight months is pretty ambitious, I must say, but nonetheless, not an impossible feat. Good luck! ",
            "date": "Answered April 19, 2020",
            "views": "56",
            "upvotes": " View 1 Upvoter "
        }
    ]
}