{
    "title": "I would like to read more comic books. Any recommendations? - Quora",
    "tags": [
        "Comic Books",
        "Comics (narrative art)",
        "Reading",
        "Book Recommendations",
        "Books"
    ],
    "response": [
        {
            "author_info": {
                "name": "Yosef Dhawan",
                "href": "/profile/Yosef-Dhawan"
            },
            "answer_text": "if you can find it the Crossgen series in graphic novel sigil meridian sojourn the entire catalog next the marvel “new universe” imprint PSI-force: 5 paranormals (gifted humans effected by the white event) learn to combine their minds and powers to create the PSI-Hawk a native american looking warrior form justice: a paranormal DEA agent goes punisher with the ability to see evil souls and energy projection D.P.7: the story of 7 victims of the white event, pransformed in strange and amazing ways as they flee the sinister clinic which want their powers at any cost the wildstorm universe's best mature superhero comics WILDC.A.T.Sfa group of alien and hybrid warriors fighing a guerilla war against the deamonites who are also stuck onearth Gen13: a group of terns on the run from a government organization that wants to make them obediant super soldiers Stormwatch: a hardcore avengers group working for the united nations the Authority: when stormwatch fell the black ops team leader decided more was needed, she assembles a team of dome of the most powerful beings on earth and tells the world “behave” totally justice lords style a stand alone from marvel Strikeforce Morituri: the earth is under attack by savage primatives in control of advanced alien starships. whit no superheroes things look bleak until a scientist creates a way to give humans increadible superpowers… at a price the Morituri process will transform you into virtual gods butt the clock is ticking because the process is 100% Fatal within 1 year theses are the stories of the brave men and women who sacrifice everything for their planet mainstream 616 marvel Power pack: four children are given alien powers to save their parents and the world from yhe evil aliens who want their father's energy generatior New Warriors: a young black batman panache assembles a teem of young street level herps to fight the fights the alist elite heros can't be botherrd with X-men X- force the New Mutants Excalibur the exiles: when aliens break the fabric of realirty they trick heroes from alternate earths into fixing the cracks before reality unravels from D.C main continuity teen titans: yhe comic is so much better then the cartoons Justice League of America from image invincible: tje son of his world's superman panache learns his father is actually an evil alien bent on conquering earth, and only he stands in the way not sure of the company irredeemable: what if superman snapped? this is the story of the Plutonian, an omega level Supernan panache who has a psychotic break, kills his frllow superheroes and rampages across the world p.s. check out the graphic novel We3 it's about three lab animals ( dog, cat and rabit) enhanced by cybernetic exosuits who just want to be free, and when their creators decide to terminate the project they flee for their lives part the incredible journey part robocop ",
            "date": "Answered July 9, 2019",
            "views": "234",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "J. Lind Whitby",
                "href": "/profile/J-Lind-Whitby"
            },
            "answer_text": "Toxic Gumbo It's a graphic novella written by all-around artist Lydia Lunch and illustrated by the great Ted McKeever in the late 90s. It was published by DC's Vertigo imprint. It's the tale of a young woman who is literally toxic since before her birth. Voodoo is possibly involved. It explores love and loneliness, hate and kinship, and ultimately loss. I'm not sure where you can get it these days, but it's well worth picking up a copy if you can find one. ",
            "date": "Answered July 9, 2019",
            "views": "210",
            "upvotes": "0"
        }
    ]
}