{
    "title": "I wrote and published a book. A man from China contacted me. He said he was going to translate my book into Chinese and publish it there. Doesn’t he need to get publishing rights first before translating and publishing it? - Quora",
    "tags": [
        "Book Translations",
        "Book Publishing",
        "Copyright Law",
        "Publishing",
        "Legal Issues and Law in Everyday Life",
        "China",
        "Books"
    ],
    "response": [
        {
            "author_info": {
                "name": "Wayne Allen Sallee",
                "href": "/profile/Wayne-Allen-Sallee"
            },
            "answer_text": "It’s always a good sign when someone contacts you first. Publishing houses in the US are notorious for not giving a shit about writers when it comes to foreign rights. You need to find out what publisher that man represents. You need to check with your publisher in the US. Most contracts state First North American Rights go to the US publisher. Don't just accept the man at his word. Get more information. And inform him that he cannot just translate the book and have it published. The rights belong to you, so you or your agent can negotiate a contract with him. Do a Google search on your book for the hell of it. I was surprised at the amount of anthologies I’ve been in are translated into German or French without my ever being aware. German and Spanish editors contacted me. The original US publishers claim to not make much from giving over the anthology rights, which is likely true in some cases, but all I’d want was a copy of the foreign edition. Lesson to be learned is Good Publisher vs. Not So Good Publisher. If you think it is a shady deal, tell the publisher to provide him a contract that states that he has to go through them, not you. If you have an agent, which you should, get them involved first. ",
            "date": "Answered December 19, 2019",
            "views": "190",
            "upvotes": " View 5 Upvoters",
            "upvoters": [
                {
                    "user_id": "David Lascelles",
                    "user_href": "/profile/David-Lascelles"
                },
                {
                    "user_id": "Benjamin Thomas",
                    "user_href": "/profile/Benjamin-Thomas-46"
                },
                {
                    "user_id": "Lee Ballentine",
                    "user_href": "/profile/Lee-Ballentine"
                },
                {
                    "user_id": "Rigopoula Tsambou Talarantas",
                    "user_href": "/profile/Rigopoula-Tsambou-Talarantas"
                },
                {
                    "user_id": "Eleanor Murray",
                    "user_href": "/profile/Eleanor-Murray-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Piyush Mathur",
                "href": "/profile/Piyush-Mathur-71"
            },
            "answer_text": "He certainly needs your publisher’s permission; whether he needs the author’s permission depends on the exact nature of the contract you signed with your publisher. So, you should immediately contact your publisher regarding this Chinese man—and your publisher should guide you. Keep in mind that until the very point this Chinese man is about to publish your book, he is under no obligation to tell you or your publisher about his translation itself (which would remain private to him). Also, given that he has contacted you, he appears to be doing the right thing already—and he probably respects your research and the book. ",
            "date": "Answered December 17, 2019",
            "views": "154",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Robert Lawrence Friedman",
                    "user_href": "/profile/Robert-Lawrence-Friedman"
                }
            ]
        }
    ]
}