{
    "title": "I'm used to reading non-fiction. What are some must read fiction books? - Quora",
    "tags": [
        "Non-Fiction Books",
        "Non-Fiction",
        "Fiction",
        "Advice",
        "Reading",
        "Book Recommendations",
        "Mental Health",
        "Books"
    ],
    "response": [
        {
            "author_info": {
                "name": "Sarah Vallieres",
                "href": "/profile/Sarah-Vallieres"
            },
            "answer_text": "If you like mainly non-fiction, you might try reading some of the late author Michael Crichton’s novels. I do not consider these must reads, but they are extremely entertaining, well-researched and contain tons of facts (which might make the transition to reading fiction easier for you). His books tend to deal with the intersection between science and ethics (or humanity). They can be quite controversial and sometimes even offensive; I don't know whether he was trying to make people think or if he just had some racist and sexist ideas about things. Some of his most famous novels include: Jurassic ParkDisclosure — about high tech and sexual harassment of men: I found this offensive and sexistThe Rising Sun — about Japanese culture and Japan’s dominance in high tech in the 1990s: fascinating, lurid and also kinda racistSphere — cool underwater taleAirframe (?) — fascinating, about plane crashes IIRCTimeline — travel back to medieval France",
            "date": "Answered March 3, 2017",
            "views": "393",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Chase Bivens",
                "href": "/profile/Chase-Bivens-1"
            },
            "answer_text": "The Hobbit and The Lord of the Rings, both by J. R. R. Tolkien are considered the roots of modern fantasy books. Both are great, entertaining, adventurous, and have quite the setting to them. You can even throw in the Silmarillion, which helps with the world building even more. Most modern fantasy novels and series point to Tolkien as the source of inspiration for their own works. ",
            "date": "Answered March 3, 2017",
            "views": "90",
            "upvotes": "0"
        }
    ]
}