{
    "title": "I'm 14 year old, and writing a book. Should I publish it? And if so how? - Quora",
    "tags": [
        "14 (age)",
        "Publishing",
        "Writing",
        "Teenagers and Teenage Years",
        "Books"
    ],
    "response": [
        {
            "author_info": {
                "name": "Alpana Gupta",
                "href": "/profile/Alpana-Gupta-79"
            },
            "answer_text": "First of all, congratulations on your first book. And YES, like a big yes in bold, you should definitely publish it. It doesn't matter what your age is, sharing your work with the world is the best way to keep growing as a writer. Although how should you publish it, is the real question here. A-You can try and reach publishers. There is a lot of information available on the Internet. You can easily find and approach publishers via mail. Just two things- 1- Don't send your whole draft to anybody. (Although, the real publishers don't even ask for it. They would ask for the first five chapters or so.) 2- Don't pay anybody to publish your book. B- You can self-publish your book with the help of Kindle Direct Publishing. All the information and instructions you need to follow the process, has been given on the website. It’s a quick and simple process. You just need to a make an account to publish. (You don't have to be a technical expert to do so. I mean if I can do it anyone can. I am an anti-technical). For graphics like a book cover and all, if you need any help, I have a guy who is pretty reasonable and quick. Of course, if you need further assistance. ",
            "date": "Answered February 19, 2020",
            "views": "269",
            "upvotes": " Answer requested by Ashmit Jain"
        },
        {
            "author_info": {
                "name": "Sarvesh Kumar",
                "href": "/profile/Sarvesh-Kumar-1773"
            },
            "answer_text": "Firstly, Congratulations! on writing a book at a young age, an inspiration for many I'm sure. Talking about publishing, yes, you can certainly publish it, there is no age limit to publish a work. Coming to the “how” factor, I can help you publish your masterpiece. I am a co-founder of a self-publishing house myself and we work towards serving young writing talents like you. Betagram Publishers is a self publishing house, which provides end-to-end publishing services. From proofreading to editing, designing the best book cover to marketing your work nationally and internationally. Do get in touch with me for any kinds of doubts, questions you may have. Looking forward to hearing from you. Have a Great Day! ",
            "date": "Answered February 11, 2020",
            "views": "105",
            "upvotes": " Answer requested by Ashmit Jain"
        }
    ]
}