{
    "title": "I'm just a 15 years old, what should I do to get my book published? - Quora",
    "tags": [
        "Book Publishing",
        "Publishing",
        "Teenagers and Teenage Years",
        "Books"
    ],
    "response": [
        {
            "author_info": {
                "name": "Vaibhav Kalvakota",
                "href": "/profile/Vaibhav-Kalvakota"
            },
            "answer_text": "Not for a book, but I can tell for a paper. One of my friends called me up a few weeks ago to see if I could ask someone for reviewing his paper. He technically wrote a document where he wrote how you could “reconcile QM and GR”, but as far as I could see, he copied more or less from a book on LQG. His abstract was amazingly dumb. He wrote how “he had come up with a solution for a GUT (which he wrote for a General Unification Topic instead of a Grand Unification Theory). The mathematics was the most weirdesst thing ever. He wrote “symbols for the Loop in a String theory” as A_12, and I still am baffled by his stupidity. He wrote a request saying I should contact someone like Brian Greene to check my paper and he gave his mail. I was totally overwhelmed by this. I simply replied saying “I am sorry, but I cannot do so”. He later mailed me several times, but my spam filter knew better, and it was out of my sight. You should check whether your document has any worth, because if I blankly had mailed someone, things would have blown me, as I am writing a paper in Cosmology. So, check from sources if your document is reasonable or not, whether it’s a paper or a book. Best. ",
            "date": "Answered August 31, 2020",
            "views": "58",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Daniel Slosberg",
                "href": "/profile/Daniel-Slosberg-1"
            },
            "answer_text": "Rainbowdash Publishers LLC is publishing a 15-year old poet’s first book March 6th. I can put you in touch with the poet to talk about her experience if you like. The process of publishing is pretty simple: go a publisher like Rainbowdash Publishers LLC, submit your manuscript in whatever form the publisher requests, wait to hear whether it is accepted or not (within a week or two at Rainbowdash, can be longer elsewhere), agree on a publication date, cash the checks once the book has been published. ",
            "date": "Answered January 18, 2018",
            "views": "80",
            "upvotes": " Answer requested by Khang Tuan Nguyen"
        }
    ]
}