{
    "title": "I'm in the process of writing a book. Having already written the first chapter and created a magic system with almost no other world building, where is the best place to start before I continue on to the second chapter? - Quora",
    "tags": [
        "Book Writing",
        "Creative Writing",
        "Writing Advice",
        "Writing",
        "Books"
    ],
    "response": [
        {
            "author_info": {
                "name": "Isaac Juckes",
                "href": "/profile/Isaac-Juckes"
            },
            "answer_text": "Unlike everyone else i’m going to say that you should stop writing and refocus on your world building. If you’re writing in the fantasy genre (which i assume you are because you’re using a magic system) world building is the backbone of fantasy. It’s what (usually) separates the good books and the bad books. You also want to do character interviews to work out thing such as why is this character involved in the plot? what are they trying to achieve? Ideally your story should feel like it’s part of an ongoing narrative from before the beginning of the novel. This doesn’t mean that you have to spend months or years world building. But i’d also write out a rough plot guide for these key moments: 1%: Hook-this is where you draw in the reader so they keep reading 12.5%: inciting event: this is where your protagonist is thrown into the story.The protagonist is usually unable to come back from this event. 25%- First Plot Point: this is the first major event affecting your protagonist with them reacting to the events occurring to them. 37%-First pinch point: This is your first antagonist ‘win’ where the antagonist in some way triumphs over the protagonist 50%-Midpoint: this is where your character moves from believing in their lie (generally a thematic point) to learning the truth. This also marks your character movement from reacting to acting 63%-Second Pinch Point- This is your second antagonist ‘win’ where the antagonist in some way triumphs over the protagonist 75%-Third Plot Point- this is your protagonists big action before entering the final conflict (Climax) this tends to fail making the protagonist weak and vulnerable and ready to recover and grow in the climax. 75%-95%-Climax- this is the big final conflict between your protagonist and your antagonist leading to one of them (usually the protagonist being successful) (Because climax is a bit hard to describe i’ll also include two examples: The Battle of Hogwarts and The battle at the black gate/mount doom.) 95%-100%-Resolution- this is where you tie up any loose ends and show what your characters did with their life after this event happened to them ",
            "date": "Answered January 21, 2020",
            "views": "108",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Zoe Lexington-Wing",
                    "user_href": "/profile/Zoe-Lexington-Wing"
                },
                {
                    "user_id": "Marleigh Williams",
                    "user_href": "/profile/Marleigh-Williams-1"
                },
                {
                    "user_id": "Tanisha Joshi",
                    "user_href": "/profile/Tanisha-Joshi-15"
                }
            ]
        },
        {
            "author_info": {
                "name": "Timothy Ellis",
                "href": "/profile/Timothy-Ellis-4"
            },
            "answer_text": "I’m assuming your first chapter is all about introducing your main character, and the magic system. So what you do next is put a dozen blank lines on the front of it, remove the chapter heading, and then start again. This time drop your character into the middle of some serious action, and don’t bother explaining anything. The chapter you just wrote can be rejiggered around chapter three to five, to start answering some of the questions in the reader’s mind. But the first paragraph of the first page has to grip the reader by the throat and drag them into your story. Explanations can wait until later. Backstory can wait until later. World building can wait until later. Main characters and what they do, don’t need to be introduced. They need to be seen doing what they do best. The reader wants to meet your main character right in the middle of the action, and form a bond, which makes them want to know how they got there, and what happens next. You supply both of those after the action finishes. Way too many books start with the boring stuff. If you want readers, you have to start with something compelling for them to read. By the end of the sample (first 10%), you want that reader invested in continuing. Boring them in the first chapter is not how to do this. ",
            "date": "Answered January 20, 2020",
            "views": "18",
            "upvotes": " View 17 Upvoters",
            "upvoters": [
                {
                    "user_id": "Akhil Gupta",
                    "user_href": "/profile/Akhil-Gupta-198"
                },
                {
                    "user_id": "Mikayla Drake",
                    "user_href": "/profile/Mikayla-Drake-6"
                },
                {
                    "user_id": "Angel Segarra",
                    "user_href": "/profile/Angel-Segarra-3"
                },
                {
                    "user_id": "Kathy Otten",
                    "user_href": "/profile/Kathy-Otten"
                },
                {
                    "user_id": "John Farmer",
                    "user_href": "/profile/John-Farmer-64"
                },
                {
                    "user_id": "Dane Christensen",
                    "user_href": "/profile/Dane-Christensen-13"
                },
                {
                    "user_id": "Lisa Aldridge",
                    "user_href": "/profile/Lisa-Aldridge-2"
                },
                {
                    "user_id": "Brenda Nichols",
                    "user_href": "/profile/Brenda-Nichols-9"
                },
                {
                    "user_id": "Vincent Shearman",
                    "user_href": "/profile/Vincent-Shearman"
                },
                {
                    "user_id": "Katherina Schmidt",
                    "user_href": "/profile/Katherina-Schmidt-3"
                }
            ]
        }
    ]
}