{
    "title": "I'm a high school student. Is reading two books per week too much? - Quora",
    "tags": [
        "High School Advice",
        "Advice About Books",
        "The High School Experience",
        "Academic and Educational Advice",
        "Books"
    ],
    "response": [
        {
            "author_info": {
                "name": "Lisa Santika Onggrid",
                "href": "/profile/Lisa-Santika-Onggrid"
            },
            "answer_text": "Not at all. In fact, you do better than many of your friends who probably don't touch any books other than those assigned to them. You still have a nice balance going on with outdoor and social activities, so sit back and enjoy your paperbacks. I spent my schoolyears holing up in the library and my room to read all day, so I had less variety in my activity. Never regret those days even a second. However, do make sure you still have enough rest. Efficient sleep time vary from person to person. I used to sleep at 2 AM and wake up at 5.30 AM during high school. It was good enough for me but horrendous to my friend who loved his solid 8-hours per day. You know your body. It does not have to be very constricting. After a big sports day, for example, you can forgo reading a bit and rest for the day. Moderation is the key. ",
            "date": "Answered January 10, 2016",
            "views": "269",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Serena Storbakken",
                    "user_href": "/profile/Serena-Storbakken"
                },
                {
                    "user_id": "Alisha Suneja",
                    "user_href": "/profile/Alisha-Suneja-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Cameron Derwin",
                "href": "/profile/Cameron-Derwin"
            },
            "answer_text": "I wasted a lot of time in high school.  I went to a fancy prep school and had every second of my day planned -- I had to, everyone did.  Now that I'm out of there, even though I know it taught me a ton and I wouldn't be who I am today without it, I consider those years wasted.  Even though I learned tons and tons, I didn't learn what I wanted to learn -- and what I enjoyed.  I made the mistake of giving up what I loved to do -- in my case programming and math research.  Don't make the same mistake.  Once I was done wth my education I realized that school seemed way more important than it really was.  Do what you want -- what you enjoy -- particularly if it's valuable in and of itself. ",
            "date": "Answered January 10, 2016",
            "views": "320",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Jerrell Cockerham",
                    "user_href": "/profile/Jerrell-Cockerham"
                }
            ]
        }
    ]
}