{
    "title": "If angels can falter and fall to hell, can demons rise to heaven or can a fallen angel redeem themselves? - Quora",
    "tags": [
        "Fallen Angels",
        "Angels (Christian religion)",
        "Angels (supernatural beings)",
        "Demons (malicious preternatural beings)",
        "Theology"
    ],
    "response": [
        {
            "author_info": {
                "name": "Geoff Cutler",
                "href": "/profile/Geoff-Cutler"
            },
            "answer_text": "If angels can falter and fall to hell, can demons rise to heaven or can a fallen angel redeem themselves? There is a problem with your terminology. So I will take it slowly: Angels. They can fail, but its very rare. If they do, eventually they are imprisoned and a trial of their behavior takes place. They are pretty well always offered mercy. If they refuse, they are annihilated, even though by our standards that should not be possible with an “eternal” being. Lucifer, Satan and the thousands of angels that followed those two have been tried. They were found guilty. Four refused mercy, amongst them Satan and Lucifer (who are different people) plus Caligastia and Daligastia were all annihilated in 1985. All the rest have been “rehabilitated” - read retrained - and are back in service. Demons. There are not any, not since Pentecost. I have dealt with Lucifer and Satan separately. The beings that people interact with today, either psychically or via possession are humans. Evil humans. Not demons. They behave like demons, but they are just evil humans. Dangerous - yes. Powerful - yes. Evil Humans. Every evil human gets out of hell eventually. It may take a very long time, but they do get out. Hell is not eternal. All such references in the Bible are where the wrong English word has been chosen from the Greek. They should all read “long lasting” not “eternal”. Judas of Kerioth. He is long out of hell because he still had apostles including Mary Magdalene as good friends. You don’t drop a friend because he made a very stupid mistake. Not if you are the real deal. So he was taught how to overcome the compensation he had to deal with, mostly because of his suicide, but also because of his silly idea of getting Jesus to “show his power” to the Romans. I have no doubt it was simply a matter of time before the Romans would have found Jesus. Judas merely brought that day forward. The Jews were determined to eradicate him after his messing with their very lucrative temple businesses. So anyone can be redeemed, but you need to accept you did wrong, and accept mercy. If you won’t you don’t leave the universe with any option. Misguided humans are found in the non-eternal hells and have all the time they need to change. And they all do. But inhabitants of the “real” eternal heaven called the Kingdom of God cannot have any resident who is not singing from the same sheet. So annihilation is the only result of on-going rebellion. Still Lucifer and his mob ran riot for over 200,000 years here on Earth. So the wheels of Divine Justice can be very slow to act. Then they were imprisoned at Pentecost by Jesus, and finally the trial ended almost 2000 years later. I guess they had to deal with every single issue by every single angel over that 200,000 years? ",
            "date": "Answered May 20, 2018",
            "views": "798",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Cynthia Avishegnath",
                "href": "/profile/Cynthia-Avishegnath"
            },
            "answer_text": "Are you asking this question according to the rules from some particular movies, rules concocted by the movie production?concocted by some particular novels?according Islam?according to Hinduism, Taoism, Buddhism?according to almighty flying spaghetti pizza at the edge of the universe?I am not an expert in the above avenues. But I am a Bible fundamentalist, so I shall tell you according to the rules of the Hebrew text of the Bible. As a Bible fundamentalist I believe that the Hebrew text is the root text of the Bible. Any scripture or translation that violates the Hebrew text must be ejected. Don’t be mistaken. Paganism is good and respectable religion. Such that, if your religion is pagan, you should not be in DENIAL about your beautiful and elegant paganism. Celebrate your paganism. In the Hebrew text of the Bible, there is no such thing as hell or hades.You wanna argue with me? Here, read my proof - There is no \"hell\" in the BibleIn the Hebrew text of the Bible, there are actually no such thing as “angels”.Here read my proofs - Genesis 2: There are no \"Angels\" in the BibleIn the Hebrew text of the Bible, there is no such a demon named Satan.Read my explanation - Satan does not exist .In fact, in the Hebrew text of the Bible, there is no word for “sin”. Such that when humans ate from the tree of knowledge of good/evil, Genesis 3 does not even describe the aftermath as “sin”.Read the full and boring explanation: There is no concept of \"sin\" in the BibleBear in mind, that DESPITE surrounding cultures (as well as cultures even as far as ancient China) having all these concepts, YET the Hebrew refuses to allow such a concept to creep in. And then all of a sudden, 1900 years ago a new religion was invented that absorbs all these pagan ideas that the Hebrew scriptures REFUSED to admit? Further reading my explanations Cynthia Avishegnath's answer to What are some incredible ways we know for sure there is a God and his son Jesus?Cynthia Avishegnath's answer to If angels are God's sons, was Jesus an angel?Cynthia Avishegnath's answer to What is your favorite Greek myth?",
            "date": "Answered May 20, 2018",
            "views": "18",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Roland Cor",
                    "user_href": "/profile/Roland-Cor"
                },
                {
                    "user_id": "Nathan Solis",
                    "user_href": "/profile/Nathan-Solis-4"
                }
            ]
        }
    ]
}