{
    "title": "If ghosts are not real, why do ghost stories seem so common? - Quora",
    "tags": [
        "Ghost Hunting",
        "Hauntings",
        "Ghost Stories",
        "Ghosts",
        "The Paranormal"
    ],
    "response": [
        {
            "author_info": {
                "name": "Kelly La Rue",
                "href": "/profile/Kelly-La-Rue"
            },
            "answer_text": "It's coming from people's real life experiences.  Most people aren't interested in scientist who say ghost don't exist but present no evidence to substantiate what they say. Ghosts are real and many people have experiences with them.  I've had many and also contacted people who have died or at least described them to the client accurately. Here are three of my experiences: A friend of mine and I were visiting some people. She went to the restroom andreturned to tell me she got a real bad feeling from a linen closet. I went withher to check it out and I was almost staggered by the malice radiating from thecloset. I had never before and have never since felt such pure animosity. Itwas palatable. Underlying the anger was a sense of hurt and betrayal. I sensed what needed to be done and talked my friend through apologizing to thisentity and asking for forgiveness. Suddenly the hatred lifted and I felt the spirit exit through the roof. Another time I was giving a reading to a client who told me she thinks her grandfather was with her. I felt this was true and continued talking with her. I became aware the grandfather was shouting at me \"shut up, shut up\". He didn't want his relationship with his granddaughter threatened. I ignored him. While a relative who has passed can be of great service to someone still living there are many others who are simply running a trip. In this case the grandfather was not helping and in fact was doing some harm. I sensed she would eventually reject his \"help\" so let it go. A warning would not have helped.  Some friends of mine lived in a haunted house. These were friends of mine from the University. Both had degrees. One went on tobecome an MSW and the other a police officer. These people were solid professionals, disciplined, grounded, and definitely not flaky. They described several experiences. I remember two. Their son was lying on the floor watching TV when a candlestick flew off the TV andlanded in front of him.  Another time the ghost was especially active and the wife yelled at it to be quiet.There was a pause then it clumped down the stairs into the basement went over to a corner and made sitting down sounds and remained quiet. For a while. Eventually it got so bad they freaked out and fled returning only to collect theirbelongings.   ",
            "date": "Answered March 21, 2016",
            "views": "16",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Praveen Kumar",
                    "user_href": "/profile/Praveen-Kumar-5837"
                },
                {
                    "user_id": "Ravi Mishra",
                    "user_href": "/profile/Ravi-Mishra-71"
                },
                {
                    "user_id": "Clare Verdins",
                    "user_href": "/profile/Clare-Verdins"
                },
                {
                    "user_id": "Tindi Crosbie",
                    "user_href": "/profile/Tindi-Crosbie"
                }
            ]
        },
        {
            "author_info": {
                "name": "Anna Demers",
                "href": "/profile/Anna-Demers"
            },
            "answer_text": "Ghost stories seem common and by some entertaining because of the spook factor.  When an unexplained event happens and no matter how you twist your mind around it,in order to find a logical explanation, it becomes surreal. Hence, I have an interesting event to share. For the record, I do not believe in god or angels or ghosts or anything of that nature. To this day, I still cannot wrap my head around these events that happened in my immediate family. In the month of February 10 years ago, if I remember well, one of my favourite aunts passed away at the age of 52 years old because of colon cancer.  Now, my aunt Rita was the wife my father's brother.  ( Bellesoeur in French. Ok, her husband and my father are brothers. So I was related to her by alliance. ) Anyway, it happened that Rita's mother was also on her death bed. She was quite elderly and very ill.  My aunt Rita passed away first. Her sisters, did not want to tell their dying mother.  We went to her funeral and as a family we grieved. Here is what I do not get.  The sisters did not tell their mother that Rita had died. Also, many felt guilty about leaving their dying mother alone in order to go to Rita's funeral. ( Talk about tough choices.) During the mass of Rita's funeral, their mother passed away.  Ok, so far, there is nothing weird about that right?  Here is what the nurse said to the immediate family a few hours after their mother had passed. Their mother appeared to be talking to someone. She seemed so serene and happy.  When the nurse asked her who she was talking to, she apparently turned her head and said to the nurse: \" Rita has come to get me. I am leaving soon. Please say goodbye to my loved ones for me.\"  Please remember. No one had told her that Rita, her daughter, had passed away.  If this is true, knowing my aunt Rita's way of thinking, it makes sense to wait until her mother is alone. Hence, the timing of her funeral would be perfect. I wonder, was the nurse lying? I mean, why lie about something like that anyway? Weird to me...  Now, fast forward to October the following year. ( I am translating to English the conversation you are about to read below.) I had a dream. I was with my aunt Rita. I do not remember if we were having tea or having a meal. Anyway, she was very very very angry. She was stating in no uncertain terms that she wanted flowers on her grave.  I told her: \" But you died in February last year. We brought all the flowers then.\" Her: \" I don't care. I don't want those flowers. I want red roses damit! ONLY red ones! I cannot believe that they forgot! I am so pissed right now!!!\"  She proceeded to use some very very colourful vocabulary. I suddenly woke up. I was drenched in sweat and it was around 4 o'clock in the morning. I immediately phoned my mother. I was so disturbed by this dream. My mom was not impressed with me calling in the middle of the night. ( Phone calls in the night usually mean bad news in my neck of the woods.) Anyway, my mom paused and I swear I heard her gasp. (She was quite close to Rita. They were best friends.) I heard my mom say: \" Anna, today is her birthday.\" Me: \" Mom, you have to promise me that you will go and put a dozen roses on her grave. I really do not want her to come to me in dream state pissed off like that. Seriously, promise me you'll go! I live too far. I cannot make it on time. You live close to the cemetary. Promise me you'll go. I'll pay for whatever the cost. Just make sure that you get the best looking dozen of  red roses you can find!\" Mom: \" I'll do it Anna. She did love those red roses too.\"  I have not dreamed of her since.  I have no idea why I dreamed that dream and on her birthday to boot. I simply do not have the capabity to imagine something like that.  By the way, I still do not believe in god, spirits, or ghosts. It must have been something I ate. Who the heck knows really. ",
            "date": "Updated April 5, 2013",
            "views": "129",
            "upvotes": " View 89 Upvoters",
            "upvoters": [
                {
                    "user_id": "Marcos Force",
                    "user_href": "/profile/Marcos-Force"
                },
                {
                    "user_id": "Abby Macaulay",
                    "user_href": "/profile/Abby-Macaulay"
                },
                {
                    "user_id": "Karen Aleta",
                    "user_href": "/profile/Karen-Aleta"
                },
                {
                    "user_id": "Chaitany Goyal",
                    "user_href": "/profile/Chaitany-Goyal"
                },
                {
                    "user_id": "Abhijith Reddy",
                    "user_href": "/profile/Abhijith-Reddy-19"
                },
                {
                    "user_id": "Susmita Bhattacharya",
                    "user_href": "/profile/Susmita-Bhattacharya-17"
                },
                {
                    "user_id": "Ramath Sundaran",
                    "user_href": "/profile/Ramath-Sundaran"
                },
                {
                    "user_id": "Fredricka Louise Baker",
                    "user_href": "/profile/Fredricka-Louise-Baker"
                },
                {
                    "user_id": "Yash",
                    "user_href": "/profile/Yash-271"
                },
                {
                    "user_id": "Ankita",
                    "user_href": "/profile/Ankita-364"
                }
            ]
        }
    ]
}