{
    "title": "If I am in the market for a new iPad, which one should I avoid? - Quora",
    "tags": [
        "Tablet Devices",
        "iPad",
        "Apple (company)",
        "Apple Products and Services",
        "Technology"
    ],
    "response": [
        {
            "author_info": {
                "name": "Kenny Cho",
                "href": "/profile/Kenny-Cho-17"
            },
            "answer_text": "As a user of every single iPad that came out, I can say that you should always go for the iPad Pro 11″ (or the larger version). The near bezel-less display just stands out so much when it comes to real estate as compared to the previous models. Many features are really dependent on the individual because everyone uses the iPad differently. However, anything that affects the display (e.g. higher refresh rate, better resolution, improved colour accuracy, better responsiveness) are all features that I feel are key to every user. That is because the display is something which you interact with constantly when you use the iPad, and therefore even the slight change will make your experience so much better. However, as Neel has mentioned, cost to value ratio is something that differs very vastly from one person to another. I’d say to weigh what you really need the iPad for and what are the features or extensions (e.g. Apple Pencil) you need before making your decision on which iPad to buy. A minor disclaimer would be to hold off purchasing until the Mar / Apr’s Apple announcement as a new iPad Pro is due for release soon. Even if you intend to not get the latest model, waiting for the new release will mean that the current model’s price will drop. So it’s a win-win situation. ",
            "date": "Answered February 28, 2020",
            "views": "29",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Jo Kuhn",
                    "user_href": "/profile/Jo-Kuhn"
                },
                {
                    "user_id": "Georgian Lucian Mihoc",
                    "user_href": "/profile/Georgian-Lucian-Mihoc"
                }
            ]
        },
        {
            "author_info": {
                "name": "Neel Rathod",
                "href": "/profile/Neel-Rathod-18"
            },
            "answer_text": "The pro. It is a great ipad but in my opinion its too big. The ipad is meant to be portable but I cant see you putting this in a backpack or anything. Also its pretty expensive, it can be around £1000 for the new one. Its simply not worth it. Lastly, because its so large and thin, this affects its strength so if you even sit on it or bend it the slightest amount, the whole screen will snap. This is due to an extremely poor design. And this damage can cost over £500 which is crazy. I reccomend the normal ipad or the ipad air. I really like the ipad mini but that snaps easily too. The normal ipad and ipad air are both a decent size, theyre not too small and not too big, and both have good specs, I think the ipad Air has the A12 chip which is the same as the iphone X. They are also mid ranged ipads. ",
            "date": "Answered February 23, 2020",
            "views": "123",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Georgian Lucian Mihoc",
                    "user_href": "/profile/Georgian-Lucian-Mihoc"
                },
                {
                    "user_id": "Thomas P. Buehner",
                    "user_href": "/profile/Thomas-P-Buehner"
                },
                {
                    "user_id": "Mihir Srivastava",
                    "user_href": "/profile/Mihir-Srivastava-32"
                }
            ]
        }
    ]
}