{
    "title": "If I like Nietzsche, who else should I read? - Quora",
    "tags": [
        "Friedrich Nietzsche (philosopher, author)",
        "Philosophy"
    ],
    "response": [
        {
            "author_info": {
                "name": "Dan Baker",
                "href": "/profile/Dan-Baker-45"
            },
            "answer_text": "This is a good question. I guess Nietzsche was kind of a primal scene for me, and I’ve spent a lot of time looking for acceptable substitutes. Nietzsche is a Romantic. He references Ralph Waldo Emerson as one of his favorite authors. So we know him. But if you haven’t read Thoreau’s Walden, check that out also. Reminds me of Nietzsche’s The Gay Science…Moby Dick. Very much shares Nietzsche’s titanic ambitions and sheer exuberance!Nietzsche is a taste-maker. Two taste-makers in his league, who cover culture and history with that same exhilarating sweep: R.H. Blyth’s Zen and Zen Classics… and Phillipe Sollers’s Women.Philosophers in the mid-20th century started to refer to the “masters of suspicion”. By which they meant: Nietzsche, Marx and Freud… Freud is fun to read; like Nietzsche he has personality… I can’t really speak for Marx, but probably should know something about him. Because, along with Darwin, I think that they've shaped the modern thought process.What’s a reasonably short work of Freud’s? I don’t know — how about Beyond the Pleasure Principle? It’s got an intriguing title! Pairs well with Genealogy of Morals and a nice bubble bath… Again, haven’t read Marx. If someone wants to mention something of his that is fun to read, I’m interested! Meanwhile, I can vouch for something by Paul Mason, called Postcapitalism. It covers the development of Marxism, after Marx, and moves very quickly… as Nietzsche would say, it’s tempo is presto. Speaking of the future, and historical sweep for that matter, you might read Yuval Noah Harari… both his Sapiens and his Homo Deus. Sapiens does historical sweep pretty well. And Homo Deus gives a foretaste of the trans-human… “Human being is something that must be overcome!” — and Harari will leave you convinced that it just might be!Finally, if you like Nietzsche, you should listen to some Wagner. As you know, Nietzsche remained obsessed with Wagner and his music all his life.Personally I have yet to become so enthralled with Wagner that I want to listen to 6+ hours of opera sung in German. But if you want to try something that is very easy to get into, maybe check out Edo de Waart’s set by Challenge Classics. He has orchestral adaptions of Tristan, Parsifal and Der Ring, that together run about 3 hours… Don’t listen to more than 3 hours, though — or you will become a rotten nihilist! ",
            "date": "Updated September 28, 2020",
            "views": "688",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Derusa Uzara",
                    "user_href": "/profile/Derusa-Uzara"
                },
                {
                    "user_id": "Joe Duncan",
                    "user_href": "/profile/Joe-Duncan-14"
                }
            ]
        },
        {
            "author_info": {
                "name": "Tim Regalado",
                "href": "/profile/Tim-Regalado"
            },
            "answer_text": "Excellent answers so far. I'll add a few not mentioned: Ralph Waldo Emerson- an early romantic who definitely influenced Nietzsche. Martin Heidegger- a contemporary and fellow German philosopher who is as important to modern thought as Nietzsche is. He is also good to read after Nietzche because he goes through a very interesting aesthetic transformation that is in itself very Nietzschean. Carl Jung- a psychologist whom Nietzsche was a very strong influence. Though I would not start with this from Jung, definitely read The Red Book. It went unpublished for many years because it was a philosophical exploration, very much like Thus Spoke Zarathustra, that would have undermined his scientific credibility. I think it's better than Zarathustra. Jordan Peterson- a modern psychologist and philosopher who idolizes Jung and Nietzsche, and does a very good job to resurrect the importance of the individual and romanticism of creating an interesting and heroic story out of ones own life. Powerful stuff here. Also an interesting political figure. ",
            "date": "Answered March 30, 2018",
            "views": "24",
            "upvotes": " View 7 Upvoters",
            "upvoters": [
                {
                    "user_id": "Joe Duncan",
                    "user_href": "/profile/Joe-Duncan-14"
                },
                {
                    "user_id": "Avery Herkel",
                    "user_href": "/profile/Avery-Herkel"
                },
                {
                    "user_id": "Shaun Barber",
                    "user_href": "/profile/Shaun-Barber-8"
                },
                {
                    "user_id": "Jenn Li",
                    "user_href": "/profile/Jenn-Li-9"
                },
                {
                    "user_id": "Rick Merritt",
                    "user_href": "/profile/Rick-Merritt-1"
                },
                {
                    "user_id": "Ashton Hennessy",
                    "user_href": "/profile/Ashton-Hennessy"
                },
                {
                    "user_id": "Felipe Nachamkes",
                    "user_href": "/profile/Felipe-Nachamkes-1"
                }
            ]
        }
    ]
}