{
    "title": "If I do not market my eBook and I am a debut author, is KDP Select good for me? - Quora",
    "tags": [
        "Amazon KDP",
        "Amazon Kindle Direct Publishing",
        "Self-Publishing",
        "Publishing",
        "eBooks",
        "Writers and Authors"
    ],
    "response": [
        {
            "author_info": {
                "name": "Timothy Ellis",
                "href": "/profile/Timothy-Ellis-4"
            },
            "answer_text": "It’s not good or bad. Kindle Unlimited (KDP Select for authors) relies heavily on visibility for people to find your book. So sales and reads all depend on visibility. If you launch your book with zero marketing, it will simply vanish into the Kindle abyss. Most established authors use an email list to launch with, along with Facebook groups and pages. The use social media. The object is launch with as many sales on day 1 as possible. The higher the rank you make on day 1, the more visible your book is on KU, and the more reads you get on day 2. The combination of both decides how day 3 goes. With most books, the launch is as good as it gets, and they slide from there. Those who start an AMS ad on day 1 (or FB or Bookbub ads) as soon as they get the url of the book, usually get some sort of boost on day 2. A good ad, can be the difference between hanging in there for a week or 2, or dropping into the abyss immediately. An AMS ad with a daily limit of $10, can be all you need for a week, to spark interest on KU. But you need to get your keywords right, and your ad slogan hooking people. Word to the wise for the new author: Get the book professionally edited.Get a professional looking cover, even if its a cheap pre-made.Write a blurb which entices the reader into the sample.Make sure the first 10% of the book is completely error free.Get any of these wrong, and even advertising will not bring you KU reads. KU is not the magic book launcher. Its what happens when everything else is right, and the book launches well. ",
            "date": "Answered April 12, 2018",
            "views": "298",
            "upvotes": " View 3 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Raunak Residency Thane",
                    "user_href": "/profile/Raunak-Residency-Thane"
                },
                {
                    "user_id": "Shawntell Roberson",
                    "user_href": "/profile/Shawntell-Roberson"
                },
                {
                    "user_id": "Rowan Russell",
                    "user_href": "/profile/Rowan-Russell"
                }
            ]
        },
        {
            "author_info": {
                "name": "Indra Neel",
                "href": "/profile/Indra-Neel-9"
            },
            "answer_text": "A2A. I’m yet to use it, so I’m unable to comment on how good or bad it is. However as I do intend to use it, I’ll only say this much that marketing just improves the scope of the sales. I would suggest a thorough reading of the KDP TnC for a more accurate understanding of what steps it uses to market the book. And thereby, help you arrive at a more well thought out decision. Good Luck :) ",
            "date": "Answered April 15, 2018",
            "views": "45",
            "upvotes": " Answer requested by Arinjay Ghosh"
        }
    ]
}