{
    "title": "If I wanted to learn about Greek mythology, what would be the best book to read? - Quora",
    "tags": [
        "Buddha and His Dhamma",
        "Learning Advice",
        "Education Book Recommendations",
        "Advice About Books",
        "Greek Mythology",
        "Mythology",
        "Learning",
        "Book Recommendations",
        "Books"
    ],
    "response": [
        {
            "author_info": {
                "name": "Filippo Tam",
                "href": "/profile/Filippo-Tam"
            },
            "answer_text": "“The Greek Myths” by Robert Graves. A complete and enjoyable text which I’ve read since I was 8 and never stopped: an enourmous source of information about the Greek world.“Theogony” by Hesiod. Often times, after studying on text books, it comes the time to read the classics. And most of the time, classics also happen to be more interesting and full of content than dry textbooks. Hesiod, possibly the earliest Greek poet along with Homer, wrote his major work in attempting to collect and systematically structure in a long poem the whole set of myths and oral traditions which existed so far about the origins of Gods (theogony) and of universe itself (cosmogony). The poem, although elevated style may be a hurdle (there are plenty of worthy commented editions available), provides a rich useful insight into Greek mythology passed on from the dawn of Greek civilizations to 8th century BCE.The “Bibliotheca” of Pseudo-Apollodorus. Written about one millennium after Hesiod’s Theogony by an unidentified author, the “Bibliotheca” (Library) is the most complete compendium of Greek mythology ever written in Greek. Arranged in three books, it skillfully summarizes the set of myths and heroic epic, from cosmogony to the nòstoi (the homecoming of Greek kings after the destruction of Troy.)“Iliad” and “Odyssey” by Homer. Whoever Homer was, despite his timeless fame, it’s never been clear and probably will never be. Nonetheless, “his” Iliad and Odyssey, two 24-books each epic poems, have historically been held as the first actual - and major - works of Greek literature. Anyway Iliad, by telling the last days of the siege of Troy and especially the devastating outcome of Achilles’ wrath, and its “sequel”, Odyssey, through the narration of Odysseus’ homecoming, incidentally come to give the most valuable knowledge about Gods’ world and the relationship “existing” between mortals and deities.The “Argonautica” by Apollonius Rhodius. Apollonius Rhodius was an Alexandrian poet who wrote in 3rd century BC. His “Argonautica”, as the name suggests, deals with the deeds of Jason and his Argonauts. As the author was a scholar and a librarian, his work naturally incorporates insight into geography, ethnography and mythology.These above are the 5–6 works which I deem to be the best when it comes to Greek mythology. In addition you can look up for Ovid’s Metamorphoseon libri, written in Latin by the greatest Latin poet, but deeply influenced by Hellenistic literature and massively incorporating Greek mythology. Unfortunately, I’m not familiar with TV series, movies or Internet resources in English which provide such a vaguely systematic knowledge, but I feel I can suggest that you take a look to Rick Riordan’s Percy Jackson series, as long as you’re looking for some less “literary” sources: to tell the truth, Riordan, by using myths somehow “retold” and “made suitable” to modern times, did an excellent job and possibly succeded to bring thousands of young men closer to the world of the Ancient Greeks. Hope this helped a bit. ",
            "date": "Answered January 29, 2017",
            "views": "175",
            "upvotes": " View 81 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Bhavin Singh Solanki",
                    "user_href": "/profile/Bhavin-Singh-Solanki-2"
                },
                {
                    "user_id": "Ashiyan Ahmed",
                    "user_href": "/profile/Ashiyan-Ahmed"
                },
                {
                    "user_id": "Sai Sharan Karri",
                    "user_href": "/profile/Sai-Sharan-Karri"
                },
                {
                    "user_id": "ZoubairDid It",
                    "user_href": "/profile/ZoubairDid-It"
                },
                {
                    "user_id": "Hans Schlierf",
                    "user_href": "/profile/Hans-Schlierf"
                },
                {
                    "user_id": "Tejal Patil",
                    "user_href": "/profile/Tejal-Patil-34"
                },
                {
                    "user_id": "Rasika Kale",
                    "user_href": "/profile/Rasika-Kale-10"
                },
                {
                    "user_id": "Lucero Martinez",
                    "user_href": "/profile/Lucero-Martinez-42"
                },
                {
                    "user_id": "Lukas Kat",
                    "user_href": "/profile/Lukas-Kat"
                },
                {
                    "user_id": "Daeun Kim",
                    "user_href": "/profile/Daeun-Kim-47"
                }
            ]
        },
        {
            "author_info": {
                "name": "Lavanya Annette Mohanraj",
                "href": "/profile/Lavanya-Annette-Mohanraj-1"
            },
            "answer_text": "The Iliad and the odyssey by homerIf you're looking for real historical literature. Another alternative would be Rick riordans book, mostly targeted to a teenage audience. Percy Jackson and the Olympians. It's got a story of its on but a newbie to Greek mythology would still learn a lot of facts and tidbits. Then there are authors like David gimmel and Mary Renault who've written a lot of novels accurate to the events of the original greek mythology. My personal favourite is the song of Achilles by Madeline Miller.It's so beautifully written. It's the story of Achilles growing up with Patroclus. Also see goddess of Troy by PC Cast for a more fun and light read about the events of the Trojan war, but it's more of a fanfiction of the Iliad more than anything. It's about a mortal woman of the 21st century who is thrown back in time and wakes up in the body of a Greek princess who is Achilles's war prize bride and she changes the end of the tragedy for the better... Yeah incredibly cheesy I know hahah Happy reading! ",
            "date": "Updated March 16, 2018",
            "views": "22",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Suzan Levesque",
                    "user_href": "/profile/Suzan-Levesque"
                },
                {
                    "user_id": "Vanshika Walia",
                    "user_href": "/profile/Vanshika-Walia-1"
                },
                {
                    "user_id": "Anne Mohanraj",
                    "user_href": "/profile/Anne-Mohanraj"
                }
            ]
        }
    ]
}