{
    "title": "If integrity is doing the right thing when no one is looking, how do you spot integrity in others? - Quora",
    "tags": [
        "Integrity",
        "Honesty",
        "Morals and Morality",
        "Psychology of Everyday Life",
        "Philosophy of Everyday Life",
        "Human Behavior"
    ],
    "response": [
        {
            "author_info": {
                "name": "Vesil Vex",
                "href": "/profile/Vesil-Vex"
            },
            "answer_text": "First, “doing the right thing” is a tricky concept. What may be considered by you to be the right thing may not be the same for others. For example, you may think that abortions are immoral. Others, of course, completely disagree with you. So “doing the right thing” is based on perceptions, not definitions. Second, integrity requires observation. For someone to look at someone else and say, “that is a man of integrity” requires observation. I don’t see how it’s possible for someone to prove integrity without observational proof. Therefore I don’t think integrity IS doing the right thing when no one is looking. That doesn’t seem accurate. Instead, I would say that integrity is more about holding to your own set of beliefs, and sticking to them, even when challenged by others. I may disagree with whether or not you support or do not support abortions, but just because I disagree doesn’t mean you lack integrity. Especially if you really, truly believe what you are saying and can back that up with examples. There’s a difference between integrity and morality. ",
            "date": "Answered March 27, 2018",
            "views": "23",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Leveel Rush",
                    "user_href": "/profile/Leveel-Rush"
                }
            ]
        },
        {
            "author_info": {
                "name": "Manfred Kramer",
                "href": "/profile/Manfred-Kramer"
            },
            "answer_text": "Integrity is not only \"doing the right thing when no one is looking\"... It's a much broader concept and you can't actually \"spot\" it in others just like that. Even though I wish I could! That would've helped a lot in the past. ;) I think there are only two ways one has a chance of finding that out. The short way and the long way. The short way is doing a careful research about the reputation of that person. If that brings up a consistent record of reputable deeds one can come to some sorts of conclusion about the integrity. The long way: You have to experience that person yourself in different situations and you have to talk with that person about her view on diverse situations. Experiencing the reactions of that person in real life situations is more significant than what she tells you. Words are not really that meaningful, actions are! ;)One last word. DEFINE for yourself first what YOU think integrity encompasses... ",
            "date": "Answered September 25, 2014",
            "views": "62",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "John Florido",
                    "user_href": "/profile/John-Florido"
                }
            ]
        }
    ]
}