{
    "title": "If I self publish my debut novel, will this hurt my chances of getting traditionally published for a different novel? - Quora",
    "tags": [
        "Self-Publishing",
        "Book Publishing",
        "Publishing",
        "Novels",
        "Books"
    ],
    "response": [
        {
            "author_info": {
                "name": "William D. Richards",
                "href": "/profile/William-D-Richards"
            },
            "answer_text": "No. If anything, it might enhance your chances because you will have a proven sales record. Many publishers and agents have been actively cherry-picking the bestsellers lists on Amazon looking for fast moving new titles among the self-published authors. Not only do they find a hot, new author, but that author already has a proven track record for sales and a following of fans, so they are almost guaranteed to make money. Aaaaaand…yes. It could be that you are just not that good a writer/storyteller. Or, you could have pushed your book up without much editing, making it very unpopular. The fact that you are willing to push up sub-standard material without any quality assurance (QA) for your customers (readers) shows you might be the kind of writer publishers/agents don’t want to work with. ",
            "date": "Answered December 26, 2017",
            "views": "341",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Edward Conway",
                    "user_href": "/profile/Edward-Conway"
                }
            ]
        },
        {
            "author_info": {
                "name": "A. D. Davies",
                "href": "/profile/A-D-Davies"
            },
            "answer_text": "No. Publishers are businesses. If you do well with your first novel it’ll strengthen the possibility of a deal. Heck, if it does REALLY well, it's not unheard of for publishers to pick up your self published novel to go even wider. Look what happened with Andy Weir and his debut The Martian. If you're worried about your novel bombing or getting bad reviews that harm any future reputation you might garner, use a pen name for now. Or just initials and a surname. You can always change it back later if you choose. ",
            "date": "Answered December 26, 2017",
            "views": "452",
            "upvotes": " View 5 Upvoters",
            "upvoters": [
                {
                    "user_id": "Edward Conway",
                    "user_href": "/profile/Edward-Conway"
                },
                {
                    "user_id": "Brendan McNally",
                    "user_href": "/profile/Brendan-McNally"
                },
                {
                    "user_id": "Nik Tavakolian",
                    "user_href": "/profile/Nik-Tavakolian"
                },
                {
                    "user_id": "Barbara Dent",
                    "user_href": "/profile/Barbara-Dent-2"
                },
                {
                    "user_id": "Trinh Quoc Anh",
                    "user_href": "/profile/Trinh-Quoc-Anh"
                }
            ]
        }
    ]
}