{
    "title": "If I self-publish a book in four formats (e.g. hardback, large paperback, small paperback, ebook) do the sales (on Amazon, or wherever) count as one book or four separate titles? - Quora",
    "tags": [
        "eBook Publishing",
        "Advice About Books",
        "Self-Publishing",
        "Amazon Kindle (product)",
        "Book Publishing",
        "Publishing",
        "eBooks",
        "Amazon.com (product)",
        "Amazon (company)",
        "Books"
    ],
    "response": [
        {
            "author_info": {
                "name": "Russ Davis",
                "href": "/profile/Russ-Davis-4"
            },
            "answer_text": "As Michael noted, yes, you need a different ISBN for each format. Assuming you have entered the format and specifics in Books-In-Print the ISBN will tie to and define that given format. Where a Kindle eBook does not need an ISBN since they do not index the book by an ISBN, most venues will want an ISBN for other electronic formats like ePub. I saw a copyright page on a bible one time that listed a half dozen ISBN numbers. The content was identical for all editions, but the different color used on the leatherette cover (red, blue, black, etc.) was noted that made each a unique edition. Retailers and wholesalers will use the ISBN and specifics they fine to order a red cover bible, or a large print version, or a hard back edition. ",
            "date": "Answered September 14, 2020",
            "views": "170",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Earl Dingman",
                "href": "/profile/Earl-Dingman-1"
            },
            "answer_text": "Generally dashboards are broken into EBOOKS and PRINT BOOKS. So all your print books would be bulked together, however you can tell what sold by the size of the royalty you got. So would EBOOKS through Ingram, Smashwords, Draft2Digital, but since Amazon is only Kindle you know what you got there. Amazon ALSO has a separate dashboard for the Kindle Unlimited page by page read. Amazon also segregates the dashboard by book titles, but I’ll wager small editions are still bulked under the same title. Amazon doesn’t do hardback so you have to use Ingram Spark. Also understand you need a separate ISBN for all different editions. ",
            "date": "Answered September 14, 2020",
            "views": "2",
            "upvotes": " Answer requested by Gled Wood"
        }
    ]
}