{
    "title": "If I want to become wealthy as a 18 year old, should I invest in real estate or start a business? - Quora",
    "tags": [
        "Personal Investment Advice",
        "Real Estate Advice",
        "Investing Advice",
        "Business Advice",
        "Personal Finance Advice",
        "Real Estate Investing",
        "Real Estate",
        "Investing"
    ],
    "response": [
        {
            "author_info": {
                "name": "Steven Linh",
                "href": "/profile/Steven-Linh"
            },
            "answer_text": "I think invest in real estate is berter option for you. I have some tips for you when you start investing in real estate. 1) Location is prime so check it deep down- There are buyers who purchase properties without even understanding the value of location which is not appropriate because it’s important to have a grip on what kind of location it is and how beneficial it is from the investment point of view. So before only clear the complete benefit of location and analyze how effective it is going to be in the future. 2) Be clear about what kind of investment you want to make? As there are two options residential or commercial so before hand as per your budget and purpose choose your option. 3) Sit with someone and get the right direction of investment so that whatever you invest in you have surely that you will reach your goal. Selecting property is still not a child’s play but with right way you can fetch your dream property. 4) Don’t fall for attractive properties- it’s not appropriate to fall for those properties which are only attractive and which can offer better lifestyle because along with this there are many other things which are important to mull over so that there are chances of obtaining better benefits from all the angles. 5) Know all the best real estate players in the market- it’s important to know the Builder and understand how better they are in delivering the properties and above everything, how customer oriented they are and what kind of properties they offer to there customers in order to make better society and wide range of options to enjoy. Finding the vista apartment for rent at Modoho if you want to invest real estate in Viet Nam. Good luck and hope this help ",
            "date": "Answered August 18, 2016",
            "views": "233",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Rishesh Singh",
                "href": "/profile/Rishesh-Singh-1"
            },
            "answer_text": "I agree with Jillayne Schlicke in the fact that you should “invest in your brain”. I would say it differently….invest in yourself. Do you consider yourself an expert in real estate or do you have other skills you could capitalize on by starting your own business? Go with your strengths….if you know enough about the real estate market then dive into that. Personally, I would avoid real estate right now because it seems the market has peaked right now (based on several factors, the easiest to follow being $VNQ (the vanguard reit ETF….chart attached). If you have a good skill set for flipping houses then that chart doesn't matter too much. But if you know how to do something else in a way you'd find profitable, I would go with that. If you want ideas, tell me what you're good at and I'll help you brainstorm.  ",
            "date": "Answered July 17, 2016",
            "views": "235",
            "upvotes": "0"
        }
    ]
}