{
    "title": "If Superman’s powers come from a yellow sun, wouldn’t he die from interstellar travel? - Quora",
    "tags": [
        "Superman (creative franchise)",
        "DC Comics"
    ],
    "response": [
        {
            "author_info": {
                "name": "Rui Silva",
                "href": "/profile/Rui-Silva-85"
            },
            "answer_text": "Do they come from the sun? Oh, I'm not so sure about that. Here's one example why I say that…  140 gigawatts of solar energy at any given moment… It's funny how Superman does that, seeing the Earth only really receives in optimal conditions, about 300 watts of solar energy for square meter, in a entire day. So where do those 140 gigawatts come from? Superman's old concept, that he's a solar battery, doesn't apply at all. And it doesn't apply mostly because of how inconsistent it's. Here's more proof of that…     So. Basically the same scenarios but with different results. In one case Superman takes minutes to lose his powers, and in the other one he basically says that red solar energy just stops him from being able to recharge his powers. So he's either a solar battery and thus as long as he has stored energy in his cells, he can keep his powers active. Or he isn't a battery but rather a conductor of solar energy. And the minute it goes away so go his powers. Problem being that writes play with the two scenarios. I can accept that Superman gets his powers from the Sun but not as it's explained. Because as it's explained, makes absolutely no sense. In my personal opinion Superman powers should be explained to work like this... Superman doesn't get his powers from sunlight, but rather from the start itself. That the kryptonian physiology, quantum entangles to the star closest to the kryptonian. And thus the kryptonian draws energy directly from the star. And the powers remain working as long as the connection isn't broken by red solar energy.Sunlight is just a catalyst. Superman doesn't really gets his energy from the Sun, but from the entire EM Spectrum. Once exposed to the Yellow Sun, Superman body starts to draw energy from the entire EM spectrum, or better yet, from the Electromagnetic Force itself. His body storing some energy but not too much. His body main function would be that of a kind of biological superconductor. That once exposed to red solar energy his body starts to draw less and less energy, until it stops completely.But in both cases Superman should be able to sustain his powers as long as he didn't drained the energy still present in his body. Both these cases would explain how and why Superman can travel through space without having any star around to recharge his powers, but they are recharged all the same. The longest period of time I saw Superman traveling through space, without any star present to recharge his powers, was two months. While at the same time, traveling at a speed of trillions of times, the speed of light.  Superman flies from the edge of the observable Universe to Earth in 2 months. If the distance between Earth and the observable universe is 13.8 billion light years, then Superman was flying MORE than 5 trillion times faster than a photon. This scan is not only a speed feat it's also a durability and stamina feat, considering that he survived flying through a black hole, and the time he flew without having any star to recharge his powers (Photon = Speed of light) So there's no way Superman can get all that energy from one star alone. Especially if he had none to recharge his powers during those two months. Not only that Superman wasn't even flying with his powers at 100%, as showned by this scan…  So as I see it. Sunlight or the proximity to a G Class star, works only as the trigger to activate Superman powers. But isn't what's actually fueling them. ",
            "date": "Answered September 20, 2017",
            "views": "44",
            "upvotes": " View 29 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Rowan Schoon",
                    "user_href": "/profile/Rowan-Schoon-2"
                },
                {
                    "user_id": "Loke Alfabet",
                    "user_href": "/profile/Loke-Alfabet"
                },
                {
                    "user_id": "Jalil Riley",
                    "user_href": "/profile/Jalil-Riley"
                },
                {
                    "user_id": "Evan Kent",
                    "user_href": "/profile/Evan-Kent-16"
                },
                {
                    "user_id": "Shin Akuma",
                    "user_href": "/profile/Shin-Akuma-5"
                },
                {
                    "user_id": "Fahim Ali",
                    "user_href": "/profile/Fahim-Ali-3"
                },
                {
                    "user_id": "AR Lancelot",
                    "user_href": "/profile/AR-Lancelot"
                },
                {
                    "user_id": "Nitesh Goolab",
                    "user_href": "/profile/Nitesh-Goolab"
                },
                {
                    "user_id": "Nicholas Liaskos",
                    "user_href": "/profile/Nicholas-Liaskos"
                },
                {
                    "user_id": "Scott Somerville",
                    "user_href": "/profile/Scott-Somerville-3"
                }
            ]
        },
        {
            "author_info": {
                "name": "Phoebe Perlman",
                "href": "/profile/Phoebe-Perlman"
            },
            "answer_text": "You mean if he tried to fly there? Yes, I believe he would. As long as he didn't pass any yellow suns on the way there. Even if he tried to store as much yellow sun radiation in his cells as he could, he would run out in 5 months. The way I see it, he would have more and more trouble flying. He suddenly feels freezing. He needs to breathe. After a few minutes he's unconscious. Soon, he's dead. But maybe he can go faster than 10 times the speed of light. The annoying thing about Superman is that he doesn't have defined powers. His strength levels and speed change with every author. So it's hard to say. In some versions, yes, he'd die. But in others, I'm sure he's OP enough to live. But keep in mind if he went on a spaceship he'd be fine because he doesn't need his powers to live. They could bring stored up solar energy with them. ",
            "date": "Answered July 29, 2017",
            "views": "867",
            "upvotes": " View 3 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Stanley Okimoto",
                    "user_href": "/profile/Stanley-Okimoto"
                },
                {
                    "user_id": "Drew Golden",
                    "user_href": "/profile/Drew-Golden-6"
                },
                {
                    "user_id": "Evangeline Chen",
                    "user_href": "/profile/Evangeline-Chen-2"
                }
            ]
        }
    ]
}