{
    "title": "If you wish to invent something, what would you invent and why? - Quora",
    "tags": [
        "Wishes ",
        "Invention and Inventions",
        "Technology",
        "Hypothetical Scenarios"
    ],
    "response": [
        {
            "author_info": {
                "name": "Atriya Biswas",
                "href": "/profile/Atriya-Biswas"
            },
            "answer_text": "Lots of fascinating inventions are evolving every year around us causing some serious disruptions in every aspects that could not even be imagined. Invention is not an easy task, instead it is a ramification of extensive brainstorming, hardship, desperation and last but not the least huge perseverance. So I could have obtained a chance to devote myself completely and vigorously in the process of inventing something new, I would love to develop a machine which can make human being always happy and satisfied. The process of making someone satisfied starkly from a state of dissatisfaction is little science fictional and way beyond physical feasibility. But if we turn around the pages of history containing all the miraculous and spectacular inventions, they are always out of people’s thinking ability and beyond expectation. When a human being will feel dissatisfied crumbled with lots of disquietude, the machine or gadget will perceive his/ her emotions by reading his/ her brain signals and measuring heartbeat and other daunting measurements. Apart from the measuring task, the gadget has to be calibrated with certain parameters related to the amount of dissatisfaction and satisfaction. There would be a closed loop feedback control which will acutely keep eye on respective human’s behavior and movement for comparing the amount of trepidation and discomfort. The other measuring system will closely keep eye on the adrenaline secretion which readily connected with the person’s anxiety. The rest of the working principle depends on the actuation ability of the gadget that how it revamp the mental condition of it’s host person. This actuation system will trigger some sensory receptors which will enact on our brain in terms of transmitting different set of signals from one Neuron to adjacent Neuron in chemical forms. Stability will be recovered within minute fraction of time. The application of the gadget is very helpful in reducing crime in our societies. As people will be less prone to become angry and envious to others, the vindictive mentality will certainly perish leading to a disharmony free world. ",
            "date": "Answered July 15, 2016",
            "views": "232",
            "upvotes": " View 14 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Michelle Iweala",
                    "user_href": "/profile/Michelle-Iweala"
                },
                {
                    "user_id": "Fahad Aslam",
                    "user_href": "/profile/Fahad-Aslam-21"
                },
                {
                    "user_id": "Josephine Claire Salem",
                    "user_href": "/profile/Josephine-Claire-Salem"
                },
                {
                    "user_id": "Swati Dhariwal",
                    "user_href": "/profile/Swati-Dhariwal-6"
                },
                {
                    "user_id": "Lovely Mae Lachica",
                    "user_href": "/profile/Lovely-Mae-Lachica"
                },
                {
                    "user_id": "Javed Malik",
                    "user_href": "/profile/Javed-Malik-202"
                },
                {
                    "user_id": "Cristi Haley",
                    "user_href": "/profile/Cristi-Haley"
                },
                {
                    "user_id": "Joseph Horton",
                    "user_href": "/profile/Joseph-Horton-35"
                },
                {
                    "user_id": "Loveleen Kalra",
                    "user_href": "/profile/Loveleen-Kalra"
                },
                {
                    "user_id": "Yogesh Kalra",
                    "user_href": "/profile/Yogesh-Kalra"
                }
            ]
        },
        {
            "author_info": {
                "name": "Phoenix D. Dorje",
                "href": "/profile/Phoenix-D-Dorje"
            },
            "answer_text": "Oh boy oh boy time for some (mostly ethical) inventions. First off a new weapon for law enforcement in the form of a pistol that fires special charges about as big as a 9mm round that zaps a target with enough power to nock an average human unconscious officers would keep two magazines of these nock out rounds and two magazines of normal 9mm. For the fire fighters a hand grenade that will blast Out cooling foam to douse a room that’s fully engulfed in flame to get through to trapped victims. In the medical field cybernetics made from carbon fiber that locks into the nervous system to react the same way as the arm used to buy with 5 times the strength and speed as a normal human. For military a plasma rifle that uses cartridges filled with hydrogen that is then hit with massive amounts of electricity to turn the gas to plasma and an electromagnetic field in the barrel to insure it keeps shape as it exits the barrel and hits a target (I’m not entirely sure how long it would hold shape any one with more than my current knowledge who can tell me it would be appreciated.) the plasma will melt through nearly all armor except for my next one. An alternating electro magnetic field generator meant to be deployed over a position or in a tank to stop missiles and artillery shells as well as disrupt the magnetic field of plasma bolts. Now back in two thousand four the British military experimented with this idea but do to power issues they haven’t gotten it to work even in small pulses. So I stole this idea and for the question I want the perfected version. In terms of aviation a plane capable of hitting mock 5 at 100,000 feet. For space travel a ship designed of the sr-71 (cause it’s bad ass looking)that uses cold fusion to power the engines and capable of creating worm holes that last for three seconds then disperse ( the real world problem is negative mass particles are required to sustain the worm hole Which are Highly theoretical) And for shits and giggles a drug that freezes degradation of the cells in a person to freeze the aging process. Now I’m aware realistically most of this won’t work I don’t know enough yet to say that any of this can work realistically I’m 15 after all but the question didn’t say anything about realism it has the word “wish” so science fiction works for now and I’d like to know what’s wrong with these. ",
            "date": "Answered May 13, 2019",
            "views": "72",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": " Purohit",
                    "user_href": "/profile/Purohit-1"
                },
                {
                    "user_id": "JT Clark",
                    "user_href": "/profile/JT-Clark-10"
                }
            ]
        }
    ]
}