{
    "title": "If you could choose one book as a mandatory read for all high school students, which book would you choose? - Quora",
    "tags": [
        "Educational Books",
        "High School Students",
        "Fiction",
        "Literature",
        "Students",
        "Book Recommendations",
        "Books"
    ],
    "response": [
        {
            "author_info": {
                "name": "Skip Maloney",
                "href": "/profile/Skip-Maloney"
            },
            "answer_text": "Tough to narrow it down to a single book. There are so many that high school students should read. If there were a book that extolled the virtues of the importance of reading, I’d vote for that. I would think that a course that required a thorough reading and comprehension of the Declaration of Independence and the US Constitution would be of lasting value (our President should take the course), although the documents aren’t really books. Part of the selection problem here is the multiplicity of issues that one might wish a high school student to address; personal responsibility, the nature of politics, the ins and outs (so to speak) of sex, foods to avoid, the benefits of sports. I mean, you could go on and on. Trying to narrow options down to one ‘must read’ for the group, while being aware that each member of the group is wildly different, is a tricky exercise. I’m going to go out on a limb here and opt for a book that doesn’t really offer any life lessons, or attempt to broaden one’s knowledge about a specific subject. Rather, it’s a book that I think high school students, all of the different types of them, would just enjoy and probably laugh out loud about. The book would, I suspect, open a few high school eyes to the fact that reading doesn’t have to be a grim task designed to force a lesson down your throat. It can just be fun. That said, I doubt seriously whether it would ever be approved for the classroom, because it deals rather explicitly with sex and one male human being’s attempt to get laid. The male, a little older than high school age, is called Chip Harrison and he’s the central character in a series of novels written by Lawrence Block. In the first of this series (the one I’d choose as THE book to read), called No Score, the young man in the opening pages is right on the verge of discovering the joys of sex. It’s all there for him. The woman, the setting, the anticipation, the wonder, the touch of anxiety, the whole shebang (so to speak). He is just about to consummate this scene, when a man bursts in the door and fires a gun. Thus begins a rather whirlwind mystery story that while maintaining its focus on the young man trying to have sex for the first time (and the opening attempt is far from his only attempt as the book progresses) but manages, too, to engage the reader in the puzzle of a whodunnit suspense story. I go back and re-read this book from time to time and it stills makes me laugh. I think that is the key to my belief that it’s a must read for high schoolers. Not only does it talk about something that is certainly on their minds a lot during that four years of their lives, but it does so with a keen sense of humor, while, at the same time, leading them down the path of a fast-paced mystery. The “always on the brink, but never quite getting there” predicament of Chip Harrison will keep them amused as Lawrence Block takes them on a journey of literary craftmanship, which, hopefully, will instill in them a desire to read more, and not just about Chip Harrison, but about anything they can get their hands on (so to speak), in pursuit of a similar level of enjoyment. In this regard, I believe the novels in the Chip Harrison series (ready for this? No Score, Chip Harrison Scores Again, Make Out With Murder, and the Topless Tulip Caper) are a “key” that has the potential to unlock for teenage minds, the joys of reading. ",
            "date": "Answered June 27, 2019",
            "views": "169",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Charles O. Slavens",
                "href": "/profile/Charles-O-Slavens"
            },
            "answer_text": "“Guns, Germs, and Steel”author: Jared Diamondpublished 1997 – winner of Pulitzer Prize for non-fictionWhy were some groups of people on different continents able to surpass the accomplishments of people elsewhere who had equal capabilities? That is the question addressed by evolutionary biologist, Jared Diamond –Professor of Geography and Physiology, UC - in this book. His provocative observations and conclusions destroy the foundations on which views of so-called racial superiority are based. His thoughts continue the efforts of Professor of History Yuval Noah Harari (“Sapiens”), and documentary prize winner and Senior Fellow at the Hoover Institution, Niall Ferguson (“Civilization”). Both of whom I’ve commented upon in previous blogs.How were civilizations in Europe and Asia able to advance in the domestication of plants and animals, writing and acculturalization while others in the Americas, Africa, and Australia, lagged thousands of years behind? Why didn’t the people of North America, Australia or South Africa sweep across the other continents and dominate the inhabitants and spread their culture?Mr. Diamond begins his account of the uneven development of various societies starting at the end of the last Ice Age, about 13,000 years ago. Beginning way before that, about 70,000 years ago (Harari “Sapiens”) the first humans emerged from east Africa and spread north, branching west to Europe and east to China. Given that tremendous time advantage, you’d think that they should have led the rest of the world, wherever they ended up. Logically they should have been the first in the domestication of plants and animals and in the development of larger and larger groups; eventually establishing cities. But… it didn’t happen… and why it didn’t happen is an adventure, revealed in “Guns, Germs, and Steel”. One of the biggest factors favoring Europe and Asia is an area in the Middle East called the Fertile Crescent. It is an area bordering the eastern Mediterranean, now occupied by Iraq, Syria, Lebanon, Cyprus, Jordan, and Israel. It is commonly referred to as the “birthplace of civilization”. Other areas were also favored with their Mediterranean type climate, but not all their other advantages. The key to the rise of pockets of civilization across the globe began to emerge 10,000 to 8500 BC with the discovery of the domestication of plants - followed by the domestication of animals soon after, about 8000 BC. The Sahel (central and western Africa) was equally favored by weather and a proliferation of wild plants. However, the Sahara to the north and the dense jungles to the south limited the Sahel’s expansion. There are over 200,000 species of wild flowering plants, but not all of them are edible and contain enough food value to fulfill human nutritional needs. Those needs are today fulfilled by about 80 species; the cereals – wheat, corn, rice, etc., and potato, manioc, banana and sugar beets. All of which were domesticated thousands of years ago – not one new plant has been added in modern times. I want to emphasize that plant domestication takes time, patience and incentive. Also, keep in mind that not all of the areas of the world have domesticable plants and animals…. and not all the peoples of the world took advantage of the local plants and animals that could be domesticated. One of the reasons being that the areas where they lived were rich in edible wild plants and teamed with wildlife that would sustain the hunter-gatherer life style that they’d relied upon for thousands of years. The Fertile Crescent was favored by an unusually high diversity of plants and animals that could be domesticated. It had a mild climate with wet winters and dry summers favorable to fast-growing annual plants, specifically wheat, that produced big seeds, high in protein and were storable by humans. Other areas, eastern Asia and the Americas, produced rice and corn, both of which had less nutritional value. Chile had two of the most important cereals and California and Southern Africa just one each… Australia had none. So… where is this leading? Hunter-gatherers in favorable areas soon learned that they could survive on domesticated plants and gave up their wandering life-style. Their small family groups soon became tribes that settled in one area and turned to farming for their primary source of protein. Larger groups demanded a different social structure, which required organized effort beyond the immediate family… this was the beginning of the process of civilization. About 500 years later (8000 BC) those hunter-gatherers-turned-farmers in the Fertile Crescent began the process of big animal domestication. Again the Fertile Crescent offered significant advantages over other parts of the world. The Fertile Crescent had pigs, goats, sheep, and cows that were adaptable to domestication. This concentration of suitable animals that led to herding, did not exist in any of the other Mediterranean zones scattered across the globe.  Mesoamerica (southern Mexico and Central America) had two animals, the dog and the turkey. Neither of these could be adapted to transport or pulling a plow. And their domestication began at a much later date, about 3500 BC… five thousand years later than the Fertile Crescent. Large animal domestication provided the early nutritional benefits of meat, milk products, wool, transportation and fertilizer to the peoples of the Fertile Crescent. The secondary benefit of humans living in close proximity to animals was the transfer of diseases (germs) from animals to humans. The people of the Fertile Crescent had the earliest exposure to germs and they consequently built up a resistance to a series of deadly diseases that played a powerful role as their descendants marched in conquest across the globe. So… why did so many of these crucial factors advance from their starting point in the Fertile Crescent and not the Americas, Australia, and south Africa? The primary reason is that Eurasia is the world’s largest land mass and extends the most distance longitudinally. That feature provides a long path of territory providing similar climatic conditions. This temperate environment created an easy pathway for agricultural practices to advance quickly both west to Europe and East to Asia. The effect of acculturalization and food surpluses provided a growing population with the capability of supporting a class of artisans who could concentrate on perfecting their creative ideas; the smelting of metal ore, making pottery and developing writing. All of which promoted the advance of their group as it grew into a nation. Jared Diamond leads us down a path that broadens our comprehension of how the many different cultures of our globe grew to what they are today. He has introduced us to a better and more clear understanding of why the commonly held beliefs of societies, political institutions, and religions have advanced and/or restricted nations as they attempt to broaden their influence on a world-wide scale. Charles O. Slavens ",
            "date": "Answered July 3, 2019",
            "views": "924",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Georgine Perino",
                    "user_href": "/profile/Georgine-Perino"
                },
                {
                    "user_id": "Lorraine Sisneros",
                    "user_href": "/profile/Lorraine-Sisneros"
                },
                {
                    "user_id": "Daniel Votaw",
                    "user_href": "/profile/Daniel-Votaw"
                },
                {
                    "user_id": "James Martin",
                    "user_href": "/profile/James-Martin-2"
                }
            ]
        }
    ]
}