{
    "title": "If you were Voldemort, what 7 Horcruxes would you possibly choose? - Quora",
    "tags": [
        "Harry Potter After Book 7",
        "Horcruxes (Wizarding World object)",
        "Harry Potter and the Deathly Hallows (2007 novel)",
        "Voldemort (Wizarding World character)",
        "Harry Potter (Wizarding World character)",
        "Characters of the Wizarding World",
        "Harry Potter (book series)",
        "Harry Potter (movie series)",
        "Harry Potter (creative franchise)",
        "Hypothetical Scenarios"
    ],
    "response": [
        {
            "author_info": {
                "name": "Alex Knight",
                "href": "/profile/Alex-Knight-262"
            },
            "answer_text": "I've always been far less interested in the ‘what' than the ‘why’ where Voldie and his Horcruxes were concerned. While we're not explicitly told that the objects need to be of importance to Voldemort to be used, it's definitely implied that you can't just use everyday objects. Dumbledore passes it off as an aspect of Voldemort's rampant narcissism, but I always felt that it made much more sense that you had to use something of significance to you. Otherwise I would use 6 quills or galleons or something. The reason I think this is because some of Voldemort's Horcruxes are significantly more powerful than others, and it's nothing to do with the order they were made, and everything to do with how important the objects themselves were to Voldemort. Cup? Very little impact or influence on anything. Locket? Lots of impact on the world around it, able to influence mood and even have a corporeal presence. These two objects were contemporary, and both are after the Gaunt ring, which is also not mentioned to be particularly active, other than having a curse attached and (potentially) a mild compulsion. Dumbledore doesn't report anything else strange to Snape. More to the point, as Voldemort becomes more obsessed with Harry, his connection becomes stronger, going from itchy twitches to full blown visions in direct correlation to Voldemort's obsession with Harry. So, based on this, I would say that to have the strongest possible Horcruxes, we need magical objects with a strong significance to the creator (in this case, Voldemort) and I'm sticking with the original intent of 6 Horcruxes for a 7 part soul. The Diary. Yes, it was originally muggle, but he clearly enchanted it himself, and he would have written down all his school achievements, such as becoming top of his classes, gaining followers, his plans for taking control of the Wizarding world, finding out he was a descendant of Slytherin, killing his birth family etc. It would've been a record of his growing power. Great option.His wand. The first tangible proof that he was actually a wizard, and one of the first things that would've been undeniably his. Voldemort would absolutely adore the symbolism of tying a piece of his soul to something made of death (yew) and rebirth (phoenix feather) and being the only wizard in the world with a soul-bonded wand. He'd definitely think it would make him more powerful.His Award for Special Services to the School. It was the ultimate proof of his cunning. Not only did he unleash Slytherin's monster, he killed someone, framed someone else, got them expelled and got rewarded for it. That and having a piece of his soul there right under Dumbledore's nose, corrupting other students, he'd find it perfect. I'm pretty sure most people probably aren't hanging out in the trophy room, so it's probably just mostly people on detention, who are feeling miserable and resentful anyway, so it would be easy to corrupt them.Slytherin's Locket. Voldemort sees this as his birthright and rightful inheritance, far more than he does the Peverell ring. It was his mother's and the absolute proof for him that he was a descendant of Slytherin. While he genuinely couldn't care less about the Gaunts, he definitely cares about Slytherin.A portrait. I would expect Voldemort to commission a portrait of himself and place a part of his soul in it. Much like with the diary, it could interact with the world around it, either to absorb a soul and return, or to provide instruction to others, control them, or even spy on various places through connected frames.Nagini. I will preface this by saying I do not accept Nagini as a Maledictus, she is a very big magical snake, that is all. What I do believe she is though, is a familiar. While familiars are not explicitly mentioned in Harry Potter, certain animals in the series are shown to be uncommonly smart, even for their species, and all of these are animals with a strong bond to their owners, to the point where their owners have an understanding of what they're thinking. Key ones being Crookshanks, Hedwig and in particular Nagini. Obviously Parseltongue helps, but she is incredibly loyal to Voldemort, and I would attribute this to a familiar bond. If he did have a familiar he could talk to, something he could trust to be loyal to him before all others, she would be the perfect receptacle for a piece of his soul, and I'm sure that's why he chose her originally anyway.",
            "date": "Answered October 29, 2020",
            "views": "86",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Paxton Orchard",
                    "user_href": "/profile/Paxton-Orchard"
                }
            ]
        },
        {
            "author_info": {
                "name": "CripplingDepression",
                "href": "/profile/CripplingDepression-2"
            },
            "answer_text": "A lot of people think you can just make whatever you want into horcruxes. NO, it DOES NOT work that way. Lets go over the general idea of a horcrux and how to make one: “Killing splits apart your soul “, to split your soul like this, you can't just kill a random person on the street, because killing them wont really affect your soul to ‘split' it. So you have to kill someone you knew/spent time with/ someone who had some sort of feelings for you(friendship, hate, love etc.) The horcrux also has to be an artifact belonging or relating to the person killed. For ex. The diary- Moaning Myrtle's murder weapon, The cup- Hepzibah smith, the previous owner and so on. So we see that Horcruxes need to have a relation to the person you're killing. Now lets come to what my horcruxes would be: I plan on making only 3. I will make a custom pendant, with the number 9 on it and then gift it to a girl who I've been wooing. (Whom I'll kill later on).I make another pendant, but this time with the number 8 on it, and gift it to someone else who people know I've had a connection with. (And kill them later on).This time, I make another pendant, but with the number 11 on it and repeat the gifting and killing.Now that the horcruxes are done, i would go around beating drums that i killed 9 people and have made 9 horcruxes. Because of this, people would think im stupid. If someone ends up finding the second one, and see that its counting down from 9, since they think im stupid they would look for something (hopefully more pendants) that have the number 7 on them. I plan on keeping the third person unknown from others, so that nobody connects us. Also, I will have pendants made with numbers counting down from 7 and place illusions on them which makes the destroyer think they are indeed right, and keep on going down. Admittedly, the first two horcruxes are sort of guinea pigs, but they are a vital part of hiding the third and last horcrux. Thats how i would hide my horcruxes if i were Voldemort. Of course the number of horcruxes could change accordingly, but this plan is foolproof, and now its not. ",
            "date": "Answered October 29, 2020",
            "views": "49",
            "upvotes": " Answer requested by Khushi Lalit"
        }
    ]
}