{
    "title": "If you could tell your 21-year-old self one thing, what would it be? - Quora",
    "tags": [
        "Advice",
        "Important Life Lessons",
        "Hypothetical Scenarios",
        "Life and Living",
        "Life Advice"
    ],
    "response": [
        {
            "author_info": {
                "name": "Priyanka Shiralkar",
                "href": "/profile/Priyanka-Shiralkar"
            },
            "answer_text": "Dear 21 year old self, I’m writing this letter to you, to tell you one BIG THING, “This time will never come BACK”. The carefree you are, the life you are enjoying and the memories you are making are what is keeping me pushing today. Enjoy every moment , before somebody starts telling you, you can do this and you cannot do this. I know life will change very drastically for you, but remember I will never blame you for anything , because you were the best version of me. Instead I would be thankful for making me who I’m. For teaching me how to be confident and to stand for what's right and to say “No” to things that I don't agree upon. The world opens to new relationships, new experiences and adventures, but what remains constant is our attitude towards it. This is what I have adapted from you. So enjoy life king size and always keep smiling :) Yours loving, 24 year old self Thank You for Reading..!! ",
            "date": "Answered October 21, 2020",
            "views": "52",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Krishna Magaji",
                    "user_href": "/profile/Krishna-Magaji"
                }
            ]
        },
        {
            "author_info": {
                "name": "Lydia Wang",
                "href": "/profile/Lydia-Wang-93"
            },
            "answer_text": "Thank you for the question. If I could tell my 21 yo old self one thing, what would it be? I will say to her, “Focus on your college and don’t dating until you success! Don’t be envy with your friends, enjoy and have fun in your college life, also study hard so you can reach the dream that you might be only achieve in your 20s!!” Oh! And \"Be picky with your close circle is okay. And just be yourself. You are capable to do anything to achieve your dream, and don’t get sway with negative thoughts or words!” I think it’s good enough.🤔😊 ",
            "date": "Answered October 25, 2020",
            "views": "36",
            "upvotes": " Answer requested by Annette Gray"
        }
    ]
}