{
    "title": "If you were to recommend one book about history that a person should drop everything and read right now, what would it be? - Quora",
    "tags": [
        "Non-Fiction Books",
        "History Book Recommendations",
        "Non-Fiction",
        "History Books",
        "World History",
        "History of the United States of America",
        "Reading",
        "Book Recommendations",
        "Books",
        "History"
    ],
    "response": [
        {
            "author_info": {
                "name": "Alex Damsker",
                "href": "/profile/Alex-Damsker"
            },
            "answer_text": "What a great question - thanks for the A2A! I can't recommend one - there are so many areas... Well, Ron Chernow's Alexander Hamilton is one of my top picks, right away.  He's an amazing author, and his analysis of the genius and humanism of Hamilton and his wife are just excellent.  Hamilton created modern capitalism, started the Treasury (and was its first Secretary), loaned the US its first money from his Bank of New York (still standing - you may have heard of it), created our entire financial structure out of the cobbled together pieces of the best of many systems.  In fact, the only reason we run at a deficit now is because we didn't adopt one of his key principles: a sinking fund for repayment of government debt.  He was one of the most ethical of the forefathers, and an immigrant - and, like many, a New Yorker before an American.  I could drone on, but you should read about him.  This is a good place to start.  Chernow's House of Morgan is a great follow up if you love the style and want to read something else by him. Jared Diamond's Guns Germs and Steel is a great overview of human history, in a great page turner.  Diamond's Collapse is the next book you should read after that, about the history and future of environmental catastrophe and the political decisions that spur societal collapse. David Landes' The Wealth and Poverty of Nations, a purported follow-up to Adam Smith's The Wealth of Nations, is an excellent discussion on the history of global poverty, and an argument for the future management of it.  Agree with him or not, it's a well-written, well-thought out, intriguing book.  The next book from him is a slightly less fabulous (but still incredibly fabulous) book called The Invention of Enterprise - a history of entrepreneurship in various times from the ancient civilizations to the current era.  His insights into the circumstances that produced successful (and unsuccessful) entrepreneurs are interesting - and controversial.  That's what makes it fun. And Aliza Green's Starting with Ingredients: Baking.  AMAZING.  She works her way through every category of ingredient, subingredient, mixture, base, preservative, additive - anything and everything you would ever want to know.  She discusses the history of each ingredient, the use, the smell, the ideal texture and compound makeup.  Just genius.  It's a behemoth book, and I've read it cover to cover several times.  A dog-eared bible.  The follow-up to this is anything else she's written - and there are many books.  All great. There's more, but anyone who's gotten this far is probably done with what I have to say about it.  :) Kind regards,Alexandra ",
            "date": "Answered January 13, 2015",
            "views": "213",
            "upvotes": " View 5 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Catherine Beale",
                    "user_href": "/profile/Catherine-Beale"
                },
                {
                    "user_id": "Marti LaChance",
                    "user_href": "/profile/Marti-LaChance"
                },
                {
                    "user_id": "Susie Downing",
                    "user_href": "/profile/Susie-Downing"
                },
                {
                    "user_id": "Melissa Hoy",
                    "user_href": "/profile/Melissa-Hoy-2"
                },
                {
                    "user_id": "Amanda Tendler",
                    "user_href": "/profile/Amanda-Tendler"
                }
            ]
        },
        {
            "author_info": {
                "name": "Gary Teal",
                "href": "/profile/Gary-Teal"
            },
            "answer_text": "I've written this before on Quora, though I can't remember the exact question. Drop everything and find a copy of Ron Chernow's Alexander Hamilton. You will learn more about early American History than you ever learned in high school and college. It's incredibly detailed but simultaneously engaging and exciting. He has since written an equally well regarded biography of Washington, but everybody knows Washington's greatness. Hamilton is, of course, on our ten dollar bills, but being born on Nevis, he was not eligible to become President. Yet he had as much impact on the birth of the nation as anyone. This is a guy who was one of Washington's senior aides; many of the extant written orders from Washington are in Hamilton's handwriting, and one can presume that he helped compose them in some cases. He left Washington's side because he wanted to fight, and he led a successful night-time charge against the strongest redoubt in the decisive battle of Yorktown, taking away his men's muskets lest they get overexcited and fire one of them, alerting the British to the attack. He didn't get along with Jefferson, and vice versa. When he became President, Jefferson gave orders to his new Treasury Secretary to go over everything that Hamilton had done to create a public finance infrastructure for America, and undo it. Some time later, Albert Gallatin returned to Jefferson and admitted that he couldn't find a single thing that he thought should be changed. I was actually forced to read a couple of books about Jefferson after reading this book, because one is left with the impression that Jefferson, while obviously a Top Writer Founding Father, was a rich, lazy guy who was away in Europe when the Constitution was being written, and we should all be glad of it. ",
            "date": "Answered January 15, 2015",
            "views": "417",
            "upvotes": " View 13 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Johnny Russell",
                    "user_href": "/profile/Johnny-Russell-42"
                },
                {
                    "user_id": "Josh Boyd",
                    "user_href": "/profile/Josh-Boyd-5"
                },
                {
                    "user_id": "Claudio Di Gregorio",
                    "user_href": "/profile/Claudio-Di-Gregorio-1"
                },
                {
                    "user_id": "Joe Germacelli",
                    "user_href": "/profile/Joe-Germacelli"
                },
                {
                    "user_id": "Catherine Beale",
                    "user_href": "/profile/Catherine-Beale"
                },
                {
                    "user_id": "David Schwartz",
                    "user_href": "/profile/David-Schwartz-15"
                },
                {
                    "user_id": "Mira Zaslove",
                    "user_href": "/profile/Mira-Zaslove"
                },
                {
                    "user_id": "Charles Tips",
                    "user_href": "/profile/Charles-Tips"
                },
                {
                    "user_id": "Amanda Tendler",
                    "user_href": "/profile/Amanda-Tendler"
                },
                {
                    "user_id": "Emily Smith",
                    "user_href": "/profile/Emily-Smith-5"
                }
            ]
        }
    ]
}