{
    "title": "If you had an overdue library book for 30 years, would you return it? - Quora",
    "tags": [
        "Book Collecting",
        "30 Years",
        "Public Libraries",
        "Libraries and Librarianship",
        "Literature",
        "Reading",
        "Book Recommendations",
        "Personal Finance",
        "Books"
    ],
    "response": [
        {
            "author_info": {
                "name": "Eric Sweeten",
                "href": "/profile/Eric-Sweeten"
            },
            "answer_text": "Not necessarily. The reason is I know how video rental stores used to operate. If you're late, late fees can rack up to no end, exceeding the cost of the movie. They put an end to that, so far as I know, because it was pissing people off. Now, you have to buy the movie if you're a certain amount of days late. But movie rental stores have mostly phased out. I'm willing to bet this is how Red Box works, though. With that in mind, I'd first find out the late policy with the library. If the late charges never stop accruing, then screw them. I'm not paying that much. I will, however, still return the book no matter what. I might just tell them a family member checked it out and forgot to return it. ",
            "date": "Answered October 8, 2020",
            "views": "804",
            "upvotes": " View 6 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Kit Salmon",
                    "user_href": "/profile/Kit-Salmon-1"
                },
                {
                    "user_id": "AJ Tatum",
                    "user_href": "/profile/AJ-Tatum"
                },
                {
                    "user_id": "JOhn TImberman",
                    "user_href": "/profile/JOhn-TImberman-1"
                },
                {
                    "user_id": "Andrew Francis",
                    "user_href": "/profile/Andrew-Francis-58"
                },
                {
                    "user_id": "Jacob Clint",
                    "user_href": "/profile/Jacob-Clint-4"
                },
                {
                    "user_id": "Galih Priambodo",
                    "user_href": "/profile/Galih-Priambodo-2"
                }
            ]
        },
        {
            "author_info": {
                "name": "Debra Harrison",
                "href": "/profile/Debra-Harrison-49"
            },
            "answer_text": "I would return it and buy the library a brand new copy of the book as well. I might even go further and donate a few hundred dollars to make up for all the folks that did not get to read the book I was so thoughtless to keep for all those years. Libraries are a sacred trust - from both sides. We trust them to provide us with a wide variety of books in readable condition. They trust us to return the books we borrow. The flip side of borrowing is returning… I recently answered a question from a fellow here on Quora who asked why it is that books are the only thing it is acceptable to borrow these days. There are some other things that may be borrowed but the old stand by is - books. ",
            "date": "Answered October 7, 2020",
            "views": "534",
            "upvotes": " View 2 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Amelia Klinger",
                    "user_href": "/profile/Amelia-Klinger"
                },
                {
                    "user_id": "Michael Okeke",
                    "user_href": "/profile/Michael-Okeke-12"
                }
            ]
        }
    ]
}