{
    "title": "In 1970 a 10-year-old boy named Michael wrote to R. Buckminster Fuller, asking if he was a 'doer' or a 'thinker'. He got an inspirational reply. Who was that Michael and what did he do with his life? - Quora",
    "tags": [
        "1970 (year)",
        "Genius and Geniuses",
        "Inspiration",
        "Scientists"
    ],
    "response": [
        {
            "author_info": {
                "name": "Nirmal Kumar",
                "href": "/profile/Nirmal-Kumar-197"
            },
            "answer_text": "I think the Michael mentioned here is Michael Herman who  established Michael Herman Associates (MHA), in 1991, to support easier movement of people and information, in corporate and community organizations. He works in partnership with leaders and workgroups, offering insight and resources for planning, organizing, implementing, documenting and evaluating organization development, learning and change. Anyways this is a copy of the letter Fuller send back to the 10 yr-old Michael. Dear Michael, Thank you very much for your recent letter concerning “thinkers and doers. ”The things to do are: the things that need doing: that you seeneed to be done, and no one else seems to see need to be done. Thenyou will conceive your own way of doing that which needs to be done — that no one else has told you to do or how to do it. This will bring out the real you that often gets buried inside a character that has  acquired a superficial array of behaviors induced or imposed by others on the individual. Try making experiments of anything you conceive and are intensely interested in. Don’t be disappointed if something doesn’t work. That is what you want to know — the truth about everything –and then the truth about combinations of things. Some combinations  have  such logic and integrity that they can work coherently  despite non-working elements embraced by their system. Whenever you come to a word with which you are not familiar, find it in the dictionary and write a sentence which uses that new word. Words are tools — and once you have learned how to use a tool  you will never forget it. Just looking for the meaning of the word is not enough. If your vocabulary is comprehensive, you        can  comprehend both fine and large patterns of experience. You have what is most important in life — initiative. Because of it, you wrote to me. I am answering to the best of my capability. You will find the world responding to your earnest initiative.Sincerely yours,Buckminster Fuller Source: michaelherman.com (links to: http://michaelherman.com) ",
            "date": "Answered March 15, 2015",
            "views": "11",
            "upvotes": " View 16 Upvoters",
            "upvoters": [
                {
                    "user_id": "Martin Web",
                    "user_href": "/profile/Martin-Web-1"
                },
                {
                    "user_id": "Sriram V",
                    "user_href": "/profile/Sriram-V-74"
                },
                {
                    "user_id": "Jien Huey Yew",
                    "user_href": "/profile/Jien-Huey-Yew"
                },
                {
                    "user_id": "Gary Ferrão",
                    "user_href": "/profile/Gary-Ferrão"
                },
                {
                    "user_id": "Ron Jacobs",
                    "user_href": "/profile/Ron-Jacobs"
                },
                {
                    "user_id": "Gautham Bhandary",
                    "user_href": "/profile/Gautham-Bhandary"
                },
                {
                    "user_id": "Alex Mesquita",
                    "user_href": "/profile/Alex-Mesquita-2"
                },
                {
                    "user_id": "Suhasini Tiwari",
                    "user_href": "/profile/Suhasini-Tiwari-3"
                },
                {
                    "user_id": "Rohini Kapoor",
                    "user_href": "/profile/Rohini-Kapoor-3"
                },
                {
                    "user_id": "Amit Shete",
                    "user_href": "/profile/Amit-Shete-3"
                }
            ]
        },
        {
            "author_info": {
                "name": "Nikhill Rao",
                "href": "/profile/Nikhill-Rao"
            },
            "answer_text": "The best way to answer this question would be to look at people born in 1959 or 1960 named Michael (assuming he did get famous). The most notable that I could find was Michael P Anderson, an astronaut who died in the Columbia disaster. ",
            "date": "Answered March 14, 2015",
            "views": "11",
            "upvotes": " View 7 Upvoters",
            "upvoters": [
                {
                    "user_id": "Many Emamzadeh",
                    "user_href": "/profile/Many-Emamzadeh"
                },
                {
                    "user_id": "Indurthi Satyanarayana Rao",
                    "user_href": "/profile/Indurthi-Satyanarayana-Rao"
                },
                {
                    "user_id": "Gaurav Dhawan",
                    "user_href": "/profile/Gaurav-Dhawan-2"
                },
                {
                    "user_id": "Aaron Welles",
                    "user_href": "/profile/Aaron-Welles"
                },
                {
                    "user_id": "Paul Olaru",
                    "user_href": "/profile/Paul-Olaru"
                },
                {
                    "user_id": "Steve Pickering",
                    "user_href": "/profile/Steve-Pickering-1"
                },
                {
                    "user_id": "Ron Jacobs",
                    "user_href": "/profile/Ron-Jacobs"
                }
            ]
        }
    ]
}