{
    "title": "In a thriller (movie or novel), you encounter the most predictable sequence, and you still love it. What are some instances, preferably with something about what made you like it? - Quora",
    "tags": [
        "Novel Writing",
        "Novel Recommendations",
        "Novels",
        "Book Recommendations",
        "Books"
    ],
    "response": [
        {
            "author_info": {
                "name": "Sugam Sethi",
                "href": "/profile/Sugam-Sethi"
            },
            "answer_text": "First time I experienced it was when I was watching \"The Sixth Sense\". (Spoiler Alert) halfway through the movie I guessed correctly that Dr. Malcolm Crowe (played by Bruce Willis) was a ghost. After that I have had few more instances where this happened.I think sometimes you feel disappointed when such a thing happens, but this is where the talent of a writer/director plays a part. Sometimes the writer unfolds the mystery in such a beautiful way that you are mesmerized even though you have \"guessed\" the climax. I emphasized on the word \"guessed\" because it is still a guess in your mind and it still keeps that curiosity in your mind alive because you think whether or not you are right. If you are right and the writer has provided sufficient information for it to be right the way you have imagines it, this is the moment you love (may be sometimes a feeling of victory over writer's mind) it simultaneously knowing the end/climax. ",
            "date": "Answered October 12, 2014",
            "views": "84",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Ajay Bajetha",
                    "user_href": "/profile/Ajay-Bajetha"
                }
            ]
        },
        {
            "author_info": {
                "name": "Gayatri Ahuja",
                "href": "/profile/Gayatri-Ahuja-1"
            },
            "answer_text": "Well, the most obvious example can be: take any thriller movie or book. You know that good wins over evil most of the time. Isn't that predictable enough?And that's what people like. They like to know that what they think is correct, the values that they've learnt since they were young are put to use. The hero wins and the villain loses. Isn't that what we want actually? And that's what there is... People tend to like anything they believe in or feel is correct. ",
            "date": "Answered October 11, 2014",
            "views": "77",
            "upvotes": " Answer requested by Mihir Mishra"
        }
    ]
}