{
    "title": "In Dante's Inferno, what is the symbolism behind the number 3? - Quora",
    "tags": [
        "Inferno (Dante)",
        "The Divine Comedy (1320 poem)"
    ],
    "response": [
        {
            "author_info": {
                "name": "Walter D. Petrovic",
                "href": "/profile/Walter-D-Petrovic-1"
            },
            "answer_text": "I cannot go into great detail here, by citing examples within Dante’s work, because it has been a considerably lengthy time since I have read his work. The one thing to remember about Dante’s work — it is very Christian in its symbolism and his work was the key inspiration for the church and its eventual use and description of Hell. If you do some basic historical research, you will discover that the Church’s notions of Hell did not actually take shape until after Dante’s work. Question is: “Who inspired whom?” Understanding that Dante’s work is Christian Specific then you will find that the Trinity is used throughout his work — not necessarily in the full form of The Father, The Son and The Holy Ghost, but in the general construction of his work, which you might notice has a lot a trinary aspects to it, and the symbolism used. What is interesting is the idea that the Inferno is somewhat divergent from Christianity in that the point of view is that of Dante himself becoming lost and it is a Roman Pagan Poet, Virgil, who guides him into and out of Hell. During the trip he meets other pagans usually in clusters of three. Dante’s main goal and concern is to go and “get the hell out of Hell” and strive to make it into Heaven, where the object of his life, his love Beatrice waits for him, with two other women. Here you also have the trinary symbolism. The three nature of Christian dogma is rife through much of Dante’s work. ",
            "date": "Answered May 14, 2018",
            "views": "514",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Dismas Sayre",
                "href": "/profile/Dismas-Sayre"
            },
            "answer_text": "It’s been a while since I read it, but the most obvious reference points to the Trinity, or in the case of the Inferno, a kind of anti-trinity. The Devil cannot create, only corrupt or mock. When it comes to vices and sins, three is a classical schema for the problems with certain sins: absence, excess, and corruption or perversion of a virtue. Let’s take a simple virtue, like love. An absence of love is cold-heartedness or apathy. An excess (toward a finite good), would be something like lust, where one loves “too much” a creature or limited good, and a perversion or corruption would be to love something unnatural or evil, instead of God and neighbor, say love money instead of anything else. The sins in Hell point to problems in the virtues that have been turned into a vice of some kind. ",
            "date": "Answered May 13, 2018",
            "views": "12",
            "upvotes": " View 7 Upvoters",
            "upvoters": [
                {
                    "user_id": "Evan Cowie",
                    "user_href": "/profile/Evan-Cowie"
                },
                {
                    "user_id": "Sena Kıcıroğlu",
                    "user_href": "/profile/Sena-Kıcıroğlu"
                },
                {
                    "user_id": "Fabio D'Aleo",
                    "user_href": "/profile/Fabio-DAleo"
                },
                {
                    "user_id": "Manaswi Deshmukh",
                    "user_href": "/profile/Manaswi-Deshmukh"
                },
                {
                    "user_id": "Scott Cripps",
                    "user_href": "/profile/Scott-Cripps"
                },
                {
                    "user_id": "Micheal Pierce",
                    "user_href": "/profile/Micheal-Pierce-3"
                },
                {
                    "user_id": "Sonia Fanucchi",
                    "user_href": "/profile/Sonia-Fanucchi"
                }
            ]
        }
    ]
}