{
    "title": "In Ender's Game, did Ender intend to kill Bonzo, or was it a total accident? - Quora",
    "tags": [
        "Ender's Game (2013 movie)",
        "Ender's Game (1985 book)"
    ],
    "response": [
        {
            "author_info": {
                "name": "Robert Fischer",
                "href": "/profile/Robert-Fischer-61"
            },
            "answer_text": "The book has the adults saying Ender knew Bonzo planned to kill him - iow, not just beat him up. Bonzo was 13 to Ender being 10 - a pretty huge difference at such young ages (as opposed to, say, a 20 vs 17 year old). Essentially an 8th grader against a 5th grader. Ender is described as knowing the strategy would be to throw him against the protruding plumbing - which could result in death the first time. And that, with Bonzo’s physical advantages, a long fight would guarantee Bonzo would win. He had to win quickly and “permanently”. Right at the start, Bonzo had Ender in his grasp, but Ender - being slippery from the soap - was able to twist around so his back was against Bonzo. At this point, it says the expected move for Ender would be to bring his heel up to Bonzo’s crotch. Bonzo expected it and maneuvering to counter it, brought his face down lower - so Ender lunged up to smash his head into Bonzo’s face. There’s a bit more to the fight, but from the description (Bonzo’s “reactions”), it seems likely that first strike killed Bonzo. I don’t think Ender thought, at the time, that it would have that result. It was simply the only logical way he had to break away from a bigger, stronger, kid. The next couple strikes were apparently to hurt Bonzo bad enough that he’d be left alone, but would also not normally be expected to be killing blows. So, people may quibble over whether it was an “accident” or not. But I feel safe in saying it was not Ender’s intent to kill Bonzo. ",
            "date": "Answered July 16, 2019",
            "views": "616",
            "upvotes": " View 5 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Matthew S. Schwartz",
                    "user_href": "/profile/Matthew-S-Schwartz"
                },
                {
                    "user_id": "Edward Conway",
                    "user_href": "/profile/Edward-Conway"
                },
                {
                    "user_id": "Mark Harrison",
                    "user_href": "/profile/Mark-Harrison-2"
                },
                {
                    "user_id": "Raj Singh",
                    "user_href": "/profile/Raj-Singh-1902"
                },
                {
                    "user_id": "Laura Hurt",
                    "user_href": "/profile/Laura-Hurt"
                }
            ]
        },
        {
            "author_info": {
                "name": "Orion Cohen",
                "href": "/profile/Orion-Cohen-2"
            },
            "answer_text": "\"I regret their deaths. I know that I'm responsible for killing Stilson and Bonzo and all the formics in the universe. But I'm not to blame. I didn't seek out Stilson or Bonzo. They came to me, with a threat of real damage. A credible threat. Tell them that in the court martial. Or run the recording you're doubtless making of this conversation. My intention was not to kill them, but my intention was definitely to stop them from damaging me. And the only way to do that was to act brutally. I'm sorry that they died from their injuries. I'd undo that if I could. But I didn't have the skill to hurt them enough to prevent future attacks, and yet not kill them.” Ender intended to win. If he could have done that without killing Bonzo, he would have. His goal wasn’t to kill Bonzo, it was to keep himself safe. As a result of him doing whatever he had to keep himself safe, Bonzo died. It hurts Ender to know what he did, he grieves the death of Bonzo. But, he also blames Bonzo and knows he did what he had to to survive. ",
            "date": "Answered June 28, 2019",
            "views": "277",
            "upvotes": " View 5 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Edward Conway",
                    "user_href": "/profile/Edward-Conway"
                },
                {
                    "user_id": "Mark Harrison",
                    "user_href": "/profile/Mark-Harrison-2"
                },
                {
                    "user_id": "Stanislav Harašta",
                    "user_href": "/profile/Stanislav-Harašta"
                },
                {
                    "user_id": "Yon Gamarra",
                    "user_href": "/profile/Yon-Gamarra"
                },
                {
                    "user_id": "Laura Hurt",
                    "user_href": "/profile/Laura-Hurt"
                }
            ]
        }
    ]
}