{
    "title": "In the early Bernard Cornwall Sharpe novels, Sharpe is a member of the 'light company', all of whom are armed with muskets instead of rifles. How can troops armed with inaccurate muskets perform effectively as skirmishers? - Quora",
    "tags": [
        "Muskets",
        "Rifles",
        "Novels",
        "Weapons",
        "Guns and Firearms",
        "Military",
        "Military History and Wars "
    ],
    "response": [
        {
            "author_info": {
                "name": "Michael Archibald",
                "href": "/profile/Michael-Archibald-20"
            },
            "answer_text": "I am not familiar with Bernard C. Sharpe novels, but with just a little investigation on the most reliable, ahem, source of (meh) reliable info. I got into the plot summary of “Sharpe’s Company” in which bits and pieces were illuminating, for example during a French attack in the rain, the French are unable to fire their *muskets* (this is the 13th “historical novel” authored by Cornwall) and later Sharpe is relieved of his *rifle* and *green jacket* as a punishment for some perceived failure. So, not having any other knowledge of either the novels or the English and French equipment at that time, I’m going to guess that perhaps *muskets* were standard issue to line units of the French & English for the formation brick *make ready* volley fire type of engagement. And perhaps the *green jacket and rifle* are for an elite unit(?) … If so, I would think perhaps as “light infantry skirmishers” who were mobile and engaged the enemy in only light or sporadic combat in order to delay their movement, disrupt their attack, or weaken their morale or only engage on favorable terms, taking advantage of better position or terrain and quickly withdrawing from any threat of superior enemy forces, their *muskets* may have been deemed adequate(?) I kinda think the *musket* may have been on its way out with the rifle on its way in, just a guess. ",
            "date": "Answered May 24, 2020",
            "views": "125",
            "upvotes": " View 2 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Michael Davis",
                    "user_href": "/profile/Michael-Davis-893"
                },
                {
                    "user_id": "Oliver James",
                    "user_href": "/profile/Oliver-James-12"
                }
            ]
        },
        {
            "author_info": {
                "name": "Michael Davis",
                "href": "/profile/Michael-Davis-893"
            },
            "answer_text": "It's a matter of training and purpose. But, muskets aren't quite the trash that we often think they are (litterally incapable of hitting anything at more than 50 yards) in this era of cheap 1 MOA (or better) hunting rifles.  At aproximately 9:30 mark, he shows a 24 or 30 inch group from 75 meters with two shots in the upper chest of the silhouette. That means that he had a 2:5 chance of putting an officer down from 150% or more of the regular range for volley fire. Line infantry were drilled to fire all together in reasonably rapid succession—thus the definition of a good soldier as one who can fire 3 shots in a minute. The Light Company was expected to be able to skirmish—fighting in a dispersed line in pairs to harass an enemy formation (targeting officers might be officially discouraged, but who's to say you deliberately shot Fancy Pants?)—and to fight in the line like the rest of the battalion. Light infantry aren't likely to inflict extraordinary losses when skirmishing with another light company, but their main purpose was to soften an enemy battalion up a bit before the rest of their battalion opened fire or to keep enemy troops occupied and unable to reinforce some other point in the line. When your enemy is standing shoulder-to-shoulder in several ranks, even a near miss is likely to hit the man beside or behind him. The reason British lines fired volleys at about 40 yards wasn't that the weapons were useless at longer ranges; the men were due to rushed shots and limited live fire practice. But, light infantry were able to practice more and fire in their own time instead of on command. So while they couldn't expect to hit a single target in the chest at 100 yards, they could expect to hit somebody in the enemy ranks at significantly greater range that the line could return fire effectively. ",
            "date": "Answered May 24, 2020",
            "views": "367",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "David Hawkins",
                    "user_href": "/profile/David-Hawkins-96"
                },
                {
                    "user_id": "Hans Widjaja",
                    "user_href": "/profile/Hans-Widjaja"
                },
                {
                    "user_id": "Oliver James",
                    "user_href": "/profile/Oliver-James-12"
                }
            ]
        }
    ]
}