{
    "title": "In the Harry Potter series the Weasley family was poor, so how did they afford to send all their children to Hogwarts? - Quora",
    "tags": [
        "Weasley Family (Harry Potter Universe)",
        "Hogwarts School of Witchcraft and Wizardry (fictional school)",
        "Characters of the Wizarding World",
        "Harry Potter (book series)",
        "Harry Potter (movie series)"
    ],
    "response": [
        {
            "author_info": {
                "name": "Kimberly Klaus",
                "href": "/profile/Kimberly-Klaus-1"
            },
            "answer_text": "The Weasleys weren’t poor; in Ron’s opinion his family is poor. It doesn’t help his viewpoint that his best friend has a vault full of wizard gold left to him by his parents, and then ANOTHER vault full of gold and treasure plus a house when Harry’s godfather died. Hermione is the only child of two (presumably prosperous) dentists, which means not only does she not have to share her clothes or possessions with anyone, she also takes actual vacations when she’s not at Hogwarts and probably has Muggle clothes that aren’t from a thrift shop. Others have already pointed out that Hogwarts is a state-funded school, not a private one (would Durmstrang and Beauxbatons be private schools then?) so the Weasleys didn’t have to pay for the kids’ tuition, room or board. But what about the expenses when the kids were all at home? Let’s take a look. When Harry first meets Ron, Bill and Charlie Weasley have already left home and are working for Gringotts and as a dragon handler respectively. That means there are five kids still at home-Percy, Fred, George, Ron, and Ginny. Ginny doesn’t start at Hogwarts until the following year. With two kids out of the house and working, Mr. and Mrs. Weasley have recovered enough financially to give Percy new robes AND an owl for making prefect. But we learn that Ron is headed to Hogwarts with secondhand robes, wand, and rat. Huh.Christmas rolls around, and we learn Mr. and Mrs. Weasley are spending the Christmas holidays in Romania visiting Charlie (presumably with Ginny in tow) leaving their 4 boys at Hogwarts. I’m sure Mr. Weasley earns holiday time at the Ministry, but still, vacations cost money. Did they Apparate to Romania, with their 10 year daughter and their luggage?Mr. Weasley has a shed and office full of Muggle stuff, including the Ford Anglia. That stuff costs money. Or did he “appropriate” it on raids?Mrs. Weasley can be a stay at home mom with 7 kids.Ron moans about being poor but when he’s telling Harry about the Chocolate Frog cards, he says he has hundreds of them.Mrs. Weasley has money to spend on Gilderoy Lockhart’s useless books and a subscription to Witch Weekly.All this to say that the Weasleys aren’t poor. They just appear to be like many a middle class family in Europe or America. They live paycheck to paycheck, but they don’t always focus on what they really shouldn’t spend money on. This was my answer to a question, not an invitation to debate the Weasleys’ true economic status in the comments, so further commenting has been disabled. Thanks. ",
            "date": "Updated November 6, 2019",
            "views": "1676",
            "upvotes": " View 1.4K Upvoters ",
            "upvoters": [
                {
                    "user_id": "Lexi Brown",
                    "user_href": "/profile/Lexi-Brown-66"
                },
                {
                    "user_id": "Revina Que",
                    "user_href": "/profile/Revina-Que"
                },
                {
                    "user_id": "Joy Joseph",
                    "user_href": "/profile/Joy-Joseph-169"
                },
                {
                    "user_id": "Sabitha Kirupakaran",
                    "user_href": "/profile/Sabitha-Kirupakaran"
                },
                {
                    "user_id": "Trinity Redman",
                    "user_href": "/profile/Trinity-Redman"
                },
                {
                    "user_id": "Jemima Daisy",
                    "user_href": "/profile/Jemima-Daisy-2"
                },
                {
                    "user_id": "Joshua Cardno",
                    "user_href": "/profile/Joshua-Cardno-1"
                },
                {
                    "user_id": "Aparna Naidu",
                    "user_href": "/profile/Aparna-Naidu-3"
                },
                {
                    "user_id": "Yau Cheung Leung",
                    "user_href": "/profile/Yau-Cheung-Leung"
                },
                {
                    "user_id": "Tan Rou Jing",
                    "user_href": "/profile/Tan-Rou-Jing"
                }
            ]
        },
        {
            "author_info": {
                "name": "Chris Bast",
                "href": "/profile/Chris-Bast"
            },
            "answer_text": "There doesn't seem to be any tuition necessary to attend Hogwarts. If there was then you just know the Dursley's would refuse to pay it to keep Harry from going. Hogwarts is presumably funded by the Ministry of Magic, at least partially, but they have to send out acceptance letters so it seems not all wizard children get to attend. Hogwarts seems to be like what Americans would call a magnet school or a charter school. These are publicly funded schools but they are allowed to be selective with which students they will teach. Students often have to take an aptitude test to be allowed in. Hogwarts must have some sort of test they use to decide which kids to teach (midiclorians?). The only money wizard parents have to spend is on school supplies; robes, books, and potion materials. This is what really strains the Weasley family's budget, and why Ron and Ginny are forced to make do with hand-me-down stuff from their elder siblings. EDIT: And to those saying “the Weasleys aren't really poor” you're wrong. They are poor. The books state several times that they are poor. We see the inside of their bank vault and how little money is in it. They may not be as poor as they could be, but that doesn't make them not poor. The poor in the US aren't nearly as poor as starving people in Africa, but if you tried to tell them that they'd want to slap you. The Weasleys are a poor family. ",
            "date": "Answered November 10, 2019",
            "views": "654",
            "upvotes": " View 10 Upvoters",
            "upvoters": [
                {
                    "user_id": "Revina Que",
                    "user_href": "/profile/Revina-Que"
                },
                {
                    "user_id": "Shinjinee Sen",
                    "user_href": "/profile/Shinjinee-Sen-2"
                },
                {
                    "user_id": "Orin Keren",
                    "user_href": "/profile/Orin-Keren"
                },
                {
                    "user_id": "Kyle Farris",
                    "user_href": "/profile/Kyle-Farris"
                },
                {
                    "user_id": "Robert Stephen Campbell",
                    "user_href": "/profile/Robert-Stephen-Campbell"
                },
                {
                    "user_id": "Kali White",
                    "user_href": "/profile/Kali-White-17"
                },
                {
                    "user_id": "Richard Alan",
                    "user_href": "/profile/Richard-Alan-1"
                },
                {
                    "user_id": "Mary Nelson",
                    "user_href": "/profile/Mary-Nelson-4"
                },
                {
                    "user_id": "Mike Stork",
                    "user_href": "/profile/Mike-Stork-1"
                },
                {
                    "user_id": "Janet Buntz",
                    "user_href": "/profile/Janet-Buntz"
                }
            ]
        }
    ]
}