{
    "title": "In which order were the books of the Old Testament written? - Quora",
    "tags": [
        "Hebrew Bible",
        "Christianity and Judaism",
        "The Old Testament",
        "Judaism",
        "The Bible",
        "Christianity"
    ],
    "response": [
        {
            "author_info": {
                "name": "David Powell",
                "href": "/profile/David-Powell-57"
            },
            "answer_text": "According to the Documentary hypothesis, the first 5 books of the Torah were actually transcribed by a number of different persons who lived at different times and places.    Furthering insights on the Pentateuch's composition history already made by others in the course of the 19th century—namely, Wilhelm Vatke, Eduard Reuss, Karl Heinrich Graf, and Abraham Kuenen—the German biblical scholar and orientalist Julius Wellhausen gave the chronological sequence JEDP a coherent setting in a notional evolving religious history of Israel, which he saw as one of ever-increasing priestly power. Wellhausen's formulation was: the Yahwist source (J) : written c. 950 BCE in the southern Kingdom of Judah.the Elohist source (E) : written c. 850 BCE in the northern Kingdom of Israel.the Deuteronomist (D) : written c. 600 BCE in Jerusalem during a period of religious reform.the Priestly source (P) : written c. 500 BCE by Kohanim (Jewish priests) in exile in Babylon.It is common to think of these people as \"authors\" but nothing could be farther from the truth as religious texts are subject to scrutiny an would be rejected if they change any commonly accepted \"facts.\"  People just assume that humans of that time are not as bright as we are now, and this is odd as human brains have evolved little in the space of these few thousand years. A great book on this subject is: Who Wrote the Bible?: Richard Elliott Friedman.  Friedman brings out the richness of these various \"sources\" and even speculates identities for some of them. The oldest text by contextual cues is what is called Source J, the Yahwehist.  This author uses this name for God, all other sources use, Elohim.  The place names used and other clues place this writing in the reign of Rehoboam.   The Book of J: Harold Bloom, David Rosenberg speculates that the scribe that transcribed these texts was perhaps a woman.  Source J is the only text to contain women's names and women as central characters and actors. The Books of Genesis is heavily balanced toward the \"J\" source.  The Exodus narrative is mostly \"E\" source and the Laws and descriptions of the Tabernacle are \"P.\"   This idea of interwoven sources sprung up because even a casual reading of the text makes clear there seems to be double and triple retellings of the same story with different people.  There are two complete origin stories: Two Accounts of Creation in Genesis  A reading of Genesis reveals two distinctly different creation stories: the first spans Genesis 1:1-2:3 and the second continues from Genesis 2:4 to the end of the third chapter. These two accounts of creation include: A cosmocentric account of how God created the heavens and earth out of the voidAn anthropocentric account of how humanity came to populate the earthScholars believe the second story is older than the first, perhaps dating to as early as 950 BCE, while the second was probably written by the priestly caste after the Hebrews had returned from Babylonian captivity sometime around 530 BCE. And, this explains a bit how the jarring Seven days narrative got placed at the very beginning and why, to anchor the importance of Shabbat observance as topic one. All of the old clay tablets of the Temple were destroyed.  So, the older sources, the ones from deep antiquity are know to us by their names mentioned in the text of the Torah but otherwise do not exist.  These are like dead hyperlinks to the past.  At the time, these citations grounded the text in the frame of accepted knowledge, but now they are just words.  But, the transcribers of these old texts had access to them.  But, what they chose to write and provide to the priests of the time as reference materials was subject to choice very much like any non-fiction writer does today, picking and choosing what is relevant, adding commentary, and perhaps even some spin. We see in the \"J\" text, \"spin\" to support the claims of the \"Cohenim\" priests descended from Aaron.  This claim is an absolute claim to the priesthood and the only allowed \"Center of Worship,\" the Temple in Jerusalem.   This was highly relevant at the time of Rehoboam because of the North/South split in Israel in response to Rehoboam's oppression.  But, the claim of Jerusalem was disputed.  The community that were to become the Samaritans who used the old style of building stone pillars for sacrifice where they were like Abraham, Isaac and Jacob saw Shechem as the holy city, not Jerusalem.  Shechem first appears in the Bible in Genesis 12:6-8, which records how Abraham reached the \"great tree of Moreh\" at Shechem and offered sacrifice nearby. Genesis, Deuteronomy, the Book of Judges and Joshua hallow Shechem over all other cities of the land of Israel.[6] At Shechem, Abram \"built an altar to the Lord who had appeared to him ... and had given that land to his descendants\" (Gen 12:6-7). The Bible states that on this occasion, God confirmed the covenant he had first made with Abraham in Harran, regarding the possession of the land of Canaan. In Jewish tradition, the old name was understood in terms of the Hebrew word shékém — \"shoulder, saddle\", corresponding to the mountainous configuration of the place.[citation needed] On a later sojourn, two sons of Jacob -- Simeon (Hebrew Bible) and Levi—avenged their sister Dinah's rape by \"Shechem the son of Hamor the Hivite, the prince of the land\" of Shechem — by massacring the city's inhabitants. Later, following the Exodus, Joshua assembled the Israelites in Shechem and commanded them to reaffirm their adherence to the Torah. Owing to its central position, no less than to the presence in the neighborhood of places hallowed by the memory of Abraham (Genesis 12:6, 7; 34:5), Jacob's Well (Genesis 33:18-19; 34:2, etc.), and the Joseph's tomb (Joshua 24:32), the city was destined to play an important part in the history of Israel. The city, including its Bronze Age temple, fell to the Israelites sometime before 1000 BC. After Gideon's death, Abimelech, his son by a Sichemite concubine, was made king (Judges 9:1-45). Jotham, the youngest son of Gideon, made an allegorical speech on Mount Gerizim in which he warned the people of Shechem about Abimelech's future tyranny (Judges 9:7-20). When the city rose in rebellion three years later, Abimelech took it, utterly destroyed it, and burnt the temple of Baal-berith where the people had fled for safety. From the excavations, it was learned that the city was destroyed in 1100 BC. The city was rebuilt in the 10th century BC and was probably the capital of Ephraim (1 Kings 4). Shechem was the place appointed, after Solomon's death, for the meeting of the people of Israel and the investiture of Rehoboam; the meeting ended in the secession of the ten northern tribes, and Shechem, fortified by Jeroboam, became the capital of the new kingdom (1 Kings 12:1; 14:17; 2 Chronicles 10:1). And, The priests of Shiloh where the stewards of the Ark of the Covenant prior to David moving it to Jerusalem.    Shiloh is mentioned in the Hebrew Bible as an assembly place for the people of Israel. Technically, Shiloh was the site of the 'Ohel-Mo'ed—the Tent of Meeting—which was set up there when Joshua apportioned the land among the various Israelite tribes (Joshua 18ff.). In this sense, the Tent of Meeting is to be distinguished from the \"Dwelling Place\"—the Mishkan—often translated \"Tabernacle.\" The \"whole congregation of Israel assembled...and set up the tabernacle of the congregation...\" (Joshua 18:1), built under Moses' direction from God (Exodus 26) to house the Ark of the Covenant, also built under Moses' direction from God (Exodus 25). According to Talmudic sources, the tent sanctuary remained at Shiloh for 369 years[7] until the Ark of the Covenant was taken into the battle camp (1 Samuel 4:3–5) at Eben-Ezer and captured by the Philistines at Aphek (probably Antipatris). At some point during its long stay at Shiloh, the portable tent seems to have been enclosed within a compound—a Greek \"temenos\". According to I Samuel 1–3, Shiloh was the site of a physical structure that had \"doors\" (1 Samuel 3:15). At some point, the Tent of Meeting was moved to Gibeon,[8] which became an Israelite holy site under David and Solomon. Friedman speculates that these priests were decedents of Moses, not Aaron.  The \"E\" source seems to come from this group.  And, the \"E\" source contains the part story of the Golden Calf blaming Aaron and yet also rejecting the Calf Idols which were the idols erected by Jeroboam that recalled the older Ba'al worship cult that focused on cattle.  Bethel was an important religious center for the northern Kingdom of Israel following the break-up of the united kingdom of David and Solomon. The Second Book of Kings describes how Jeroboam, first king of Israel, set up centers for Golden Calf worshippers at Bethel on the southern boundary of his kingdom and Dan on the northern boundary, and appointed non-Levites as his priests (1 Kings 12:25–33). Jeroboam's decision to pass over the Mushite priests of Shiloh, the original religious center for Israel, deeply offended the Shiloh priesthood and seems to lie behind much of the animosity directed at Jeroboam and the golden calf, which probably emanated from the Mushite priestly clan. So, we have a custody battle of sorts with three contenders and lots of bad blood spun into this text.  In the end, when the Northern Kingdom fell to the Assyrians, the Mushite (Mosheid) Priests were forced to become non-Priest Levites in Jerusalem. Yet, these texts were newer working documents used to teach the history of this people.  The \"E\" text was added to the \"Library\" in Jerusalem by the fall of the Northern Kingdom and the exile of the Northern Priests to Judea in the South. The \"P\" source is a compendium of the practices of the Priests and the operational details of the Jewish faith as it existed at the time of the destruction of the First Temple and refined in the Babylonian exile as the materials evacuated from this destruction were examined and Redacted by source \"R\" into a single whole.  These were the shreds sown together that only could recall the great wealth of knowledge lost.  We have this because this was the text that was on papyrus that could be carried, not tons of clay tablets. The \"D\" Source is the most interesting of all.  The book of Deuteronomy is noted in the Book of 2 Kings 22:8  as having been \"found\" in the Temple during the reign of Josiah almost 900 years after the events it recounts.  This is sure to raise eyebrows and it does.  Especially when this text judiciously rewrites the story of Exodus and Numbers into a consistent working document that cleans up \"messy\" issues in the prior works.  It seems to not depend on these prior texts as we have them and restates several events with slight variations.  One would suppose from the history above, this is easy to understand when we allow that \"R\" assembled \"E\" and \"J\" after \"D\" was transcribing Deuteronomy.  Call \"D\" the First Draft attempt for \"R's\" eventual Masterwork.  However, \"D\" was constrained by the existence of the \"Library\" in a way that \"R\" wasn't.  Thus, \"D\" assumed the first 4 books basic story was known to the Priests, Levites and the intellectual community of the time.  Thus, a retelling as a series of preparatory speeches, rather than a rewriting of the prior texts presented as whole and accurate. Friedman speculates that Source \"D\" is none other than the Prophet Jeremiah.  This same source wrote the text of the Histories, The Books of Joshua thru Kings 2.  This text is literally amazing.  It compares to Shakespeare in the layers of literary and hard core intellectual impact.  The source \"D\" text taken as story arch is a polemic against the Rule of Kings that has echoed through history to the founding of the United States and the end of the rule of Kings in this world.  \"D's\" thesis is that Kings are corrupted by this power.  It prescribes a solution to this problem in the Book of Deuteronomy and holds out King Josiah as an example of how to avoid this corruption.  But, it ends in tears as Josiah dies a meaningless seemingly random death right as his promise seemed to be rising. Once again, these histories recount details known to people of the time.  Just like dropping a President from American history would cause a storm of criticism by Historians, Source \"D\" was constrained in this work to reporting the facts that were generally accepted and explaining his understanding of their significance.  In that the text is deeply subversive, places a huge additional burden that it be seen as authentic and representing records that existed at the time. The Books of the Prophets represent works accumulated over a period of hundreds of years. Prophet Timeline - Bible Coloring Pages | What's in the Bible?   To see this in the context of World History... Bible Tools - Lineages, Timelines, & Outlines   The Kitivim (The writings) are a collection of texts that were felt to be incredibly important. PsalmsProverbsJobSong of SongsRuthLamentationsEcclesiastesEstherEzra-NehemiahChronicles The two Books of Chronicles are a retelling of the \"D\" 1 Kings and 2 Kings history, just as other retellings, this is one of the amazing uses of parallelism to establish that \"D\" was not the \"author\" in a narrative fiction manner, but a transcriber who added his own view to the material.  A view that was so intensely negative about Kings and even about God's hand in current events that a counter-point was needed to give a more \"complete\" picture.  And, yet, the reverence and respect given to the prior text establishes the same about the source and the authenticity of this writer's work. Some of these works, Song of Songs, Psalms, Ecclesiastes are ascribed to David and Solomon with other contributors.  Others are of unknown authors and uncertain dates. The story of accumulation of the Torah and then the Tenakh (Torah, Navi'im, and Kituvim) is a long process.  After Ezra's return to Jerusalem, the Torah was fixed.  Understanding the Old Testament Bible Authenticity   It waited until the community in Alexandrea was commissioned by the Ptolomaic Pharohs to translate the Hebrew Text into Greek for the process of \"Canonizing\" these texts into a Book to begin.  Septuagint means 70 in Greek.  This represents the 72 scholars who were tasked to do this translation. Tractate Megillah: Chapter 1  It happened to Ptolemy the king that he took seventy-two elders from Jerusalem, and placed them in seventy-two separate chambers, and did not inform them to what purpose he had brought them. And afterward he entered to each of them, and said to them: Translate me the Torah of Moses from memory. This is a nice 81 slide show of this process from a Christian Perspective. Oli Lea - How Many Books Does Your Bible Have? The Tenakh we have today is most assuredly almost exactly as it was more than 2000 years ago with only minor imperfections.  The discovery of the Dead Sea Scrolls has provided an amazing look at pieces of this same text a thousand years older than the oldest surviving Masoretic text. Understanding the Old Testament Bible Authenticity  How can we be sure that the text are preserved? Between the present day Masoretic Texts and the first surviving copy, they are almost no discrepancy, because of the strict rules employed by the scribes when copying the scriptures. So we can safely say that for 1011 years , the Hebrew scriptures has not been changed at all. Between the Aleppo Codex to the Dead Sea Scrolls, the scholars did a comparison between the scrolls and came up with the following conclusionUsing Isaiah Chapter 53 as the comparison 17 mistakes are found1. 10 Characters are written incorrectly.2. 4 Characters are completely different3. 3 Characters are added by accident These 17 Mistakes did not alter the textual meaning of the text. Although the book of Daniel is being disputed ",
            "date": "Answered August 19, 2015",
            "views": "21",
            "upvotes": " View 6 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Ryan Runkewich",
                    "user_href": "/profile/Ryan-Runkewich"
                },
                {
                    "user_id": "Will Ingram",
                    "user_href": "/profile/Will-Ingram-2"
                },
                {
                    "user_id": "Annika Peacock",
                    "user_href": "/profile/Annika-Peacock"
                },
                {
                    "user_id": "Christie Jenkins",
                    "user_href": "/profile/Christie-Jenkins-1"
                },
                {
                    "user_id": "James Smith",
                    "user_href": "/profile/James-Smith-3709"
                },
                {
                    "user_id": "Antony Van Der Mude",
                    "user_href": "/profile/Antony-Van-Der-Mude"
                }
            ]
        },
        {
            "author_info": {
                "name": "Richard Williams Francis",
                "href": "/profile/Richard-Williams-Francis"
            },
            "answer_text": "TOTAL NUMBER OF BOOKS IN GOD’S WORD THE BIBLE = 66 BOOKS TOTAL WRITERS WHO WROTE THE ENTIRE BIBLE = 40 MEN BOOKS OF THE “HEBREW SCRIPTURES” WRITTEN DURING “BEFORE COMMON (CHRISTIAN) ERA (B. C. E.)” ARRANGED IN ORDER BASED ON THE “YEAR OF COMPLETION OF WRITING” OLD TESTAMENT = 39 BOOKS Name of the Book: GENESIS Writer: PROPHET MOSES Place Written: WILDERNESS Writing Completed: 1513 B. C. E. Name of the Book: EXODUSWriter: PROPHET MOSESPlace Written: WILDERNESSWriting Completed: 1512 B. C. E.Time Covered: 1657 B. C. E. to 1512 B. C. E.Name of the Book: LEVITICUS Writer: PROPHET MOSES Place Written: WILDERNESS Writing Completed: 1512 B. C. E. Time Covered: 1 MONTH (1512 B. C. E.) Name of the Book: NUMBERSWriter: PROPHET MOSESPlace Written: WILDERNESS and PLAINS OF MOABWriting Completed: 1512 B. C. E. to 1473 B. C. E.Time Covered: 1473 B. C. E.Name of the Book: JOB Writer: PROPHET MOSES Place Written: WILDERNESS Writing Completed: 1473 B. C. E. Time Covered: OVER 140 YEARS between 1657 B. C. E. to 1473 B. C. E. Name of the Book: DEUTERONOMYWriter: PROPHET MOSESPlace Written: PLAINS OF MOABWriting Completed: 1473 B. C. E.Time Covered: 2 MONTHS (1473 B. C. E.)Name of the Book: JOSHUA Writer: PROPHET JOSHUA Place Written: CANAAN Writing Completed: 1450 B. C. E. Time Covered: 1473 B. C. E. to 1450 B. C. E. Name of the Book: JUDGESWriter: PROPHET SAMUELPlace Written: ISRAELWriting Completed: 1100 B. C. E.Time Covered: 1450 B. C. E. to 1120 B. C. E.Name of the Book: RUTH Writer: PROPHET SAMUEL Place Written: ISRAEL Writing Completed: 1090 B. C. E. Time Covered: 11 YEARS OF JUDGES’ RULE Name of the Book: 1 SAMUELWriters: PROPHETS - SAMUEL, GAD, and NATHANPlace Written: ISRAELWriting Completed: 1078 B. C. E.Time Covered: 1180 B. C. E. to 1078 B. C. E.Name of the Book: 2 SAMUEL Writers: PROPHETS - GAD and NATHAN Place Written: ISRAEL Writing Completed: 1040 B. C. E. Time Covered: 1077 B. C. E. to 1040 B. C. E. Name of the Book: SONG OF SOLOMON (CANTICLES)Writer: KING SOLOMONPlace Written: JERUSALEMWriting Completed: 1020 B. C. E.Name of the Book: ECCLESIASTES Writer: KING SOLOMON Place Written: JERUSALEM Writing Completed: 1000 B. C. E. Name of the Book: JONAHWriter: PROPHET JONAHPlace Written: (?)Writing Completed: 844 B. C. E.Name of the Book: JOEL Writer: PROPHET JOEL Place Written: JUDAH Writing Completed: 820 B. C. E. (?) Name of the Book: AMOSWriter: PROPHET AMOSPlace Written: JUDAHWriting Completed: 804 B. C. E.Name of the Book: HOSEA Writer: PROPHET HOSEA Place Written: SAMARIA (District) Writing Completed: 745 B. C. E. Time Covered: 804 B. C. E. to 745 B. C. E. Name of the Book: ISAIAHWriter: PROPHET ISAIAHPlace Written: JERUSALEMWriting Completed: 732 B. C. E.Time Covered: 778 B. C. E. to 732 B. C. E.Name of the Book: PROVERBS Writers: KING SOLOMON, AGUR, LEMUEL Place Written: JERUSALEM Writing Completed: 717 B. C. E. Time Covered: 537 B. C. E. to 467 B. C. E. Name of the Book: MICAHWriter: PROPHET MICAHPlace Written: JUDAHWriting Completed: 717 B. C. E.Time Covered: 717 B. C. E. to 777 B. C. E.Name of the Book: ZEPHANIAH Writer: PROPHET ZEPHANIAH Place Written: JUDAH Writing Completed: 648 B. C. E. Name of the Book: NAHUMWriter: PROPHET NAHUMPlace Written: JUDAHWriting Completed: 632 B. C. E.Name of the Book: HABAKKUK Writer: PROPHET HABAKKUK Place Written: JUDAH Writing Completed: 628 B. C. E. (?) Name of the Book: LAMENTATIONSWriter: PROPHET JEREMIAHPlace Written: NEAR JERUSALAMWriting Completed: 607 B. C. E.Name of the Book: OBADIAH Writer: PROPHET OBADIAH Place Written: (?) Writing Completed: 607 B. C. E. Name of the Book: EZEKIELWriter: PROPHET EZEKIELPlace Written: BABYLONWriting Completed: 591 B. C. E.Time Covered: 613 B. C. E. to 591 B. C. E.Name of the Book: 1 KINGS Writer: PROPHET JEREMIAH Place Written: JUDAH and EGYPT Writing Completed: 1 ROLL - 580 B. C. E. Time Covered: 1040 B. C. E. to 580 B. C. E. Name of the Book: 2 KINGSWriter: PROPHET JEREMIAHPlace Written: JUDAH and EGYPTWriting Completed: 1 ROLL - 580 B. C. E.Time Covered: 1040 B. C. E. to 580 B. C. E.Name of the Book: JEREMIAH Writer: PROPHET JEREMIAH Place Written: JUDAH; EGYPT Writing Completed: 580 B. C. E. Time Covered: 647 B. C. E. to 580 B. C. E. Name of the Book: DANIELWriter: PROPHET DANIELPlace Written: BABYLONWriting Completed: 536 B. C. E.Time Covered: 618 B. C. E. to 536B. C. E.Name of the Book: HAGGAI Writer: PROPHET HAGGAI Place Written: JERUSALEM REBUILT Writing Completed: 520 B. C. E. Time Covered: 112 DAYS (520 B. C. E.) Name of the Book: ZECHARIAHWriter: PROPHET ZECHARIAHPlace Written: JERUSALEM REBUILTWriting Completed: 518 B. C. E.Time Covered: (520 B. C. E TO 518 B. C. E.)Name of the Book: ESTHER Writer: MORDECAI Place Written: SHUSHAN, ELAM Writing Completed: 475 B. C. E. Time Covered: 493 B. C. E. to 475 B. C. E. Name of the Book: 1 CHRONICLESWriter: PROPHET EZRAPlace Written: JERUSALEM (?)Writing Completed: 1 ROLL - 460 B. C. E.Time Covered: AFTER 1 CHRONICLES 9:44: 1077 B. C. E. to 537 B. C. E.Name of the Book: 2 CHRONICLES Writer: PROPHET EZRA Place Written: JERUSALEM (?) Writing Completed: 1 ROLL - 460 B. C. E. Time Covered: 1077 B. C. E. to 537 B. C. E. Name of the Book: EZRAWriter: PROPHET EZRAPlace Written: JERUSALEMWriting Completed: 460 B. C. E.Time Covered: 537 B. C. E. to 467 B. C. E.Name of the Book: PSALMS Writers: KING DAVID and OTHERS Place Written: JERUSALEM Writing Completed: 460 B. C. E. Name of the Book: NEHEMIAHWriter: PROPHET NEHEMIAHPlace Written: JERUSALEMWriting Completed: 443 B. C. E.Time Covered: 443 B. C. E. to 456 B. C. E.Name of the Book: MALACHI Writer: PROPHET MALACHI Place Written: JERUSALEM REBUILT Writing Completed: 443 B. C. E. BOOKS OF THE “GREEK SCRIPTURES” WRITTEN DURING THE “COMMON (CHRISTIAN) ERA (C. E.)” ARRANGED IN ORDER BASED ON THE “YEAR OF COMPLETION OF WRITING” NEW TESTAMENT = 27 BOOKS Name of the Book: MATTHEW Writer: APOSTLE MATTHEW Place Written: PALESTINE Writing Completed: 41 C. E. Name of the Book: 1 THESSALONIANSWriter: APOSTLE PAULPlace Written: ROMEWriting Completed: 50 C. E.Name of the Book: GALATIANS Writer: APOSTLE PAUL Place Written: CORINTH or SYRIAN ANTIOCH Writing Completed: 50 - 52 C. E. Name of the Book: 2 THESSALONIANSWriter: APOSTLE PAULPlace Written: CORINTHWriting Completed: 51 C. E.Name of the Book: 1 CORINTHIANS Writer: APOSTLE PAUL Place Written: EPHESIANS Writing Completed: 55 C. E. Name of the Book: 2 CORINTHIANSWriter: APOSTLE PAULPlace Written: MACEDONIAWriting Completed: 55 C. E.Name of the Book: ROMANS Writer: APOSTLE PAUL Place Written: CORINTH Writing Completed: 56 C. E. Name of the Book: LUKEWriter: APOSTLE LUKEPlace Written: CAESAREAWriting Completed: 56 - 58 C. E.Name of the Book: EPHESIANS Writer: APOSTLE PAUL Place Written: ROME Writing Completed: 60 - 61 C. E. Name of the Book: PHILIPPIANSWriter: APOSTLE PAULPlace Written: ROMEWriting Completed: 60 - 61 C. E.Name of the Book: COLOSSIANS Writer: APOSTLE PAUL Place Written: ROME Writing Completed: 60 - 61 C. E. Name of the Book: PHILEMONWriter: APOSTLE PAULPlace Written: ROMEWriting Completed: 60 - 61 C. E.Name of the Book: MARK Writer: APOSTLE MARK Place Written: ROME Writing Completed: 60 - 65 C. E. Name of the Book: ACTS OF APOSTLESWriter: APOSTLE LUKEPlace Written: ROMEWriting Completed: 61 C. E.Name of the Book: HEBREWS Writer: APOSTLE PAUL Place Written: ROME Writing Completed: 61 C. E. Name of the Book: 1 TIMOTHYWriter: APOSTLE PAULPlace Written: MACEDONIAWriting Completed: 61 - 64 C. E.Name of the Book: TITUS Writer: APOSTLE PAUL Place Written: MACEDONIA (?) Writing Completed: 61 - 64 C. E. Name of the Book: JAMESWriter: APOSTLE JAMES (JESUS’ BROTHER)Place Written: JERUSALEMWriting Completed: 62 C. E.Name of the Book: 1 PETER Writer: APOSTLE PETER Place Written: BABYLON Writing Completed: 62 - 64 C. E. Name of the Book: 2 PETERWriter: APOSTLE PETERPlace Written: BABYLON (?)Writing Completed: 64 C. E.Name of the Book: 2 TIMOTHY Writer: APOSTLE PAUL Place Written: ROME Writing Completed: 65 C. E. Name of the Book: JUDEWriter: APOSTLE JUDE (JESUS’ BROTHER)Place Written: PALESTINE (?)Writing Completed: 65 C. E.Name of the Book: REVELATION Writer: APOSTLE JOHN Place Written: PATMOS ISLAND Writing Completed: 96 C. E. Name of the Book: 1 JOHNWriter: APOSTLE JOHNPlace Written: EPHESUS, or nearWriting Completed: 98 C. E.Name of the Book: 2 JOHN Writer: APOSTLE JOHN Place Written: EPHESUS, or near Writing Completed: 98 C. E. Name of the Book: 3 JOHNWriter: APOSTLE JOHNPlace Written: EPHESUS, or nearWriting Completed: 98 C. E.Name of the Book: JOHN Writer: APOSTLE JOHN Place Written: EPHESUS, or near Writing Completed: 98 C. E. Please Note: Information compiled from the New World Translation of the Holy Scriptures (NWT). Bible Books/Letters in the Old Testament and New Testament arranged in order based on the “Year of Completion of Writing.” ",
            "date": "Answered September 28, 2018",
            "views": "494",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Kashif Hashmi",
                    "user_href": "/profile/Kashif-Hashmi-30"
                }
            ]
        }
    ]
}