{
    "title": "Is 'Fantastic Beasts and Where to Find Them' canon to the Harry Potter books or movies universe? - Quora",
    "tags": [
        "Fantastic Beasts and Where to Find Them (2001 book)",
        "Fantastic Beasts (movie series)",
        "Fantastic Beasts and Where To Find Them (2016 movie)",
        "J.K. Rowling (author)",
        "Harry Potter (book series)",
        "Harry Potter (movie series)",
        "Harry Potter (creative franchise)"
    ],
    "response": [
        {
            "author_info": {
                "name": "CJ Lee",
                "href": "/profile/CJ-Lee-22"
            },
            "answer_text": "Canon is a loose term to mean a series of works that are “accepted” as the absolute authority on a fictional universe. In the case of Star Wars, there are several books written by several different authors that are “accepted” as canon. So the idea that it must come from the same person is not the case. However, within the universe of Harry Potter, since the entire series was written by a single person and was completely designed by a single author anything that is specifically written in its entirety by JK Rowling CAN be considered canon unless it contradicts a pre-established canonical source. Books = Comic Relief > Interviews > Pottermore This is generally what HP purist consider to be canon. The books are to be taken as the highest level of canon nothing supersedes what is already written. The reason JK’s interviews fall into a sub-category is that she herself claims that she NEVER re-reads the books. There are numerous occasions of her making claims that directly contradict the books and then she has to make amends. Pottermore can only be considered canon when a specific section is completely written by JK and follow the rules of her universe. Pottermore has recently merged the books and the movies on their website, so one has to be careful on what is cited from the site. The movies are laughable, and directly defy the canon of the books in so many ways that it almost has to be thought of as a separate yet distinctly similar universe. In no way shape or form can they ever be considered canon nor can they ever be used as a valid argument in HP discussions unless the question is specifies that it is about the movies. Despite what JK says the Cursed-Child clearly can not be considered canon since not only does it directly go against pre-established canon in the books she herself did not fully write it. In the same regards while she had a large hand in making the movie to think that she completely scripted it in its entirety and that she was detailed enough to remove any element that goes against the book canon is foolish. Since David Yates is once again making the movies and he make significant changes to JK’s world, there is no way it could possibly fit into the canon of the books. Though the canon of the movies deviates so wildly from the books we could argue that anything else that is not true canon can be a part of the movie series. ",
            "date": "Answered November 20, 2016",
            "views": "4",
            "upvotes": " View 5 Upvoters",
            "upvoters": [
                {
                    "user_id": "Racchel Cabrera",
                    "user_href": "/profile/Racchel-Cabrera"
                },
                {
                    "user_id": "Mohamed Zeggaf",
                    "user_href": "/profile/Mohamed-Zeggaf"
                },
                {
                    "user_id": "Nathan Beard",
                    "user_href": "/profile/Nathan-Beard-6"
                },
                {
                    "user_id": "Radovan Bartánus",
                    "user_href": "/profile/Radovan-Bartánus"
                },
                {
                    "user_id": "Wu Yi Ling",
                    "user_href": "/profile/Wu-Yi-Ling"
                }
            ]
        },
        {
            "author_info": {
                "name": "Monti Parauha",
                "href": "/profile/Monti-Parauha-2"
            },
            "answer_text": "Magic has come to North America. After a long time , we are back in the same universe. The world of the Wizarding World. However , we are seeing the world in a before Harry Potter story with Fantastic beasts and Where To Find Them and we are also seeing a after Harry Potter story , Harry Potter And The Cursed Child. The latter one is much more related to Harry Potter. That is because it has the original characters as well.Fantastic beasts and Where To Find Them is a prequel to the Harry Potter series.Let's meet him. Newt Scamander.Who is he ?Though he is described in the Fantastic Beasts and Where To Find Them book, many die hard Harry Potter fans themselves might be scratching their heads over who our new protagonist is. Thankfully, however, by revisiting the book and reading the information released so far by the film, we can get a good idea of who Newt Scamander is. He is certainly grounded in the original series, as the titular book was a required textbook for all Hogwarts students, and he is a famously known figure in that world.Scamander’s love for magical creatures was developed early on, as he was strongly influenced by his mother’s breeding of Hippogriffs. He attended Hogwarts as a Hufflepuff before joining the Ministry of Magic’s Department for the Regulation and Control of Magical Creatures, first in the Office for House-Elf Relocation and then the Beast Division. He was later commissioned by Obscurus Books to write a book about magical creatures, and he travelled the world gathering and documenting these beasts. After completing his travels, he comes to New York before returning home. It is here that we join him on his http://adventures.So it turns out , during Harry's school study , they had to study this book. And the author of this book is Newt Scamander. And the name of the book is Fantastic beasts and Where to Find Them.Wizards knew of the new world long before Christopher Columbus, apparently. In History of Magic in North America: Fourteenth Century-Seventeenth Century, Rowling tells us about the Native Americans and those in Europe that were in contact with them prior to the colonies. No different than in Europe, there were all magical families, and also wizards born into non magical families. Rowling says that many Native wizards were even accepted or even held in high regards, while others were cast aside as being cursed.A notable difference is that, unlike Europeans, Native Americans didn’t use wands to produce magic. Some notable witches and wizards were known for their healing, hunting, plant and animal magic. Also, there were a number of Animagi in their communities; they were legends called “Skin Walkers,” who could transform into animal form, and were believed to be evil magicians. In truth, most had to use their powers to avoid persecution. There will be five films. The first one , Fantastic beasts and Where To find Them is set in 1926.Rowling has already said that the last film, the fifth in the franchise, will take place in 1945 — the year that famous Hogwarts headmaster Albus Dumbledore defeated the evil Grindelwald in a duel. GRINDEL-WHO?I’m getting to that. Grindelwald is considered one of the most dangerous wizards of all time, even usurping Voldemort, and during the turn of the century, he was plotting to create a wizard army that overtook the muggles all around the world. He saw their race as the superior one and didn’t think they should have to hide in the shadows. This is a pretty big theme in Fantastic Beasts — the divide between non-magical folk and magical people — and Grindelwald’s relationship with Dumbledore is crucial to telling the story. WHAT RELATIONSHIP?Stop interrupting, self! Grindelwald had become friends with Dumbledore while he was a student at Durmstrang Institute, a school that some may remember from the fourth Harry Potter installment, Harry Potter and the Goblet of Fire. They had plans to be benevolent leaders together, but their friendship fell apart quickly after a mishap during a duel lead to the death of Dumbledore’s sister, Ariana. Following those events, Grindelwald left Britain, stole the Elder Wand, and set up a base in a different part of Europe, committing a series of vicious crimes and murders.Elder Wand is the most powerful wand of all time. WHAT DOES THAT HAVE TO DO WITH FANTASTIC BEASTS?Well, dear friend, this is where the timeline of all the events that happened during the time before Harry Potter become absolutely crucial. We know that between the period of 1900 and 1926 Grindelwald was busy tracking down and stealing the Elder Wand so he could set up his base and rise to power. It just so happens that two very important things happen in December of 1926, with one of those events forever changing the course of the magical world: Newt Scamander, our main character from Fantastic Beasts, arrives in America to conduct more research and Tom Riddle, otherwise known as Lord Voldemort, is born.This is Grindelwald. Let's hope we see Dumbledore ( Michael Gambon ) in the upcoming parts !!! ",
            "date": "Answered November 28, 2016",
            "views": "21",
            "upvotes": "0"
        }
    ]
}