{
    "title": "Is 'Summa Theologica' intended to be read from start to finish? Or is it a work that you delve in and out of? - Quora",
    "tags": [
        "Summa Theologica",
        "Literature",
        "Reading",
        "Christianity"
    ],
    "response": [
        {
            "author_info": {
                "name": "Bruce R. Bain",
                "href": "/profile/Bruce-R-Bain"
            },
            "answer_text": "Probably not. Philosophical works cannot be read like some kind of “novel”. Rather than read the book directly, in a first effort to understand it, it may be better to read summaries and reviews and other analyses of the author’s ideas. That way, you can gradually “spiral” in on the most complex ideas. For example, you might read this first: “Aquinas (A Beginner's Guide)” Paperback – , 2009 by Edward Feser, Ph.D. ISBN-10: 1851686908 ——————————————— —— or ——————————————————- “Aquinas's Shorter Summa: Saint Thomas's Own Concise Version of His Summa Theologica” Paperback – December 1, 2001 by St. Thomas Aquinas ISBN-10: 1928832431  In fact, I would not even think of attempting to understand a philosophical discourse like this, without first, printing out a general analysis on Wikipedia, and thereafter, printing out a deeper analysis such as would be found on a credible philosophical website such as The Stanford Encyclopedia of Philosophy Online. If I had the option,  I would very much like to see study of the first book here, conducted in association with a group.  If each person  would undertake the obligation to identify the critical terms in the vocabulary, the lists can be a great study aid.  The difficulty to be avoided of course, would be to avoid “personal opinions” and to stick to  the subject  of the author’s text. ",
            "date": "Answered June 2, 2016",
            "views": "586",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Rufinus Ondieki",
                    "user_href": "/profile/Rufinus-Ondieki"
                },
                {
                    "user_id": "Rebecca Baldwin",
                    "user_href": "/profile/Rebecca-Baldwin-8"
                },
                {
                    "user_id": "Cyril Anderson",
                    "user_href": "/profile/Cyril-Anderson"
                }
            ]
        },
        {
            "author_info": {
                "name": "Kirk A. Janowiak",
                "href": "/profile/Kirk-A-Janowiak"
            },
            "answer_text": "If you survey the entire work, you’ll notice that it is divided up into units that serve up a proposition and explore or explain it, or a unit of explanatory text that answers a question. It might be thought of as a kind of long-winded and verbose form of medieval theological/philosophical FAQ. As such, no one would have been (then or now) expected to read it through as one does a novel, an history, or a single-thought essay. It would always have been read a proposition or theological thought at a time. People then seemed to spend a great deal more time thinking about what they read; cogitating, ruminating, and even prayerfully meditating on the text, it's apparent meaning, and it's possible subtext (or “between the lines” meaning). ",
            "date": "Answered June 6, 2016",
            "views": "541",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Yyiri",
                    "user_href": "/profile/Yyiri"
                },
                {
                    "user_id": "Cyril Anderson",
                    "user_href": "/profile/Cyril-Anderson"
                }
            ]
        }
    ]
}