{
    "title": "Is 'The Great Gatsby' a good book? Why or why not? - Quora",
    "tags": [
        "The Great Gatsby (2013 movie)",
        "The Great Gatsby (1925 book)",
        "Book Recommendations"
    ],
    "response": [
        {
            "author_info": {
                "name": "Matthew Thompson",
                "href": "/profile/Matthew-Thompson-172"
            },
            "answer_text": "It is a GREAT book. Offers social commentary relevant to today: alcohol, parties, sex, money, celebrity obsessed culture… sound familiar? It covers a fascinating time in history.Jam packed: Fitzgerald crams a well developed plot line and interesting characters combined with such a rich poetic writing style in a mere 47,094 words! That’s nothing considering the first Harry Potter book contains 76,944. This gives the book a great pace and will keep you engaged until the last page is turn. Of course it also makes it a fast read and easy to re-read.Great characters: From the ‘hulking’ Tom Buchanan to the delicate Daisy, and of course the mysterious Gatsby, the book contains truly iconic characters.Plot twists: Clever and unpredictable changes in the plot although the book is highly enjoyable even without these.It’s a classic: It has achieved such a timeless status that whether the book is ‘good’ or not it is still important to read due to it’s huge impact and large readership.Potential drawbacks: ‘Too short.’Language is very dense.Characters are not likeable.May need to be read multiple times to grasp.Hope this helped. Cheers old sport!  Matthew ",
            "date": "Answered January 3, 2017",
            "views": "34",
            "upvotes": " View 7 Upvoters",
            "upvoters": [
                {
                    "user_id": "Cathrin Permaul",
                    "user_href": "/profile/Cathrin-Permaul"
                },
                {
                    "user_id": "Hussein Abbas",
                    "user_href": "/profile/Hussein-Abbas-15"
                },
                {
                    "user_id": "Tsundoku Trash",
                    "user_href": "/profile/Tsundoku-Trash"
                },
                {
                    "user_id": "Harry Bloom",
                    "user_href": "/profile/Harry-Bloom"
                },
                {
                    "user_id": "Ahmad Hussain",
                    "user_href": "/profile/Ahmad-Hussain-6"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/朱大海"
                },
                {
                    "user_id": "Justina H",
                    "user_href": "/profile/Justina-H"
                }
            ]
        }
    ]
}