{
    "title": "Is 100% pure cocaine addictive? - Quora",
    "tags": [
        "Cocaine",
        "Addictions"
    ],
    "response": [
        {
            "author_info": {
                "name": "Winnifred Haertel",
                "href": "/profile/Winnifred-Haertel"
            },
            "answer_text": "Yes, it is. Cocaine is an illicit drug that acts on our brain and our nervous system. Cocaine can be as addictive as other illicit drugs, including morphine, heroin, and alcohol. It produces such positive feelings like euphoria and a high. After heavy use of the drug the body and brain adapt to the presence of cocaine in his or her system. Hence, that person’s brain and body will need cocaine to function normally. Derived from the coca plant native to South America, cocaine abuse can cause serious health problems and damage to the brain. When someone is caught in the spiral of addiction to cocaine, they may begin to show certain signs and symptoms of drug abuse. Physical symptoms include dilated pupils, excitability, incoherent speech, high blood pressure, irregular heartbeat and bizarre or violent behavior. Since it can be snorted, smoked or injected, you may find drug paraphernalia such as a pipe, tourniquets, spoons or syringes. Because the high from cocaine varies depending on the vehicle of administration, users begin to increase the dosage to counter the crash. Eventually, exhaustion, depression and irritability set in. Puncture wounds surrounding injection sites, skin infections or nasal and sinus damage are other signs of abuse. Sources: Cocaine withdrawal Cocaine abuse ",
            "date": "Answered May 12, 2017",
            "views": "15",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "William Stalzer",
                "href": "/profile/William-Stalzer-2"
            },
            "answer_text": "I am a recovered cocaine addict, 12 years in July, and used for 26 years. I was addicted both psychologically and physically. It took me six years to break the habit; I am one of the lucky few. Hardest thing I ever did in my life. Too answer your question, pure cocaine can be smoked (freebase) but snorting pure cocaine will more likely kill you. A dealer I knew, way back when, told me this because I wanted to try some before he cut it (dilute with another white powder) and even he would not touch it without cutting it. Stay away from cocaine and heroin - it will more than likely kill you. ",
            "date": "Answered May 11, 2017",
            "views": "17",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Adam Jones",
                    "user_href": "/profile/Adam-Jones-171"
                },
                {
                    "user_id": "Sean Cahill",
                    "user_href": "/profile/Sean-Cahill-34"
                },
                {
                    "user_id": "Jesse McCall",
                    "user_href": "/profile/Jesse-McCall-8"
                },
                {
                    "user_id": "N.G. Haas",
                    "user_href": "/profile/N-G-Haas"
                }
            ]
        }
    ]
}