{
    "title": "Is anime popular in Japan? - Quora",
    "tags": [
        "Culture of Japan",
        "Japan",
        "Fame and Mass Popularity"
    ],
    "response": [
        {
            "author_info": {
                "name": "Hardeep Singh",
                "href": "/profile/Hardeep-Singh-146"
            },
            "answer_text": "Well Yeah dude it's popular. It's a part if their culture, it's a part of their daily lives. If you ever visit japan you'll see anime everywhere you go.  This is how a Japanese school bid farewell to their graduating class this year.  That's konohagakure's most surprising ninja Naruto Uzumaki on a train in Japan.   Well that's Goku and his son Gohan with his super saiyan fries and cola powered with Gohan's Ki.  Here's a japanese guy summing it up all to well. Here's a link to a wiki if don't know what moe means: Moe (slang) and why do you think Japanese are regarded as the most well-mannered people in the world, cause those values were embedded in them all through their childhood while watching anime like One Piece,Naruto, Fairy tail, DBZ and many, many, many more. That's just what I think though. :-) ",
            "date": "Answered September 23, 2016",
            "views": "36",
            "upvotes": " View 12 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Isabella Helena Rutan",
                    "user_href": "/profile/Isabella-Helena-Rutan"
                },
                {
                    "user_id": "Tony Mendez",
                    "user_href": "/profile/Tony-Mendez-95"
                },
                {
                    "user_id": "Shreyanshu Singh",
                    "user_href": "/profile/Shreyanshu-Singh-15"
                },
                {
                    "user_id": "Anu Singh",
                    "user_href": "/profile/Anu-Singh-414"
                },
                {
                    "user_id": "Daren Dulian",
                    "user_href": "/profile/Daren-Dulian"
                },
                {
                    "user_id": "Anubhav Sagar",
                    "user_href": "/profile/Anubhav-Sagar-8"
                },
                {
                    "user_id": "Rayford Goode",
                    "user_href": "/profile/Rayford-Goode"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/Romero-9"
                },
                {
                    "user_id": "Pushkar Saini",
                    "user_href": "/profile/Pushkar-Saini-4"
                },
                {
                    "user_id": "Omayma Hassanin",
                    "user_href": "/profile/Omayma-Hassanin"
                }
            ]
        },
        {
            "author_info": {
                "name": "Alex Fragoso",
                "href": "/profile/Alex-Fragoso-1"
            },
            "answer_text": "From what i have heard is that Manga which is what anime is based from is popular for sure! It is in their culture and wherever you go and look may find pictures of manga i.e posters, signs so on :) however anime , it depends on the person some i think might find it nerdy or may think of Otaku which in general is having a hobby or something you like but to an extreme so that can be looked down upon if you are obsessed with anime and let it take over your life, otherwise its fine. However you have things like cosplay and such that are pretty popular so it shouldn’t be hard to find people that like anime and not only manga. Think about it how books and Tv or Movies are for people in the US and countries , books might be less popular for some or not as talked about unless you are in that kind of book fan culture or it be a famous movie/book like harry potter, or how comics are like for people in the US. As for Japan i think manga is more approved of for all ages, it may be for different reasons such as it is less time consuming then watching episodes of it since they tend to work a lot there usually or be quite busy depending on the person/job/school etc. I use an app called badoo and i talk to some japanese friends :) and if anything many find it really cool and interesting as to how or why foreigners like say japanese rock, their culture, manga/anime and so on. ",
            "date": "Answered March 31, 2017",
            "views": "23",
            "upvotes": " View 5 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Darik",
                    "user_href": "/profile/Darik-1"
                },
                {
                    "user_id": "Michael Fabian",
                    "user_href": "/profile/Michael-Fabian-30"
                },
                {
                    "user_id": "Isabella Helena Rutan",
                    "user_href": "/profile/Isabella-Helena-Rutan"
                },
                {
                    "user_id": "Chris Jiang",
                    "user_href": "/profile/Chris-Jiang-4"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/Zohaib-irfan-6"
                }
            ]
        }
    ]
}