{
    "title": "Is Carol Danvers related to Kara Danvers? - Quora",
    "tags": [],
    "response": [
        {
            "author_info": {
                "name": "Amos Greig",
                "href": "/profile/Amos-Greig"
            },
            "answer_text": "They aren’t related at all. Carol Danvers is Marvel comics and Kara Danvers is a recent name change for Supergirl. When Supergirl was first introduced her name was Kara Zoe-El (1959), over time and numerous reboots. Following the conclusion of Crisis on Infinite Earths, several different characters written as having no familial relationship to Superman have assumed the role of Supergirl, including Matrix, Linda Danvers, and Cir-El. Following the cancellation of the third, 1996–2003 Supergirl comic book series which starred the Matrix/Linda Danvers version of the character, a modern version of Kara Zor-El was reintroduced into the DC Comics continuity in issue #8 of the Superman/Batman comic book series titled \"The Supergirl from Krypton\" (February 2004). The modern Kara Zor-El stars as Supergirl in an eponymous comic book series, in addition to playing a supporting role in various other DC Comics publications. Only the tv series calls her Kara Danvers. From the wiki Kara Zor-El:Created by Otto Binder and Al PlastinoKara Zor-L:Created by Gerry Conway, Ric Estrada and Wally WoodMatrix:Created by John ByrneLinda Danvers:Created by Peter David and Gary FrankCir-El:Created by Steven Seagleand Scott McDanielAriella Kent:Created by Peter David and Dusty Abell ",
            "date": "Answered April 2, 2019",
            "views": "5",
            "upvotes": " View 3 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Jasneet Khurana",
                    "user_href": "/profile/Jasneet-Khurana-2"
                },
                {
                    "user_id": "Kyle Martinez",
                    "user_href": "/profile/Kyle-Martinez-59"
                },
                {
                    "user_id": "Joshua Chua",
                    "user_href": "/profile/Joshua-Chua-7"
                }
            ]
        },
        {
            "author_info": {
                "name": "Anthony Miles",
                "href": "/profile/Anthony-Miles-2"
            },
            "answer_text": "No. Let’s start with Supergirl from DC. Her Kryptonian name was Kara Zor-El. Her name at the orphanage was Linda Lee (LL because she is a Superman character). When she was adopted by the Danvers, she became Linda Danvers. Meanwhile, over at Marvel, Carol Danvers was working at Project Pegasus with Doctor Lawson, who was secretly the Kree warrior Mar-Vell, and publicly the hero Captain Marvel (the first one of Marvel). I don’t know if the creators of Carol Danvers used Danvers as a nod to Supergirl. It is certainly possible. I won’t go into the convoluted history of post-Crisis Supergirl, except briefly to say that she has been using the name Kara since then. In the real world, the popularity of Supergirl had made the name Kara or Cara a more common girl’s name rather than the rarity it was at Supergirl’s debut. The Supergirl TV show reintroduced the Danvers couple and Supergirl’s Earth surname of Danvers. This, along with her lesbian secret agent sister Alex, was later shoehorned into current continuity. TL;DR No. They are from different companies. ",
            "date": "Answered September 28, 2019",
            "views": "41",
            "upvotes": " Answer requested by Katlin Watts and Tony Nyborg"
        }
    ]
}