{
    "title": "Is DAS Gupta a good book for IIT? - Quora",
    "tags": [
        "JEE Preparation",
        "Indian Institutes of Technology",
        "Book Recommendations",
        "Joint Entrance Examination"
    ],
    "response": [
        {
            "author_info": {
                "name": "Manas Aggarwal",
                "href": "/profile/Manas-Aggarwal-8"
            },
            "answer_text": "Yes. You must do at least Das Gupta if not anything else. Das Gupta, TMH and ML Khanna these days have become mostly easy problems for JEE Advanced. Yeah, some problems in Das Gupta are JEE Advanced level. You must do Das Gupta as a beginner (note that as a beginner for JEE Advanced) whether or not you do more advanced problems. This will help you to get a good rank, and, if you are really smart enough, to get a top rank in JEE Advanced. Previous years papers should be done to crack jee advanced. To reach a level sufficiently higher than JEE Advanced and crack it comparatively COMFORTABLY and APPROPRIATELY what you need to solve is FIITJEE GMP and/or Aakash Success Magnet. But don't get demoralised with some GMP problems, rather build yourself up by learning from each and every problem. View every solution whether you get the correct answer or not.For intuitive theory read KD Joshi Educative JEE Mathematics and give time to it. ",
            "date": "Answered June 20, 2017",
            "views": "43",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Yash Chaudhary",
                    "user_href": "/profile/Yash-Chaudhary-40"
                },
                {
                    "user_id": "Argon Noble",
                    "user_href": "/profile/Argon-Noble-1"
                },
                {
                    "user_id": "Noble Metal",
                    "user_href": "/profile/Noble-Metal-1"
                },
                {
                    "user_id": "Siddharth Tyagi",
                    "user_href": "/profile/Siddharth-Tyagi-33"
                }
            ]
        },
        {
            "author_info": {
                "name": "Rupesh Behera",
                "href": "/profile/Rupesh-Behera-4"
            },
            "answer_text": "I myself started doing das gupts in my initial stages of JEE preparation .The book is not bad but in JEE point of view i would not recommend you this book because the problem here are lengthy and subjective and are mainly proof based . So i strongly recommend you that if you have plenty of time then for your aptitude enhancement you can solve this book. Happy JEE preparation….. ",
            "date": "Answered June 18, 2017",
            "views": "25",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Vedanshu Sute",
                    "user_href": "/profile/Vedanshu-Sute-1"
                },
                {
                    "user_id": "Ramesh Chandra",
                    "user_href": "/profile/Ramesh-Chandra-21"
                },
                {
                    "user_id": "Siddharth Tyagi",
                    "user_href": "/profile/Siddharth-Tyagi-33"
                },
                {
                    "user_id": "Shruti Sharanya",
                    "user_href": "/profile/Shruti-Sharanya"
                }
            ]
        }
    ]
}