{
    "title": "Is economic globalization a new phenomenon? - Quora",
    "tags": [
        "Globalization",
        "International Economics"
    ],
    "response": [
        {
            "author_info": {
                "name": "Santhakumar V",
                "href": "/profile/Santhakumar-V"
            },
            "answer_text": "It is not. If we take the last 1000 years, international trade or globalization has been evolving organically. (In certain contexts the external traders became the rulers of some countries but the trade part was expanding.) However in the beginning of the twentieth century, different ideologies which valorize closed economies gained acceptance. Hence many countries followed controlled trade policies. This has slowed the pace of globalization. However these ideologies lost their attraction by 1980s and 1990s in different parts of the world. After that, one could see a rapid expansion of international trade and globalization. However there is another issue currently. Globalization creates some issues in the developed countries. The presence of cheaper workers in developing countries make the social security of the working class in the developed world unsustainable. Hence there is a growing opposition to the globalization in the developed world. That is creating some issues but such an opposition to globalization is not sustainable. There will be strong forces and incentives within these countries which would overcome such an opposition. ",
            "date": "Answered September 27, 2020",
            "views": "76",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Michael William",
                "href": "/profile/Michael-William-192"
            },
            "answer_text": "The question restricts itself to ‘economic globalization’. The quick answer is ‘yes’. To define ‘globalization’ as a new form of internationalism, then the internationalism of past centuries has been very different. In the past, internationalism has involved the advanced countries, ie European ones, trading with the Third World and developing those areas. The settlements in the North American continent and then immigration in pursuit of a better life, by means of increased economic development, were integral to this: eg mining for gold and coal, farming, and industrial development. This also applies to Australia and even Africa. Today’s internationalism – globalization – is in stark contrast. Economically, it involves the transfer of production from the advanced economies to low-wage Third World countries to exploit cheap labour free of regulation. Meanwhile, there is mass immigration into the West to exploit the welfare systems of recipient countries and to undercut local wage rates. Globalization is the mechanism for the impoverishment of the populations of the West. ",
            "date": "Answered June 7, 2020",
            "views": "92",
            "upvotes": "0"
        }
    ]
}