{
    "title": "Is Fifty Shades of Grey worth reading? - Quora",
    "tags": [
        "Fifty Shades of Grey (2011 book)"
    ],
    "response": [
        {
            "author_info": {
                "name": "Eva Glasrud",
                "href": "/profile/Eva-Glasrud"
            },
            "answer_text": "The app I use to download audiobooks offered 50 Shades for free on Valentine’s Day, and I was about to start this long road trip, so I figured, Why not? It’s a pretty terrible book. Chapters 1–3 is just this girl getting a really cool opportunity to interview a self-made, 27-year-old billionaire, but her entire internal dialogue is, “Oh nooooo!!! Whaaaaa! I should be studying for my finals!” In the next few chapters, you learn that this girl has no hobbies, goals, or interests. She doesn’t have a computer. She doesn’t like sports or exercise and has basically never worn her tennis shoes. She doesn’t date. She isn’t really involved in anything at school except doing her homework. She’s never been drunk. She’s never kissed someone. Then one of her best friends tries to sexually assault her while she’s drunk, but she forgives him and they stay friends. Meanwhile, she’s obsessed with this guy, the billionaire. I feel like it’s hard to be a billionaire at 27 when you spend most of your time getting your glider license and your pilot license and your helicopter pilot license and obsessing over and constantly emailing the college student who interviewed you for her school newspaper. But if you’re able to suspend your disbelief over that… She finds out the guy, who is kind of stalking her (he uses the location data on her phone to know where she works and what bars she’s at and stuff), is into controlling and hurting women. It scares her. People say he’s abusive, but, really, it seemed mostly consensual to me. He didn’t just randomly start choking and hitting her, which, since this book came out, has become a real problem in the real world (see also: Women are being strangled, choked, slapped and spat on during sex - we need to stop pretending this is normal and The fatal, hateful rise of choking during sex). They hang out. She has like ten orgasms (including a nipple orgasm). She goes home and sobs. Then they hang out again. She has like ten orgasms. She goes home and sobs. Then they hang out again. She has like ten orgasms. She goes home and sobs. Then she goes to visit her mom, and the billionaire shows up at the bar where she and her mom are having cocktails. Then they hang out again. She has like ten orgasms. She goes home and sobs. “Oh, Anastasia, you are so wet!” is a phrase you’ll see a lot. “My inner goddess is doing backflips,” is another one that comes up quite a bit. He does buy her some rare books, which is very thoughtful, because she’s an English major (and she has no trouble finding a job within a week of her college graduation, which is fun; you might have a hard time suspending your disbelief when the girl who brags constantly that she’s “good at negotiating” does not negotiate her salary or benefits before accepting the job). But, of course, she makes a big drama out of it. So then at the end he spanks her really hard and it hurts so she breaks up with him. The end. There. Now you don’t have to read it. ",
            "date": "Answered March 30, 2020",
            "views": "16",
            "upvotes": " View 16 Upvoters",
            "upvoters": [
                {
                    "user_id": "Leyla Kutluca",
                    "user_href": "/profile/Leyla-Kutluca"
                },
                {
                    "user_id": "Temitope Johnson",
                    "user_href": "/profile/Temitope-Johnson-11"
                },
                {
                    "user_id": "Aanchal Gandhi",
                    "user_href": "/profile/Aanchal-Gandhi-1"
                },
                {
                    "user_id": "Reginald Ganious",
                    "user_href": "/profile/Reginald-Ganious-1"
                },
                {
                    "user_id": "Mosaicu Baby",
                    "user_href": "/profile/Mosaicu-Baby"
                },
                {
                    "user_id": "Anam Namazi",
                    "user_href": "/profile/Anam-Namazi-1"
                },
                {
                    "user_id": "Trisha",
                    "user_href": "/profile/Trisha-346"
                },
                {
                    "user_id": "Heshan Kumarasinghe",
                    "user_href": "/profile/Heshan-Kumarasinghe"
                },
                {
                    "user_id": "Pallavi Kanyady",
                    "user_href": "/profile/Pallavi-Kanyady"
                },
                {
                    "user_id": "Milo Christiansen",
                    "user_href": "/profile/Milo-Christiansen"
                }
            ]
        },
        {
            "author_info": {
                "name": "Linda Rodriguez",
                "href": "/profile/Linda-Rodriguez-2"
            },
            "answer_text": "Ok so i bought the book and started reading, simply because i could not take not knowing what \"the fuss is all about.\"  Im going to return it to target where i bought it. If you are an insecure teenager or an immature woman without any college education you will probably like it and not realize how bad it is.  If you are an intellectuAl and have some common decensy and self-respect, or are past your adolescent mentallity, then it will more than likely bother you how pathetic and insecure and naive the protagonist/narrator is.  Let me please clarify that i came to this conclusion by only reading the first 6 or 7 chapters, and then skipping to the last chapter to see if there was any hope for redemption of the protagonist/narrator. It was too awful, and written with such juvenile language that as a 28 yr old doctoral student (and confident, independent female), i couldnt bare to go on any further, and as i said earlier, im going to get my money back.  Its disturbing because the language is clearly meant for high school age teenage readers, but i dont believe teenagers should be reading such sexually graphic novels, unless youre 18 or older. But then, if you are 18 or older, why would you be reading a book with language that reads as if it were written for high school teenagers? It's creepy and weird at best. I believe this book has sold so many copies simply due to its shock factor. I dont believe any self-respecting female would read this book and really like the main character/narrator. ",
            "date": "Answered February 5, 2015",
            "views": "4",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Pallavi Kanyady",
                    "user_href": "/profile/Pallavi-Kanyady"
                },
                {
                    "user_id": "Madhumita Datta",
                    "user_href": "/profile/Madhumita-Datta-2"
                },
                {
                    "user_id": "Drew Hoffmaster",
                    "user_href": "/profile/Drew-Hoffmaster-1"
                },
                {
                    "user_id": "Louise Colette Leonard",
                    "user_href": "/profile/Louise-Colette-Leonard"
                }
            ]
        }
    ]
}