{
    "title": "Is Facebook reading my thoughts? - Quora",
    "tags": [
        "Thought Control",
        "Mind Reading",
        "Facebook Privacy",
        "Facebook (company)",
        "The Mind",
        "Reading",
        "Facebook (product)"
    ],
    "response": [
        {
            "author_info": {
                "name": "Ashok Nanotkar",
                "href": "/profile/Ashok-Nanotkar-3"
            },
            "answer_text": "1)No one can read your MIND and all the CONCEPTUAL FUNCTIONING including your thoughts, feelings emotions, decisions and all the rest of it. 2)All the so called CULTURAL - SPIRITUAL MIND READERS & MIND MASTERS, HYPNOTISTS and the whole allied Gang of FORTUNE TELLERS only make a PROBABLE GUESSWORK out of the EXPRESSIONS, STATEMENTS, CONFESSIONS and the BODY LANGUAGE exposed by you. 3)Even your BELOVED ONES also do not read your MIND but interact with you by reciprocal REFLEXES, RESPONSES between you and THEY. 4)Any MEDICAL TECHNOLOGY and any CYBER TECHNOLOGY can only read your BRAIN NEURON FUNCTIONS in terms of SYMBOLIC EXPOSURE conventionally consented and accepted by the existing scientific community restricted to their TERMINOLOGY. Your so called FACEBOOK & other so called FACE DETECTION TECHNOLOGY are not the exceptions. Whatever THEY conjecture & predict would be the TENTATIVE ASSESSMENT of the past. So don't worry, your MENTAL FREEDOM can not be violated by any SUPER MAN or by any SUPER TECHNOLOGY unless you surrender & get ready to CONDITION YOURSELF by their BRAINWASHING and INDOCTRINATION AGENDA. Ashok Nanotkar. India. ",
            "date": "Answered October 20, 2019",
            "views": "136",
            "upvotes": " Answer requested by Ishan Vikram",
            "upvoters": [
                {
                    "user_id": "Ishan Vikram",
                    "user_href": "/profile/Ishan-Vikram-4"
                }
            ]
        },
        {
            "author_info": {
                "name": "Danny Barrand",
                "href": "/profile/Danny-Barrand"
            },
            "answer_text": "Yep Facebook is Facebook Reads your Browsers Cookies so if your wondering why your seeing Advertisements for things you been looking up that is why ",
            "date": "Answered October 21, 2019",
            "views": "107",
            "upvotes": " View 1 Upvoter"
        }
    ]
}