{
    "title": "Is H.C. Verma enough for JEE Advanced? - Quora",
    "tags": [
        "H. C. Verma",
        "Joint Entrance Examination Advanced",
        "JEE Preparation"
    ],
    "response": [
        {
            "author_info": {
                "name": "Konark Sharma",
                "href": "/profile/Konark-Sharma-45"
            },
            "answer_text": "Whenever we talk of jee physics ,hcv also finds place in conversation….. Well more than half successful candidates solve it fully,while more than 90 percent do it for all the less calculative chapters….. .. . Some guys believe that hcv is way to easy and calculative…….hcv sometimes seems easy as it builds concepts steadily and so we grasp things easily ……. I believe that hcv is very important.start any chapter with it.build concepts..then do solved examples ……then every question……. There will come a time when u will think that it's too calculative but stick with it then.i gave jee 2019 and let me assure u that had I done all the calculations of hcv on my own without the help of calculator, I in that pressure situation would have freaked out less Do all questions of it without calculator and ask even the most minor of doubts from it….. It will assure u at least 70 to 80 marks in jee advance,paper of any year ,out of 120 , u can even score full as u would know all the concepts but for to achieve the unachievable u need to practice a lot of tough questions,ideas ,think upon theorems, and lastly be accurate and patient……… I will tell u how is it topic wise….. Modern physics: covers all types of questions ,concepts and very very calculative so do it while setting a timer….. Waves: interference is fine ,Doppler too is fine(the acceleration question in Doppler is great),but there r negligible questions in energy,so see some other source pp like Ashish Arora . Thermodynamics: u can do jee questions easily if u do it.but even do archive for all the topics.to take your understanding of it to another level do pathfinder…………. amazing book…….. Optics:hcv +archive=full marks in jee optics, yo man………… Electro: not sufficient, even some concepts like energy density ,circuit tricks r missing and questions r also of not top quality….I did Allen sheets, SRGBT, pathfinder (not complete but selective),my friends tell me that even ncert and Ashish Arora are good….. Mechanics: Verma Sahab has not shared any tricks,has explained the concepts well but havn't given very tough questions.do irodov…………amazing book……no need of pathfinder………..learn tricks from net……….. Overall a must do book Love your time with jee as otherwise it will only be it's and buts Share it with all your jee friends, and feel free to ask me anything related to jee as I just loved the journey,…………….. See u all in iit friends…….. ",
            "date": "Answered June 28, 2019",
            "views": "91",
            "upvotes": " View 60 Upvoters",
            "upvoters": [
                {
                    "user_id": "Sidhant Dwivedi",
                    "user_href": "/profile/Sidhant-Dwivedi-5"
                },
                {
                    "user_id": "Kunsh Anand",
                    "user_href": "/profile/Kunsh-Anand"
                },
                {
                    "user_id": "Maheedhar A.M",
                    "user_href": "/profile/Maheedhar-A-M"
                },
                {
                    "user_id": "Niranjan Dutta",
                    "user_href": "/profile/Niranjan-Dutta-6"
                },
                {
                    "user_id": "Aniket Pandey",
                    "user_href": "/profile/Aniket-Pandey-185"
                },
                {
                    "user_id": "Shubham Srivastava",
                    "user_href": "/profile/Shubham-Srivastava-1254"
                },
                {
                    "user_id": "Iliyan Noorani",
                    "user_href": "/profile/Iliyan-Noorani"
                },
                {
                    "user_id": "Harshal Dahiwale",
                    "user_href": "/profile/Harshal-Dahiwale-2"
                },
                {
                    "user_id": "Geetanjali Rout",
                    "user_href": "/profile/Geetanjali-Rout"
                },
                {
                    "user_id": "Saurabh Maurya",
                    "user_href": "/profile/Saurabh-Maurya-175"
                }
            ]
        },
        {
            "author_info": {
                "name": "Harshit Dixit",
                "href": "/profile/Harshit-Dixit-35"
            },
            "answer_text": "Today I would tell you something which may change your vision about JEE preparation! (I would answer your question but before that you should read the following because the answer depends upon some factors which you should know!:) There are following types of students preparing for JEE- Extraordinarily exceptional minded students Lets divide them into the category of AAn average student B.Below average student C.Stylish and show off student D,Talking about A- There are some students who are very famous in the cities due to their exceptional performances in the coaching institutes and various stories of them they jave expected rank of single digit or two digit and anyhow in the worst case they secure the rank of under 200.. Students of type A solve books like IE IRODOV, RESNICK HALLIDAY , and other foriegn author book and everything as high as possible, they solve Olympiads questions and so on! Now the most Important part is “B” for you! Yes you!!! As “ A group are busy in their studies and not available on Quora to read this!” Now regarding B- Some B’s are distracted (B-1) and others are concentrated towards the studies! (B-2) Both B’s have same potential , same IQ! BUT both of the B’s are interested to listen and find the amazing stories of A’s , that how many questions he does in one day! How many books he solves! What rank will he get! I too should solve Resnick, Irodov and stuff! And will grab under 50 rank, and my photo will be published in the front of the newspaper and stuff! This people form the group of 4–5 people in the coaching institute and study less and talk more! What happens? - they lose what they deserved! Many of B’s start solving IRODOV just to look cool in front of the others! But they start IRODOV before solving anything else! They sit and hardly even try 2–3 questions and finally He gives up and switches the subject or topic , Believe me! This attitude doesn’t give the results! Now another types of B’s- let’s call them B2 - very serious , concentrated , FOLLOW TEACHERS not A’s) Both B’s have same potential , the difference is only of concentration level and the way how he is less distracted! This kind of students solve what his teachers say! First they solve coaching material, then they go to HCV or IRODOV whatever is more comfortable to them! But they first build their concept then they go to any book! And for that kind of students “HC VERMA IS MORE THAN SUFFICIENT” and if the paper is like JEE 2018 then it may take you to score 90 percent! Yes, just look at the paper and its solutions and then HC VERMA , then think it own your own! See ! There are many exceptions in the world, one should not think of questions like- “ how many hours did Kalpit Veerwal sleep, how many marks did he score in his AITS” Instead you may ask to your JEE teacher how you should study as Your teacher knows about your potential more than you yourself! Yes, HC VERMA , is sufficient , and may give you your desired rank! But the most important thing is You have to solve sincerely and be away from Quora, Facebook , Whatsapp etc. for a year! Because these are the source of entertainment and distractions for B 2 group Students… Be like B 2 group students if you think you don’t belong to A group! You will surely reach the place which has secured the life of thousands of aspiring engineer in India! All the best ",
            "date": "Updated August 23, 2019",
            "views": "2087",
            "upvotes": " View 1.8K Upvoters ",
            "upvoters": [
                {
                    "user_id": "Viraj Agashe",
                    "user_href": "/profile/Viraj-Agashe-1"
                },
                {
                    "user_id": "Divyansh Sharma",
                    "user_href": "/profile/Divyansh-Sharma-494"
                },
                {
                    "user_id": "Harshavardhan Gulla",
                    "user_href": "/profile/Harshavardhan-Gulla"
                },
                {
                    "user_id": "Kartikay Thakur",
                    "user_href": "/profile/Kartikay-Thakur-2"
                },
                {
                    "user_id": "Aashritha Sharma",
                    "user_href": "/profile/Aashritha-Sharma-1"
                },
                {
                    "user_id": "Prince Singh",
                    "user_href": "/profile/Prince-Singh-695"
                },
                {
                    "user_id": "Riya Qureshi",
                    "user_href": "/profile/Riya-Qureshi"
                },
                {
                    "user_id": "Saloni",
                    "user_href": "/profile/Saloni-289"
                },
                {
                    "user_id": "Abel Joisee",
                    "user_href": "/profile/Abel-Joisee"
                },
                {
                    "user_id": "Lekesh Mahajan",
                    "user_href": "/profile/Lekesh-Mahajan-2"
                }
            ]
        }
    ]
}