{
    "title": "Is Harry Potter weak? - Quora",
    "tags": [
        "Voldemort (Wizarding World character)",
        "Harry Potter (Wizarding World character)",
        "Characters of the Wizarding World",
        "Harry Potter (book series)",
        "Harry Potter (movie series)",
        "Harry Potter (creative franchise)"
    ],
    "response": [
        {
            "author_info": {
                "name": "Hari Priya",
                "href": "/profile/Hari-Priya-494"
            },
            "answer_text": "Harry is anything but weak. It might seem like he’s weak when you compare him to the likes of Voldemort, Dumbledore, Severus Snape and other older, much more experienced wizards and witches, but at the end of the day, with the limited number of resources that he did have, he did a darned good job. Magically speaking, he had the potential to become a powerful wizard, which I think he did after growing up some more. Still, at the age of thirteen he learnt to cast a corporeal patronus, which is an extremely advanced charm that most adults can’t do, let alone fight a hundred dementors at once. When he wanted to do it, he picked up spells quite easily. Unfortunately he wasn’t very motivated to try his best on an average day and only learnt something for the sake of his own survival. As a person, I will let the following quotes from the books speak for themselves: “SO WHAT?” Harry shouted. “If Snape gets hold of the stone, Voldemort’s coming back! Haven’t you heard what it was like when he was trying to take over? There won’t be any Hogwarts to get expelled from! He’ll flatten it or turn into a school of Dark Arts! Losing points doesn’t matter anymore, can’t you see? D’you think he’ll leave you and your families alone if Gryffindor wins the House cup? If I get caught before I can get to the stone, well, I’ll have to go back to the Dursleys and wait for Voldemort to find me there, it’s only dying a bit later than I would have, because I’m never going over to the Dark Side! I’m going through the trapdoor tonight and nothing you two say is going to stop me! Voldemort killed my parents, remember?” Harry Potter and the Philosopher’s stone, Ch 16, Through the trapdoor And then there’s this: Voldemort raised his wand and before Harry could do anything to defend himself, before he could even move, he had been hit again by the Cruciatus curse. The pain was so intense, so all-consuming, that he no longer knew where he was…White-hot knives were piercing every inch of his skin, his head was surely going to burst with pain, he was screaming more loudly than he’d ever screamed in his life - And then it stopped. Harry rolled over and scrambled to his feet; he was shaking as uncontrollably as Wormtail had done when his hand had been cut off; … “I asked you whether you want me to do that again,”said Voldemort softly. “Answer me! Imperio!” And Harry felt, for the third time in his life, the sensation of his mind had been wiped of all thoughts… Ah, it was bliss, not to think, it was as though he was floating, dreaming…just answer no…say no…just answer no… I will not, said a stronger voice, in the back of his head, I won’t answer… Just answer no… I won’t do it, I won’t say it… Just answer no… … Harry crouched behind the headstone and new the end had come. There was no hope…no help to be had. And as he heard Voldemort draw nearer still, he knew one thing only, and it was beyond fear and reason: He was not going to die crouching here like a child playing hide-and-seek; he was not going to die kneeling at Voldemort’s feet…he was going to doe upright like his father, and he was going to die trying to defend himself, even if no defense was possible. Harry Potter and the Goblet of fire, Ch 34, Priori Incantatem (These are my favourite Harry moments and I think you can see why.) Judge for yourself now, if, magically or otherwise, Harry Potter was a weak wizard or not. ",
            "date": "Answered January 18, 2019",
            "views": "423",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Charu Bhatnagar",
                    "user_href": "/profile/Charu-Bhatnagar-23"
                },
                {
                    "user_id": "Navyaa Manda",
                    "user_href": "/profile/Navyaa-Manda"
                },
                {
                    "user_id": "Anthony Alice",
                    "user_href": "/profile/Anthony-Alice-5"
                }
            ]
        },
        {
            "author_info": {
                "name": "Michael Zahabi",
                "href": "/profile/Michael-Zahabi"
            },
            "answer_text": "Harry Potter is severely underrated by much of the fandom. I have read so many Quora answers and comments about how Harry was “weak” or “only knew like two spells” or “was a dumb slacker” or “nowhere close to being exceptional” or “a useless waste of space.” That last comment was probably Dudley’s Quora account by the way.  Even as a teenager Harry was far more powerful that the average wizard. The average wizard is actually pretty weak. “You wouldn’t believe how many people, even people who work at the Ministry, can’t do a decent Shield Charm,” said George. “‘Course, they didn’t have you teaching them, Harry.” Even as a fifth year student, it is evident that Harry is much more knowledgeable at combative based magic than even talented and powerful students from Durmstrang. Let me remind you that this school teaches its students how to use the Dark Arts. “Yes, Harry,” said Hermione gently, “but all the same, there’s no point pretending that you’re not good at Defense Against the Dark Arts, because you are. You were the only person last year who could throw off the Imperius Curse completely, you can produce a Patronus, you can do all sorts of stuff that full-grown wizards can’t, Viktor always said —” Ron looked around at her so fast he appeared to crick his neck; rubbing it, he said, “Yeah? What did Vicky say?” “Ho ho,” said Hermione in a bored voice. “He said Harry knew how to do stuff even he didn’t, and he was in the final year at Durmstrang.” Most importantly, however, Harry knows how to fight, unlike the average wizard. Unlike normal wizards, Harry was already a war veteran by the age of 14. This is shown by the fact that he is able to master several highly advanced Combat spells by the Fourth Book. Starting with the Patronus. “The spell I am going to try and teach you is highly advanced magic, Harry — well beyond Ordinary Wizarding Level. It is called the Patronus Charm.” “But I must warn you, Harry, that the charm might be too advanced for you. Many qualified wizards have difficulty with it.” “This charm is ridiculously advanced… I shouldn’t have suggested putting you through this…” Keep in mind that Harry was holding himself back while learning the Patronus due to his curiosity about his parents. “Several sessions on, he was able to produce an indistinct, silvery shadow every time the Boggart-Dementor approached him, but his Patronus was too feeble to drive the Dementor away. All it did was hover, like a semitransparent cloud, draining Harry of energy as he fought to keep it there. Harry felt angry with himself, guilty about his secret desire to hear his parents’ voices again. ‘You’re expecting too much of yourself,’ said Professor Lupin, sternly in their fourth week of practice. ‘For a thirteen-year-old wizard, even an indistinct Patronus is a huge achievement.’” Not only that, but it is harder to use the spell the more dementors there are. “’The true Patronus does do that,’ said Lupin. ‘But you’ve achieved a great deal in a very short space of time. If the Dementors put in an appearance at your next Quidditch match, you will be able to keep them at bay long enough to get back to the ground.’ ‘You said it’s harder if there are loads of them,’ said Harry.” Despite that, Harry manages to defeat over 100 dementors by the end of POA.  After that, he then manages to resist the Imperius, which is something most adult wizards cannot do. “Years back, there were a lot of witches and wizards being controlled by the Imperius Curse,” said Moody, and Harry knew he was talking about the days in which Voldemort had been all-powerful. “Some job for the Ministry, trying to sort out who was being forced to act, and who was acting of their own free will. “The Imperius Curse can be fought, and I’ll be teaching you how, but it takes real strength of character, and not everyone’s got it. Better avoid being hit with it if you can. CONSTANT VIGILANCE!” (Moody had insisted on putting Harry through his paces four times in a row, until Harry could throw off the curse entirely) He also masters several highly advanced Combat spells by the end of GOF. This was the result of HARD WORK and EFFORT put in by Harry and friends to PREPARE for the final task. Harry had soon mastered the Impediment Curse, a spell to slow down and obstruct attackers; the Reductor Curse, which would enable him to blast solid objects out of his way; and the Four-Point Spell, a useful discovery of Hermione’s that would make his wand point due north, therefore enabling him to check whether he was going in the right direction within the maze. He was still having trouble with the Shield Charm, though. This was supposed to cast a temporary, invisible wall around himself that deflected minor curses He also masters Stupefy, the stunning Charm, which he uses to incapacitate Death Eaters. The force of the Death Eaters’ spells shattered the tiled wall where Ron’s head had just been, as Harry, still invisible, yelled, “Stupefy!” The great blond Death Eater was hit in the face by a jet of red light: He slumped sideways, unconscious. Furthermore, Harry did become proficient in the levicorpus spell, which could only be done non-verbally. This was a spell that he learned from the “Half-Blood Prince” which causes people to be dangled upside down in mid air. Nvbl…that had to mean “nonverbal.” Harry rather doubted he would be able to bring off this particular spell; he was still having difficulty with nonverbal spells, something Snape had been quick to comment on in every D.A.D.A. class. On the other hand, the Prince had proved a much more effective teacher than Snape so far. Pointing his wand at nothing in particular, he gave it an upward flick and said Levicorpus! inside his head. He turned to leave; he had got two steps towards the door when a crashing blow hit him on the right ear…. …Staggering, he looked round. Ron’s fist was drawn right back, his face was contorted with rage; he was about to strike again. Harry reacted instinctively; his wand was out of his pocket and the incantation sprang to mind without conscious thought: Levicorpus! Ron yelled as his heel was wrenched upwards once more; he dangled helplessly, upside down, his robes hanging off him. He is also able to do the counter curse for it nonverbally. Praying that this was the counter-jinx, Harry thought Liberacorpus! with all his might. There was another flash of light, and Ron fell in a heap onto his mattress. He also learns other powerful spells such as… Harry aimed his wand at Peeves and said, “Langlock!” Peeves clutched at his throat, gulped, then swooped from the room making obscene gestures but unable to speak, owing to the fact that his tongue had just glued itself to the roof of his mouth. “Nice one,” said Ron appreciatively, lifting Dobby into the air so that his flailing limbs no longer made contact with Kreacher. “That was another Prince hex, wasn’t it?” Harry spat blood out of his mouth, pointed his wand at the falling sidecar, and yelled, “Confringo!” He knew a dreadful, gut-wrenching pang for Hedwig as it exploded; the Death Eater nearest it was blasted off his broom and fell from sight; his companion fell back and vanished. He even managed to master two out of the three Unforgivable curses. As Amycus spun around, Harry shouted, “Crucio!” The Death Eater was lifted off his feet. He writhed through the air like a drowning man, thrashing and howling in pain, and then, with a crunch and a shattering of glass, he smashed into the front of a bookcase and crumpled, insensible, to the floor. “I see what Bellatrix meant,” said Harry, the blood thundering through his brain, “you need to really mean it.” Harry raised the hawthorn wand beneath the cloak, pointed it at the old goblin, and whispered, for the first time in his life, “Imperio!” ",
            "date": "Answered May 11, 2020",
            "views": "28",
            "upvotes": " View 19 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Albara' Nsour",
                    "user_href": "/profile/Albara-Nsour"
                },
                {
                    "user_id": "Ben Solace",
                    "user_href": "/profile/Ben-Solace"
                },
                {
                    "user_id": "Adrienne Nelson",
                    "user_href": "/profile/Adrienne-Nelson-29"
                },
                {
                    "user_id": "Brianna Thomas",
                    "user_href": "/profile/Brianna-Thomas-202"
                },
                {
                    "user_id": "Alex Nox",
                    "user_href": "/profile/Alex-Nox-2"
                },
                {
                    "user_id": "Gastón Galdames San Martín",
                    "user_href": "/profile/Gastón-Galdames-San-Martín"
                },
                {
                    "user_id": "Janhavi",
                    "user_href": "/profile/Janhavi-66"
                },
                {
                    "user_id": "Stephanie Loverde",
                    "user_href": "/profile/Stephanie-Loverde"
                },
                {
                    "user_id": "Stephanie Rusen",
                    "user_href": "/profile/Stephanie-Rusen"
                },
                {
                    "user_id": "Emmanuel Emmanuel",
                    "user_href": "/profile/Emmanuel-Emmanuel-146"
                }
            ]
        }
    ]
}