{
    "title": "Is Harry Potter inspired by Roald Dahl? - Quora",
    "tags": [
        "Roald Dahl (author)"
    ],
    "response": [
        {
            "author_info": {
                "name": "Deirdre Beecher",
                "href": "/profile/Deirdre-Beecher"
            },
            "answer_text": "While not a hater, I never fell in love with the Harry Potter books. I suspect the reason for that is that I read all the same books as JK Rowling growing up. I was able to recognises who influenced her and so I never got that spark of *surprise* She was obviously familiar with Roald Dahl, and Enid Blyton, Frances Hodgeson Burnett and C.S Lewis amoungst others. Roald Dahl books are part of what created Rowlings writing brain, they are part of her code. (Like pretty much every child who grew up in 70’s - 90’s UK). But I am 100% satisfied that Harry Potter came to Rowling in a moment of pure inspiration. It is just when she was trying to pin him down on the page she found herself drawing on the code embedded within her brain. So Hogwarts has a touch of Mallory Towers about it. Harry Potter’s character has a bit of The Little Princess in there and the Dursley’s have a Roald Dahl quality. There is nothing wrong with that. Writing is absolutely an artform which stands on the shoulders of giants. Literally in Dahl’s case as he was well over six feet tall in real life. ",
            "date": "Answered October 12, 2019",
            "views": "256",
            "upvotes": " View 4 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Mary Natkins",
                    "user_href": "/profile/Mary-Natkins"
                },
                {
                    "user_id": "Barnali Chakrabarty",
                    "user_href": "/profile/Barnali-Chakrabarty"
                },
                {
                    "user_id": "Shobha Rao",
                    "user_href": "/profile/Shobha-Rao-59"
                },
                {
                    "user_id": "Eamon O'Kelly",
                    "user_href": "/profile/Eamon-OKelly"
                }
            ]
        },
        {
            "author_info": {
                "name": "Barbara Brutsch",
                "href": "/profile/Barbara-Brutsch"
            },
            "answer_text": "Roald Dahl was one of the many authors who inspired J.K.Rowling. The abuse by his relatives and their reaction to magic reminded me of “Matilda.” Umbridge and Trunchbull were separated at birth. The description of the candy cart and the first school feast had the scent of “Charlie and the Chocolate Factory.” Hagrid reminded me of “The Big Friendly Giant.” Thank you for the A2A. ",
            "date": "Answered May 1, 2019",
            "views": "172",
            "upvotes": " View 2 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Barnali Chakrabarty",
                    "user_href": "/profile/Barnali-Chakrabarty"
                },
                {
                    "user_id": "Shobha Rao",
                    "user_href": "/profile/Shobha-Rao-59"
                }
            ]
        }
    ]
}