{
    "title": "Is Harry Potter related to Fantastic Beasts? - Quora",
    "tags": [
        "Fantastic Beasts and Where To Find Them (2016 movie)",
        "Harry Potter (book series)",
        "Harry Potter (movie series)"
    ],
    "response": [
        {
            "author_info": {
                "name": "Catherine Birzer",
                "href": "/profile/Catherine-Birzer"
            },
            "answer_text": "They’re set in the same universe, but Fantastic Beasts is about 70 years earlier (the first FB movie, if I recall correctly, is set in 1926, while the HP novels take place between 1981–2017, with most of their action set in the years between 1991–1998). The characters are not related per se, except that Newt’s book is a textbook for the HP kids, Newt shows up on the Marauder’s Map at one point, Luna Lovegood marries Newt and Tina’s grandson, and there is a Chaser on the 2014 American Quidditch team with the tantalizingly familiar name Quentin Kowalski… ",
            "date": "Answered June 30, 2018",
            "views": "69",
            "upvotes": " View 9 Upvoters",
            "upvoters": [
                {
                    "user_id": "Siva Prasad Kundanam",
                    "user_href": "/profile/Siva-Prasad-Kundanam"
                },
                {
                    "user_id": "Ravi Sri",
                    "user_href": "/profile/Ravi-Sri-17"
                },
                {
                    "user_id": "Line Linexy",
                    "user_href": "/profile/Line-Linexy"
                },
                {
                    "user_id": "Amethyst Rhoton",
                    "user_href": "/profile/Amethyst-Rhoton"
                },
                {
                    "user_id": "Shalmalee Shubhada Lalit",
                    "user_href": "/profile/Shalmalee-Shubhada-Lalit"
                },
                {
                    "user_id": "K.C. Jensen",
                    "user_href": "/profile/K-C-Jensen"
                },
                {
                    "user_id": "Kelli Nakamura",
                    "user_href": "/profile/Kelli-Nakamura-2"
                },
                {
                    "user_id": "Mehuli",
                    "user_href": "/profile/Mehuli-1"
                },
                {
                    "user_id": "Peter Spering",
                    "user_href": "/profile/Peter-Spering-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Anant Pandey",
                "href": "/profile/Anant-Pandey-60"
            },
            "answer_text": "In the books, you clearly know that there was a dark lord before Voldemort. He too tried to conquer the world in his own way. And guess what, he was a friend of one of the most beloved and most positive character of the series, that was, Albus Percival Wulfric Brian Dumbledore, and his name was Gellert Grindelwald. Even if you are movie only person, if you've watched the deathly hallows part 1 closely, you may remember his name being mentioned. But I believe you'd recall the person who told Voldemort about the whereabouts of the Elder Wand. So, I'd define Fantastic Beasts as a prologue to the Harry Potter Franchise. It tells us the past about the characters we love, what happened to them, what was before Voldemort. It's like history of Harry Potter. ",
            "date": "Answered July 5, 2019",
            "views": "3",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Parag Rahate",
                    "user_href": "/profile/Parag-Rahate"
                },
                {
                    "user_id": "Ishita Narayan",
                    "user_href": "/profile/Ishita-Narayan"
                }
            ]
        }
    ]
}