{
    "title": "Is it free to publish a book? - Quora",
    "tags": [
        "Self-Publishing",
        "Book Publishing",
        "Publishing"
    ],
    "response": [
        {
            "author_info": {
                "name": "GJ Coop",
                "href": "/profile/GJ-Coop"
            },
            "answer_text": "It is possible to publish a perfectly fine book for nothing. Totally free. I've done it, but I am a particular type of maniac.  You can write it up in any text program that comes with your computer. In my instance that was TextEdit that is free with an Apple computer. You are just getting words on a page. It helps if you use a decent spellchecker. I've used the free version of Grammarly that points out incorrect spelling. I'm less enthusiastic about their grammar checker. You can plug your text into Hemingwayapp to test for any overly convoluted sentence structures, and other readability recommendations. Once you have the text as good as you can get it, it is worth getting this read by readers who will give you notes. There are various online groups who can do this for nothing, beta readers. You can get beta readers in your particular genre at Beta Reader Group on the useful website, Goodreads.com. Even if you have revised your text numerous times, as you should, these readers will help you discover additional typos, doubled words, wrong agreement of verbs, etc, and may give you feedback on your book's structure. Point out the obvious. All of this should be taken on board. Then the text needs to be correctly formatted in the actual book design. I used Pages that also comes free with my computer. It helps that the program now has had the facing pages layout feature reinstated. Best to first find the layout of an actual paperback book you like and create a similar book size, margins, font, and text size, number of lines of text per page, etc. Format your text with Styles to create consistency. The first paragraph in a chapter is usually not indented. Another round of editing is required to avoid orphan lines at chapter endings, and perhaps strange justified spacings when using multiple long words contiguously. Once all that is assembled, complete with title and front pages, table of contents, etc, it is straightforward to convert to the PDF format that publication requires. This locks in the formatting. Proofreading at this stage is eminently sensible. It is always useful to have additional eyes look over this to remove egregious mistakes that may have eluded you.  That leaves two things. Maybe even the two most important things. The few hundred word marketing blurb.And the cover.If these are not immediately appealing, in fact compelling, no one is ever going to look at your brilliant text. Your book is competing with 10 million others on Amazon, so it needs to stand out. The cover needs to be legible at postage stamp size. I used Inkscape to create my cover, an open source desktop design program that has the best price: free.  So, there's plenty of free programs to be used. Along with additional eyes perusing your output. All set for upload to KDP. Actually in my case it was Createspace, that has subsequently been incorporated with KDP. Total cost: zilch.  Do I recommend this? Nope. I just don't believe many people are prepared to do all the work themselves. Meticulously. My text went through a huge number of extensive revisions. Originally I wrote my basic text out in the field each day. In pencil, in a notebook. When in civilisation I transferred that to my online travel blog. I hosted that on someone else's website to start, then copied it to my own. Some revisions were made at this stage. Like, I tried to make the jokes funnier. That all was online for a long while before I converted some of it to into an e-book. Huge revisions were needed to convert from blog to ebook. Like changing from present to past tense. (Present tense makes sense for a daily blog, but not for an e-book.) Because the text needed to stand alone, without the image opportunities offered by a blog, the final text ended up twice the size. 105,000 words. The finalised e-book text had gone through six or so printouts and revisions. When the e-book text was converted to a paperback, it went through another five revisions. Another one or two when formatted. In the end I've made 15 or so _major_ revisions. I read my text at least 50 times, end to end. And yes, you kind of get sick of it. And blind to any mistakes.  The actual publishing with Createspace was super easy. Well, for those who can follow instructions. Publication there is free. Just upload your pdf file, the cover, and follow the instructions. (When you start selling, they take a commission included in what it costs to produce and ship the book.)  Few people would be prepared to put in so much effort. Hundreds of hours have been spent getting my book is good as I can. Sure, it's 500 words too long. I just haven't yet worked out which ones they are. Having created one paperback that is published, and selling, I'm working on another couple of e-books using the same method. It’s a lot easier second time around now I’ve worked out the method. What else would I be doing on long winter evenings?  PS. It is also possible to publish an ebook for zilch as well. (No harm in getting some assistance from Kimberly Hitchens for this.) GJ Coop's answer to What software should I use to write an eBook? ",
            "date": "Updated June 3, 2019",
            "views": "43",
            "upvotes": " View 28 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Athena Balanou",
                    "user_href": "/profile/Athena-Balanou"
                },
                {
                    "user_id": "A. F. Jansson",
                    "user_href": "/profile/A-F-Jansson"
                },
                {
                    "user_id": "Tony Negs",
                    "user_href": "/profile/Tony-Negs"
                },
                {
                    "user_id": "Ozden Isbilir",
                    "user_href": "/profile/Ozden-Isbilir"
                },
                {
                    "user_id": "Sharon Clark",
                    "user_href": "/profile/Sharon-Clark-209"
                },
                {
                    "user_id": "Terry Atkinson",
                    "user_href": "/profile/Terry-Atkinson-24"
                },
                {
                    "user_id": "Iryna Meged",
                    "user_href": "/profile/Iryna-Meged"
                },
                {
                    "user_id": "Thapelo Ntlhabo",
                    "user_href": "/profile/Thapelo-Ntlhabo"
                },
                {
                    "user_id": "Tu AN Huynh Van",
                    "user_href": "/profile/Tu-AN-Huynh-Van"
                },
                {
                    "user_id": "Angel Segarra",
                    "user_href": "/profile/Angel-Segarra-3"
                }
            ]
        },
        {
            "author_info": {
                "name": "Bruce Jones",
                "href": "/profile/Bruce-Jones-3"
            },
            "answer_text": "Yes, you can. Publishing on Amazon with KDP is free for both print and ebook. There are usually costs on the production side though for editing, cover design, layout, and formatting. But you can do these yourself or most of them yourself if you want. You can also publish for free with Burb, Lulu, Smashword and many others. Along with being free, with all these sites you retain your copyright and all your basic rights. This is huge, it means you have control of your content. It also means that no one can say no. You want to publish, you publish. My advice is to at least pay someone to edit your book, after that probably have someone create a good cover for you. But you have control and can publish your book. ",
            "date": "Answered December 22, 2019",
            "views": "90",
            "upvotes": "0"
        }
    ]
}