{
    "title": "Is it sufficient to read only NCERT books to crack the NEET? - Quora",
    "tags": [
        "National Council of Educational Research and Training (NCERT)",
        "National Eligibility cum Entrance Test (NEET)",
        "Exam and Test Preparation",
        "Books"
    ],
    "response": [
        {
            "author_info": {
                "name": "Ramesh Singh",
                "href": "/profile/Ramesh-Singh-2110"
            },
            "answer_text": "It is advisable that you read the NCERT thoroughly and complete all the in-text questions and exercises given in a particular chapter. Once you are done doing that, pick up a proper book for NEEt, for example, the previous year's questions, and start solving and practicing questions from there. Note that you need to finish the first thing i.e finishing NCERT before proceeding to other books. After you have finished solving the previous year questions, do sit for time bound full-length mock tests and analyze your score. This is the basic mantra every NEET aspirant should follow to get a good rank. Also, along with the NCERT, the NCERT Exemplar should be done as questions from that book come too in the exams. in case you have a problem finding the Exemplar book in stores, or you have a shortage of time/money, you can always head over to the MyPustak website, explore and order the books as they are giving it for FREE OF COST. The book will be delivered to your home and you have to just pay the minimum delivery charges and that’s it! Books have been donated by several IIT-JEE and NEET aspirants who have cracked the exams and you might find something useful in those books. So that was my answer on whether NCERT is enough to crack NEET and I hope it helps you! ",
            "date": "Answered September 22, 2020",
            "views": "111",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Shrishti Jain",
                "href": "/profile/Shrishti-Jain-97"
            },
            "answer_text": "No, the NCERT is not sufficient to crack the NEET. The National Eligibility Cum Entrance Test (NEET).formerly the All India pre-medical test is an entrance exam in India for students who wish to study undergraduate medical courses (MBBS) in government or private medical colleges in India. NEET has a vast syllabus among itself. So only NCERT preparation is not sufficient. But the other books of NEET apart from NCERT may cost expensive. So for getting these books at FREE OF COST. There is an online platform named as MyPustak running all over the India and committed to providing free books to the needy readers. To acquire book for NEET please go through MyPustak website once.  ",
            "date": "Answered September 21, 2020",
            "views": "210",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Divya Jain",
                    "user_href": "/profile/Divya-Jain-1631"
                },
                {
                    "user_id": "Raj Patel",
                    "user_href": "/profile/Raj-Patel-359"
                },
                {
                    "user_id": "Pooja Jain",
                    "user_href": "/profile/Pooja-Jain-2269"
                },
                {
                    "user_id": "Deeksha Deshna Jain",
                    "user_href": "/profile/Deeksha-Deshna-Jain"
                }
            ]
        }
    ]
}