{
    "title": "Is it true that authors no longer receive royalties for books sold? - Quora",
    "tags": [
        "Royalties",
        "Book Writing",
        "Publishing",
        "Writers and Authors",
        "Sales",
        "Literature"
    ],
    "response": [
        {
            "author_info": {
                "name": "Wayne Allen Sallee",
                "href": "/profile/Wayne-Allen-Sallee"
            },
            "answer_text": "I write short fiction and I still get royalty checks for stories I sold in 1994. If a book continually stays in print, the royalties will start getting smaller. But some anthologies don’t sell that well. I’m in 170 anthologies and I’ve stopped receiving any money from about 150 off them. I’m sure you can find copies of VAMPIRE DETECTIVES or CRAFTY CAT CRIMES on Amazon for a penny. I have several collections out and I am paid in advance for those. But until that money is made up by sales, I won’t see royalties. That might take two months, it might take two years, depending on the timing of the book and if people have extra money to spend. I received a check recently for $10.03 for a story that was in an anthology in the 00s. The editor sent me a note, telling me it was for the last three years, as a business can’t send a check out unless it is over ten dollars. I called him on the phone, because he seemed so apologetic in the letter, and we had a good laugh. I kidded that if I had written a longer story, I might have gotten a check for $15.00. Writing can have its fun moments. ",
            "date": "Answered October 2, 2019",
            "views": "226",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Susan Bertolino",
                    "user_href": "/profile/Susan-Bertolino"
                },
                {
                    "user_id": "Kara Krelove",
                    "user_href": "/profile/Kara-Krelove"
                }
            ]
        },
        {
            "author_info": {
                "name": "Timothy Ellis",
                "href": "/profile/Timothy-Ellis-4"
            },
            "answer_text": "No. What you might be seeing is Trad published books which fail to earn out their advance. Trad publishers give an author an advance on each book, which is an expectation of how well it will sell. The advance is contracted, specifying how many books need to sell, before the author receives further royalty payments. Most books fail to sell out the advance, so the author does not receive any royalties. Books which sell well, will eventually start paying royalties. Best sellers will start paying royalties fairly quickly, depending on the size of the advance. The bigger the advance, the longer it takes to sell out. All Indie authors get paid royalties. Monthly. There are more Indie authors than trad authors these days. There are Indie authors making 7 figures a year from royalties. ",
            "date": "Answered September 26, 2019",
            "views": "125",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Richard Haslam",
                    "user_href": "/profile/Richard-Haslam-1"
                },
                {
                    "user_id": "Eileen M. Gormley",
                    "user_href": "/profile/Eileen-M-Gormley"
                }
            ]
        }
    ]
}