{
    "title": "Is it good to follow different author's medical books for the same subject? - Quora",
    "tags": [
        "Writers and Authors",
        "Book Recommendations",
        "Books"
    ],
    "response": [
        {
            "author_info": {
                "name": "Dhaval Shah",
                "href": "/profile/Dhaval-Shah-340"
            },
            "answer_text": "I saw many of the students follow different authors books for same subjects. One of them is me also.. I am very used to read different authors books for same subject. But this is only upto for 1st and mostly 2nd year mbbs students. Because for 3rd and final year students… One and only standard book list is available and all are reading the same so… ( also not more time ) For 1st year, this problem I faced it in physiology subject. Because physiology is give in haphazard manner. Like neurophysiology is given best in AK Jain. Blood Physiology is better in Guyton and Sembulingum like that…. So only for physiology you have to use other author book. Also some are using reference books…like CRISP physiology… Review of anatomy like that.. it is very useful to edge your preparation… I appreciate to read this review books…. For 2nd year… I would like to use mainly Review book and for pathology only you have to use Robnins. And for pharmacology use KDTripathi for classification of drugs and GARG sir review book. That is enough. And for forensic medicine… some of sir like…. “ Tell me the defination of Medical Jurisprudence according to Reddy” so you have to read Reddy along with any review book. That will help more… So it depends either you want to read or not. But reading review books is different thing than reading big one books. So Better to read review books and always prefer to make own notes that will helpful more… ( One of my topper friend who got AIR 3000 on this year ) So I follow him and try to make and stick as much as possible. Hope you will get your answer. Thanks 😊 ",
            "date": "Answered May 5, 2020",
            "views": "83",
            "upvotes": "0"
        }
    ]
}