{
    "title": "Is it boring to read a novel which moves around in just a single day? How can I make things more interesting? - Quora",
    "tags": [
        "Boredom",
        "Novels",
        "Literature",
        "Reading"
    ],
    "response": [
        {
            "author_info": {
                "name": "Bhanu",
                "href": "/profile/Bhanu-84"
            },
            "answer_text": "Circadian novels are those that are set in 24 hours. I think some of the most interesting books are set in a day. The details to make the books interesting could be done with flashbacks, musings of the protagonist or with a multiple POV or some fantasy idea like time travel! I can cite a few books that happen in just a day. The 71/2 deaths of Evelyn Hardcastle is one such book. The way the author has worked out to include all that in a day is very interesting. This books tells that flashbacks are not the only way to add details for a single day set up and its worth reading for inspiration.13 Reasons Why is another YA book that is actually set in a day. The author instead of just flashbacks has used a tape to add details to the story.Of all mystery writers, Agatha Christie is known for her intelligence for weaving crime thrillers. Her Death In the Air, a Hercule Poirot mystery takes place in a single flight! A flight from Paris to London which is about 2 hours. The details here are the observational thoughts the detective has about the passengers on the plane.Airport by Arthur Hailey is another book that is set over a few hours in a stormy Chicago airport. It has all the drama from affairs, airport politics to hi-jacking that add so much interest.If you look to write romance, A Statistical Probability of Love at First Sight is another book that happens in a single day. It is about how two people fall in love in a flight while both travelling to attend a wedding. It has both the protagonist musing about the parents’ broken relationship, budding romance and how they deal with it.Forgive me, Leonard Peacock - is on the Leonard Peacock’s birthday where he sets to kill his best friend and kill himself. This book takes you through a roller-coaster of emotions. This books is funny and depressing at the same time. The writer has added details as conversations by the protagonist with four of his favorite people in this world.Twelve Angry Men - set in a Jury verdict for a teen murderer is interesting to boot. It revolves around how the judicial system works, how the jurors are humans who sometimes let their personal prejudices/bias in the verdict. This was adapted as a movie that is still a must watch.The above list is only the books I have personally read and recommend. I hope these will give you some inspirational ideas for your single day novel. ",
            "date": "Answered July 24, 2020",
            "views": "14",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Adhikari Krishna",
                "href": "/profile/Adhikari-Krishna"
            },
            "answer_text": "Ofcourse not, you can write an interesting novel that takes place in a single day. A lot of wierd things can happen in a single day. I guess, flashbacks are out of option here. Maybe a timetravel scenario type of thing. Maybe something like ground hog day. If your novel isn't about sci-fi, there comes a problematic thing. Maybe you can write something divided on hourly base, you see that makes 24 good chapters. The thing is you can write multiple perspectives of a single day too. This doesn't step out of line with your idea. The good thing is you can write a good thriller, horror or a sci-fi with this restriction of 24 hours. Attaining something in short time, stakes are actually high considering the timeframe. Whatever you do, it shouldn't be boring to the reader. I hope my answer is of use to you. Basically, I'd play around with ideas like running awau from home kind of thing, something similar to Baby's days out. There's scope for lots of drama. Even Baahubali, both parts mixed, if you remove flashbacks, happens only in a single day, if you consider from the moment he tries to abduct Anushka. Even one of my favourites, Arundhati, a horror movie, remove the flashback episodes, still happens in a day or two. See, you can play with that idea in any way possible, creativity has limitless potential. It's up to you to make it an interesting read. ",
            "date": "Answered July 23, 2020",
            "views": "39",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Harish Adi",
                    "user_href": "/profile/Harish-Adi-2"
                }
            ]
        }
    ]
}