{
    "title": "Is it legal to read books online if it's free? - Quora",
    "tags": [
        "Online Reading",
        "Online",
        "E-learning",
        "Free Products",
        "Reading",
        "Book Recommendations",
        "Legal Issues and Law in Everyday Life",
        "Law"
    ],
    "response": [
        {
            "author_info": {
                "name": "Paul Trejo",
                "href": "/profile/Paul-Trejo-1"
            },
            "answer_text": "One of the great benefits of the Internet, is that it makes reading material far more accessible than in the past. One way is to make entire books available online — that is, not in paper form, but in electronic form. The paper form requires a publisher to outlay money to print the book, to bind it and ship it to the wholesaler and the retailer. So, the publisher’s money must be regained, along with a small percentage for the author. However — when it comes to books published online — there is no outlay of money for printing, for binding, for shipping, for wholesaler or retailer costs. Some authors hope to support themselves with online (e.g. Kindle) book sales, so they will publish a PART of their book online, in order to entice readers to purchase the entire book (in Kindle format). Other authors don’t care about money — they only want the public to read their work, so they may publish their ENTIRE work on the Internet for FREE. US Copyright law protects all books published after 1922. Anything published before 1922 is legally in the public domain. So, a scholar can legally publish the works of his 19th century mentor without Copyright crime. So, today we find that many scholars have published 19th century translations of Plato, Aristotle, Augustine, Aquinas, Hobbes, Descartes, Spinoza, Locke, Leibniz, Hume, Voltaire, Kant and Hegel — and all are legal. One can find translations of the Bible, the Bhagavad Gita, the Diamond Sutra and the Qur’an — all for free, and all legal. Again — some publishers publish works online for free in order to entice the public to buy other books by the same author. The Internet is a great marketing tool for them. There are thousands of books available online for free today — and I estimate that 99.999% of them are legal. One can read online a high confidence that one isn’t violating Copyright laws. ",
            "date": "Updated May 30, 2020",
            "views": "22",
            "upvotes": " View 3 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Tabeer Adv",
                    "user_href": "/profile/Tabeer-Adv"
                },
                {
                    "user_id": "Pavel Morava",
                    "user_href": "/profile/Pavel-Morava"
                },
                {
                    "user_id": "Georgene Wickstrand",
                    "user_href": "/profile/Georgene-Wickstrand-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Mark Grinstein-Camacho",
                "href": "/profile/Mark-Grinstein-Camacho"
            },
            "answer_text": "There are a lot of ways you can read books online legally for free. Here are a few: Project Gutenberg: Project Gutenberg Thousands of books whose copyright has expired. I’ve read Alice in Wonderland half a dozen times from this site.Free Kindle books: Amazon.com: free kindle books Besides the books whose copyright has expired (and Amazon has amazing selection of those), there are thousands of other books which are free on Amazon if you either have a Kindle or a Kindle app. Most of them are pulpy romance novels, but if that’s your thing, have at it.Libraries. Many libraries do have a program by which anyone who has a library card with them can borrow e-books and read them online for free. Consult whichever libraries you have a card with.Author websites. Plenty of authors leave lots of their work on their personal websites for you to read for free, and sometimes it stays up even after it has been professionally published.Basically, if the copyright has expired, or if the author wants to give it away, or if there is some other way you can borrow it, there is likely a way you can read it online for free. ",
            "date": "Answered April 6, 2020",
            "views": "656",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Bonnie Mccoy",
                    "user_href": "/profile/Bonnie-Mccoy-17"
                }
            ]
        }
    ]
}