{
    "title": "Is it illegal to remove DRM from audiobooks purchased from Audible? - Quora",
    "tags": [
        "Digital Rights Management",
        "Fair Use",
        "Audible",
        "Audiobooks"
    ],
    "response": [
        {
            "author_info": {
                "name": "Todd Gardiner",
                "href": "/profile/Todd-Gardiner"
            },
            "answer_text": "In the United States, it is illegal to remove DRM. From anything. This is a felony if done for commercial use. But there is also contract law in the way. The licensing terms that allow you to view the media are a contract you agreed to, and they also don't allow the removal of DRM. Since your \"purchase\" was only a paid license for the right to access the media in their defined terms, you did not buy the actual media. There are no rights for personal use due to the legal structure under which this transfer was made. Think of this like leasing a car. You have possession of the car, but there are a lot of limits on what you can do with that car. You can't strip it down for parts, for instance. You don't \"own\" the car, you only purchase a right to use it. ",
            "date": "Updated December 11, 2012",
            "views": "46",
            "upvotes": " View 6 Upvoters",
            "upvoters": [
                {
                    "user_id": "Miguel Monteiro",
                    "user_href": "/profile/Miguel-Monteiro-12"
                },
                {
                    "user_id": "Steve Allen",
                    "user_href": "/profile/Steve-Allen-13"
                },
                {
                    "user_id": "Dinos Korominas",
                    "user_href": "/profile/Dinos-Korominas"
                },
                {
                    "user_id": "Bill Vander Lugt",
                    "user_href": "/profile/Bill-Vander-Lugt-1"
                },
                {
                    "user_id": "Leanne Chen",
                    "user_href": "/profile/Leanne-Chen-3"
                },
                {
                    "user_id": "Cliff Gilley",
                    "user_href": "/profile/Cliff-Gilley"
                }
            ]
        },
        {
            "author_info": {
                "name": "Matt Clark",
                "href": "/profile/Matt-Clark-119"
            },
            "answer_text": "For personal usage only. The company’s purpose to add DRM to the Audible audbooks is to prevent illegal access to the items. We can’t tell it is good or bad, it is controversial among years. If you only need to use it for personal purpose, you can try the audible audiobook converter (check the recommended audibe audiobook converter through the DRM remover tools) to bypass the DRM and enjoy the audiobooks via your own poratble devices.  ",
            "date": "Answered August 23, 2017",
            "views": "933",
            "upvotes": "0"
        }
    ]
}