{
    "title": "Is it possible to have an IQ of 131 but need to read something more than one time to clearly understand it and process well? I heard that people with high IQ learn everything immediately after reading it only once. Is this always true? - Quora",
    "tags": [
        "High Level IQ",
        "IQ Testing",
        "Understanding and Comprehension",
        "Intelligence Quotient",
        "Smart People",
        "Intelligence",
        "Learning",
        "Reading"
    ],
    "response": [
        {
            "author_info": {
                "name": "Ciprian Elliu Ivanof",
                "href": "/profile/Ciprian-Elliu-Ivanof"
            },
            "answer_text": "Different texts have different issues. Some texts are very straightforward and don’t require much thought to understand the direct meanings or the implications. Consider a few examples. A very clear text is the account of SGT Basilone On the night of October 24, 1942, in the jungles of Guadalcanal, one of the hundreds of islands that comprise the Solomons, then-Sgt. Basilone was commanding two heavy .30-caliber machine gun sections from First Battalion, Seventh Marines, that were tasked with holding a narrow pass at the Tenaru River. As the small crews of Marines dug in for the night, a Japanese regiment numbering 3,000 men attacked the line, hammering the Marines with grenades and mortar fire. Wave after wave were kept at bay by the small teams of Marines, until one of the gun crews was disabled by enemy fire. With total disregard for his own life, Basilone carried about 90 pounds of weaponry and ammunition to the silenced gun pit, running a distance of 200 yards through enemy fire and encountering Japanese soldiers along the route, who he killed with his Colt .45 pistol. That is clear enough that even people unfamiliar with basic military concepts can understand what was going on with only one reading. Other texts are difficult to understand because of grammar or the unfamiliarity with the words or subject matter. Consider this part of the syllabus from Yamaha Motor Corp., U.S. A. v. Calhoun, 516 U.S. 199 (1996): (a) In The Harrisburg, 119 U. S. 199, this Court ruled that the general maritime law (a species of judge-made federal common law) did not afford a cause of action for wrongful death. Federal admiralty courts, prior to Moragne, tempered the harshness of The Harrisburg's rule by allowing recovery under state wrongful-death and survival statutes in maritime accident cases. See, e. g., Western Fuel Co. v. Garcia, 257 U. S. 233. Such state laws proved an adequate supplement to federal maritime law, until a series of this Court's decisions transformed the maritime doctrine of unseaworthiness into a rule making shipowners strictly liable to seamen injured by the owners' failure to supply safe ships. See, e. g., Mahnich v. Southern S. S. Co., 321 U. S. 96. By the time Moragne was decided, claims premised on unseaworthiness had become \"the principal vehicle for recovery\" by seamen and other maritime workers injured or killed in the course of their employment. 398 U. S., at 399. The disparity between the unseaworthiness doctrine's strict liability standard and negligence-based state wrongful-death statutes prompted the Moragne Court, id., at 409, to overrule The Harrisburg and hold that an action \"lie[s] under general maritime law for death caused by violation of maritime duties.\" pp.206-209. I have read it and still struggle to parse the meaning of the paragraph even after law school. Others have understandable text but whose implications and possible causes are so many that it provokes constant re-examination. Consider this article on the neurology of altruism. Many other studies have since expanded on those early results. If the rTPJ is bigger, people are more likely to behave altruistically. If the neurons within it are better-connected (and well-linked to other parts of the brain), people show less bias towards their own in-groups. If the area is stimulated by electric currents, people become better at taking someone else’s perspective. And if the region is disrupted, it changes our ability to reason about morality. Consider a woman who poisons her friend’s coffee—if she does so deliberately, we’d judge her more harshly than if she acted accidentally. Intent matters, and we need the rTPJ to judge intent. When Liane Young, one of Saxe’s former students, disrupted the rTPJ using magnetic fields, she found that people were more lenient towards the deliberate poisoner, as long as her friend survived. With their ability to gauge intent disrupted, they started looking to outcomes instead. Not everything fits with the idea of the rTPJ as a nexus for theory of mind. For example, many studies suggest that it affects our ability to shift our attention from one part of space to another, like a technician moving a spotlight around. “Even in my own small lab, people disagree about the function of the rTPJ,” says Young, now a professor at Boston College. Sometimes, to really understand the implications of a text, you have to think about it a while and go over the wording again while constantly asking “why”. The number of reads really depends on what you already know, what the text is written like, and what you are trying to discover from the text. There is no simple rule for that. ",
            "date": "Answered October 6, 2020",
            "views": "190",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Phillip Erwin",
                    "user_href": "/profile/Phillip-Erwin-2"
                },
                {
                    "user_id": "Peter Flom",
                    "user_href": "/profile/Peter-Flom"
                }
            ]
        },
        {
            "author_info": {
                "name": "Sean Rost",
                "href": "/profile/Sean-Rost-1"
            },
            "answer_text": "I would think that rereading something in the way you’re suggesting is actually something intelligent people would do more often. A lot of people read things and just assume they make sense. Sometimes what they’re reading does make sense, and sometimes it doesn’t. Additionally, it is pretty easy to misread some sentence here or there that can create a glaring misunderstanding of the material. Intelligent people often like to have a strong foundation that can be built upon later, and misunderstanding source material erodes that foundation. The foundation is important because it takes far less time to reread a sentence here and there than it does to entirely redefine one’s conclusions based on faulty premises. Nobody learns everything immediately when reading. Intelligent people may begin processing what they’re reading in parallel to reading it, which would speed up the “learning” portion of the activity, but necessitate rereading when the parallel process takes over some threshold of attention. This is actually a good thing, because it means the material is being processed, not just seen. But it may appear to some that the intelligent person is reading slower than others. It’s not so much that they’re reading slower, it’s just that they’re doing multiple things at the same time. Most source material texts contain parades of facts one after another. Processing those as they occur likely leads to much better retention and understanding of the information than reading through it all and processing the facts afterward. Unless it is taking an extremely long time to read something, being a little slower is fine. What’s important is the retention and processing of the information—not the speed at which a person can skim through a text. … If someone ever told me that they had read a philosophy book in a couple of hours, I wouldn’t assume that they were a genius. I’d assume that they have no idea what they read. ",
            "date": "Answered October 6, 2020",
            "views": "478",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Timotej Mikuljan",
                    "user_href": "/profile/Timotej-Mikuljan"
                },
                {
                    "user_id": "Ciprian Elliu Ivanof",
                    "user_href": "/profile/Ciprian-Elliu-Ivanof"
                },
                {
                    "user_id": "Martin Zhang",
                    "user_href": "/profile/Martin-Zhang-57"
                },
                {
                    "user_id": "Veeti Mäkinen",
                    "user_href": "/profile/Veeti-Mäkinen"
                }
            ]
        }
    ]
}