{
    "title": "Is it rude to go into a bookstore, stay inside for hours and read books for free, and leave without buying any? - Quora",
    "tags": [
        "Book Stores",
        "Free Products",
        "Manners and Etiquette",
        "Reading",
        "Book Recommendations",
        "Books"
    ],
    "response": [
        {
            "author_info": {
                "name": "Debra Harrison",
                "href": "/profile/Debra-Harrison-49"
            },
            "answer_text": "I wouldn’t call it rude. Folks have been doing this exact thing for as long as there have been bookstores. Some folks just cannot make up their mind to buy a book without reading pages from the book. I never find this a good way to select books and prefer to make my purchase decisions based on reviews from online readers or from friends who have read the book. A good review or recommendation from one of my friends, whose opinion I value as they are very smart folks, means the most to me in my decision to buy a book. I keep a notepad handy when visiting with my friends or when speaking with them on the phone to make sure I can pick up a highly recommended book. My memory is impaired due to my most recent treatment for cancer with chemotherapy and if I don’t write it down, I may not remember to pick it up to read. For folks who feel they must read pages of the book before buying, I would caution them to read very carefully so the books do not appear to have been read. Pages should be turned carefully and the spine of the book must not be broken open. They must never lick their fingers to turn the pages of books they do not buy in a bookstore. Finger licking is a barbaric way to handle books in my opinion. If they are unable to accomplish these simple rules for reading, they should find a different way to assess books for purchase. Many of my book purchases happen on Amazon where I am able to read a synopsis and reviews from readers of the book. I also use Goodreads to read reviews and participate in discussions on books, authors, genre, and upcoming book releases. ",
            "date": "Answered August 25, 2020",
            "views": "45",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Pamela B. Zohar",
                "href": "/profile/Pamela-B-Zohar"
            },
            "answer_text": "That - actually is illegal under Jewish law. One is forbidden to raise the hopes of a merchant by pretending interest in the merchant’s goods with no intention of buying. It is a form of deliberate deception - a kind of ‘con’. So yes, that IS rude. It is not rude if you intend to buy and are browsing with intent to purchase by trying out parts of a book. But it is certainly rude to go into a place of business and use the goods which are there on sale, as your personal possessions (by reading without buying). ",
            "date": "Answered August 19, 2020",
            "views": "316",
            "upvotes": " View 7 Upvoters",
            "upvoters": [
                {
                    "user_id": "Shannon Compton",
                    "user_href": "/profile/Shannon-Compton-14"
                },
                {
                    "user_id": "Tracy Dennison",
                    "user_href": "/profile/Tracy-Dennison-4"
                },
                {
                    "user_id": "Jovan C. Rodriguez",
                    "user_href": "/profile/Jovan-C-Rodriguez"
                },
                {
                    "user_id": "Jerry Mendelsberg",
                    "user_href": "/profile/Jerry-Mendelsberg"
                },
                {
                    "user_id": "Veronika Vrabcová",
                    "user_href": "/profile/Veronika-Vrabcová"
                },
                {
                    "user_id": "Marty Bannister",
                    "user_href": "/profile/Marty-Bannister-1"
                },
                {
                    "user_id": "Inderjit Singh Uberoi",
                    "user_href": "/profile/Inderjit-Singh-Uberoi"
                }
            ]
        }
    ]
}