{
    "title": "Is it possible to read 300 pages in one day? - Quora",
    "tags": [
        "Reading"
    ],
    "response": [
        {
            "author_info": {
                "name": "Travis Casey",
                "href": "/profile/Travis-Casey-4"
            },
            "answer_text": "Certainly. When I was in high school and college, and had summers free, I sometimes read multiple books in one day. Looking online, an average paperback book has around 250 to 300 words per page. Taking the high end, that’s 90,000 words. If one spends ten hours reading, that’s a rate of only 150 words per minute. So… a story. My high school had a mandatory “reading improvement program” that some state senator had pushed for. In 10th grade, for one six-week period, each English class would go through it. They had machines you were supposed to use to measure and improve your reading speed. The machines were designed to use filmstrips, and to flash up a line of text at a time, at a settable rate. We were to read a story with it, then answer a set of questions about the story, and turn up the speed until we only got 50% of the questions right, and try to improve our speed from there. The highest speed setting was 500 words per minute. At that speed, I got 90 to 100% of the questions on each story right. Once, my family was about to go on vacation for a week. I had a book I was reading at the time, and I didn’t want to take it with me, since I knew I’d finish it the first day, and I’d rather have the packing space for a book I wasn’t already more than halfway through. Unfortunately, I didn’t realize that we were leaving the next day until around 9 PM… so I read the remainder of the book as fast as I could. After finishing, I got curious about how fast I was reading. Counting the words on a few sample pages, then using that to estimate, I got a bit over 2000 words per minute. I’m also old enough to remember 1200 and 2400 bps modems. With a 1200 bps modem, I could fairly easily keep up with the incoming text. 1200 bps / 8 bits per character x 60 seconds per minute / 6 characters per word gives about 1500 words per minute. Allow for the fact that the transmission probably doesn’t always reach ideal speed, and call it 1200 words per minute for a comfortable reading speed for me. 90,000 / 1200 = 75 minutes to read 300 pages. Of course, I’d have distractions at times, so call it 1.5 hours. One more anecdote. Once, when I was about to start a Dragonlance campaign, I decided to re-read the first Dragonlance trilogy the weekend before. I read all three books in one day. A quick search finds that that’s a total of around 429,000 words in one day. At 1200 wpm, that’s about six hours, which matches my memory. It took most of the day, but not all day. ",
            "date": "Answered July 25, 2020",
            "views": "202",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Usama Choudhry",
                    "user_href": "/profile/Usama-Choudhry-2"
                }
            ]
        },
        {
            "author_info": {
                "name": "Danilo Renzi",
                "href": "/profile/Danilo-Renzi"
            },
            "answer_text": "Is it possible to read 300 pages in one day? This depends on what you read and why. If you are reading for your pleasure, interest, culture or any other personal interest, then you might be interested to read from page 1 to the last page, including introductions, prefaces and forewords. If you don’t do this, you are reading for nothing, you are losing the very purpose of your reading. In this case, you obviously cannot read 300 pages in one day, unless you are an incredible speed reader, like Raymond in Rain Man movie. If you don’t have an extraordinary speed, you could still read the entire book, but it's going to be very wearing, very tiring and in the end you're not going to enjoy the reading, you will not assimilate the whole information. So, if you are reading for pleasure, the answer, at least in general, is: no, you can't read that fast if you don't want to ruin the enjoyment of your reading. Different is when you are reading for work. In this case, you don’t have to read from the first to the last word. You just browse until you find something that is interesting you, something that you need or something that you find useful for the purpose of your reading. In this case, yes, you can read the whole thing in one day. But you will slow down and fast up in function to the information you are looking for. If you are a technical reader, a programmer, a technician, an engineer and so on, you know what I'm talking about. ",
            "date": "Answered July 26, 2020",
            "views": "114",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Dennis Gin",
                    "user_href": "/profile/Dennis-Gin"
                }
            ]
        }
    ]
}