{
    "title": "Is it weird I believe in God but don't read the Bible? - Quora",
    "tags": [
        "God and the Christian Bible",
        "The Bible",
        "Belief and Beliefs",
        "God",
        "Christianity"
    ],
    "response": [
        {
            "author_info": {
                "name": "Brian S. Holmes",
                "href": "/profile/Brian-S-Holmes"
            },
            "answer_text": "No, it is not weird, it is common. However, that doesn’t make it good. A person can believe in God without knowing anything about God. A person is not saved because they believe in God, but because they trust in the true God. You can’t just believe in a god of your own imagination. If the god you believe in (and know and obey) isn’t the God of the Bible then you will still die in your sins. The Bible is how we know who God is and what He cares about and know how we can inherit eternal life. A person can believe in God, and even in good and evil, without knowing how to tell what is truly good and what is truly evil. What is of God in the world and what is not of God. There are many false gods and false beliefs and deceptive spirits and cultural sin and all they things are causing theft, death, and destruction. The Bible is how we know how to determine what is good and what is evil, and what can be trusted and what cannot be trusted. A person can believe in God without having a saving relationship with God through Jesus Christ. Without any kind of real relationship that has a genuine spiritual connection with God through His Holy Spirit you’re still unsaved. The Bible is how we know the proper methods to connect to God that won’t expose us to spiritual evils. It is also how we know how to become born again by the Spirit of God. My recommendation is to read your Bible! It is the Word of God. I would do it now as if your life depends on it—because it does! ",
            "date": "Answered January 19, 2018",
            "views": "247",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Shiva Kumar",
                    "user_href": "/profile/Shiva-Kumar-1671"
                },
                {
                    "user_id": "Jerry Sorrell",
                    "user_href": "/profile/Jerry-Sorrell"
                },
                {
                    "user_id": "Betty Rozier",
                    "user_href": "/profile/Betty-Rozier"
                }
            ]
        },
        {
            "author_info": {
                "name": "Wyatt John",
                "href": "/profile/Wyatt-John"
            },
            "answer_text": "I would say unfortunately I think it is fairly common for people to believe in God and not read the Bible. I say unfortunately because you can cultivate a much deeper relationship with God by reading and knowing the scriptures. Actually, you can’t really know God until you read the Bible. There is a lot of misinformation about God, who he is and what he does, primarily because people do not read the Bible as they used to. Sometimes, all that people know about God comes from the culture around you, which is how it was for me. Culture or the world around you is usually the last place you want to get your information about God. You can believe without reading the Bible, but if you want a relationship with God, and if you want to know God, reading is a must. ",
            "date": "Answered January 19, 2018",
            "views": "51",
            "upvotes": "0"
        }
    ]
}