{
    "title": "Is investing in stocks alone enough to get rich and make millions, even if you only have a few thousand to start with? - Quora",
    "tags": [
        "Wealth",
        "Investment Advice",
        "Stocks (finance)",
        "Stock Markets",
        "Wanting and Making Money",
        "Investing"
    ],
    "response": [
        {
            "author_info": {
                "name": "Luc De Nolf",
                "href": "/profile/Luc-De-Nolf"
            },
            "answer_text": "————— Read the books “Fail-Safe Investing, lifelong Financial Safety in 30 Minutes” by Harry Browne and \"The Permanent Portfolio” Harry Browne's Long-Term Investment Strategy\". Basic principle is 25% of your savings goes to stock 25% of your savings goes to Commodity (precious metals) 25% of your savings goes to bonds 25% of your savings goes to cash Every year you have to rebalance, so that your principle stays at 25% each. Let us say that your stock-portfolio is only 20% of your portfolio and cash is 30% you take cash and buy stocks, so you have again 25% - 25% For stocks I use always the same system: The rest of the answer I have written for other topics and is “copy-paste”. So you have to “translate” it to your question. The most important lesson you will have to learn is that time will be your only friend in the stock market. Do not turn your back to your only friend by getting impatient. Stay away from pennystocks or, if you buy a pennystock, act as if you buy a lot from the lottery. Your money is lost in 99.9% of the cases. You will have to learn many lessons and that could hurt you a lot. Over the years I have developed a technique of investing that makes that pain small enough to stay in the stock market for the rest of your live. I will tell you that technique. For everything that can lose all its value, I invest no more than $500. I bought recently a stock for $150 including all costs. When the price go down, I will never sell. I do not take losses, until that stock goes to zero. If the price goes up, 10% or 15%, I will sell 90% of my stocks and keep 10% of the stocks as free stocks. Example : I bought 450 Lightwave Logic for €473 (I live in Belgium and I give you examples of what I actual did, so the price is in euro) after transaction costs. I did that in October 2012. I did not receive dividend. Until 2017 the price stayed under my buying price. In May 2017 I sold 340 stocks and received €435 on my bank account. So I have 115 stocks left for €38 or close to zero. For precious methals I have two methods. First of all I buy the stock CEF. That is the only stock I know that represent PHYSICAL gold and silver Secondly: Another advice I always give is to buy each month 1 ounce of PHYSICAL silver and keep it until the day you retire. In the long run you will have profits. You will not easily sell the silver for other purposes (very important), so you will have your own retirement capital, even if it is a relatively small sum of money. If you are 20 years of age, you have lived for 240 month and you should have 240 ounces of physical silver. One ounce of silver cost now more or less $20, so you should not feel the buy in your budget, even if you have to buy two ounces for the next 240 month, because you start to late with that idea. Make it for my part 10 ounces of silver per month you have lived or 1 or more ounce gold. I give you the principle technique I use myself. For bonds I would prefer funding circles or an other crowd LENDING firm. I invest every month €100 in one loan of the category A and B. I never go for category C and higher because they are too risky. You should make it a priority not to lose money on those loans, so you should choose for the safe category as well. Go for many loans, so your risk will be less. ——————————————— About the price of silver I can say, that I made a study that anybody can make for oneself and I can asure you that in the long run the changes on profit are bigger than the changes on loss. I pretend to buy every year 12 onces of silver at the end of the year (to make it more visual understandable). I pretend to start in 1979, because silver hit a price of $50 to drop with 90% a few years later and to never hit the price of $50 again for the next 30 years or so. Will there be profit, yes or no? From 1979 until 1999 I use USD ($). Later on I use EUR (€) Up to you to use your currency or to pretend that €1 equals $1. This will not infuence the overall result of the study.   Even in this exceptionally bad situation one hits finally profits. One should not be too worried about the value of ones silver investment in the long run if one buy every month 1 or more ounce(s) of silver. ————————————- This is an investment idea. It came up very recently. In Europe governments are convinced everything has to go electric in the future. No more gas to burn, no more cars on gasoline and so long. That means a lot of copper for electricity wire. However, the worldwide production capacity is way to low and it takes years to increase that capacity to fulfill future demands of copper. That means that the price of copper should soar. However, nobody can predict the future, so nobody can say for sure that the prediction is right and that the price of copper will rise huge. If you have hands on your body and a place to store copper, keep your eyes open for every opportunity to collect for free and in an honest way copper. Store it and wait. I have collected just half an hour before writing some old copper wire in an honest way. If you do not pay for it, and you can store without costs, you can not make loses on your investment. You can make some profit or huge profit. I do not give financial advice. You have to act on your own responsibility. ",
            "date": "Answered December 28, 2019",
            "views": "11",
            "upvotes": " View Sharers ",
            "upvoters": [
                {
                    "user_id": "Pedro Reyes",
                    "user_href": "/profile/Pedro-Reyes-104"
                },
                {
                    "user_id": "Ahmad Syazani",
                    "user_href": "/profile/Ahmad-Syazani-2"
                },
                {
                    "user_id": "Omar Francisco",
                    "user_href": "/profile/Omar-Francisco-2"
                },
                {
                    "user_id": "Jim Caron",
                    "user_href": "/profile/Jim-Caron-4"
                },
                {
                    "user_id": "Sumanth Ksn",
                    "user_href": "/profile/Sumanth-Ksn"
                }
            ]
        },
        {
            "author_info": {
                "name": "Brett Marks",
                "href": "/profile/Brett-Marks-9"
            },
            "answer_text": "Yes. It is not how much you start with, but rather, how much you are willing to invest on a regular monthly basis for years. Let’s say your start is only $5,000. You put it in a Roth IRA. Then you contribute $500 per month to a Roth IRA starting in the next year. You also contribute 6% of your salary in an employer 401k and earn a full match. Assume you make $60,000 per year. Those contributions will be $3,600 each from you and your employer, for a total of $600 per month. Assume further that your only investments are growth stock mutual funds and common stock. Assume you earn on average 9% per year. How much will you have amassed: 10 years - $226,700 20 years - $770,000 30 years - $2.1 million 40 years - $5.368 million Time and steady contribution are much more important than the starting amount. Double your starting amount to $10,000, and the 40 year total rises to $5.55 million. The BIG money is made by executing a long term contribution plan. ",
            "date": "Updated January 8, 2020",
            "views": "910",
            "upvotes": " View 5 Upvoters "
        }
    ]
}