{
    "title": "Is it bad luck to have your bed facing the window? - Quora",
    "tags": [
        "Feng Shui",
        "Bad Luck",
        "Superstitions"
    ],
    "response": [
        {
            "author_info": {
                "name": "Kartar Diamond",
                "href": "/profile/Kartar-Diamond"
            },
            "answer_text": "You asked if it is bad luck to have your bed facing a window. This question is the opposite of what most people ask, which is whether or not one can sleep with their head against a window, or near a window. When it comes to bed position in Feng Shui theory, we are almost always referencing a position with the person laying down and the top of the head pointing to a certain direction. The bed itself has a sitting and facing side and then when you ask about a bed facing a window, I wonder if you are referring to a person sitting up in bed, enjoying a view out a window across from the bed. In general, we don’t prefer a windowless bedroom. If that is the case, it should have a big sunny skylight. We don’t like to see someone sleep with their head close to a window, as it can be drafty and drain your energy. A window across from a bed may be perfectly fine. We can get into the particulars of how big the room is and how big the window is in relation to it. If the foot (end) of a bed is at least a few feet away from a window, that is fine and no need to worry about draining your energy through your feet. ",
            "date": "Answered November 1, 2019",
            "views": "543",
            "upvotes": " View 2 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Maria Kjelstad",
                    "user_href": "/profile/Maria-Kjelstad"
                },
                {
                    "user_id": "Yohana Kim",
                    "user_href": "/profile/Yohana-Kim-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Moni Castaneda",
                "href": "/profile/Moni-Castaneda"
            },
            "answer_text": "It’s not bad luck to have your bed facing a window. Whenever placing a bed in a room you need to seek the power position. This means that you have the headboard (yes, you need a headboard) against a solid wall and no part of the bed should be in the path of the door. You need to be able to see the door from the bed but not be in it’s path. Many people try to place their headboard pointing in a particular direction. This creates bizarre bedroom furniture arrangements that are negative and not very functional. Choose the position of the bed based on the power position, and not the compass directions. ",
            "date": "Answered July 15, 2020",
            "views": "214",
            "upvotes": " Answer requested by Yohana Kim"
        }
    ]
}