{
    "title": "Is it important to understand every single word written in a book to make reading worthwhile? I don't find myself to have a vocabulary good enough. What should I do? - Quora",
    "tags": [
        "Reading",
        "Book Recommendations"
    ],
    "response": [
        {
            "author_info": {
                "name": "Anders Højsted",
                "href": "/profile/Anders-Højsted"
            },
            "answer_text": "Depends.  If it is an academic text for studies, whip out a dictionary and start looking things up (make notes in the book). My experience with philosophy is that the devil often is in the detail of the phrasing, - so it's important to get everything. This is especially important in older books (50+ years); phrases and expressions change meaning over time, so it's important to be meticulous.  And you'll expand your vocabulary.  But if you are reading fiction for the pleasure of it, don't worry about it. It is for entertainment and pleasure, so enjoy it. Only exception should be if your missing understanding of an expression gets in the way of meaning - if it is necessary to understand a word to enjoy a book, you should probably look it up.  (Here is a good dictionary that I use a lot: Dictionary and Thesaurus - Merriam-Webster Online ) ",
            "date": "Answered August 3, 2013",
            "views": "625",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Karen Tiede",
                    "user_href": "/profile/Karen-Tiede"
                },
                {
                    "user_id": "Gursharan Sidhu",
                    "user_href": "/profile/Gursharan-Sidhu"
                }
            ]
        },
        {
            "author_info": {
                "name": "Olga Fyodorova",
                "href": "/profile/Olga-Fyodorova"
            },
            "answer_text": "I usually skip the words I don't understand if they don't prevent me from understanding the meaning of the whole sentence. From time to time, I look up words, and some words sink into my memory automatically after they appear many times in different contexts and guess their rough meaning. Looking up every single word may turn your reading into a hard work which you'll likely give up after a while. Use a dictionary when you don't understand the whole idea or just when you feel like looking up a word. ",
            "date": "Answered August 29, 2013",
            "views": "22",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Aishneet Juneja",
                    "user_href": "/profile/Aishneet-Juneja"
                },
                {
                    "user_id": "Karishma Venkiteswaran",
                    "user_href": "/profile/Karishma-Venkiteswaran"
                },
                {
                    "user_id": "Mukesh Garg",
                    "user_href": "/profile/Mukesh-Garg-13"
                }
            ]
        }
    ]
}