{
    "title": "Is it okay to read recommended books instead of NCERT books for UPSC preparation? - Quora",
    "tags": [
        "National Council of Educational Research and Training (NCERT)",
        "Indian Administrative Service Preparation",
        "Book Recommendations"
    ],
    "response": [
        {
            "author_info": {
                "name": "Akriti Mattu",
                "href": "/profile/Akriti-Mattu-2"
            },
            "answer_text": " UPSC Civil Services Exam (CSE) is conducted in three phases – Stage 1: Preliminary Examination (Objective)Stage 2: Main Examination (Subjective)Stage 3: Interview (Vocal) STAGE 1 : CSE PRELIMS SYLLABUS Preliminary exam , popularly known as prelims is the first stage of Civil Services examination. Getting acquainted with the detailed UPSC Syllabus for Civil Services Prelims is a must. General Studies Paper I Current Affairs: Events of national and international importanceHistory of India and Indian National MovementIndian and World Geography – Physical, Social, Economic geography of India and the World.Indian Polity and Governance – Constitution, Political System, Panchayati Raj, Public Policy, Rights Issues, etc.Economic and Social Development – Sustainable Development, Poverty, Inclusion, Demographics, Social Sector Initiatives, etc.General issues on Environmental Ecology, Bio-diversity and Climate Change (no subject specialization required)General ScienceGeneral Studies Paper II ComprehensionInterpersonal skills including communication skillsLogical reasoning and analytical abilityDecision making and problem solvingGeneral mental abilityBasic numeracy (numbers and their relations, orders of magnitude etc.) (Class X level), Data Interpretation (charts, graphs, tables, data sufficiency etc. – Class X level)Note: UPSC Civil Services General Studies Paper II is popularly known as Aptitude paper. However this is not an official term. UPSC Syllabus was modified for this paper starting 2014 onwards. Now there is no exclusive question on english comprehension. The comprehension passages that are put in the paper are in BOTH english and hindi. STAGE 2 : CSE MAINS SYLLABUS NOTE: I’m including the syllabus for General Studies and Essay paper only. Every optional has a different syllabus and Paper A & B are of qualifying nature. Paper I – Essay The essays must be written in the medium as specified in the admission certificate issued to the candidates. The name of the medium must be stated clearly on the cover of the answer- book in the space provided for the purpose. No credit will be given to the essay written in a medium other than that specified in the admission certificate. Any page or portion of the page left blank, must be struck off clearly. From 2014, there was a slight change in the UPSC Syllabus. Now, there are 8 topics in the IAS Mains Essay paper segregated in 2 sections. Write two essays choosing one from each of the sections A and B in about 1,000-2,000 words each. The word limit must be adhered to strictly. Each essay will be marked out of 125 Marks. Candidates will be expected to keep closely to the subject of the essay to arrange their ideas in orderly fashion, and to write concisely. Credit will be given for effective and exact expression. Keep in mind that the essay paper does not have a prescribed UPSC Syllabus as such. In fact no essay can ever have a syllabus. One needs to be aware about the things around to be able to write a good essay. According to the new UPSC exam pattern there are ‘Four General Studies Papers’ each of 250 Marks with a total of 1000 Marks. The mains syllabus of General Studies is of degree level. Paper II – General Studies I General Studies- I: Indian Heritage and Culture, History and Geography of the World and Society. (250 Marks) Indian culture will cover the salient aspects of Art Forms, Literature and Architecture from ancient to modern times.Modern Indian history from about the middle of the eighteenth century until the present- significant events, personalities, issuesThe Freedom Struggle – its various stages and important contributors /contributions from different parts of the country.Post-independence consolidation and reorganization within the country.History of the world will include vents from 18th century such as industrial revolution, world wars, redrawal of national boundaries, colonization, decolonization, political philosophies like communism, capitalism, socialism etc.- their forms and effect on the society.Salient features of Indian Society, Diversity of India.Role of women and women’s organization, population and associated issues, poverty and developmental issues, urbanization, their problems and their remedies.Effects of globalization on Indian societySocial empowerment, communalism, regionalism & secularism.Salient features of world’s physical geography.Distribution of key natural resources across the world (including South Asia and the Indian sub-continent); factors responsible for the location of primary, secondary, and tertiary sector industries in various parts of the world (including India)Important Geophysical phenomena such as earthquakes, Tsunami, Volcanic activity, cyclone etc., geographical features and their location- changes in critical geographical features (including water-bodies and ice-caps) and in flora and fauna and the effects of such changes.Paper III – General Studies II General Studies- II: Governance, Constitution, Polity, Social Justice and International relations. (250 Marks) Indian Constitution- historical underpinnings, evolution, features, amendments, significant provisions and basic structure.Functions and responsibilities of the Union and the States, issues and challenges pertaining to the federal structure, devolution of powers and finances up to local levels and challenges therein.Separation of powers between various organs dispute redressal mechanisms and institutions.Comparison of the Indian constitutional scheme with that of other countriesParliament and State Legislatures – structure, functioning, conduct of business, powers & privileges and issues arising out of these.Structure, organization and functioning of the Executive and the Judiciary Ministries and Departments of the Government; pressure groups and formal/informal associations and their role in the Polity.Salient features of the Representation of People’s Act.Appointment to various Constitutional posts, powers, functions and responsibilities of various Constitutional Bodies.Statutory, regulatory and various quasi-judicial bodiesGovernment policies and interventions for development in various sectors and issues arising out of their design and implementation.Development processes and the development industry- the role of NGOs, SHGs, various groups and associations, donors, charities, institutional and other stakeholdersWelfare schemes for vulnerable sections of the population by the Centre and States and the performance of these schemes; mechanisms, laws, institutions and Bodies constituted for the protection and betterment of these vulnerable sections.Issues relating to development and management of Social Sector/Services relating to Health, Education, Human Resources.Issues relating to poverty and hunger.Important aspects of governance, transparency and accountability, e-governance- applications, models, successes, limitations, and potential; citizens charters, transparency & accountability and institutional and other measures.Role of civil services in a democracy.India and its neighborhood- relations.Bilateral, regional and global groupings and agreements involving India and/or affecting India’s interestsEffect of policies and politics of developed and developing countries on India’s interests, Indian diaspora.Important International institutions, agencies and fora- their structure, mandate.Paper IV – General Studies III General Studies-III: Technology, Economic Development, Bio diversity, Environment, Security and Disaster Management. (250 Marks) Indian Economy and issues relating to planning, mobilization of resources, growth, development and employment.Inclusive growth and issues arising from it.Government Budgeting.Major crops cropping patterns in various parts of the country, different types of irrigation and irrigation systems storage, transport and marketing of agricultural produce and issues and related constraints; e-technology in the aid of farmersIssues related to direct and indirect farm subsidies and minimum support prices; Public Distribution System- objectives, functioning, limitations, revamping; issues of buffer stocks and food security; Technology missions; economics of animal-rearing.Food processing and related industries in India- scope and significance, location, upstream and downstream requirements, supply chain management.Land reforms in India.Effects of liberalization on the economy, changes in industrial policy and their effects on industrial growth.Infrastructure: Energy, Ports, Roads, Airports, Railways etc.Investment models.Science and Technology- developments and their applications and effects in everyday lifeAchievements of Indians in science & technology; indigenization of technology and developing new technology.Awareness in the fields of IT, Space, Computers, robotics, nano-technology, bio-technology and issues relating to intellectual property rights.Conservation, environmental pollution and degradation, environmental impact assessmentDisaster and disaster management.Linkages between development and spread of extremism.Role of external state and non state actors in creating challenges to internal security.Challenges to internal security through communication networks, role of media and social networking sites in internal security challenges, basics of cyber security; money-laundering and its preventionSecurity challenges and their linkages of organized crime with terrorismVarious Security forces and agencies and their mandatePaper V – General Studies IV General Studies- IV: Ethics, Integrity, and Aptitude (250 Marks) Ethics and Human Interface: Essence, determinants and consequences of Ethics in human actions; dimensions of ethics; ethics in private and public relationships. Human Values – lessons from the lives and teachings of great leaders, reformers and administrators; role of family, society and educational institutions in inculcating values.Attitude: content, structure, function; its influence and relation with thought and behaviour; moral and political attitudes; social influence and persuasion.Aptitude and foundational values for Civil Service , integrity, impartiality and non-partisanship, objectivity, dedication to public service, empathy, tolerance and compassion towards the weaker-sections.Emotional intelligence-concepts, and their utilities and application in administration and governance.Contributions of moral thinkers and philosophers from India and world.Public/Civil service values and Ethics in Public administration: Status and problems; ethical concerns and dilemmas in government and private institutions; laws, rules, regulations and conscience as sources of ethical guidance; accountability and ethical governance; strengthening of ethical and moral values in governance; ethical issues in international relations and funding; corporate governance.Probity in Governance: Concept of public service; Philosophical basis of governance and probity; Information sharing and transparency in government, Right to Information, Codes of Ethics, Codes of Conduct, Citizen’s Charters, Work culture, Quality of service delivery, Utilization of public funds, challenges of corruption.Case Studies on above issues.",
            "date": "Answered December 2, 2016",
            "views": "14",
            "upvotes": " View 3 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Akash Gosai",
                    "user_href": "/profile/Akash-Gosai-11"
                },
                {
                    "user_id": "Anu Db",
                    "user_href": "/profile/Anu-Db"
                },
                {
                    "user_id": "Akshay Pratap Singh",
                    "user_href": "/profile/Akshay-Pratap-Singh-30"
                }
            ]
        },
        {
            "author_info": {
                "name": "Aayushi Rakhecha",
                "href": "/profile/Aayushi-Rakhecha"
            },
            "answer_text": "Never ever under-estimate NCERTS. They are also written by highly qualified professors. Ncerts are immensely simplified in their approach and language. They wil actually give you a way to study a proper topic. Though ncerts alone are not sufficient and u must read other recommended book, the basic idea behind any issue or topic as such will be cleard by ncert only. You just can’t skip geography 11th and 12th ncert. 6th to 9th polity ncert you can skip. No harm. Be selective in approach. ",
            "date": "Answered December 2, 2016",
            "views": "427",
            "upvotes": "0"
        }
    ]
}