{
    "title": "Is it illegal to download a pirated digital copy of a book that I previously bought and own in hard copy? I want to get rid of the hard copy in an attempt to reduce physical clutter around me, and I no longer have the purchase receipts. - Quora",
    "tags": [
        "Internet Piracy",
        "Receipts",
        "Copyright Infringement",
        "Copyright Law",
        "eBooks",
        "Downloading",
        "Legal Issues and Law in Everyday Life",
        "Law"
    ],
    "response": [
        {
            "author_info": {
                "name": "Dragi Raos",
                "href": "/profile/Dragi-Raos"
            },
            "answer_text": "Yes, it is illegal. It would still be illegal if your hardcover was published by the same publisher and sold by the same retailer as the digital copy you “liberated”. You probably may argue for legality of scanning and OCR-ing the hard copy yourself as long as you are the only one who uses the result, but you don’t want to invest that much effort. Amazon used to run MatchBook, a program where you could get deeply discounted or even free Kindle copy of books you previously purchased from them in one of DTB* formats. It seems it was very difficult to get publishers on board, and Amazon terminated the program in fall ‘19.[1] *) Dead Tree Book Footnotes[1] Amazon is Shutting Down Kindle Matchbook, Its Print+eBook Bundling Program | The Digital Reader",
            "date": "Answered February 26, 2020",
            "views": "240",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Paula DeMichele",
                "href": "/profile/Paula-DeMichele-1"
            },
            "answer_text": "If you are at all concerned about the author making a just profit and a living from writing, it’s unethical, whether it’s illegal or not. If you published the book you want to download from an illegal copy, would you feel good about losing a part of your just profit? Go online to Open Library - it’s free and the book may be there or on one of many other free sites - unless it’s still under copyright. If it’s under copyright, a digital copy would be free through a public library link to online books. It could be checked out as often as you wanted. Most public libraries subscribe to this nationwide service. Take out a free library card and you can check out any ebook for several weeks at a time. ",
            "date": "Answered February 22, 2020",
            "views": "194",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Sharon Clark",
                    "user_href": "/profile/Sharon-Clark-209"
                },
                {
                    "user_id": "Rachael Saltzman",
                    "user_href": "/profile/Rachael-Saltzman"
                },
                {
                    "user_id": "Ann Wells",
                    "user_href": "/profile/Ann-Wells"
                },
                {
                    "user_id": "Janalyn Glover",
                    "user_href": "/profile/Janalyn-Glover-1"
                }
            ]
        }
    ]
}