{
    "title": "Is Japanese good to learn? - Quora",
    "tags": [
        "Learning Japanese",
        "Japanese (language)",
        "Japan",
        "Learning"
    ],
    "response": [
        {
            "author_info": {
                "name": "Michael Lengyel",
                "href": "/profile/Michael-Lengyel-4"
            },
            "answer_text": "I am an old man, and I have learned much from learning Japanese so far. Mostly, I have learned humility. It is fricken hard. Super hard. Really, really hard. Not the grammar, not the syntax, not even the pronunciation. It is that the heart and soul of a culture is buried inside the very construct of each word, sentence, and kanji. You can see and feel the clash of centuries of culture as Japanese has evolved as a language. It is pretty cool. This may be true with all languages (I would not know) but it is for Japanese for sure. As an American it has opened me up to analysis of some of my own languages rhetorical roots. I would not give up anytime I have spent so far learning Japanese. The following is for the author: One thing that has become acceptable in modern English but should be pointed out in your question: The location of “Good” in your question is awkward if not incorrect and you used the adjectival form of Japan as a noun. The question reads better as, “Is it good to learn the Japanese language?”. Or even better, “Is the Japanese language good to learn?”, or “Is Japanese a good language to learn?” you are using Japanese as a noun meaning the language but what do you really mean the culture?, language? the word? I can tell you learned English recently, because you used an adjectival form of Japan as a noun. Also, good is an awkward albeit modern word to use at all. What does “good” even mean? Will it better my life? Will food taste better if it is good? So it is a short cut to an unknown set of expectations. For example: Will my linguistic skills be improved by the study of the Japanese language? I believe based on your biography this is your real question? ",
            "date": "Answered July 23, 2019",
            "views": "364",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Kokot Picus",
                    "user_href": "/profile/Kokot-Picus"
                },
                {
                    "user_id": "Mari-Ligia Condrea",
                    "user_href": "/profile/Mari-Ligia-Condrea"
                },
                {
                    "user_id": "Mattias Ånstrand",
                    "user_href": "/profile/Mattias-Ånstrand-2"
                }
            ]
        },
        {
            "author_info": {
                "name": "Matt Blackshaw",
                "href": "/profile/Matt-Blackshaw"
            },
            "answer_text": "Yes it's great to learn, It it one of the more difficult languages to acquire as it uses four sets of charachtures and the structuring of sentences is completely different from English. Japanese requires the use of subjugation of hundreds of particles. The fact that it is such a difficult language to learn means you really have to be commited and focused on achieving , The less motivated learners will drop out or lose interest once the ideology of learning Japanese wears off and they are faced with the hard work. When you study Japanese you are not just learning a Language you are also learning a form of craft,Words and characters convey emotions and meaning there is a story behind the creation of many Hiragana and Kanji and often the stories of those characters originate from spiritual experiences and historical events.It's not a language that you can get away speaking half arsed, If you make a mistake a Japanese person will usually correct you, Japanese people are very proud of their language and don't like it when things are mispronounced or expresssions are not used correctly, It's all about detail,precision and respect.To learn Japanese properly it's easier if you know how to 'think' Japanese this means time spent in Japan operating the way Japanese people do, Personally I have found the way sentences and conversations are structured start to make way more sense when observing the day to day formalities of work and society, Japan is a formal,heirachial and mostly harmonious society where the people value care for each other,comfort,hard work, respect and pride IMO when a learner experiences this they can then learn to 'think' Japanese and use the language properly while enjoying and understanding it fully.",
            "date": "Answered April 13, 2018",
            "views": "540",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Jen Rhoades",
                    "user_href": "/profile/Jen-Rhoades"
                },
                {
                    "user_id": "Alma Mia",
                    "user_href": "/profile/Alma-Mia"
                }
            ]
        }
    ]
}