{
    "title": "Is Kamasutra just a sex manual or something more? - Quora",
    "tags": [
        "Kama Sutra",
        "Sexuality and Relationships",
        "Sex and Sexuality",
        "Relationships and Sex",
        "Sex Advice",
        "Sexuality",
        "Adult Dating and Relationships",
        "Sex",
        "Books"
    ],
    "response": [
        {
            "author_info": {
                "name": "Tripti Sonkar",
                "href": "/profile/तृप्ति-सोनकर-Tripti-Sonkar"
            },
            "answer_text": " Kamasutra is arguably the hottest non-fiction book that exist. Overtime many versions of the book have been released. The book is less pornographic than you would think - I have seen countless \"reproductions\" that merely involve couples photographed in the positions. These distract from the content of the original, as does the reputation that proceeds this book. This actually is more of a list of erotic behavior than it is a manual - anyone that reads this will never have a need to read an issue of 'Cosmo' again. (but then, anyone who has gone further than the missionary position probably doesn't need to read Cosmo either ). Instead of a \"sex manual\" it is more of an insight to the sexuality of middle-ages India - there are entire chapters on biting, scratching, sexual positions, courting, seduction, quarrels and fights, \"emergency cures and potions,\" as well as whole sections on homosexual behavior. The commentary (which was originally written a century or so after the original text) gives further advice, stating that certain behavior is not \"suitable\" for people of certain castes, or that women of certain regions prefer certain behaviors but shun others, etc. As someone interested in both anthropology and sexology, this book is indispensable - but if you're someone looking for a quick, kinky read, I wouldn't recommend it. ",
            "date": "Answered January 15, 2019",
            "views": "24",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Alex Nerd",
                    "user_href": "/profile/Alex-Nerd-3"
                },
                {
                    "user_id": "Tripti Sonkar",
                    "user_href": "/profile/Tripti-Sonkar-1"
                }
            ]
        }
    ]
}