{
    "title": "Is killing the main character at the end of a novel a bad move? - Quora",
    "tags": [
        "Novels",
        "Fictional Characters"
    ],
    "response": [
        {
            "author_info": {
                "name": "Jac Mari",
                "href": "/profile/Jac-Mari"
            },
            "answer_text": "It depends, mostly upon the type of story you’re writing, the length of the story, and whether the character death would fit in with the rest of the story. I’ll list some examples of media I’ve come in contact with that killed the main character, or a very major character, and whether they did it well or not and why. Spoilers ahead for: The Book Thief, The Divergent Series, Hamilton, and The Great Gatsby. To begin: The Book Thief, by Markus Zusak. In this story, narrated by Death himself, a young girl named Liesel lives through Nazi-run Germany and steals books. At the end of the novel, she is presented as a dead woman meeting Death. This works well because as a whole, the story is about Liesel’s life and ultimately makes sense to end with her death. By the time of her death, Liesel had lived a full and mostly happy life and was at peace with her own passing. This was a good way to end a novel with the main character’s death. Next, The Divergent Series, by Veronica Roth. In my opinion alone, Divergent was kind of awful, but aside from personal opinions, the killing off of the main character Tris was a poor decision. Over the course of the trilogy she survived everything, only to be killed off at the last minute. Uh, what? Consistency is important. Everyone will die at some point, but in a narrative, plot armour needs to be dealt with carefully and not given or removed randomly. If you have your character survive many tough situations, don’t change that suddenly. (Although I admit, I was glad when Tris died.) Third, Hamilton the Musical, written by Lin-Manuel Miranda. Now yes, I know, this is a musical and not a book. However, I find it deals with character death in a very good way. Of course, all the deaths are historical, but they make sense within the story the musical tells and flow with the rest of the musical. In particular, Hamilton’s death featuring in the second to last song gives the audience time to absorb it and have a bit of closure before the musical ends. Finally, The Great Gatsby, by F. Scott Fitzgerald. While the main character does not die in this novel, a very major character does: the book’s namesake, Gatsby. This death, although explained, did not sit well with the rest of the novel and seemed like a last minute decision. It was awkward and hard to feel anything about the fact that he had died. To conclude, it simply depends on what story you’re trying to tell and whether the death of your main character would flow with the rest of the story. If you write a death scene and it doesn’t seem to fit, try rewriting once or twice, then consider cutting it. Whether killing off your main character is a good or bad move depends on how you execute it. ",
            "date": "Answered November 28, 2017",
            "views": "1",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Elizabeth Marling",
                "href": "/profile/Elizabeth-Marling"
            },
            "answer_text": "It depends on the genre and your story. If you are writing a tragedy, then someone important should die at the end. The story is about loss. Now, if you want to use a twist ending, don’t kill your main character as a “gotcha” for the reader. Here is a good rule of thumb: If the events of your story put your main character at risk of dying at the end as a part of the plot, then you can kill him or her. But no Jesus deaths. No movie hero rising from the ashes. This is a book. If you kill someone, no take backs. Dumbledore can’t send him back from a magical train station. I don’t care if people love your cute heartthrob of a main character; this is BAD writing. If your story has no room or it would be inappropriate to suggest the character’s death early on, it is probably not going to be natural to kill him off. A story is not a series of unrelated events. Each plot point should flow as the result of the previous one, and the story should pretty much evolve on its own as a cause-effect chain. That doesn’t mean the effects can be boring, or the most obvious. Good writing always tries to see the least obvious outcome as well as the more common ones, mixing the two for maximum effect. In a comedy, nothing turns out as expected. In a thriller, a run of expected events are punctuated by shocking or completely inverted ones. In a coming-of-age story, after the inciting incident everything is extremely predictable but this does not help the main character, in fact, it makes life harder because no external factors can be used for the resolution. A good story introduces all important elements in the first third. Following this, if something is introduced in the opening, the story brings it to a satisfying resolution. Through your tone, plot, and/or genre the reader should know that there is a chance the protagonist might die within that first third. If you do not steer the reader’s expectations towards this possibility early, it will feel tacked on, like it was not part of the core story, or false in some way. ",
            "date": "Answered November 26, 2017",
            "views": "868",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Sufi Iskandar",
                    "user_href": "/profile/Sufi-Iskandar-1"
                },
                {
                    "user_id": "Holly Root-Gutteridge",
                    "user_href": "/profile/Holly-Root-Gutteridge"
                }
            ]
        }
    ]
}