{
    "title": "Is MS Chauhan better than OP Tandon? - Quora",
    "tags": [
        "Chauhan",
        "O.P. Tandon (author)",
        "Master of Science Degrees"
    ],
    "response": [
        {
            "author_info": {
                "name": "M Rakshit",
                "href": "/profile/M-Rakshit"
            },
            "answer_text": "No book is better than the other one. Every book has its own benefits. Personally I've never heard about MS Chatham. But I've gone through OP Tandon for 2 year's. As far as I've understood, OP Tandon is best for basics and also advanced topics. It's like enough for the basement and also acts as pillar for your JEE preparation. For inorganic after finishing OP Tandon and solving the MCQ’s in it try doing JD Lee during the last six months and by try I mean just know what topics are important for JEE and read them authentically. For Physical P.Bahadur numerical chemistry is better and NCERT and there are nemerical problem of P.Bahadur too on physical chemistry. And finally the decider for advancd the organic chemistry, I'd say OP Tandon would give you the Base but make sure that you finish it atlesst 4 months before JEE and start solving questions from Himanshu Pandey. But if someone suggests MS Chauhan and you personally feel it's good than OP Tandon then you chose that book. What matters is your grasping power. And don't tend to study from.many books just have 2 maximum for each. And revise regularly! Every concept is clearly given in each book. Everything depends on you that how you cope up with that. Hope this helps. All the best! ",
            "date": "Answered February 1, 2017",
            "views": "26",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Shallu Gupta",
                    "user_href": "/profile/Shallu-Gupta-31"
                },
                {
                    "user_id": "Saurabh Singh",
                    "user_href": "/profile/Saurabh-Singh-1779"
                }
            ]
        },
        {
            "author_info": {
                "name": "Mukunda Madhab Sarmah",
                "href": "/profile/Mukunda-Madhab-Sarmah"
            },
            "answer_text": "The books elementry problems in organic chemistry and advanced problems in organic chemistry by m s chouhan are considered as the bible of objective organic chemistry. For theory you may consider o p tandon organic chemistry , or solomons and frhyle( which i strongly recommand) and for problems use books of m s chouhan. P.s advanced problems in organic chemistry by m s chouhan has some out of syllabus questions so be carefull if you choose this book. I recommand to take the elementry one ",
            "date": "Answered July 9, 2017",
            "views": "43",
            "upvotes": " View 5 Upvoters",
            "upvoters": [
                {
                    "user_id": "Yatharth Singh",
                    "user_href": "/profile/Yatharth-Singh-7"
                },
                {
                    "user_id": "Abhijeet Singh",
                    "user_href": "/profile/Abhijeet-Singh-745"
                },
                {
                    "user_id": "Khalid BinWaleed",
                    "user_href": "/profile/Khalid-BinWaleed"
                },
                {
                    "user_id": "Arjun Sethi",
                    "user_href": "/profile/Arjun-Sethi-10"
                },
                {
                    "user_id": "Neeraj Alavelli (నీరజ్ ఆలవెల్లి)",
                    "user_href": "/profile/Neeraj-Alavelli-నీరజ్-ఆలవెల్లి"
                }
            ]
        }
    ]
}