{
    "title": "Is narcissism always a Jekyll and Hyde scenario? - Quora",
    "tags": [
        "Narcissistic Personality Disorder"
    ],
    "response": [
        {
            "author_info": {
                "name": "Stewart Cook",
                "href": "/profile/Stewart-Cook-2"
            },
            "answer_text": "No. Narcissism exists on a spectrum. Having none is unhealthy. Having lots is boorish for others. Having an appropriate self-confidence requires a healthy amount of narcissism. Some people have Narcissistic Personality Disorder. This actually derives from having nigh-on zero levels of narcissism. Sufferers with such low-self-esteem are so ashamed that they adopt a “false self” - a seemingly confident and charming persona. This, however, is nothing more than a facade to mask their “real self”. So whilst narcissism per se doesn’t involve a Jekyll & Hyde character, pathological narcissism, or NPD, most certainly does. It is famously difficult for bystanders to see the “false self” - even psychologists and psychiatrists can be fooled. This very toxic “real self”, the Mr Hyde, is saved for their nearest and dearest who are subtly, and often not very subtly, psychologically abused behind closed doors. Narcopaths will stop at nothing to protect their dark little secret. Building and maintaining the con trick is their life’s work - literally. It requires constant feeding with what is called narcissistic supply. Hence the pathological lies, the manipulation, and the mission to destroy anyone who threatens to uncover them. Beware. Please follow me for further insight into NPD. ",
            "date": "Answered November 19, 2018",
            "views": "629",
            "upvotes": " View 5 Upvoters",
            "upvoters": [
                {
                    "user_id": "E.M.Carr",
                    "user_href": "/profile/E-M-Carr"
                },
                {
                    "user_id": "Bev Anne",
                    "user_href": "/profile/Bev-Anne-1"
                },
                {
                    "user_id": "Ana da Silva",
                    "user_href": "/profile/Ana-da-Silva-24"
                },
                {
                    "user_id": "Linda Lewis",
                    "user_href": "/profile/Linda-Lewis-34"
                },
                {
                    "user_id": "Paul G. Roberts",
                    "user_href": "/profile/Paul-G-Roberts-1"
                }
            ]
        }
    ]
}