{
    "title": "Is NCERT chemistry enough for the NEET AIIMS? - Quora",
    "tags": [
        "National Council of Educational Research and Training (NCERT)",
        "All India Institute of Medical Sciences (AIIMS)"
    ],
    "response": [
        {
            "author_info": {
                "name": "Anshul Garg",
                "href": "/profile/Anshul-Garg-15"
            },
            "answer_text": "NCERT Chemistry is too good and important for NEET and AIIMS.. But after that u need to refer some books to make it complete ! Chemistry: NCERT most important. Other than that, for reference, use OP Tandon, Himanshu Pandey, Pradeeps, Morrison and Boyd etc Practice from NEET Champion, NCERT at your fingertips for all three subjects ! Practice all these questions MANY TIMES.Become perfect in them.Solve other people’s doubts. These will help you score better :). People run after so many modules and crap test series. Instead you should focus on limited material and do it more number of times !! Many questions ask only basic concepts but a good clarity in them. Best Wishes Satnara IIT AIIMS Academy (an initiative by IITians.. ) ",
            "date": "Answered August 19, 2018",
            "views": "164",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Sejal Asati",
                    "user_href": "/profile/Sejal-Asati-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Saumya Anand",
                "href": "/profile/Saumya-Anand-26"
            },
            "answer_text": "Well it isnt enough for both.If you are preparing for both the exams on your own I suggest you use these books 1.Pradeeps for chemistry Biology 1.Complete biology by Vinay kumar and SS bhatia(especially for NEET 2019) 2.Truemans biology booklet If you are a student of Aakash or Allen then the material is sufficient but a lot of practice will be needed.These books have tons of questions for you to solve and strengthen your basics.Practice is needed, make sure you are through with the basics.The books mentioned above will help you prepare for both IIMA and NEET. All the best. ",
            "date": "Answered August 19, 2018",
            "views": "169",
            "upvotes": "0"
        }
    ]
}