{
    "title": "Is Pope Francis the worst Pope in modern-day Catholicism? - Quora",
    "tags": [
        "Francis (Pope)",
        "The Papacy",
        "Catholicism"
    ],
    "response": [
        {
            "author_info": {
                "name": "Al Rossi",
                "href": "/profile/Al-Rossi-1"
            },
            "answer_text": "That depends upon whom you ask. And just about no one who weighs in on it is qualified to answer. That, of course, doesn’t prevent anyone from offering an opinion. There are those who believe that John XIII was the worst, and if he had lived long enough, even more who would have said John Paul I was the worst, although this is probably less than those who think Pope Francis is the worst, among them some eminent theologians like Rush Limbaugh, Sean Hannity, and Donald Trump. But, and it is primarily those who are politically conservative, there are always those with no teaching authority who are convinced that they are literally “more Catholic than the Pope.” That isn’t the way Catholicism works. The Pope has not spoken ex cathedra on any subject of either faith or morals. And the Church has always given the prouncement of Councils the same stamp of Infaillability as Papal Infaillability (and in fact, I think it was the First Vatican Council that promulgated the doctrine of Papal Infaillability). Nonetheless until the matters are settled the faithful are still bound to respect the magisterium of the Church. This is not a matter of theological agreement: this is a matter of obedience. So, there isn’t a Pope who has lived who hasn’t sinned, or who hasn’t been wrong on a theological matter. Invariably the Pope who is the “worst” is the Pope who is the least popular, which means exactly nothing. ",
            "date": "Answered September 21, 2018",
            "views": "598",
            "upvotes": " View 8 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Joe Fazio",
                    "user_href": "/profile/Joe-Fazio-7"
                },
                {
                    "user_id": "David Smith",
                    "user_href": "/profile/David-Smith-638"
                },
                {
                    "user_id": "S. Pascal Anargya Sulistyo",
                    "user_href": "/profile/S-Pascal-Anargya-Sulistyo"
                },
                {
                    "user_id": "Tom Morgan",
                    "user_href": "/profile/Tom-Morgan-34"
                },
                {
                    "user_id": "Gregory Krohm",
                    "user_href": "/profile/Gregory-Krohm"
                },
                {
                    "user_id": "Jose' Arroyo",
                    "user_href": "/profile/Jose-Arroyo-207"
                },
                {
                    "user_id": "Joseph Fustero",
                    "user_href": "/profile/Joseph-Fustero"
                },
                {
                    "user_id": "Tim Lockwood",
                    "user_href": "/profile/Tim-Lockwood-3"
                }
            ]
        },
        {
            "author_info": {
                "name": "Tom Morgan",
                "href": "/profile/Tom-Morgan-34"
            },
            "answer_text": "There are many of us who would say quite the opposite, as has been hinted to by others. The pope’s job is to emulate Christ and lead the Church accordingly. True Conservative Christianity, by definition, is following Christ’s teachings and following in His footsteps. Has Pope Francis followed the so-called conservative bent of some of his predecessors? Absolutely not. He is looking much further back to the foundations of Christendom and our Lord Jesus Christ, not the power brokers who want to maintain control over the masses. Am I qualified to answer, Mr. Rossi would say not. As an individual who has followed our papas for some time now, and the activities of the church heirarchy as well, I’m as qualified as anyone else - for we are all entitled to our informed (or in some cases uninformed) opinions. No, Pope Francis categorically is not the *worst* Pope in modern times. He may be among the best - Christ didn’t walk a popular line in His day - I wonder how many so-called Christians would recognized and welcome Him today. ",
            "date": "Answered October 2, 2018",
            "views": "253",
            "upvotes": " View 2 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Joe Fazio",
                    "user_href": "/profile/Joe-Fazio-7"
                },
                {
                    "user_id": "Elio Pastore",
                    "user_href": "/profile/Elio-Pastore"
                }
            ]
        }
    ]
}