{
    "title": "Is Percy Jackson a Gary Stu? - Quora",
    "tags": [
        "Gary Stu",
        "Percy Jackson and the Olympians (book series)",
        "Rick Riordan (author)",
        "Heroes of Olympus (book series) .",
        "Percy Jackson (fictional character)",
        "Percy Jackson (creative franchise)",
        "Fictional Characters"
    ],
    "response": [
        {
            "author_info": {
                "name": "Elisa Stylinson",
                "href": "/profile/Elisa-Stylinson-1"
            },
            "answer_text": "‘Gary Stu: seemingly perfect character with no flaws, or who always overpowers other characters’. ‘It's a negative term used in fanfiction and literary criticism to describe an original character that is often overly idealized or assumed to be a projection of the author.’ (Urban Dictionary and knowyourmeme.com) Well, I wouldn't use this adjective to describe him. Certainly Percy is very likeable, funny (or at least for me), laidback, loyal and courageous. However, he's far from being “perfect”. As we can see from the books, he's not the smartest student since he suffers from ADHD and dyslexia. He's not the cool and popular guy, but he's considered a troublemaker as he's expelled many times and he hangs out with Grover and Tyson who aren't considered “cool\", but rather outcasts. On the other hand, Annabeth says that he's technically smart, but seems to act dumb and describes him as: “He’s actually pretty intelligent, but he acts so dumb sometimes. I wonder if he does it just to annoy me. The guy has a lot going for him. He’s courageous. He’s got a sense of humor.”  He's unpredictable and changeable, just like Poseidon, rebellious (for instance, when he refused to continue living with Gabe), impulsive, sarcastic and short-tempered. In fact, Percy is reckless and he tends to do things before thinking and that's why he gets in a lot of trouble. He fought against Ares who is a very powerful god without thinking about the consequences because he didn't like the way he behaved. That's very courageous, but also very stupid. I have to admit that he's very powerful, especially after bathing in the River Styx and becoming immortal but he’s excessively loyal to his friends and family (his fatal flaw). It could be something admirable, but as Athena says \"The most dangerous flaws are good in moderation\". I think it's not that bad but you know… never contradict the words of a god/goddess. I also want to add that his “flaws\" are actually what makes him so likeable and interesting. (Sorry, but English is not my first language!)  ",
            "date": "Updated June 17, 2020",
            "views": "556",
            "upvotes": " View 753 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Aliana Yee",
                    "user_href": "/profile/Aliana-Yee-1"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/Kat-the-Queen-1"
                },
                {
                    "user_id": "Sunaina Lala",
                    "user_href": "/profile/Sunaina-Lala"
                },
                {
                    "user_id": "Alexis Keke",
                    "user_href": "/profile/Alexis-Keke"
                },
                {
                    "user_id": "Claudia Wang",
                    "user_href": "/profile/Claudia-Wang-8"
                },
                {
                    "user_id": "Justen Berntsen",
                    "user_href": "/profile/Justen-Berntsen"
                },
                {
                    "user_id": "Cassia Black",
                    "user_href": "/profile/Cassia-Black"
                },
                {
                    "user_id": "-Vanilla Mocha-",
                    "user_href": "/profile/Vanilla-Mocha-3"
                },
                {
                    "user_id": "Marc Torfeh",
                    "user_href": "/profile/Marc-Torfeh"
                },
                {
                    "user_id": "Saahil Nayudu",
                    "user_href": "/profile/Saahil-Nayudu"
                }
            ]
        },
        {
            "author_info": {
                "name": "Mike Knopp",
                "href": "/profile/Mike-Knopp-1"
            },
            "answer_text": "First, to appease the originalist. No. Because the original definition of a Mary Sue/Gary Stu was a self inserted character into a fanfiction. Since Percy appears in original works by Rick Riordan then he cannot be a Gary Stu by the original definition. However, the definition of the Mary Sue/Gary Stu has evolved over time. Now it can be applied to original characters who exhibit the other characteristics of a Mary Sue/Gary Stu. This is where it gets interesting. What are the other characteristics? The list varies from place to place. However, the most agreed upon characteristics include: The ability to do nearly everything perfectly despite no in-story reason for the character to have those abilities. And in the rare instances where they don’t do something perfectly, they suffer no real consequences for these lapses.Yeah, Percy screws up all of the time in the stories. And he suffers for them. And other people suffer because of his mistakes.The Mary Sue/Gary Stu is beloved by pretty much everybody as soon as they meet them. The only people who don’t automatically love the Mary Sue/Gary Stu are the antagonists of the story (and even that isn’t always the case).Oh my lord, are you kidding me! Look at the stories, most people don’t like Percy when they first meet him. Heck, his eventual romantic interest can barely tolerate him for the first part of the first book.People tend to put overpowered into the definition of a Mary Sue/Gary Stu, but too be blunt this doesn’t hold for the definition outside of fanfiction. In fanfiction it is an original character who is more powerful than the established characters, but in an original work there are no established characters to be compared to. So, no, being an overpowered character doesn’t automatically make one a Mary Sue/Gary Stu. It is more about the justification for those powers. Does it make sense in the story for the character to have those abilities? Another answer mentions One Punch Man. That is a perfect example of an overpowered character who isn’t a Gary Stu because while he is ridiculously overpowered in the stories that is actually part of his character. And here is the clincher. Most people don’t like him or look down on him. He makes mistakes and suffers from them. Being overpowered does not a Mary Sue/Gary Stu make. So, is Percy a Mary Sue/Gary Stu? No. ",
            "date": "Answered October 27, 2020",
            "views": "68",
            "upvotes": " View 3 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Michael Zahabi",
                    "user_href": "/profile/Michael-Zahabi"
                },
                {
                    "user_id": "Andrew Vanessa",
                    "user_href": "/profile/Andrew-Vanessa-2"
                },
                {
                    "user_id": "Ben Solace",
                    "user_href": "/profile/Ben-Solace"
                }
            ]
        }
    ]
}