{
    "title": "Is PHP the worst programming language to learn? - Quora",
    "tags": [
        "PHP (programming language)",
        "Learning to Program",
        "Programming Languages"
    ],
    "response": [
        {
            "author_info": {
                "name": "Carlos Paradis",
                "href": "/profile/Carlos-Paradis"
            },
            "answer_text": "Let me start by saying that as someone who has to teach sometimes as a teacher assistant PHP to business students as a first programming language, I have sympathy to the author of this question. In fact, there is more: You are not alone, to the extent someone made this whole cartoon (no it wasn’t me!):  (See this link for even more rant on the cartoon: How To Save The Princess In 8 Programming Languages • r/ProgrammerHumor) Disclaimer: I come from a computer science background - Back in the day we learn pseudocode, then Pascal, then Java for OO, but these days I see people starting from everything, more commonly Python) . The first time I heard I was teaching freshman in business how to program in PHP and saw the slides my reaction was this:  At first impression, the horror was in what the students were expected to do with it while learning it: A website with some basic page flow, sticky forms and I/O. Students learn HTML, CSS and then PHP altogether within a semester, along with programming concepts. Top that with Xampp and Netbeans troubleshooting on computers after day 1, and I was left wondering how someone could do such a thing as use PHP. However, as time went by I realized that PHP omitted much of the complexity other languages would have to create a website already on it’s language. Personally, for the goal of creating a website, PHP felt much simpler than installing Python + some other framework like Django and Flask. This perception felt similar to someone who comes from an Engineering background and is more familiar with Matlab (back in the day I guess Fortran), and can more easily transition to Octave and R as languages rather than Python. A computer science instead will be more familiar with Pascal, C, Java, Python, Ruby, etc. TL;DR: At the end of the day, you may want to consider what you are using PHP for as an example to learn it. As an introduction to website creation it may be a good starting point, but I don’t know (since I don’t do websites for a living), if a dedicated library like in Python wouldn’t be more familiar depending on your background. If you are coming from a different background or already used to a different way to reason about programming, there may be some bias and mental model mismatch due to it. ",
            "date": "Answered October 22, 2017",
            "views": "69",
            "upvotes": " View 31 Upvoters",
            "upvoters": [
                {
                    "user_id": "Stephen M. Bear",
                    "user_href": "/profile/Stephen-M-Bear"
                },
                {
                    "user_id": "Martin Kuhn",
                    "user_href": "/profile/Martin-Kuhn-5"
                },
                {
                    "user_id": "Csaba Farkad",
                    "user_href": "/profile/Csaba-Farkad"
                },
                {
                    "user_id": "Lucas Daniel Velazquez",
                    "user_href": "/profile/Lucas-Daniel-Velazquez"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/Hercule-Pireaut"
                },
                {
                    "user_id": "Mike Anthony",
                    "user_href": "/profile/Mike-Anthony-15"
                },
                {
                    "user_id": "Justin Mitchell",
                    "user_href": "/profile/Justin-Mitchell-85"
                },
                {
                    "user_id": "Thet Khine",
                    "user_href": "/profile/Thet-Khine-2"
                },
                {
                    "user_id": "Sebastian Ostermann",
                    "user_href": "/profile/Sebastian-Ostermann"
                },
                {
                    "user_id": "Ronan Rouyer",
                    "user_href": "/profile/Ronan-Rouyer"
                }
            ]
        },
        {
            "author_info": {
                "name": "Shikhar Shukla",
                "href": "/profile/Shikhar-Shukla-15"
            },
            "answer_text": "No not at all. PHP (Hypertext Pre-Processor) is a server-side web programming language that is widely used for web development.However, here are many languages which are used for web development or web programming. But among all of them PHP is the most popular web scripting language. So, let us find out why PHP is widely used for web development… PHP language has its roots in C and C++. PHP syntax is most similar to C and C++ language syntax. So, programmers find it easy to learn and manipulate. MySQL is used with PHP as back-end tool. MySQL is the popular online database and can be interfaced very well with PHP. Therefore, PHP and MySQL are excellent choice for webmasters looking to automate their web sites. PHP can run on both UNIX and Windows servers. PHP also has powerful output buffering that further increases over the output flow. PHP internally rearranges the buffer so that headers come before contents. PHP is dynamic. PHP works in combination of HTML to display dynamic elements on the page. PHP only parses code within its delimiters, such as. Anything outside its delimiters is sent directly to the output and not parsed by PHP. PHP can be used with a large number of relational database management systems, runs on all of the most popular web servers and is available for many different operating systems. PHP5 a fully object oriented language and its platform independence and speed on Linux server helps to build large and complex web applications. So, in general PHP is cheap, secure, fast and reliable for developing web applications. And if you compare PHP with other scrpting languages, PHP Vs. ASPASP is said to be a slower and more cumbersome language than PHP, less stable as well. The biggest drawback of ASP is that it’s a proprietary system that is natively used only on Microsoft Internet Information Server (IIS). The components built in ASP are really limited, so if you need to use “advanced” features like interacting with FTP servers, you need to buy additional components. PHP Vs. ColdfusionPHP runs on almost every platform there is; Cold Fusion is only available on Win32, Solaris, Linux and HP/UX. Cold Fusion has a good IDE and is generally easier to get started with, whereas PHP initially requires more programming knowledge. Cold Fusion is designed with non-programmers in mind, while PHP is focused on programmers. So, we expect the best programming with PHP. PHP Vs. PerlPerl is really hard to write code; actually PERL loses flexibility in coding and thus makes tough while editing the code. PHP has a less confusing and stricter format without losing flexibility. PHP is easier to integrate into existing HTML than Perl. PHP has pretty much all the ‘good’ functionality of Perl: constructs, syntax and so on, without making it as complicated as Perl can be. Perl is a very tried and true language, it’s been around since the late eighties, but PHP is maturing very quickly. Source:- eukhost.com ",
            "date": "Answered October 22, 2017",
            "views": "1",
            "upvotes": " View 7 Upvoters",
            "upvoters": [
                {
                    "user_id": "Akira Toriko",
                    "user_href": "/profile/Akira-Toriko"
                },
                {
                    "user_id": "Saket Thorat",
                    "user_href": "/profile/Saket-Thorat"
                },
                {
                    "user_id": "Anjali Agarwal",
                    "user_href": "/profile/Anjali-Agarwal-179"
                },
                {
                    "user_id": "Octavio Munoz",
                    "user_href": "/profile/Octavio-Munoz-1"
                },
                {
                    "user_id": "Shivam Patel",
                    "user_href": "/profile/Shivam-Patel-568"
                },
                {
                    "user_id": "Jordan Edwards",
                    "user_href": "/profile/Jordan-Edwards-22"
                },
                {
                    "user_id": "Neo Morina",
                    "user_href": "/profile/Neo-Morina"
                }
            ]
        }
    ]
}