{
    "title": "Is Rakesh Yadav's aptitude book enough for banking exams? - Quora",
    "tags": [
        "Rakesh Yadav",
        "Bank Exams"
    ],
    "response": [
        {
            "author_info": {
                "name": "Tanvi Sharma",
                "href": "/profile/Tanvi-Sharma-710"
            },
            "answer_text": "Strong aptitude in competitive exams helps you in fetching good marks. So for getting good marks one needs to work hard and focus. If you want to crack any exam you need to constantly work towards your dreams. You should always refer to the best study material/books for your preparations. The syllabus for this section includes: Data interpretation (Pie charts, Table chart, Bar Graphs, Line charts, Mixed graphs, Histograms),Probability,Number system,Simplification/Approximation,Time and distance,HCF and LCM of Numbers,Problems based on age,Number series,Quadratic Equations,Percentages,Ratio and proportion,Average,Mixture and Allegations,Time and work,Pipe and Cistern,Speed, Distance and time,Partnership and Simple and compound interest. I’ve listed two best books for the aptitude section that covers all the syllabus mentioned above : Fast Track Objective Arithmetic by Rajesh VermaQuantitative Aptitude for Competitive Exams by RS AggarwalYou can easily get the books from SASTA BOOKS. This website has got an amazing collection of competitive books for students. Apart from the reasoning books you can find several other books for preparation of various competitive exams. The books available here are at just half rates and additional discounts are also given. If you are planning to buy books this website is highly recommended. ",
            "date": "Answered June 29, 2020",
            "views": "172",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Gehna Kochhar",
                    "user_href": "/profile/Gehna-Kochhar-1930178"
                }
            ]
        }
    ]
}