{
    "title": "Is R for data science a good book? - Quora",
    "tags": [
        "R (programming language)",
        "Big Data",
        "Data Science",
        "Book Recommendations"
    ],
    "response": [
        {
            "author_info": {
                "name": "Anurag Pandey",
                "href": "/profile/Anurag-Pandey-504"
            },
            "answer_text": "R is specifically designed for Data Science needs. You can solve any problems you encounter in Data Science. Data Scientist are using R to solve statistical problems. R has a steep learning curve. The style of coding is quite easy.It’s open source. No need to pay any subscription charges.The community support is overwhelming. There are numerous forums to help you out.Get high performance computing experience.One of highly sought skill by analytics & Data Science companies.A few features of R Programming- Statistical analysis environmentOpen sourceHuge Community supportAvailability of packagesBenefits of ChartingR has some features that are important for Data Science applications- R being a vector language can perform many operations at once.R doesn’t need any compilers as it’s an interpreted languageFor statistical analysis & graphs, there is no better option than R programming, with capabilities around matrix multiplication available straight out of the box.R programming provides support functions for Data Science applications.The ability of R programming to translate math to code seamlessly and makes it an ideal choice for someone with minimal programming knowledge.Also read my previous answer- Anurag Pandey's answer to Where exactly do we use R programming?Anurag Pandey's answer to How does Google use R language?Anurag Pandey's answer to What is the best programming language in data science field in 2018 - Python or R?Hope this information is useful to you. Please UPVOTE!! Follow my account Anurag Pandey to read my regular answers on Data Science ",
            "date": "Answered December 18, 2018",
            "views": "463",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Pacharapol Withayasakpunt",
                    "user_href": "/profile/Pacharapol-Withayasakpunt"
                },
                {
                    "user_id": "Raghav Raj",
                    "user_href": "/profile/Raghav-Raj-69"
                }
            ]
        }
    ]
}