{
    "title": "Is Revelation from the Bible taking place today and if so, what are some things that are taking place that you would consider prophecy of the Bible? - Quora",
    "tags": [
        "Biblical Prophecies",
        "Book of Revelation",
        "Prophecies",
        "God and the Christian Bible",
        "Doomsday",
        "Bible Study",
        "Christian Theology and Philosophy",
        "The Bible",
        "Christianity"
    ],
    "response": [
        {
            "author_info": {
                "name": "Mildred Kavanaugh",
                "href": "/profile/Mildred-Kavanaugh"
            },
            "answer_text": "Nations are lining up against Israel the exact way the Bible says they will. Our former Presidents—Clinton, Bush and especially Obama were laying the ground work for the US to be part of the One World Government and Globalism. Trump is dismantling much of Obama’s plans for One World Government. That’s why he is so hated by many. Mass immigration will lead to the chaos of the Great Tribulation. There is a falling away of believers just as Jesus said there would be. Religions are merging and “Christians,” Muslims, Buddhist, Hindus have at times joined together for “prayer” meetings. This will lead to the One World Religion. Some companies are already putting a chip in employees hands to be scanned to enter the building. Debit cards are popular and money is used less in transactions than formerly. This will lead to the One World Money system predicted in the Bible. Things are truly lining up just as the prophets said they would. ",
            "date": "Answered April 1, 2019",
            "views": "73",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Ira Salem",
                    "user_href": "/profile/Ira-Salem"
                }
            ]
        },
        {
            "author_info": {
                "name": "Russell Fletcher",
                "href": "/profile/Russell-Fletcher-1"
            },
            "answer_text": "Q. Is Revelation from the Bible taking place today and if so, what are some things that are taking place that you would consider prophecy of the Bible? A. Yes the Book of Revelation is taking place now. The four horses are here. The black horse represents capitalism. The red horse represents communism and socialism. White Horse represents Catholicism. The Pale Horse is mistranslated. Everywhere else the word chloros is used it is translated green. The green horse represents islamism. Wormwood has already happened. In the Ukrainian Bible the word wormwood is translated Chernobyl. The awful nuclear accident at Chernobyl poisoned the Waters of a number of countries. One of the next two events to happen is the Euphrates River War also called World War 3 by some people because of the third of mankind is killed. The other upcoming event to happen is the israeli-palestinian peace agreement that will allow the building of the Third Temple. It will also allow for the two-state solution where Jews already settled on the West Bank can stay there under Palestinian control. ",
            "date": "Answered April 1, 2019",
            "views": "87",
            "upvotes": " Answer requested by Ira Salem"
        }
    ]
}