{
    "title": "Is Sadhguru pro Hindutva? - Quora",
    "tags": [
        "Hindutva (political ideology in Indian democracy)"
    ],
    "response": [
        {
            "author_info": {
                "name": "Prashant",
                "href": "/profile/Prashant-559"
            },
            "answer_text": "If we talk about pro hindutva today then first word that comes to our mind is right wing. But sadhguru has clarified many times he neither belongs to right wing nor left wing. He does not identify himself with any ideology. In response to a query by a student on how one can remain neutral in JNU, which is a politically vibrant campus, he said, \"This has become a phenomenon across the county. If you open your mouth to say something about the nation, they will try to fix you something to some ideology. Inevitably someone is trying to pin you on some board. Unfortunately, this is how you are destroying a democracy.\" \"What is the point of secret ballot? What is the point of offering a citizen the choice of choosing?\" Citing the example of the US, he said citizens there are either Republicans or Democrats. We are becoming like that. US was unfortunately divided like that for decades but that was not there in India. But in the past 10 years or so, everyone belongs to some party. This is destruction of democracy. Three months before elections, one should start evaluating whether they have done something. You must evaluate according to your intelligence. There is enough information available to help you do that,\" he told students. He said that a country's citizens, especially students, should not be politically inclined. “If you want a lively democracy, except for a few committed party workers, the rest of the country should not be committed to any political ideology. But unfortunately, it has become a worldwide phenomenon. I was proudly speaking in the US about Indians living democracy till sometime back. I have just kept quiet about Indians living democracy in the past five years. We have become the same thing,\" he said. \"You must debate on issues but do not take sides at this stage. You are just destroying democracy. It becomes a feudalistic society then. Otherwise we can function like China. But we have chosen a democratic process,\" he stressed. Below video is taken from Sadhguru’s Sense YouTube channel.  ",
            "date": "Updated October 14, 2018",
            "views": "74",
            "upvotes": " View 37 Upvoters",
            "upvoters": [
                {
                    "user_id": "Bharath Reddy",
                    "user_href": "/profile/Bharath-Reddy-142"
                },
                {
                    "user_id": "Sambit Swarup",
                    "user_href": "/profile/Sambit-Swarup"
                },
                {
                    "user_id": "Aacis Poudel",
                    "user_href": "/profile/Aacis-Poudel"
                },
                {
                    "user_id": "Vysakh Vk",
                    "user_href": "/profile/Vysakh-Vk"
                },
                {
                    "user_id": "Shilpa Thakre Ray",
                    "user_href": "/profile/Shilpa-Thakre-Ray"
                },
                {
                    "user_id": "Ramesh A",
                    "user_href": "/profile/Ramesh-A-18"
                },
                {
                    "user_id": "Varun Gehlot",
                    "user_href": "/profile/Varun-Gehlot"
                },
                {
                    "user_id": "Ankit Pandey",
                    "user_href": "/profile/Ankit-Pandey-227"
                },
                {
                    "user_id": "Sridhar Reddy",
                    "user_href": "/profile/Sridhar-Reddy-139"
                },
                {
                    "user_id": "Vishesh Vijayan",
                    "user_href": "/profile/Vishesh-Vijayan"
                }
            ]
        },
        {
            "author_info": {
                "name": "Rohan Kshirsagar",
                "href": "/profile/Rohan-Kshirsagar-5"
            },
            "answer_text": "Sadhguru firstly denies that Hinduism is a religion. He has also spoke on it that the word “Hindu” is just a geographical identity.  Instead he considers Indian spirituality in general as “Sanatan Dharma” and under that name he dosen’t exclude the Patriarchs of other Indian religions like Buddha, Mahavira etc which usually the communist minded Hindus, Buddhists and Jainas do with each other. He has also emphasized upon the profound meaning of a statement of Jesus in his book Mystic’s Musings, “Love Thy Neighbour”. He also outrightly denies Shiva as ‘God/Avatar’, instead he looks at him as a “Yogi of the highest form of respect-Adiyogi” and also applies the same to Krishna or any other Gods (I suppose) which is what a traditional Hindu would not appreciate. But yes, he seems to be least interested in anything outside Indian spirituality. And notably his way or view about his enlightenment is quite consistent with a Vedic school of thought called Advaita Philosophy . The term Advaita refers to its idea that the soul (true Self, Atman) is the same as the highest metaphysical Reality (Brahman). The followers of this school are known as Advaita Vedantins, or just Advaitins, and they seek spiritual liberation through acquiring vidyā (knowledge) of one's true identity as Atman, and the identity of Atman and Brahman. Advaita Vedanta traces its roots in the oldest Upanishads. So, it is very difficult to answer straightly whether he is pro-hindutva or not as for some people, somebody propounding even a slightest bit of Sanatan Dharma looks like a pro-hindu kind of person. It would be objectively appropriate to call him the least, an Unconventional Guru. ",
            "date": "Updated October 13, 2017",
            "views": "12",
            "upvotes": " View 7 Upvoters",
            "upvoters": [
                {
                    "user_id": "Igor Lapshun",
                    "user_href": "/profile/Igor-Lapshun"
                },
                {
                    "user_id": "Afraz Ali",
                    "user_href": "/profile/Afraz-Ali-8"
                },
                {
                    "user_id": "Dimitry Petrenko",
                    "user_href": "/profile/Dimitry-Petrenko"
                },
                {
                    "user_id": "Vijay Sekhar",
                    "user_href": "/profile/Vijay-Sekhar-17"
                },
                {
                    "user_id": "Anup Bonde",
                    "user_href": "/profile/Anup-Bonde-1"
                },
                {
                    "user_id": "Oliver Queen",
                    "user_href": "/profile/Oliver-Queen-188"
                },
                {
                    "user_id": "Tanmoy Karmokar",
                    "user_href": "/profile/Tanmoy-Karmokar"
                }
            ]
        }
    ]
}