{
    "title": "Is such a small book like 'Calculus on Manifolds' by Spivak enough to cover most of the standard material in a first course in multivariable calculus at a rigorous level? - Quora",
    "tags": [
        "Multivariable Calculus"
    ],
    "response": [
        {
            "author_info": {
                "name": "Bruce Balden",
                "href": "/profile/Bruce-Balden"
            },
            "answer_text": "Spivak's Calculus on Manifolds is not a replacement for the traditional engineering-oriented multivariable calculus course.  The setting for the latter is three-dimensional real space, which is fine up to a point, but  the various interrelated theorems known as Greens, Stokes, Gauss theorem can be unified and generalized -- and simplified -- if you take the time to learn about manifolds and the manifold concept of a vector field -- and related concepts, and the results extend to higher dimensions, or project down to 2 dimensions (Green's theorem).   Spivak is not the only book to take this approach to Stokes' theorem.  There is Allen Devinatz' Advanced Calculus which is much bigger book than Spivak's and go for the same approach, more or less. Baby Rudin also proves the manifold version of Stokes' theorem. Every complete book does -- but only Spivak devotes an entire book -- a supplement -- if you will to it. So the best plan of attack is to take a conventional book (Greenspan and Benny for instance) and then take Spivaks' Calculus on Manifolds as a supplement. In summary, lots of people will get a you a proof of Stokes theorem on manifolds, but only Spivak doesn't end the book abruptly when this theorem is complete and thus you don't have meaningful examples yet. ",
            "date": "Answered August 7, 2015",
            "views": "21",
            "upvotes": " View 8 Upvoters",
            "upvoters": [
                {
                    "user_id": "Mauricio Mejía Castro",
                    "user_href": "/profile/Mauricio-Mejía-Castro"
                },
                {
                    "user_id": "Alan Cooper",
                    "user_href": "/profile/Alan-Cooper-5"
                },
                {
                    "user_id": "Mikayla Eckel Cifrese",
                    "user_href": "/profile/Mikayla-Eckel-Cifrese-1"
                },
                {
                    "user_id": "Michel Boto",
                    "user_href": "/profile/Michel-Boto"
                },
                {
                    "user_id": "Arshad Ali",
                    "user_href": "/profile/Arshad-Ali-1"
                },
                {
                    "user_id": "Julian Grodzicky",
                    "user_href": "/profile/Julian-Grodzicky"
                },
                {
                    "user_id": "John Steele",
                    "user_href": "/profile/John-Steele-57"
                },
                {
                    "user_id": "Sameer Gupta",
                    "user_href": "/profile/Sameer-Gupta"
                }
            ]
        },
        {
            "author_info": {
                "name": "Joshua Kim",
                "href": "/profile/Joshua-Kim-36"
            },
            "answer_text": "It does cover most of the standard materials for rigorous multivariable calculus class. However, I remember that a lot of of materials are left as exercises. If you are a person who can benefit more from tackling problems, \"Calculus on Manifolds\" would be a good start. If not, I would instead recommend, \"Analysis on Manifolds\" by James Munkres, which is easier to read. ",
            "date": "Answered August 4, 2015",
            "views": "15",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Michel Boto",
                    "user_href": "/profile/Michel-Boto"
                },
                {
                    "user_id": "Julian Grodzicky",
                    "user_href": "/profile/Julian-Grodzicky"
                }
            ]
        }
    ]
}