{
    "title": "Is there a meaningful relation between the potato and sweet potato, or do they just look similar? - Quora",
    "tags": [
        "Yams & Sweet Potatoes",
        "Potatoes"
    ],
    "response": [
        {
            "author_info": {
                "name": "Pamela B. Zohar",
                "href": "/profile/Pamela-B-Zohar"
            },
            "answer_text": "They are unrelated plants, which both happen to create a tuberous root which look similar. So do yams, by the way, which happen to be ANOTHER totally unrelated plant that happens to create a similar tuberous root. For the sake of it - LOTS of plants make tuberous roots. Oxalis does. Iris have a rhyzome which isn’t amazingly different. Tuberous roots - the wild smilax (cat claw vines) in the woods around here (and in my backyard) make some AMAZING large tuberous roots. It’s a common type of root development. We eat roots. We eat beets, turnips, onions, potatoes, yams and sweet potatoes (all different plants) and others. Plants store starch in those tubers to keep themselves going longer when conditions aren’t good - such things aren’t rare. Sometime when you have a minute, look up peanuts. Plant adaptations are pretty cool. ",
            "date": "Answered October 20, 2020",
            "views": "115",
            "upvotes": " View 5 Upvoters",
            "upvoters": [
                {
                    "user_id": "Raf Vosté",
                    "user_href": "/profile/Raf-Vosté"
                },
                {
                    "user_id": "John Freeberg",
                    "user_href": "/profile/John-Freeberg-1"
                },
                {
                    "user_id": "Tzivia Adler",
                    "user_href": "/profile/Tzivia-Adler"
                },
                {
                    "user_id": "Catherine Celice",
                    "user_href": "/profile/Catherine-Celice"
                },
                {
                    "user_id": "Gerald Pierson",
                    "user_href": "/profile/Gerald-Pierson"
                }
            ]
        },
        {
            "author_info": {
                "name": "Larry Wallace",
                "href": "/profile/Larry-Wallace-57"
            },
            "answer_text": "‘Batata’ was an indiginous South American word for Sweet Potato. Batata gave us Potato, the named jumped species. When Batatas became popular they needed a new name and became Sweet Potatoes. ",
            "date": "Answered October 21, 2020",
            "views": "28",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Sandra Wayne",
                    "user_href": "/profile/Sandra-Wayne-26"
                }
            ]
        }
    ]
}