{
    "title": "Is there a following for Rimbaud and Verlaine, as well as the works they produced? - Quora",
    "tags": [
        "Arthur Rimbaud (author)",
        "History Books",
        "Poets",
        "Poetry",
        "Literature",
        "Existence Question",
        "Books"
    ],
    "response": [
        {
            "author_info": {
                "name": "Phrederick Hume",
                "href": "/profile/Phrederick-Hume"
            },
            "answer_text": "There is certainly a following. Both for the poets and their works. But mostly for very different reasons.   Paul Verlaine and Arthur Rimbaud at the ages they met Some real world obligations and complications have kept me away from Quora for a while. Still can't spend much time here for a bit longer, but logging on just now Mac Gander's answer was the first thing on my screen. And  combined with Martin and Guillaume's contributions the question seems pretty well-covered.  This is what makes this a great place to be; honest, educated, informed, clear thinking in the service of sincerely answering a question in an articulate, personal way. Thanks for the reminder. So here's an attempt to add something to the conversation that questions with serious answers deserve.  Sadly there is so much noise to signal around here still that sifting through it can devour so much time that one can't always afford to engage the way one should. Or rather for \"one\" read \"me\", because I can't restrain myself from following the question, answer or simply the prose expanding in front of me onwards till it seems to end.  So here’s so music to listen to while reading if you like:  The inimitable Georges Brassens singing Verlaine's Columbine As an incorrigible quibbler, and lover of literary conversation;  many of us think of Baudelaire as a kind of anti-romantic rather than a late one. Not just the first Symbolist but really the first Modernist. His denial of the Romantic conception of Nature, rejection of the  moral dimension of Art and concentration on gritty, urban, contemporary themes can be seen as a serious break with the Romanic movement and the start of something new. Baudelaire, Verlaine, Rimbaud and Mallarmé (not to mention Lautréamont and Nerval) moved poetry into darker, deeper levels of speculation than probably anyone had before. Or at least since the Elizabethans and Metaphysical poets. And even if no one reads them anymore their influence continues, their lines echoing through every writer they inspired from Oscar Wilde, Pound and Eliot to William Ginsberg and Robert Lowell. And even Richard Hugo (maybe one of the last modern poets  who was literary without being overly academic). And as Martin points out Dylan and Patti Smith. Not to forget the Beatles. Probably the Sex Pistols and whatever great band is flashily resisting the societal status quo next year or in the next century. But this is a quibble.    It is a very good point that the fad for Rimbaud is often more about the personage than the poet. Even here in France, the relationship between Verlaine and his young protégé is known rather better than the latter's poems. (quoting lots of poetry  in conversation all the time as a sort of abominable literary quirk, frequently Le Bateau Ivre, I have met few who recognise quotes from Rimbaud). But the ever-present image of the young man is like an literary version of those Che Guevara T-shirts. Hopefully we can get an idea of why as we go along. Rimbaud as a figure is so flamboyant and remarkable that he will attract the attention even of people who have no interest in poetry at all. The precocious runaway-poet, mocking the morals of common mortals, hashish-smoking and bouncing in and out of prison who abandons poetry to become a mercenary, Ethiopian coffee merchant and gunrunner is just too captivating a character to ignore. Dead at 37 with a leg amputated due to a misdiagnosis. Almost certainly some XXII Century holovid will retell his story to great acclaim. With some scent-reproduction technology stimulating the olfactory nerves to  the liquorice tingle of absinth and the floral perfume of opium smoke. The universal draw for youth (and some of us who won't give up and act our age) is, was and ever shall be: Sex, Drugs and Rock and Roll. And the Verlaine-Rimbaud story has got an abundance of all three. Or in this case Poetry instead of Rock and Roll.    The Bateau Ivre Manuscript  Much of Rimbaud’s poetry is in fact a kind of  Rock and Roll. Not just any kind, but a kind of post Yellow-Submarine (which is in many ways a tribute to Rimbaud’s most famous poem) Acid-Art-Rock. Think Led Zeppelin meets Strawberry Alarm Clock. With a dash of Jethro Tull. Wild, revolutionary, semi-coherent and liberating. But which some might also call undisciplined and juvenile despite their lyrical brilliance. All of his poems were written between 16 and 21 years of age when he gave up writing. It is hardly surprising that young poets often feel a strong kinship with Rimbaud.    An insane ship and drug-fuelled halucinations. Lennon and Rimbaud A remarkable number of 19th century French writers and artists, notably Flaubert and Baudelaire but also Rimbaud, (or a time Verlaine) and later musicians like Erik Satie, were united in at least one common goal; Épater la Bourgeoisie. Call it Bourgeois-baiting. Or Anti-Mrs. Grundyism. Or to shock the narrow self-interested minds of the respectable middle class. They incorporated it into their art. This art has time and again been rediscovered and celebrated by people who are excluded from mainstream society.  In the 19th century  the middle-classes truly came to power. And their values came to dominate the culture of Western Europe and America. Not always for the better. Commercial values often replaced Christian or Humane ones.  Keeping up with the neighbours and appearance became increasingly important. Hippocracy seemed to the artists at an historical high. Judgement by the fellow craftsmen of your guild, other artists, or the sometimes-connoisseur-artisocrats was replaced by the philistine “I may not know X (painting, books, music, architecture...) , but I know what I likes and I can afford to buy what I likes” of the newly-wealthy merchants and industrialists. Writers as disparate as communists, anarchists and royalist reactionaries embraced the Bourgeois-mocking art. And many still do. Whenever a small minority sees itself as a counterculture there is a good chance they will stumble upon the works of Rimbaud, Baudelaire and Co (how ironic  to so label them, at least it isn't Inc. LLD or SARL) and find themselves among kindred spirits.   Sketch of Rimbaud by Verlaine Now that we are so far along in my interminable narrative that the children and internet trolls are hopefully no longer reading, lets address the elephant in the room. Sex. The torrid affair. 17 year old Arthur Rimbaud seduced the 27 year old Paul Verlaine away from his wife and family. This is a racy story that certainly could create a lot of  interest. But the real story here is one not so much of Sex as Sexual Liberation. To many young gay men, particularly artists and writers, Rimbaud has been a hero and an inspiration. And the whole Verlaine-Rimbaud love-story a validation of their own experiences.  They both wrote erotic poems about their experiences and even a couple together. They are not for the shy or easily embarrassed. Sonnet du Trou du Cul (Hombres)   Posthumous edition of Verlaine's erotic poetry Verlaine, who often gets short shrift of attention as on the surface less compelling, is probably the better poet of the two. He had a much longer writing career. His work is surprisingly complex considering its slight, pretty, metrical appearance. It is very difficult to translate well. But very easy to read with a little french and a dictionary. Both the collections Fêtes Galandes and Jadis et Naguerre have some extraordinary poems.  After a long period of poverty and misery, near the end of his life his poems were rediscovered by the public. He was elected to the French Academy and named \"Prince of Poets\". Happily for him, bringing him from the gutter to the aristocracy without passing through the dreaded middle class along the way. And he spent much of his life, alternating between trying to be “normal” (heterosexual) but time and again failing, (in his case falling deeply in love with someone of the same gender). This is an experience sadly shared by many Gays over the last centuries. And by many of the rest of us as well.   Verlaine and His TemptationsPage on gutenberg.org So do they and their works have a following? Definitely. At least more than most poets. Closing with a purely personal observation:If nobody reads much poetry it means that it is dying. If poets--even young MFA candidates--don't read the great poems we have created then that means that it is effectively dead. Fortunately it will still live forever in the minds of those few do actually read those poems. And some, like Mac, will strive to pass that on to future generations. Like the great monks and scribes preserving the knowledge of the Classical Age through countless decades until we were ready for it again. As the Irish say, \"Good on ye\"! ",
            "date": "Answered August 7, 2014",
            "views": "32",
            "upvotes": " View 17 Upvoters",
            "upvoters": [
                {
                    "user_id": "Arthur O. Leão",
                    "user_href": "/profile/Arthur-O-Leão"
                },
                {
                    "user_id": "Zazie Bertrand",
                    "user_href": "/profile/Zazie-Bertrand"
                },
                {
                    "user_id": "John Manning (Student)",
                    "user_href": "/profile/John-Manning-Student"
                },
                {
                    "user_id": "Harrsh Mishra",
                    "user_href": "/profile/Harrsh-Mishra"
                },
                {
                    "user_id": "Dorian Rammer",
                    "user_href": "/profile/Dorian-Rammer"
                },
                {
                    "user_id": "Santiago Lopez de Castro Palomino",
                    "user_href": "/profile/Santiago-Lopez-de-Castro-Palomino"
                },
                {
                    "user_id": "Drew Andrew",
                    "user_href": "/profile/Drew-Andrew-14"
                },
                {
                    "user_id": "Edgar Urrea",
                    "user_href": "/profile/Edgar-Urrea"
                },
                {
                    "user_id": "Humphry Smith",
                    "user_href": "/profile/Humphry-Smith"
                },
                {
                    "user_id": "Guillaume Galuz",
                    "user_href": "/profile/Guillaume-Galuz"
                }
            ]
        },
        {
            "author_info": {
                "name": "Mac Gander",
                "href": "/profile/Mac-Gander"
            },
            "answer_text": "Any serious student or writer of poetry would be familiar with Rimbaud and Verlaine, and as Martin Fox notes, there was a vogue for Rimbaud in the period of the American counter-culture from the 1950s-70s, though this was based more on glamorizing his life and youth than on actually reading his poetry, which is extraordinarily dense and complex. Verlaine joins him, along with Baudelaire, as a key figure in late French Romanticism--a sort of languoer and decadence, along with several other French poets like LaForgue and Nerval, seeped into British and American poetry in the last century.  I don't think anyone really reads much poetry anymore, or follows it much, except serious poets and academics. And even most young poets working on MFAs these days don't seem to be that familiar with the poetry of past periods or other nations. ",
            "date": "Answered August 5, 2014",
            "views": "2",
            "upvotes": " View 8 Upvoters",
            "upvoters": [
                {
                    "user_id": "Raven Lee",
                    "user_href": "/profile/Raven-Lee-108"
                },
                {
                    "user_id": "Harrsh Mishra",
                    "user_href": "/profile/Harrsh-Mishra"
                },
                {
                    "user_id": "Astha Rungta",
                    "user_href": "/profile/Astha-Rungta"
                },
                {
                    "user_id": "Phrederick Hume",
                    "user_href": "/profile/Phrederick-Hume"
                },
                {
                    "user_id": "Christine Leigh Langtree",
                    "user_href": "/profile/Christine-Leigh-Langtree"
                },
                {
                    "user_id": "Alison Bennett",
                    "user_href": "/profile/Alison-Bennett-6"
                },
                {
                    "user_id": "Martin Fox",
                    "user_href": "/profile/Martin-Fox-3"
                },
                {
                    "user_id": "Ankit Sethi",
                    "user_href": "/profile/Ankit-Sethi"
                }
            ]
        }
    ]
}