{
    "title": "Is there a book explaining the subconscious neuroscientifically and not from the perspective of self-help? - Quora",
    "tags": [
        "Subconsciousness",
        "Human Brain",
        "Neuroscience",
        "Book Recommendations"
    ],
    "response": [
        {
            "author_info": {
                "name": "Gregg DuPont",
                "href": "/profile/Gregg-DuPont"
            },
            "answer_text": "The book “What Am I and Why Do I Do the Things I Do?” discusses the subconscious workings of our brains in several areas. It is not in any way dedicated to the topic, but places it in the perspective of its relationship to conscious awareness, the self, human behavior and free will.  Here is an excerpt from the book: “Confabulation has been described in stroke victims that consciously believe that their paralyzed arm is not theirs; they feel that they are moving their arm and this one is clearly just hanging there immobile. One patient became upset when she saw her wedding ring on her immobile arm, because plainly the owner of that arm stole her ring. Other people experience the opposite problem in which their hands act without their control. An area of the brain called the supplementary motor area (SMA) becomes active when other parts of the brain initiate an action. The SMA brings the action to conscious awareness, giving us the feeling that we had the ability to allow or prevent the action from being carried out. When the SMA is damaged on one side of the brain, a person can have an “anarchic hand” because the brain did not tell the conscious mind why it did what it did; the hand seems to have a mind of its own. It might reach out and pick something up when the person’s conscious mind had no desire to do that. Had the SMA been functional they would likely have picked it up anyway, but their conscious mind would have been supplied with a story as to why they “chose” to do that. Affected individuals sometimes tie up their hand to stop it from moving on its own. If the SMA on both sides is damaged, then both hands move with no explanation offered to the conscious mind – no conscious “control” by the hand’s owner. These nicely illustrate how our brain, or “subconscious mind”, makes our decisions for us, often without bothering to let us know about them. (How your unconscious mind rules your behavior by Leonard Mlodinow)” This is a graphic depicting how the subconscious takes information, processes it and shares a small amount of upper level processing (prefrontal cortex, “thinking” or cognitive reflection) with conscious awareness.   More from the book: “The neurons in the brain receive sensory input after it has gone through multiple levels of modification. The brain takes these modified incoming sensory messages and combines them with all the memories of previous experiences to predict the outcomes of various actions. Some species consciously reflect on experiences and the potential consequences of actions, a process that humans describe as “thinking”. This thinking about something, or cognitive reflection, modifies subconscious expectations of the results of various actions, which is then included into new neuronal pathways. The sum total of all the combined automatic neuron responses results in a behavior. The behavior could be to act, or to remain still, or to think more about a situation. Regardless of the seeming complexity of the behavior, it is an automatic response to an impressive number of simultaneous stimuli acting on an unimaginable number of neurons. Even the act of thinking about it was an automatic response resulting from an individual’s situation, previous experience etc.” ",
            "date": "Answered July 2, 2020",
            "views": "128",
            "upvotes": " View Sharers"
        },
        {
            "author_info": {
                "name": "Lucas Jerzy Portela",
                "href": "/profile/Lucas-Jerzy-Portela"
            },
            "answer_text": "The correct term is unconscious, not subconscious. Yes: the entire work of Sigmund Freud (who was, we must always recall with Oliver Sacks, “the greatest neurologist that ever lived”) - go read it, he is a delight to read, writes amazingly well. ",
            "date": "Answered July 3, 2020",
            "views": "22",
            "upvotes": "0"
        }
    ]
}