{
    "title": "Is the Bible the worst book ever written? - Quora",
    "tags": [
        "The Bible",
        "Literature"
    ],
    "response": [
        {
            "author_info": {
                "name": "David Evans",
                "href": "/profile/David-Evans-29"
            },
            "answer_text": "Is the Bible the worst book ever written? Of course not. It has its faults but there are countless books that are much worse. A couple that come to mind are Adolph Hitler’s Mein Kampf and Niccolo Machiavelli’s The Prince. Of the two, of course, The Prince was much better written, even though the ideas presented are deplorable. The problem with the Bible is not with the book itself but with those people who fail to understand what it is. It’s a compendium of Jewish legend and history, of mysticism and poetry, of prophecy and religion. As with all prophetic books, and most mystical books, the language if often allegorical and can be interpreted in many ways. Perhaps that’s why we have so many Christian denominations, all of whom believe that they have the true meaning. When Jesus said, In my father’s house are many mansions, he could well have been predicting such a profusion of confusion. In my opinion the Bible is important reading for anybody who wants to understand the development of Western civilisation (and the reason that development was so often blocked by the Church). It only becomes a problem when fundamentalists interpret it as the literal Word of God. ",
            "date": "Answered March 7, 2018",
            "views": "685",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Maggie Scott",
                    "user_href": "/profile/Maggie-Scott-16"
                },
                {
                    "user_id": "Mickie Southam",
                    "user_href": "/profile/Mickie-Southam"
                },
                {
                    "user_id": "Greg Burns",
                    "user_href": "/profile/Greg-Burns-5"
                }
            ]
        },
        {
            "author_info": {
                "name": "Gabriel Bell",
                "href": "/profile/Gabriel-Bell-18"
            },
            "answer_text": "No. There are far worse books out there than The Bible. The Poetry of Donald Rumsfeld springs to mind as one. Mein Kampf is also up there. And don’t even get me started on The Art of The Deal. Also The Bible contains some beautiful imagery and some very good stories. Where it falls down is when people try to use it to tell others how to live their lives. And when they try to use a book written over two thousand years ago as a guide on how to live their lives today. Times change and we change with them, and something written more than about fifty years ago is generally not a good thing on which to base your life and definitely not something you should use to base your entire belief system. It is not the worst book ever written, if you just treat it as a book, and the stories as just stories. It is only if you try to treat it as more that it becomes somewhat problematic and even dangerous. ",
            "date": "Answered March 8, 2018",
            "views": "282",
            "upvotes": "0"
        }
    ]
}