{
    "title": "Is the NCERT enough for the JEE Mains 2022? - Quora",
    "tags": [
        "National Council of Educational Research and Training (NCERT)",
        "Joint Entrance Examination Main",
        "JEE Preparation",
        "Joint Entrance Examination"
    ],
    "response": [
        {
            "author_info": {
                "name": "Bhuvan Bokka",
                "href": "/profile/Bhuvan-Bokka-1"
            },
            "answer_text": "Many people say that doing NCERT thoroughly is more than enough for JEE Mains, but let me tell you that it is just enough for qualifying in Jee Mains, and it's hard to get a score above 200 only by NCERT. Definitely, the JEE Mains question topics and concepts won’t be out of NCERT. I would say that NCERT is more than enough for Chemistry in Jee mains. But, for maths and physics, I would say read NCERT and be thorough with the concepts from it and then you should definitely do questions from other sources and not only NCERT. Firstly, get your concepts cleared and then try to do more and more questions of different models from any source ( Coaching Institute Materials, Previous year questions, Reference Books,etc.). but, remember to stick to one or two question sources for practice and try to finish them rather than doing only a few questions in multiple books. Wishing You ALL THE BEST! ",
            "date": "Answered October 6, 2020",
            "views": "45",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Rakesh Ghanshala",
                    "user_href": "/profile/राकेश-घनशाला-Rakesh-Ghanshala"
                }
            ]
        },
        {
            "author_info": {
                "name": "Naztro Jinxing",
                "href": "/profile/Naztro-Jinxing"
            },
            "answer_text": "In Chemistry - Yess with some previous year papers. Remember each and every line,diagram,table of it can be a potential question,so prepare like that. In Physics: To some extent but u can't just rely on NCERT,u have to do some extra stuff specially for mechanics, Waves, Magnetism and Modern. Don't just rely on NCERT Maths: A big no. Yes u may attempt question of Integration before u move on to other books for practicing integration but rather than that it's not advisable. Do it for some chapters u have some problems.But largely don't follow it for Mains perspective. A big advise: Do previous 15 years chapter wise questions. U will find min 10 ques repeated in each subject. Means 120 marks direct no extra efforts All the best ",
            "date": "Answered October 5, 2020",
            "views": "61",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Rakesh Ghanshala",
                    "user_href": "/profile/राकेश-घनशाला-Rakesh-Ghanshala"
                }
            ]
        }
    ]
}