{
    "title": "Is the CPA required to be an accountant? - Quora",
    "tags": [
        "Certified Public Accountants (CPA)"
    ],
    "response": [
        {
            "author_info": {
                "name": "Mark Ng",
                "href": "/profile/Mark-Ng-26"
            },
            "answer_text": "I can share with you what will happen in Singapore and China. Guess you are probably in another country but you could take this as a reference. In singapore, you can be an accountant as long as you take some basic courses in accounting and your employer (often small enterprises) do not mind you do not have a specialized accounting degree or CPA. But then, you will find your pay be in the range ~S$2200-2500 initially. As you become more experience and proficient, you could get S$3000 easily by 30 year old and ~S$4000-4500 by 40 year old. Thereafter your salary will peak and progress with inflation. If you are a CPA, you will easily earn S$6000 when you are 30 year old. Doors will open for you to enter bigger, more prestigious employers and they may consider and/or train you for bigger positions such as CFO, Financial Controllers, VP(Finance), Finance Directors....you get the picture. Depending on the opportunities you get and how you progress, you could be earning anything from S$8000-20000 per month when you are 40 year old. At 50-60, you could either be a highflier earning S$500,000-1,000,000 per year or get retrenched because you are now too expensive to be a Finance Manager. US$1 ~ S$1.43  In China, CPA is a post-graduate certification, just like in Singapore. China's CPA exams are notoriously difficult to restrict the number of people who pass. Therefore, the most important indicator is where you graduate from. If you graduate from a first-tier university, earning 20-25k RMB per month is possible at 30 even without CPA. If you graduate from a 3rd tier college, you are probably looking at 6-8k RMB per month. But if you are a 3rd tier college and manages to get CPA, you can easily earn 20-50k RMB per month if you are willing to work hard and join \"progressive companies\". If you want to become a partner at big 4, you need a CPA. Otherwise, you can remain as a big 4 manager earning ~40k RMB per month (big 4 recruits from the best schools only). Concluding, the demand and supply of CPAs and jobs are such that, at 20-40k RMB monthly jobs, you can go without a CPA as long as you graduate from a top business school. But if you are aiming to be the likes of a CFO/Finance Director earning over 100k RMB per month, a CPA is likely needed. US$1 ~ 6.6 RMB   So I recommend you to work hard and get a CPA. Don't regret your 30+ years of career over a few years filled of fun!   ",
            "date": "Answered January 28, 2016",
            "views": "648",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Gene Berry",
                "href": "/profile/Gene-Berry"
            },
            "answer_text": "As an accounting professor for 30 years I can say that a CPA is not required to be an accountant but is required if you want to practice accounting to the public, e.g., certify financial statements.  However, many would say that a CPA is desirable as it will clearly enhance your credentials and job prospects as it would reflect that you have mastered a certain body of knowledge.  For work in the corporate sector a CMA is a viable alternative but probably not as respected.  As an internal auditor the CIA is a viable alternative but also probably not as respected.  A CPA with either of these would be even better but a lot more work for you. ",
            "date": "Answered February 5, 2016",
            "views": "239",
            "upvotes": "0"
        }
    ]
}