{
    "title": "Is the book Living By The Point Of My Spear (Book) By Zaki Ameen (author) controversial about prophet muhammad and islam ? why? - Quora",
    "tags": [
        "Zaki Ameen (author)",
        "Living By The Point Of My Spear (Book) By Zaki Ameen (author)",
        "Books About Religion",
        "Muhammad (Islamic prophet)",
        "Islam",
        "Books"
    ],
    "response": [
        {
            "author_info": {
                "name": "Hassy Husk",
                "href": "/profile/Hassy-Husk"
            },
            "answer_text": "According to the person Zaki Ameen and his books on Islam, his book claims that Zaki Ameen is a former Muslim Imam, who has left Islam and has decided to educate us Muslims and non-Muslims about the evils of the religion of Islam(Naauzo billah). We spoke about the fake ex-Muslim phenomenon earlier, but here I would like to summarize some of its dimensions:1. Muhamed Amin Zaki (1880-1948) was a kurdish author and this person has taken the same name to promote his poor knowledge about Islam. Which is by itself is evidence that he is nowhere a Muslim or not even close to any Muslim person.  Even he does not know the complete name to Prophet Muhammad (Sallallahu Alaihi Wasallam) and which is already known by many earlier historians and authors of whole world but he tries to refuse the credential of all great authors of the world and calling those authors as ignorant. 2. Fake former Muslims are used to deceive Muslims and Non-Muslims who are not knowledgeable about Islam. It is a tactic that makes Common person more open to the proselytizing efforts of Missionaries, thus making them prime for conversion. Dramatizations using actors pretending to be ex-Muslims are used as authorities on Islam. Anyone with a cursory familiarity recognizes the deceptiveness of this tactic.3. Muslims who are either very secular and not very knowledgeable or are non-practicing/cultural Muslims, meaning Muslims in name only, are propped up as experts on Islam. Further scrutiny reveals their “criticism” of Islam to be lifted, sometimes verbatim, from anti-Muslim ideologues, websites, books, and other materials.4. Obvious fraudulentpeople who were never Muslims or who are or were Christian but pretending Muslims as we know in gulf countries and Pakistan, are trotted out as experts on Islam, ostensibly (not related to fact) providing the audience with an insider’s view of the reality of Islam. Further investigation reveals the falsity of their claims. Islam phobia seems to be big business on the way to being socially main stream, yet time and time again we have seen these so-called Muslims exposed as frauds, so-called experts who can’t even get fundamental facts about Islam straight.Examples include 1- Atheist Wafa Sultan who is an atheist raised as an Alawi, pretending to be Muslim2- Mehmet Ergun Caner trying to pretend to speak Arabic to unsuspecting American audiences, deceiving them to the contents of Qur’an, hadith, and bungling simple details that a 3-year-old Muslim child would get right3-Walid Shoebat pretending to be a former terrorist, exposed as a liar about his extremist past. and Mark A. Gabriel, a supposed former Al-Azhar scholar and imam, who lifts Orientalist and Christian Missionary polemics and misinformation almost verbatim.4. In an ongoing effort to present Fraudulent people as Muslims and as representative of normative Islam, we are presented with former extremists, who all of a sudden are to be considered ‘alim. Since when is extremism(ghuluw) Islam?5. Anonymous supposed ex-Muslims such as “Ibn Warraq” and “Dr” “Ali Sina” are presented as experts on Islam. The dangers of steeping outside the tradition of Islam in order to understand it are well-known, as it invariably leads to extremism of many types, but how are we really sure that anonymous people claiming to be former Muslims, displaying a serious lack of knowledge of Islam and scholarly credentials, were really ever Muslims? ",
            "date": "Answered September 9, 2015",
            "views": "511",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Imran Shaik",
                    "user_href": "/profile/Imran-Shaik-1"
                },
                {
                    "user_id": "Juveria Khan",
                    "user_href": "/profile/Juveria-Khan-6"
                }
            ]
        },
        {
            "author_info": {
                "name": "Lesedi Mulder",
                "href": "/profile/Lesedi-Mulder"
            },
            "answer_text": "Living by the Point of My Spear  Zaki Ameen dedicated his life to Islam. He was raised as a Muslim and studied for a degree in Sharia law, in order to become a qualified Imam. Zaki earned his living from preaching and teaching the principles of Islam, working as an Imam in Egypt, Iraq, Yemen and many gulf states. In the course of his career as an Imam, he started to realise how the teaching of Muhammad and the Quran were used to deceive followers, in order to gain control, money and power. It was with deep agony that he realised what a fool he had been and how he had been brainwashed by a system that had been refined over centuries and how he had, in turn, brainwashed others. Zaki left Islam and the Mosques and emigrated to the United States, to start a new career and a new life. He became a tax payer making a positive contribution to society. He now saw that being an Imam was like being a parasite, spreading lies and encouraging others to spread the lies of Muhammad. Zaki started to accept, respect and love people as they are, without prejudice. He accepted all people as equals, including Muslims, whether they obeyed the orders of Allah, or not. This was a genuine love he had never felt before, unfettered by doctrine or religion. What happened on 9/11 shocked him to his core and it was shortly after that that he realised he could not simply stop following Muhammad, but he had to do more. He became obsessed and haunted by an irresistible urge to let the world know what he had discovered about Muhammad and Islam. Thus began the journey to write a true biography of Muhammad and the true story of Islam – a long and dangerous journey to write, translate and publish the book that became Living by the Point of My Spear. ",
            "date": "Answered May 25, 2019",
            "views": "54",
            "upvotes": "0"
        }
    ]
}