{
    "title": "Is there a novel in which there is more than in life? - Quora",
    "tags": [
        "Novel Recommendations",
        "Novels",
        "Books"
    ],
    "response": [
        {
            "author_info": {
                "name": "Sharyn O'Connell",
                "href": "/profile/Sharyn-OConnell"
            },
            "answer_text": "I guess it depends on the interpretation of your question and your phrasing. I’m taking this to mean is there a book that contains more species and concepts than exist “in life”. I love fantasy, paranormal/supernatural, steampunk and urban fiction books, and they all contain lots of stuff not found in life: witches, trolls, dragons, vampires, wizards, elves, werewolves, shapeshifters, magic, telekinesis, mind reading, dwarves, gnomes, hobbits, time travel, inter dimensional travel, talking animals, gargoyles, personification of abstract concepts (like Death from the Discworld novels—who’s one of the best characters ever in my opinion), world-creating lions (Aslan of Narnia fame), faeries, people who raise the dead, zombies, magical healers and more. If you mean, is there a book that contains more human complexity than exists in life (i.e. explores more ideas about the human condition than actually exist in real humanity), then no, I’m not aware of any, and I can’t conceptualise how there could be. Humans write books, so anything they explore about what it means to be human is going to be located in what they can conceptualise and express about their world and what it means to be human. All of those things (love, death, grief, loss, growing up, growing old, gratitude, generosity, dreams, goals, relationships, sex, gender expression, betrayal, rage, disgust, pettiness, jealousy, transcendence, faith, belief, values, ideology et cetera) can be explored in beautiful, profound, amusing, insightful, horrific, shocking and entertaining ways, but they’re still likely to be found somewhere in life as well as in a book. ",
            "date": "Answered December 14, 2018",
            "views": "75",
            "upvotes": "0"
        }
    ]
}