{
    "title": "Is the new Dan Brown book 'Origin' worth reading? - Quora",
    "tags": [
        "Origin (novel)",
        "Dan Brown (author)"
    ],
    "response": [
        {
            "author_info": {
                "name": "Nema Lasaria",
                "href": "/profile/Nema-Lasaria-1"
            },
            "answer_text": "I’ve just finished reading it. If you have plenty spare time this book is quite worth to read. Its premise intrigued me. However, after I reached to the chapters that reveal the hidden secret I was disappointed. The secret was not so much of a secret as it was a theory. Scientifically, everyone’s already knows about “the origin of life” as theorized by Edmond Kirsch. The book only add the element of entropy which as a common person I don’t really understand the significant of it. So, yeah for me it’s just a gibberish physics and not an earth-shaking founding. The thing about “where humanity is going” was, for me, just too mundane. Most people must have thought about “that”. There are literally tons of science fiction movies and games using “that” theme. In Brown’s universe the prediction becomes more terrifying because Edmond Kirsch was known for his spot on prediction through his simulator, I know. But for us the reader, the revelation was just super meh. Nothing controversial at all! I prefer the speculated theory from chapter something (I forgot) that earth humans were actually born from a genetic seed pod sent by the real and more advanced humanity from far away space in order to save human race from extinction. THAT, is ground-breaking. After reading many Brown’s books I come to realize that he’s ALWAYS using the same formula over and over again. Granted, I only read The Da Vinci Code, Angel & Demon, Inferno, The Last Symbol, and Origin. I’m not saying that it’s bad, but after so many books the formula seemed rather cliche. Those books always contain this: Someone famous who knows the truth about something, this famous person usually die in the beginning of the book through some dramatic chapter/sA beautiful (usually) foreign female sidekick that has direct connection to the mystery itself or to the famous person who died as said in point one.An assasin/killer/hitter that is so cruel and killing people as if they’re flies. They’re usually just a pawn. They were just fulfilling a mission given to them by mysterious person behind the curtain. These assassins were usually a broken person, tortured, having a very dark past, and very devout to the goal of the person behind the curtain. This is the part that I hate the most. They had killed so many people and they usually died/were killed without any remorse and without realizing that they were just a pawn.A mysterious organization/person that is the actual antagonist. They are usually very influental people and sometimes a respected member of society.An anti-hero. Usually police, interpol, private security, or royal guards. Langdon WILL ALWAYS step on their foot in the beginning of the books and instead of communicating or explaining, he usually chooses to run.There will always be running around scene through old city full of art and symbols.So the plot is always like this: Someone famous that know some secret died.Langdon meet a sidekick lady through some dramatic event.He and sidekick lady run because they’d like to pursue the real truth.Some authority pursues Langdon and the lady because they think Landon and the Lady killed the famous person or steal something from a scene that happened after the fateful event in point 2.Some assassin/killer pursues Langdon and the lady and get killed. They are usually at odd with the authority.Langdon and the lady found the truth.The twist is the one who send the assassin is actually this XXX person!! Shocking!The end.",
            "date": "Answered October 8, 2017",
            "views": "14",
            "upvotes": " View 9 Upvoters",
            "upvoters": [
                {
                    "user_id": "Rivnat Chowdhury",
                    "user_href": "/profile/Rivnat-Chowdhury"
                },
                {
                    "user_id": "Vineet Maitrey",
                    "user_href": "/profile/Vineet-Maitrey"
                },
                {
                    "user_id": "Felipe Sanchez",
                    "user_href": "/profile/Felipe-Sanchez-29"
                },
                {
                    "user_id": "Khurshid Ah Wani",
                    "user_href": "/profile/Khurshid-Ah-Wani"
                },
                {
                    "user_id": "Aditya Nirmal",
                    "user_href": "/profile/Aditya-Nirmal"
                },
                {
                    "user_id": "Irfan P",
                    "user_href": "/profile/Irfan-P-1"
                },
                {
                    "user_id": "Lakshmi Savitha",
                    "user_href": "/profile/Lakshmi-Savitha"
                },
                {
                    "user_id": "Karishma Mansukhani",
                    "user_href": "/profile/Karishma-Mansukhani-4"
                },
                {
                    "user_id": "Yasir Hasan",
                    "user_href": "/profile/Yasir-Hasan"
                }
            ]
        },
        {
            "author_info": {
                "name": "Shruti Pramod",
                "href": "/profile/Shruti-Pramod"
            },
            "answer_text": "After having read all of Dan Brown’s previous works, reading his latest “Origins”, while a page turner felt very formulaic. Dan Brown needs to rejuvenate his stock story template ASAP. Now, I’m not expecting great prose from a Dan Brown novel but at least a varied plot framework would be freshening.Not just that, even the character profiles are repetitive.  Don’t believe me?! … Read on for my comparison below: 1. In Angels and Demons, Inferno and Da Vinci Code it was Italy galore(Florence, Pisa, Vatican, Rome, Venice).In Origins it is Spain galore (Seville, Bilbao, Madrid & Barcelona)Maybe his next novel needs to find a more refreshing Asian/Australian/African/Middle Eastern setting instead of a European country. 2. Heavily focussing on an artist and his works (In some it is Leonardo Da Vinci, Botticelli, Michelangelo etc) and now in Origins it is Antoni Gaudi. 3. A dark character (employed by a higher overlord) brainwashed into thinking that he is fighting for a worthy cause after having been saved from the personal demons of his past.Ex: Silas the albino in Da Vinci code, Hassassin in Angels and Demons and now it is Admiral Luis Ávila in Origins. 4. The protagonist pair of Robert Langdon and a female companion in shock (in the light of a recent murder or sensational killing) requesting his help in unriddling the codes and patterns in the race against time (Sophie in DaVinci Code, Vittoria in Angels and Demons, Katherine Solomon in The lost symbol and now it is Ambra Vidal in Origins) 5. His novels being a wikipedia of symbols, anagrams, icons and the ever present conflict between Religion and Science. 6. The overlords who hired the killers having code names like Janus in Angels and Demons, The regent in Origin, The teacher in Da Vinci Code etc. 7. Barren women characters like Ambra Vidal in Origins and Elizabeth Sinskey in Inferno. 8. Controversial and Sensationalist cults like the Illuminati in Angels and Demons, Opus Dei in Da Vinci Code, the Palmarian church in Origins etc.  Having stated all of the above cons, I still read his works because it enlightens me of advances in technology that aren’t quite mainstream to the plebeians. For instance in this book it was bone conduction headphones, quantum computers, signal jamming and boosting devices, technium - 7th kingdom of life etc. ",
            "date": "Answered December 5, 2017",
            "views": "990",
            "upvotes": " View 4 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Lalan",
                    "user_href": "/profile/Lalan-9"
                },
                {
                    "user_id": "Raavan",
                    "user_href": "/profile/Raavan-8"
                },
                {
                    "user_id": "Khurshid Ah Wani",
                    "user_href": "/profile/Khurshid-Ah-Wani"
                },
                {
                    "user_id": "Somya Saluja",
                    "user_href": "/profile/Somya-Saluja-2"
                }
            ]
        }
    ]
}