{
    "title": "Is Vladimir Putin anti-Islamic? - Quora",
    "tags": [
        "Vladimir Putin",
        "Belief and Beliefs",
        "Russia",
        "Islam"
    ],
    "response": [
        {
            "author_info": {
                "name": "Harrison Elfrink",
                "href": "/profile/Harrison-Elfrink-1"
            },
            "answer_text": "He is as “anti-Islamic” as your typical Western Leader. He fights against Islamist groups and prevents them from becoming influential within Russian borders. He also befriends Muslim groups, leaders, and nations who are on Russia’s side of things. One thing to keep in mind is that he rose to power in the midst of the Second Chechen War, so this has a lot of bearing on his relationship with Muslims, especially those within Russian borders. He has a very nuanced relations with Muslim groups. He supports conservative pro-Sharia Muslims like Ramzan Kadyrov, even though he might go against and ban more liberal Muslim organizations like the Fethullah Gulen Movement. It depends on where they stand on the political equation. His relations with Muslim countries and world leaders also follows a similar rythm. ",
            "date": "Answered October 1, 2019",
            "views": "66",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Tariq Bakyl",
                    "user_href": "/profile/Tariq-Bakyl"
                }
            ]
        },
        {
            "author_info": {
                "name": "Daniel A Pennuto",
                "href": "/profile/Daniel-A-Pennuto"
            },
            "answer_text": "Probably not, bearing in mind the 10m Muslims in Russia (where Islam is very long established), the blossoming of economic and political relations between Russia and Iran and the intervention in Syria. Might be worth peeking at Putin’s words on the matter, rather than words on Putin of others. Traditional Islam is an integral part of Russia’s spiritual life ",
            "date": "Answered May 9, 2019",
            "views": "85",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Vladimir Lebedev-Schmidthof",
                    "user_href": "/profile/Vladimir-Lebedev-Schmidthof"
                },
                {
                    "user_id": "Rishabh Kumar",
                    "user_href": "/profile/Rishabh-Kumar-795"
                }
            ]
        }
    ]
}