{
    "title": "Is Watchmen set in an alternate universe? - Quora",
    "tags": [
        "Watchmen (creative franchise)",
        "Watchmen (2009 movie)",
        "Watchmen (graphic novel)",
        "Parallel Universes"
    ],
    "response": [
        {
            "author_info": {
                "name": "Josh Barker",
                "href": "/profile/Josh-Barker-21"
            },
            "answer_text": "In what context? To us? Because then… yes. Of course that is the case. Seeing as how virtually none of the events that take place within the comics have happened in real life. We have no Doctor Manhattan (Jon Osterman) winning the Vietnam War.  No police strike due to “costumed adventurers” (Police Strike of 1977).  So no Keene Act (Keene Act) outlawing them.  No third term for Nixon. No alien materializing in New York City. No world peace. It is very clear that in that context… Watchmen (Watchmen) is set in an alternate universe. As the events of the series are not our history. Now if you mean is it an alternate universe in the context of comics. Then it depends. Originally, the series would not have been an alternate reality to anything. Since it is a self-contained story, that just happens to be produced by a larger comics company. That happens to incorporate alternate realities (Multiverse). We know that it is not a part of the larger DC multiversal canon at the time… because at the time of its printing there was no longer a DC multiverse. Due to the events of Crisis on Infinite Earths (Crisis on Infinite Earths).  Which in ended in March of the same year as the first issue of Watchmen. So at least in that sense it was not created to be an alternate universe to anything. Was it an homage? Yes. But that by no means makes it an alternate universe. Is it now an alternate universe? Sure. The Doomsday Clock (Doomsday Clock (comics)) storyline has brought it into the larger DC multiversal canon.  So in that sense it is. Short answer, depends on the context. Sure, now it is. Though it was not originally intended to be. ",
            "date": "Answered October 3, 2018",
            "views": "587",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Ankur Saikia",
                    "user_href": "/profile/Ankur-Saikia-60"
                },
                {
                    "user_id": "JJ Hood",
                    "user_href": "/profile/JJ-Hood-1"
                },
                {
                    "user_id": "Steve Jones",
                    "user_href": "/profile/Steve-Jones-235"
                },
                {
                    "user_id": "Dallas Nairne",
                    "user_href": "/profile/Dallas-Nairne"
                }
            ]
        },
        {
            "author_info": {
                "name": "James Perkins",
                "href": "/profile/James-Perkins-31"
            },
            "answer_text": "Oh absolutely yes! The prescise divergence point isn’t clear. But, inspired by the superhero comics of the late 1930s, a handful of costumed vigilates begin solving crimes, beginning with Hooded Justice. The superhero fad dies pretty quickly, and the primary narrative theme of comics is instead centred around pirates - if superheroes are real, comics needed something else for escapist fantasy. In 1960, an accident in a dimensional physics lab killed a young scientist named Jon Osterman. But he is able to reassemble his body and becomes the setting’s only real Superbeing with the codename Doctor Manhattan. He becomes a US governments asset, and greatly stenghtens the US position in the Cold War. JFK is killed the same time and way in this world, but by The Comedian - presumably with CIA backing. Nixon is the President from 1965 to 1989. With Doctor Manhattan's intervention the US wins in Vietnam and becomes the 51st state. 1978 there's a police strike, and Senator Keane sponsors a bill to ban vigilates - it passes and the costumed adventures either retire or become government agents. Only Roaschach stays active. The present-day of the story is late 1985, and the world is on the brink of nuclear war after the USSR moves from Afghanistan into Pakistan. Rorschach is convinced that there is a conspircay against masks like him - but it is so much more… Beyond this there's lots of secondary materials of varing quality and canonicty. ",
            "date": "Updated June 12, 2020",
            "views": "64",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Jenniffer Engle",
                    "user_href": "/profile/Jenniffer-Engle"
                }
            ]
        }
    ]
}