{
    "title": "Is War and Peace truly the greatest book ever written? - Quora",
    "tags": [
        "War and Peace (1869 book)",
        "Peace",
        "Novels",
        "Literature",
        "Warfare",
        "Reading",
        "Military History and Wars ",
        "Book Recommendations",
        "Books"
    ],
    "response": [
        {
            "author_info": {
                "name": "Simon Burgess",
                "href": "/profile/Simon-Burgess-3"
            },
            "answer_text": "I think it’s up there. I disagree with the other answer that there aren’t ways of objectively assessing literary greatness. Tolstoy in War and Peace and Anna Karenina does the extraordinary. Narrative drive. Great story arcCharacter development is exceptionalZeitgeist. You know Russia at that timeThese two books stay with you, they’re exemplars of great novels, stories you have to finish, characters you may not sympathise with but who are complex and utterly human, and a historical sweep that gives you a real authentic feel for the time and place they are set. Everything of human life is in these books. ",
            "date": "Answered September 30, 2019",
            "views": "139",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Pallavi Alai",
                    "user_href": "/profile/Pallavi-Alai"
                }
            ]
        },
        {
            "author_info": {
                "name": "Tom Meier",
                "href": "/profile/Tom-Meier-18"
            },
            "answer_text": "Greatness is not like height, a one dimensional quality which can be objectively measured. When you speak about something like a book or a film which has many aspects of quality to consider you can only say one is better than another in a particular narrowly defined way. Whether a person thinks ‘War and Peace’ is the greatest book says more about that person’s priorities and interests than it does about any objective quality the book has. ",
            "date": "Answered September 30, 2019",
            "views": "33",
            "upvotes": "0"
        }
    ]
}