{
    "title": "Is Zero to One by Peter Thiel worth reading? - Quora",
    "tags": [
        "Zero to One (2014 book)",
        "Peter Thiel (businessman)",
        "Entrepreneurs"
    ],
    "response": [
        {
            "author_info": {
                "name": "Venugopal Murali",
                "href": "/profile/Venugopal-Murali"
            },
            "answer_text": "Yes. I finished the book yesterday and do think it s worth a read.  The reason: The book gives us some inkling on what a master businessman like Peter Thiel looks into before investing in a business. Some of the things that I gleaned from the book are: a) Build companies that go from zero to one. In other words, companies that are not replicas of  other companies which are already in the marketplace. Example given, Amazon and Paypalb) Thinking for yourself is the most contrarian thing out there.c) Sales are important. Do not neglect it.d) If you are trying to improve something that is already out there, ensure that it is 10 times better than the product out there.e) It helped me look at the world in terms of the 'power law'.f) Do not be good at many things, be very good at one thing. g) It pays to be the last entrant in a field. Ex: Google These are some of the things that made this book a compelling read. If you read the book, you might find other things that are equally compelling. ",
            "date": "Answered September 21, 2014",
            "views": "82",
            "upvotes": " View 47 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Rakib Islam",
                    "user_href": "/profile/Rakib-Islam-55"
                },
                {
                    "user_id": "Medha Nalekar",
                    "user_href": "/profile/Medha-Nalekar"
                },
                {
                    "user_id": "Prithivi Raj Kumar",
                    "user_href": "/profile/Prithivi-Raj-Kumar-2"
                },
                {
                    "user_id": "Shunjie Yang",
                    "user_href": "/profile/Shunjie-Yang-1"
                },
                {
                    "user_id": "Gangadharan Nadar",
                    "user_href": "/profile/Gangadharan-Nadar"
                },
                {
                    "user_id": "Hardik Thakkar",
                    "user_href": "/profile/Hardik-Thakkar-61"
                },
                {
                    "user_id": "Sanjay KB",
                    "user_href": "/profile/Sanjay-KB-3"
                },
                {
                    "user_id": "Sai Nath",
                    "user_href": "/profile/Sai-Nath-123"
                },
                {
                    "user_id": "Ed Finch",
                    "user_href": "/profile/Ed-Finch-7"
                },
                {
                    "user_id": "Lokesh Behera",
                    "user_href": "/profile/Lokesh-Behera-3"
                }
            ]
        },
        {
            "author_info": {
                "name": "Krishan Sharma",
                "href": "/profile/Krishan-Sharma-29"
            },
            "answer_text": "Let me be straight this book is not only worth reading this is the best book on startups given the lessons it provides to us regarding startups and the history of how technology was used to renovate the world we live in today's date. Even amazing is the fact that it is not even a book. These are notes taken by Blake Masters (a student of Peter Thiel’s series of lectures on enterpreneurship). So you will never get a feel that there is clichéd advice being given in the book rather the book is filled with examples ; great examples. Like book details every how ;of what conspired in those 2 decades. What is not there in the book Google, paypal, tesla, palantir, facebook…… I got so inspired and overwhelmed with such precise information that i ended up making a video on it.  This one. Believe me the book is a gem and it is around 250 to 300 pages only. If you don't read this book you are missing two of the most promising decades of human era. ",
            "date": "Answered May 24, 2020",
            "views": "430",
            "upvotes": " View 2 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Siva Keddi",
                    "user_href": "/profile/Siva-Keddi"
                },
                {
                    "user_id": "Shunjie Yang",
                    "user_href": "/profile/Shunjie-Yang-1"
                }
            ]
        }
    ]
}