{
    "title": "I’m a 2021 NEET aspirant in a confused state for chemistry. Should I read NCERT or any other books? - Quora",
    "tags": [
        "National Council of Educational Research and Training (NCERT)",
        "National Eligibility cum Entrance Test (NEET)",
        "Book Recommendations",
        "Books"
    ],
    "response": [
        {
            "author_info": {
                "name": "Gaurav Kumar",
                "href": "/profile/Gaurav-Kumar-6893"
            },
            "answer_text": "2020 paper of neet was focused only on ncert . Ncert is bhagwat geeta of neet ,if you (rat ke chat gayo to tera government college me ho gaya). Chemistry very very easy(one who revised and just went to write the exam 21 topoo ki salami use, and the one who wasted time on rc mukarjee and bade bade book in hard question ). So i will advice you to read biology and chemistry well from ncert (being a chemistry student i will advice you to solve all the example and excersise questions of ncert textbooks and if you have more time then read some good book like solomons and fryhl . Biology read only ncert and solve questions banks and analysis them in a proper manner . For physics first read theory and practice numerical ( ettna solve kro ki formula yadd aa jaye) for physics you can solve allen module and hc verma or dc pandey . Give mock test before the exam in a fix duration and be confident before exam ( bht sare log confidence ki kami ke karan barbad ho jate atta sv kch hai) . Neet is exam only to test your speed and accuracy. All the best to all my small brother and sisters wishing you all a great success in neet 2021 ",
            "date": "Answered September 15, 2020",
            "views": "168",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Kumu C",
                "href": "/profile/Kumu-C"
            },
            "answer_text": "In my opinion, definitely you have to focus more on NCERT textbook and it is more than enough. Most of questions in NEET are asked from NCERT textbook itself so understanding the concept given in textbook is very important. For my preparation, Iam using online bookstore to buy my NCERT textbooks ie mypustak. It is one the best online site where we can buy books for free except the shipping charge. So, it has made by preparation easy in selecting my required book at affordable cost. We can also donate our old books to mypustak which will be later useful for many users. #mypustak  ",
            "date": "Answered September 19, 2020",
            "views": "37",
            "upvotes": "0"
        }
    ]
}