{
    "title": "What is that one thing you want to change in your life? - Quora",
    "tags": [
        "Important Life Lessons",
        "Experiences in Life",
        "Life and Living",
        "Life Advice"
    ],
    "response": [
        {
            "author_info": {
                "name": "Karen Rider",
                "href": "/profile/Karen-Rider-7"
            },
            "answer_text": "The number 1 thing I would want to change, if I could, would be the ability to be happier about nothing in particular. To be able to realize and feel that there is no reason to be sad/overwhelmed/emotional etc. There are too many times lately that I get caught up in my own head, caught up in my own emotions and they become so strong that it seems there is nothing I can do about them. So in essence, what I would like to change most in my life is myself. I want to get better at handling my emotions and not try to ignore them. I want to be able to be fine, no matter how I feel. I want to not be overwhelmed and sad and miserable. I want to get outside of my own head. And I wish I could do this alone, but experience is teaching me that the more I try to do this, the worse it gets. The thing I do if I get upset is usually the following: I have a tendency to not want to share whatever negative feeling it is with anybody andto hide awayI try to distract myself but find out that nothing works, because I am doing whatever I can to try ‘avert’ the emotion, which is destined to fail in itself.I wish that in that moment I could stop myself from my automatic responses and take action. I wish that I could include whatever it is I’m feeling with another human being, especially the one person that is the closest to me. Because, rationally, I know that sharing and talking about it helps. I know this because there have been times when I have taken action (let the other in) and there is no evidence to believe or act on the idea that reaching out did not help, but I am a fool. Something inside me vehemently opposes letting ‘the other’ inside, something inside me so strongly wants to avoid taking that action that would constitute 1. making myself feel better and 2. not sabotaging myself any longer. But history shows that I am bad at taking initiative when I am in that kind of mood. I feel too vulnerable and more than anything too afraid and I feel too tense to realize that there is a way out. So I find myself stuck more times than I am comfortable admitting and more times I can count. I try to change and improve but it’s not easy. It’s damn hard. It seems the more I try, the worse it gets. I wish that I could find my way out (even if it’s just a little bit) when it happens and I wish that I could stop myself from getting caught up in my own head. I wish I could take action without (over)thinking. If I could manage that, I think I can be happy for no particular reason. And I would like that very very very much. ",
            "date": "Answered August 31, 2020",
            "views": "56",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Priyanka Yadav",
                "href": "/profile/Priyanka-Yadav-167"
            },
            "answer_text": "I am 22 years old and the only thing that I would like to be changed is my perception to look at problems and deal with them. Change is necessary and it is the universal fact. Nothing stays the same for long, life is full of changes obviously. But we “the people” are the ones who try to escape this truth more often. We want to be stuck in just one phase of life because it’s happening, we have our friends and family with us and everything is just smooth and perfect like a fairy tale. For example- Three years back I found this amazing boy in my college and I proposed him to be my boyfriend. He agreed and we came in relationship in august 2013. He was my first boyfriend ever and everything was great, it was like magic and life was suddenly full of beauty. Just one month after this my elder brother read my messages and he came to know about my relationship with this guy. As my family is a conservative one just like 80% of the Indian families, he told this to my mother and she just started torturing me with all those senseless emotional crap. This made me nervous and I broke up with him even when I didn’t wanted to. But he was a man of strong will and clear mind. He explained the scenario to me and I agreed to come back. Everything was back to perfect but now I was changed as a person. I wanted things to be my way, I never wanted my family to know about my relationship. This thought creeper so badly inside me that I started fighting with my love for no reason and broke up with him every next month. Only he was the one who somehow tackled me and kept teaching me the right thing to do. Yet it was my first ever relationship and I had already spent 19 years of my life with a conservative and senseless family. I was aimless and just got a back in one of my subjects of engineering second semesters before I met this guy. He offered to help me and asked me if he could teach me to clear this subject. But I refused telling him that my parents will never allow me to come to his house or him to come over at my place. He agreed with a small smile and I failed in the subject again. This time I had just one more chance left to clear my subject or else I would get a semester back. In June 2014, I had my exams and it all really creeped me out with the relationship thing and my family pressurizing on me. I was really weak at this subject and prepared really hard for it. But the morning I had my exam, my boyfriend texted me to wish me luck and some lovely word to cheer me. Unfortunately my brother read it again and I got nervous so badly That I forgot everything. I called my boyfriend and yelled at him for messaging me. Following morning my exam went worst and I broke up with this guy thinking that he is the reason for all this mess in my life. But the truth was something else. He cried when I broke up with him but never punished me or said anything bad in return. After a month of our break up I realized that it’s impossible to spend my life without him. I called him and told my feelings but he already moved on with a girl in his life who was far much better than me at that time. She was his old friend from school and supported him in every way possible. This thing broke my heart but this time I came back with a reason. A reason that changed my life forever, I fell in love with this guy and only this love made me do things which were once unimaginable for me. I asked my love to give me one last chance, he agreed but told me to stay friends with him and not pile up on him for anything emotional blackmailing. I agreed and started changing myself positively, he talked to me about this girl in his life and how good she was. This made me jealous but at the same time I also learned a lot of good things. I was changing all of a sudden, I started visiting his house, I didn’t told my mother still. After three months of trying hard to get him back I finally thought of giving up as he seemed least interested in me and was really happy with this other girl(as I thought). I got so depressed through all this that one day I cried in front of my mother and told her about all this. She being an orthodox didn’t understood me but still felt pitty on my miserable condition. Results came and I got a semester back. I even got sick after a month as I got typhoid. But then something amazing happened. This guy texted me that he loves me and came back to me telling me all the truth about his relationship with the other girl. I was happy but there were a lot of things to be changed yet. I wanted him to tell that girl that he loves me but he refused to do so. I wanted this semester back to get cleared but it was impossible. I wanted my parents to be supportive about me but they weren't. I wanted a lot of things to be changed in my life in order to stay happy and lead a normal life. Nothing changed according to me but yes it changed the way life wanted. I then started changing my perspective to deal with all these problems and people. I started making my own decisions for the first time in my life. I told my family that I love this guy and I am not letting him go anyway. I told the guy that I don’t like what he is doing to both of the girls and told him to be on the right side. I started looking for answers as to what is my life’s purpose and why is this all happening to me. I even got an year back in engineering while I was struggling through all these changes. But all my efforts actually showed great positive results. My life was changing still but in a way that was full of hopes and opportunities. For a person who looked at me and my life would have thought that it’s just the same but I knew it wasn't. I worked so hard with these changes that I convinced my mother and brother to accept my relationship with this guy and accept my failures. A lot of other stuffs happened which would need a book to be mentioned about. I faced failure, heart break, depression, refusals, frustration and god knows all the things. Some of my friends left my side, even my family didn’t understood me but I kept fighting through all of this. The only thing which made me going through all of this was the spirit to never give up on myself and the way I want my life to be. Today I am a liberal lady and my parents are amazed to look at the change I have brought in myself. I am in a committed relationship with the same guy and he now really adores me for the lady I am. Even he changed as a person and became more loyal to me. I cleared my year back and currently persuading my 7th semesters with regular status and yes 7.69 cgpa degree. The guy I love is in a big metro city now doing his job and I am working hard to get a job in the same city. My parents are still orthodox but they are not at all able to force me now on doing things in my life the way they want. I am living my life today and it’s just perfect with all these changes. I DON’T WANT TO CHANGE ANYTHING IN MY LIFE BECAUSE IT’S ALREADY PERFECT WITH ALL THESE CHALLENGES AND SMALL ACHIEVEMENTS EVERYDAY :) . ",
            "date": "Answered September 25, 2016",
            "views": "29",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Areesh Hussain",
                    "user_href": "/profile/Areesh-Hussain"
                },
                {
                    "user_id": "Karolyn Kay Summes-Slader",
                    "user_href": "/profile/Karolyn-Kay-Summes-Slader"
                },
                {
                    "user_id": "Punascha Prakash",
                    "user_href": "/profile/Punascha-Prakash"
                },
                {
                    "user_id": "Suganya Subramaniyam",
                    "user_href": "/profile/Suganya-Subramaniyam"
                }
            ]
        }
    ]
}