{
    "title": "A man travels 2 m towards north, then he turns towards east and travels 3 m. Finally, he travels 6 m towards south. How far is he from? - Quora",
    "tags": [],
    "response": [
        {
            "author_info": {
                "name": "Donald Poindexter",
                "href": "/profile/Donald-Poindexter-2"
            },
            "answer_text": "The correct answers would range from 0m to approx. 9.91m depending on the starting location. The smaller numbers come with the caveat that some of the directional distance instructions are unable to be completed due to being geographically impossible. The shortest distance (0m) can be attained by starting at the South Pole. If you travel North 2m you will be somewhere on the latitude 2m North of the South Pole. If you travel East you will still be somewhere on the latitude 2m North of the South Pole. If you then attempt to travel 6m South, you can only travel 2m. At that point you have reached the South Pole and at that point it is geographically impossible to travel any farther South. Your starting point and stopping point are both the South Pole, distance between the starting and stopping point will be 0m. To reach the longest distance between start and stop, the first leg and third leg need to be in line with each other and both being traveled in the same direction. This will require the second leg to start on one side of the North Pole and end on the exact opposite side of the North Pole. The longest distance will be achieved by starting at approx. 2.955m. South of the North Pole. Travel North 2m. At that point you will be at the latitude South of the North Pole that has a circumference of 6m. If you go 3m East, you will follow that latitude to exactly the opposite side of the North Pole. You then travel South 6m to 6.955m South of the North Pole. The distance between the start point and stop point will be 2m + 1.91m (approx.) + 6m or a total of approx. 9.91m. ",
            "date": "Answered April 9, 2020",
            "views": "1",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Owen Godfrey",
                "href": "/profile/Owen-Godfrey"
            },
            "answer_text": "Somewhere between four and ten meters from where he started. At the equator, this is close to simple geometry; a right angle triangle of sides 3, 4 and 5m, but as you travel away from the equator you need to start applying spherical trigonometry. If you start at the South Pole, then the distance is simply 6m - 2m = 4m. If you start 3m from the North Pole, then the distance will be slightly less than 2m + 2m + 6m = 10m. This has inherent similarities to the question “a man stands in a room with southerly views on all sides. He sees a bear walk past the window. What colour is the bear?” The answer is white because the only place you can have all southerly views is at the North Pole. ",
            "date": "Updated April 4, 2020",
            "views": "17",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Kulbir Kaur",
                    "user_href": "/profile/Kulbir-Kaur-100"
                },
                {
                    "user_id": "Suruchi S",
                    "user_href": "/profile/Suruchi-S-2"
                }
            ]
        }
    ]
}