{
    "title": "A Math quiz has 25 questions. A correct answer earns 8 points, and a wrong onecosts 3 points. Jess scores 110 points. How many questions does Jess answer? - Quora",
    "tags": [
        "Mathematical Puzzles",
        "Mathematics Word Problems",
        "Puzzles and Trick Questions",
        "Algebra"
    ],
    "response": [
        {
            "author_info": {
                "name": "Liam McCann",
                "href": "/profile/Liam-McCann-6"
            },
            "answer_text": "25 questions in total x = number of correct answers If we assume she answered every question, 8x - 3(25-x) = 110 8x - 75 + 3x = 110 11x = 185 x = 185/11 (not a reducible fraction) So we know she couldn’t have answered every question. We also know that she couldn’t have only answered correct questions, since 110 is not divisible by 8. So let’s set the number of wrong answers as y, and then the number of questions she answered is x + y, and the number she didn’t answer is 25 - x - y. 8x - 3y + 0(25 - x - y) = 110 Since she didn’t only answer correctly, we know that she must have gotten more than 110 points in correct answers. 8x > 110 Rounded up, x >= 14. We also know she must have had an even number of incorrect answers, since the score is even, and the score from the correct answers must be even (multiplied by 8) so the score from the incorrect answers must also be even. If x has a minimum value of 14, the max for y = 25 - 14 = 11. Since that’s not even, we can say y = {2, 4, 6, 8, 10}. We also know x can’t be 25, since she didn’t score 200, and since the min of y is 2, x can max out at 23, so x = {14, 15, 16, 17, 18, 19, 20, 21, 22, 23}. If we show them as potential positive and negative scores: 3y = {6, 12, 18, 24, 30} 8x = {112, 120, 128, 136, 144, 152, 160, 168, 176, 184} As 3y maxes out at 30, then x cannot be larger than 110 + 30 = 140, reducing our potential x values to 8x = {112, 120, 128, 136} So with our few options, it becomes apparent that the answer must be 8x = 128 and 3y = 18, or x = 16 and y = 6, for a total of 22 questions answered. ",
            "date": "Answered April 4, 2019",
            "views": "976",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Pranit Bankar",
                "href": "/profile/Pranit-Bankar"
            },
            "answer_text": "Jess answered 22 questions - 16 correctly and 6 incorrectly. Solution: Let the number of questions answered correctly by Jessica be [math]x[/math] and the number of unanswered questions be [math]y[/math]. Hence the number of incorrectly answered questions would be [math]25-x-y[/math]. [math]x[/math] and [math]y[/math] are non-negative integers. We know that: [math]8x - 3 (25-x-y) = 110[/math] ………(equation 1) [math]\\therefore 11x + 3y = 185[/math] ………(equation 2) Assuming the minimum number of unanswered questions, [math]y = 0[/math], equation 2 returns [math]x = 16.82[/math]. This means that [math]x < 17[/math] or [math]x \\le 16[/math]. Assuming the minimum number of incorrectly answered questions, [math]25-x-y = 0[/math], equation 1 becomes [math]8x = 110[/math] or [math]x = 13.75[/math]. This means that [math]x \\ge 14[/math]. Substituting [math]x[/math] with integers 14, 15 and 16, we see that equation 2 returns an integer value of [math]y[/math], only for [math]x = 16[/math]. Hence, [math]x = 16[/math] and [math]y = 3[/math]. So Jess answered 16 questions correctly, 3 were left unanswered and 6 were answered incorrectly. ",
            "date": "Answered April 4, 2019",
            "views": "457",
            "upvotes": "0"
        }
    ]
}