{
    "title": "A man walks 10km north then 24km east. How far is he from his starting point? - Quora",
    "tags": [],
    "response": [
        {
            "author_info": {
                "name": "Mark Ross",
                "href": "/profile/Mark-Ross-66"
            },
            "answer_text": "If we are talking about travel on a sphere, it depends on where you started. If you are talking about travel on a flat plane (which the Earth is not, (sorry, Flat Earthers), then it’s a simple trigonometry problem which Oscar Rodriguez has solved in his answer. On a sphere the size of the Earth, you might think the differences would be undetectable, but you’d be wrong. Even at the Equator, where the differences would give the SMALLEST error, they are still measurable. If you take it to extremes, though, the differences are very interesting. For example, start at the South pole where ‘pole’, in this case refers to the pole of the Earth as defined on the map, not the magnetic pole. Which way is North? Why, every direction is North, so we walk 10 km in some chosen direction. Now, we are 10 km from the south pole. Which direction is East? If we are facing North, then east would be to our right. So, we turn right and walk for 24 km. How far are we, now, from our point of origin? 10 km. Think about it. ",
            "date": "Answered November 18, 2018",
            "views": "737",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Omar Alazizi",
                    "user_href": "/profile/Omar-Alazizi"
                }
            ]
        },
        {
            "author_info": {
                "name": "Ian Williams",
                "href": "/profile/Ian-Williams-207"
            },
            "answer_text": "It depends on where he starts from. If it’s on the equator, pythgoras can be use with negligible error. 26km as another responder has calcuated. If it’s 10.001 km from the North pole it will be 10km +/- 1 mm. ",
            "date": "Answered November 18, 2018",
            "views": "215",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Christer Bernérus",
                    "user_href": "/profile/Christer-Bernérus"
                }
            ]
        }
    ]
}