{
    "title": "A ship travels 12 km towards east then it turns and travels 9 km towards north. How far is the ship from the starting position? - Quora",
    "tags": [
        "Homework Question",
        "Distance (physics and mathematics)"
    ],
    "response": [
        {
            "author_info": {
                "name": "Matthew Bond",
                "href": "/profile/Matthew-Bond-9"
            },
            "answer_text": "See, here’s the thing. The year is 2050. The ice caps have melted completely, because a bunch of people thought that if they killed the EPA, automation and outsourcing would play dead and the coal jobs would come back, but none of that happened, and now the polar bears are all dead and all that remains of the Great Barrier Reef is an indoor museum in Brisbane. Yikes. Ship A is 9km from the North Pole. This ship travels 12km East in a circular trajectory, and though the 3D geometry is sort of complicated, when it travels 9km North, it’s at the North pole. It would only need to travel 9km South to get back to its starting point - though the issue of “which South?” becomes crucial. This is pretty advanced stuff, but luckily, it’s 2050, so you can just use GPS. But anyway, it’s 9km from where it started! Ship B is at the South Pole. It’s unclear what “East” means, but anyway, due to allowable approximation error, it can just spin around a few thousand times. It capsizes and drifts 9km North (but which North?), and again ends up 9km from where it started. Ok, but now it gets tricky. In either case, are we talking distance as-the-fish-swims, or distance as-Jesus-walks? It’s a solid globe! But assuming consistent use of distances, the answers are the same in this particular case. If you mix-and-match, it gets really tricky. After all, the North and South poles are roughly [math]2r[/math] Euclidean distance apart, and [math]\\pi r[/math] apart as-Jesus-walks, assuming there’s a path that’s uniformly sea level, which might be an interesting geographical assumption to investigate, though the true distance may be further still due to irregularities. Sailing circles around the North pole is great and all, but was it worth it? Did we really have to kill the ice caps because the only numbers we like are the ones in our boss’s bank balance? Did any of it trickle down, or are we a bunch of dupes? Coal jobs didn’t come back, but Polio did, because while we were fighting over whether it’s ok for drinking water to be flammable, health care costs doubled three more times, and now people are skipping vaccines more than ever. Greenland is doing pretty well, though. You should sail there sometime. I hear they got a green new deal going on, unlike some places. Thawed them right out, and now you can herd sheep or whatever. Well, you could if you were a citizen, but really, they’ll probably turn you away at point of entry. If you didn’t immigrate before 2030, you’re way too late to the bandwagon. ",
            "date": "Answered April 29, 2019",
            "views": "25",
            "upvotes": " View 14 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Samuel Ng Lei",
                    "user_href": "/profile/Samuel-Ng-Lei"
                },
                {
                    "user_id": "David Prince",
                    "user_href": "/profile/David-Prince-36"
                },
                {
                    "user_id": "David Brightwell",
                    "user_href": "/profile/David-Brightwell"
                },
                {
                    "user_id": "Meagan Hebert",
                    "user_href": "/profile/Meagan-Hebert"
                },
                {
                    "user_id": "Glenn Wood",
                    "user_href": "/profile/Glenn-Wood"
                },
                {
                    "user_id": "Saifullah Shaikh",
                    "user_href": "/profile/Saifullah-Shaikh-1"
                },
                {
                    "user_id": "Mahatma Mahdi",
                    "user_href": "/profile/Mahatma-Mahdi-1"
                },
                {
                    "user_id": "Brendan Burkhart",
                    "user_href": "/profile/Brendan-Burkhart"
                },
                {
                    "user_id": "Jennifer Edeburn",
                    "user_href": "/profile/Jennifer-Edeburn"
                },
                {
                    "user_id": "Anthony Powers",
                    "user_href": "/profile/Anthony-Powers"
                }
            ]
        },
        {
            "author_info": {
                "name": "Alexander Fortier",
                "href": "/profile/Alexander-Fortier"
            },
            "answer_text": "Let’s suppose you had to walk to school every day. To get to school you must trudge 15 km worth of blocks west then 5km worth of blocks south, except you’re late one day. You forgot to eat breakfast and you rushed out of the house because your parents are fighting with your older brother to move out. In addition to this, you also slept past your alarm going off. So your stomach is empty, your heart is beating, and your adrenaline is pumping because you’ll certainly get reprimanded by your teacher for being late again. Your school still has corporal punishment because you live in the great island country of Genericlandia. That sounds like a pain, but the quicker you get to school the less problems you’ll have. You hope it’s a substitute teacher. They tend to be more lenient. Your time to get there on time looks like this:  You would normally walk the sidewalk like a normal person, but that won’t work out this time. You’ll be late! Cross a few yards, hop a few fences, get chased by a dog, your adrenaline is pumping and you can see the school building over the horizon. You pant and gasp for air as the dog is still on your heels. The building properly comes into view and you see the Principal holding the door open as the last group of kids trickle into the building. Heart pounding, you see the Principal look at you and he starts to close the door. You race past the schoolyard and just before the door closes you catch it with your fingers, slipping into the school building. “Phew.” You head to your homeroom and find it empty. You check the cafeteria and find the same. You hear noise at the gymnasium and see packed stands and a basketball game going on. You sigh in relief. It’s Saturday. You walk back home the normal way and try to calculate how far you traveled. You find out the length of the hypotenuse along a right-angle triangle. Knowledge of the issue is like this: 15km, 5km, _____km To solve a right-angle triangle it’s easy. Just use the Pythagorean Theorem, where C is the hypotenuse: a² + b² = c² Assign your values. 5² + 15² = c² You do the basic Algebra you learned in 8th Grade and it works out like this: 5² + 15² = c²25 + 225 = c² 250 = c² √250 = c This gives us an approximate value of 15.8km. Knowing how to do all sorts of similar problems, a query like this was easy. Thankful for the time you paid attention in Geometry, you smile, head to your room, and get some sleep. And maybe it helps others do their homework by themselves. Do your own homework, dude. ",
            "date": "Answered April 29, 2019",
            "views": "15",
            "upvotes": " View 4 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Rigopoula Tsambou Talarantas",
                    "user_href": "/profile/Rigopoula-Tsambou-Talarantas"
                },
                {
                    "user_id": "Glenn Wood",
                    "user_href": "/profile/Glenn-Wood"
                },
                {
                    "user_id": "Sige Lang",
                    "user_href": "/profile/Sige-Lang"
                },
                {
                    "user_id": "Laura Hollister",
                    "user_href": "/profile/Laura-Hollister-6"
                }
            ]
        }
    ]
}