{
    "title": "Are there better alternatives to the Poisson distribution? - Quora",
    "tags": [
        "Poisson Distribution",
        "Probability (statistics)"
    ],
    "response": [
        {
            "author_info": {
                "name": "Bill Bell",
                "href": "/profile/Bill-Bell-1"
            },
            "answer_text": "As you have indicated in your question, the Poisson distribution was derived. Put crudely, what it has in common with all theoretical probability distributions is that it is a product of the mathematical imagination. They have this in common with equations that someone has derived for modelling the behaviour of a spring under load or the motion of a pendulum. When you actually collect data for a cylindrical spring under load you invariably find that it does not obey the simple mathematical equation that Hooke proposed in the 17th century, at least not if the spring is push or pulled too far. His ‘law’ works well enough for small deformations of the spring but not for large ones. Likewise, if you collect event times they may, or may not, obey a Poisson law. Science is the business of modelling data and we use mathematics for describing and evaluating the models. The question of whether or not a Poisson distribution would be ‘the best’ would depend on (a) the data that you have or could expect to collect and (b) how you define ‘best’. Shorter answer: in statistics you either try to identify the statistical population from which the events arose or you abandon that attempt and employ methods that make no assumptions about the distribution. ",
            "date": "Answered September 22, 2016",
            "views": "14",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Zachary Thomas",
                    "user_href": "/profile/Zachary-Thomas-2"
                }
            ]
        },
        {
            "author_info": {
                "name": "Muhammad Anees",
                "href": "/profile/Muhammad-Anees-3"
            },
            "answer_text": "To find alternatives of a statistical distribution, I would first evaluate the properties of distributions to be considered as alternatives so the distributions can best fit to my data at hands. As the Poisson distribution has no such specific properties that we can find matchable to other distributions unless we relax a few conditions, so a fixed answer is improbable. Let us consider the Normal and Negative Binomial Distribution be candidates distributions but can we find any similarities in the conditions the Poisson and Normal/Negative Binomial Distribution enjoy together? ",
            "date": "Answered September 21, 2016",
            "views": "527",
            "upvotes": " Answer requested by Zachary Thomas"
        }
    ]
}