{
    "title": "Can game theory be applied on Chess? - Quora",
    "tags": [
        "Game Theory"
    ],
    "response": [
        {
            "author_info": {
                "name": "Ram",
                "href": "/profile/Ram-961"
            },
            "answer_text": "Yes, game theory can be applied to chess. Game theory is the branch of mathematics concerned with the analysis of strategies for dealing with competitive situations where the outcome of a participant's choice of action depends critically on the actions of other participants. Since chess is not based on probability and chance but rather strategical and tactical thinking, therefore it is a deterministic game. Also, the rules of the game are known to both the players and have remained unchanged which makes it a game of perfect information. So, chess is an example of game theory as both players know the possible moves and the effects of those moves. Theoretically, there must be a perfect strategy which either: guarantees the victory of white, since it starts the game, orends in a draw,or more unconventionally, guarantees black's victory.To know which strategy is the optimal one, all the variations have to be taken into consideration. The only problem is that the number of chess games possible is more than the number of atoms in the Universe. Even a computer operation at the rate of one variation per microsecond would take forever to calculate the first move. ",
            "date": "Updated January 9, 2017",
            "views": "35",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Parth Pawar",
                    "user_href": "/profile/Parth-Pawar-7"
                },
                {
                    "user_id": "Michael PJ Brett",
                    "user_href": "/profile/Michael-PJ-Brett"
                }
            ]
        },
        {
            "author_info": {
                "name": "John J. Luo",
                "href": "/profile/John-J-Luo"
            },
            "answer_text": "Game theory is all they use in chess! From the most new players to the most advanced, game theory is used to map out moves according to a game tree that specifies each movers’ advantages and disadvantages. By mapping out all the scenarios in which a chessboard can have, the players essentially create a mental image of plans of attack and defense. Computers can do this more efficiently and more brilliantly because it can map out more scenarios than that of a human’s capability. Computer are purely logical and will not play psychology wars with their opponents. It has a final goal for the currently standpoint in the game and it is constantly reevaluating the situation each move. And it can do it with immense speed and precision. That's why more modern military technologies are becoming computer instrumental, because a human has less consistency and more room for error. Game theory has been adopted by people in Silicon Valley and they have used this to create systems that can beat the best human players in chess, go, Starcraft! And many more strategy games. Hope this helped. ",
            "date": "Answered September 10, 2016",
            "views": "64",
            "upvotes": " View 6 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Chu Mạnh Trường",
                    "user_href": "/profile/Chu-Mạnh-Trường"
                },
                {
                    "user_id": "Sandip Dey",
                    "user_href": "/profile/Sandip-Dey-2"
                },
                {
                    "user_id": "Bilal Retiat",
                    "user_href": "/profile/Bilal-Retiat"
                },
                {
                    "user_id": "Kanhaiya Kumar Yadav",
                    "user_href": "/profile/Kanhaiya-Kumar-Yadav-2"
                },
                {
                    "user_id": "Deadnae .",
                    "user_href": "/profile/Deadnae"
                },
                {
                    "user_id": "Rahul Anand",
                    "user_href": "/profile/Rahul-Anand-6"
                }
            ]
        }
    ]
}