{
    "title": "Discuss: 'Calculus is essential in real life.' Do you believe that statement is true? What are your concepts and ideas about that statement? - Quora",
    "tags": [
        "Calculus Education",
        "Concepts",
        "Belief and Beliefs",
        "Calculus",
        "Life and Living"
    ],
    "response": [
        {
            "author_info": {
                "name": "James Calandro",
                "href": "/profile/James-Calandro-3"
            },
            "answer_text": "Calculus is essential in our lives. Almost any product purchased had calculus involved in its design/creation and/or in the economics of its distribution and sales. Without calculus, our lives today in America would look radically different. With calculus invented 400 years ago, it has lent hand to the dramatic progress of mankind in many areas since then. Yes, life could continue without calculus today (as billions of people have lived simple lives without it having been invented), but it is essential to the types of lives we live today in the United States. One could also argue the importance of grammatical clarity, as this question feels slightly off. It makes me wonder if you happen to be a native English speaker. ",
            "date": "Answered October 25, 2020",
            "views": "45",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Prabhanjan Sahoo",
                    "user_href": "/profile/Prabhanjan-Sahoo-4"
                }
            ]
        },
        {
            "author_info": {
                "name": "Eric Platt",
                "href": "/profile/Eric-Platt-9"
            },
            "answer_text": "Calculus has been essential in my real life. I am an applied mathematician. My undergraduate degree was in mathematics. I had to master much of Calculus for that. I was also a math and physics tutor on the side. I was then a software engineer in the video game industry for a while. I was often a physics programmer. This required my knowledge of differential equations which is built on calculus. Then I went to graduate school to continue my education in mathematics. I had a fellowship where my tuition was paid for while I was a teaching assistant. I conducted calculus labs for the undergraduate students and tutored students in the tutoring center in all undergraduate mathematics, which included calculus. I took plenty of courses in mathematical analysis, calculus being just a portion of this field. I then passed qualifying exams in Optimization Theory, Applicable Analysis, and Functions of a Real Variable. For my Ph.D. research I worked on problems with active manipulation and control of acoustic and electromagnetic fields. This was heavy with mathematical analysis, in particular functional analysis, numerical analysis, optimization theory, and inverse problem theory. Now I work in a research laboratory with atmospheric scientists on new models for weather and climate. ",
            "date": "Answered October 25, 2020",
            "views": "403",
            "upvotes": " View 17 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Prabhanjan Sahoo",
                    "user_href": "/profile/Prabhanjan-Sahoo-4"
                }
            ]
        },
        {
            "author_info": {
                "name": "John Vonachen",
                "href": "/profile/John-Vonachen-1"
            },
            "answer_text": "When I was briefly working as a game developer I asked my developer lead if he had ever used calculus in his work. He said, “Nope”. He did not have even a 4 year degree so his answer did not shock me. Not even a high school diploma yet he was probably the most intelligent person I had ever met and was the lead developer on a AAA title. His cellmate who had a masters degree in physics and who was responsible for the physics and camera AI also said no. ",
            "date": "Answered October 25, 2020",
            "views": "32",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Aaroh Gokhale",
                    "user_href": "/profile/Aaroh-Gokhale"
                },
                {
                    "user_id": "Arbash Nazeer",
                    "user_href": "/profile/Arbash-Nazeer"
                },
                {
                    "user_id": "Tony Travia",
                    "user_href": "/profile/Tony-Travia"
                },
                {
                    "user_id": "Ryan Kitson",
                    "user_href": "/profile/Ryan-Kitson-3"
                },
                {
                    "user_id": "Vidya Dean",
                    "user_href": "/profile/Vidya-Dean"
                },
                {
                    "user_id": "Martin Berggren",
                    "user_href": "/profile/Martin-Berggren"
                },
                {
                    "user_id": "Aditya Shidhaye",
                    "user_href": "/profile/Aditya-Shidhaye"
                },
                {
                    "user_id": "Bramhatanu Banerjee",
                    "user_href": "/profile/Bramhatanu-Banerjee"
                },
                {
                    "user_id": "Osman Abuobaida",
                    "user_href": "/profile/Osman-Abuobaida"
                },
                {
                    "user_id": "Ryan Howe",
                    "user_href": "/profile/Ryan-Howe-88"
                },
                {
                    "user_id": "Vipil Vijay",
                    "user_href": "/profile/Vipil-Vijay"
                },
                {
                    "user_id": "Erik Kofoed",
                    "user_href": "/profile/Erik-Kofoed-2"
                },
                {
                    "user_id": "Saad Haider",
                    "user_href": "/profile/Saad-Haider"
                },
                {
                    "user_id": "Vladimir Pitch",
                    "user_href": "/profile/Vladimir-Pitch"
                },
                {
                    "user_id": "Prabhanjan Sahoo",
                    "user_href": "/profile/Prabhanjan-Sahoo-4"
                },
                {
                    "user_id": "John Knight",
                    "user_href": "/profile/John-Knight-19"
                },
                {
                    "user_id": "David Webber",
                    "user_href": "/profile/David-Webber-21"
                }
            ]
        },
        {
            "author_info": {
                "name": "Will Misner",
                "href": "/profile/Will-Misner"
            },
            "answer_text": "Manilyn, Every action in the Universe is a physical manifestation of Proven Deductive mathematical equations using undefineds, definitions, postulates and definitions. A person that hits a baseball uses the brain to calculate the tangent line to the curve of the baseball( Calculus). This happens in a fraction of a second. In all that humans do, we get closer and closer to perfection, but never get there. ( the concept of limit) Will ",
            "date": "Answered October 25, 2020",
            "views": "31",
            "upvotes": " Answer requested by Manilyn Pelaez",
            "upvoters": [
                {
                    "user_id": "Prabhanjan Sahoo",
                    "user_href": "/profile/Prabhanjan-Sahoo-4"
                }
            ]
        },
        {
            "author_info": {
                "name": "Aleksandar Bojanović",
                "href": "/profile/Aleksandar-Bojanović"
            },
            "answer_text": "It is essential in making calculations and predictions about real life phenomena. Every part of physics uses calculus. There is no physics without it. But if you are not phisicist, mathematician, engenieer, computer scientist, and if you are not in similar fields then knowing calculus is pretty useless to you. Just like knowing Spanish is essential for one person but a pretty much useless skill for another person. ",
            "date": "Answered October 25, 2020",
            "views": "20",
            "upvotes": " Answer requested by Manilyn Pelaez"
        },
        {
            "author_info": {
                "name": "Barry Ford",
                "href": "/profile/Barry-Ford-1"
            },
            "answer_text": "If your real life includes engineering or doing science, the calculus is essential. Electronics, aircraft and cars all work due to the differential equations of physics. Mathematics is life. It doesn't get more real than that. ",
            "date": "Answered October 28, 2020",
            "views": "19",
            "upvotes": " Answer requested by Manilyn Pelaez"
        }
    ]
}