{
    "title": "Does the claim 'base-10 systems of measurement are more intuitive' predate the development of the metric system, or were early metric advocates the first to make this claim? - Quora",
    "tags": [
        "Metric Systems",
        "Decimal Number System",
        "Metrics",
        "Intuition",
        "Units of Measure",
        "International System of Units",
        "Measurements",
        "Science"
    ],
    "response": [
        {
            "author_info": {
                "name": "Bill Spencer",
                "href": "/profile/Bill-Spencer-9"
            },
            "answer_text": "The claim “base-10 systems of measurement are more intuitive” comes far, far after the metric system was developed, as metric advocates struggle to explain why the system is superior. In fact, your question may be its very first expression. Base-10 means the system of expressing numbers, not the units. In modern society, ALL units are expressed in base-10 numbers. 12,345 feet is a Base-10 number. 456.789 m is a Base-10 number.Perhaps instead of Base-10, you meant decimal systems of measure — that is, relationships between different size units are all powers of 10, such as in SI.In 1586, Simon Stevin in Belgium proposed De Thiende, or The Tenth, to use “modern” decimal fractions, and to change coinage, weights, and measures with relationships between different size units as a multiple of 10.Note: At the time, most arithmetic was done in Roman Numerals, not Arabic numerals as we use today. But Roman Numerals are also decimal - just not Base 10.For the rest of the story, see:Bill Spencer's answer to How long did it take to create the metric system?But, in the end, what about intuitive?The change from Roman Numerals and simple fractions to decimals, and then to decimal units, started with a few rare scientists, and only made its way to “the common people” with the widespread adoption of mandatory schooling, including decimal arithmetic. This really took hold in the 20th century.The scientists liked decimal systems because they were easier for them to calculate. Not more intuitive — just easier to calculate.ONLY after the populations were re-educated in decimals, did people start to comment on how the metric system was more intuitive. Schemes (like USCS and Imperial) based on integers and fractions now seem, retroactively, LESS intuitive, to a population now raised on decimals. Thinking that a decimal system, like SI, is more “intuitive” is a very recent phenomenon, following not the invention of SI, but following the re-education of grade-school children and their arithmetic.Bill Spencer's answer to Which is more intuitive, metric or imperial measurements? ",
            "date": "Answered February 17, 2020",
            "views": "87",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Michael Zorn",
                    "user_href": "/profile/Michael-Zorn-9"
                },
                {
                    "user_id": "Bill Hazelton",
                    "user_href": "/profile/Bill-Hazelton-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Will Gates",
                "href": "/profile/Will-Gates-9"
            },
            "answer_text": "When did the Romans first come and beat us up? Well, 2000+ years ago anyway, or should I say MM? Were the Romans great engineers and scientists? Possibly not the greatest but they were organised and managed to dominate wide swathes of the world with their inherent cultures, skills and abilities. The base 60 system was used in some cultures and that, combined with 365 days in a year is credited with the circle being divided into 360 degrees. The skills found in widely dispersed cultures were redistributed to everwhere the Romans held sway. Did the base 12 clock derive from base 60? They are suspiciously compatible. Well, the Romans certainly organised their large section of the world using a 12 hour clock. Then a mile is derived from mille, 1000 double paces, ooh, base 10 creeping in? Well, seeing years like MCMXXVII gives you pause to wonder, what was multiplication like in a Roman classroom? Even addition would be a challenge, try MCMXXVII x MMCCLIV. Then a mile is divided into 8 furlongs of 10 chains each, then an acre is an area of 10 chains x 1 chain (base 10 sneaking in again). A chain is 22 yards making a mile 1760 yards and presumably, a double pace becomes 1.76 yards. A yard is 3 feet with a foot being 12 inches. Carpenters, more than anyone else, like inches. A foot can be divided into 2 x 6 inches, 3 x 4 inches, 4 x 3 inches or 6 x 2 inches, then fractions can be easily used: 1/2\", 1/3\", 1/4\", 1/8\", 1/12\", 1/16\", 1/24\", 1/32\" and 1/64\" all being found on old engineering rulers, then also, 1/10\", 1/20\", 1/50\" and 1/100\". (I could once see 1/100\" graduations, ha!) Independently, Arabic scholars devised the base 10 positional numbering system and this method also found its way along the trade routes. Luckily for us. The British scientific community long proposed a rationalised system of measurement units but, as is evidenced by the American and British public's reluctance to adopt IS units (some grammars prefer SI) even though both the Imperial (~= Roman) system and the American modified Imperial system were rationalised to be defined in IS units in the 1960's and before. (\"The British are going metric, inch by inch!\") Learning the times tables up to 12 times (and 13 times for luck) may have been limited in Britain by the introduction of pence (£ 1/100) giving £.p rather than the £.s.d with 20s in £1 and 12d in 1s giving £1 = 240d (an old language inheritance using d for penny). A guinea was a neat way of increasing prices by 5% for rich ladies buying posh frocks, being 21 shillings. (What's 7 x 13 = ? Anybody?) Then along comes Alan Turing and we end up with octal, hexadecimal and binary. When you were a little girl (or boy) did you learn to count to ten? (Or eight, twelve or sixteen?) Of course, higher numbers soon follow but counting to ten on your fingers seems a logical start. Ten numeral digits make a reasonable number to learn (and still at least two of them are hard to distinguish from similar letters). Hexadecimal just gives up and switches over to using the alphabet. Our short term, problem solving, memory is, supposedly restricted to the \"Magic number Seven Plus or Minus Two.\" Depending on whether your brain is small, medium or large. Scoring points is conveniently out of ten, five or six coming to dinner is easily comprehensible. Fourteen or fifteen is a lot, either way. Intuitive or not, base ten seems to work conveniently. When you are measuring distances between atoms or galaxies, the IS system works pretty well, though hectares could have used more work. Unfortunately, areas and volumes confuse things a little. ",
            "date": "Answered February 25, 2020",
            "views": "39",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Michael Zorn",
                    "user_href": "/profile/Michael-Zorn-9"
                },
                {
                    "user_id": "Bill Hazelton",
                    "user_href": "/profile/Bill-Hazelton-1"
                }
            ]
        }
    ]
}