{
    "title": "How is language related to mathematics? - Quora",
    "tags": [],
    "response": [
        {
            "author_info": {
                "name": "Ray Adams",
                "href": "/profile/Ray-Adams-17"
            },
            "answer_text": "To quote Alf van der Poorten (1996) “One of the difficulties of mature mathematics is its immense vocabulary”. Simple algebraic symbols enable the production of proofs much more readily than can words in English, French, German, Latin etc. Try to write the distributive law a*(b+c) =a*b + a*c in English and then prove (a + b)(a-b)=a^2-b^2 without using any mathematical notation! Mathematical \tsymbols, when learned, can provide a powerful basis for solving \tmathematical problems. Learning how to understand equations and \trelated symbols are essential, but need not be joyless. For example, try the following puzzle. “The sum of two numbers is \teight and their difference is six. What are the numbers?” Now try to solve x + y = 8 and x – y = 6, from which x = 7 and y = 1. \tSimple given the (very) basic knowledge base. The language of mathematics tends to be more challenging than those of the sciences. Science tends to introduce new words such as “dark matter”, for example or words that have well known initial meanings to the layman that can be built upon. Not only is there a specialist scientific vocabulary consisting of words which are recognizably unfamiliar but there are familiar words such as ‘energy’, ‘power’ and ‘force’ which must acquire new meanings. For example, young students are already very familiar with the term ‘gas’ and are ready to build on that familiarity by acquiring scientific uses of the word. In scientific writing, unnecessarily confusing words are often labelled as “jargon” in the pejorative use of the word. The argument by scientific writing scholars is that scientific language need not be obscure. For some audiences, the jargon can be eliminated entirely and replaced with simpler language, while preserving most of the meaning, though a revised version will tend to be longer than an original. In contrast to science, mathematical language can be much more demanding and removed from the everyday meanings of words. Phrases such as “elliptic curves”, “modular forms”, “commutative rings”, “Noetherian rings”, “a ﬁnite extension of Q”, surjective” etc. None of which will mean much to an intelligent, new reader, without prior preparation. Such preparation, however, can open up the new worlds of higher mathematics Paradoxically, when mastered, mathematical language can really efficiently express complex concepts, when compared with natural languages. (See above for the use of algebra to enhance problem solving.) The conclusion is that mathematical language can be significantly more demanding than comparable scientific languages. But it is not just mathematical language that can be demanding, but also the growing growth of more and more complex concepts that need to be assimilated by a student of any topic within mathematics. As Barry Mazur (2006) has commented: “On theorems having been proved, more further reaching problems come to prominence.” As Alf van der Poorten observed (1996) “One of the difficulties of reading mature mathematics is the volume of notions that seems to be required. No one can readily discover the meaning of the more popular ideas because all too often they are defined in terms of yet more obscure words. . . few – perhaps none – of us know all the definitions.” So, whilst earlier scientific concepts are replaced by later scientific concepts that may or may not seem more complex, earlier mathematical proofs are augmented by later and even more complex proofs that might also cast light on our understanding of these earlier proofs. In physics, important theories can be described in either mathematical terms or in language or both. A particularly striking demonstration of this point is provided by the field equations of Einstein’s General Theory of Relativity. The mathematics may look terrifying but the cosmological solutions, expressed in words, are relatively simple. I think I’ll stop here. ",
            "date": "Answered August 1, 2019",
            "views": "465",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Aaron Brown",
                "href": "/profile/Aaron-Brown-165"
            },
            "answer_text": "That’s a deep question. Some basic concepts in both seem to be wired deep in the brain, and not in the same places. Ordinary language contains some primitive mathematical concepts but they are very difficult to use for analysis. Similarly mathematics stripped of ordinary language is hard to explain or understand. Even the densest mathematics texts have lots of words in them. This is one of the barriers to artificial intelligence. It’s easy to teach computers math, hard to teach them ordinary language. I’m not sure there is a connection at the base of things, they may be parallel systems. Of course you can model language mathematically and get great insight that way, also people can write great literature about mathematics. But these are synergies, not connections. The major difference I can see is that mathematics built up from the basic concepts mostly by logic. It feels as if “God is a mathematician,” in the sense that results that seem elegant from a pure mathematical point of view seem to describe the universe and anticipate empirical discoveries. We seem to be discovering mathematics, not inventing it. Language is built up using a system we only dimly grasp. It feels more like we are inventing it rather than discovering it. No one has ever anticipated a physical discovery, as far as I know, because it sounded good when spoken. If mathematics is our bridge to understanding the universe, language may be the bridge to understanding ourselves. ",
            "date": "Answered January 21, 2017",
            "views": "717",
            "upvotes": " View 3 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Thomas More Jung",
                    "user_href": "/profile/Thomas-More-Jung"
                },
                {
                    "user_id": "Dave Gulimlim",
                    "user_href": "/profile/Dave-Gulimlim"
                },
                {
                    "user_id": "Philip Petropoulos",
                    "user_href": "/profile/Philip-Petropoulos"
                }
            ]
        },
        {
            "author_info": {
                "name": "Alberto Cid",
                "href": "/profile/Alberto-Cid-1"
            },
            "answer_text": "A great great lot of relationships. I’ll give some of them. Maths are expressed in a “language”. You have symbols with meaning… things like “+” (addition), “*” (multiplication or ‘product’), … or also “for all”, “belongs to”, “intersection”, “union”, “integral”, “derivative” or “equal”. Any mathematical expression is a sequence of symbols, like written language is a sequence of letters and punctuation… Encoding of symbols. Any written or spoken language use symbols that can be translated to numbers… That’s what computers do, your question is transmitted using Internet, a digital network, which sends digital information. And “digital” comes from “digit”, that is, numbers. As a matter of fact, in french language, the word “digital” is said “numérique”, and that means numerical… so french speakers say numerical networks or numerical devices… to refer to digital networks or digital devices (like computers or GSM phones). All the letters in your Quora question are just coded with numbers and treated as numbers… Logic. The language we humans use has logical elements… things like “implies” or “then” or “and”, “or”, “not” … and that’s basically equivalent to pure math: Boolean Algebra. Natural Language Processing. This is an Artificial Intelligence area, and it mostly uses maths, but it uses maths to process human language, natural language. For example, Gmail detects wether an email (text) is SPAM or not… using maths. Another example: digital assistants like Siri, Alexa or Google Assistant use voice recognition techniques and that is based on maths… maths used to process language. There are hundreds of examples. ",
            "date": "Answered October 21, 2019",
            "views": "11",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Alvin Grissom II",
                "href": "/profile/グリサム-アルビン-Alvin-Grissom-II"
            },
            "answer_text": "It is impossible to answer this question comprehensively, as it is extremely broad, but I'll offer some insights: SyntaxSyntax is the study of the structure of language, and the constraints .  Nearly all modern syntactic theories are \"mathematical\" in nature.  Noam Chomsky's transformational-generative grammar formalizes language in terms of recursive trees, for example.  Recursive approaches such as this are foundational in many areas of computer science, such as automata and programming language theory. SemanticsSemantics is the study of meaning.  It attempts to describe the ways in which one derives meaning from a string of signals (words, phrases, etc.).  Logical semantics uses logic to do this.  Logic and mathematics are obviously very closely related. Statistical ApproachesIn the past two decades, computational linguists have largely transitioned to statistical approaches to processing language.  Let's say that you want to automatically build a bilingual dictionary between English in German.  One way of doing this is the simply accumulate a large number of sentences that appear both in English and in German and match the words and phrases and occur together the most often.  This would be a statistical approach to word alignment. Mathematical LanguageWriting mathematics itself requires a set of symbols that can combine in certain ways (syntax) to build meaning (semantics) I haven't even scratched the surface, but these are a few anecdotal ways in which mathematics and language are related. ",
            "date": "Answered August 7, 2013",
            "views": "35",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "George Fox",
                    "user_href": "/profile/George-Fox-37"
                },
                {
                    "user_id": "Vinod Koliyat",
                    "user_href": "/profile/Vinod-Koliyat"
                },
                {
                    "user_id": "Michael Jasinski",
                    "user_href": "/profile/Michael-Jasinski"
                }
            ]
        },
        {
            "author_info": {
                "name": "Hugo Barrow",
                "href": "/profile/Hugo-Barrow-1"
            },
            "answer_text": "Similarities: •\tA speaker must be able to listen and speak, a mathematician must be able to understand other’s math’ works and solve problems. solving math problems is higher than understanding math while speaking is higher skill than listening. •\tBoth (language and math) are system.they made up from parts. language made up of words and math made up of axioms and theorems. Knowing all the words’ meaning and pronunciations don’t make you a speaker while learning all the axioms and theorems don’t make you a mathematician because both are a system. You must learn and review examples ,movies’ dialogues and etc. For math you must review and learn axioms and theorems through problems. •\tLearning words’ meaning and pronunciation requires repetition until listening a word have the same meaning to you to listening it’s translation. That means an instant equality like tasting. this is so for math. Like Lord Kelvin once said:  Because when you are listening you have no time to ponder you must react quickly. In math if you be drowned in calculations you will loose right track of thinking. •\tBut about creativity: you may say learning a language is all about memorization but math is logic. Bobby Fischer American chess grandmaster after that beautiful match against Spassky that no one had ever seen , said: “It's almost all theory and memorization. People think there are all these options, but there's usually one right move. Of course, in the end, there's no place to go.” I don’t know exactly from where new is coming but it’s given to whom that understand old well. ",
            "date": "Answered January 1, 2020",
            "views": "21",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Andy Yang",
                    "user_href": "/profile/Andy-Yang-72"
                }
            ]
        },
        {
            "author_info": {
                "name": "Ahmed Atif Abrar",
                "href": "/profile/আহমেদ-আতিফ-আবরার-Ahmed-Atif-Abrar"
            },
            "answer_text": "Perhaps in programming, we find a connection! Two Bangladeshis, students at MIT and Harvard, created their wedding cards on their own, because they didn't like the conventional ones in shops. What did they do? They analysed their 'feelings' of online chatting (in your word, language) and expressed those in colours,dots and lines through a programming language. I include a image of the news. It is in Bengali (I failed to collect the English version of this one)… if you don't know Bengali, just see the lines, colours and dots of the card.  Image courtesy: eProthomAlo ",
            "date": "Answered January 23, 2017",
            "views": "174",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Philip Petropoulos",
                    "user_href": "/profile/Philip-Petropoulos"
                }
            ]
        },
        {
            "author_info": {
                "name": "Barry Ford",
                "href": "/profile/Barry-Ford-1"
            },
            "answer_text": "Much of mathematics is expressed in the form of proofs. For example, suppose I say that if xx is an odd integer then x2x2 must also be an odd integer. In order to prove that statement, I have to say what I mean by “odd integer,” and show a logical set of steps that takes us from ‘xx is odd’ to ‘x2x2 is odd.’ Usually we use “we” instead of “I” to show that both reader and writer are working through the steps together to reach the same conclusion. Proposition: If x is an odd integer thenx2x2 is odd. Proof: Suposse x is odd. Then x=2a+1x=2a+1, for some integer a, by definition of an odd integer. (2a+1)2=4a2+4a+1=2(2a2+2a)+1.(2a+1)2=4a2+4a+1=2(2a2+2a)+1. Since (2a2+2a)(2a2+2a) is an integer, (2a+1)2=x2(2a+1)2=x2 is odd by definition of an odd integer. The proof is complete. The language used in the proof establishes a direction (from proposition to conclusion), supplies definitions for terms, and lays out a logical sequence of steps that supports the conclusion. ",
            "date": "Answered August 22, 2019",
            "views": "668",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Peter Shea",
                "href": "/profile/Peter-Shea-37"
            },
            "answer_text": "Maths is all about patterns. Here's a bunch of numbers. What can you say about them? Can you produce more examples? What about these shapes? I find the same kind of thing with languages.There are rules, like mathematics. What's the French word for x? Dunno, but it comes from Latin. What's the Latin word for x? So, could it be xy? The more languages I'm acquainted with, the more cross language patterns I see, and the fewer words I have to remember individually. Also funny to see the different ways different languages handle numbers, like French, with its sixty-ten and four-score-nineteen, and ALL the ways the Japanese count! But that's getting a bit too specific ;-) ",
            "date": "Answered June 12, 2020",
            "views": "617",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "José Hilario Cruz",
                "href": "/profile/José-Hilario-Cruz"
            },
            "answer_text": "Math itself its a language with which you can create anything in the physical realm, with math most of what we could reality was created, in order to use any other language first it had to past tru the mathematicals laws for that language to work and have coherence. Any language is rule by the time which is a mathematical concept, so I guess there is where you can find the relationship between the two. ",
            "date": "Answered August 1, 2019",
            "views": "98",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Peter Specht",
                "href": "/profile/Peter-Specht-2"
            },
            "answer_text": "There is little learning connection between linguistics and mathematics. Linguistics depends upon, emotions and the moral and legal understanding of words rooted in traditions, whereas mathematics is almost strictly a matter of abstract research and theory. ",
            "date": "Answered August 4, 2016",
            "views": "184",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Michel Paul",
                "href": "/profile/Michel-Paul-1"
            },
            "answer_text": "Language is related to mathematics in that what we can count is what we can name. What makes language possible in the first place is what makes counting possible. We count those things to which we can apply the same name or place in the same category. See Can mathematics exist without language? ",
            "date": "Answered August 24, 2020",
            "views": "277",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Ryan Sharif",
                "href": "/profile/Ryan-Sharif-2"
            },
            "answer_text": "I’m going to assume that you are asking a related question: “how can we model language learning using mathematics?” The answer to this question varies considerably, as there are many ways to approach the problem. Ed Stabler has an excellent paper entitled “Mathematics of Language Learning.” In the paper he discusses and introduces the various approaches and the mathematical formalizations of language learning. If there is interest, I can try to summarize his paper. ",
            "date": "Answered August 23, 2016",
            "views": "354",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Zihui Ni",
                    "user_href": "/profile/Zihui-Ni"
                }
            ]
        },
        {
            "author_info": {
                "name": "Rithwik Sudharsan",
                "href": "/profile/Rithwik-Sudharsan"
            },
            "answer_text": "All I can think of right now is Zipf’s Law - the distribution of most common words in a language will always be the same, approximately a geometric distribution with r=1/2.You can take the histogram of word frequencies in a cryptogram to solve it. In fact, most of the cryptography is math and language.You should read GEB: An Eternal Golden Braid. It’s all about this (and more)",
            "date": "Answered November 15, 2018",
            "views": "176",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Leonardo Flórez",
                    "user_href": "/profile/Leonardo-Flórez-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Terry Smithwick",
                "href": "/profile/Terry-Smithwick"
            },
            "answer_text": "Cynthia Avishegnath is quite correct. But also, mathematics is a language. A language is a method of communicating ideas. Mathematics is a method of communicating numerical (and so on) ideas. If you want to talk about how many hands I have, you’ll use terms from mathematics - you can’t really avoid it. ",
            "date": "Answered February 17, 2020",
            "views": "343",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "James Fraser-Jones",
                    "user_href": "/profile/James-Fraser-Jones"
                },
                {
                    "user_id": "Paul Bankston",
                    "user_href": "/profile/Paul-Bankston"
                }
            ]
        },
        {
            "author_info": {
                "name": "Cynthia Avishegnath",
                "href": "/profile/Cynthia-Avishegnath"
            },
            "answer_text": "Every language, whether nature, human or machine, is a state-machine. State-machine modeling and design is a field of Mathematics. ",
            "date": "Answered February 17, 2020",
            "views": "321",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Paul Bankston",
                    "user_href": "/profile/Paul-Bankston"
                }
            ]
        },
        {
            "author_info": {
                "name": "Khoa Nguyen",
                "href": "/profile/Khoa-Nguyen-76"
            },
            "answer_text": "Algebra. ",
            "date": "Answered October 11, 2014",
            "views": "167",
            "upvotes": "0"
        }
    ]
}