{
    "title": "How important of a role does language play in regards to mathematical concepts? Can there be math without language? - Quora",
    "tags": [
        "Concepts",
        "Logic (philosophy)",
        "Mathematics Education",
        "Philosophy",
        "Linguistics",
        "Language",
        "Mathematics"
    ],
    "response": [
        {
            "author_info": {
                "name": "Keith Ramsay",
                "href": "/profile/Keith-Ramsay"
            },
            "answer_text": "Mathematics has a more formal aspect and a less formal aspect. To take the second question first, in my opinion even a wholly formal mathematical proof should be thought of as a linguistic object. If we take it as such, then mathematics always includes language. On the other hand a formal proof is in a somewhat artificial language. It is possible to have mathematics without having natural language. One of the ways that language affects mathematical concepts is completely formal: whether there is good notation! It seems easy to take for granted, but the algebraic notation we use today (like [math]A^2+B^2=C^2[/math]) is our replacement for what originally was a confusing natural-language discussion of quantities (like used by the ancient Greeks). It greatly streamlines the communication of ideas. One of the reasons offered for why real analysis was developed so much on continental Europe compared to England in the 18th and 19th centuries is that the Europeans were accustomed to using the more streamlined notation of Leibniz (like [math]dy/{dx}[/math]) instead of Newton’s notation. My impression is that the popular stereotype of mathematics puts too much emphasis on the formal, symbolic side. While it’s possible to produce purely formal mathematics, it’s unusual to do so, and nearly always it’s not a very good idea. The formalization of proofs so that they can be checked by a computer has gotten somewhat easier with time, but not so much yet that it is customary. People who do formal proofs have described benefits besides being able to check the proof by a computer. In an informal proof there are steps which seem so intuitively obvious that one doesn’t feel the need to break them into smaller pieces. People formalizing a proof need to break such steps down, which usually is just tedious. They say that sometimes, though, one finds that it brings a bit of additional conceptual clarity to the proof. Formalizing a proof does not mean however that one is making a purely formal proof, because even if one has a proof which has been completely formalized, usually it is accompanied by a less formal discussion. Even once formalization has become more popular (which I’m guessing will happen eventually), I think it’s safe to assume that what one will normally have is a combination of formal and informal elements. Teaching is largely a matter of good use of language. We think often of an individual researcher working on a problem. Without teaching results from one generation to the next, however, progress would not be possible. Research is collaborative much of the time. Behind the scenes a lot of research work, even before publishing anything, is a matter of communicating between collaborators. When a result is published, it is also important that it be explained well. Every now and then one hears of a proof being published that does nothing for you besides convince you that the result is true. In graduate school I had a buddy who had to read some such papers produced by a technically brilliant world-class mathematician. It’s not that this kind of mathematics is necessarily a bad thing. But on the occasions when an idea both functions well formally and inspires people through evocative presentations of it, it is that much better. There was a conference a few years ago in which the question of stories in mathematics came up. Someone asked what counted as “stories” in mathematics. Some of the mathematicians in the discussion then discussed some mathematical results, which at the time might have seemed like a digression to some other participants. But then one of the mathematicians pointed out: what we were just doing is *telling a story* about mathematics. The story that one tells is very important. In some ways the story is harder to evaluate. When people are given credit for proving results, the gist of it often is that so-and-so proved such-and-such a result. Whether they present the proof in a manner which will help inspire others to apply the same concepts in other ways is a more subjective judgment. I believe though that in big advances in the field, the informal story contains a lot of the value of the advance. There are some analogies that are hard to formalize, or at least started out as hard to formalize, but which offer a nice guide to future work. A field is a kind of algebraic structure with addition, subtraction, multiplication, and division. There is no field with one element; the definition of “field” includes the requirement that 0 and 1 are distinct elements. But there is a kind of analogy which is made with a pretend field with one elements. ( Field with one element - Wikipedia ) As a concept, the field with one element thus has an odd kind of status. A lot of work has been done in the last few decades on “tropical rings”. The analogy between rings and tropical rings can be formalized (I believe much more so than the analogy with the field of one element). Along with tropical rings, one has tropical varieties, which are analogous to varieties (algebraic curves, surfaces, and so on). As far as I can tell, it’s not just a matter of applying some formal manipulation to proofs about tropical rings or tropical varieties to get proofs about rings or vice-versa. ",
            "date": "Answered May 28, 2020",
            "views": "173",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "David Joyce",
                    "user_href": "/profile/David-Joyce-11"
                }
            ]
        },
        {
            "author_info": {
                "name": "Mary Munro-Hill",
                "href": "/profile/Mary-Munro-Hill"
            },
            "answer_text": "What a fascinating question! Mathematics is itself a language, a wonderful international language, in which people of all tongues can share,once its concepts have been fully absorbed.. You ask about the importance of the role of language in conveying mathematical concepts: normally, someone learning mathematics will be taught the concepts in a particular language, as these concepts must be learned and understood. Once the concepts have been internalised, only newly developed concepts will need to be explained, again in the language of the particular individual. Can there be mathematics without language? It depends on what you mean. Once the concepts have been fully understood and internalised, no language, other than the language of mathematics itself, is necessary. I would need to write a book to do justice to your question. ",
            "date": "Answered May 26, 2020",
            "views": "69",
            "upvotes": " Answer requested by Ronnie Morales"
        }
    ]
}