{
    "title": "How to help my 5-year old sister understand math? She is having a hard time counting backwards from 2 and I have show her that she could use her fingers and even when the teacher explains it to her, she doesn’t understand. What can I do - Quora",
    "tags": [
        "Teaching Mathematics",
        "Understanding and Comprehension",
        "Siblings",
        "Mathematics Education",
        "Teachers",
        "Children",
        "Mathematics"
    ],
    "response": [
        {
            "author_info": {
                "name": "Nechamah Goldfarb",
                "href": "/profile/Morah-Nechamah-Goldfarb"
            },
            "answer_text": "First, make sure she has a sense of numbers: put 2 cookies on one plate and 3 on another, and ask her which is more. If she has no idea, please get back to me. If she has an idea, do activities like that with her—which is more? Which has the most? Which is less? which is the least? First do real objects; then move to work pages that you either can print out or draw for her. She needs to develop a sense of one-to-one correspondence—that is— name a number for each item. For that, she needs to be able to count. You can start her out with fingers: count to 5 as you hold up one finger at a time (Say one as you hold up one finger, 2 as you hold up 2 fingers, etc). After that, move on to objects—again—just 5 to start. 5 blocks, or 5 chocolate kisses, etc. Show her first how you say the number as you move ONE item at a time. Say ONe as you move one object, 2 as you move the second one, etc. At this point, do not count by pointing; it is better to move each item as you say the number. All of these help develop number sense. Eventually, as she masters counting up to 5 with one-to-one correspondence, move on to 10. There are different songs and rhyming activities for this (For instance: ‘One, two; buckle my shoe’ and ‘This old man’). The next step is a number line. If you can do this on the floor where she can jump numbers, that is more fun; otherwise make a number line for her on paper or on a dry erase board. Do not bother with counting backwards yet, until she really has a good sense of numbers, counting, and one-to-one correspondence! ",
            "date": "Answered April 30, 2020",
            "views": "133",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Donna Passman",
                    "user_href": "/profile/Donna-Passman"
                },
                {
                    "user_id": "Laura Tebele",
                    "user_href": "/profile/Laura-Tebele"
                },
                {
                    "user_id": "Tzivia Adler",
                    "user_href": "/profile/Tzivia-Adler"
                }
            ]
        },
        {
            "author_info": {
                "name": "Tricia Lockhart",
                "href": "/profile/Tricia-Lockhart"
            },
            "answer_text": "I would leave the actually teaching to others but use family experiences. Perhaps board games or hopscotch or if you go out as a family and pack a picnic, are there enough plates for everyone in the family. If not how many more do we need? At age 5 there is a tendancy for children to treat numbers as words in a poem. They may know the sequence is 1 - 2 -3 but as the specialists say, they may not understand the twoness of two. Sorting small items can be good, too. Either counting buttons or logical sorting such as ‘lets put all items with wings over here (or look in a picture book for items with wings, wheels etc). Also, try and mix things up - so a butterfly has wings and so does a plane but they are very different things. In a way this is the theory underlying set theory. The game of ‘Guess Who’ is a good example of children effectively using the idea behind Venn diagrams without actually knowing they are doing maths. ",
            "date": "Answered May 1, 2020",
            "views": "51",
            "upvotes": " Answer requested by Jack Morrison"
        }
    ]
}