{
    "title": "How can 8 + 8 = 4? - Quora",
    "tags": [
        "Brain Teasers",
        "Thinking",
        "Arithmetic",
        "Puzzles and Trick Questions"
    ],
    "response": [
        {
            "author_info": {
                "name": "Tom Ferral",
                "href": "/profile/Tom-Ferral"
            },
            "answer_text": "Taken literally, accepting the agreed upon meaning of each of the symbols in that equation, 8 +8 = 4 is false. As others have said, if you make some weird assumptions (weird in my view) you can pound together some way it could, possibly, remotely be true but I reject those given in the other answers, given so far. One person said that if the 8s represent cups and the 4 represent quarts, 16 cups would equal 4 quarts : 8 cups + 8 cups = 4 quarts Sure, if you want to make things up the equation could be made to be true. Another provided answer is that 8 + 8 = 16 and so that means 4pm. Nope - times in 2400 hour notation are always stated with 4 digits - 1600, 1831, 0030, 0358, etc. In order to be clear, the time must be specified in four digits. If I saw a time stated as 16, I could assume it was 0016 (16 minutes past midnight) or I could assume it meant 1600 but I would not any assumption and I would question the time and see if I could get some confirmation of what is actually meant by the 16. Also, if you are assuming hours, this equation still doesn’t make sense. 8 hours + 8 hours = 16 hours. Sixteen hours is a number of hours, not a time. You might write it as 0800 (in 24 hour time notation) + 8 hours = 1600 (in 24 hour times notion) that is, as a number of hours added to a time, but you didn’t write it like that. You did not specify any units in the equation. The 8s and the 4 are stated simply as numbers, not as number of units of some measure. Even if you suppose that the numbers in the equation were in some number base system under than decimal, say hexadecimal, there’s no way to make the equation true. In hexadecimal, the numbers would be the same and the equation would still be false. In binary - well, you can’t use binary because the only digits in binary are 0 and 1 so you can’t even write the equation using 8s and 4. If you convert to binary, in an attempt to prove the equation true, you would get 1000 + 1000 = 100 which is also false. Base 8, called octal, doesn’t help because there is no 8 in the octal system. The digits in octal or 0, 1, 2, 3, 4, 5, 6, 7. Even if you wrote it as 10 (decimal eight in Octal) + 10 it would not equal 4. It would equal 20 which in decimal is 16 and in hexadecimal it is F5 So, given what you provided, there is no way that 8 + 8 can equal 4. You are asking an arithmetic question and we can only perform the calculation as you show it and the result is that the equation is false. If you want to qualify the equations with units of measurement - say cups and quarts, then the equation could be true but as stated, the equation is false. Making some assumptions (most of which would be weird) violates all tenants of logic in that when working with such an equation, you must use what you have and nothing more. I don’t assume anything that I can back up with other, clear examples. I would reject the equation until someone either provided more information or agreed that it could not be true. As a programmer, I make any assumptions that I can validate with other, clear, examples. As stated, your equation cannot be true. ",
            "date": "Answered September 7, 2018",
            "views": "10",
            "upvotes": " View 10 Upvoters",
            "upvoters": [
                {
                    "user_id": "Jemima Durkin",
                    "user_href": "/profile/Jemima-Durkin"
                },
                {
                    "user_id": "Maruful Islam Shojol",
                    "user_href": "/profile/Maruful-Islam-Shojol"
                },
                {
                    "user_id": "T R",
                    "user_href": "/profile/T-R-938"
                },
                {
                    "user_id": "Evan Ray",
                    "user_href": "/profile/Evan-Ray-25"
                },
                {
                    "user_id": "Elizabeth Case",
                    "user_href": "/profile/Elizabeth-Case-18"
                },
                {
                    "user_id": "Gary Burkhardt",
                    "user_href": "/profile/Gary-Burkhardt-1"
                },
                {
                    "user_id": "Michael C",
                    "user_href": "/profile/Michael-C-338"
                },
                {
                    "user_id": "Manpreet Virk",
                    "user_href": "/profile/Manpreet-Virk-39"
                },
                {
                    "user_id": "Sunil Kumar",
                    "user_href": "/profile/Sunil-Kumar-3675"
                },
                {
                    "user_id": "Tejas Sarma",
                    "user_href": "/profile/Tejas-Sarma"
                }
            ]
        },
        {
            "author_info": {
                "name": "Greg Simay",
                "href": "/profile/Greg-Simay"
            },
            "answer_text": "It’s 8:00 p.m. and you wonder what time it will be 8 hours from now. Answer: 4:00 a.m. Also 8 months from the 8th month of the year is the 4th month of the following year. There are 8 people in line ahead of Susie. She predicts that, when it’s her turn, she’ll wind up at window 4. She turns out to be right. So, 8th in line (when she makes the prediction) + 8 people processed = Susie at 4th window. The numeral “8” has encloses two circle-like spaces. “8” + “8” encloses 4 circle-like spaces. If 8 is the length of one vector, and 8 is the length of another vector, it’s possible that they’re at such an angle so that the sum of the two vectors is a vector with length 4. 8 people + 8 people = 4 bridge tables (Each table needs 4 bridge players.) Also equals four simultaneous games of doubles tennis matches. A restaurant critic has two checklists when evaluating a new place: one list for the food itself, and another list for all the other criteria like adequate parking, friendly service, etc. A checked item means that the criteria in question meets or exceeds the critic’s standard of excellence. For a particular restaurant, the critic has checked off 8 items (out of a possible 10) for the food list, and 8 out of 10 for the “other criteria” list. Not all of the items checked are of equal importance but, after looking over the checked items, the critic is satisfied that the restaurant deserves a solid 4 out of five stars. In a crossword, you succeed in solving two “down” columns of eight letters each. This gives you the first and last letters of an “across” row of four letters each, enabling you to solve that row. “Eight” + “Eight” = 4 vowels (e,i,e,i d’oh!) Four traditional married couples—8 men and 8 women—have 4 great-grandchildren between them. What’s fun about this question is that it reminds us that there are a lot of different meanings that can be attached to 8 + 8 = 4. ",
            "date": "Answered November 19, 2018",
            "views": "86",
            "upvotes": " View 12 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Vasanthakumar (வசந்தகுமார் )",
                    "user_href": "/profile/Vasanthakumar-வசந்தகுமார்"
                },
                {
                    "user_id": "Purvit Patel",
                    "user_href": "/profile/Purvit-Patel-4"
                },
                {
                    "user_id": "Nishant Chhonker",
                    "user_href": "/profile/Nishant-Chhonker"
                },
                {
                    "user_id": "Aakriti Gupta",
                    "user_href": "/profile/Aakriti-Gupta-134"
                },
                {
                    "user_id": "Vanelle Adelaide",
                    "user_href": "/profile/Vanelle-Adelaide"
                },
                {
                    "user_id": "Rishabh Medhi",
                    "user_href": "/profile/Rishabh-Medhi"
                },
                {
                    "user_id": "Ronak Bothra",
                    "user_href": "/profile/Ronak-Bothra-5"
                },
                {
                    "user_id": "Jim Buckley",
                    "user_href": "/profile/Jim-Buckley-22"
                },
                {
                    "user_id": "Ali Engin",
                    "user_href": "/profile/Ali-Engin-3"
                },
                {
                    "user_id": "Binita",
                    "user_href": "/profile/Binita-27"
                }
            ]
        }
    ]
}