{
    "title": "How to find the radius of a circle with the center - Quora",
    "tags": [
        "Geometry of Circles",
        "Circles"
    ],
    "response": [
        {
            "author_info": {
                "name": "Minerva Hilsinger",
                "href": "/profile/Minerva-Hilsinger"
            },
            "answer_text": "If you have a circle where the center is not known, now its radius or diameter, 1st draw a random chord and extend its line outside the circle. with a compass, center at the extended side of the chord where it crosses the circle. make an arc the radius of the chord and cross the same extended line outside the circle. Now open the compass a little larger and place center of arc on the extended intersection and make an arc toward the 1st arc center point used. be sure the arc is somewhat symmetrical to the chord line. repeat the arc with the same size on the beginning side of the arc where it does not extend beyond the circle. be sure it crosses the previous arc in 2 places. Make a line from the intersections of the last to arcs toward the inside of the circle till it crosses the circle on the opposite site. you will have made a perpendicular line to the chord at 1 end. Draw a line from the non-extended end of the chord to the opposite where the new chord crosses the circle. this will be a diameter. You have 2 options you can do, which I like to do both to make sure my construction is accurate. we bisected the extended chord, and you can use the same method to the diameter to find the 1/2 way point and the center. you can also bisect the non-extended chord in the same way. this will be parallel to the chord made to find the opposite side of the diameter. and this will also cross the circle center. If it does, you can be more confident in the construction, if it misses, then start over and try again. ",
            "date": "Answered July 21, 2020",
            "views": "72",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Roksana Parvin Yasmin",
                    "user_href": "/profile/Roksana-Parvin-Yasmin"
                }
            ]
        }
    ]
}