{
    "title": "How can one apply maths in everyday life? - Quora",
    "tags": [
        "Everyday Life",
        "Applied Mathematics",
        "How-to Question"
    ],
    "response": [
        {
            "author_info": {
                "name": "Jeff Hall",
                "href": "/profile/Jeff-Hall-2"
            },
            "answer_text": "It Is said that one of the reasons for the collapse of the Roman empire was their inability to do maths with their clumsy numeral system.  It is not possible to do long division using roman numerals. Also, the lack of a number for zero held back engineering and scientific development. The Greeks used geometrical techniques to solve quite complex mathematical problems and that gave them the edge until algebra and calculus arrived. At this point civilisation developed rapidly as architecture, machinery and tools were developed. Maths underpins the sciences as it is the language used to test and communicate scientific ideas. Without it, the mobile phone, the Internet,  high speed travel, satnav and most of what we take for granted in every day life would not exist. So, we apply maths every day simply by using the products of mathematics. Not forgetting that without maths how would the barman know how to calculate the bill for three beers and a Jack Daniels? ",
            "date": "Answered August 16, 2014",
            "views": "967",
            "upvotes": " View 5 Upvoters",
            "upvoters": [
                {
                    "user_id": "Altaaf Khan",
                    "user_href": "/profile/Altaaf-Khan-18"
                },
                {
                    "user_id": "Mai Trang",
                    "user_href": "/profile/Mai-Trang-3"
                },
                {
                    "user_id": "Theo Reos",
                    "user_href": "/profile/Theo-Reos"
                },
                {
                    "user_id": "Teodora Herman",
                    "user_href": "/profile/Teodora-Herman-1"
                },
                {
                    "user_id": "Babatunde Odebiyi",
                    "user_href": "/profile/Babatunde-Odebiyi"
                }
            ]
        },
        {
            "author_info": {
                "name": "Peter Flom",
                "href": "/profile/Peter-Flom"
            },
            "answer_text": "Almost everything we learn in school is useless to almost everyone. So what? Since high school, I’ve never been asked to dissect a frog, define a covalent bond, sing a song, act in a play, analyze a painting or diagram a sentence. On the other hand, since I am a statistician, math has come in very handy. Math is useful for anyone who becomes a scientist or a statistician or a mathematician or a computer scientist. Math is also beautiful, although I would not blame anyone who didn’t realize it, because we almost always teach it in ways that make it ugly. If we taught other subjects the way we teach math, we would make kids: Know the names of 100 colors before they could pick up a paintbrushPlay scales for 12 years before teaching them a songMemorize words and grammar rules for 12 years before letting them read a novel.Make them memorize a chemistry book before doing an experiment.Memorize the birth dates of every president before learning any history.",
            "date": "Answered April 4, 2017",
            "views": "21",
            "upvotes": " View 30 Upvoters",
            "upvoters": [
                {
                    "user_id": "Federico Riveroll",
                    "user_href": "/profile/Federico-Riveroll"
                },
                {
                    "user_id": "Altaaf Khan",
                    "user_href": "/profile/Altaaf-Khan-18"
                },
                {
                    "user_id": "Theo Reos",
                    "user_href": "/profile/Theo-Reos"
                },
                {
                    "user_id": "Tomoyo Daidouji",
                    "user_href": "/profile/Tomoyo-Daidouji-6"
                },
                {
                    "user_id": "Akshayvasumathi",
                    "user_href": "/profile/Akshayvasumathi"
                },
                {
                    "user_id": "Revanth G.S.",
                    "user_href": "/profile/Revanth-G-S-1"
                },
                {
                    "user_id": "PM",
                    "user_href": "/profile/PM-122"
                },
                {
                    "user_id": "Tyler McMann",
                    "user_href": "/profile/Tyler-McMann"
                },
                {
                    "user_id": "Tara Nitka",
                    "user_href": "/profile/Tara-Nitka"
                },
                {
                    "user_id": "Conor Sheehan",
                    "user_href": "/profile/Conor-Sheehan-3"
                }
            ]
        }
    ]
}