{
    "title": "How much intelligence comes from the mother? - Quora",
    "tags": [
        "Intelligence Quotient",
        "Genetics and Heredity",
        "Mothers",
        "Intelligence",
        "Neuroscience"
    ],
    "response": [
        {
            "author_info": {
                "name": "Barry McGuinness",
                "href": "/profile/Barry-McGuinness-1"
            },
            "answer_text": "When you ask ‘How much comes from the mother?’, I imagine you are referring to the genetic contribution. There’s no simple way to answer this and in any case it will be different for every individual. Intelligence isn’t a single trait nor is it driven by a single gene, like (say) eye colour. Intelligence comes partly from genes (over 500 of them); it comes partly from environmental stimulation and engagement over days, weeks, months, years; and it comes partly from the individual’s own willingness to actively use it and develop it. Initially, the main factor is environment. Not the family home environment, however, but the environment of the womb before birth. There is considerable influence here which technically could be attributed to the mother, as it’s her body containing the uterus and placenta, which in turn are influenced by the mother’s physical and hormonal states. After birth, it’s usually our parents who provide (or fail to provide) the regular stimulation that exercises our cognitive abilities and creates complex neural pathways. In the sense that the mother is usually (not always) the one who is there to provide most of such stimulation, you could say more intelligence ‘comes from the mother’ - but we mean environmentally, not genetically. Human intelligence keeps increasing from one generation to the next, albeit gradually. This appears to be due to the growing amount of stimulation available to each new generation. Paradoxically, the genetic contribution from our parents gets stronger as we get older. It is estimated that genes contribute only about 20–40% of the variance in intelligence in childhood (when neuroplasticiity is highest) and about 80% in old age. ",
            "date": "Answered January 7, 2020",
            "views": "213",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Tomas Mo",
                    "user_href": "/profile/Tomas-Mo"
                }
            ]
        },
        {
            "author_info": {
                "name": "John Casey",
                "href": "/profile/John-Casey-320"
            },
            "answer_text": "It depends on the relationship and the amount of knowledge and experience the mother provides. The 50% viewpoint is answering the wrong question. Half the DNA (50%) does come from the mother, but the development of the mind is not a chemical transfer, based on DNA. The matrix (the brain) is physical, but the development of the awareness and the mind isn’t. To use an obvious computer metaphor, the advantage is in the software, not the hardware. The development of intelligence for a child will usually come more from the mother, if the child spends more time with the mother, or with people chosen by the mother. So the degree of intelligence varies with the input of experience. -John Casey ",
            "date": "Answered January 7, 2020",
            "views": "119",
            "upvotes": "0"
        }
    ]
}