{
    "title": "How to find out if a equation defines y as a function of x - Quora",
    "tags": [
        "Functions (mathematics)",
        "How-to Question"
    ],
    "response": [
        {
            "author_info": {
                "name": "Yuliya Andreevna Skripchenko",
                "href": "/profile/Yuliya-Andreevna-Skripchenko"
            },
            "answer_text": "You have to remember we like precision in mathematics, what that question is really asking is do you remember the definition of a function and application of that definition. Check out this phrasing on math is fun, it might make more sense. Definition of Function As people mentioned you have to check if there is going to be one y for one x. if you have a math degree, the problem is easy, looking over the equation a you can notice that it is y that is squared so more then likely you will have two values for x for one y, and so one example is going to be sufficient to disprove the definition. part b is more complected and you would have to prove that it satisfies the definition of a function, one way to do that is pick a random x, value represented by another variable and substitute it in, and then justify that expression you get represents one single value with continuity, increasing, decreasing. on the interval. here are the steps if you don’t have the math degree and don’t know operations as well it will work every time. re-write it in terms of y=…., meaning solve for yif it looks like you have two equations then it is a relationship -case aif you need to prove that one has a function for case b, you would point out that if you substitute any value you will get some value in Reals.",
            "date": "Answered June 22, 2016",
            "views": "601",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Cielo Anderson",
                    "user_href": "/profile/Cielo-Anderson"
                },
                {
                    "user_id": "Poseidon Yang",
                    "user_href": "/profile/Poseidon-Yang"
                }
            ]
        },
        {
            "author_info": {
                "name": "Gregory Schoenmakers",
                "href": "/profile/Gregory-Schoenmakers"
            },
            "answer_text": "If the equation is written explicitly in the form [math]y=f(x)[/math] then there is nothing to figure out. It is when the equation is written implicitly ([math]F(x,y)=0[/math]) that it gets more problematic. It may not be possible to rearrange the function so that it is written in an explicit form. That in itself doesn’t matter because a relation/function is defined as a set of ordered pairs [math](x,y)[/math] that satisfy the relationship [math]F(x,y) = 0[/math]. An explicit function can be rewritten as [math]F(x,y) = f(x) - y = 0[/math] The other problem is that in a function, each value of [math]x[/math] in the set of ordered pairs appears only once. That is, for any value of [math]x[/math], there is at most one value of [math]y[/math]. So that is the test you need to apply to see if you have a function or not. Your first example [math]x+y^2=14[/math] is NOT a function since for any value of [math]x<14[/math], there are two values of [math]y[/math]. The second example [math]x^3-y^3=27[/math] is a function. Of course these two equations can be written in explicit form so it is relatively easy to tell if they are functions or not. ",
            "date": "Answered March 10, 2020",
            "views": "149",
            "upvotes": " View 3 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Shishir Lohar",
                    "user_href": "/profile/Shishir-Lohar-3"
                },
                {
                    "user_id": "Adara N",
                    "user_href": "/profile/Adara-N"
                },
                {
                    "user_id": "Elizabeth Pham",
                    "user_href": "/profile/Elizabeth-Pham-30"
                }
            ]
        }
    ]
}