{
    "title": "How can the probability be 1 but not guaranteed to happen? - Quora",
    "tags": [
        "Probability Distributions",
        "Probability (statistics)",
        "Statistics (academic discipline)"
    ],
    "response": [
        {
            "author_info": {
                "name": "Alfredo Sepúlveda-Jiménez",
                "href": "/profile/Alfredo-Sepúlveda-Jiménez"
            },
            "answer_text": "Under Kolmogorvian probability an event A∈FA∈F, in a probability measure space (Ω,F,μ)(Ω,F,μ), may have a probability under the distribution pp of 11 almost surely μμ (a. s. μμ), meaning everywhere except on sets of μμ-measure 00 and written as; p(A)=a.s.μ1p(A)=a.s.μ1 Here, the probability distribution pp is absolutely continuous with respect to (w.r.t) μ (p≪μ).μ (p≪μ). Now suppose there is another measure νν on (Ω,F)Ω,F) such that μ≪νμ≪ν and a probability distribution qq such that q≪νq≪ν. Then, it is not guaranteed that q(A)=a.s.ν1q(A)=a.s.ν1 So, the condition that an event “happens” is dependent on the underlying probability measure of the probability space in which the event is being framed. This is akin to an “alternate reality measure” and this is how measure spaces can play havoc with geometry ala Banach-Tarski type theorems (paradoxes) and the existence of sets of measure 00 via the AC. ",
            "date": "Answered October 24, 2020",
            "views": "280",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Alison Weir",
                    "user_href": "/profile/Alison-Weir-7"
                },
                {
                    "user_id": "Martin Jansche",
                    "user_href": "/profile/Martin-Jansche"
                }
            ]
        },
        {
            "author_info": {
                "name": "Troy Loeffler",
                "href": "/profile/Troy-Loeffler"
            },
            "answer_text": "If it is 1 in an infinite limit you end up with a situation call “almost certain” A “certain\" event is where all possible combinations lead to this outcome. “Almost certain\" is where the probability approaches 1, but it can never quite get there. “Almost never\" is an equivalent event when the probability goes to 0. A good example. The probability of flipping nothing but heads when you flip a coin N times is (1/2)^N. If you look at this the larger N is the closer to 0 it gets. In the infinite limit the probability becomes 0. However it's not truly impossible to get an infinite sequence of nothing but head flips. It still exists and still is possible, just infinitely unlikely. It's more a consequence of the fact that probability when you are dealing with infinite possibilities doesn't act like probability when you have only a finite number of outcomes. ",
            "date": "Answered October 24, 2020",
            "views": "361",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Edward Williams",
                    "user_href": "/profile/Edward-Williams-117"
                },
                {
                    "user_id": "Terry Moore",
                    "user_href": "/profile/Terry-Moore-32"
                },
                {
                    "user_id": "Peony White",
                    "user_href": "/profile/Peony-White"
                }
            ]
        },
        {
            "author_info": {
                "name": "Eugene Lin",
                "href": "/profile/Eugene-Lin-27"
            },
            "answer_text": "happen? The probability of an event is a number describing the chance that the event will happen. An event that is certain to happen has a probability of 1 . But probability does not guarantee “when” it will happen. Give you an example, human dies some day, the probability of such event is 1, but no one will guarantee “when” it will happen. ",
            "date": "Answered October 24, 2020",
            "views": "271",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Tom Valler",
                    "user_href": "/profile/Tom-Valler"
                }
            ]
        }
    ]
}