{
    "title": "How much overlap is there between mathematics and philosophy? - Quora",
    "tags": [
        "Analytic Philosophy",
        "Philosophy of Mathematics",
        "Philosophy of Science",
        "Set Theory",
        "Logic (mathematics)",
        "Applied Mathematics",
        "Mathematics Education",
        "Philosophy",
        "Mathematics"
    ],
    "response": [
        {
            "author_info": {
                "name": "Paul P Mealing",
                "href": "/profile/Paul-P-Mealing"
            },
            "answer_text": "Mathematics and philosophy have a long history (at least in Western culture), going back to Plato, and before him, Pythagoras. In fact, Plato actively sought out Pythagoras’s most accomplished student, Archytas of Terentum, and, back in Athens, Plato set up his famous ‘Academy’ using a ‘Pythagorean curriculum’, that he adopted from Archytas, known as the ‘quadrivium’ of arithmetic, geometry, astronomy and music. Before Pythagoras, arithmetic and geometry were seen as tools in the service of accounting and building. Pythagoras believed that there was a metaphysical connection, which was probably closer to numerology than our modern viewpoint. Nevertheless, his quadrivium presupposed a connection between mathematics, music and astronomy, which we all know today is fundamentally correct. Mathematics, science and philosophy form a triumvirate that is still with us today. But the biggest philosophical question involving mathematics is whether it’s invented or discovered. I would contend that it’s probably a combination of both. John D Barrow wrote an excellent book, Pi in the Sky, which covers this topic better than anything else I’ve read. Barrow’s credentials are impressive: Professor of Mathematical Sciences and Director of the Millennium Mathematics Project at Cambridge University, Fellow of Clare Hall, Cambridge, a Fellow of the Royal Society, and current Gresham Professor of Geometry at Gresham College, London. According to one source: ‘His principal area of scientific research is cosmology’. I will provide some selective quotes relevant to the topic. Once an abstract notion of number is present in the mind, and the essence of mathematics is seen to be not the numbers themselves but the collection of relationships that exists between them, then one has entered a new world. And I would contend that it is the relationships that are discovered, and we invent the nomenclature to render them visible to the mind. The idea of mathematics being discovered is associated with mathematical Platonism, which, of course, goes back to Plato. In regard to Platonism, Barrow has this to say: It elevates mathematics close to the status of God... just alter the word ‘God’ to ‘mathematics’ wherever it appears and it makes pretty good sense. Mathematics is part of the world, and yet transcends it. It must exist before and after the Universe. In the next paragraph he says: Most scientists and mathematicians operate as if Platonism is true, regardless of whether they believe that it is. That is, they work as though there were an unknown realm of truth to be discovered. So the ‘overlap between philosophy and mathematics’, as referenced in the question, has a history in Western thought that goes back to the ancient Greeks. In the 20th Century, there is another overlap involving Kurt Godel, Alan Turing and Alonzo Church, because they all proved, in subtly different ways, that there exist mathematical truths that we can’t necessarily determine. That’s an oversimplification, but in practice we know it’s true. Riemann’s famous hypothesis being a case in point. It’s been an open question since 1859, and while most mathematicians believe it’s true, no one has proved it, and whilst it can be solved with a computer to whatever lengths we like, it would take longer than the age of the Universe to prove it by calculation alone (assuming it’s true for all values). That’s not a very satisfactory exposition, but it’s a subject beyond the scope of this post. Godel’s Incompleteness Theorem effectively states that within a formal axiom based mathematical system, there will always exist truths that can’t be proved within that system. This implies that there will always exist mathematical truths that we don’t know, which infers that we can never know all of mathematics. And that’s probably the biggest philosophical consequence ever deduced from a mathematical theorem. ",
            "date": "Answered December 11, 2019",
            "views": "92",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Mackson Isani",
                    "user_href": "/profile/Mackson-Isani"
                }
            ]
        },
        {
            "author_info": {
                "name": "Hubertus Fremerey",
                "href": "/profile/Hubertus-Fremerey-1"
            },
            "answer_text": "Mathematics is a part of logics. But logics is only a small part of philosophy. You can be a world-class mathematician and at the same time very stupid in most real-life problems. Philosophy is first of all asking for the difference of good and evil and the right thing to do as a good human in a good society. No mathematical knowledge would give you an answer on those questions. Mathematics does not even provide the answers on questions relating to the natural sciences. You always have to do experiments and observations. Only then will math be of help when you try to see some order in those observations. Thus we would not know the laws of nature, the laws of gravity, of electricity, of atomic- and nuclear-physics etc. without advances mathematics. But STEM-sciences are not the essence of philosophy. Thus the overlap is not really big. ",
            "date": "Answered December 5, 2019",
            "views": "70",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Gopal Chavali",
                    "user_href": "/profile/Gopal-Chavali-2"
                }
            ]
        },
        {
            "author_info": {
                "name": "Ravini Munchannayakka",
                "href": "/profile/Ravini-Munchannayakka"
            },
            "answer_text": "How much overlap is there between mathematics and philosophy? The Answer to this Question depends a lot on the Context and What Philosophy or Mathematics you are talking about. The ancient Greeks apparently wanted to connect the 2, but in some Eastern Philosophies like Buddhism, there is very little connection to Mathematics. However, in certain instances the Buddha used Mathematical Analogies to illustrate the “Transfinite” Quantities, or atleast to show how Big they were. The likelihood of being born a Human Being, is said to be rarer than the likelihood of a Sea Turtle putting its head through a hole in a Plowshare (just as Jesus said it is easier for a Camel to go through a hole in a needle than …….). This story of the Sea Turtle can be taken as a Foundation for Probability Theory. Also, the Buddha illustrated the Period of a Great Aeon, as being Far Greater than the Total time it takes to Empty a 16 Mile Cube Full of Mustard Seed, by Removing just One Mustard Seed each 100 Years !!!!!!!. ",
            "date": "Answered December 11, 2019",
            "views": "81",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "R. Madanayaka",
                    "user_href": "/profile/R-Madanayaka"
                }
            ]
        },
        {
            "author_info": {
                "name": "Paul Trejo",
                "href": "/profile/Paul-Trejo-1"
            },
            "answer_text": "According to Hegel, Philosophy and Math are completely separate sciences, with completely separate methods, and even separate interests. Even though everybody uses Math, still Math in-itself has no direct interest in Ethics, Politics, Rhetoric, Poetry, Public Speaking, Drama, Art Criticism, History or Metaphysics. Philosophy, however, is directly interested in all these topics. Even though all Natural Sciences use Math — still Math in-itself has no direct interest in Astronomy, Geography, Geology, Botany, Biology, Zoology, Anatomy or Psychology. Philosophy, however, is directly interested in all these topics. The Analytical School attempted to combine Philosophy and Math by restricting Philosophy to Logic, and then by using formal (mathematical) symbols to restate the principles of Logic. Bertrand Russell (1910) was first to promote this as a philosophy, and more than a century later nobody from his school has surpassed him. This means that the Analytical School is stuck in a rut; and hardly resembles Classical Philosophy. ",
            "date": "Answered December 9, 2019",
            "views": "276",
            "upvotes": " View 3 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Ardeshir Sassani",
                    "user_href": "/profile/Ardeshir-Sassani"
                },
                {
                    "user_id": "Skyler T. Asbridge",
                    "user_href": "/profile/Skyler-T-Asbridge"
                },
                {
                    "user_id": "Christopher Dumas",
                    "user_href": "/profile/Christopher-Dumas"
                }
            ]
        },
        {
            "author_info": {
                "name": "Eugene Bucamp",
                "href": "/profile/Eugene-Bucamp"
            },
            "answer_text": "The answer is trivial. Philosophy is our most universal form of rational thought. Consequently, mathematics falls into its purview. Thus, there is something called philosophy of mathematics (Philosophy of mathematics - Wikipedia), which obviously is just a branch of philosophy. There is no mathematics of philosophy, though. Fundamentally, philosophy is grounded in human deductive logic, among other things. This means that to really begin to understand philosophising as a mental activity and start the mathematics of philosophy, we would need to understand, among other things, human deductive logic, and we don’t. So, there is no mathematics of philosophy. There is also no proper science of philosophy. However, there is something called “philosophy of philosophy”, or metaphilosophy. (Metaphilosophy - Wikipedia). This is a good example of how universal philosophy is. By comparison, there is no mathematics of mathematics and no science of science. The Wikipedia article signals the following as “recurrent themes” of the philosophy of mathematics: Relationship between the abstract world of mathematics and the material universe?Role of humankind in developing mathematicsSources of mathematical subject matterOntological status of mathematical entitiesWhat does it mean to refer to a mathematical object?Source and nature of mathematical truthCharacter of mathematical propositionsRelation between logic and mathematicsHermeneutics in mathematicsKinds of inquiry in mathematicsObjectives of mathematical inquiryWhat gives mathematics its hold on experience?Human traits behind mathematicsMathematical beautyJust bewildering. ",
            "date": "Answered November 27, 2019",
            "views": "114",
            "upvotes": " View 2 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Terry Moore",
                    "user_href": "/profile/Terry-Moore-32"
                },
                {
                    "user_id": "James Millikan",
                    "user_href": "/profile/James-Millikan-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Jadine Lee Jacob",
                "href": "/profile/Jadine-Lee-Jacob"
            },
            "answer_text": "I am not an expert in mathematics so I cannot elaborate on this well, but I believe in the field of logic there is quite a bit of overlap. For example, in math you can use logic to make a proof, or a solution to a math problem with steps as to how the solution came about. Similarly, in philosophy, you can write a logical proof to a problem, though instead of using numbers or symbols, the problem is comprised of words. E.g., I believe Descartes wrote a logical proof for his sentiment “I think, therefore I am.” ",
            "date": "Answered May 18, 2020",
            "views": "53",
            "upvotes": " Answer requested by Rudi Berera",
            "upvoters": [
                {
                    "user_id": "Gopal Chavali",
                    "user_href": "/profile/Gopal-Chavali-2"
                },
                {
                    "user_id": "David W. Vogel",
                    "user_href": "/profile/David-W-Vogel"
                }
            ]
        },
        {
            "author_info": {
                "name": "Anna Emdenborg",
                "href": "/profile/Anna-Emdenborg"
            },
            "answer_text": "I as one studied mathematical philosophy at the university of Lund/ Sweden. We read (among others) G Frege on Arithmetics (see the link: Frege’s Theorem and Foundations for Arithmetic ) and R Dedekind (on theory of numbers - continuity and irrational numbers). The explanations given within philosophy by both Frege and Dedekind belong to the foundations of mathematics, and both give precise meaning to the respective parts they explain. Dedekind for instance provided with his essays on the irrational numbers a logical basis for transfinite numbers and properties of the natural numbers, but he also gave a distinction between finite and transfinite (infinite) whole numbers, and logical validity of the type of proof called mathematical or complete induction. ",
            "date": "Answered December 9, 2019",
            "views": "69",
            "upvotes": " Answer requested by Rudi Berera"
        },
        {
            "author_info": {
                "name": "Michiel Bogaert",
                "href": "/profile/Michiel-Bogaert"
            },
            "answer_text": "I think there’s some. A lot of maths is based on “We can’t … but what if you could? Can we draw useful conclusions from that?”. You can’t give away 6 apples, if you only have 2 … but what if you could?2 – 6 = -4a negative number can never be the result of a square … but what if it could?introducing complex numbers: i² = -1You can’t apply the rules of convergent series to divergent ones … but what if you could?1–1+1–1+… = 1/2eventually implies1+2+3+4+…. = -1/12You can’t divide by zero as that’s either plus or negative infinity … but what if those are the same thing?Riemann sphere…",
            "date": "Answered November 27, 2019",
            "views": "88",
            "upvotes": " View 2 Upvoters"
        },
        {
            "author_info": {
                "name": "Ulrich Balbian",
                "href": "/profile/Ulrich-Balbian"
            },
            "answer_text": "Western philosophies of mathematics go as far back as Pythagoras, who described the theory \"everything is mathematics\" (mathematicism), Plato, who paraphrased Pythagoras, and studied the ontological status of mathematical objects, and Aristotle, who studied logic and issues related to infinity (actual versus potential) ... Philosophy of mathematics - Wikipedia https://en.wikipedia.org › wiki › Philosophy_of_mathematics Names of a few philosophers involved in mathematics Plato, Pythagoras, Descartes, Pascal,, Wittgenstein, Leibniz, Frege, Russell, Putnam,Quine, and the list goes on ",
            "date": "Answered December 1, 2019",
            "views": "38",
            "upvotes": " Answer requested by Rudi Berera"
        },
        {
            "author_info": {
                "name": "Ed Macconnell",
                "href": "/profile/Ed-Macconnell"
            },
            "answer_text": "Generally speaking University Mathematics usually finds it's self in the Liberal Arts College , as originating from ancient roots in the philosophical study of Logic. With the the arrival of the modern computer , Pandora's Box is open . Now appears a tool to crunch away at iterations. There is certainly contention with the Elegant solution Camp. Stay tuned ",
            "date": "Answered January 16, 2020",
            "views": "34",
            "upvotes": " Answer requested by Rudi Berera"
        },
        {
            "author_info": {
                "name": "John Tweedel",
                "href": "/profile/John-Tweedel-2"
            },
            "answer_text": "Leibniz: “You cannot delve deeply into mathematics without philosophy, and you cannot delve deeply into philosophy without mathematics.” Philosophy is the science of critical thought (my definition). I like to think of applied critical thought as logic and applied logic as mathematics. That is the connection in my mind. I’m a mathematician by training but a philosopher by nature. Most math students find themselves in limbo between philosophy and physics. ",
            "date": "Answered January 19, 2020",
            "views": "35",
            "upvotes": " Answer requested by Rudi Berera"
        },
        {
            "author_info": {
                "name": "Jim Rock",
                "href": "/profile/Jim-Rock-16"
            },
            "answer_text": "How much overlap is there between mathematics and philosophy? This depends on how you define what constitutes mathematics and philosoply. Many mathematicians believe that all mathematics can be generated using the ZFC axioms of set theory. If you consider ZFC, part of philosophy, then there is a great deal of overlap. ",
            "date": "Answered January 19, 2020",
            "views": "15",
            "upvotes": " Answer requested by Rudi Berera"
        },
        {
            "author_info": {
                "name": "Mike Bauer",
                "href": "/profile/Mike-Bauer-12"
            },
            "answer_text": "both use association to build formal structures. philosophy then destroys those structures as ‘ephemeral’ to reality, and math associates structures with other structures to tell a story. it might be said that math discovers new structures in the process, but math is isolation and negation of what doesn’t count, but believes that it itself redeems reality back by making pictures in, so to speak, the head of a blind man. ",
            "date": "Answered November 27, 2019",
            "views": "30",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Roger Leitch",
                "href": "/profile/Roger-Leitch-1"
            },
            "answer_text": "There is a philosophy of mathematics, just as there's a philosophy of science. There’s the philosophy of religion, and politics, etc as well, where mathematics isn't considered. And logic is studied and used by both philosophers and mathematicians, but I guess that's the only real overlap. ",
            "date": "Answered January 2, 2020",
            "views": "30",
            "upvotes": " Answer requested by Rudi Berera"
        },
        {
            "author_info": {
                "name": "Janet Cunliffe",
                "href": "/profile/Janet-Cunliffe"
            },
            "answer_text": "It depends upon the level of mathematics the student has reached. For basic algebra, geometry, trigonometry and calculous there is very little overlap. However, as you go into advanced math it begins to interwind. Notre Dame offers two PhD’s simultaneously Philosophy and one in math. ",
            "date": "Answered November 30, 2019",
            "views": "18",
            "upvotes": " Answer requested by Rudi Berera"
        },
        {
            "author_info": {
                "name": "Amro Mohamed Fadly",
                "href": "/profile/Amro-Mohamed-Fadly"
            },
            "answer_text": "Abstract mathematics is built upon PhilosophyPhilosophy is concerned with how we think Abstract Mathematics is how to depict the world using symbols ",
            "date": "Answered January 19, 2020",
            "views": "8",
            "upvotes": " Answer requested by Rudi Berera"
        },
        {
            "author_info": {
                "name": "Emily Mazur",
                "href": "/profile/Emily-Mazur-4"
            },
            "answer_text": "There is no mathematics of philosophy. ",
            "date": "Answered January 18, 2020",
            "views": "12",
            "upvotes": " Answer requested by Rudi Berera"
        }
    ]
}