{
    "title": "How to calculate numerology - Quora",
    "tags": [
        "Vedic Numerology",
        "Name Numerology",
        "Numerology",
        "Calculations",
        "Belief and Beliefs"
    ],
    "response": [
        {
            "author_info": {
                "name": "Jassiri Nassor",
                "href": "/profile/Jassiri-Nassor"
            },
            "answer_text": "Each letter of your name has a corresponding number attached to it. Write your name down and Google numbers of numerology. Write out your first, middle and last name. Write the corresponding number underneath each letter of your name. Take the month you were born in, the day and the year and add them together, after you have added up the corresponding numbers that identify with the letters of your birth month. There are formulas for calculating your life purpose, soul purpose, destiny, outer personality, your maturity number, cosmic code, life challenges, life cycle numbers, ideal career and relationship compatibility Their are formulas for understanding the energy of your home, city, state and country you live in. There are formulas for calculating the energy of your phone number, month of the year and individual days of the week. I can go on and on, but it all starts with your name and date of birth, then it is a process of adding numbers. ",
            "date": "Answered January 21, 2019",
            "views": "160",
            "upvotes": " Answer requested by Christopher Spragg"
        },
        {
            "author_info": {
                "name": "Md Hasem",
                "href": "/profile/Md-Hasem-7"
            },
            "answer_text": "Every Birth Number deduces a relatable meaning and provides a strong perspective about a person's traits, challenges s/he might have to face and strengths. Using different approaches for Numerology number using Chaldean/Cheiro, Modern, Pythagorean and Sepherial methods, you can now discover your lucky number and what it holds for you in the future. The scientific \"art\" of numerology establishes a relationship with a living body (physical object) and a number. The connection can be described as esoteric and in the form of an occult along with finances, wealth, relationship with others, spirituality, career growth etc. Numerology Calculator analyses and derive the lucky number by adding either date of birth or name of the person. Also, in case one thinks of getting married, horoscope matching for two kundlis can be done so as to evaluate their compatibility. Numerology lays emphasis on the astrological importance of birth date, its characteristics and what's in store for natives as per their birth number. It is a divine study of numeric values or letters which unfolds one's true identity, personality, talents, weaknesses and skills. A Birth Number represents one's life, hereby establishing a holy connection between a native and the number. ",
            "date": "Answered February 15, 2020",
            "views": "65",
            "upvotes": "0"
        }
    ]
}