{
    "title": "I can't solve hard math problems. I always give up and look at the solution. What should I do to fix that? - Quora",
    "tags": [
        "Problem Solving",
        "Life Advice"
    ],
    "response": [
        {
            "author_info": {
                "name": "Tim Cota",
                "href": "/profile/Tim-Cota"
            },
            "answer_text": "Back in the twentieth century when I could still think I did the same thing as you except that I would make a good effort on my own first. If I was not making any headway I would look at the answer and analyze it to see if I could see how they arrived at the answer. I would then let it sit for a half hour or so and then try to duplicate it on my own. Even knowing the answer sometimes I had to try several times but usually I would get it. I think that as long as you are finding the answer on your own it is a good learning technique. If you still have trouble don’t hesitate to ask for help. As time goes by you should need to peek less and less. Regarding your lack of self confidence I strongly urge you to get a copy of Mindset by Dr. Carol Dweck. You can get it on ebay for $10-12.00 and some sources offer free shipping. I think that every school district should issue a copy to every student at the beginning of their freshman year of high school and teach a mandatory course on it. Dr Dweck took pains to make the book readable for the average young person, no technical jargon. I think that it is a little over 200 pages. It will explain how low self-esteem happens and how to overcome it. I am going to start giving copies to my nieces and nephews.(and grand nieces and nephews) Good luck and hang in there. One of my greatest regrets is not learning higher math. Tim ",
            "date": "Answered May 14, 2017",
            "views": "82",
            "upvotes": " View 8 Upvoters",
            "upvoters": [
                {
                    "user_id": "Rishav Ray",
                    "user_href": "/profile/Rishav-Ray-8"
                },
                {
                    "user_id": "Generic Name",
                    "user_href": "/profile/Generic-Name-84"
                },
                {
                    "user_id": "Shaju Zafor",
                    "user_href": "/profile/Shaju-Zafor"
                },
                {
                    "user_id": "Maia Talbert",
                    "user_href": "/profile/Maia-Talbert"
                },
                {
                    "user_id": "Teddy Nova",
                    "user_href": "/profile/Teddy-Nova-1"
                },
                {
                    "user_id": "Miguel Faria",
                    "user_href": "/profile/Miguel-Faria-10"
                },
                {
                    "user_id": "Jaya Guru",
                    "user_href": "/profile/Jaya-Guru-4"
                },
                {
                    "user_id": "Ray Knightley",
                    "user_href": "/profile/Ray-Knightley"
                }
            ]
        },
        {
            "author_info": {
                "name": "Jered Wasburn-Moses",
                "href": "/profile/Jered-Wasburn-Moses"
            },
            "answer_text": "Unfortunately, the traditional K-12 math curriculum unintentionally teaches students that math problems should take a few minutes at most, and if you can't get it by then you are clearly stupid. Of course, \"real\" mathematicians spend months, or years, or lifetimes, or generations on a particular problem, so this is not a feature of \"real\" mathematics! You need to develop more productive habits of mind. If you do not get a problem right away, that's okay! Let it sit for a while and come back to it later. Invest in a good-sized whiteboard that you can mount on your wall. (It's about $35 for a cheap one.) At the same time, force yourself to persist a little bit longer each time. Work a little past your frustration point, but not too far past it. Think of this like exercise: you want to push yourself, but not so far that you get injured or over-exhausted. If you need a little chocolate or caffeine when you're done, you've probably done it right. ",
            "date": "Answered November 24, 2015",
            "views": "13",
            "upvotes": " View 40 Upvoters",
            "upvoters": [
                {
                    "user_id": "Eddie Lurker",
                    "user_href": "/profile/Eddie-Lurker"
                },
                {
                    "user_id": "Krishna Kripa",
                    "user_href": "/profile/Krishna-Kripa-24"
                },
                {
                    "user_id": "Intisar Affan",
                    "user_href": "/profile/Intisar-Affan"
                },
                {
                    "user_id": "Maia Talbert",
                    "user_href": "/profile/Maia-Talbert"
                },
                {
                    "user_id": "Oscar Bastardo",
                    "user_href": "/profile/Oscar-Bastardo"
                },
                {
                    "user_id": "Daniel F. Mera",
                    "user_href": "/profile/Daniel-F-Mera"
                },
                {
                    "user_id": "Exta Zya",
                    "user_href": "/profile/Exta-Zya"
                },
                {
                    "user_id": "Xinyuan Zhang",
                    "user_href": "/profile/Xinyuan-Zhang-47"
                },
                {
                    "user_id": "Rui Pedro",
                    "user_href": "/profile/Rui-Pedro-11"
                },
                {
                    "user_id": "Shubhangi Sinha",
                    "user_href": "/profile/Shubhangi-Sinha-67"
                }
            ]
        }
    ]
}