{
    "title": "I'm not very good at mathematics, can I still understand astronomy? - Quora",
    "tags": [
        "Learning About Astronomy",
        "Mathematics Education",
        "Astronomy"
    ],
    "response": [
        {
            "author_info": {
                "name": "Kevin Samuels",
                "href": "/profile/Kevin-Samuels-14"
            },
            "answer_text": "Depends on what you want to do with it. Using a telescope and looking at the sky requires no math whatsoever, and even discovering new celestial objects using one is just a matter of recording exactly where and when you saw something. There is a lot of math involved in predicting where the objects will be in the future, but you can always leave that part to other people. I took a course in “descriptive astronomy” in college that had some math, but not very much. Such a class isn’t a path to becoming a professional astronomer, but it will help you understand the universe better. Some parts of it do have numbers, but the numbers aren’t particularly hard. As the Hitchhiker’s Guide to the Galaxy says, “Space is big. Really big.” It doesn’t require much math to understand that point. If you want to be a professional astronomer, then you are the one who will be making the predictions, and that does require quite a bit of math (typically a degree in physics). If that’s where your interest lies, you can take the goal as a motivation to get better at mathematics. No one is born being good at math, and it is never too late to progress. ",
            "date": "Answered April 2, 2018",
            "views": "166",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Casey Patterson",
                "href": "/profile/Casey-Patterson-4"
            },
            "answer_text": "If you want to major in astronomy, your math skills will have to be on point. You're going to have to learn quantum physics, general and special relativity, theoretical mechanics, celestial mechanics, thermodynamics, optics, you name it. You'll have to be able to solve complex differential equations. If you want to have astronomy as a hobby, I recommend just knowing basic algebra and trigonometry. ",
            "date": "Answered April 7, 2018",
            "views": "159",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Joble Mathew",
                    "user_href": "/profile/Joble-Mathew"
                },
                {
                    "user_id": "Jeremy Lowe",
                    "user_href": "/profile/Jeremy-Lowe-3"
                },
                {
                    "user_id": "Nikhil Tomar",
                    "user_href": "/profile/Nikhil-Tomar-4"
                }
            ]
        },
        {
            "author_info": {
                "name": "Shri Raam Saiyan Prince",
                "href": "/profile/Shri-Raam-Saiyan-Prince"
            },
            "answer_text": "Astronomy has various branches, such as astrobiology, physical cosmology, galactic cosmology, etc which do not require any complex maths or physics. But all it takes is a curious mind and a mind faster than light. Outline of astronomy - Wikipedia ",
            "date": "Answered April 2, 2018",
            "views": "103",
            "upvotes": "0"
        }
    ]
}