{
    "title": "If 6 is one solution of the equation x^2 + 3x + k = 10, where k is a constant, what is the other solution? - Quora",
    "tags": [
        "Equations",
        "Calculus"
    ],
    "response": [
        {
            "author_info": {
                "name": "Jeff Suzuki",
                "href": "/profile/Jeff-Suzuki-1"
            },
            "answer_text": "Here’s the way I suspect you’re supposed to answer the question: The most important thing to remember about a solution to an equation is that it is a value that makes the equation a true statement.  So if x = 6 is one solution, then replacing “x” with “6” in the equation will make a true statement. So you know 62+3(6)+k=1062+3(6)+k=10 is true. But if this is true, then k must be whatever value makes 62+3(6)+k=1062+3(6)+k=10 true. So k must be -44. This leads to the quadratic equation x2+3x−44=10x2+3x−44=10, or x2+3x−54=0x2+3x−54=0, which has solutions x = 6 or x = -9. OK, now here’s the way you should solve it. If a, b are the solutions to a quadratic equation, then (x−a)(x−b)=x2−(a+b)x+ab=0(x−a)(x−b)=x2−(a+b)x+ab=0. So the negative of the x-coefficient is the sum of the two roots. So 3=−(a+b)3=−(a+b), where your two roots are a, b. Since you know one root (a = 6), you can find the other root by solving: 3 = -(6 + b), which gets you -9. ",
            "date": "Answered September 6, 2019",
            "views": "148",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Balázs Iván József",
                "href": "/profile/Balázs-Iván-József"
            },
            "answer_text": "The sum of the two roots of a quadratic equation with the main coefficitent = 1 is the opposite of the coefficitent of the first grade member. Vieta's formulas - Wikipedia So the sum of both roots is -3, no matter what k is. If we know 6 being a root, the other must be (drum rolls!) -9. ",
            "date": "Answered September 3, 2019",
            "views": "39",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Subinoy Paul",
                "href": "/profile/Subinoy-Paul-3"
            },
            "answer_text": "Since 6 is a root, 6^3+3×6+k=10 k=-44 x^2+3x-54=0 So other root is - 54/6=-9 ",
            "date": "Answered September 3, 2019",
            "views": "31",
            "upvotes": "0"
        }
    ]
}