{
    "title": "If A = E, B = F, C = G and D = H, then is E = I or E = A? - Quora",
    "tags": [
        "Puzzles and Trick Questions"
    ],
    "response": [
        {
            "author_info": {
                "name": "Daniel Gildenlöw",
                "href": "/profile/Daniel-Gildenlöw"
            },
            "answer_text": "I would argue that you are not providing sufficient data for obtaining any one single correct answer. You must determine more variables. Let me show you… Mathematically, you have already defined A as E, which means (obviously) that E is also A. Thus, E=A. Cipher-wise you are still open. If the cipher is based on the western alphabet then, yes, E=I since E is obviously I (and F would be J and so on). The leading variables (A-D) certainly suggests this, rather convincingly, if we are to base our assumption on experience alone. However, there is nothing further to indicate this than the said leading four variables. You could be sitting on an entirely different code key altogether. We don’t know what happens after D! What if the code key has scrambled the alphabet by groups of four letters? Then A=E could in theory be a jump much larger than four positions, and with E belonging to a different group, the answer could be any letter not already mentioned in the known variables. For all we know, E=M (M being the first in a different group of four letters) or E=Q. The alphabetical key could also still lead to E=A, if the key is only 8 positions/digits long (and ends with H). If the string ends with H and start over on A again, then E=A. Incidentally, this could also work as a musical transposition, if we accept that H is B and B is Bb (B flat) as is often the case when Germanic and American notation is combined. If done correctly, D should have read D=A and then our E=H. However, there is nothing to indicate that this transposition needs to be by the letter/note. Maybe we want to scramble things up in an existing sheet of music? If so, E=X where X is defined as any note within the 12 note system. You could even locate visual keys, like “a leaning/round left side of position one = a vertical line on position two” or you can count closed and/or open structures in the letters and find correlations. Or contextual keys – every letter equals a physical material and the right letter then corresponds to the first letter of its pronounced atomic weight. I guess my bottom line is that, although your question does suggest one of the two solutions you offer is likely preferred, this is only determined by everyday experience within your given cultural and temporal context. Beyond that, really, it might as well result in E=sky ",
            "date": "Answered April 23, 2019",
            "views": "15",
            "upvotes": " View 12 Upvoters",
            "upvoters": [
                {
                    "user_id": "Daniel Lewis Cupps",
                    "user_href": "/profile/Daniel-Lewis-Cupps"
                },
                {
                    "user_id": "Antonis Oikonomopoulos",
                    "user_href": "/profile/Antonis-Oikonomopoulos-1"
                },
                {
                    "user_id": "Maria Hines",
                    "user_href": "/profile/Maria-Hines-16"
                },
                {
                    "user_id": "Yili Lin",
                    "user_href": "/profile/Yili-Lin-2"
                },
                {
                    "user_id": "Yoriki Yamaguchi",
                    "user_href": "/profile/Yoriki-Yamaguchi"
                },
                {
                    "user_id": "Raz Koller",
                    "user_href": "/profile/Raz-Koller"
                },
                {
                    "user_id": "David Sánchez",
                    "user_href": "/profile/David-Sánchez-9-1"
                },
                {
                    "user_id": "Rook Productions",
                    "user_href": "/profile/Rook-Productions"
                },
                {
                    "user_id": "Fardin Khan",
                    "user_href": "/profile/Fardin-Khan-5"
                },
                {
                    "user_id": "Shrijita Som",
                    "user_href": "/profile/শ্রীজিতা-সোম-Shrijita-Som"
                }
            ]
        },
        {
            "author_info": {
                "name": "Marsh Romias",
                "href": "/profile/Marsh-Romias-1"
            },
            "answer_text": "The answer is provided in the first equality: A=E. I think following basic math, if not previously defined as E is equal to A, an answer of four sequential letters beyond E, which would be I. But E was already given as equal to A. Man, I hope that's correct. If not, I could use some Entertainment Tax Accounting to disqualify E equal to A, because E's contracts clearly delineates A is E's equal, but because of E's tax accounting team, agent, and perhaps the SPCA, it could be proven that E has no equal, although A does have an equal. That is why I'm not an Entertainment Industry accountant. ",
            "date": "Answered April 23, 2019",
            "views": "169",
            "upvotes": "0"
        }
    ]
}