{
    "title": "If a2 + 1 = a, then what is the value of a3? - Quora",
    "tags": [
        "Algebra"
    ],
    "response": [
        {
            "author_info": {
                "name": "Ravi Kiran Sagar",
                "href": "/profile/Ravi-Kiran-Sagar"
            },
            "answer_text": "Given equation a^2+1=a Now rewriting the equation a^2 - a = -1 By taking a as common on LHS a(a-1) = -1 From the given equation we know that a-1= a^2 By substituting a-1 as a^2 We get a^3 = -1. ",
            "date": "Answered January 31, 2018",
            "views": "27",
            "upvotes": " View 6 Upvoters",
            "upvoters": [
                {
                    "user_id": "Arunava Dey",
                    "user_href": "/profile/Arunava-Dey-29"
                },
                {
                    "user_id": "Cyrus Leung",
                    "user_href": "/profile/Cyrus-Leung-13"
                },
                {
                    "user_id": "Royal Tara",
                    "user_href": "/profile/Royal-Tara"
                },
                {
                    "user_id": "Siddharth Thakur",
                    "user_href": "/profile/Siddharth-Thakur-55"
                },
                {
                    "user_id": "Amit Kumar",
                    "user_href": "/profile/Amit-Kumar-21839"
                },
                {
                    "user_id": "Rohan",
                    "user_href": "/profile/Rohan-496"
                }
            ]
        },
        {
            "author_info": {
                "name": "Prajanya Yadav",
                "href": "/profile/Prajanya-Yadav-1"
            },
            "answer_text": "As you asked this question.. this seems that you afraid of non real roots ie. You does'nt know what is non real root.... OR... You don't know what is √(-a) where a>0 …(a=0..is of no interest...) So... Well here comes the concept of a imaginary number called iota which is denoted as i (small) and we defined iota ie. i as…(i)^2 = -1 ; So.. √(-a) where a>0 becomes √( a*(-1) ) == (√a) * √(-1) == (√a)* i ; So full slon is here...   Complex number is another set of large number more than that of real numbers... It is represented as (a + i b) where a is called as real part of complex number and b is called as imaginary part of that complex number. De movier's theorm is very useful theorm in terms of powers of complex number which states that... For (a + i b) ^n convert (a + i b) into its polar for which is r* (cos(α) + i sin(α) ) ; where r = √(a^2 + b^2 ) ; α is principle argument of complex number (a + i b) which is defined as angle in anticlockwise sense which complex number makes with real axis on Argand plane.. Where -π< α <= π ; principal argument is our main concern in theory of complex numbers. Here we use some of the terms.. we should clarify their meaning for full understanding.. Polar form is another form to represent the same complex number... As most of the time it is easy to deal with it.. Argand plane is plane where we can draw or represent a complex number same as that of we present coordinate points on x-y plane.. Where x axis is called real line on which we represent real part of complex number and y axis is referred as imaginary line where we represent imaginary part of that complex number  . ",
            "date": "Answered July 7, 2017",
            "views": "631",
            "upvotes": "0"
        }
    ]
}