{
    "title": "If the US wanted to slowly transition to the metric system, which items would it make sense to begin measuring in metric units? - Quora",
    "tags": [
        "Metrics",
        "International System of Units",
        "Measurements"
    ],
    "response": [
        {
            "author_info": {
                "name": "Bill Spencer",
                "href": "/profile/Bill-Spencer-9"
            },
            "answer_text": "*IF* the US wanted to slowly transition to the metric system: First, government should permit blanket use of metric units, and eliminate the requirement for dual labelling in USCS units. (Many or most commodities are permitted to be measured and sold in metric units, but some things are pushed or required to be in round USCS units.) Secondly, all governments (legislatures, agencies, federal, state, and local) should issue all new regulations in exclusively metric units, and start to rephrase existing laws in metric units with a straight conversion. Some legal conversions should be changed to round metric units rather than a straight conversion, e.g., 120 kmph speed limit to replace 70 mph, rather than 112.654… kmph). After that, it is simply an industry by industry, product by product by product adjustment of standard sizing to even metric units, and a withdrawal or prohibition of using USCS units. That is, of course, more easily said than done. For some, it’s relatively easy and just requires a few decades until everyone alive was brought up on the system and feels used to it. No one left to say, “When I was a girl, 32 degrees was freezing!” Some things are just labels, e.g. bridge clearances and truck heights. The bridges can be dual labelled in metric units , then the trucks relabelled, and then the USCS bridge labels removed or painted over. Individually measured bulk items - gasoline, or deli meats, can be converted easily; many pumps or scales have a switch, or can be reprogrammed, although millions of mechanical scales (e.g. grocery produce) cannot be readily and accurately converted to metric measuring, and would have to be replaced. (Approximate scales (not with certified calibrations) could just have a sticker replacing the number label, but mechanical scales certified for legal sale may have to be replaced.) Common components - e.g. bolts and screws - are already available in metric sizes; all that’s required is the will to design new machines and assemblies using them. An exponentially shrinking supply of USCS sizes will be required forever, to maintain old machines and assemblies. Other industries - e.g. milk - require new legal sizes, new common usage, new containers, etc. Care should be taken to be aware of other world-wise standards, e.g. EU, and make US standards the same, rather than inventing a different and incompatible, though metric, size. (E.g., as far as I know, the US is the sole seller of liquor in 1.75 L bottles, a very strange size until you know it replaced the old Half Gallon size (1.8927… L) with a slightly smaller bottle, in “round” metric units.) That’s all it would take, industry by industry and product by product for thousands of industries. *IF* the US cared ro complete its partial conversion. ",
            "date": "Answered November 30, 2018",
            "views": "238",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Claire Bergeron",
                    "user_href": "/profile/Claire-Bergeron-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Susanna Viljanen",
                "href": "/profile/Susanna-Viljanen"
            },
            "answer_text": "First begin with liquids. Most potable liquids, like soft drinks or spirits, are already now sold in litres. Fuel, lubricants and other such liquids are also easy to be measured and sold in litres. (Mind you that US quart is slightly less than one litre and UK quart slightly more, so one litre is approximately the average.) The standard industrial steel drum is 200 litres, so the conversion is easy. Depending on the cup size, one litre is either four large cups (mugs) or five small cups (glasses). The standard European drinking glass is 200 millilitres, so half a glass makes one decilitre. The American liquid measurements have no connection with inch or pound anyway, so transition to litres would be easy. Moreover, litron is a Biblical measurement, so the Fundamentalist religious people would have no objection. Once everyone is confident with liquids, then do the weight transition. Food and drink would be the easiest way to go. You might call 500 g as “new pound” - this is the way how Central European countries originally converted. Do not attempt to do everything at once. The transition is best to be done little by little. ",
            "date": "Answered September 20, 2019",
            "views": "31",
            "upvotes": " View 26 Upvoters",
            "upvoters": [
                {
                    "user_id": "Andrea Uboldi",
                    "user_href": "/profile/Andrea-Uboldi-1"
                },
                {
                    "user_id": "Jesus Soto Martinez",
                    "user_href": "/profile/Jesus-Soto-Martinez"
                },
                {
                    "user_id": "Manish Chacko",
                    "user_href": "/profile/Manish-Chacko-1"
                },
                {
                    "user_id": "Manish Mohan",
                    "user_href": "/profile/Manish-Mohan"
                },
                {
                    "user_id": "Adam Forrester",
                    "user_href": "/profile/Adam-Forrester-8"
                },
                {
                    "user_id": "Ishaan H. Jajodia",
                    "user_href": "/profile/Ishaan-H-Jajodia"
                },
                {
                    "user_id": "Tymoteusz Kazubski",
                    "user_href": "/profile/Tymoteusz-Kazubski"
                },
                {
                    "user_id": "Jonathan Wang",
                    "user_href": "/profile/Jonathan-Wang-64"
                },
                {
                    "user_id": "James Eaton",
                    "user_href": "/profile/James-Eaton-31"
                },
                {
                    "user_id": "Iain McClatchie",
                    "user_href": "/profile/Iain-McClatchie"
                }
            ]
        }
    ]
}