{
    "title": "Is every complex number an imaginary number? - Quora",
    "tags": [
        "Imaginary Numbers",
        "Complex Analysis (mathematics)",
        "Complex Numbers"
    ],
    "response": [
        {
            "author_info": {
                "name": "Bryan Lewis",
                "href": "/profile/Bryan-Lewis-8"
            },
            "answer_text": "I sense some confusion in your question. I’m going to give the real definition and motivation for complex numbers. It takes about six paragraphs. The real numbers are the numbers that we visualize on a straight line, evenly marked off with all the integers, …, -2, -1, 0, 1, 2, … Imagine locating all the fractions on the line, like 1/2 is right in the middle between 0 and 1. 1.25 is one quarter of the way between 1 and 2, and so forth. Call this the x-axis. Now add a y-axis perpendicular to it though 0, just like in elementary algebra. Imagine locating irrational numbers on the x-axis like sqrt(2). You can do that by constructing a right triangle with sides 1 and 1 with vertex at 0, the swinging down the point (1,1) to the x-axis. That will be at sqrt(2). Without going into any more details (it gets complicated), the real numbers are now the points in the smooth continuous x-axis. Besides this geometry, we can add, subtract, multiply, and divide these numbers in the usual way. We say that the real numbers form a “field”. An important feature of a field is that there is a number, 1, such that a times 1 = a no matter what a is. Similarly, there is a number, 0, such that a + 0 = a no mater what a is. I’ll refer to these in a few minutes again. So the real numbers, called R, are “one-dimensional”. Now, big question: We also have the y-axis, and we have all the points on the plane (x,y). This plane is called R^2, or R x R. Can we make R^2 into a field? That means, can we define a way to add and multiply points so that all the usual rules of arithmetic work? Well, we can easily add points: (a,b) + (c,d) = (a+c, b+d). We just add coordinates. This is called vector addition. Note that 0 is just (0,0). But the harder question is how to multiply. It’s not obvious because we can’t just say (a,b) (c,d) = (ac, bd). That won’t work, because then nonzero points could multiply to get 0, like (0,1)(1,0) = (0,0). That’s bad. Cutting the story short, I’m going to skip all the details and just tell the answer. It turns out the right (and really only) definition of multiplication is (a,b) (c,d) = (ac-bd, ad+bc). That’s weird looking, I know. If you are really interested, you can look this up on Wikipedia and check the details. One thing to note: (a,b)(1,0) = (a,b). Check it. So anything times (1,0) is that thing back again. So (1,0) plays the role of 1 in this field. That’s cool because (1,0) is just the point 1 on R (the x-axis). Notice that (0,1)(0,1) = (-1,0). But (-1,0) is just -1 (on the x-axis). So this point (0,1) has the property that (0,1)^2 = -1. Let’s call it i. So i, this mysterious “imaginary number”, is just the point (0,1). i^2 = -1. There’s nothing imaginary at all! As a matter of jargon, the points on the y-axis are called imaginary. But that’s just jargon. Arbitrary points (a,b) are called complex numbers. If b =0 that’s a real number. If a = 0 it’s a (so-called) imaginary number. If you know about vectors you will see that since 1 = (1,0) and i = (0,1), (a,b) = a times 1 + b times i. But a times 1 = a, so this means any complex number (point, vector) can be written as a + bi. Nothing mysterious, nothing “imaginary”. Post script: Wow that was fun, let’s keep going! Let’s make three dimensional space, R^3, into a field. We add vectors, (a,b,c) + (d,e,f) = (a+d, b+e, c+f). BUT there is no way to multiply. That takes proof, but it’s true. R^3 can’t be made into a field. R^4? Not quite: there is something called the quaternions, which almost works. But I’m going to end this little essay now. ",
            "date": "Updated November 19, 2019",
            "views": "23",
            "upvotes": " View 3 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Peter VanderStoep",
                    "user_href": "/profile/Peter-VanderStoep"
                },
                {
                    "user_id": "Jim Kaiser",
                    "user_href": "/profile/Jim-Kaiser-5"
                },
                {
                    "user_id": "Manny Condas",
                    "user_href": "/profile/Manny-Condas"
                }
            ]
        },
        {
            "author_info": {
                "name": "Aniruddha Mukherjee",
                "href": "/profile/অনিরুদ্ধ-মুখার্জি-Aniruddha-Mukherjee"
            },
            "answer_text": "Every imaginary number is a complex number, but the converse is not true. The set of Complex Number is quiet huge and it outnumbers the set of Real Numbers. Complex Numbers are generally represented as [math]z = a + ib[/math] [math]\\tag{1}[/math] where [math]z[/math] is a Complex Number and [math]i = \\sqrt{-1}[/math]. For those who do not know [math]i[/math] is a Greek later called iota. Here, in the expression [math]z= a + ib[/math], [math]a[/math] is called the real part and [math]b[/math] is called the imaginary part of the Complex Number [math]z. [/math] We often write [math]a = \\Re(z)[/math] and [math]b = \\Im(z)[/math]. It is very important to know that [math]a,b \\in \\mathbb R[/math]. Now, coming back to [math]Eq^{n} (1)[/math], we see that if [math]b=0[/math], then [math]z =a,[/math] but [math]a[/math] is a Real Number. Therefore, this proves that [math]\\mathbb R \\subset\\mathbb C[/math], which means all the Real Numbers fall under the set of Complex Numbers. This also proves that Complex can also be in the form of Real Numbers. Now, again, if, in the expression, [math]a =0[/math], then [math]z =ib[/math]. Now this is what we call a purely imaginary number. Hence, it must be clear by now that every Complex Number is not a Imaginary Number. A Complex Number consists of Real Part and an Imaginary Part. A Complex Number is called an imaginary number only when the Real part is zero. Thanks. ",
            "date": "Answered September 3, 2018",
            "views": "856",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Fateh Kundi",
                    "user_href": "/profile/Fateh-Kundi"
                },
                {
                    "user_id": "Arindam Mukherje",
                    "user_href": "/profile/Arindam-Mukherje"
                }
            ]
        }
    ]
}