{
    "title": "Is game theory similar to probability? - Quora",
    "tags": [
        "Game Theory",
        "Probability (statistics)",
        "Statistics (academic discipline)"
    ],
    "response": [
        {
            "author_info": {
                "name": "Luke Fenn",
                "href": "/profile/Luke-Fenn"
            },
            "answer_text": "This question is assuming something wrong. They are not similar, they are intertwined, probability is incorporated into Game Theory.Game theory basically describes the best way to make a decision considering the outcomes and their probability.For example:Consider two prisoners. Both are held by the same jailor who is out to imprison at least one of them. -The prisoners can either choose to confess or remain silent. -Each prisoner does not know the decision of the other until they have both   been sentenced -But they get time to talk about it before to decide upon what they are going to do (lying is possible)  Let's look at the probabilities like this: a sentence of less than or equal to 5 years is optimal, a sentence above that isn't.Therefore looking at it from either prisoner:  The decision to confess has a probability of  =<5 years is 1/2 For the decision to remain silent the probability is 1/4Therefore to confess is the overall most probable to receive a desirable result. This is especially accentuated by the normal desire for minimum outcome of 0 years sentence, therefore a prisoner will attempt to convince the other that they are going to remain silent in order to achieve the mutually best outcome, however most will be doing this in order to convince the other to choose to remain silent whilst they confess and go free. Therefore game theory is a mix of probability, consequences and human nature. ",
            "date": "Answered May 31, 2015",
            "views": "25",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "David Imrik",
                    "user_href": "/profile/David-Imrik"
                },
                {
                    "user_id": "Rona La Bella",
                    "user_href": "/profile/Rona-La-Bella"
                },
                {
                    "user_id": "RachEl Lee",
                    "user_href": "/profile/RachEl-Lee-128"
                },
                {
                    "user_id": "Chris Joosse",
                    "user_href": "/profile/Chris-Joosse"
                }
            ]
        },
        {
            "author_info": {
                "name": "Aaron Brown",
                "href": "/profile/Aaron-Brown-165"
            },
            "answer_text": "They are similar in that both deal with uncertainty. Probability models uncertainty as randomness, the outcome is unknowable and can only be described by a distribution. Game theory models uncertainty as the predictable actions of rational beings. Rational beings will sometimes add randomness to their decisions, resulting in a mixed solution. For example, in the game of poker, you can use probability theory to determine the likelihood of another player having been dealt certain cards. But you must use game theory to analyze the possible meanings of her bets. ",
            "date": "Answered July 25, 2018",
            "views": "999",
            "upvotes": " View 8 Upvoters",
            "upvoters": [
                {
                    "user_id": "Evan LaRiviere",
                    "user_href": "/profile/Evan-LaRiviere-1"
                },
                {
                    "user_id": "Luiz Beckhauser",
                    "user_href": "/profile/Luiz-Beckhauser"
                },
                {
                    "user_id": "Valentine Masson",
                    "user_href": "/profile/Valentine-Masson"
                },
                {
                    "user_id": "Eduardo Fernandez",
                    "user_href": "/profile/Eduardo-Fernandez-12"
                },
                {
                    "user_id": "Lucy Rebekah",
                    "user_href": "/profile/Lucy-Rebekah-1"
                },
                {
                    "user_id": "Tom Hall",
                    "user_href": "/profile/Tom-Hall-116"
                },
                {
                    "user_id": "Zachary Taylor",
                    "user_href": "/profile/Zachary-Taylor-3"
                },
                {
                    "user_id": "Zane Jakobs",
                    "user_href": "/profile/Zane-Jakobs"
                }
            ]
        }
    ]
}