{
    "title": "Is it likely that the U.S. will ever adopt the metric system? Also, how do Americans perceive the metric system? - Quora",
    "tags": [
        "Metric Systems",
        "Metrics",
        "International System of Units",
        "Measurements"
    ],
    "response": [
        {
            "author_info": {
                "name": "Andy Lund",
                "href": "/profile/Andy-Lund-1"
            },
            "answer_text": "Will people ever stop asking this question that has been answered a million times? The US will never adopt the metric system, at least not to the liking of the people who ask this question. The US does not have an officially mandated measurement system. The US does have a preferred system but it is not required by law and probably never will be. Americans (sometimes) like freedom and (sometimes) like small government, they do not want anyone telling them what units of measurement they are required to use. Americans have been using metric for ages. It is the most common system used in science and medicine. It is used by many government agencies including NASA and the military. Metric is widely used in manufacturing and taught in most schools. Metric is even by law the preferred system for trade and commerce. Apparently that isn’t good enough for some people but Americans like having the freedom to choose how they measure things in everyday life. ",
            "date": "Answered August 27, 2019",
            "views": "212",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Brian Vilgusovich",
                    "user_href": "/profile/Brian-Vilgusovich"
                }
            ]
        },
        {
            "author_info": {
                "name": "Horace J Rogers",
                "href": "/profile/Horace-J-Rogers"
            },
            "answer_text": "It probably will not be mandated but a lot of metrification is occurring. In some of my last designs, all of the screws were all metric and metric screws no longer cost more than SAE screws. Electronics has been going metric at a steady pace. Printed circuit boards are now being done in metric rather than thousands of an inch(mils). A 0.1 mm trace is used rather than a 4 mil trace. If you are using a high density BGA package then you have to use metric because round off error in the conversion will cause problems. All electronic packages are now metric designs, this happened about 10 years ago. The only things that really have to change are in the machine tool industry. Converting from metric dimensions in the design to imperial dimensions on the machine is time consuming and a source of error. But the conversion can be made and machine work is just as accurate. It does not matter if customary units are used for milk, gas or any other commercial products. We may never change from mph to kph but it does not matter. The only place that metric will never take over is in Beer. A Pint of Beer is exactly the right amount. A half of a litre is to much, a pint is perfect. ",
            "date": "Answered August 27, 2019",
            "views": "180",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Ruth Holmes",
                    "user_href": "/profile/Ruth-Holmes-1"
                },
                {
                    "user_id": "Brian Vilgusovich",
                    "user_href": "/profile/Brian-Vilgusovich"
                }
            ]
        }
    ]
}