{
    "title": "Is multiplication merely repeated addition? - Quora",
    "tags": [
        "Addition",
        "Multiplication",
        "Arithmetic"
    ],
    "response": [
        {
            "author_info": {
                "name": "Demetrios E. Lekkas",
                "href": "/profile/Demetrios-E-Lekkas"
            },
            "answer_text": "One can go on in considerable length in discussing this. But the simplest most readily understandable answer I have tried on people I talk to (my students included) is this. (Binary) (positive-integer) multiplication is (merely) a repeated addition when (and only when) the multiplier is a pure number and can be referred to as just simply “times”, with no units attached. In these cases, the product is measured in the same units as the multiplicand. Otherwise not. It goes without saying that this principle still holds if both multiplicand and multiplier are unitless pure numbers (scalars), as in abstract arithmetic (3×2 = 3+3 = 2×3 = 2+2+2 = 6). Thus, three apples times two, or “three apples twice” (3 apples × 2), is 3+3 = six apples. This is OK as a (merely) repeated addition (and amounts to precisely the same result as “two apples thrice”). However, the rest of the examples below are instances that aren’t: a rectangular floor of three metres by two metres (3 m × 2 m) is six square metres (6 m²); this multiplication is NOT a repeated addition; a force of three Newtons acting on an object in the direction of its motion through a distance of two metres (3 N × 2 m) produces work of six Joules (6 J); this multiplication is NOT a repeated addition; three men working for two hours (3 men × 2 hrs) produce a labour output of six manhours (6 mn-hrs); this multiplication is NOT a repeated addition — and it is NOT the same as the output of two men working for three hours (2 men × 3 hrs), just ask the labour union! I hope this is all as clear to everyone as it is to me. And I also do hope that it highlights how equally treacherous an idea it is to always be spontaneously mentally converting multiplications to areas, as though this — repeated addition included — were a necessary instance of geometric-type multi-dimensionality, i.e. when the x- and y-axes are measured with the same units. The confusion stems from our current overexposure to analytic geometry with its Cartesian coordinates, and from our processing of this mental image as arithmetic, geometry, physics, economics etc., all in equal footage as if they were the same thing. Quite often, analytic geometry is just a convenient analogical pictorial convention and can get very misleading if misconstrued as literal geometry or as a righteous geometric “version” of just any phenomenon. If anything, Euclidean calculation of area of a rectangle is NEITHER an exhaustive typical general instance of multiplication NOR a repeated addition — unless, perhaps, one is counting and adding up prefabricated “unit squares”, such as factory tiles for floors, that is. If the question had been the other way around, as in “is repeated addition merely multiplication?”, the answer would certainly have been in the affirmative: an unequivocal “yes”. The converse as asked above may be affirmative in a certain specific set of circumstances, but not necessarily. ",
            "date": "Updated September 13, 2019",
            "views": "38",
            "upvotes": " View 17 Upvoters",
            "upvoters": [
                {
                    "user_id": "Alec Wilson",
                    "user_href": "/profile/Alec-Wilson-19"
                },
                {
                    "user_id": "John Doe",
                    "user_href": "/profile/John-Doe-29444"
                },
                {
                    "user_id": "Elvis Salcinovic",
                    "user_href": "/profile/Elvis-Salcinovic"
                },
                {
                    "user_id": "Charles Conlon",
                    "user_href": "/profile/Charles-Conlon"
                },
                {
                    "user_id": "Besard Hoxha",
                    "user_href": "/profile/Besard-Hoxha"
                },
                {
                    "user_id": "Nikhar Rakhashia",
                    "user_href": "/profile/Nikhar-Rakhashia"
                },
                {
                    "user_id": "Lorel Rockley",
                    "user_href": "/profile/Lorel-Rockley"
                },
                {
                    "user_id": "Evan Fulop",
                    "user_href": "/profile/Evan-Fulop"
                },
                {
                    "user_id": "Ivica Podnar",
                    "user_href": "/profile/Ivica-Podnar"
                },
                {
                    "user_id": "Lars Goodier",
                    "user_href": "/profile/Lars-Goodier"
                },
                {
                    "user_id": "George Zervos",
                    "user_href": "/profile/George-Zervos-6"
                },
                {
                    "user_id": "Dale N Reynolds",
                    "user_href": "/profile/Dale-N-Reynolds"
                },
                {
                    "user_id": "Ambrose Lo",
                    "user_href": "/profile/Ambrose-Lo"
                },
                {
                    "user_id": "William Chen",
                    "user_href": "/profile/William-Chen-109"
                },
                {
                    "user_id": "Zane Jakobs",
                    "user_href": "/profile/Zane-Jakobs"
                },
                {
                    "user_id": "Ivan Quartey",
                    "user_href": "/profile/Ivan-Quartey"
                },
                {
                    "user_id": "Rodrigo Angulo",
                    "user_href": "/profile/Rodrigo-Angulo-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Michel Paul",
                "href": "/profile/Michel-Paul-1"
            },
            "answer_text": "No, it is not, and the belief that it is creates problems for students who go on to advanced math classes. It is easy to see how that belief gets created, as repeated addition works very nicely with the integers as a way of computing products. However, note that nowhere in any text is multiplication defined as repeated addition. If multiplication was actually defined as addition, then there could be no such thing as a field in algebra, and that’s kind of important. An algebraic field is composed of two fundamental operations on a set of items that fulfill certain axioms. If one operation were defined simply in terms of the other, then there would only be one operation, and the notion of field would break down. Another concept that is actually another way to think about multiplication is set intersection. Consider a product such as blue circle. It is a product of blue and circle, and we can think of it as the intersection of the sets of blue things and circular things. Students used to thinking about multiplication solely in terms of repeated addition are bound to hit a wall there. See my answer to What is multiplication? ",
            "date": "Answered March 28, 2018",
            "views": "404",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Aryendra Singh",
                    "user_href": "/profile/Aryendra-Singh-7"
                }
            ]
        },
        {
            "author_info": {
                "name": "Alexander Farrugia",
                "href": "/profile/Alexander-Farrugia"
            },
            "answer_text": "Most of the time, no. For positive real numbers, one way to ‘visualize’ multiplication is by the area of a rectangle. The number a×ba×b is the area that a rectangle with length aa and breadth bb occupies. This goes into a few conundrums like ‘I might not be able to measure that exactly’, but, at least, people can get the gist of it. For negatives, everything works as before, with the proviso that the product of two numbers is positive if and only if the numbers have the same sign. Why that is true is… well… complicated. But… The product of complex numbers is certainly not repeated addition and certainly not area. The product of matrices is certainly not repeated addition and certainly not area. The product of polynomials is certainly not repeated addition and certainly not area. And so on. That shows you that the process of multiplication is much more general than “repeated addition”. ",
            "date": "Answered November 29, 2017",
            "views": "17",
            "upvotes": " View 35 Upvoters",
            "upvoters": [
                {
                    "user_id": "Charles Conlon",
                    "user_href": "/profile/Charles-Conlon"
                },
                {
                    "user_id": "Suraj Bhoslé",
                    "user_href": "/profile/Suraj-Bhoslé"
                },
                {
                    "user_id": "Venkat Panchadi",
                    "user_href": "/profile/Venkat-Panchadi"
                },
                {
                    "user_id": "Demetrios E. Lekkas",
                    "user_href": "/profile/Demetrios-E-Lekkas"
                },
                {
                    "user_id": "Edward James",
                    "user_href": "/profile/Edward-James-27"
                },
                {
                    "user_id": "John Tomilson",
                    "user_href": "/profile/John-Tomilson"
                },
                {
                    "user_id": "Richard Cain",
                    "user_href": "/profile/Richard-Cain-8"
                },
                {
                    "user_id": "Yashee Sinha",
                    "user_href": "/profile/Yashee-Sinha"
                },
                {
                    "user_id": "Nicolás Miari",
                    "user_href": "/profile/Nicolás-Miari"
                },
                {
                    "user_id": "Steven de Rooij",
                    "user_href": "/profile/Steven-de-Rooij"
                },
                {
                    "user_id": "Dhruv Gupta",
                    "user_href": "/profile/Dhruv-Gupta-65"
                },
                {
                    "user_id": "Rodrigo Angulo",
                    "user_href": "/profile/Rodrigo-Angulo-1"
                },
                {
                    "user_id": "Clarence John Cabahug",
                    "user_href": "/profile/Clarence-John-Cabahug"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/Thomas-L-Honeycutt-1"
                },
                {
                    "user_id": "Henning Breede",
                    "user_href": "/profile/Henning-Breede"
                },
                {
                    "user_id": "Neel Shah",
                    "user_href": "/profile/Neel-Shah-180"
                },
                {
                    "user_id": "Sandeep Tuniki",
                    "user_href": "/profile/Sandeep-Tuniki-1"
                },
                {
                    "user_id": "Alan Bustany",
                    "user_href": "/profile/Alan-Bustany"
                },
                {
                    "user_id": "Danish Akhtar",
                    "user_href": "/profile/Danish-Akhtar-36"
                },
                {
                    "user_id": "João Guilherme Madeira Araújo",
                    "user_href": "/profile/João-Guilherme-Madeira-Araújo"
                },
                {
                    "user_id": "John Tearne",
                    "user_href": "/profile/John-Tearne-1"
                },
                {
                    "user_id": "Mark Gritter",
                    "user_href": "/profile/Mark-Gritter"
                },
                {
                    "user_id": "Parth Parikh",
                    "user_href": "/profile/Parth-Parikh-86"
                },
                {
                    "user_id": "Graham Giles",
                    "user_href": "/profile/Graham-Giles"
                },
                {
                    "user_id": "Manny Condas",
                    "user_href": "/profile/Manny-Condas"
                },
                {
                    "user_id": "Steve Stevens",
                    "user_href": "/profile/Steve-Stevens-9"
                },
                {
                    "user_id": "Ronald Pearl",
                    "user_href": "/profile/Ronald-Pearl-1"
                },
                {
                    "user_id": "Andreas Santucci",
                    "user_href": "/profile/Andreas-Santucci"
                },
                {
                    "user_id": "Benjamin Meier",
                    "user_href": "/profile/Benjamin-Meier-5"
                },
                {
                    "user_id": "Prasad Agrawal",
                    "user_href": "/profile/Prasad-Agrawal"
                },
                {
                    "user_id": "Eduardo Gomes",
                    "user_href": "/profile/Eduardo-Gomes-16"
                },
                {
                    "user_id": "Tamoghna Chowdhury",
                    "user_href": "/profile/Tamoghna-Chowdhury"
                },
                {
                    "user_id": "Deep Sarkar (दीप सरकार )",
                    "user_href": "/profile/Deep-Sarkar-दीप-सरकार"
                },
                {
                    "user_id": "Sarvesh Chakraborty",
                    "user_href": "/profile/Sarvesh-Chakraborty-3"
                },
                {
                    "user_id": "Sumedh Khanolkar",
                    "user_href": "/profile/Sumedh-Khanolkar"
                }
            ]
        },
        {
            "author_info": {
                "name": "Dan Christensen",
                "href": "/profile/Dan-Christensen-8"
            },
            "answer_text": "Multiplication on the natural numbers can be defined in terms of addition as follows: For all a∈Na∈N, we have a×2=a+aa×2=a+aFor all a,b∈Na,b∈N, we have a×(b+1)=a×b+aa×(b+1)=a×b+aUsing these rules, for all n∈Nn∈N we can derive: n×2=n+nn×2=n+n n×3=n+n+nn×3=n+n+n n×4=n+n+n+nn×4=n+n+n+n ⋮⋮ It turns out there is only one binary function on the natural numbers that satisfies (1) and (2). Because of the cancelability of addition on NN, we must have n×1=nn×1=n and n×0=0n×0=0. (Proof left as an exercise.) In this sense, multiplication on NN is merely repeated addition.) ",
            "date": "Answered December 2, 2017",
            "views": "248",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Clement Lee",
                    "user_href": "/profile/Clement-Lee-50"
                },
                {
                    "user_id": "Peter Mattsson",
                    "user_href": "/profile/Peter-Mattsson-4"
                }
            ]
        },
        {
            "author_info": {
                "name": "Ciro Pabon",
                "href": "/profile/Ciro-Pabon"
            },
            "answer_text": "Well, this is like the seventh version of this very same question. However… Yes, it seems so for integers, natural numbers and fractions, until you get into irrational numbers, where repeated addition gets in trouble, because how can you say you are adding repeatedly and endless string of numbers? Just at the level of fractions, that idea of endless strings of numbers is one reason why a lot of people have trouble understanding that 0.99999… is equal to 1. I won’t delve into multiplication of complex numbers, vectors, matrices, polynomials or quaternions, where the answer is a resounding no. ",
            "date": "Answered October 2, 2020",
            "views": "37",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Pratyush Raj",
                "href": "/profile/Pratyush-Raj-141"
            },
            "answer_text": "Hey there! Yes, it seems so for integers, natural numbers and fractions, until you get into irrational numbers, where repeated addition gets in trouble, because how can you say you are adding repeatedly and endless string of numbers? That is one reason why a lot of people have trouble understanding that 0.99999… is equal to 1. I won’t delve into multiplication of complex numbers, vectors, matrices, polynomials or quaternions, where the answer is a resounding no. Hope it helps. ",
            "date": "Answered October 2, 2020",
            "views": "29",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Martin Snyder",
                "href": "/profile/Martin-Snyder-5"
            },
            "answer_text": "If you want to get down to basics, yes it is.  If you see 3x2, then breaking it down to simplify is adding 2 to itself 3 times.  Hence, the old expression of times tables.  Where adding 2 to itself  3 times is 2+2+2  =6 .  But for larger problems it is simpler to   multiply or times. ",
            "date": "Answered October 25, 2020",
            "views": "123",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Ashwin Krishna",
                    "user_href": "/profile/Ashwin-Krishna-59"
                }
            ]
        },
        {
            "author_info": {
                "name": "Mike Alexander",
                "href": "/profile/Mike-Alexander-184"
            },
            "answer_text": "Absolutely! Though it's a slow way to compute a multiplication. Because of this, humans learn times tables and column multiplication. Computers do column multiplication, but in binary, so they don't need times tables because for every column they only ever need to multiply by 1 or 0. ",
            "date": "Answered October 2, 2020",
            "views": "25",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Jean-Paul Hii",
                "href": "/profile/Jean-Paul-Hii"
            },
            "answer_text": "Yes, you can think of multiplication as the repeated addition of the same number. E.g 3+3+3+3, the repeated addition of 3 four times, so that’s 4x3=12. ",
            "date": "Answered September 19, 2019",
            "views": "57",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Roland Leblanc",
                    "user_href": "/profile/Roland-Leblanc-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Ziemowit Jankowski",
                "href": "/profile/Ziemowit-Jankowski"
            },
            "answer_text": "Yes, at the level of mathematics taught at primary school level the best way of understanding multiplication is as repeated addition. ",
            "date": "Answered October 2, 2020",
            "views": "18",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Charles Holmes",
                "href": "/profile/Charles-Holmes-66"
            },
            "answer_text": "The quintessential answer is “sometimes”. Which answer shouldn't disappoint or frustrate since reliance on few things, including mathematics, is absolute. C.H. ",
            "date": "Answered September 21, 2019",
            "views": "62",
            "upvotes": "0"
        }
    ]
}