{
    "title": "Is the sum of two complex numbers always a complex number? - Quora",
    "tags": [
        "Complex Numbers"
    ],
    "response": [
        {
            "author_info": {
                "name": "Bin Yamin",
                "href": "/profile/Bin-Yamin"
            },
            "answer_text": "Take two numbers w+ui x+yi Let's assume their sum is a non complex number v +0i (w + ui) + (x+ yi ) = v + 0i Using basic rules of complex addition, imaginary parts equal to imaginary parts u + y = 0 u = -y So if the imaginary parts of the two complex numbers are same with opposite sign the sum is purely real. Although real numbers are subset of complex numbers so yes, it is a complex number too. On the other hand, if you are asking whether complex numbers are closed under addition, ie. do we get numbers outside of the complex numbers then no, addition of two complex numbers will always give a number that falls under complex numbers or its subsets. If you were thinking, subtraction of counting numbers led to discovery of negative numbers and integers; division led to fractions, rationals, square root of negative gave complex numbers, is there anything beyond them? Then sure there is: there are quaternions and octonions. Google them for more details. ",
            "date": "Answered September 20, 2018",
            "views": "29",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Anubhav Balodhi",
                    "user_href": "/profile/Anubhav-Balodhi"
                }
            ]
        },
        {
            "author_info": {
                "name": "Rahul Yedida",
                "href": "/profile/Rahul-Yedida"
            },
            "answer_text": "Well, not necessarily, and this is quite easy to prove. Let’s take for example,  and . Adding them up gives us , which is real. Technically speaking, every real number is a complex number since the set of real numbers is simply a subset of the set of complex numbers, but I think you mean the complex numbers which have an imaginary part when you asked your question. If you did mean that, then any two numbers where the imaginary parts are equal in absolute magnitude but opposite in sign, like  and , give a real number. ",
            "date": "Answered March 24, 2017",
            "views": "44",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Aparna Munshi",
                    "user_href": "/profile/Aparna-Munshi-2"
                },
                {
                    "user_id": "Rohit Bhisikar",
                    "user_href": "/profile/Rohit-Bhisikar-1"
                }
            ]
        }
    ]
}