{
    "title": "Is the metric system flawed? - Quora",
    "tags": [
        "Metric Systems",
        "Units of Measure",
        "International System of Units"
    ],
    "response": [
        {
            "author_info": {
                "name": "Bill Spencer",
                "href": "/profile/Bill-Spencer-9"
            },
            "answer_text": "Certainly, yes, the metric system is flawed. For disadvantages in general, seeWhat are the disadvantages of the metric system? But specifically *flaws* rather than simple disadvantages: The metre is wrong. It was intended as 1/10,000,000 of the quarter circumference of the Earth (equator to North Pole, through Paris). In fact, one of the two astronomers assigned to measure the Earth (at least from Barcelona to Calais) made a mistake early on, and buried the mistake. The preliminary metre had been in use for several years before he died and the other astronomer discovered why he had kept his field notes so secret. But the fact that the metre was 0.2 mm to short had to be kept hidden, because adoption by the public was tenuous.Because the metre is too short, the polar Earth circumference is 40,008 km (40,007.86 km) instead of 40,000 km exactly.The choice of the Earth to measure was very well for 1790, but proved to be a bad choice. We now know it makes the speed of light 299,792,458 m/s. With a very slightly shorter metre, the speed of light could have been exactly 300,000,000 m/s. (And, hey, the metre is wrong anyway.) Or a metric foot defined by the speed of light being exactly 1,000,000,000 metric feet/second. Now that we are defining all units (even the kilogram, as of 2019) by fundamental constants of the universe, we really SHOULD change the definitions of metre, kilogram, second, Ampere, etc. to fit a nice even multiple or submultiple of the fundamental constant.The principal unit of weight is the kg, not the g. This is the only primary unit specified with a prefix.Time was never decimalized (although that was tried!). And then they standardized on the second, an arbitrary man-made unit, rather than the day, which at least has a physical definition.Si permits a host of very non-SI units to continue to be used, from the calorie (kcal) to the electron volt. They even use “kilograms-force” for the specific power of rocket engines! <cringe>This whole scheme of a nearly infinite set of units made from prefixes just doesn’t work. The prefixed units actually become proper nouns in daily use, and you can’t switch to other prefixes as you should.A great example is km. The Earth circumference above is 40,008 km. Well, that is really supposed to be 40 Mm. But when is the last time you heard megametres? Never, I’ll bet. A kilometer has become its own standard for length. People can visualize one. It has stopped just being 1000 metres, and has become a special length all on its own.In another example, I was advised to take 1000 mg of calcium a day. Ah — that’s just 1 g of calcium. Why express it as 1000 * 1/1000 gram? But, no, pharmaceuticals are measured in micro- or milligrams, not in grams. Even when they ARE a gram.deci, centa, deka, and hecto are inconsistent with the rest of the metric system. Everything is in multiples of 10^3 — except these four prefixes. Originally, powers of 10 were thought to be the key thing to this new system of measurement, but it turned out that powers of 1000 are what’s important.Use of 1/10. A litre is 1/10 metre cubed. At least 1 ml is 1 mm cubed. And 1000 litres is 1 cubic metre. Because volume is to the third power, 1/10 turns into thousandths and thousands.But the are is an area 10 m on a side. A total of 100 square metres. We mostly see this today as a hectare, or 100 of these 100 square metre areas, thus 10,000 square metres. It’s quite an odd power of 10 to use.We could have just used 1 m on a side — but we already have used it, as square metres. All area should be in square metres.(Square kilometres would be 1 million square metres.)Squares and cubes. Exactly how do you notate them?1 litre is 1 cubic decimetre. And it is 1/1000 of a cubic metre. Is that [math]1 dm^3[/math]? Or does [math]dm^3[/math] mean 1/10 (deci) of [math]1 m^3[/math]? Or is a litre 1 milli [math]m^3[/math]? How would you write that?There IS a right answer. But it is not obvious just from the notation.Oh, flaw, after flaw, after flaw. But, it IS the most rational system yet created by Earthlings and widely used. ",
            "date": "Updated June 30, 2019",
            "views": "493",
            "upvotes": " View 5 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Mark Lesmeister",
                    "user_href": "/profile/Mark-Lesmeister"
                },
                {
                    "user_id": "Pete Trott",
                    "user_href": "/profile/Pete-Trott"
                },
                {
                    "user_id": "Wayne Ruffner",
                    "user_href": "/profile/Wayne-Ruffner"
                },
                {
                    "user_id": "Zunnur Awan",
                    "user_href": "/profile/Zunnur-Awan"
                },
                {
                    "user_id": "Diane Egan",
                    "user_href": "/profile/Diane-Egan"
                }
            ]
        },
        {
            "author_info": {
                "name": "Greg Lehey",
                "href": "/profile/Greg-Lehey"
            },
            "answer_text": "Yes, of course it is. Nothing is perfect. But what particular flaw would interest you? Today I discovered that China has “30 million ha of rice production”. What does that mean? A ha is 100 a (“are” in full). So 30 million ha is 3 Ga. Somehow that doesn’t feel right, but it is. Or you might complain that the metre was supposed to be 1/10000 of the distance from the North Pole to the Equator, originally through Paris, later a little further West. And it isn’t: it’s about 0.02% too long. See http://www.transnav.eu/files/So+What+is+Actually+the+Distance+from+the+Equator+to+the+Pole+%C3%A2%E2%82%AC%E2%80%9C+Overview+of+the+Meridian+Distance+Approximations,435.pdf How can we live with such inaccuracies? If you have some other issue, be sure to add a comment. ",
            "date": "Answered April 20, 2019",
            "views": "248",
            "upvotes": " View 2 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Diane Egan",
                    "user_href": "/profile/Diane-Egan"
                },
                {
                    "user_id": "Doug Smith",
                    "user_href": "/profile/Doug-Smith-142"
                }
            ]
        }
    ]
}