{
    "title": "One day Raj left home and walked 5 km northwards, turned right and walked for 10km and turned left and walked 5 km more and finally turned left and walked 10km. How many kilometres will he have to walk to reach his home straight? - Quora",
    "tags": [
        "Distance (physics and mathematics)",
        "Mathematics Word Problems",
        "Problem Solving"
    ],
    "response": [
        {
            "author_info": {
                "name": "Mounodeep Chakraborty",
                "href": "/profile/Mounodeep-Chakraborty-1"
            },
            "answer_text": "Raj had already walked a lot of kms. Now he needs some energy supplements to gain his energy. He needs water as well. Raj realised that he is stupid. He could have walked straight from his home and be in his current position rather than doing world tour. Pray for Raj as he is already dehydrated and exhausted. He wants to reach home straight. He calculated the straight distance as 10 km but he needs some transportation. I will be very happy if someone gives Raj a lift. Raj is waiting for Simran to join. Simran is doing another world tour and this will be found in another question on quora saying how much distance Simran needs to travel to meet Raj. Simran is enjoying and living her life to the fullest as told by her father. Raj and Simran both are dumb as they don't use Google maps which always gives the best route to navigate. To help Raj reach home, you can donate in the below account: Paytm: XYZ , 9675469484 Currently, I have contacted the local police. They are trying their best to help Raj reach home. Thanks a lot for reading !! Hakuna Matata ",
            "date": "Answered July 9, 2020",
            "views": "15",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Prabhat Soni",
                    "user_href": "/profile/Prabhat-Soni-6"
                }
            ]
        },
        {
            "author_info": {
                "name": "Eduardo Dequilla",
                "href": "/profile/Eduardo-Dequilla"
            },
            "answer_text": " To go home straight Raj must turn left and walks southward by 10 km. ",
            "date": "Answered July 4, 2020",
            "views": "819",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Prajwal Jadhav",
                    "user_href": "/profile/Prajwal-Jadhav-16"
                },
                {
                    "user_id": "Pavithra Parmeshwar",
                    "user_href": "/profile/Pavithra-Parmeshwar"
                },
                {
                    "user_id": "Meriole Rosell",
                    "user_href": "/profile/Meriole-Rosell"
                }
            ]
        }
    ]
}