{
    "title": "Six burgers and three large fries cost $30. 4 burgers and 2 large fries cost $20. What is the cost of a burger? A large fry? - Quora",
    "tags": [
        "Mathematics Word Problems",
        "Puzzles and Trick Questions",
        "Problem Solving",
        "Algebra"
    ],
    "response": [
        {
            "author_info": {
                "name": "Ryan Peterson",
                "href": "/profile/Ryan-Peterson-292"
            },
            "answer_text": "Other answers seem to conclude that the possibilities are infinite. While that's correct on a theoretical perspective, on the realistic perspective there are a lot of possible answers, but it is still a considerably small finite number. First, let's assume we are working with US currency, where prices are limited to a scale of differences of $0.01. This is pretty reasonable in most instances, unless you're buying gasoline which always is priced at intervals of $0.009 for some asinine reason. Since we're buying food, not gasoline, we don't need to worry about that asininity. Next, let's assume that the store wants to take in money on all its sales, so no prices at or below zero are acceptable for either the fries or burger. This obvious business choice pairs up with the previous assumption to give us a very small number of possibilities. But there are still a lot more than a single right answer. Looking at the 2 equations, we have: 6B + 3F = $30.00 4B + 2F = $20.00 These can both be reduced (by dividing by 3 and 2 respectively) to: 2B + F = $10.00 As they are essentially the same equation, there is not a single right answer, but as I have stated, with some realistic assumptions, there is a small list of possible answers. With those assumptions, the smallest that B can be is $0.01 and F minimizes at $0.02, while the largest that B can be is $4.99 and F can max out at $9.98, since with B at $0.01 minimally, we must subtract 2B, or $0.02, from $10.00 to get the maximum value of F, and any approved number with B above $4.99 would result in F being at or below $0.00. Moving forward, if we start out with B at $0.01, and F at $9.98, we can add $0.01 to B while subtracting $0.02 from F at each step up until B hits its maximum of $4.99. Now that we have concluded that B can be any decimal value from $0.01 to $4.99, we know that there are 498 possible answers, with F = $10 - 2B for each of the 498 aforementioned possible values of B. ",
            "date": "Answered May 23, 2020",
            "views": "397",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Sharon Breivogel-Leonard",
                    "user_href": "/profile/Sharon-Breivogel-Leonard"
                }
            ]
        },
        {
            "author_info": {
                "name": "Bill Otto",
                "href": "/profile/Bill-Otto-5"
            },
            "answer_text": "Indeterminant. You do not have enough information. All we know is that two burgers and a fry cost $10. We don't have any information on the relative cost of a burger vs. fries. Tell us how much one burger and a large fry cost for instance. ",
            "date": "Answered May 22, 2020",
            "views": "181",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Sharon Breivogel-Leonard",
                    "user_href": "/profile/Sharon-Breivogel-Leonard"
                },
                {
                    "user_id": "Ira J Perlow",
                    "user_href": "/profile/Ira-J-Perlow"
                }
            ]
        }
    ]
}