{
    "title": "The traffic lights at three different road crossings change after every 18 sec, 72 sec and 96 sec respectively. If they all change simultaneously at 5 : 20 : 00 hours, then find the time at which they will change simultaneously? - Quora",
    "tags": [
        "Traffic Signals",
        "Aptitude",
        "Quantitative Aptitude",
        "Traffic",
        "Time (physics)",
        "Puzzles and Trick Questions",
        "Mathematics"
    ],
    "response": [
        {
            "author_info": {
                "name": "AR Ramaninathan",
                "href": "/profile/AR-Ramaninathan"
            },
            "answer_text": "If all three start at the same time the first one would have operated 4 times by the time second one starts a second time. As 4×18= 72. Let us see second and third. When second is in the second cycle after 72 seconds the third one is still in the first cycle. After two cycles the third one would have clocked 2×96= 192 seconds. However in 192 second second one would be in the middle of third cycle as 2×72=144. This way we can add each time cycles of each of the three traffic lights. First 18+18+18+…..+18 = 288 seconds Second 72+72+72+72 = 288 second Third 96+96+96 = 288 seconds Thus at the end of 288 seconds all three will change ( rather start the cycle together - They will start to mismatch after 18 seconds and all three wout match after 288 seconds) Basically if you workout LCM of 18, 72, and 96 at the end of the LCM seconds all three signals will start together and repeat after elapse of every LCM time. 18 = 2×9=2×3×3 72 = 2× 36 =2×4×9 = 2×2×2×3×3 96 = 2×48= 2×2×24= 2×2×2×12 = 2×2×2×2×2×3 Therefore LCM is 2×2×2×2×2×3×3 =288 288 seconds after 5:20:00 is 5:24:48 (as 288/60=4min 48sec) ",
            "date": "Answered October 24, 2020",
            "views": "27",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Anand Prakash",
                "href": "/profile/Anand-Prakash-398"
            },
            "answer_text": "Traffic light change simultaneous, we required to take LCM of traffic light changing time. 18=2*3*3. 72=2*2*2*3*3. 96=2*2*2*2*2*3. LCM=3^2*2^5=9*16=288 So by the question, traffic light will be change simultaneous after 288 seconds with time 5:20. Which gives 5:20+0:04+0:00:48 =5:24:48 or at 5′ o clock 24 minutes 48 seconds for changing simultaneous. ",
            "date": "Answered October 24, 2020",
            "views": "27",
            "upvotes": "0"
        }
    ]
}