{
    "title": "Two people were walking in opposite directions. Both of them walked 6 miles forward then took right and walked 8 miles. How far is each from starting positions? - Quora",
    "tags": [
        "Distance (physics and mathematics)",
        "Mathematics Word Problems"
    ],
    "response": [
        {
            "author_info": {
                "name": "Mark Rowley",
                "href": "/profile/Mark-Rowley-3"
            },
            "answer_text": "For your answer, you need only one person to walk. He/she walks for 6 miles, turns right and walks for 8 miles. 6 miles and 8 miles are two sides of a triangle and the distance from the starting point to the finishing point is the hypotenuse. Using Pythagoras’s theorem Hypotenuse ^2 = first distance ^2 + second distance ^ 2 = 6^2 + 8^2 = 36 + 64 = 100. The distance from start point to finish point is square root of 100, which is 10 miles. If the other person does the same thing walking in the opposite direction, the distance between his /her starting point and finishing point will also be 10 miles. The total distance between each person at their finishing points is 20 miles. If you make any right-angle triangle where the two shorter sides are 3 and 4 or multiples of 3 and 4 by the same factor, the length of the hypotenuse will always be 5 or a multiple of 5. In the example, 8 = 2 x 4 and 6 = 2 x 3, and 10 = 2 x 5. ",
            "date": "Answered May 2, 2020",
            "views": "420",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Chandra Shekar",
                    "user_href": "/profile/Chandra-Shekar-1387"
                }
            ]
        },
        {
            "author_info": {
                "name": "Bruce Alan Martin",
                "href": "/profile/Bruce-Alan-Martin"
            },
            "answer_text": "Two people were walking in opposite directions. Both of them walked 6 miles forward then took right and walked 8 miles. How far is each from starting positions? Here is how to solve problems of this sort: What is the displacement along the line they were first walking?ANSWER: 12 miles.What is the displacement along a line perpendicular to the one they line they first walked?ANSWER: 16 miles.What is the hypotenuse of a right triangle with shorter sides of 12 & 16?(This assumes that all of the walks are in the same Euclidean Plane,so we can therefore use decomposition and superposition, treating the X and Y coordinates separately).Before wasting time squaring these two lengths (and messing around with square-root of the sum), just consider the smallest Pythagorean Triple (i.e., three integers where the square of the largest is equal to the sum of the squares of the smaller ones.):ANSWER: 3–4–5Because the two sides — 12 miles & 16 miles — are in the same proportion as 3 & 4, but multiplied by four, and because these are two “similar” triangles, the larger triangle’s hypotenuse must have a length that is equal to the smaller triangle’s hypotenuse (5) multiplied by four.",
            "date": "Answered May 9, 2020",
            "views": "153",
            "upvotes": " Answer requested by Labib Hasan Kafi"
        }
    ]
}