{
    "title": "What is a dhokla? And how do I make one? - Quora",
    "tags": [
        "Cooking Dhokla",
        "Dhokla"
    ],
    "response": [
        {
            "author_info": {
                "name": "Jitesh Bhatt",
                "href": "/profile/Jitesh-Bhatt-3"
            },
            "answer_text": "Dhokla (Gujarati: ઢોકળા ḍhōkḷā) is a vegetarian food item that originates from the Indian state of Gujarat. It is made with a fermented batter derived from rice and split chickpeas. Dhokla can be eaten for breakfast, as a main course, as a side dish, or as a snack. Here is my way to make instant khaman dhokla at home. There are various ways how you can do this at home. The real traditional dhokla required overnight fermenting and a lot of other ingredients. I am showing you the most popular one that people usually make at home across the country (khaman)- instant version. Most of Indian cooking is about slow cooking. So, be patient. Follow the recipe and you will crack it. Here is my 3 different ways (checkout the playlist to Video) to make Dhokla at home. Let me know how yours turned out and do ask questions if you have. Here follow step by step:  ",
            "date": "Answered June 4, 2018",
            "views": "384",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Akanksha Prudy",
                "href": "/profile/Akanksha-Prudy"
            },
            "answer_text": "Dhokla is a gujarati snack,soft & fluffy.It is actually a steamed cake made of gram flour.There are many things in it.It tastes tangy.I use the instant mix to prepare it.One can buy the gits dhokla mix & use it as per instructions.When the mix is steamed.place it in a flat plate then to give a final touch sizzle it with mustard seed,curry leaves,one teaspoon sugar…& delicious dhokla are ready. ",
            "date": "Answered November 4, 2017",
            "views": "11",
            "upvotes": " View 3 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Divyanshu Verma",
                    "user_href": "/profile/Divyanshu-Verma-66"
                },
                {
                    "user_id": "Dharmendra Shah",
                    "user_href": "/profile/Dharmendra-Shah-17"
                },
                {
                    "user_id": "Sakshi Monu",
                    "user_href": "/profile/Sakshi-Monu"
                }
            ]
        }
    ]
}