{
    "title": "What is the difference between Java and Blue Java? - Quora",
    "tags": [
        "Core Java",
        "Java (software platform)",
        "Java Platform, Enterprise Edition",
        "Java (programming language)",
        "Programming Languages"
    ],
    "response": [
        {
            "author_info": {
                "name": "Manish K Singh",
                "href": "/profile/Manish-K-Singh-10"
            },
            "answer_text": "Yes, Well answered Prashoo Shukla . BlueJ - BlueJ is basically IDE means Integrated Development Environment. Its is used for development of Java Program and Applications. The main reason behind development of BlueJ is for educational purpose but it also can be use for development of some small scale application.  Its main features are that it is: Simple - BlueJ has a deliberately smaller and simpler interface than professional environments like NetBeans or Eclipse. This allows beginners to get started more quickly, and without being overwhelmed.Designed for teaching - BlueJ is deliberately designed with good pedagogy in mind. There is a popular textbook designed for teaching introductory university/college courses with BlueJ, and a site full of teaching resources.Interactive - BlueJ allows you to interact with objects. You can inspect their value, call methods on them, pass them as parameters and more. You can also directly invoke Java expressions without compiling. Thus BlueJ is a powerful graphical shell/REPL for Java.Portable - BlueJ runs on Windows, Mac OS X, Linux and other platforms which run Java. It can also run without installation from a USB stick.Mature - BlueJ is over fifteen years old, but continues to be updated and supported by a full-time team. We aim to respond to all technical support requests within one working day.Innovative - BlueJ has several features not seen before in other IDEs. Its object bench, code pad, and scope colouring were all original BlueJ features.Java - Java is a general-purpose, concurrent, object-oriented, class-based, and the runtime environment(JRE) which consists of JVM which is the cornerstone of the Java platform. Components in Java JVM (Java Virtual Machine) It is an abstract machine. It is a specification that provides a run-time environment in which Java bytecode can be executed. It follows three notations: Specification: It is a document that describes the implementation of the Java virtual machine. It is provided by Sun and other companies.Implementation: It is a program that meets the requirements of JVM specification.Runtime Instance: An instance of JVM is created whenever you write a java command on the command prompt and run the class.JRE (Java Runtime Environment) JRE refers to a runtime environment in which Java bytecode can be executed. It implements the JVM (Java Virtual Machine) and provides all the class libraries and other support files that JVM uses at runtime. So JRE is a software package that contains what is required to run a Java program. Basically, it’s an implementation of the JVM which physically exists.  JDK(Java Development Kit) It is the tool necessary to:- CompileDocumentPackage Java programs.The JDK completely includes JRE which contains tools for Java programmers. The Java Development Kit is provided free of charge. Along with JRE, it includes an interpreter/loader, a compiler (javac), an archiver (jar), a documentation generator (Javadoc) and other tools needed in Java development. In short, it contains JRE + development tools. Thanks …) Happy Learning. Follow me Manish K Singh ",
            "date": "Answered June 26, 2019",
            "views": "250",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Arnab Manna",
                    "user_href": "/profile/Arnab-Manna-12"
                }
            ]
        },
        {
            "author_info": {
                "name": "Mary Reibey",
                "href": "/profile/Mary-Reibey-1"
            },
            "answer_text": "Java is a language that is designed to create programs. BlueJ is meant as an \"integrated development environment\" (IDE) for the Java programming language mostly used for the educational objective, but also applicable for small scale development. ",
            "date": "Answered June 4, 2020",
            "views": "45",
            "upvotes": "0"
        }
    ]
}