{
    "title": "What is the value of (a+b) ^2=? - Quora",
    "tags": [
        "Inspiration",
        "Software Engineers",
        "Facebook (product)",
        "Technology",
        "Algebra",
        "Mathematics"
    ],
    "response": [
        {
            "author_info": {
                "name": "Tanya Shrivastava",
                "href": "/profile/Tanya-Shrivastava-1"
            },
            "answer_text": "Sum of the sum of squares of a and b respectively, and twice the product of the same two numbers. Edit: I was asked in the comments why would I answer a question like that, and I decided to make this a part of my answer. Here’s why: There are people who don’t know the answer to it. The answer can be written in more than one ways. If I see a question, think I can add something to it, I do. When equations are spoken/written like this, as sentences, it becomes hard to understand what exactly the person is talking about. In this case, we were already given the mathematical expression, so it was easier. But if this answer opens the mind of the person who asked this in a way that says, okay, equations sound way more complex and confusing when written that way-in words, when actually the sentences are just supposed to be the explanations of what the equation is trying to convey. So it should be obvious to them. That inspires to build skill. Do you know what the sum of the sum of twice the product of three numbers taken two at a time and the individual squares of those numbers summed will be? Did it take you longer to understand what it meant than if you were just given the equation? Why is it not just as obvious to you? That’s something to think about. And that’s why I wrote this answer. ",
            "date": "Updated February 13, 2017",
            "views": "18",
            "upvotes": " View 7 Upvoters",
            "upvoters": [
                {
                    "user_id": "Kaizad Mistry",
                    "user_href": "/profile/Kaìzad-M-Misty"
                },
                {
                    "user_id": "Kshitij Vatsa",
                    "user_href": "/profile/Kshitij-Vatsa-1"
                },
                {
                    "user_id": "Ansuli Basumatary",
                    "user_href": "/profile/Ansuli-Basumatary"
                },
                {
                    "user_id": "Rochak Khandelwal",
                    "user_href": "/profile/Rochak-Khandelwal"
                },
                {
                    "user_id": "Ravikummar M",
                    "user_href": "/profile/Ravikummar-M"
                },
                {
                    "user_id": "Gaurav Chaudhary",
                    "user_href": "/profile/Gaurav-Chaudhary-291"
                },
                {
                    "user_id": "Karan Dev",
                    "user_href": "/profile/Karan-Dev"
                }
            ]
        },
        {
            "author_info": {
                "name": "Rahul Saroff",
                "href": "/profile/Rahul-Saroff"
            },
            "answer_text": "This is quite a sinple question to answer with a formula. However, it doesn't quite clear the picture.. I assume that if you had wanted the formula or its derivation you wouldn't have posted this question on Quora. A simple Google Search would have sufficed. However, since you have posted this on Quora…let me make the picture a bit clearer in your head.. (A+B) ^2=(A+B)(A+B) We can represent it as a simple multiplication using the following… Take a 2x2 grid. Label the rows as A and B and the columns also as A and B. Now in the grid multiply the row and column labels and fill the value.. Now add all the values in each square. Something like this…  Hope this helped clarify your concept… Have a good day! ",
            "date": "Answered February 5, 2017",
            "views": "2",
            "upvotes": " View 24 Upvoters",
            "upvoters": [
                {
                    "user_id": "Kishan Kori",
                    "user_href": "/profile/Kishan-Kori"
                },
                {
                    "user_id": "Anshul Nigam",
                    "user_href": "/profile/Anshul-Nigam-11"
                },
                {
                    "user_id": "Tarun Kumar Manoharan",
                    "user_href": "/profile/Tarun-Kumar-Manoharan"
                },
                {
                    "user_id": "Prateek Arora",
                    "user_href": "/profile/Prateek-Arora-132"
                },
                {
                    "user_id": "Naman Udeshi",
                    "user_href": "/profile/Naman-Udeshi"
                },
                {
                    "user_id": "Vaishnavi Vyshu",
                    "user_href": "/profile/Vaishnavi-Vyshu-7"
                },
                {
                    "user_id": "Krishna Bhagat",
                    "user_href": "/profile/Krishna-Bhagat-8"
                },
                {
                    "user_id": "Rahul Rai",
                    "user_href": "/profile/Rahul-Rai-427"
                },
                {
                    "user_id": "Arnav Mhatre",
                    "user_href": "/profile/Arnav-Mhatre-1"
                },
                {
                    "user_id": "Mohammad Shakir",
                    "user_href": "/profile/Mohammad-Shakir-29"
                }
            ]
        }
    ]
}