{
    "title": "What is the absolute value of -4? - Quora",
    "tags": [
        "Absolute Value"
    ],
    "response": [
        {
            "author_info": {
                "name": "Drake Johnson",
                "href": "/profile/Drake-Johnson-52"
            },
            "answer_text": "Good question! In math, we’re taught a lot of things about numbers. We are taught about positive numbers, negative numbers, and even (eventually) imaginary numbers. We know that positive numbers are above (greater than) zero and negative numbers are below (less than) zero. Now, allow me to draw a very crappy number-line… ← -5— -4— -3— -2— -1—[math]0[/math]—1—2—3—4—5→ However, let me clean this up a bit. I just want to focus on three numbers from this number-line: [math]-4[/math], [math]0[/math], and [math]4[/math]. ←— -4————[math]0[/math]————4—→ Awesome! We’ve got our number-line. Now, let me talk about absolute value for a second before I move on. Absolute value is the distance a number is from [math]0[/math]. Let’s pretend you’re walking to one of two parks from your house. These two parks are the exact same distance from your house, but the opposite direction. Hicken’s Park is 4 blocks west from your house and Charity Park is 4 blocks east. The front door of your house faces east (towards Charity Park) and your back door faces west (toward Hicken’s Park). Now, one day you walk to Charity park to meet up with your best friend. Of course, you walk 4 blocks to get there. The next day, you go the opposite direction to meet up with a cousin at Hicken’s Park. Again, you walk 4 blocks to get there. Now, the point of all this is that, even though Hicken’s Park is 4 blocks behind your house, you don’t say “I walked negative 4 blocks to get to this park.” No, you just say you walked 4 blocks to get to either park. What does any of that have to do with absolute value? Well, imagine Hicken’s Park as the [math]-4[/math] on the number-line. Like I said, the absolute value is the distance from [math]0[/math]. No one says they went negative 4 blocks or drove negative [math]20[/math] miles; that doesn’t make sense. This means that distance (even in math) is always positive! [math]-4[/math] is [math]4[/math] numbers away from [math]0[/math], so we can say “the absolute value of [math]-4[/math] is [math]4[/math] because [math]-4[/math] is [math]4[/math] numbers away from [math]0[/math].” Hope that helps! ",
            "date": "Answered September 3, 2018",
            "views": "818",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Niclas Löwing",
                "href": "/profile/Niclas-Löwing"
            },
            "answer_text": "An absolute value can be defined by the distance to origo. So -4 has a distance of four to origo. The answer is 4 ",
            "date": "Answered September 3, 2018",
            "views": "211",
            "upvotes": "0"
        }
    ]
}