{
    "title": "What is the answer to (a+b)² ? - Quora",
    "tags": [
        "Suppose A+b=2a Which One of These Expressions Equals B-a?",
        "Algebra Homework Question",
        "Algebra"
    ],
    "response": [
        {
            "author_info": {
                "name": "Zak Vogt",
                "href": "/profile/Zak-Vogt"
            },
            "answer_text": "2(a+b) It's not solvable but you want to simplify the equation as much as possible. 2(a+b) is as solvable as you can get. It leaves nothing left to be factored out. Algebra is about simplifying. There's another way to look at it. My background is in programming, where (a+b)*2 is perfectly acceptable. See, programmers are lazy. We like to type as little as possible. a*2 +b*2 is kind of sloppy when programming because it takes longer to type and looks a bit “muddier”. Excel would be =SUM(A1,B1)*2. Think of A1 AND B1 as variables. They are just pointers to an address containing a value. (More programmer thinking but Excel is a good visualization sometimes.) I'm 99% sure you only needed the algebraic explanation but sometimes it helps to think about things in multiple ways for better understanding. I like my answers to help people learn instead of just giving an answer. I hope this helps in all applications! Credit to the guy below me who reminded me how long I've been out of Junior high algebra. ",
            "date": "Updated March 21, 2019",
            "views": "124",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Uzair Tahir",
                    "user_href": "/profile/Uzair-Tahir-23"
                },
                {
                    "user_id": "Mitun Naha",
                    "user_href": "/profile/Mitun-Naha"
                }
            ]
        },
        {
            "author_info": {
                "name": "Alireza Badami [على رضا بدامي]",
                "href": "/profile/Alireza-Badami-على-رضا-بدامي"
            },
            "answer_text": "(a+b)^2= (a+b) (a+b) By further calculations, we get First term of first bracket multiply by full second bracket and second term of first bracket multiply by full second bracket Now substitute the value in the above mathematical statement: a(a+b) + b(a+b) =a^2+ab+ba+b^2 a(a+b) + b(a+b)=a^2 + 2ab + b^2. ",
            "date": "Answered May 25, 2020",
            "views": "32",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Usha Kannan",
                    "user_href": "/profile/Usha-Kannan-34"
                },
                {
                    "user_id": "ABHI Khurana",
                    "user_href": "/profile/ABHI-Khurana-10"
                }
            ]
        }
    ]
}