{
    "title": "What is true randomness? - Quora",
    "tags": [
        "Randomness (statistics)",
        "Word Definitions, Terminology, and Jargon",
        "Probability (statistics)"
    ],
    "response": [
        {
            "author_info": {
                "name": "Samudrala Venkata Krishna",
                "href": "/profile/Samudrala-Venkata-Krishna"
            },
            "answer_text": "Theoretically random is when the same inputs produce varying output s Most common example given is tossing a coin or a drunken man's walk (Brownian motion). Personally (I did my Ph.D. in stochastic Physics.), after 55 years after my Ph.D I have turned into a sort spirituality and feel that there is nothing random. Everything happens as it should as per a set of laws which we cannot understand. Take for example the tossing of the coin. The one who tosses may be the same ; but when he tosses the same coing three times, his effort will not be the same in the fourth attempt. Also in the tim ethat lapsed between the first toss and the second one so many things have changed . earths position relative to other heavenly bodies is now different. Hence the assumption that the coin is and can be tossed under identical circumstance is an optimisti cfalsehood. To assume that the position of earth and the heavenly bodies will have no effect on the coin is ignorance. Thus randomness is an unreal concept. Closely relatedf phenomenon is Bifurcation and Chaos. As a scientist said once, Probability is a nice mathematical tool but in reality it is legitamization of our Ignorance. ",
            "date": "Answered August 15, 2015",
            "views": "606",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Raul Laban",
                    "user_href": "/profile/Raul-Laban"
                }
            ]
        },
        {
            "author_info": {
                "name": "Muzammil Khan",
                "href": "/profile/Muzammil-Khan-18"
            },
            "answer_text": "this link has papers on true randomness: Page on nature.com ",
            "date": "Answered May 6, 2015",
            "views": "220",
            "upvotes": " Answer requested by Gopal Meena"
        }
    ]
}