{
    "title": "What are the applications of Stoke’s theorem? - Quora",
    "tags": [
        "Stokes Theorem",
        "Theorems and Lemmas"
    ],
    "response": [
        {
            "author_info": {
                "name": "Abhishek Singh",
                "href": "/profile/Abhishek-Singh-2373"
            },
            "answer_text": "Basic use of stokes theorem arises when dealing wth the calculations in the areasof the magnetic field. According to Stokes theorem: It relates the surface integral of the curl of a vector field with the line integral of that same vector field around the boundary of the surface.Basically Stokes theorem is a 3-D version of the Green’s theorem. The need for Stokes theorem arises when dealing with the vector calculus. Actually, Water turbines and cyclone may be a example of Stokes and Green’s theorem.Stokes's theorem is a widely applicable theorem in mathematics as well as in many other fields. This theorem is proved to be very important tool in combination with Gauss' theorem in order to work with different sorts of line integrals and surface integrals. Other field of application include: Stokes' theorem is also used for the interpretation of curl of a vector field. This theorem is quite often used in physics, especially in electromagnetism. Stokes' theorem and its generalized form are very important in finding line integral of some particular curve and also in determining the curl of a bounded surface. ",
            "date": "Answered March 20, 2018",
            "views": "97",
            "upvotes": " View 11 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Bikash Thakur",
                    "user_href": "/profile/Bikash-Thakur-75"
                },
                {
                    "user_id": "Calvary Ntim",
                    "user_href": "/profile/Calvary-Ntim"
                },
                {
                    "user_id": "Yaw Afrifa",
                    "user_href": "/profile/Yaw-Afrifa-3"
                },
                {
                    "user_id": "Moksh Kumar",
                    "user_href": "/profile/Moksh-Kumar-8"
                },
                {
                    "user_id": "Raj Kumar",
                    "user_href": "/profile/Raj-Kumar-23020"
                },
                {
                    "user_id": "Valmor Nascimento",
                    "user_href": "/profile/Valmor-Nascimento"
                },
                {
                    "user_id": "BANOTH YUGANDHAR",
                    "user_href": "/profile/BANOTH-YUGANDHAR"
                },
                {
                    "user_id": "Ilakkiya S",
                    "user_href": "/profile/Ilakkiya-S-11"
                },
                {
                    "user_id": "Catline Emanuel",
                    "user_href": "/profile/Catline-Emanuel"
                },
                {
                    "user_id": "Samuel Kumar",
                    "user_href": "/profile/Samuel-Kumar-60"
                }
            ]
        },
        {
            "author_info": {
                "name": "Gabe Enicks",
                "href": "/profile/Gabe-Enicks"
            },
            "answer_text": "Well it depends on what you want to do with it. Stokes theorem deals with the double integral of some boundary or region D of the curl of the vector field F•dr. Now we have to think about what the curl of a vector field gives us. To put it a briefly, the curl of a vector field is an operator typically applied to 3-dimensional vector fields in form of: Curl(F), where F = f(x,y,z)i + g(x,y,z)j + h(x,y,z)k Where i, j and k are the x, y and z unit vectors. Every point of the curl of the vector field is represented by a vector where the certain attributes of these vectors such as magnitude and direction give you an idea of the rotation of this vector field about some point. The double integral of this, however, gives you the total amount of “curl” or “twist” with respect to the boundary or region. Where can this apply? This can apply to fluids, such as some liquid in a “whirl pool” motion. Or it can apply to electromagnetism. ",
            "date": "Answered December 30, 2016",
            "views": "69",
            "upvotes": " View 6 Upvoters",
            "upvoters": [
                {
                    "user_id": "Yaw Afrifa",
                    "user_href": "/profile/Yaw-Afrifa-3"
                },
                {
                    "user_id": "A.x.e",
                    "user_href": "/profile/A-x-e-1"
                },
                {
                    "user_id": "AKP",
                    "user_href": "/profile/AKP-13"
                },
                {
                    "user_id": "Sofia Khan",
                    "user_href": "/profile/Sofia-Khan-82"
                },
                {
                    "user_id": "Bramhatanu Banerjee",
                    "user_href": "/profile/Bramhatanu-Banerjee"
                },
                {
                    "user_id": "Fawad Khan",
                    "user_href": "/profile/Fawad-Khan-149"
                }
            ]
        }
    ]
}