{
    "title": "What are the differences between Java, Core Java, Advanced Java, J2EE, and JavaScript? - Quora",
    "tags": [
        "J2EE Web Application",
        "Core Java",
        "JavaScript (programming language)",
        "Java (programming language)",
        "Programming Languages"
    ],
    "response": [
        {
            "author_info": {
                "name": "Ravindra Solanki",
                "href": "/profile/Ravindra-Solanki-5"
            },
            "answer_text": "There is nothing like core java it is called as j2SE(Java 2 Standard edition). People usually pronounces it as core java but it isn't. Core means basic thus we can say core is the basics of java so core java can be said as a part of java which is complete platform including J2SE,J2EE & J2ME. Advanced Java:- Advanced Java is the next advanced level concept of Java programming.Advanced Java is used for developing the web based application and enterprise application.Although we here these words all over the world, but we don't find them in oracle sites. 'Core', 'Advanced' are two terms which confuse a lot. But oracle has a clear definition for J2SE and J2EE. So one can think J2SE as core Java and J2EE as advanced Java. If I sumarise Core Java is part of Java. Java has Core Java (J2SE), Advanced Java(J2EE), & J2ME.  J2SE (Java 2 standard edition) - for developing desktop applications, forms the core/base API.J2EE (Java 2 enterprise edition ) -for applications which run on servers, for eg. web sites. (Spring, Struts are the java frameworks mainly used for J2EE)J2ME ( Java 2 micro edition )-for applications which run on resource constrained devices (small scale devices) like cell phones, for example games.JavaScript & Java Both are completely different technology with different purpose.  How is JavaScript different from Java? The JavaScript programming language, developed by Netscape, Inc., is not part of the Java platform. JavaScript does not create applets or stand-alone applications. In its most common form, JavaScript resides inside HTML documents, and can provide levels of interactivity to web pages that are not achievable with simple HTML.  Key differences between Java and JavaScript: Java is an OOP programming language while Java Script is an OOP scripting language.Java creates applications that run in a virtual machine or browser while JavaScript code is run on a browser only.Java code needs to be compiled while JavaScript code are all in text.They require different plug-ins.Hope it Helps you. References: - How is JavaScript different from Java? (https://www.java.com/en/download/faq/java_javascript.xml) Difference between java and advanced java? ",
            "date": "Answered October 10, 2017",
            "views": "13",
            "upvotes": " View 13 Upvoters",
            "upvoters": [
                {
                    "user_id": "Prashant Kumar",
                    "user_href": "/profile/Prashant-Kumar-1140"
                },
                {
                    "user_id": "Swarnim Bhardwaj",
                    "user_href": "/profile/Swarnim-Bhardwaj"
                },
                {
                    "user_id": "Purushottam Mishra",
                    "user_href": "/profile/Purushottam-Mishra-28"
                },
                {
                    "user_id": "M.B.Mullanaver",
                    "user_href": "/profile/M-B-Mullanaver"
                },
                {
                    "user_id": "Tekumalla Saisriram",
                    "user_href": "/profile/Tekumalla-Saisriram"
                },
                {
                    "user_id": "Yusuf Adeyemo Olawale",
                    "user_href": "/profile/Yusuf-Adeyemo-Olawale"
                },
                {
                    "user_id": "Saifa Saif",
                    "user_href": "/profile/Saifa-Saif"
                },
                {
                    "user_id": "NIKUNJ RATHOD",
                    "user_href": "/profile/NIKUNJ-RATHOD-19"
                },
                {
                    "user_id": "Katakwar Vivek",
                    "user_href": "/profile/Katakwar-Vivek"
                },
                {
                    "user_id": "Ankur",
                    "user_href": "/profile/Ankur-500"
                }
            ]
        },
        {
            "author_info": {
                "name": "Nik Varma",
                "href": "/profile/Nik-Varma"
            },
            "answer_text": "Java: This is the basic level, in which you can learn how to write a Hello World program in Java and create basic Java programs for Calculator etc. Core Java: At this level, you have to gain expertise in Java Collections, Java Multi-threading, OOPS concepts, Polymorphism, Java Exception handling etc. This is the level at which you can get a Job in a company. Advanced Java: As the name suggests, at this level you are expected to know not only core Java but also related packages etc. You have to know XML handling, JSON parsing, REST service creation etc. JavaScript: JavaScript is an interpreted programming or script language from Netscape. It is somewhat similar in capability to Microsoft'sVisual Basic, Sun's Tcl, the UNIX-derived Perl, and IBM's REXX. In general, script languages are easier and faster to code in than the more structured and compiled languages such as C and C++. Script languages generally take longer to process than compiled languages, but are very useful for shorter programs. JavaScript is used in Web site development to do such things as: Automatically change a formatted date on a Web page Cause a linked-to page to appear in a popup window Cause text or a graphic image to change during a mouse rollover JavaScript uses some of the same ideas found in Java, the compiled object-oriented programming derived from C++. JavaScript code can be imbedded in HTML pages and interpreted by the Web browser (or client). JavaScript can also be run at the server as in Microsoft's Active Server Pages before the page is sent to the requestor. Both Microsoft and Netscape browsers support JavaScript, but sometimes in slightly different ways. Short for Java 2 Platform Enterprise Edition. J2EE is a platform-independent, Java-centric environment from Sun for developing, building and deploying Web-based enterprise applications online. The J2EE platform consists of a set of services, APIs, and protocolsthat provide the functionality for developing multitiered, Web-based applications. Some of the key features and services of J2EE: At the client tier, J2EE supports pure HTML, as well as Java applets or applications. It relies on Java Server Pages and servletcode to create HTML or other formatted data for the client.Enterprise JavaBeans (EJBs) provide another layer where the platform's logic is stored. An EJB server provides functions such as threading, concurrency, security and memory management. These services are transparent to the author.Java Database Connectivity (JDBC), which is the Java equivalent to ODBC, is the standard interface for Java databases.The Java servlet API enhances consistency for developers without requiring a graphical user interface.Below are the original URL What is J2EE? Webopedia Definition What is difference between Java, core Java and JavaScript? ",
            "date": "Answered October 10, 2017",
            "views": "358",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Ravindra Solanki",
                    "user_href": "/profile/Ravindra-Solanki-5"
                },
                {
                    "user_id": "Deepika Dasara",
                    "user_href": "/profile/Deepika-Dasara-1"
                },
                {
                    "user_id": "Abhishek Sreekumar",
                    "user_href": "/profile/Abhishek-Sreekumar-7"
                }
            ]
        }
    ]
}