{
    "title": "What are the equations of a circle with the centre (3, 5) and tangent to the line x + y =2? - Quora",
    "tags": [
        "Middle and High School Math Homework Question ",
        "Circles",
        "Equations",
        "Geometry"
    ],
    "response": [
        {
            "author_info": {
                "name": "Michael Matusek",
                "href": "/profile/Michael-Matusek"
            },
            "answer_text": "All we need is the radial distance for the circle to come up with the equation. The idea would be to construct the line perpendicular to , let’s call that . That perpendicular line must be , let’s call it . Since we want the circle whose boundary is tangent to  we want the line  to have exactly the same intercept, and therefore  and  intersect at (0,2). This means the circle has the point (0,2) on its boundary, the blue line is  and the red line is .  Now, since we have two points (the center and a point on the boundary) we can determine the radius via the distance formula:  Thus the circle had radius  centered at (3,5). The equation of the circle is   This can be generalized a little more depending on the equation of the line and the center of the circle. One would simply need to use the center of the circle (3,5) to determine the y-intercept of the perpendicular line. And from there you would need to determine the point of intersection with the original line to get the boundary point. In this case to find  in the line  we would plug in (3,5) to the equation  and solve for  which would yield  So the y-intercept is (0,2) which in this problem also happens to be where the lines  and  intersect. I’d recommend trying this out with various examples, for instance try finding the equation of the circle whose center is (4,-6) tangent to the line -. You’ll see that the solution comes a little harder than in this problem you’ve posted. ",
            "date": "Answered April 3, 2020",
            "views": "70",
            "upvotes": " Answer requested by Thomson Tee"
        },
        {
            "author_info": {
                "name": "Dee Stoddard",
                "href": "/profile/Dee-Stoddard-1"
            },
            "answer_text": "x+y=2 can be written y=-x+2 in order to find the radius of the circle, we need to find the perpendicular line to our tangent that crosses our circle center tangent slope is -1. perpendicular is negative reciprocal -(1/-1) or 1 our offsets are 3 and 5, so y-5=x-3 or y=x+2 to find the intersection of our tangent and our radius, combine the 2 formulas, since y=y: -x+2=x+2 -x=x x=0 plug 0 into either formula: 0+2=2, -0+2=2 x,y = 0,2 the line segment that goes from our center to the edge of the circle is 3,5 to 0,2 subtract the difference 3–0=3,5–2=3. our hypotenuse of the triangle of 3,3 is sqrt(3^2 +3^2) or sqrt(18). this is our radius circle formula format is x^2 + y^2 = r^2 offsets x,y are 3,5 and r=sqrt(18) (x-3)^2 + (y-5)^2 = 18  ",
            "date": "Answered March 28, 2020",
            "views": "44",
            "upvotes": " View Sharers "
        }
    ]
}