{
    "title": "What is the cook's theorem in the theory of computation? - Quora",
    "tags": [
        "Theory of Computation",
        "Theorems and Lemmas",
        "Quantum Field Theory",
        "Theoretical Computer Science",
        "Computer Science"
    ],
    "response": [
        {
            "author_info": {
                "name": "Tyson Maghave",
                "href": "/profile/Tyson-Maghave-1"
            },
            "answer_text": "In computational complexity theory, the Cook–Levin theorem, also known as Cook's theorem, states that the Boolean satisfiability problem is NP-complete. That is, any problem in NP can be reduced in polynomial time by a deterministic Turing machine to the problem of determining whether a Boolean formula is satisfiable. The theorem is named after Stephen Cook and Leonid Levin. An important consequence of this theorem is that if there exists a deterministic polynomial time algorithm for solving Boolean satisfiability, then every NP problem can be solved by a deterministic polynomial time algorithm. The question of whether such an algorithm for Boolean satisfiability exists is thus equivalent to the P versus NP problem, which is widely considered the most important unsolved problem in theoretical computer science.A decision problem is in NP if it can be solved by a non-deterministic algorithm in polynomial time. An instance of the Boolean satisfiability problem is a Boolean expression that combines Boolean variables using Boolean operators. An expression is satisfiable if there is some assignment of truth values to the variables that makes the entire expression true. ",
            "date": "Answered June 2, 2019",
            "views": "307",
            "upvotes": " View 3 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Zahid Khan",
                    "user_href": "/profile/Zahid-Khan-325"
                },
                {
                    "user_id": "AKANKSHA VYAS",
                    "user_href": "/profile/AKANKSHA-VYAS-20"
                },
                {
                    "user_id": "Ajay Panthagani",
                    "user_href": "/profile/Ajay-Panthagani"
                }
            ]
        },
        {
            "author_info": {
                "name": "Pinaki Mitra",
                "href": "/profile/Pinaki-Mitra-18"
            },
            "answer_text": "SATISFIABILITY problem is NP Complete. This is the first NP Complete peoblem Subsequently other NP complete problems are shown using reduction from this one as a standard NP complete problem. ",
            "date": "Answered May 5, 2019",
            "views": "205",
            "upvotes": "0"
        }
    ]
}