{
    "title": "What is a nonlinear partial differential equation? - Quora",
    "tags": [
        "Partial Differential Equations",
        "Differential Equations"
    ],
    "response": [
        {
            "author_info": {
                "name": "Andrew Winkler",
                "href": "/profile/Andrew-Winkler-15"
            },
            "answer_text": "A differential equation is a constraint F on a function u, involving the domain of u, and the codomains of u and some number differential operators of u. For simplicity, take those codomains to be vector spaces. There’s no real loss of generality in doing so, since differential operators are local. So [math]F(x, u(x), D_1u(x), …, D_ku(x)) = 0.[/math] It is called linear, when the solutions u form an affine space, where [math]au + bv[/math] is a solution for all [math]a + b = 1[/math], if u and v are solutions. It is called linear and homogeneous when the solutions form a vector space. It’s called an ordinary differential equation if the domain x is 1 dimensional, otherwise it’s a partial differential equation. So a nonlinear partial differential equation is a partial differential equation which isn’t linear, so there exist solutions u and v and numbers a and b with [math]a+b=1[/math] but [math]au + bv[/math] is not a solution. If you set the Laplacian of u equal to u^2, that would be an example. ",
            "date": "Answered June 17, 2019",
            "views": "889",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "John E Pearson",
                    "user_href": "/profile/John-E-Pearson"
                },
                {
                    "user_id": "Rafael Tu",
                    "user_href": "/profile/Rafael-Tu"
                }
            ]
        },
        {
            "author_info": {
                "name": "Deb P. Choudhury",
                "href": "/profile/Deb-P-Choudhury"
            },
            "answer_text": "A nonlinear partial differential equation of first order in the unknown function z of independent variables x and y is one which can not be put in the form P(x,y,z).p + Q(x,y,z).q = R(x,y,z), where p and q are the partial derivatives of z with respect to x and y respectively. (The above equation is known as a quasi-linear or a Lagrange's equation). Hence the nonlinear equations are those in which there is at least one term in which the combined degree of the partial derivatives is more than one, e.g. z = pq. For higher order P.D.E.'s also the criteria for nonlinearity is the same as above in the sense that the combined degree of the partial derivatives of z of various orders should exceed 1 in at least one term. ",
            "date": "Answered June 28, 2018",
            "views": "12",
            "upvotes": "0"
        }
    ]
}