{
    "title": "What happens to the diameter of a circle when the area decreases by 75%? - Quora",
    "tags": [
        "Diameters",
        "Geometry of Circles"
    ],
    "response": [
        {
            "author_info": {
                "name": "Jen Hawthorne",
                "href": "/profile/Jen-Hawthorne"
            },
            "answer_text": "Consider two circles, X and Y. X is the larger of the two circles. Circle X has a diameter of x, and circle Y has a diameter of y. For circle X, the area is: Area of X = (x/2)^2 * (pi) (That is, we divide the diameter in half to get the radius, square the radius, and multiply by pi to find the area.) For Circle Y, the area is: Area of Y = (y/2)^2 * (pi) We also know that Area of Y = (1/4) * Area of X That is, the area of the smaller circle is one-quarter the area of the larger circle. (75% smaller means the smaller thing is 25% of the larger thing — one quarter of it.) We now substitute the two formulas for the area into the second relationship and get: (y/2)^2 * (pi) = (1/4) * (x/2)^2 * (pi) We want to simplify this until we can see the relationship between x and y. First, toss out the (pi) — it’s on both sides so we can cancel it. (y/2)^2 = (1/4) * (x/2)^2 Now get rid of that fraction by multiplying both sides by four. 4 (y/2)^2 = (x/2)^2 Take the square root of both sides: 2 (y/2) = (x/2) Cancel out the 2s on the left side: y = x/2 The diameter of the smaller circle is half the diameter of the larger circle. Test this by putting some numbers back in and checking it out: Circle X has a diameter of 12. Circle Y has a diameter of 6. How are their areas related? Area of X = (12/2)^2 * (pi) = 36(pi) Area of Y = (6/2)^2 * (pi) = 9 (pi) Y has 1/4 the area of X and half the diameter. It checks! ",
            "date": "Answered November 14, 2017",
            "views": "786",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "K S Narayanan",
                "href": "/profile/K-S-Narayanan-1"
            },
            "answer_text": "For Aptitude Test Takers : Use the relation : A + B + AB/100 = Net change Since net change is Decrease in area, it means there is Decrease in Radius. Let the change in radius be represented by x. A decrease is denoted by negative value. Substituting in the above relation : -x - x + x^2/100 = -75 x^2 -200x + 7500 = 0 x = (200 ± √(40000 - 30000))/2 x = (200 ± 100)/2 x = 150 or x = 50 => Radius decreases 50% => Diameter decrease by 50% Note: Radius cannot reduce by 150% Detailed discussion in this post : K S Narayanan's post in Mathematics Unraveled :-) ",
            "date": "Updated November 25, 2017",
            "views": "122",
            "upvotes": "0"
        }
    ]
}