{
    "title": "What is astro-numerology? - Quora",
    "tags": [
        "Name Numerology",
        "Numerology"
    ],
    "response": [
        {
            "author_info": {
                "name": "Ana Kumar",
                "href": "/profile/Ana-Kumar-3"
            },
            "answer_text": "Hello, Astro-numerology is a relationship between Astrology & Numbers i.e. called Numerology. Numerology is a vast science that works parallel to our day to day life, even if we accept it or not. Numerology is a number’s vibration. It involves your date of born, birth month, year and sum of a complete date. It also involves things around you like your car number, house number, etc. Different number represents different planets, which are: 1- SUN 2- MOON 3- JUPITER 4- RAHU/URANUS 5- MERCURY 6- VENUS 7- KETU/NEPTUNE 8- SATURN 9- MARS One can calculate life number from date of birth, example: if i was born on 1 Jan 2020 = 1+01+2+0+2+0 = 6. So, i ll be ruled by number 6 i.e. Venus, throughout my Life. One can use help of number to enhance strength or can number according to planet which is favourable for him/her. Let us take an example in which PM Modiji used numerology to strengthen countryman against current pandemics CORONAVIRUS. Today on 3 April 2020, at 9 am for 9 minutes, Indian PM Narendra Modiji addressed whole nation on CORONAVIRUS. As the country is suffering from CORONAVIRUS pandemics right now. His speech includes Hope for people and for the prosperity of the nation. In his speech, he urged people to switch off lights and light candles on 5 April 2020, at 9.00 pm for 9 minutes. He said, this is done to invoke hope within countryman & specially to poor people 9 is a Karmic number, who’s ruler is Mars. Its strength here represents care for each other, and nourishment for the world. When this number rules, it provides care, even though one has to fight through to provide care. It also represents doctors, surgeons, and fighters too. The focus is on number 9 by lightening candle at 9.00 pm for 9 minutes is increasing the strength of the country, magnifying hope, increase care and nourishment within the nation. This is to be done to enhance power within the nation to fight and win CORONAVIRUS (by maintaining social distancing i.e. main cause of spreading virus) The increasing strength of no. 9 by lightening candles at 9 pm for 9 minutes on April 5 may increase the strength of Mars to some extent to increase nourishment, care, and fighting spirit for the nation. Similarly, there is interpretation of every number. Hope this helps!!! Regard Dr. Ana Note: Feel free to ask in case of any queries and this is brief about How astrology and numbers are connected in our day to day life. ",
            "date": "Answered April 3, 2020",
            "views": "191",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Ankur Agrawal",
                    "user_href": "/profile/Ankur-Agrawal-164"
                },
                {
                    "user_id": "Shubham Ror",
                    "user_href": "/profile/Shubham-Ror-4"
                }
            ]
        },
        {
            "author_info": {
                "name": "Genevieve Fox",
                "href": "/profile/Genevieve-Fox-6"
            },
            "answer_text": "Astronumerology is the combination of astrology and numerology to analyze personality and help. plan for future trends in one's life. Each planet has a corresponding number that best exemplifies its nature. The most powerful number in numerology is number 22. This number is one of the three master numbers believed to hold untold spiritual power and ageless knowledge. Go to my Profile and you can find all about numerology material there... ",
            "date": "Answered June 5, 2020",
            "views": "101",
            "upvotes": "0"
        }
    ]
}