{
    "title": "What are the differences between decision theory, game theory, and combinatorial game theory? - Quora",
    "tags": [
        "Combinatorial Game Theory",
        "Decision Theory",
        "Game Theory",
        "Statistics (academic discipline)"
    ],
    "response": [
        {
            "author_info": {
                "name": "Justin Rising",
                "href": "/profile/Justin-Rising"
            },
            "answer_text": "In brief: Decision theory is the study of how an agent can maximize its expected utility in situations where there are no other agents making choices.  The sorts of problems studied in a principles of microeconomics course are the sorts of problems that decision theory is concerned with.Game theory is the study of how agents can maximize their expected utility in situations where multiple agents make choices, and the payoff function of each agent depends on what all of the other agents do.  The prisoner's dilemma is the prototypical example of a game theoretic problem.Combinatorial game theory is the study of what people generally think of as games, and how to win at them.  It can be viewed as a subfield of game theory where the games have certain very nice properties, but the methods that combinatorial game theory uses are pretty different from what general game theory uses.  Nim is probably the most famous game that has been analyzed by combinatorial methods.",
            "date": "Answered September 22, 2013",
            "views": "283",
            "upvotes": " View 204 Upvoters",
            "upvoters": [
                {
                    "user_id": "Benjamin Golub",
                    "user_href": "/profile/Benjamin-Golub-2"
                },
                {
                    "user_id": "Yair Livne",
                    "user_href": "/profile/Yair-Livne"
                },
                {
                    "user_id": "Alon Amit",
                    "user_href": "/profile/Alon-Amit"
                },
                {
                    "user_id": "Allan Steinhardt",
                    "user_href": "/profile/Allan-Steinhardt"
                },
                {
                    "user_id": "Erik Madsen",
                    "user_href": "/profile/Erik-Madsen"
                },
                {
                    "user_id": "Melissa Dalis",
                    "user_href": "/profile/Melissa-Dalis"
                },
                {
                    "user_id": "Dennis Mutugi",
                    "user_href": "/profile/Dennis-Mutugi-1"
                },
                {
                    "user_id": "Vladimir Pitch",
                    "user_href": "/profile/Vladimir-Pitch"
                },
                {
                    "user_id": "Ritabrata Ray",
                    "user_href": "/profile/Ritabrata-Ray"
                },
                {
                    "user_id": "Michael Castro",
                    "user_href": "/profile/Michael-Castro-6"
                }
            ]
        },
        {
            "author_info": {
                "name": "Ilya Segal",
                "href": "/profile/Ilya-Segal-1"
            },
            "answer_text": "On the relation between decision theory and game theory, please see my answer to this question: What is the relationship between risk and game theory? Regarding “combinatorial game theory,” I think it applies to games that have large strategy spaces. One classic example is a “combinatorial auction,” in which a player can place a bid on any nonempty combination of L objects, so the strategy space is of dimension 2^L - 1. Another classic example is given by chess, in which a strategy must specify a move at each feasible position, and the number of such positions is bounded below by 10^120 (the “Shannon number”). In such complex games, it may be impossible to find an equilibrium, and the very assumption that players are fully rational and optimize perfectly is unrealistic. Such games are often studied using the tools of computer science, including “complexity theory” (which helps determine which games are relatively easy to solve and which games may not be solvable), and various heuristic algorithms for modeling player’s boundedly rational behavior and finding approximate equilibria. Another name for this field is “Algorithmic Game Theory”. ",
            "date": "Answered March 14, 2018",
            "views": "24",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Synclaire Lee",
                    "user_href": "/profile/Synclaire-Lee"
                },
                {
                    "user_id": "Jongjae Lee",
                    "user_href": "/profile/Jongjae-Lee"
                }
            ]
        }
    ]
}