{
    "title": "What is purposive sampling? - Quora",
    "tags": [
        "Sampling (signal processing)",
        "Sampling (statistics)"
    ],
    "response": [
        {
            "author_info": {
                "name": "Ramnath Takiar",
                "href": "/profile/रामनाथ-तकियार-Ramnath-Takiar"
            },
            "answer_text": "In this method, a desired number of sample units is selected deliberately or purposely depending upon the objective of the study so that the important items representing the true characteristics of the population are included in the sample. For example, if in a socio-economic survey, it is desired to study the standard of living of the people in Ulaanbaatar (UB) and if the investigator wants to show that the standard has gone up, then he may include the individuals only from the posh colonies of UB and exclude the people from poor colonies. Thus, a serious drawback of this sampling scheme is that it is highly subjective and depends entirely on the personal convenience, beliefs and impression of the investigator. ",
            "date": "Answered June 11, 2019",
            "views": "577",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Sunil Jat",
                "href": "/profile/Sunil-Jat-4-1"
            },
            "answer_text": "purposive sample is a non-probabilitysample that is selected based on characteristics of a population and the objective of the study. Purposive samplingis also known as judgmental, selective, or subjective sampling. ",
            "date": "Answered June 11, 2019",
            "views": "184",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Virshina Wilson",
                "href": "/profile/Virshina-Wilson"
            },
            "answer_text": "A purposive sample is defined as many things. It can be judgemental, selective, or subjective. It is normally used and identifies a group of people who fit a certain profile. ",
            "date": "Answered May 20, 2019",
            "views": "102",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Nox Causette",
                    "user_href": "/profile/Nox-Causette"
                }
            ]
        }
    ]
}