{
    "title": "What is 6x6÷6+6-6? - Quora",
    "tags": [
        "Arithmetic",
        "Puzzles and Trick Questions",
        "Numbers (mathematics)",
        "Science",
        "Algebra"
    ],
    "response": [
        {
            "author_info": {
                "name": "Arshad Aleem",
                "href": "/profile/Arshad-Aleem-2"
            },
            "answer_text": "Look my friend, if you want to develope an insightbof Mathematics, and don't want to 'memorize' any formulae. My answer is for you. Here you go: In a mathematical statement, divide it in small parts, that are being Added ORSubtractedTo each other. For example: in an expression: 6 x 6 ÷ 6 + 6 - 6 We have 3 parts: 6 x 6 ÷ 666Your job is to solve these three parts and convert them to single number solution. As you can see, two of them are already single numbers (6,6) other one can be solved to 6 also. So your solution looks like: 666Then plug them back in initial term: 6 + 6 - 6 Precedence/priority of Addition and subtraction is SAME just like multiplication and division. So, there you see two equal numbers being subtracted.. Boom! 6 - 6 is zero.. So, 6 + 0 is 6 Hence 6 is your answer. Though your question was simple, but I'd recommend you to Visualize things more often and practice this term based visualization in usual practice qurstions. This is real Maths. You are seeing the concept while applying any formula in foreground. Cheers! ",
            "date": "Answered February 23, 2019",
            "views": "31",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Riddot Menn",
                    "user_href": "/profile/Riddot-Menn"
                }
            ]
        },
        {
            "author_info": {
                "name": "Malcolm Lloyd",
                "href": "/profile/Malcolm-Lloyd-5"
            },
            "answer_text": "To rationalise any maths problem you must use BODMAS, if in the UK or PEDMAS or other Acronym as used in the USA and other countries. The letters stand for the correct order to do the maths in order to arrive at a constant and correct result. B(P) = Brackets (Perenthases) O(E) = Order (exponent) D = Devide M = Multiply A = Addition S = Subtraction One thing, thers is a move away from BODMAS to BOPS. This is because in some maths layouts (the way it is arranged) if we do the devide before the multiply or the addition before the subtraction we get the wrong answer. Look this new thinking up. For our maths problem… 6×6÷6+6-6 let's write it to support BODMAS (6×(6÷6))+6–6 (6×1)+6-6 6+6–6 12-6 6 Ans = 6 Mal. ",
            "date": "Answered July 16, 2019",
            "views": "19",
            "upvotes": " View 2 Upvoters ",
            "upvoters": [
                {
                    "user_id": "David Sietses",
                    "user_href": "/profile/David-Sietses"
                },
                {
                    "user_id": "Jasleen Kaur Ghai",
                    "user_href": "/profile/Jasleen-Kaur-Ghai"
                }
            ]
        }
    ]
}