{
    "title": "Where did Galileo say: Mathematics is the language with which God has written the universe? - Quora",
    "tags": [
        "Philosophy of Religion",
        "The Universe",
        "God",
        "Mathematics"
    ],
    "response": [
        {
            "author_info": {
                "name": "Steven Silz-Carson",
                "href": "/profile/Steven-Silz-Carson"
            },
            "answer_text": "I’m unsure of that attribution. Galileo may have uttered or written these exact words, but like you, I don't find where. Instead I find: “Mathematics is the language with which God has written the universe.”-- As quoted in Beginning Algebra (1992) by Margaret L. Lial, Charles David Miller and E. John Hornsby, p. 2 And “Mathematics is the language in which God has written the universe.”Quoted in: Creative learning in perspective, Volume 1972 by Tudor Powell Jones However this IS actually attributed to him and is very profound: “I do not feel obliged to believe that the same God who has endowed us with senses, reason, and intellect has intended us to forgo their use and by some other means to give us knowledge which we can attain by them.” And: “Philosophy is written in that great book which ever lies before our eyes — I mean the universe — but we cannot understand it if we do not first learn the language and grasp the symbols, in which it is written. This book is written in the mathematical language, and the symbols are triangles, circles and other geometrical figures, without whose help it is impossible to comprehend a single word of it; without which one wanders in vain through a dark labyrinth.” -- The Assayer (1623), as translated by Thomas Salusbury (1661), p. 178, as quoted in The Metaphysical Foundations of Modern Science (2003) by Edwin Arthur Burtt, p. 75 More great Galileo: Galileo Galilei QuotesUntitled Document ",
            "date": "Updated January 6, 2017",
            "views": "12",
            "upvotes": " View 16 Upvoters",
            "upvoters": [
                {
                    "user_id": "Ronald Bessie",
                    "user_href": "/profile/Ronald-Bessie-1"
                },
                {
                    "user_id": "Steve Greene",
                    "user_href": "/profile/Steve-Greene-5"
                },
                {
                    "user_id": "Jim McCrory",
                    "user_href": "/profile/Jim-McCrory-6"
                },
                {
                    "user_id": "Martin Thomas",
                    "user_href": "/profile/Martin-Thomas-26"
                },
                {
                    "user_id": "James Boettcher",
                    "user_href": "/profile/James-Boettcher"
                },
                {
                    "user_id": "Dennis Horvitz",
                    "user_href": "/profile/Dennis-Horvitz"
                },
                {
                    "user_id": "Dilip Bandyopadhyay",
                    "user_href": "/profile/Dilip-Bandyopadhyay"
                },
                {
                    "user_id": "Cesar A. K. Grossmann",
                    "user_href": "/profile/Cesar-A-K-Grossmann"
                },
                {
                    "user_id": "Josh Goldman",
                    "user_href": "/profile/Josh-Goldman-21"
                },
                {
                    "user_id": "George Lord Jr DC",
                    "user_href": "/profile/George-Lord-Jr-DC"
                }
            ]
        },
        {
            "author_info": {
                "name": "Manu Jac",
                "href": "/profile/Manu-Jac"
            },
            "answer_text": "The Universe knows no math, we do. The Universe just is and does what it does. You will never find the number “3” written out in the universe. We are the ones trying to describe the Universe, but mathematics is not quite what it seems and it is not so infaillible. That is a myth. Granted we are a part of the Universe and we write the number “3” as a representation of a quality that a group can have. We have demonstrated a great number of mastery of the elements, we have drawn conclusions and made proofs from axioms and so on. We can make predictions on systems over and over with success. We have evolved technologies to dramatically change our world forever. Still, the Universe does not do math, we do. ",
            "date": "Answered June 22, 2018",
            "views": "52",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Dina Dorain",
                    "user_href": "/profile/Dina-Dorain"
                },
                {
                    "user_id": "Dennis Horvitz",
                    "user_href": "/profile/Dennis-Horvitz"
                }
            ]
        }
    ]
}