{
    "title": "Why are some people smarter in math than others? The answer is not how a person tries. - Quora",
    "tags": [
        "Smart People",
        "Intelligence"
    ],
    "response": [
        {
            "author_info": {
                "name": "Alexander Bunyip",
                "href": "/profile/Alexander-Bunyip"
            },
            "answer_text": "One could ask why some people run faster than others. Its simply that they have a combination of physical features that combine optimally to run faster than others. Likewise, some people have a combination of physical features that combine optimally to perform math faster than others. Presumably, the physical feature in the case of ability at math has to do with their brain. If that person also has an environment that supports development of that feature then they will tend to excel. However, its not always the case that the feature or its support will both endure into independent life as an adult. Consequently, high achieving children often suffer greatly in adult life, and the effect is not at all unlike that of a person with a profound disability. However, being aware that a high achieving person (in any field) has special needs - just as any disabled person has special needs - provides a way of understanding such a person, without feeling compelled to be like them. It is not possible to reach your own full potential by “trying” to attain the standard set by high achievers, although the education system exploits this to the max. Rather, recognize high achievers, and then set about being a high achiever yourself in those things that you do best and enjoy the most. “Trying” will only frustrate you. ",
            "date": "Answered June 10, 2017",
            "views": "386",
            "upvotes": " Answer requested by Rachel An"
        },
        {
            "author_info": {
                "name": "Ron Pleece",
                "href": "/profile/Ron-Pleece"
            },
            "answer_text": "Some people process it better or just understand the process better. Everyone is good at something, some people are good at mote things than others. Many autistic people are know to be like geniuses in certain areas and extremely poor in others. Even those with high IQ's have areas they lack in but normally excell in others, IQ is only potential and does not guarantee excellence or areas of. Many people with high IQ’s are often exceptional in math but not just them. I myself feel math is like another language, once you understand this language, math is easy to understand and your grasp of the mathematical processes is much less challenging. If you can not grasp the language of math, I feel you will always struggle. ",
            "date": "Answered June 9, 2017",
            "views": "240",
            "upvotes": " Answer requested by Rachel An"
        }
    ]
}