{
    "title": "Why are complex numbers important? - Quora",
    "tags": [
        "Complex Numbers"
    ],
    "response": [
        {
            "author_info": {
                "name": "Philip Lloyd",
                "href": "/profile/Philip-Lloyd-2"
            },
            "answer_text": "Pretend that the only type of numbers you know about are the Whole Numbers: W = {0, 1, 2, 3 …….} If all problems you did had solutions in W then you would have no need to extend your understanding. Eg If x + 3 = 17 If 5x – 7 = 13 then x = 14 then 5x = 20 and x = 4 But suppose you meet x + 5 = 2. There is no answer to this in W but we do not say that “There is no solution”. We have to extend our idea of “what numbers are” to a bigger set called the Integers I I = {….–3, –2, –1, 0, 1, 2, 3, ….} Now we can solve problems such as: x + 5 = 2 so x = –3  Now consider 5x = 6. There is no answer in I. We do not try to make an integer be the solution, so we again extend our idea of “what numbers are” to bRational Numers, Q  Contrary to popular belief, there is no fraction (ie no decimal) which when squared equals 2. The solution is x = +√2 or –√2. Most people get out their calculator and say √2 = 1.414 but this is simply not true because 1.414 is rational! These people are just trying to make the value of √2 into a rational answer. √2 cannot be represented by any number of decimal places. We can only give an approximation to any number of decimal places we like.. This is exactly like saying that the solution of 5x = 16 (when we only knew about whole numbers) is x = 3 because it is the nearest whole number! √2 is a new type of number called Irrational. In fact they seem absurd, which is probably where the word “surd” comes from! Apparently Hippasus (one of Pythagoras' students) discovered irrational numbers when trying to represent the square root of 2 as a fraction. Instead he proved you could not write the square root of 2 as a fraction, which seemed to be quite “irrational”. Pythagoras could not accept the existence of irrational numbers. He believed that all numbers were rational but he could not disprove the existence of these \"irrational numbers\" and so Hippasus was thrown overboard and drowned! (so the story goes) The following equation can be solved by a method called “completing the square”.  (Calculators can only deal with rational numbers. The answers are not 4.414, 1.586) These new Irrational numbers are of the form a + b√c and they simply do not exist as decimal fractions. Incidentally, after some operations, irrational numbers can become rational. Eg 3 + 2√5 + 7 – 2√5 = 10 and (3 + √7)(3 – √7) = 9 + 3√7 – 3√7 – 7 = 2 The Rationals and the Irrationals together are called the REAL NUMBERS and they can be represented by either points on a number line or vectors on a number line.  Now we are prepared to ACCEPT i = √(–1) Things like √(–1), √(–9), √(–7) are not in the set of Rationals neither are they in the set of Irrationals. It is no use looking for a decimal approximation to √(–1) , just as it is no use looking for an integer equal to 7/ 3 The number √(–1) is not found anywhere in the set of REAL Numbers so we could say it is UN-REAL or NON-REAL. I do not think it is helpful in any way to say these numbers are IMAGINARY, although this is a common term. They are not imaginary, they do EXIST but not as points on a Number Line.  So x – 2 = +√(–1) or x – 2 = –√(–1) Or x = 2 + i or x = 2 – i (often written as x = 2 ± i) Notice that 2 + i + 2 – i = 4 which is real again And ( 2 + i )( 2 – i ) = 4 +2i – 2i + 1 = 5 which also is real again. These new numbers are called COMPLEX NUMBERS and can be added, subtracted, multiplied and divided just like the Irrationals or Reals: Eg 2 + 5i + 7 – 2i = 9 + 3i and (2 + 5i)(7 – 2i) = 14 – 4i + 35i + 10 = 24 + 31i The general form for a Complex Number is a + bi Complex numbers can be represented as either dots or vectors not ON a number LINE but on a number PLANE. (called an Argand Plane)   For the stubborn sceptics, if this last equation does not really have solutions then how come these “fictitious” solutions add together to make 4 and multiply to make 5? We can see how these different sets of numbers are related using a Venn Diagram:   Lastly, a very interesting point is this…… CAN WE FIND AN EQUATION WHOSE SOLUTIONS ARE NOT IN THE SET OF COMPLEX NUMBERS? i.e. DO WE HAVE TO FURTHER EXTEND OUR CONCEPT OF “NUMBER”? ",
            "date": "Updated October 7, 2017",
            "views": "10",
            "upvotes": " View 108 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Sayak Bal",
                    "user_href": "/profile/Sayak-Bal"
                },
                {
                    "user_id": "Shravana Kumar",
                    "user_href": "/profile/Shravana-Kumar-14"
                },
                {
                    "user_id": "Mohamed Tarek",
                    "user_href": "/profile/Mohamed-Tarek-133"
                },
                {
                    "user_id": "Christine Shultz",
                    "user_href": "/profile/Christine-Shultz-3"
                },
                {
                    "user_id": "João Carlos Biondi",
                    "user_href": "/profile/João-Carlos-Biondi"
                },
                {
                    "user_id": "Md. Keum Uddin Pathan",
                    "user_href": "/profile/Md-Keum-Uddin-Pathan"
                },
                {
                    "user_id": "Dan Ross",
                    "user_href": "/profile/Dan-Ross-16"
                },
                {
                    "user_id": "K.V. Venkataramu",
                    "user_href": "/profile/K-V-Venkataramu"
                },
                {
                    "user_id": "Sankha Suvra Saha",
                    "user_href": "/profile/Sankha-Suvra-Saha"
                },
                {
                    "user_id": "Aryaman Babbar",
                    "user_href": "/profile/Aryaman-Babbar-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Sanel Prtenjača",
                "href": "/profile/Sanel-Prtenjača"
            },
            "answer_text": "Well, you know how to add, subtract, multiply and divide any two real numbers (except dividing by zero is not defined). Also, real number [math] a [/math] can be viewed as a point on the line, as you learned in school. That point in Cartesian plane we denoted with [math] (a, 0). [/math] So on [math] \\mathbb{R} [/math] we can do the following: [math] (a, 0) \\pm (b, 0), (a, 0) \\cdot (b, 0) [/math] and [math] (a, 0) : (b, 0), b \\neq 0.[/math] Notice that this operation are (geometrically) sliding and streching the x-axis in [math] \\mathbb{R}^1, [/math] but also in [math] \\mathbb{R}^2 [/math] (and [math] \\mathbb{R}^3[/math]). What about any point? Can we multiply [math] (1, - 3) [/math] by [math] (- 2, 1) [/math]? Yes, we need new (broader) arithmetic. Complex number is just a point which you can add to another point or multiply it by another point. Simillary to 1D case, in 2D adding two points (two complex numbers) is sliding a Cartesian plane. Multiplying two points (two complex numbers) is streching the Cartesian plane (after this linear transformation any line will stay a line and all lines will stay parallel which is crucial for applying Linear algebra in geometry). This transformations can be something like this:  Now, any point [math] z = (x, y) [/math] on the unit circle is given by parametric form [math] ( \\cos{t}, \\sin{t}) [/math] where [math] t [/math] is the angle between positive (right) side of x-axis and the ray starting from origin [math] (0, 0) [/math] and containing[math] z. [/math] Of course in general, [math] |z| = r \\implies z = (r\\cos{t}, r\\sin{t})[/math]. As you know, [math] (a, b) := a + bi.[/math] Here is the picture:  From here, using basic trigonometric identities and the definition [math] (a, b) \\cdot (c, d) = ac - bd, ad + bc [/math] (motivation for this we got from the distributive property for reals) one can prove properties of complex arithmetic. For example, when you multiply two complex numbers [math] z_1, z_2 [/math] you get another [math] z_3 \\in \\mathbb{C} [/math] such that [math] r(z_3) = r(z_1)r(z_2) [/math] and [math] t(z_3) = t(z_1) + t(z_2) [/math] which corresponds to the idea of rotation. Important note: you can view this idea of rotation as definition of multiplying [math] z_1, z_2 [/math] and analogously prove that [math] (a, b) \\cdot (c, d) [/math] is in fact [math] (ac - bd, ad + bc). [/math] Now, we will touch the algebraic nature of complex numbers we have all been taught in high school. We now know what’s the solution of [math] x^2 = - 1 [/math] and, idealy, any quadratic equation, [math] ax^2 + bx + c= 0 [/math]. It is also known that [math] n [/math]-th degree polynomial equation has exactly [math] n [/math] complex roots (some of those [math] n [/math] can be equal). Anyway, we are searching for [math] x_1, x_2 [/math] such that [math] (x_1, x_2) \\cdot (x_1, x_2) = (- 1, 0) [/math]. Only two slution are [math]x_1 = 0, x_2 = 1 [/math] and [math] x_1 = 0, x_2 = - 1 [/math] or simply [math]i, - i.[/math] Complex numbers emerge wherever there are rotations and we need them for solving polynomial equations. ",
            "date": "Updated October 27, 2020",
            "views": "87",
            "upvotes": "0"
        }
    ]
}