{
    "title": "Why do we learn partial differential equations? - Quora",
    "tags": [
        "Partial Differential Equations",
        "Differential Equations",
        "Equations"
    ],
    "response": [
        {
            "author_info": {
                "name": "Don Holmgren",
                "href": "/profile/Don-Holmgren"
            },
            "answer_text": "“Why do we learn partial differential equations?” Partial differential equations (PDEs) are ubiquitous across many fields of study. In physics, Maxwell’s equations (the laws of electrodynamics) are usually stated in PDE form. As a physicist, I solved PDEs in problems involving temperature and heat flow, electrostatics, electrodynamics, quantum, and the design of diode lasers and semiconductor waveguides. I learned how to solve some of them analytically, and others numerically. I built a number of supercomputers dedicated to solving PDEs in the field of quantum chromodynamics (the theory of the nuclear strong interaction). PDEs can be found in all engineering fields, in chemistry, in biology, in climate science, even in economics. One of the common defects I encounter in people’s reasoning about physical (and other) phenomena is the assumption that systems are linear (that is, responses to stimuli are immediate and proportional); in all but the simplest cases, time or other variables are very important to determining the response to a stimulus, the actual response will not be constant but will vary in time or another variable, and generally either an ordinary differential equation or a PDE is necessary to produce an accurate model. ",
            "date": "Updated December 4, 2019",
            "views": "217",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Leo Harten",
                "href": "/profile/Leo-Harten"
            },
            "answer_text": "Physics and engineering use many models to describe reality and make predictions. Most of these models depend on PDEs in order to encapsulate the relevant math associated with the problem. Schroedinger’s eqn, Maxwell’s eqns, Einstein’s GR field eqns, Navier-Stokes, are all PDEs. Many of these processes can also involve integro-differential equations when you consider the reaction of the body, including time retardation effects. You learn more about the math in order to be able to better solve additional problems. Framing the problem in the correct fashion prevents unphysical results such as infinities (hence you need renormalization in quantum field theories.) ",
            "date": "Answered November 12, 2019",
            "views": "116",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Bill Bell",
                    "user_href": "/profile/Bill-Bell-33"
                },
                {
                    "user_id": "Petunia Eleanor Nielsen",
                    "user_href": "/profile/Petunia-Eleanor-Nielsen"
                }
            ]
        }
    ]
}