{
    "title": "Why do I think other people are smarter than me? - Quora",
    "tags": [
        "Getting Smarter",
        "Smart People",
        "Intelligence"
    ],
    "response": [
        {
            "author_info": {
                "name": "Diane Shatto",
                "href": "/profile/Diane-Shatto"
            },
            "answer_text": "There is an easy explanation for this. You are mistaking experience for intelligence. You don’t have the same experience, background or characteristics as your friends. I bet they are cool, funny and socially smoother than you and so you are amazed by them. This is one scenario for why someone would ask this question. Another scenario is if you have friends who are aggressive, controlling, or assertive and so who have opportunities to be in positions you don’t or to control things you don’t. So it seems they are more intelligent when it’s just their position of responsibility they have been given. Or maybe they like to talk and show off their intelligence and you don’t. Or maybe they have a higher status, who are better looking. You’d think none of these factors would ever fool someone with an intelligence level in the 98 percentile, but maybe you lack experience. Think of it this way. A kid in kindergarten with an IQ in the 98th percentile is bring taught by a teacher with barely average intelligence. Do you think the kid has nothing to learn from the teacher or that the kid doesn’t think, ‘man my teacher is smarter than me.’ Of course he does. ",
            "date": "Answered August 18, 2018",
            "views": "982",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Iryna Nikolaienko",
                    "user_href": "/profile/Iryna-Nikolaienko"
                },
                {
                    "user_id": "Hareem",
                    "user_href": "/profile/Hareem-25"
                },
                {
                    "user_id": "Arthur Fleck",
                    "user_href": "/profile/Arthur-Fleck-2"
                },
                {
                    "user_id": "Daniel Donati",
                    "user_href": "/profile/Daniel-Donati-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Rhonda Hohertz",
                "href": "/profile/Rhonda-Hohertz"
            },
            "answer_text": "It sounds like you may be suffering from an anxiety disorder. This may be correct and it might be totally incorrect. The question you asked and the manner in which you asked it sounds like an issue with anxiety. You are not standing in front of me so I could further evaluate the issue. IQ does not really figure in to the issue of an anxiety disorder in any major manner. This issue is apparently bothering you, my recommendation would be to see a therapist/psychologist and see what they have to say and look at possible treatment options. Your questions appear to be following a pattern that is consistent with anxiety. You are ruminating about issues which is consistent with anxiety. According to the Mayo Clinic, the definition of anxiety is when individuals experience excessive worry and fear when it comes to everyday life. Furthermore, this worry and fear interferes with life and can become hard to control. Signs and symptoms of anxiety can last temporarily or can be ongoing, depending on the anxiety disorder. Some forms of anxiety disorders are social anxiety disorder, where people become anxious in social environments, and separation anxiety where the anxiety stems from being separated either from a person or a beloved possession. As mentioned, anxiety disorders can take a toll on a person’s life, so understanding where they come from is the beginning of seeking treatment. ",
            "date": "Answered August 18, 2018",
            "views": "757",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Ricardo Acuna",
                    "user_href": "/profile/Ricardo-Acuna-11"
                },
                {
                    "user_id": "Diane Shatto",
                    "user_href": "/profile/Diane-Shatto"
                }
            ]
        }
    ]
}