{
    "title": "Why do I always get math problems wrong? - Quora",
    "tags": [
        "Mathematics Education",
        "Problem Solving",
        "Mathematics"
    ],
    "response": [
        {
            "author_info": {
                "name": "Sarthak Bansal",
                "href": "/profile/Sarthak-Bansal-31"
            },
            "answer_text": "There may be many reasons. The person who teaches you may not be paying enough attention to your individual needs as a student. You may have talents for another subject. You have no one to help you. You have no passion for math. You are not working hard or trying. There are many possible reasons for this, but it can also b\\e the fault of stress, not just your teacher, curriculum or your effort, there may also have been a brain injury and there are so many more potential reasons why(just the likely ones though) ",
            "date": "Answered April 11, 2017",
            "views": "1",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Hagar Ahmad",
                    "user_href": "/profile/Hagar-Ahmad-3"
                }
            ]
        },
        {
            "author_info": {
                "name": "George Willson",
                "href": "/profile/George-Willson-3"
            },
            "answer_text": "Mathmatical problems comes with very strong logic and earnest patience and carefulness. Lack of any one of these three factors may cause errors when you deal with some tough questions. Most of people are careless when they do mathmatical calculating even in some very easy counting case. Therefore, if you do bad in one of those three abilities, pay more time on that and you will find after long-lasting practice, some hard problems may seem easier than what you thought. ",
            "date": "Answered April 12, 2017",
            "views": "16",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Hagar Ahmad",
                    "user_href": "/profile/Hagar-Ahmad-3"
                },
                {
                    "user_id": "Hassan Khurram",
                    "user_href": "/profile/Hassan-Khurram-3"
                },
                {
                    "user_id": "Trnom S.a",
                    "user_href": "/profile/Trnom-S-a"
                }
            ]
        }
    ]
}