{
    "title": "Why is mathematics so hard? - Quora",
    "tags": [
        "Mathematics Education",
        "Advice"
    ],
    "response": [
        {
            "author_info": {
                "name": "Labib Zakaria",
                "href": "/profile/Labib-Zakaria"
            },
            "answer_text": "I think the other answers are good summaries of \"why people find elementary and high school-math difficult\".  Some people are bad at this type of math (which is not really math at all, but is actually just \"calculation\" or \"numeracy\").  Some people can do this type of math, but then find out that they are actually bad at REAL math when they have to learn it in university. School Maths: \"Maths\" in school is a discipline in which you learn a detailed set of protocols (step by step instructions) and then apply these protocols to a variety of situations.  This isn't *really* math: it is calculation!  I was bad at this type of math.  You can be bad at this type of math by being imprecise/not detail-oriented, having a hard time memorizing things that are structured as step-by-step instructions, having a hard time concentrating on repetitive tasks, having a hard time doing mental arithmetic, finding the subject too boring to invest any time in, having a sense of fear when studying math/expectation of failure.  I fit 100% of the above descriptions.  If you are also like me: don't be disheartened!!!  This is NOTHING like any math you would do above linear algebra or multivariable calculus!!!  Take a class in discrete mathematics (probably the easiest proof-based class, at least at my university) to test the waters and see if you are bad at mathematics or just bad at calculation!  I'm doing a PhD in applied mathematics-ish field now, so there you go! Real Maths:Real maths are much cooler than calculation!  You have to think creatively to solve problems.  In a lot of cases you need to think about how one problem \"maps\" onto another. Answers are often clever or elegant.  (There is some essay about how if schools taught music like they taught math, then you would spend 12 years learning how to transcribe musical scores and draw all the notes correctly before ever playing a single song.)  People fail at this level when they realize they aren't creative enough to come up with solutions to problems or if they struggle thinking about abstract things.  There are usually many many ways of approaching the problem, and some people can't think beyond the next few steps and often go off on a futile path.  Also, these fields tend to be poorly taught, so you have to be self motivated.  Finally, a lot of people who were the best of their class when they were taught calculation give up when they find themselves in the bottom half of the class, because they never had to work hard in math before and feel disheartened. Engineering Maths:In applied math fields, you don't need to solve any equations by hand (or at least very rarely).  You usually just let the computer do the calculation.  Instead, the important part is being able to have an intuition about equations.  This takes skills like mental estimation (guessing, not calculating), being able to understand how to describe the behavior of a system in terms of a category of equation, being able to mentally approximate the results of a model, and being able to reason about cases where your model would fail.  As a basic example: say you have a line y=ax+b.  You need to have the intuition to know that 'a' determines how fast the graph goes up and 'b' determines where the line will intersect with the axis.  People who struggle with this type of math are people who operate too mechanically, instead of taking a step back and thinking \"does this make sense\". People who are not good at visualizing graphs in their head might also struggle.   Therefore, there are different skills involved in different types of math.  If you are bad at \"school maths\" don't get disheartened!  You might still be able to become a mathematician or at least use math in your field!  Don't let calculation scare you! ",
            "date": "Answered March 4, 2013",
            "views": "209",
            "upvotes": " View 73 Upvoters",
            "upvoters": [
                {
                    "user_id": "Gábor Marschall",
                    "user_href": "/profile/Gábor-Marschall"
                },
                {
                    "user_id": "Marios Voskou",
                    "user_href": "/profile/Marios-Voskou"
                },
                {
                    "user_id": "Anthony Ursini",
                    "user_href": "/profile/Anthony-Ursini"
                },
                {
                    "user_id": "Teo Samarzija",
                    "user_href": "/profile/Teo-Samarzija"
                },
                {
                    "user_id": "Clima Gabriel",
                    "user_href": "/profile/Clima-Gabriel-1"
                },
                {
                    "user_id": "Pedro Sams",
                    "user_href": "/profile/Pedro-Sams"
                },
                {
                    "user_id": "Moatasem Kassab",
                    "user_href": "/profile/Moatasem-Kassab"
                },
                {
                    "user_id": "Moonlight Grn",
                    "user_href": "/profile/Moonlight-Grn"
                },
                {
                    "user_id": "Steve Batra",
                    "user_href": "/profile/Steve-Batra"
                },
                {
                    "user_id": "Anas Salama",
                    "user_href": "/profile/Anas-Salama-2"
                }
            ]
        },
        {
            "author_info": {
                "name": "Ron Maimon",
                "href": "/profile/Ron-Maimon"
            },
            "answer_text": "Mathematics requires an ability to study in complete isolation without getting lonely and without getting discouraged or distracted. There is a self-esteem issue, when you read something and don't understand, you feel worthless and stupid, and these blows to the ego must be shrugged off, and you just try again. It's catastrophic to the ego, because the set of stuff you can prove and other people can't is empty nearly all of the time. So irrationally inflated ego is psychologically useful, because you are going to be constantly confronting your own undeniable, quantifiable, stupidity. Irrationally inflated ego is generally associated with young males. Mathematics is also anti-rewarded by society, in that the more you study it, past a certain point, the less competent you will be at social stuff, like getting a date, because your brain will just keep getting rewired by the math, and you just get objectively smarter, and pretty soon you can't talk to anybody except other math people, because people don't understand you or find you boring, except for a small contingent of mostly young males. So by studying math, you are basically making the decision to work very hard to earn less money and be more socially awkward. So all the people who want political power just don't study it. But why would anyone study it? It's because with mathematics, there is permanent and irreversible progress--- it's been a long continuous punctuated revolution since the 1350s with no equal, except perhaps in the sciences. So you see that progress is possible in an objective way--- it is now easy to prove things that were hard or impossible even 50 years ago, and there's nothing people did 100 years ago that we don't find ridiculously easy to do today. This will go on forever. There is something else that is hard about the mathematics, which is that the pedagogy is terrible. You just can't learn it well in school, because the folks teaching you don't know the history of the field so well. There are also sticking points where mathematics contradicts intuition, and there are exactly two of these, both related: * Godel's theorem: people get discouraged by the idea that there are \"unprovable theorems\". The resolution to this is to understand the theorem, and know that it isn't saying that there are objectively \"unprovable theorems\", rather it is giving you a procedure to make axiom systems stronger, and it is perfectly reasonable to assume that all reasonable theorems become provable at some point. This is mathematician's theology--- all arithmetic conjectures will be resolved by a sufficiently large ordinal.* Continuum issues: these are the continuum hypothesis, and well-ordering the reals, and the non-measurable sets. These things are resolved by learning forcing, and by understanding the computational perspective that denies these questions having objective meaning, unlike arithmetic statements. These things were the critical issues for me. There was also some resistance to categories, but the theory there is sufficiently straightforward that you can learn it even if you hate it, and after you learn it you stop hating it. There is another issue of nonuniqueness. There are always many ways to prove something, and people have their own favorite way. So you try to prove things your own way, and you might fail, and someone else does it another way. Maybe your way is better. But sometimes people lose their own creative spark by reading too much about other people's ways. But sometimes people lose their focus by not reading other people's proofs. So who knows what's best here. Generally it's easier to learn mathematics than it has ever been, and it is much better today than 20 years ago, thanks to plentiful internet resources. In a little while it should be easy enough to make mathematical literacy (like understanding everything up to the 1950s) a reasonably universal adult skill. That will make certain progress in society, since there are certain logical fallacies, like gambling, that mathematically trained people don't make. ",
            "date": "Answered January 30, 2013",
            "views": "135",
            "upvotes": " View 70 Upvoters",
            "upvoters": [
                {
                    "user_id": "Tanveer Ahmed",
                    "user_href": "/profile/Tanveer-Ahmed-4"
                },
                {
                    "user_id": "Carmen Zheng",
                    "user_href": "/profile/Carmen-Zheng-7"
                },
                {
                    "user_id": "Steve Batra",
                    "user_href": "/profile/Steve-Batra"
                },
                {
                    "user_id": "Ashutosh Upadhye",
                    "user_href": "/profile/Ashutosh-Upadhye-1"
                },
                {
                    "user_id": "Alexandru Dreptu",
                    "user_href": "/profile/Alexandru-Dreptu"
                },
                {
                    "user_id": "Nicole",
                    "user_href": "/profile/Nicole-1241"
                },
                {
                    "user_id": "Eddie Lurker",
                    "user_href": "/profile/Eddie-Lurker"
                },
                {
                    "user_id": "Ruthieey",
                    "user_href": "/profile/Ruthieey"
                },
                {
                    "user_id": "Kennedy Walker",
                    "user_href": "/profile/Kennedy-Walker-41"
                },
                {
                    "user_id": "Jesus Alvarez",
                    "user_href": "/profile/Jesus-Alvarez-219"
                }
            ]
        },
        {
            "author_info": {
                "name": "Siddharth Bhattacharya",
                "href": "/profile/Siddharth-Bhattacharya"
            },
            "answer_text": "People find maths difficult because it is inherently difficult. Or- the time to realize one doesn't understand Math is much lesser than any other discipline.  I've graduated with degree in Mathematics & Computing alongside completing various courses in humanities- economics, literature, sociology. Nevertheless I'd prefer encountering a new topic/academic work in the latter for one in maths requires much more endurance and struggle. Why? Because Mathematics is too difficult to relate to. (I mean advanced mathematics, not basic arithmetic) Comparing to a subject like music, history, literature- we tend to have some ideas or opinions regarding them. Although it may bias our reading, it eases as well for it helps in association. Contrarily when we sit with Maths, we're dealing with something entirely new whose practical implications in our daily life are hard to imagine. If we draw a hierarchy tree, Maths would sit atop as it's concepts get used in 'applied fields'. The farther anything moves from reality, the more difficult it becomes to comprehend.  Even after studying advanced maths for 5 years, I'd struggle to define topology, while I can voice opinions on state-of-law, events in history and implications, intent of writers through protagonists primarily due to the subjective nature of these subjects. If I state \"World War 2 was won by Germany\" then I am wrong, but any further discussions on the topic \"Was US right in bombing Japan?\" to even the most extreme question considered \"Was Hitler doing the right thing\" can have diverse opinions. Although these views maybe kiddish, there is a place for them motivating students to pursue further for they can connect with it. Contrarily the objectivity of Maths makes it much tougher. Everything has a definite answer. Is \"Hausdorff space compact?\", \"Is this system deterministic or probable? If the latter, what is the probability?\" There's no \"maybe it's probabilistic system\". There's no place for 'opinions' and those who missed the basics of the subject would fail to understand the successive things entirely. So if one can't understand compactness of spaces, how would one answer if Hausdorff spaces are compact? (When I say difficult, I mean the concepts not the computation-which follows a methodical approach). Burden of proof increases the difficulty- no statement can be accepted without conclusive, irrefutable proof.These follow a sequence of arguments (theorems or axioms). In each step, one may find themselves drifting further from reality.   Any signs of reality? Most of my comparisons have been based against social sciences. However if we compare against sciences like physics, chemistry, medicine- still maths stands as more abstract and incomprehensible. We maybe able to relate to pulleys and resistance circuits more easily than epsilons & deltas primarily because we can see the former with our eyes. Similarly- flora, fauna, our human body- their tangible nature makes it more intuitive than maths. In the end, media-coverage also affects our subconscious understanding. This makes social sciences easier- basic level familiarity with it. If we'd more coverage on science-issues we'd have found them relatively easier. If media focused on proofs and abstraction more, maybe we'd found Math easier- but of course we want a life closer to reality, not away! ",
            "date": "Updated February 1, 2013",
            "views": "725",
            "upvotes": " View 239 Upvoters",
            "upvoters": [
                {
                    "user_id": "Soham Verma",
                    "user_href": "/profile/Soham-Verma-7"
                },
                {
                    "user_id": "Ruthieey",
                    "user_href": "/profile/Ruthieey"
                },
                {
                    "user_id": "Nithin Krishna",
                    "user_href": "/profile/Nithin-Krishna-37"
                },
                {
                    "user_id": "Rohit Kulkarni",
                    "user_href": "/profile/Rohit-Kulkarni-49"
                },
                {
                    "user_id": "Rachel Ng",
                    "user_href": "/profile/Rachel-Ng-83"
                },
                {
                    "user_id": "Arul Bose",
                    "user_href": "/profile/Arul-Bose-2"
                },
                {
                    "user_id": "Mike Jones",
                    "user_href": "/profile/Mike-Jones-1494"
                },
                {
                    "user_id": "Arindam Mandal",
                    "user_href": "/profile/Arindam-Mandal-11"
                },
                {
                    "user_id": "Jia Kai Lee",
                    "user_href": "/profile/Jia-Kai-Lee-1"
                },
                {
                    "user_id": "Dario Gustavo",
                    "user_href": "/profile/Dario-Gustavo"
                }
            ]
        },
        {
            "author_info": {
                "name": "Nicholas Cooper",
                "href": "/profile/Nicholas-Cooper-8"
            },
            "answer_text": "It is merely my humble opinion, but one I’ll back up with an article showing that there is at least one other with the same opinion. Mathematics (and, by extension, science) has become difficult because we are not explaining the philosophy behind mathematics and science when we learn. Furthermore, we are trying to explain something which another author here (please help me find the quote) says something along the lines of it being a big upfront investment that takes a long time before the payoff can be seen. Now, we can show small examples of payoff immediately (calculating a pocketbook), but with the big payoffs (descriptions of scientific concepts and computing) being so far removed, it’s easy to lose sight of why someone should learn it, and therefore, the demotivation some may get, makes it appear more difficult. And the demotivation part is important. Many kids are interested in learning things, but somewhere down the line they feel that they are not smart enough, or they have an experience that leaves them frustrated with an authority, or something is taught to them in such a way that it gives them no hope that they are learning anything beneficial. So, I’d like to get further into the root, and the philosophical and psychological reasons for this. First of all, logic may seem intuitive and obvious at first, but the application of logic (which mathematics ultimately is) actually requires a lot of thought. Sometimes the results of applying logic give us things that are intuitive, sometimes things that aren’t immediately intuitive, and sometimes things that are paradoxical by appearance. However, we don’t teach philosophy. We don’t teach formally logic the same way we do math, and then expect them to use such logic in mathematics. We don’t really get into what differentiates the formal sciences from the natural/social sciences. We expect students to believe that mathematics is the study of numbers (it’s isn’t - or rather, the if it is, it’s because the concept of numbers is FAR LARGER than anything they can imagine, but we don’t have a clear definition for that word). We have ways that they can put math in action, but we expect students to: accept they are learning it for the sake of math itself (which, the analytical reasoning skills ARE extremely important)accept that they may or may not use it in their daily lives (even though many will use things they don’t think they will, and won’t use things they think they will)accept that there are valid use cases for almost all mathematics they will encounter, up through the undergraduate level, but we either make the stories too unbelievable, or don’t bother to find a diverse set of uses for ithave an intuition of the subject without seeing such a use caseYou can see that items #1 and #3 conflict with #4. PS. (this was edited in) I wanted to add that many students tend to get stuck on existence. Philosophically, ontology (the study of what is meant by existence) is a difficult subject. When we learn about negative number, and numbers like 0, and imaginary numbers, some students get stuck on existence. We can and should always provide physical interpretations of any concept where we can, but should always be clear that using mathematics is always about the interpretation, not the ontology (which I think is probably a much clearer difference between applied and pure math). Existence has a meaning in mathematics (it’s a quantifier), and we have now seemed to taken the route that if it can exist, then it probably does, and we should stop focusing so much on the ontology in order to study it. The ontology is a great philosophical discussion, but it isn’t required by mathematics to find uses. (Richard Muller's answer to Do imaginary numbers actually exist, and is there any physical quantity that is actually complex?)  Ultimately, I’d like to say this: mathematics is the subject that is the most rigorous (matter-of-fact and exact in speech). It requires precise definitions, precise explanations, and doesn’t take anything for granted. Not everyone teaching mathematics has been taught properly, and we expect them to teach students properly and without demotivating the students. However, it’s not difficult, it’s just foreign at first, and anything foreign can be learned with effort and experience. If you are having problems learning from a teacher, supplement your learning online. If it is not the teacher, maybe you should sit down and ask for other ways of seeing the problems you are having (new views and interpretations on things are a big part of mathematics). If it is some trauma that has turned you off, unfortunately “getting back on the horse” is the best and only option (probably after discussing the event with a counselor, or another math teacher you can trust). Ultimately, get help!!! Mathematics is not done in isolation, and learning mathematics should not be done in isolation either. Start a joint study group. Get a (non-judgmental) tutor. Also, don’t treat mathematics or science skill as if it’s some measure of your intelligence. Sometimes people mature in these skills at different rates, and sometimes they go through spurts. Sometimes, the children that did the best in high school do the worst in college, and vice versa. Sometimes the subjects you failed become your favorite subjects.  I’ll reiterate here. Early mathematics is more difficult to teach than it is to learn. We have to give definitions, but too intuitive, and people get lost thinking that the intuition is what matters. If it’s too rigorous (precise), it’s boring and turns the students off of the subject. It requires patience and persistence on the part of the teacher, and is especially more so when there is a diverse group with cliques that understand quickly, and those that take more time. It requires understanding how students think, and refining that understanding as generations change. It requires appealing to things that make them laugh, things that make them think, and things that make them motivated. It requires positive critique that doesn’t demotivate the students. It requires doing all of this while ensuring that the students understand the subject well enough to make high marks on the tests that will ultimately be the judge of the teachers themselves. ",
            "date": "Answered November 16, 2017",
            "views": "44",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Rachel Ng",
                    "user_href": "/profile/Rachel-Ng-83"
                },
                {
                    "user_id": "Papy Gallo Diaw",
                    "user_href": "/profile/Papy-Gallo-Diaw"
                },
                {
                    "user_id": "Abhinav Upendra",
                    "user_href": "/profile/Abhinav-Upendra"
                }
            ]
        },
        {
            "author_info": {
                "name": "Carter McClung",
                "href": "/profile/Carter-McClung"
            },
            "answer_text": "I've struggled with this my whole life. I'm one of those who gets it. But as a math teacher, I have to figure out why people don't get it. Here are some of the conclusions I've found though both anecdote and looking at research. Math is cumulative. Students are often used to learn and dump. Learn it, test it, forget it. Math doesn't allow you to do this. This is also a nightmare for students who have been absent for a long time or have a crisis, like parents who divorce, a relationship gone bad, or a long medical problem. Not to mention what happens if they get a horrible teacher one year. If this happens in any other subject, you can have success the following year. With math, you really have to fill in those gaps before moving on, but most students don't, and with one-size-fits-all curriculum, it's hard to get those gaps filled. (As a side note: If your kid struggles in math, or missed a bunch of school, I recommend intervention early, rather than late.) It is, by nature, abstract. Math is intentionally abstract. The idea is to create abstract tools that can be used in a wide variety of contexts, but this abstraction trips a lot of people up. When you give some people specific hands-on problems, they can solve them. When you confront these same learners with abstract ideas, they can't see the trees for the forest. They can't make the connection between an abstract idea and the specific scenarios they would apply this abstract idea in. Good teaching can get around this, to a degree, by building an abstract idea through a series of specific examples rather than the other way around. Concepts are sometimes introduced at inappropriate times. Different minds develop at different rates. There are milestones that have to be reached before some concepts can be fully understood. One of the reasons that people hate fractions is that some have to learn and use them before their proportional reasoning is fully developed. One reason people hate Algebra is that they have to learn it before their abstract thinking is well developed. Some minds are ill-equipped to do math. Some have better spatial reasoning, some have better logical reasoning. Some have non-math related issues like dyslexia which can be a barrier to learning it. It's really best to avoid this kind of thinking though, because again, development happens at different rates, and just because you don't have as much ability doesn't mean you can't develop a lot. Just because I'll never be an Olympic marathoner doesn't mean I can't increase my endurance considerably by running more. It's hard to do under emotional strain. Any task is hard to do under emotional strain, but whenever you're hyper-emotional, it's near impossible to think logically. This is why test anxiety is multiplied when applied to math. I also have students all the time who just broke up with their boyfriend or girlfriend, or just found out their dad has cancer. Those folks have a hard time doing logical tasks, even if they want to. Math can't be faked. In liberal arts, there aren't as many objective standards as there are in math. If you don't believe me, look at the quantity of liberal arts degrees versus the quantity of STEM degrees. STEM degrees are hard, because you have to know what you're doing, and if you don't it becomes immediately obvious. There are objective standards in other fields, but they aren't always as binary (you know it, or you don't) as they are in math classes. ",
            "date": "Updated May 28, 2019",
            "views": "508",
            "upvotes": " View 273 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Riddhi Sharmore",
                    "user_href": "/profile/Riddhi-Sharmore"
                },
                {
                    "user_id": "Steve Batra",
                    "user_href": "/profile/Steve-Batra"
                },
                {
                    "user_id": "Mituban Saikia",
                    "user_href": "/profile/Mituban-Saikia"
                },
                {
                    "user_id": "Haining Li",
                    "user_href": "/profile/Haining-Li"
                },
                {
                    "user_id": "Nithin Krishna",
                    "user_href": "/profile/Nithin-Krishna-37"
                },
                {
                    "user_id": "Ori Feynman",
                    "user_href": "/profile/Ori-Feynman-1"
                },
                {
                    "user_id": "Ravi Sethi",
                    "user_href": "/profile/Ravi-Sethi-56"
                },
                {
                    "user_id": "Anaya Barnes",
                    "user_href": "/profile/Anaya-Barnes-1"
                },
                {
                    "user_id": "Nakul Baliga",
                    "user_href": "/profile/Nakul-Baliga"
                },
                {
                    "user_id": "Kennedy Walker",
                    "user_href": "/profile/Kennedy-Walker-41"
                },
                {
                    "user_id": "Sameer Pahwa",
                    "user_href": "/profile/Sameer-Pahwa"
                },
                {
                    "user_id": "Francesca Uy",
                    "user_href": "/profile/Francesca-Uy-1"
                },
                {
                    "user_id": "Soumya Joshi",
                    "user_href": "/profile/Soumya-Joshi-27"
                },
                {
                    "user_id": "Aditya Pawan Saikia",
                    "user_href": "/profile/Aditya-Pawan-Saikia"
                },
                {
                    "user_id": "Rachel Ng",
                    "user_href": "/profile/Rachel-Ng-83"
                },
                {
                    "user_id": "John Roach",
                    "user_href": "/profile/John-Roach-46"
                },
                {
                    "user_id": "Rogério Almeida",
                    "user_href": "/profile/Rogério-Almeida-2"
                },
                {
                    "user_id": "Bharat Ratan Sharma",
                    "user_href": "/profile/Bharat-Ratan-Sharma-1"
                },
                {
                    "user_id": "Maia Talbert",
                    "user_href": "/profile/Maia-Talbert"
                },
                {
                    "user_id": "Vasanth",
                    "user_href": "/profile/Vasanth-28"
                }
            ]
        },
        {
            "author_info": {
                "name": "Gabriel Harper",
                "href": "/profile/Gabriel-Harper"
            },
            "answer_text": "Anything can be difficult if it's boring. There are certainly a lot of reasons, but I think these lie at the core:  For most sane human beings, math is an incomprehensibly mind-numbing and entirely fruitless exercise in cerebral fitness; nothing more.Math teachers tend to be complete nerds who are great with numbers and terrible at connecting with people.Math teachers are typically inept at associating math lessons with reality.Math is completely unemotional for most people. It doesn't engage you on any personal level. Without any spark of feeling to drive a student's interest, they will never become captivated by the subject.I always managed top grades in math studies and took most of the advanced courses up until college. Honestly it bored me to death, but it was pretty easy for me so I could score well without much effort. The only time I was ever really excited about math is when I was at home, programming my 8086. I got a 486 when I was around 12-13 and started coding 3D transformation algorithms for a simple rendering engine I was building. I had to teach myself the math, and I actually found it pretty intuitive because it fit into a greater purpose; it had context in a project that I was really passionate about completing. It didn't dawn on me how little I actually cared about math for the sake of math until I started taking advanced courses as a freshman in college. The professor sucked. He wrote his own course book and it was almost completely illegible (it didn't help that I hate sloppy handwriting). He was everything you would expect in a stereotypical mathematician: impersonal, disconnected from his students, and obsessed with numbers. Not once did we get out of our seats and put our theories and knowledge to the test in any real life circumstances. Not once did he approach students individually to discover their innate talents or interests. He might has well have been a talking textbook. It was an absolute bore, and it permanently threw a wet blanket on any interest I had in the subject for many years. The sad thing is that I absolutely love physics. If I hadn't pursued a career in computers, it probably would have been physics (or neurology, but I didn't quite discover my passion for the subject until much later in life). Unfortunately physics has extreme demands for mathematical ability. If only I had somehow brought the two together years ago, it probably would have given me some passion for the subject. It seems to me that once you get beyond the basics, math studies really need to have a place in the bigger picture. Teaching advanced concepts & math history without any thought to application is possibly the most effective way to drive students away from the subject. ",
            "date": "Answered February 1, 2013",
            "views": "63",
            "upvotes": " View 16 Upvoters",
            "upvoters": [
                {
                    "user_id": "Rachel Ng",
                    "user_href": "/profile/Rachel-Ng-83"
                },
                {
                    "user_id": "Noah Emerson",
                    "user_href": "/profile/Noah-Emerson-3"
                },
                {
                    "user_id": "Fifi Art",
                    "user_href": "/profile/Fifi-Art"
                },
                {
                    "user_id": "K Danvurl",
                    "user_href": "/profile/K-Danvurl"
                },
                {
                    "user_id": "Cory Robbins",
                    "user_href": "/profile/Cory-Robbins-12"
                },
                {
                    "user_id": "J. Liang",
                    "user_href": "/profile/J-Liang-6"
                },
                {
                    "user_id": "Brian Ahanonu",
                    "user_href": "/profile/Brian-Ahanonu"
                },
                {
                    "user_id": "John Constantine",
                    "user_href": "/profile/John-Constantine-46"
                },
                {
                    "user_id": "Ricky Skolrood",
                    "user_href": "/profile/Ricky-Skolrood"
                },
                {
                    "user_id": "Irvin Acosta",
                    "user_href": "/profile/Irvin-Acosta"
                },
                {
                    "user_id": "David Li",
                    "user_href": "/profile/David-Li-232"
                },
                {
                    "user_id": "Marat Makmudov",
                    "user_href": "/profile/Marat-Makmudov"
                },
                {
                    "user_id": "Ondrej Roldan",
                    "user_href": "/profile/Ondrej-Roldan"
                },
                {
                    "user_id": "Petras Pavardenis",
                    "user_href": "/profile/Petras-Pavardenis"
                },
                {
                    "user_id": "Kostyantyn Mazur",
                    "user_href": "/profile/Kostyantyn-Mazur"
                },
                {
                    "user_id": "Shivakant Shukla",
                    "user_href": "/profile/Shivakant-Shukla"
                }
            ]
        },
        {
            "author_info": {
                "name": "Drew Henry",
                "href": "/profile/Drew-Henry-2"
            },
            "answer_text": "Math is abstract and the more abstract it gets, the more difficult it gets. What is 1/3? If you visualize a pie, then 1/3 is one out of three slices of pie, all three of which make up the whole pie. What does it mean for a metric space to be compact? You can appeal to your knowledge of Euclidean space and closed sets to help understand the concept of metric spaces and compactness, but there isn't much freedom for relying on real world experience anymore (if you disagree, then substitute compact metric space with something appropriately abstract) and you are instead forced to appeal to previous mathematical knowledge. Math is rigorous. This applies mainly to higher level math and can hinder both mathematical understanding and mathematical doing. If math is presented in a very rigorous manner, it can be difficult to translate this into something more intuitive. Compare the intuitive explanation of a limit to the epsilon-delta definition for a good example of this. Reading proofs can be especially difficult because they not only require you to be able to comprehend mathematical gibberish but to be able to do so continuously while following a mathematical train of thought for several lines, paragraphs, or even pages. Additionally, having to translate the other way can make actually producing rigorous mathematical work (e.g. doing proofs) very difficult. Math can be counter-intuitive which can make it confusing. Any area of math involving infinity gives a good example of this. A good portion of any undergraduate level linear algebra textbook is going to have the disclaimer \"for finite vector spaces\" somewhere in almost every theorem because the friendly, intuitive theorems of finite dimensional linear algebra fall apart in infinite dimensions. Math has prerequisites. If you don't understand the prerequisites well, then topics that build on them will be very difficult to comprehend. Some people have an easier time with hardcore logic and abstractions than other people. I'd like to think I'm good at math but I am very bad at art and so an equally valid question from my perspective might be \"Why is drawing so hard?\" Really, I mean I do notice when some people have slightly taller heads than other people or slightly bigger/smaller ears, etc., but how on earth can people look at someone's face and not only be able to comprehend all the details but also be able to translate them into a portrait that looks exactly like that person? How do they even create continuous shading with only one pencil? When I try to do that I can only get 2-3 shades: light, dark, and maybe some sort of in between. ",
            "date": "Answered August 16, 2015",
            "views": "9",
            "upvotes": " View 17 Upvoters",
            "upvoters": [
                {
                    "user_id": "Steve Batra",
                    "user_href": "/profile/Steve-Batra"
                },
                {
                    "user_id": "Rachel Ng",
                    "user_href": "/profile/Rachel-Ng-83"
                },
                {
                    "user_id": "A. Anuma",
                    "user_href": "/profile/A-Anuma"
                },
                {
                    "user_id": "Sai Kham Kyaw Hpa",
                    "user_href": "/profile/Sai-Kham-Kyaw-Hpa"
                },
                {
                    "user_id": "Atharva Pangarkar",
                    "user_href": "/profile/Atharva-Pangarkar"
                },
                {
                    "user_id": "Nkoyo Aki",
                    "user_href": "/profile/Nkoyo-Aki"
                },
                {
                    "user_id": "Tanishq Varshney",
                    "user_href": "/profile/Tanishq-Varshney-2"
                },
                {
                    "user_id": "Merce Perrault",
                    "user_href": "/profile/Merce-Perrault"
                },
                {
                    "user_id": "Brian Ahanonu",
                    "user_href": "/profile/Brian-Ahanonu"
                },
                {
                    "user_id": "Led Man",
                    "user_href": "/profile/Led-Man-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Meni Rosenfeld",
                "href": "/profile/Meni-Rosenfeld"
            },
            "answer_text": "Math is hard because it is important enough to study the hard parts of it. Everything can be difficult or easy depending on how deep you go in. Can you calculate 1+2? Did you get 3? Good. Was that hard? Of course not. If the only math anyone expected you to do was things like 1+2, would you think that math is hard? No. Likewise, if people expected you to run a marathon each day, you would ask why is running so hard. If people expected you to beat chess grandmasters, you'd be asking why is chess so hard. They don't expect this of you. Why? Because it's not important. If you're not a professional athlete, running marathons is not important, you can stay healthy with much milder exercise. Chess is a fun and beneficial hobby but ultimately it's not very important - so society doesn't force you to play chess, you do it if you feel like it. But math is important. The more math you know, the better you'll be equipped to handle a variety of situations in your professional and personal life. Society realizes this and requires that everyone studies math. And not just the easy parts - people are challenged to study a relatively high level of math, because of all its benefits. By definition the math studied will be hard, because if it was easy, people would be required to study even harder math! It's not only the average college student that studies much math. Professional academics advance the frontiers of mathematical research - and here again, because math is so important, a lot of smart people put a lot of effort in it, so the math they come up with is much, much harder than what the average person can handle. I've mentioned the \"required\" math to be relatively high - it's relative only to the aptitude of the average person, it's a drop in the ocean compared to all the math that is out there. There is another aspect - while society is right about teaching math to everyone, it is often very wrong about which parts of math to teach, and how. Anything can seem hard if it is taught poorly. ",
            "date": "Answered May 11, 2016",
            "views": "97",
            "upvotes": " View 32 Upvoters",
            "upvoters": [
                {
                    "user_id": "Anthony Mandella",
                    "user_href": "/profile/Anthony-Mandella-1"
                },
                {
                    "user_id": "Rachel Ng",
                    "user_href": "/profile/Rachel-Ng-83"
                },
                {
                    "user_id": "Arash Jamshidi",
                    "user_href": "/profile/Arash-Jamshidi-2"
                },
                {
                    "user_id": "Hira Rehman",
                    "user_href": "/profile/Hira-Rehman-28"
                },
                {
                    "user_id": "Conor Rafferty",
                    "user_href": "/profile/Conor-Rafferty-7"
                },
                {
                    "user_id": "Brian Ahanonu",
                    "user_href": "/profile/Brian-Ahanonu"
                },
                {
                    "user_id": "Robert Kastle",
                    "user_href": "/profile/Robert-Kastle-1"
                },
                {
                    "user_id": "Nadia Bee",
                    "user_href": "/profile/Nadia-Bee"
                },
                {
                    "user_id": "Ryan Baron",
                    "user_href": "/profile/Ryan-Baron-1"
                },
                {
                    "user_id": "Oktay Kuzu",
                    "user_href": "/profile/Oktay-Kuzu"
                },
                {
                    "user_id": "Kostyantyn Mazur",
                    "user_href": "/profile/Kostyantyn-Mazur"
                },
                {
                    "user_id": "N.J. Kinny",
                    "user_href": "/profile/N-J-Kinny"
                },
                {
                    "user_id": "Aaron Manley",
                    "user_href": "/profile/Aaron-Manley"
                },
                {
                    "user_id": "Ardavan Farahvash",
                    "user_href": "/profile/Ardavan-Farahvash"
                },
                {
                    "user_id": "Ethan Mallove",
                    "user_href": "/profile/Ethan-Mallove-1"
                },
                {
                    "user_id": "Claire Huang",
                    "user_href": "/profile/Claire-Huang-6"
                },
                {
                    "user_id": "Red Augwal",
                    "user_href": "/profile/Red-Augwal"
                }
            ]
        },
        {
            "author_info": {
                "name": "Ben Baert",
                "href": "/profile/Ben-Baert"
            },
            "answer_text": "There are a number of reasons why people claim that mathematics is difficult: mathematics has a very low tolerance level for errors. In many subjects, you can get by with reasonable approximations of an answer. In mathematics, you usually don't get away with approximations. Your answer has to be exact. I would argue that most subjects are in fact harder than mathematics, but since you can get away with approximations in most fields (which often leads to a lot of B.S.), many people feel that these fields are easier, while they're in fact just getting away with an incorrect or incomplete answer. In mathematics, if you're wrong, you will know it immediately.;people tell each other that mathematics is difficult, which reinforces their view that mathematics is difficult. If you constantly tell yourself and are told by others that mathematics is difficult, then you'll find it difficult, regardless of whether it's actually difficult;many people haven't even mastered very basic concepts before moving on to more difficult ideas in mathematics. You really shouldn't be doing calculus if you aren't even comfortable with basic algebra, yet many people are doing exactly that. You never should move on to a more advanced topic if the foundation on which that topic is built isn't as obvious to you as '1+1=2';mathematics is dense. People, especially in this era, are used to skimming, and they mostly get away with it, since most authors don't refrain from taking up ten pages to explain an idea that you could explain on just one page. In mathematics, it's the complete opposite. You may have a very thin 50-page textbook that has a wealth of information and requires more time and practice than a 500-page textbook in, say, psychology. Yet many people try to get through this very dense textbook in the same way as they would get through a not-so-dense humanities textbook, which is a recipe for disaster. Or they will feel that they are slower and then think that they're doing poorly because it takes so much time, while that's in fact just because the book is dense rather than because of their lack of understanding.mathematics simply requires a lot of practice. If you don't practice, and many people who find mathematics hard don't, then you simply won't get it. Too many students read a mathematics textbook as if it's a novel, and this simply doesn't work. You have to sit down with your textbook on your left side and plenty of empty sheets of paper on your right and just do tons of exercises.",
            "date": "Updated May 30, 2019",
            "views": "451",
            "upvotes": " View 224 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Bernadette Russek",
                    "user_href": "/profile/Bernadette-Russek-1"
                },
                {
                    "user_id": "Rachel Ng",
                    "user_href": "/profile/Rachel-Ng-83"
                },
                {
                    "user_id": "Elijah Day",
                    "user_href": "/profile/Elijah-Day-2"
                },
                {
                    "user_id": "Eugenio Di Paola",
                    "user_href": "/profile/Eugenio-Di-Paola-1"
                },
                {
                    "user_id": "Brian Ahanonu",
                    "user_href": "/profile/Brian-Ahanonu"
                },
                {
                    "user_id": "Drake Johnson",
                    "user_href": "/profile/Drake-Johnson-52"
                },
                {
                    "user_id": "Angel Ramos",
                    "user_href": "/profile/Angel-Ramos-23"
                },
                {
                    "user_id": "James Coxson",
                    "user_href": "/profile/James-Coxson"
                },
                {
                    "user_id": "Claire Germond",
                    "user_href": "/profile/Claire-Germond"
                },
                {
                    "user_id": "Davis Strelkovs",
                    "user_href": "/profile/Davis-Strelkovs"
                },
                {
                    "user_id": "Ricky Skolrood",
                    "user_href": "/profile/Ricky-Skolrood"
                },
                {
                    "user_id": "William Meyers",
                    "user_href": "/profile/William-Meyers-12"
                },
                {
                    "user_id": "Emanuel Falkenauer",
                    "user_href": "/profile/Emanuel-Falkenauer"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/TheUltimate-Gamer-1"
                },
                {
                    "user_id": "Lee",
                    "user_href": "/profile/Lee-2514"
                },
                {
                    "user_id": "Ondrej Roldan",
                    "user_href": "/profile/Ondrej-Roldan"
                },
                {
                    "user_id": "Jishnu Mukherjee",
                    "user_href": "/profile/Jishnu-Mukherjee-20"
                },
                {
                    "user_id": "Abhyuday Chakraborty",
                    "user_href": "/profile/Abhyuday-Chakraborty-1"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/SAMRUDH-2"
                },
                {
                    "user_id": "Putri Romhadhoni",
                    "user_href": "/profile/Putri-Romhadhoni"
                }
            ]
        },
        {
            "author_info": {
                "name": "Peter Flom",
                "href": "/profile/Peter-Flom"
            },
            "answer_text": "1. Anyone who reads what college students write will quickly realize that many students find writing difficult. 2. In addition, what we call \"math\" is really three different subjects. 1) Arithmetic. We know what that is. 2) What I call quantitative reasoning, this is the ability to know what answers are ridiculous. 3) Then there's math. Arithmetic is to math as spelling is to creative writing - maybe nice to have, but by no means essential. Most people never learn ANY math.  Math is not about adding and subtracting, or even differentiating and integrating. Math is about the search for structured beauty. It is more akin, in some ways, to sculpture or poetry (especially in highly structured forms) than to engineering. 3. In elementary school, we are usually taught by people who don't like math and who never do any.  If you wanted to take music lessons, you would demand that the teacher know how to play (and probably that he/she listen to music). If you wanted to learn how to cook, dance, write or anything else.... It would be similar. Why is math different? 4. Math is taught all wrong. We teach math (mostly) in one of two ways. I will draw analogies to learning to play the piano. Method 1: At the first lesson, the student taps middle c repeatedly. At the second lesson the d next to the c. And so on for 88 lessons before even starting to learn a song.  Method 2: At the first lesson, the student watches a video of Vladimir Horowitz. At the next lesson, Art Tatum. And so on. The student is not permitted to touch a piano. 5. We teach math as if it were easy, when it is, in fact, hard.  One huge steppingstone for many is negative numbers. Do you know how long it took the smartest mathematicians to learn to deal properly with them? Thousands of years! We teach kids that they are supposed to get the right answer, probably on the first attempt at each problem. Why should they? 6. Culturally, we permit badness at math in ways we do not permit badness at other subjects.  \"Oh, I'm no good at math!\" is fine to say. \"Oh, I never learned to read!\" - not so much.  7. Math is formal. It is the most formal subject, and most people have little or no practice dealing with formal subjects. ",
            "date": "Answered February 8, 2014",
            "views": "211",
            "upvotes": " View 85 Upvoters ",
            "upvoters": [
                {
                    "user_id": "JuanManuel Gonzalez",
                    "user_href": "/profile/JuanManuel-Gonzalez"
                },
                {
                    "user_id": "Nobel Alam",
                    "user_href": "/profile/Nobel-Alam"
                },
                {
                    "user_id": "Steve Batra",
                    "user_href": "/profile/Steve-Batra"
                },
                {
                    "user_id": "Moonlight Grn",
                    "user_href": "/profile/Moonlight-Grn"
                },
                {
                    "user_id": "Alexandru Dreptu",
                    "user_href": "/profile/Alexandru-Dreptu"
                },
                {
                    "user_id": "Mohammed Samarraie",
                    "user_href": "/profile/Mohammed-Samarraie-2"
                },
                {
                    "user_id": "Ruthieey",
                    "user_href": "/profile/Ruthieey"
                },
                {
                    "user_id": "Kennedy Walker",
                    "user_href": "/profile/Kennedy-Walker-41"
                },
                {
                    "user_id": "Anete Ķempele",
                    "user_href": "/profile/Anete-Ķempele"
                },
                {
                    "user_id": "Rachel Ng",
                    "user_href": "/profile/Rachel-Ng-83"
                },
                {
                    "user_id": "Ishwor Shrestha",
                    "user_href": "/profile/Ishwor-Shrestha-32"
                },
                {
                    "user_id": "Subhobrata Chakravorti",
                    "user_href": "/profile/Subhobrata-Chakravorti"
                },
                {
                    "user_id": "Samuel Maged",
                    "user_href": "/profile/Samuel-Maged-1"
                },
                {
                    "user_id": "Aless Zeld",
                    "user_href": "/profile/Aless-Zeld"
                },
                {
                    "user_id": "Neha Malik",
                    "user_href": "/profile/Neha-Malik-50"
                },
                {
                    "user_id": "Mayura Jadhav",
                    "user_href": "/profile/Mayura-Jadhav-1"
                },
                {
                    "user_id": "JAI GOVIND",
                    "user_href": "/profile/JAI-GOVIND-16"
                },
                {
                    "user_id": "Ekrah Afridi",
                    "user_href": "/profile/Ekrah-Afridi"
                },
                {
                    "user_id": "Kevin Erwins",
                    "user_href": "/profile/Kevin-Erwins"
                },
                {
                    "user_id": "ChinniKrishna Kothapalli",
                    "user_href": "/profile/ChinniKrishna-Kothapalli"
                }
            ]
        },
        {
            "author_info": {
                "name": "Prosenjit Dubey",
                "href": "/profile/Prosenjit-Dubey"
            },
            "answer_text": "Alright, this is a topic that’s pretty close to my heart, and I’m gonna have to disagree with most of the other answers for this topic. I would posit that mathematics isn’tnearly as hard as most people think it is. However, it is so heavily stigmatized that people begin to have the wrong ideas when going into math, which only hurts them in the end. So, why is math perceived as such a hard thing? I’ll list the reasons: Bad beginnings – Math is highly foundation-based, and it is something that continues to build upon itself as you go higher up in education. People’s main foundation of mathematicaContinue Reading",
            "date": "Answered September 19, 2017",
            "views": "0",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Nick Campbell",
                "href": "/profile/Nick-Campbell-4"
            },
            "answer_text": "Most people consider math hard, because they have weak foundations in the subject material. Then when they try to do something in math, they struggle with it. That difficulty leads many persons to give up prematurely and accept that they aren’t good at math and that math is hard because our society has developed an acceptability in declaring that math is hard and that we may suck at it. There is a shame associated with not being good at reading or writing, but when it comes to math, we often brag “I suck at math.” and wear that statement proudly. It’s strange. Then there is the reality that mat Continue Reading",
            "date": "Answered June 11, 2017",
            "views": "0",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Joyce Fetteroll",
                "href": "/profile/Joyce-Fetteroll"
            },
            "answer_text": "Math isn't difficult. The way it's taught is difficult. In math class, you'd be told there are 8 kids and 4 cookies. Your task would be to divide them up equally. The answer would be 1/2 a cookie each. In real life, there would be multiple solutions. Maybe not all kids like ginger cookies. Maybe there would be other snacks. Maybe you wouldn't bring out the cookies because they don't break neatly into halves. That's all mathematical reasoning. In math class, you'd be told apples are 3 for $5. How many apples can you buy for $8? But that's not a realistic problem. In real life, you might decide th Continue Reading",
            "date": "Updated December 13, 2019",
            "views": "0",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Kevin Coombes",
                "href": "/profile/Kevin-Coombes"
            },
            "answer_text": "First, because it is cumulative. Everything builds on what came before. So, if you fail to learn/understand one piece, then it is almost impossible to make sense of later parts of mathematics that depend on that piece. Second, it is taught poorly, especially in early grades. People who become elementary school teachers often (know that they) don't really understand mathematics, and think it is less important for them to fully understand mathematics. Combining this with the first point, you can see why many people will, at some point, find mathematics to be hard Third, over time, math textbooks g Continue Reading",
            "date": "Answered June 28, 2017",
            "views": "0",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Jeremy Miles",
                "href": "/profile/Jeremy-Miles"
            },
            "answer_text": "Math is difficult because everything is difficult. Writing stories is difficult. Dancing is difficult.   Acting is difficult.   A few years ago I heard a section on the radio where they brought people in off the street and asked them to read the weather report. They were appalling. Really, really bad. Reading the weather on the radio is difficult. Writing good answers on Quora is difficult.  A very few people are good at any of these. But with most things, it's hard to know just how bad you are. Watch the early American Idols. Most of those people are dross. But they are really, truly horribly disap Continue Reading",
            "date": "Answered January 31, 2013",
            "views": "0",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Sheryl-Lynn Tan",
                "href": "/profile/Sheryl-Lynn-Tan-1"
            },
            "answer_text": "Learning math is often likened to learning a foreign language. Both subjects involve the building up of basic knowledge before advancing to a higher level of study. Let’s say, when we study trigonometry or calculus for example, we need to have a stable and concrete algebra foundations in order to solve more complex problems. But can we be definitely sure that most students have mastered all their basic concepts before progressing to a higher level of mathematics? First, we should take a look at our current education system. Many schools, which I have studied at or visited to gain experience, e Continue Reading",
            "date": "Answered March 15, 2018",
            "views": "0",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Matthew Funk",
                "href": "/profile/Matthew-Funk-4"
            },
            "answer_text": "Because it is highly cumulative and mastery is required at every level before advancing on to the next level. More than any other subject, math builds from one section to another. You can’t do multiplication if you don’t have an excellent understanding of addition. You can try, but it will probably eat you alive. Similarly, you can’t do algebra if you don’t understand arithmetic that well. And you won’t be able to do calculus if you’re struggling with algebra. You can’t just get through one level and move onto the next, you have to have full understanding, because at the next level, the previou Continue Reading",
            "date": "Answered July 27, 2019",
            "views": "0",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Grant Reaber",
                "href": "/profile/Grant-Reaber"
            },
            "answer_text": "I have studied math throughout my life. I almost became a mathematician, but I quit my PhD program partly because I found math too hard. I switched into philosophy, which is no easier but is hard for different reasons. One reason math can be hard is that something can work without anyone understanding why it works. This cannot happen in philosophy. A reason learning math that others have done can be hard is that when you are learning something new, you often have to take on faith a bunch of definitions and facts that you can’t yet make sense of. Why is the person defining this concept or setting Continue Reading",
            "date": "Answered October 18, 2016",
            "views": "0",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Doug Garnett",
                "href": "/profile/Doug-Garnett"
            },
            "answer_text": "Let me suggest you first read this essay called “Lockharts Lament”… https://www.maa.org/external_archive/devlin/LockhartsLament.pdf Simplified, the essay points out that if we applied how we teach math to music, then students would spend 12 grades learning music notation, recognizing and reading music, reading gaps, chords, arpeggio’s, etc… And we’d leave actually playing music until college - as an advanced endeavor. There is tremendous truth in this analogy. Mathematics education is focused on the least important and least useful parts of mathematics - all designed around a requirement for pre Continue Reading",
            "date": "Answered May 20, 2016",
            "views": "0",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Santosh Raj Battu",
                "href": "/profile/Santosh-Raj-Battu"
            },
            "answer_text": "Few reasons why Mathematics is so hard can be: Exposure - Mathematical skills aren’t usually given a lot of attention outside of the classroom. As one quote I saw many years ago said, \"We play with what we love\". Play with numbers, patterns and words from the very beginning and many learning problems will never develop. Logical Skills-Maths requires logic, and many kids are not trained on logical skills at an early age. It helps to decide which problem-solving skill to try first. Support-Children need regular support in order to recognize the mathematics in the world around them, and parents are  Continue Reading",
            "date": "Answered August 17, 2017",
            "views": "0",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Jan Meww",
                "href": "/profile/Jan-Meww"
            },
            "answer_text": "The way math is taught is not entirely correct. Mathematics is a way of thinking, not a number-crunching tool. Here is an example of the wrong way to teach mathematics: What is  ? At school, they merely do this:  Then:  Then:  Then:  Combining similar things:   But what is the right way? The right way is to ask, what does it mean? What is the pattern here? Not only do we need to see the pattern, but also one step before and after it: Here is the pattern:(illustration credit) [1] Continue ReadingFootnotes[1] Image on wikimedia.org",
            "date": "Updated July 15, 2020",
            "views": "0",
            "upvotes": "0"
        }
    ]
}