{
    "title": "Why does my mum always say that I am dumb and not smart? - Quora",
    "tags": [
        "Mother-Child Relationships",
        "Mothers",
        "Family Relationships and Dynamics",
        "Family",
        "Understanding Human Behavior",
        "Interpersonal Interaction"
    ],
    "response": [
        {
            "author_info": {
                "name": "Jack Richard",
                "href": "/profile/Jack-Richard-83"
            },
            "answer_text": "It depends, she could just be referring to you as dumb in comparison to her or other people. Most kids are “dumb” in comparison to their parents but that is just natural. They have been here a lot longer and have more experience and knowledge then you do. It could be a perspective thing. There will always be someone smarter than you, someone who knows more than you ever will (obviously with a few exceptions). People tend to think because the have researched a topic online that they are in position to lecture others (anti vaxers for example). Most people spend countless hours of their lives studying and practicing to be able to make valid contributions to certain things, yet Karen who read 3 articles thinks she is an expert. It really just depends on what context she is saying it, but people have their talents. You may not be “smart” but you might be a world class athlete. If it is meant as an insult then chances are your mum thinks she's smarter than she really is. ",
            "date": "Answered August 11, 2020",
            "views": "55",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Jerrod Tibor",
                "href": "/profile/Jerrod-Tibor"
            },
            "answer_text": "Because she's mean. Parents shouldn't talk to their kids like that. Try not to take her words to heart. It's her problem, not yours. Whatever your IQ, you can learn new things & grow as a person. You should be encouraged to do that, not called names by somebody who should be giving you unconditional support. ",
            "date": "Answered August 11, 2020",
            "views": "71",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Brad Mount",
                    "user_href": "/profile/Brad-Mount-1"
                },
                {
                    "user_id": "XElitiok",
                    "user_href": "/profile/XElitiok"
                }
            ]
        }
    ]
}