{
    "title": "'Lidar is the new GPS. A thousand unanticipated uses will surface once it becomes a default sensor.' What sort of uses might Lidar have? - Quora",
    "tags": [
        "LIght Detection and Ranging",
        "Sensors"
    ],
    "response": [
        {
            "author_info": {
                "name": "Jock McTavish",
                "href": "/profile/Jock-McTavish"
            },
            "answer_text": "No way. I searched the sentence, wondering who would make such a claim, and it’s context. It appears the claim is simply circulating in the blogosphere and on twitter. A fragment of a sales pitch I’m afraid. Lidar is precision distance measurement based on timing the return signal of a laser beam. So it is highly specialized equipment. Say you’re using lidar to detect deer in the headlights in an automatic car. You’ll need some very sophisticated programming to first, scan the beam through the space around you, then target analysis to discriminate bushes from deer. etc etc. So the uses of Lidar will be to take over the distance measuring applications that microwave devices presently service - like the policeman’s radar speed gun. The survey people have been doing this for decades now, using a combination of Lidar and GPS. GPS on the other hand is a self-contained where-am-i box. A different purpose. And so universal an application that’s it’s cost has become disappearingly small. Like in your cell phone. Now there was a parallel technology here. So we can have some notion of how Lidar will advance. Because it’s the same exact idea, but microwaves instead of light beams. Before GPS, before Loran, there was Doppler Navigation. This was installed on the original Hercules military aircraft, because of their world wide mission. Like Lidar it sent out a beam and processed the return signal. The return gave distance (speed of light and time of transit - 12.6 microseconds per mile). And as you learned in first year calculus, distance differentiated is velocity, and velocity integrated is distance. So the Doppler Nav system would figure out your groundspeed and direction and enable navigation at a time when the world did not have universal systems like GPS. It was costly, unreliable, complex and few were installed in non-military aircraft. GPS is also highly mathematical, but it’s design is inherently more useful because of it’s great precision. And its precision is because of its simplicity. What each of the 2 dozen or so satellites transmit is the number of seconds since 1 January 1980 - time zero. Tick tock tick tock. The satellites have ultra stable ultra accurate atomic clocks, with corrections for Einstein’s rules of space time. Then the processor in your GPS set has the equations for the satellite orbits, and the ephemeris tables to determine precisely where the satellites are at a certain instant. They just solve the equation of where you are in spherical trig. Voila! Now that’s a bloody wonderful system. And the amazing generosity of the USA in giving it free to the world, is even more wonderful. There’s another problem with Lidar - it’s on the ITAR list. ITAR is International Traffic in Arms Regulations. It’s how governments control arms from getting into the wrong hands. So this adds a very cumbersome layer of bureaucracy for those who want to use them. ",
            "date": "Answered August 5, 2016",
            "views": "757",
            "upvotes": " View 5 Upvoters",
            "upvoters": [
                {
                    "user_id": "Majid 'Mach' Hashemi",
                    "user_href": "/profile/Majid-Mach-Hashemi"
                },
                {
                    "user_id": "Sam Beera",
                    "user_href": "/profile/Sam-Beera"
                },
                {
                    "user_id": "Bruce Watson",
                    "user_href": "/profile/Bruce-Watson-8"
                },
                {
                    "user_id": "Miles Gordon",
                    "user_href": "/profile/Miles-Gordon-3"
                },
                {
                    "user_id": "Ferenc Valenta",
                    "user_href": "/profile/Ferenc-Valenta"
                }
            ]
        },
        {
            "author_info": {
                "name": "Kate Cheng",
                "href": "/profile/Kate-Cheng-7"
            },
            "answer_text": "I wouldn’t say that LiDAR is the “new GPS”, but advances in GPS and bandwidth has allowed for new LiDAR applications such as mobile LiDAR - which is used for mapping, engineering, and self-driving applications. The big bottleneck that we currently have in the LiDAR industry is in the process of analyzing the billions of LiDAR points that make up the “point cloud”. Though point clouds have high density and are very accurate, their size makes it difficult to extract the information that you want. For instance, if you are using LiDAR data to map an area, the software modules currently available to create the “vectors” or “lines” on the map are limited and not very accurate. We hear alot about AI and automation and how it will shape the landscape of the future. In the LIDAR world, huge advancements will come and spur new applications when we are easily able to automate the analysis of data. Here’s an analogy - Google Search looks through a very large database to find results that match your “query” every time you perform a search. In this case, LiDAR is the database and any spatially-related question would be the “query”. Though we didn’t know at the time, the ability to “search” something in google instantly has changed the way that we interact with the world. I do think that the automation of LiDAR and imagery analysis will have some of the same effects on society. An example would be the identification of, say, any asset in a city. A city that has a GIS system spends a huge amount of money to add, update, and verify information in their system. Once automation is good enough, from LiDAR data, we should be able to automatically extract every hydrant, pole, bench, fence, or whatever other assets are under inspection. If our processing capacity is adequate, we would be able to make these verifications and comparisons on an ongoing basis and dispatch crews to deal with issues automatically, which could be the foundations of the “smart city” of the future. ",
            "date": "Answered October 31, 2016",
            "views": "533",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Sébastien Pauleau",
                    "user_href": "/profile/Sébastien-Pauleau"
                },
                {
                    "user_id": "Anand C Ramanathan",
                    "user_href": "/profile/Anand-C-Ramanathan"
                }
            ]
        }
    ]
}