{
    "title": "A friend has a combination VHS player and DVD recorder. Can he convert any VHS tape to a DVD? - Quora",
    "tags": [
        "VHS Tape",
        "Videocassette Recorders (VCRs)",
        "Tapes",
        "Videotapes",
        "VHS",
        "DVD Ripping",
        "DVD Players",
        "Compact Discs (CDs)",
        "DVD"
    ],
    "response": [
        {
            "author_info": {
                "name": "Joseph Rogers",
                "href": "/profile/Joseph-Rogers-19"
            },
            "answer_text": "We had one of those years ago, the answer for ours was a qualified yes. A couple of issues to keep in mind: It will take the runtime of the film to copy, so be prepared for a big time investment if copying a large collection.Both DVD and VHS have quality shortcomings, and they don't play very nicely together. VHS recordings tend to be a bit noisy and fuzzy, and DVD compression algorithms don't cope with that ever so well, you tend to end up with a blocky rendition of a noisy, fuzzy image which feels like the worst of both worlds.So based on my experience (ymmv of course) I would not bother if there's a cheap option of a proper digital copy. Where this process does become useful is recordings for which there is no option of a proper digital copy, for example home video or event recordings which don't exist in any other format. In these cases it gives a chance to save something of those recordings before they are lost forever to format obsolescence and the ravages of time. ",
            "date": "Answered June 13, 2019",
            "views": "1",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Michael Toelle",
                    "user_href": "/profile/Michael-Toelle"
                },
                {
                    "user_id": "Van Lovell",
                    "user_href": "/profile/Van-Lovell"
                }
            ]
        },
        {
            "author_info": {
                "name": "Olivia Clark",
                "href": "/profile/Olivia-Clark-57"
            },
            "answer_text": "From a technology stand point, probably if he rigged the machine. From a legal stand point NO!!!! ",
            "date": "Answered June 14, 2019",
            "views": "54",
            "upvotes": " Answer requested by Van Lovell"
        },
        {
            "author_info": {
                "name": "Alexander Lehmann",
                "href": "/profile/Alexander-Lehmann"
            },
            "answer_text": "There may be some limitation for copy protected VHS tapes (Macrovision), other than that, the quality will depend on the age or wear of the tape but it should work in general. ",
            "date": "Answered June 14, 2019",
            "views": "29",
            "upvotes": "0"
        }
    ]
}