{
    "title": "A technology to provide high speed internet access over telephone wiring? - Quora",
    "tags": [
        "High Speed Internet",
        "Wiring",
        "Internet Access",
        "Internet Speed",
        "Telephones",
        "Internet Service Providers",
        "Telecommunications",
        "Wi-Fi",
        "The Internet"
    ],
    "response": [
        {
            "author_info": {
                "name": "RC Lau",
                "href": "/profile/RC-Lau"
            },
            "answer_text": "Only dial-up modem technology can be used to provide internet access over existing telephone / landline service at ‘no additional charge’. It’s drawback is that you can’t use he phone while utilizing the internet modem. Other internet access over telephone wiring are explained by Dennis E (below): ISDN and ADSL. Either still requires you to go to your local exchange provider (landline telephone provider) to have this service added onto your phone service. It will require additional hardware and software. You mentioned ‘high speed’ internet access - so I guess that leaves only ADSL and it does come in a variety of bandwidth speeds greater than 1.5Mbps and is not limited to 24Mbps. Another alternative is to go to your cable provider or satellite provider for voice/internet/TV services. Pricing varies greatly depending where you are and what services and speeds. ",
            "date": "Answered August 17, 2019",
            "views": "200",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Bin Adam Bey",
                "href": "/profile/Bin-Adam-Bey"
            },
            "answer_text": "According to my experience, the technology behind the high-speedy data transfer in case of telephone wiring is the use of optical fiber. Optical fiber uses the technology of total internal reflection to transfer the data as I am using Centurylink Phone Services and they are using fiber for the internet. ",
            "date": "Answered July 11, 2020",
            "views": "24",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Dennis Eichenlaub",
                "href": "/profile/Dennis-Eichenlaub"
            },
            "answer_text": "The three technologies commonly used for internet over telephone wiring are: Dial-up modem - 19.2 Kbps ISDN - 128 Kbps ADSL - 24 Mbps ADSL speed is strongly dependent on the distance to the telephone equipment building. ",
            "date": "Answered August 16, 2019",
            "views": "20",
            "upvotes": "0"
        }
    ]
}