{
    "title": "Approximately what percent of the cost of a Tesla is tied to the battery? - Quora",
    "tags": [
        "Car Batteries",
        "Battery Electric Vehicles (BEV)",
        "Electric Vehicles",
        "Tesla (company)",
        "Batteries",
        "Costs"
    ],
    "response": [
        {
            "author_info": {
                "name": "Duncan Cairncross",
                "href": "/profile/Duncan-Cairncross"
            },
            "answer_text": "Approximately what percent of the cost of a Tesla is tied to the battery? Lets run some numbers Model 3 - selling at $35,000 Tesla are making about 20% - so the “Cost” is $28,000 Battery cost - last year Tesla said $100/kwh - but that was for the cells - So Model 3 has a 54 kwh battery - call it $6,000 So the battery is 21% of the “Cost” of the car The “raw material cost” of the battery is about $20/kwh - so the rock bottom cost of the battery in a Tesla is about $1200 But it will take a few years to get that low ",
            "date": "Answered March 7, 2020",
            "views": "49",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Arnis Tarassu",
                    "user_href": "/profile/Arnis-Tarassu"
                },
                {
                    "user_id": "Richard Petek",
                    "user_href": "/profile/Richard-Petek"
                }
            ]
        },
        {
            "author_info": {
                "name": "Charlie Richmond",
                "href": "/profile/Charlie-Richmond-5"
            },
            "answer_text": "A2A Question: Approximately what percent of the cost of a Tesla is tied to the battery? Answer: It is a high proportion but dropping all the time as battery costs and technology develops and the raw materials become more readily available. Recently Tesla announced that they are close to developing lithium batteries that are not dependent on cobalt. Lithium is extremely plentiful and getting cheaper but cobalt is extremely expensive, rare and controversial because of the techniques used in the third world mines, so this is a good thing. Also, recycling batteries is easy and commonly done because the materials are easy to extract from old batteries and reuse without the major processing costs inherent with raw materials. ",
            "date": "Answered March 7, 2020",
            "views": "69",
            "upvotes": " Answer requested by Gem Baysan",
            "upvoters": [
                {
                    "user_id": "Juan Diego Celemín Mojica",
                    "user_href": "/profile/Juan-Diego-Celemín-Mojica"
                },
                {
                    "user_id": "Simon Khoury",
                    "user_href": "/profile/Simon-Khoury-1"
                },
                {
                    "user_id": "Corey Hawke",
                    "user_href": "/profile/Corey-Hawke"
                },
                {
                    "user_id": "Jim Murphy",
                    "user_href": "/profile/Jim-Murphy-49"
                }
            ]
        },
        {
            "author_info": {
                "name": "Trausti Thor Johannsson",
                "href": "/profile/Trausti-Thor-Johannsson"
            },
            "answer_text": "People forget that the design of something, testing, production and hundreds of trials and decisions cost millions of dollars. A Tesla is not worth its part alone. The company needs to recoup the early investment. My computer teacher once said, the first computer on the conveyor belt costs millions, the next one only costs $350. A new battery, in the 100 kWh car costs about $10,000 if you need to pay for it out of pocket. This number is without any guarantee. The price is expected to come down quite sharply over the next years. Less than 2 cars out of 10,000 need battery replacement. Often this is right away and the battery is replaced under warranty because it is simpler than trying to fix it. You see, you can swap a battery in 5 minutes, unlike swapping a transmission or engine in a normal car. The battery is then fixed or refurbished and used for spare parts or resold or reused depending. Often they are used in storage devices like the Tesla powerwall. So, in short, in the large cars, it is $5000 I would expect, and something similar in model 3. But that would be pure cost of materials. ",
            "date": "Answered March 7, 2020",
            "views": "141",
            "upvotes": " View 4 Upvoters "
        },
        {
            "author_info": {
                "name": "Yms Bushan",
                "href": "/profile/Yms-Bushan"
            },
            "answer_text": "Since the car price varies depending on the components in each car, either Model 3, Model S, model X, cost of Battery would vary in % from the total cost. Also depends on the size of battery depending on whether it is 60, 70, 75, 85, 90, 100 kWh battery. More accurate question would be “What is the price for one kWh battery now” or how the prices have come down during last few years. Here is the answer in dollars.  Probably within a year or two, the price can come down to $100 per kWh, when the prices of EV’s could be similar to ICE cars. In other words, when the price of EV is same as ICE car, would you buy a gas car? That is why all auto companies are scrambling to take on Tesla. They have ben sleeping for 10 years and suddenly waking up with the success of Tesla. There are only 5 major manufacturers of Giga factories. How many global Giga factories are there right now, I don't know. LG Chem, CATL, BYD, Panasonic, Samsung SDI are the main companies producing car batteries and now Tesla is using Panasonic and CATL, FOR their Giga factories, till they develop their own batteries. Tesla is announcing more on their batteries in April on BATTERY DAY. By 2030, EV production may need about 200 Gaga factories to keep up the needed production of EV’s Hope this answers your question. ",
            "date": "Answered March 7, 2020",
            "views": "187",
            "upvotes": " Answer requested by Gem Baysan"
        },
        {
            "author_info": {
                "name": "Jason Catterall",
                "href": "/profile/Jason-Catterall"
            },
            "answer_text": "Allegedly, Tesla are somewhere below $125 per kWh at the pack level. So a 100kWh battery costs Tesla $12,500 to create. On a Model S Performance (which has a 100kWh battery, the $12,500 cost of the battery represents approximately 13.2% of the base purchase price of $94,490. You can work out the relative percentage costs for the X, 3 and Y by using the above against their respective base prices. Note that this is the cost of the battery, not what you might have to pay for a replacement. ",
            "date": "Answered April 26, 2020",
            "views": "198",
            "upvotes": " Answer requested by Gem Baysan"
        },
        {
            "author_info": {
                "name": "Lawrence Vest",
                "href": "/profile/Lawrence-Vest"
            },
            "answer_text": "Battery replacement in a Model S would set you back any where from $3 to $5k. Since Tesla’s cost would be some what less, the battery would account for roughly 5% of the vehicle’s MSRP. ",
            "date": "Answered April 27, 2020",
            "views": "39",
            "upvotes": " Answer requested by Gem Baysan"
        },
        {
            "author_info": {
                "name": "Skip .Vedell",
                "href": "/profile/Skip-Vedell"
            },
            "answer_text": "$5000 to $7000 is the cost of a battery ",
            "date": "Answered April 27, 2020",
            "views": "16",
            "upvotes": " Answer requested by Gem Baysan"
        }
    ]
}