{
    "title": "Are there any projects to build cities under the oceans? - Quora",
    "tags": [
        "Oceanography",
        "Projects",
        "Construction"
    ],
    "response": [
        {
            "author_info": {
                "name": "Joseph O'Sullivan",
                "href": "/profile/Joseph-OSullivan-16"
            },
            "answer_text": "No, there are not. There was some efforts to live underwater, but these failed and dampened the enthusiasm for the idea. Back in the 1960’s and 1970’s as the technology that allowed people to live underwater started to develop, people started to explore the possibility of living on the ocean floor. At first scientists looked at the possibility of staying underwater for days or weeks to do research. Jacques Cousteau popularized this, and his shows put this idea in the public mind. This was happening at the same time as the Apollo moon program, and this same spirit of exploration was turned to the oceans. The Sealab program was started to explore the possibility of people living on the ocean floor. However after some poor planning and implementation, a tragic accident occurred and it was canceled. PBS has a documentary about this. Sealab | American Experience | PBS ",
            "date": "Answered May 3, 2019",
            "views": "141",
            "upvotes": " Answer requested by Frank Domenico Cipriani",
            "upvoters": [
                {
                    "user_id": "Klaas Verduin",
                    "user_href": "/profile/Klaas-Verduin"
                }
            ]
        },
        {
            "author_info": {
                "name": "William Jines",
                "href": "/profile/William-Jines"
            },
            "answer_text": "Building a city in the ocean might seem like an interesting idea, but below the surface, there are too many limitations. Most importantly, there is plenty of space 0n land, so there is no reason to spend vastly greater amount of money to build structures in or over water. The potential for disaster is extremely high. One accident or unexpected disaster e.g. earthquake, could cause a complete annihilation of an entire colony. The answer is simply NO! there are not. There were some efforts to live underwater, but these failed and dampened the enthusiasm for the idea. Back in the 1960's and 1970's as the technology that allowed people to live underwater started to develop, people started to explore the possibility of living on the ocean floor. Even the entire continent of Antarctica, the moon, and even Mars may be safer to colonize than earth’s continental shelves. As to the true ocean bottom, the overwhelming pressure and darkness are huge problems. ",
            "date": "Answered February 13, 2020",
            "views": "76",
            "upvotes": " View 1 Upvoter"
        },
        {
            "author_info": {
                "name": "Alan Horoschak",
                "href": "/profile/Alan-Horoschak"
            },
            "answer_text": "We know more about outer space than the deep ocean. For a perspective, Arthur Clarke wrote a book in the ‘50’s. The Deep Range - Wikipedia ",
            "date": "Answered May 3, 2019",
            "views": "31",
            "upvotes": " Answer requested by Frank Domenico Cipriani"
        }
    ]
}