{
    "title": "Are Huawei smart phones good or bad? - Quora",
    "tags": [
        "Product Reviews",
        "Huawei (company)"
    ],
    "response": [
        {
            "author_info": {
                "name": "John Smith",
                "href": "/profile/John-Smith-29577"
            },
            "answer_text": "As every knows, no good cheap goods. And one reason of so-called good quality and low price is at the expense of the health of the buyer. For example, the power of its radio is harmfully amazing high on some key stage. I use HUAWEI phone before, but after an accidental discovery, decide never use any phone with base-band and radio made in China any more. Let me tell you the whole story. Coincidentally, I accidentally left my HUAWEI Honor-8 phone on the HDMI cable, and coincidentally a call came in after a while. From a few seconds before the bell rings, my monitor start to show blurred and black screen, the image constantly changing and horrible shaking until I pick up and answer the phone. So I hurry to try more experiments to find out the routine. I tried several times on HUAWEI phones, the problem remains. As a contrast, test iphone6s instead in the very same situation. The screen is completely free of even a little bit of anomalies. At last, I search out several reports said the HUAWEI’s phone has absolutely highest radio power than others’, higher than other Chinese phone like OPPO and VIVO which is based on Qualcomm platform. And please note, these official tests are only implemented in the standby status of phone. There are many reports and friends around me said that feel discomfort like eyes and brains after long use of HUAWEI. Because there is no other cell phone at hand, please join me helping to collect more evidences, such as using Samsung or Qualcomm platforms, to supplement this special experiment. ",
            "date": "Answered January 18, 2019",
            "views": "196",
            "upvotes": " View 20 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Wong Kyle",
                    "user_href": "/profile/Wong-Kyle-3"
                },
                {
                    "user_id": "Jeff Park",
                    "user_href": "/profile/Jeff-Park-58"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/MJ-870"
                },
                {
                    "user_id": "Anmol Ghai",
                    "user_href": "/profile/Anmol-Ghai-14"
                },
                {
                    "user_id": "Sudhanshu Gupta",
                    "user_href": "/profile/Sudhanshu-Gupta-50"
                },
                {
                    "user_id": "Subha Sikdar",
                    "user_href": "/profile/Subha-Sikdar-1"
                },
                {
                    "user_id": "Abhinav Kumar",
                    "user_href": "/profile/Abhinav-Kumar-505"
                },
                {
                    "user_id": "Josh Smith",
                    "user_href": "/profile/Josh-Smith-2227"
                },
                {
                    "user_id": "Sonia Otiono",
                    "user_href": "/profile/Sonia-Otiono"
                },
                {
                    "user_id": "Kamila Koziarska",
                    "user_href": "/profile/Kamila-Koziarska"
                },
                {
                    "user_id": "Tomás Wilkinson",
                    "user_href": "/profile/Tomás-Wilkinson"
                },
                {
                    "user_id": "Li Xiao",
                    "user_href": "/profile/Li-Xiao-140"
                },
                {
                    "user_id": "Sunil Kumar",
                    "user_href": "/profile/Sunil-Kumar-1745"
                },
                {
                    "user_id": "Robert Dziubek",
                    "user_href": "/profile/Robert-Dziubek-1"
                },
                {
                    "user_id": "Yash Chandak",
                    "user_href": "/profile/Yash-Chandak-18"
                },
                {
                    "user_id": "Suling Qing",
                    "user_href": "/profile/Suling-Qing"
                },
                {
                    "user_id": "Dhul Qarnayn",
                    "user_href": "/profile/Dhul-Qarnayn-5"
                },
                {
                    "user_id": "Nicolaas Manoppo",
                    "user_href": "/profile/Nicolaas-Manoppo"
                },
                {
                    "user_id": "Posf Ifs",
                    "user_href": "/profile/Posf-Ifs"
                },
                {
                    "user_id": "Adalyn Kayne",
                    "user_href": "/profile/Adalyn-Kayne"
                }
            ]
        },
        {
            "author_info": {
                "name": "Abinash Ray",
                "href": "/profile/Abinash-Ray-10"
            },
            "answer_text": "It completely depends on which category you choose from. If Flagships then sure Mate 20 Pro is definitely a good phone It may not have the best camera but certainly even the critics would agree that you won't regret having that in your pocket Kirin 980 is pretty capable but is bogged down by EMUI but the thing is no matter how hard consumers try, OEMs will stick to their own UI so that's something you'll have to make peace with. Performance shouldn't be an issue unless you start comparing it with an iPhone XS side by side. Apple makes the best chips as of now. Deal with it. Battery life is superb according to most unbiased reviews. And charging speeds are impressive. Audio output from speaker is not that great but I'm sure Huawei will have known this by now. Also the nano memory card is not user friendly as of now and the reverse wireless charging is more or less a gimmick. However once you go to the budget segment, things get much more interesting. I personally use the Honor Play which is made by Honor, a sub brand of Huawei. It is a mid-range phone with a flagship chipset, if that makes any sense. It has the Kirin 970 which was the flagship chipset of Huawei until the Mate 20 Pro. Performance is similar to a OnePlus 5T if not OnePlus 6 (due to a generational update). I haven't noticed any lags and it's been 4 months so I guess it has held up till now. Battery life is good but not the best. You may need to top it off on a very very heavy usage day. Charging speed is good with the Quick Charging. Cameras are average as this was more or less a 'Gaming Phone' according to Honor. But my needs are usually satisfied with this camera and the front facing camera is decent. The point is that here priorities matter. I don't need a great camera but I need a good camera and this phone does that. Consider the Huawei Nova 3 if you need a better camera. Once you move to the super low segment, you get the Kirin 710 or Kirin 659 and budget specs which are fine considering the competition it has. The Honor 8X and other Huawei/Honor phones in that category are certainly better than the Motorola/Oppo/Vivo phones but Xiaomi is kinda better in the performance (won't notice it) and camera is bad if compared to the Xiaomi alternative. But the point is that however bad EMUI is, the phone won't be bogged down by the software because unlike MIUI, it uses Google stock applications in many cases. Also EMUI is lighter on budget devices. So to sum it up, yes Huawei Flagship phones are actually pretty good but once compared side by side to other Samsung or Apple alternatives, they tend to lose some ground. Even OnePlus provides better performance (except Camera). Mid-range Flagships are now the thing( Thanks Poco F1) and I'm pretty sure in 2019 that Huawei will focus more. Honor Play was fabulous but got overshadowed by Poco F1 ( No surprise there). Budget category has jack of all trades but master of none phones and it completely depends on preferences there. But it is ridiculous to dismiss these phones as bad. They are certainly good if you know what you are getting yourself into. ",
            "date": "Answered December 29, 2018",
            "views": "63",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Namrata Patne",
                    "user_href": "/profile/Namrata-Patne-1"
                },
                {
                    "user_id": "DR RAJESH KHAKHARIA",
                    "user_href": "/profile/DR-RAJESH-KHAKHARIA-1"
                },
                {
                    "user_id": "Jun Dong",
                    "user_href": "/profile/Jun-Dong-15"
                }
            ]
        },
        {
            "author_info": {
                "name": "N Kr",
                "href": "/profile/N-Kr"
            },
            "answer_text": "Huawei smart phones are better made than most Chinese phones. They do have much more of a customer focus than their competition in China, Taiwan and Korea. The Honor line is  one of the best deals that I have seen for value-priced phones. The high-end phones are also well made with a focus on durability. For example, most of the models is very highly water-resistant.  Their software/interface features are pretty decent and are comparable to the Samsung phones. In fact, for most features I just get most of what I want from the Google play store. Obviously, some features are hardware based but I don't find Huawei lacking on that front - at least for my needs. When selecting a 4g phone, I would recommend that you check if the bands are supported by your carriers. If interested, see my comments on how to do so in another article. Realize this about most phones - the reliability of the phone is based largely on the components. The reliability of the components are determined by the vendor providing it. The difference between a good phone and bad phone is how quickly the company responds to any issue on the manufacturing side as well on the service side. Huawei has been very good about this so far.  I would certainly consider Huawei phones when buying a mobile phone. ",
            "date": "Answered January 10, 2016",
            "views": "272",
            "upvotes": " View 12 Upvoters",
            "upvoters": [
                {
                    "user_id": "Jeri Mis",
                    "user_href": "/profile/Jeri-Mis"
                },
                {
                    "user_id": "Lu Liu",
                    "user_href": "/profile/Lu-Liu-202"
                },
                {
                    "user_id": "Kuheli Sengupta",
                    "user_href": "/profile/Kuheli-Sengupta-6"
                },
                {
                    "user_id": "Tarek Ragheb",
                    "user_href": "/profile/Tarek-Ragheb"
                },
                {
                    "user_id": "Cheryl Feldman",
                    "user_href": "/profile/Cheryl-Feldman-2"
                },
                {
                    "user_id": "Robert Peddle",
                    "user_href": "/profile/Robert-Peddle-3"
                },
                {
                    "user_id": "Mahendra Tengalkar",
                    "user_href": "/profile/Mahendra-Tengalkar"
                },
                {
                    "user_id": "Abhi Abhi",
                    "user_href": "/profile/Abhi-Abhi-292"
                },
                {
                    "user_id": "Sidharth.S. Panda",
                    "user_href": "/profile/Sidharth-S-Panda"
                },
                {
                    "user_id": "Joseph Annatu",
                    "user_href": "/profile/Joseph-Annatu"
                },
                {
                    "user_id": "Giulio Moro",
                    "user_href": "/profile/Giulio-Moro"
                },
                {
                    "user_id": "ChenGodric",
                    "user_href": "/profile/ChenGodric"
                }
            ]
        },
        {
            "author_info": {
                "name": "John Smith",
                "href": "/profile/John-Smith-28728"
            },
            "answer_text": "well, some Huawei smartphones are better than others, but the quality reflects the price point in most places. I had a Huawei 'Y' series lower end Huawei Y550, and although it was quite good, there were many slight problems and glitches, and Huawei cut corners with the strength of the glass covering the phone. However, the higher end Mate series and P series are excellent, and very well designed, and so are the Huawei nexus devices, which I would recommend. So, overall I think Huawei phones are quite good, especially the ones over the $200 price point, as they are designed beautifully and preform like true high end devices despite their price point. In the past few years, I think Huawei has really broken into the U.S market, especially with the nexus 6P, made by Huawei, which was an instant success. Huawei's new P9, which has a camera made by Leica, has already been met with interest, and the company is really showing that it can make high quality devices. Hope this helps! ",
            "date": "Updated January 20, 2019",
            "views": "749",
            "upvotes": " View 42 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Jiang Yuanyuan",
                    "user_href": "/profile/Jiang-Yuanyuan-1"
                },
                {
                    "user_id": "Doug Fergusson",
                    "user_href": "/profile/Doug-Fergusson-1"
                },
                {
                    "user_id": "CK Hu",
                    "user_href": "/profile/CK-Hu-1"
                },
                {
                    "user_id": "Han Zibo",
                    "user_href": "/profile/Han-Zibo-1"
                },
                {
                    "user_id": "Lisa Gardiner",
                    "user_href": "/profile/Lisa-Gardiner-25"
                },
                {
                    "user_id": "Sparky Web",
                    "user_href": "/profile/Sparky-Web"
                },
                {
                    "user_id": "Jerin Benny Palathingal",
                    "user_href": "/profile/Jerin-Benny-Palathingal"
                },
                {
                    "user_id": "Gregg Thomas",
                    "user_href": "/profile/Gregg-Thomas-1"
                },
                {
                    "user_id": "Kawaii Zakirawr",
                    "user_href": "/profile/Kawaii-Zakirawr"
                },
                {
                    "user_id": "Mohapi Tau",
                    "user_href": "/profile/Mohapi-Tau"
                },
                {
                    "user_id": "Jovilyn L. Pulumbarit",
                    "user_href": "/profile/Jovilyn-L-Pulumbarit"
                },
                {
                    "user_id": "Keith Rose",
                    "user_href": "/profile/Keith-Rose-37"
                },
                {
                    "user_id": "Mahendra Tengalkar",
                    "user_href": "/profile/Mahendra-Tengalkar"
                },
                {
                    "user_id": "Ethan Parker",
                    "user_href": "/profile/Ethan-Parker-63"
                },
                {
                    "user_id": "Anushka Mishra",
                    "user_href": "/profile/Anushka-Mishra-123"
                },
                {
                    "user_id": "Binoy Subhash Vallabhassery",
                    "user_href": "/profile/Binoy-Subhash-Vallabhassery"
                },
                {
                    "user_id": "Satya Samal",
                    "user_href": "/profile/Satya-Samal-4"
                },
                {
                    "user_id": "Yifan Wu",
                    "user_href": "/profile/Yifan-Wu-69"
                },
                {
                    "user_id": "Game Busters",
                    "user_href": "/profile/Game-Busters"
                },
                {
                    "user_id": "Dora Padjen",
                    "user_href": "/profile/Dora-Padjen"
                },
                {
                    "user_id": "Muhammad Taimur",
                    "user_href": "/profile/Muhammad-Taimur-9"
                },
                {
                    "user_id": "Pradeep R",
                    "user_href": "/profile/Pradeep-R-2"
                },
                {
                    "user_id": "Shubhankar Bag",
                    "user_href": "/profile/Shubhankar-Bag-1"
                },
                {
                    "user_id": "Lawrence Wong",
                    "user_href": "/profile/Lawrence-Wong"
                },
                {
                    "user_id": "Baneo Bane",
                    "user_href": "/profile/Baneo-Bane"
                },
                {
                    "user_id": "Su Haoran",
                    "user_href": "/profile/Su-Haoran-1"
                },
                {
                    "user_id": "Joseph Annatu",
                    "user_href": "/profile/Joseph-Annatu"
                },
                {
                    "user_id": "Nuno Pereira",
                    "user_href": "/profile/Nuno-Pereira-29"
                },
                {
                    "user_id": "Daniel Tien",
                    "user_href": "/profile/Daniel-Tien-5"
                },
                {
                    "user_id": "Harvey Wang",
                    "user_href": "/profile/Harvey-Wang-14"
                },
                {
                    "user_id": "Feng Xingyu",
                    "user_href": "/profile/Feng-Xingyu"
                },
                {
                    "user_id": "Angry Buffalo RO",
                    "user_href": "/profile/Angry-Buffalo-RO"
                },
                {
                    "user_id": "Giulio Moro",
                    "user_href": "/profile/Giulio-Moro"
                },
                {
                    "user_id": "J K",
                    "user_href": "/profile/J-K-68"
                },
                {
                    "user_id": "NB",
                    "user_href": "/profile/NB-46"
                },
                {
                    "user_id": "BSN",
                    "user_href": "/profile/BSN-2"
                },
                {
                    "user_id": "Meri Namatovu Nyanzi",
                    "user_href": "/profile/Meri-Namatovu-Nyanzi"
                },
                {
                    "user_id": "Jfone Wang",
                    "user_href": "/profile/Jfone-Wang-1"
                },
                {
                    "user_id": "Akira Ming",
                    "user_href": "/profile/Akira-Ming-1"
                },
                {
                    "user_id": "Abhimanyu Gowda",
                    "user_href": "/profile/Abhimanyu-Gowda-3"
                },
                {
                    "user_id": "Luo Connie",
                    "user_href": "/profile/Luo-Connie"
                },
                {
                    "user_id": "Carl Hsia",
                    "user_href": "/profile/Carl-Hsia"
                }
            ]
        },
        {
            "author_info": {
                "name": "Gabriel Sanchez",
                "href": "/profile/Gabriel-Sanchez-81"
            },
            "answer_text": "I have been a Huawei phone user for one low end and one high end phones, first the low end: Meet Rio-L03 (aka: g8 or gx8) when I did have this phone it was not enough because the internal memory was only 2 GB. The storage was limited too but the phone had a micro SD so it was easy to expand, the camera was ok, the screen was good and crisp, the fingerprint reader was superb, the only bad thing about that phone was the memory. The phone was sometimes unresponsive and lagged too much because of the low memory available. I don't really think the phone is bad but it's not for high end users which need to have open many apps all the time, I passed this phone to my daughter and then to my mom and both liked the phone very much. Next the high-end which I currently use: the Huawei Mate 10. I can't tell anything bad about this phone, it performance is so good, the dual camera, the fingerprint reader, the screen, just about anything about this phone is a winner, and the Android Oreo OS feels so well in this phone that I want to get my hands on other Huawei devices next, but Huawei P20 does not seems like and upgrade from a mate 10 so I will wait some time before I change phone again. ",
            "date": "Answered June 16, 2018",
            "views": "21",
            "upvotes": " View 13 Upvoters",
            "upvoters": [
                {
                    "user_id": "Jefri Zayin",
                    "user_href": "/profile/Jefri-Zayin"
                },
                {
                    "user_id": "Roxana Farcas",
                    "user_href": "/profile/Roxana-Farcas"
                },
                {
                    "user_id": "CK Hu",
                    "user_href": "/profile/CK-Hu-1"
                },
                {
                    "user_id": "Aman Deep",
                    "user_href": "/profile/Aman-Deep-1879"
                },
                {
                    "user_id": "Hugh Clinton",
                    "user_href": "/profile/Hugh-Clinton-3"
                },
                {
                    "user_id": "Mohapi Tau",
                    "user_href": "/profile/Mohapi-Tau"
                },
                {
                    "user_id": "David Zip",
                    "user_href": "/profile/David-Zip"
                },
                {
                    "user_id": "John Kabucho",
                    "user_href": "/profile/John-Kabucho"
                },
                {
                    "user_id": "Vijay Vellala",
                    "user_href": "/profile/Vijay-Vellala-1"
                },
                {
                    "user_id": "Arjun Sean",
                    "user_href": "/profile/Arjun-Sean"
                },
                {
                    "user_id": "OLufemi OGundare",
                    "user_href": "/profile/OLufemi-OGundare"
                },
                {
                    "user_id": "Mahendra Tengalkar",
                    "user_href": "/profile/Mahendra-Tengalkar"
                },
                {
                    "user_id": "Irmantas Vaitkus",
                    "user_href": "/profile/Irmantas-Vaitkus"
                }
            ]
        },
        {
            "author_info": {
                "name": "Yee Chiang",
                "href": "/profile/Yee-Chiang"
            },
            "answer_text": "I'm now using a Huawei Mate 7 which was released like 2 years ago.Huawei is definitely leaping on their mobile phone qualities. With Mate 7 I have back panel fingerprint unlock, a battery of 4100mAH, a nice UI, a 6 inch screen, and dual SIM. It has been stable and the features I just mentioned were especially impressive and meaningful for myself.Also it is import to note that unlike other mobile phone vendors in China, Huawei do have their own mobile communication processors and they do apply them to their own mobile phone products.Their newest model per what I know is P8, which could be even better but I never tried.In short, Huawei smart phones are quite good and at a reasonable price. ",
            "date": "Answered November 21, 2015",
            "views": "345",
            "upvotes": " View 20 Upvoters",
            "upvoters": [
                {
                    "user_id": "Martin Hancock",
                    "user_href": "/profile/Martin-Hancock-10"
                },
                {
                    "user_id": "Shahazudin Khan",
                    "user_href": "/profile/Shahazudin-Khan"
                },
                {
                    "user_id": "Horacio Ramirez",
                    "user_href": "/profile/Horacio-Ramirez-3"
                },
                {
                    "user_id": "Tim Chavez",
                    "user_href": "/profile/Tim-Chavez-1"
                },
                {
                    "user_id": "CK Hu",
                    "user_href": "/profile/CK-Hu-1"
                },
                {
                    "user_id": "Shannen Murphy Campbell",
                    "user_href": "/profile/Shannen-Murphy-Campbell"
                },
                {
                    "user_id": "Mahendra Tengalkar",
                    "user_href": "/profile/Mahendra-Tengalkar"
                },
                {
                    "user_id": "Christian Paul S. Pruna",
                    "user_href": "/profile/Christian-Paul-S-Pruna"
                },
                {
                    "user_id": "Lawrence Wong",
                    "user_href": "/profile/Lawrence-Wong"
                },
                {
                    "user_id": "Joseph Annatu",
                    "user_href": "/profile/Joseph-Annatu"
                },
                {
                    "user_id": "Daniel Tien",
                    "user_href": "/profile/Daniel-Tien-5"
                },
                {
                    "user_id": "John Nicholas",
                    "user_href": "/profile/John-Nicholas-6"
                },
                {
                    "user_id": "Minqiang Hu",
                    "user_href": "/profile/Minqiang-Hu"
                },
                {
                    "user_id": "Feng Xingyu",
                    "user_href": "/profile/Feng-Xingyu"
                },
                {
                    "user_id": "Giulio Moro",
                    "user_href": "/profile/Giulio-Moro"
                },
                {
                    "user_id": "Kevin Li",
                    "user_href": "/profile/Kevin-Li-151"
                },
                {
                    "user_id": "Kevin Gong",
                    "user_href": "/profile/Kevin-Gong-17"
                },
                {
                    "user_id": "雷雨后",
                    "user_href": "/profile/雷雨后"
                },
                {
                    "user_id": "Wei Jin",
                    "user_href": "/profile/Wei-Jin-31"
                },
                {
                    "user_id": "Sergio Buendia",
                    "user_href": "/profile/Sergio-Buendia"
                }
            ]
        },
        {
            "author_info": {
                "name": "Kamal Kant",
                "href": "/profile/Kamal-Kant-422"
            },
            "answer_text": "I am currently using honor 8 pro, a sub brand of huawei which i bought 2 yrs ago. Till date, no battery drop, no performance drop. Everything is buttery smooth. But the problem is fast evolution of designs and competition. And their high end devices like p20 pro mate 20 pro though meet every requirement as compared to samsung n apple in respect to camera n design specially. But personally HIGH PRICE bothers me very much. For ex samsung s9 n s9+ @ 48k rupees and 53k eupess respectively and huawei p20 pro @ 49k rupees. I mean who will spend on p20 pro when a good branded phone with awesome camera, sexy design, good processor is available at lower than this. Similarly s10@ 66,900 rupees and s10+ @ 73,900 rupees and mate 20 pro @ 64,900 rupees. Nobody will conside to opt mate 20 pro when well reputed brand since ages like SAMSUNG is at approximately same price offering good specs and design is available Similarly oneplus 6t @ 37,999 and honor view 20 at the same price.. Majority of people opt oneplus 6t on amazon as compared to honor view 20. Main problem is their high price acc to features. Huawei cameras still overexposes colors and miss details sometimes.plus their designs, n phone quality is still behind than samaung n apple, Plus, in country like india their service centres r very limited due to which customer never opt huawei flagships when other flagships service centres r well established. And also their software updates r lazy as compared to samsung and apple. ",
            "date": "Answered March 22, 2019",
            "views": "21",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Maksud Sumon",
                "href": "/profile/Maksud-Sumon"
            },
            "answer_text": "Huawei is the second biggest smartphone manufacturer in the world after Samsung, and it's got there by offering up some excellent devices along the way. It's grown in strength significantly over the past couple of years, to the point that if you're looking for the best Huawei phones around, there's a wide range to choose from. At the top of the range are the flagship Huawei P20 Pro and Huawei Mate 20 Pro, but our best Huawei phones list also includes great, affordable handsets such as the Huawei P Smart. That means when it comes to picking the best Huawei phone for you, it can be tricky. With that in mind we’ve highlighted the best Huawei phones the firm currently has to offer and ranked them. HUAWEI Honor 9i 9N 4GB RAM 64GB/128GB  5.84 inch HUAWEI Honor 9i 9N 4GB RAM 64GB/128GBAndroid 8.0 Octa Core Mobile Phone Kirin 659 2280x1080 FHD+ Fingerprint 16.0MP. ",
            "date": "Answered April 12, 2019",
            "views": "14",
            "upvotes": " View 13 Upvoters",
            "upvoters": [
                {
                    "user_id": "Sumon Khan",
                    "user_href": "/profile/Sumon-Khan-146"
                },
                {
                    "user_id": "Nelly Doretha",
                    "user_href": "/profile/Nelly-Doretha-15"
                },
                {
                    "user_id": "Abbie Faye",
                    "user_href": "/profile/Abbie-Faye"
                },
                {
                    "user_id": "Emma Olivia",
                    "user_href": "/profile/Emma-Olivia-2-1"
                },
                {
                    "user_id": "Addie Caroline",
                    "user_href": "/profile/Addie-Caroline"
                },
                {
                    "user_id": "George Helen",
                    "user_href": "/profile/George-Helen"
                },
                {
                    "user_id": "James Margaret",
                    "user_href": "/profile/James-Margaret-1"
                },
                {
                    "user_id": "Brittny Bryer",
                    "user_href": "/profile/Brittny-Bryer"
                },
                {
                    "user_id": "Tatyana Lindsay",
                    "user_href": "/profile/Tatyana-Lindsay"
                },
                {
                    "user_id": "Genevive Brandt",
                    "user_href": "/profile/Genevive-Brandt"
                },
                {
                    "user_id": "Maksudur Rahman",
                    "user_href": "/profile/Maksudur-Rahman-52"
                },
                {
                    "user_id": "Sumon Rahman",
                    "user_href": "/profile/Sumon-Rahman-43"
                },
                {
                    "user_id": "Muhammad Sumon",
                    "user_href": "/profile/Muhammad-Sumon-6"
                }
            ]
        },
        {
            "author_info": {
                "name": "Anthony Ad",
                "href": "/profile/Anthony-Ad"
            },
            "answer_text": "I strongly feel that Huawei is the most underrated tech brand when it comes to smartphones and devices in general. I’ve owned a couple of their smart phones and I believe they make solid devices that give the other top brands a run for their money. Their device ratings on Amazon speak for themselves. They are also one of the top recommended alternative phones to Samsung and Apple. I wrote a recent recommendation for their devices that might be worth checking out at Curated by tonysanwo.com. ",
            "date": "Answered August 16, 2018",
            "views": "104",
            "upvotes": " View 8 Upvoters",
            "upvoters": [
                {
                    "user_id": "Kuheli Sengupta",
                    "user_href": "/profile/Kuheli-Sengupta-6"
                },
                {
                    "user_id": "Gregg Thomas",
                    "user_href": "/profile/Gregg-Thomas-1"
                },
                {
                    "user_id": "Cheryl Feldman",
                    "user_href": "/profile/Cheryl-Feldman-2"
                },
                {
                    "user_id": "Avishai Benyamini",
                    "user_href": "/profile/Avishai-Benyamini"
                },
                {
                    "user_id": "Mahendra Tengalkar",
                    "user_href": "/profile/Mahendra-Tengalkar"
                },
                {
                    "user_id": "Martynas Alekna",
                    "user_href": "/profile/Martynas-Alekna"
                },
                {
                    "user_id": "Abhi Abhi",
                    "user_href": "/profile/Abhi-Abhi-292"
                },
                {
                    "user_id": "Rima Basu",
                    "user_href": "/profile/Rima-Basu-4"
                }
            ]
        },
        {
            "author_info": {
                "name": "Giulio Moro",
                "href": "/profile/Giulio-Moro"
            },
            "answer_text": "Many of their devices are excellent and provide great value, and some not so much. My favorite was and still is their Huawei D Quad XL U9510E. Aside from it having a smaller than preferred battery size, and being stuck with android 4.0.3 forever, it's still my favorite. Now their U8730, called the tmobile mytouch qwerty was supposed to be released with android 4, but was released with android 2.3, then abandoned by both, but Samsung and Motorola also did this many times as well. Now their Y300 and Y310, crap right from the beginning, unless your needs are next to nothing. On the other side of this same coin, their U2801, U2810, and U3210 are all basic phones that serve a specific market niche and consumer need. ",
            "date": "Answered March 26, 2018",
            "views": "142",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "CK Hu",
                    "user_href": "/profile/CK-Hu-1"
                },
                {
                    "user_id": "Paul Lian",
                    "user_href": "/profile/Paul-Lian-6"
                }
            ]
        },
        {
            "author_info": {
                "name": "Larry English",
                "href": "/profile/Larry-English-3"
            },
            "answer_text": "it would be better to read professional reviews, or Amazon reviews, than to just ask strangers who may be ignorant. Amazon reviews will be current, if you are looking for a current phone. i have a U9200, which is good enough, but like any smart phone, it is obsolete.  so my review does not mean much, you can't get one anyway. plus Huawei, like every company making anything, makes good stuff, and cheap stuff. wle. LeaLeaLeaLea ",
            "date": "Answered April 20, 2016",
            "views": "233",
            "upvotes": " View 5 Upvoters",
            "upvoters": [
                {
                    "user_id": "Natnael Samson",
                    "user_href": "/profile/Natnael-Samson-1"
                },
                {
                    "user_id": "Adalyn Kayne",
                    "user_href": "/profile/Adalyn-Kayne"
                },
                {
                    "user_id": "Leslee Kerketta",
                    "user_href": "/profile/Leslee-Kerketta"
                },
                {
                    "user_id": "Shannon Fiederer",
                    "user_href": "/profile/Shannon-Fiederer"
                },
                {
                    "user_id": "Rohit Pandey",
                    "user_href": "/profile/Rohit-Pandey-148"
                }
            ]
        },
        {
            "author_info": {
                "name": "18Respawns",
                "href": "/profile/18Respawns"
            },
            "answer_text": "Some of their phones are better than others, although their aftermarket and support is terrible, I've had an Ascend P6, which I would consider one of their popular phones, and that phone never got the Lollipop update, even though the phone could handle the update. Maybe they've changed now, it is worth a try, if you are looking into buying though, make sure you get one from their Honor series or Mate series.  ",
            "date": "Answered February 10, 2016",
            "views": "91",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Yalong LI",
                    "user_href": "/profile/Yalong-LI-4"
                },
                {
                    "user_id": "Mahendra Tengalkar",
                    "user_href": "/profile/Mahendra-Tengalkar"
                }
            ]
        },
        {
            "author_info": {
                "name": "Todd Denton",
                "href": "/profile/Todd-Denton-1"
            },
            "answer_text": "That is primarily a matter of personal preference. Just like many other smartphone OEMs, Huawei makes high end and low end phones. Their high end phone is every bit as high end as say, a galaxy or iPhone. The Huawei P10 is one of the best phones of this year and I would personally rank it in the top 5. Beware of the software UI though as it is a far cry from stock Android - even further than Samsung's TouchWiz/Grace/Samsung Experience. ",
            "date": "Updated October 26, 2017",
            "views": "267",
            "upvotes": " View 5 Upvoters",
            "upvoters": [
                {
                    "user_id": "Mahendra Tengalkar",
                    "user_href": "/profile/Mahendra-Tengalkar"
                },
                {
                    "user_id": "Abhinav Singh",
                    "user_href": "/profile/Abhinav-Singh-256"
                },
                {
                    "user_id": "Lawrence Wong",
                    "user_href": "/profile/Lawrence-Wong"
                },
                {
                    "user_id": "Kyle Huang",
                    "user_href": "/profile/Kyle-Huang-9"
                },
                {
                    "user_id": "Giulio Moro",
                    "user_href": "/profile/Giulio-Moro"
                }
            ]
        },
        {
            "author_info": {
                "name": "Billy Turner",
                "href": "/profile/Billy-Turner-39"
            },
            "answer_text": "Well the most recent one I have, the p10, is equal in most regards to others. However, it does have occasional failures and freezes. The calls I have also experienced as being terrible. The network is working fine but the calls will still cut out and not sound as they should ",
            "date": "Answered April 20, 2018",
            "views": "2",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "AB",
                "href": "/profile/AB-595"
            },
            "answer_text": "Huawei Mobile Phone are perfect when New but after a year usage they are simply useless ; I had a mate 9 and a mate 10; both were perfect when they were new however after quite sometime they start to show a lot of programming malfunction. I was a super Huawei fan however not anymore will never buy a Huawei phone again. ",
            "date": "Answered September 2, 2018",
            "views": "179",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Jeff Mathews",
                "href": "/profile/Jeff-Mathews-9"
            },
            "answer_text": "Huawei is making a quality of smart phones these days. They are using new technology in their smart phones.  Huawei has launched a new phone Mate 8 with a 6 inch screen, runs on a latest android 6.0, a long battery life, the camera quality is good, display quality has also been improved. In overall this device is value for money and is attracting many users. ",
            "date": "Answered January 15, 2016",
            "views": "21",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "SUNSHINE EQUIPMENT RENTALS",
                "href": "/profile/SUNSHINE-EQUIPMENT-RENTALS"
            },
            "answer_text": "Huawei brand only second to Apple in terms of reliability. Almost lot of can use without troubles surely more than 3 years, as our survey. Never any heating issues. The only drawback is lack of premium feeling of some models. ",
            "date": "Answered November 23, 2017",
            "views": "4",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Mahendra Tengalkar",
                    "user_href": "/profile/Mahendra-Tengalkar"
                },
                {
                    "user_id": "Christian Paul S. Pruna",
                    "user_href": "/profile/Christian-Paul-S-Pruna"
                }
            ]
        },
        {
            "author_info": {
                "name": "Thomas Martin",
                "href": "/profile/Thomas-Martin-118"
            },
            "answer_text": "We did some testing on one model and generally most people liked the feel and look of it.  Not cheap feeling.   Can't recall the model number but it was a phone not marketed in the US,  one for China, so this one would not work well in the US due to the banding and technology it had (TDD-LTE and TD-SCDMA). ",
            "date": "Answered March 9, 2016",
            "views": "103",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Giulio Moro",
                    "user_href": "/profile/Giulio-Moro"
                }
            ]
        },
        {
            "author_info": {
                "name": "Kreston Nathras",
                "href": "/profile/Kreston-Nathras"
            },
            "answer_text": "They have a variety of devices that and most are excellent. The cameras are good quality, the android OS is quick and they are quite good looking phones. Final verdict: Good Check out this review: Huawei P8 Lite Review ",
            "date": "Answered October 20, 2017",
            "views": "54",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Mahendra Tengalkar",
                    "user_href": "/profile/Mahendra-Tengalkar"
                }
            ]
        },
        {
            "author_info": {
                "name": "Olive Dupont",
                "href": "/profile/Olive-Dupont"
            },
            "answer_text": "They are pretty good, I have two Huawei phones, and now I’m using Honor 6, I have used it for 2 years, it runs smoothly. And I like it very much. ",
            "date": "Answered November 30, 2016",
            "views": "625",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Khadeeja Raeda",
                    "user_href": "/profile/Khadeeja-Raeda"
                },
                {
                    "user_id": "Mahendra Tengalkar",
                    "user_href": "/profile/Mahendra-Tengalkar"
                }
            ]
        },
        {
            "author_info": {
                "name": "Ankit Kumar",
                "href": "/profile/Ankit-Kumar-1397"
            },
            "answer_text": "I am using huwaei holly 2 plus and it is just amazing. Many times I drop my phone but still it is having no damages. The body of huwaei phones is too strong. No heating issues at all no lagging. Surely u can go for it. ",
            "date": "Answered September 22, 2017",
            "views": "95",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Mack KD",
                "href": "/profile/Mack-KD"
            },
            "answer_text": "ihave redmi note 3 but after i purchased another device honor 6x honor has better camera screen quality and almost same battery backup yu have to uninstall preinstalled apps first then use it. Awesome i m in love with it ………thnx guys asking such type of questions. ",
            "date": "Answered July 19, 2017",
            "views": "13",
            "upvotes": " Answer requested by Hansen D'Silva",
            "upvoters": [
                {
                    "user_id": "Daniel Ghoreshi",
                    "user_href": "/profile/Daniel-Ghoreshi"
                }
            ]
        },
        {
            "author_info": {
                "name": "Martin Hancock",
                "href": "/profile/Martin-Hancock-10"
            },
            "answer_text": "They're the most advanced phone's available at present. Superb build quality, award winning camera technology and great battery life. Also the most advanced 5G technology if you live in a country which backs their 5G network technology. ",
            "date": "Answered October 24, 2019",
            "views": "229",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Kevin Guan",
                    "user_href": "/profile/Kevin-Guan-21"
                }
            ]
        },
        {
            "author_info": {
                "name": "James Kent",
                "href": "/profile/James-Kent-59"
            },
            "answer_text": "They are good for thier price. If you are not comparing them to another phone then they are good. If you compare them to a phone such as samsung galaxy s7 then they arent good but also the price difference is quite vast as well. ",
            "date": "Answered April 12, 2017",
            "views": "15",
            "upvotes": " Answer requested by Craco Laco"
        },
        {
            "author_info": {
                "name": "Kian Bayno",
                "href": "/profile/Kian-Bayno"
            },
            "answer_text": "It depend on what you’re looking for in a smartphone, really. Buy a high-end model if you want to get a top of the line phone but if you’re gonna use the phone lightly, get a lower end model. It really just comes down to preferences and needs. ",
            "date": "Answered August 15, 2016",
            "views": "22",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Kyle Elam",
                "href": "/profile/Kyle-Elam-2"
            },
            "answer_text": "Huawei phone are great for the price, but they dont compete with the high end flagship devices of lg and samsung.. ",
            "date": "Answered April 8, 2017",
            "views": "13",
            "upvotes": " View 1 Upvoter "
        },
        {
            "author_info": {
                "name": "Gawen Jones",
                "href": "/profile/Gawen-Jones"
            },
            "answer_text": "Huawei Mobiles Archives ",
            "date": "Answered June 9, 2015",
            "views": "372",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Bhavesh Thakur",
                "href": "/profile/Bhavesh-Thakur-82"
            },
            "answer_text": "Good ",
            "date": "Answered August 2, 2020",
            "views": "55",
            "upvotes": "0"
        }
    ]
}