{
    "title": "Are there any VHS camcorders which use normal VHS (AA) tapes rather than compact VHS? - Quora",
    "tags": [
        "Videotapes",
        "VHS"
    ],
    "response": [
        {
            "author_info": {
                "name": "Anthony Freemont",
                "href": "/profile/Anthony-Freemont"
            },
            "answer_text": "Are there any VHS camcorders which use normal VHS (AA) tapes rather than compact VHS? I am a little confused by the terminology of the OP. I do not know what a VHS (AA) tape is. There are (or there have been) VHS camcorders that use a format called VHS-C, which was introduced in Japan in 1982. It used the same size video tape that VHS tapes use, but the tape had a much smaller and slimmer profile and fit into a special adapter that was the size of and mimicked the functionality of a VHS tape. Thus one could record an image on a VHS-c camcorder, then remove the VHS-C from the camera and insert the tape into the specialized VHS adaptor and play it in a regular VHS player. I borrowed an image from the wikipedia article on VHS-C[1] that demonstrates the relationship between VHS and VHS-C formats  Conversely, I do remember attending a friend’s wedding in 1984, where an attendee was carrying a shoulder mounted video camera apparatus that fit snugly in a large suitcase that impressed me because the camera used full size VHS tapes. It was a heavy device that looked very uncomfortable to use. EDIT: Lat week, I was watching a DVD of Bill And Ted’s Excellent Adventure (1989) and the opening scene included the two leads taping themselves using a full sized VHS camera exactly like the one I saw being used in 1984 https://www.youtube.com/watch?v=tx02tY8ABfA Footnotes[1] VHS-C - Wikipedia",
            "date": "Updated August 24, 2020",
            "views": "153",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Steven Cateris",
                    "user_href": "/profile/Steven-Cateris"
                },
                {
                    "user_id": "John Bearson",
                    "user_href": "/profile/John-Bearson"
                },
                {
                    "user_id": "Peter Murias",
                    "user_href": "/profile/Peter-Murias-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Alessandro Machi",
                "href": "/profile/Alessandro-Machi"
            },
            "answer_text": "This might surprise you but most VHS camcorders were full size. The Mini-VHS camcorders were sort of like an unwanted item thrown into the bin for those who really had to have a smaller sized camcorder. The Mini-VHS-C cassettes manage to be just as unliked as 8mm video tape in terms of low shuttle search speeds. VHS-C only had 22 minute loads unless one shot in extended play which significantly reduced both the video and linear audio quality. The 30 minute load Mini-VHS, assuming they were made, had to use thinner video tape, making them even more fragile. Ironically, the full size VHS and S-VHS camcorders ruled when it came to having a camera with the longest possible running time at normal speed with HI-FI audio and mono back-up. ",
            "date": "Answered June 19, 2020",
            "views": "37",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Steven Cateris",
                    "user_href": "/profile/Steven-Cateris"
                }
            ]
        },
        {
            "author_info": {
                "name": "Tom Evans",
                "href": "/profile/Tom-Evans-155"
            },
            "answer_text": "Yes there were. Hopefully all have died due to rubber rot on the pinchroller and belts and the lack of availability of spare parts. ",
            "date": "Answered October 5, 2020",
            "views": "13",
            "upvotes": "0"
        }
    ]
}