{
    "title": "Are there any sensors to detect cloth shapes? - Quora",
    "tags": [
        "Cloth Shapes"
    ],
    "response": [
        {
            "author_info": {
                "name": "Shreyansh Dubey",
                "href": "/profile/Shreyansh-Dubey-8"
            },
            "answer_text": "Hello friend, Today only i encountered a question that asked if there is any sensor to detect the number of rows in a rack, now you want to detect the shape of a cloth….quite thoughtful again. No such sensor exist in the world, there are only some basic sensors available and this task is a game of logic that uses any one of the available sensors to get the work done. I would suggest two ways:- 1.)This is the traditional way of doing such work…….with prior knowledge and skills you can make such kind of a system to detect shape, colour, and colours within colours, etc within very very less time as well as in zero cost. There is a software named MATLAB and is used for programming and image processing….although there are many applications of this software but you should know only these two for your task. Install in your laptop this software, download MATLAB image processing guide online and learn how to analyse and process an image there exist a number of commands through which this processing can be done and changes to image are made it is much like a photo editing thing only difference is it is highly advanced for research purposes and uses commands. Image processing has the most use in analysing images of planets and space by various space labs and institution…….being task specific and not going into that deep……there are commands that link your webcam with the software the webcam would capture an image of your cloth now you have to process these images of cloth by creating a typical algorithm detecting, shape, size, colour, etc that would be applicable for all clothes irrespective of their colour and size all what is required is the image and here the logic comes into play, then you simply have to make a program and run it. It seems difficult but is very easy and a work of just about half an hour for someone who knows how to use MATLAB properly. 2.) Using an analog IR sensor would also do, but it would require very very complicated caliberations and calculations and ofcourse programming and as far as I can think it would work only for a black or white colour cloth. It would be highly in-efficient. Such kind of tasks always require perfection and that can only be available through image processing. Hope you find it helpful and knowledgeable. Thankyou for reading ",
            "date": "Answered January 20, 2017",
            "views": "320",
            "upvotes": "0"
        }
    ]
}