{
    "title": "Are there any smartphones sold today without a front camera? - Quora",
    "tags": [],
    "response": [
        {
            "author_info": {
                "name": "Coto Augosto",
                "href": "/profile/Coto-Augosto"
            },
            "answer_text": "I went to google.com to search “Android without front camera” I was expecting smart ads from some retailer moving me to their page where I was able to click on “Buy Now” button, but it was not like that, the first result was this topic on questioning whether it is needed: “Thoughts about a smartphone without front facing camera?” - reddit The next one was a post on TechCrunch: “I would happily ditch the selfie camera for a full-screen phone” - Startup and Technology News This is tragic comic nowadays, since apparently there is no many alternatives to get an smartphone without front camera. Having video call with the smartphone is one of the the main reasons to have a front camera, since the external USB camera is not easy to use/access. However many users - worried about privacy and able to use external camera in case of video call - would love to have one of them, how do I know that? Because I am a user who would pay for a phone without from camera. PS: the third result on Google was this question on http://Quora.com , confirming that there are not many alternatives for those expected smartphones. ",
            "date": "Updated March 11, 2019",
            "views": "96",
            "upvotes": " View 5 Upvoters",
            "upvoters": [
                {
                    "user_id": "Joshua Brown",
                    "user_href": "/profile/Joshua-Brown-238"
                },
                {
                    "user_id": "Sergio Romo",
                    "user_href": "/profile/Sergio-Romo-11"
                },
                {
                    "user_id": "Kedar Patil",
                    "user_href": "/profile/Kedar-Patil-12"
                },
                {
                    "user_id": "Somenath Dutta",
                    "user_href": "/profile/Somenath-Dutta-24"
                },
                {
                    "user_id": "Igor' Kiriy",
                    "user_href": "/profile/Igor-Kiriy"
                }
            ]
        },
        {
            "author_info": {
                "name": "Cristian Borsa",
                "href": "/profile/Cristian-Borsa"
            },
            "answer_text": "There are very few phones that don’t have a front facing camera anymore. This one has a single camera system that acts as a front facing one when needed. Samsung Galaxy A80 This has no front facing camera and a fixed rear camera system. US $120.54 24% OFF|Global Version Xiaomi QIN 2 Pro Full Screen Phon e 4G Network With Wifi 5.05 inch 2100mAh Andriod 9.0 SC9863A Octa Core Feature|Smart Remote Control| - AliExpress There are also a few phones that have a various designs alternatives with a pop-up front facing camera. Technically, it has a camera there but it’s very obvious when it’s in use. ",
            "date": "Answered July 24, 2020",
            "views": "854",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "MMSowrov",
                    "user_href": "/profile/MMSowrov"
                }
            ]
        },
        {
            "author_info": {
                "name": "Ramakrishna Chunduri",
                "href": "/profile/Ramakrishna-Chunduri"
            },
            "answer_text": "There is a Singapore based company named INO which is consistently releasing phones without any Camera on it. INO Concentrates on promoting usage of smartphones in secured economy sectors like banking, fin-corp etc. But I wasn't aware of phones that lack only front camera but has back camera on it. ",
            "date": "Answered December 24, 2017",
            "views": "62",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Kunal Damgude",
                    "user_href": "/profile/Kunal-Damgude"
                },
                {
                    "user_id": "Shantanu Walekar",
                    "user_href": "/profile/Shantanu-Walekar"
                }
            ]
        },
        {
            "author_info": {
                "name": "Shujia Liu",
                "href": "/profile/Shujia-Liu"
            },
            "answer_text": "Yes. There are phones that has a whole piece of glass in the front. They have a physical camera hidden inside phone. Vivo NEX3: Vivo NEX 3 | Vivo GlobalOppo Reno2: OPPO Reno2 Z - Quad Camera, Zoom Into Imagination | OPPO Global",
            "date": "Answered December 19, 2019",
            "views": "16",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Ashutosh R Joshi",
                "href": "/profile/Ashutosh-R-Joshi"
            },
            "answer_text": "It is highly unlikely that you'll find a smartphone without a front camera. ",
            "date": "Answered December 24, 2017",
            "views": "38",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Anton Milev",
                    "user_href": "/profile/Anton-Milev"
                }
            ]
        }
    ]
}