{
    "title": "Are we ready for foldable smartphones? Does Apple make and sell any? - Quora",
    "tags": [
        "Mobile Devices",
        "Technology Trends",
        "Mobile Technology",
        "Apple (company)",
        "iPhones (product)",
        "Apple Products and Services",
        "Technology"
    ],
    "response": [
        {
            "author_info": {
                "name": "Shresth Sonkar",
                "href": "/profile/Shresth-Sonkar"
            },
            "answer_text": "No. Not exactly. (Assuming we = general public) While the innovation is undeniable in terms of recent “foldable” smartphone trend, the practicality is lesser or more accurately, situational. There are only few situations where a foldable and phone may actually become more useful than conventional phones, but here’s the thing : The foldables’ only selling point is the folding mechanism. Most phones have a very standard aspect ratio of 16:9 or 19:9 as opposed to the nearly squarish 1:1 foldable phones. This makes the full screen viewing not very seamless. There are big black bars on top and bottom.The cameras are same as that of the same company’s conventional flagship (like the Z Fold 2 from Samsung has same setup as Note 20). So why would a consumer pay 2x?The processor is also same, and so is the RAM and storage most of the time. Again, why would a person pay 2x?The screen, again, has a unconventional aspect ratio. The only situation is using split screen feature — like using Notes and YouTube to take down recipe while watching or using video calling app and presentation to display it. However such situations arise occasionally.The reliability[1] has also been a big concern for foldables, especially the Samsung Fold (first foldable) — which almost matched the Note7 battery fiasco from the same companyCost, as expected, is almost 2x-3x of a good flagship phone. So the only reason someone would pay for occasional stuff — which to most people isn’t worth it.Bottom line being, apart from the foldable technology, there is no reason to buy a foldable phone — and it reflects in the sales. Unless the tech trickles to lower price points — something not the smartphone industry does — is the only hope for the foldables to reach masses. Even developers will optimise software for it when there’s incentive of user base to do so. For the kind of prices these things sell at, most people would instead get a laptop and a decent phone and enjoy proper multitasking of a laptop and same camera, display, and performance of the phone. Coming to apple, as much as leaked patents may suggest, one simply cannot predict these things. Of course there are lot of prototypes being made in the secret laboratories of 1 Apple Park Way, which never see the light of day. A lot of times patents are filed for products which eventually never make it to production. So at present apple doesn’t. Will they in future? There isn’t any certainty. Footnotes[1] Samsung's wildly ambitious $2,000 folding phone is a disaster for the smartphone giant - here's what happened",
            "date": "Answered October 22, 2020",
            "views": "131",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Gopalkrishna Vishwanath",
                    "user_href": "/profile/Gopalkrishna-Vishwanath"
                }
            ]
        },
        {
            "author_info": {
                "name": "Ranvijay Raj",
                "href": "/profile/Ranvijay-Raj-1"
            },
            "answer_text": "Foldable iPhone: When Will Apple Join the Trend? Sep 10, 2020 10:52 am PDT by Juli Clover Samsung in 2019 and 2020 unveiled two foldable smartphones, the the Galaxy Fold and the Galaxy Flip Z, both of which feature a foldable design that converts from one shape to another. The Galaxy Fold transitions from a 4.6-inch smartphone into a 7.3-inch tablet, while the Galaxy Z Flip is a 6.7-inch smartphone that folds in half to be more portable. Other companies like Motorola and Huawei have also released foldable smartphones. The technology is nascent and still riddled with issues, but foldable smartphones are a trend right now, and a trend that Apple might one day adopt.  Foldable iPhone Rumors Hints of a foldable iPhone kicked off in 2016 when rumors suggested LG display would be mass producing foldable displays for smartphones in 2018 and supplying them to companies like Apple and Google.  A 2017 rumor kept the folding ‌iPhone‌ concept alive, indicating Apple was partnering up with LG to develop an ‌iPhone‌ with a foldable display. LG has a number of foldable display prototypes that use flexible OLED panels, including one that folds over like a book and a second that rolls up like a newspaper.  More recently, Samsung has offered to supply foldable displays to Apple for use in future iPhones, and Apple supplier Corning is working on a foldable glass solution. Corning is a current Apple supplier, and foldable glass from Corning sounds promising for a future ‌iPhone‌. Samsung is rumored to be providing foldable display samples to Apple for a future foldable ‌iPhone‌ as of September 2020. Samsung is reportedly providing Apple with samples for one year, suggesting that Apple is ramping up work on a foldable ‌iPhone‌. Leaker Jon Prosser claims that Apple is working on a foldable iPhone prototype that features two separate display panels that are connected by a hinge rather than a single display design like the Samsung Galaxy Fold.  The device is said to feature round, stainless steel edges like the iPhone 11, and while there's no notch, Apple has added a \"tiny forehead\" that houses Face ID. Though the prototype is two separate panels, the displays together look \"fairly continuous and seamless.\" Apple is likely testing multiple prototype designs and it's not clear if this prototype (or any prototype) will make it to an eventual release. Foldable iPhone Patents Apple patents all kinds of things that never become finished products so patents aren't necessarily a reliable way to predict what's in development, but Apple has a few foldable ‌iPhone‌ patents.  Apple's first foldable iPhone patent surfaced in 2016, describing a smartphone that folds in half horizontally using a flexible OLED display and a hinged metal support structure. Both halves of the display remain accessible when the phone is shut, and there are also drawings depicting devices with multiple folds.  A 2019 patent application describes foldable smartphone with a built-in heating element or display heating feature to cut down on failures at the fold in cold temperatures, a problem that has the potential to impact foldable smartphones. ",
            "date": "Answered October 22, 2020",
            "views": "269",
            "upvotes": " View 2 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Bhushan N",
                    "user_href": "/profile/Bhushan-N-11"
                },
                {
                    "user_id": "Gopalkrishna Vishwanath",
                    "user_href": "/profile/Gopalkrishna-Vishwanath"
                }
            ]
        }
    ]
}