{
    "title": "Are there any alternative technologies to wired broadband services through DSL or cable TV? - Quora",
    "tags": [
        "Industry Regulation",
        "Home Entertainment",
        "Digital Media Industry",
        "Broadband",
        "Existence Question"
    ],
    "response": [
        {
            "author_info": {
                "name": "Brannen Taylor",
                "href": "/profile/Brannen-Taylor"
            },
            "answer_text": "Yes, there are alternatives.  But first think about how does a signal get from the Internet to you - it has to travel over something.  What are two somethings most homes have?  Phone lines and Cable TV lines.  Therefore, they're the two most prevalent. Alternatives would be some other kind of line - like fiber which Lee Nelson mentioned.  This is being deployed to some municipalities, but it's very hit or miss.  I live in a large metropolitan area - we don't have fiber.  Lee is a \"rural telco\" and they are deploying fiber.  Fiber Optic cable is capable of \"tremendous\" amounts of bandwidth as he mentioned but is expensive to deploy - so providers would have to lose a lot of money to put it in, or charge a lot of money to its users - which is why it's pretty uncommon.Other alternatives would be wireless.  Wireless signals will be some spectrum of electro magnetic radio waves - microwave, infrared, radio, etc.  Radio is more commonly known in their marketing terms \"wifi\" and \"wimax\".  However, terrestrial radio (land based) is limited by signal strength, with line of site being preferred.  Other radio connections would require a satellite to bounce the signal off of.Hope this helps. ",
            "date": "Answered February 4, 2011",
            "views": "28",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "David Rosenthal",
                    "user_href": "/profile/David-Rosenthal-8"
                },
                {
                    "user_id": "Fred Goodwin",
                    "user_href": "/profile/Fred-Goodwin"
                }
            ]
        },
        {
            "author_info": {
                "name": "David S Yip",
                "href": "/profile/David-S-Yip"
            },
            "answer_text": "Hi Babs: You can try Verizon Fios- Because Fios runs on a 100% fiber-optic network, giving you the speed and reliability to stream all the shows you want with fewer signal interruptions and less buffering. And fiber optics are perfect for streaming 4K Ultra High Definition video. So you can stream 4K films and TV shows in sharp, amazing detail. Choosing a plan that fits your bandwidth needs No matter how many streamers you have in your cord-cutting household, Verizon has you covered with the bandwidth you need – from a 100 Mbps plan perfect for smaller homes to the Fios Gigabit Connection, which is tailor-made for those households with multiple family members streaming, surfing and gaming all at once. Whichever plan you choose, you’ll be getting the very best internet for your cord cutting experience with Verizon Fios Internet, a better way of enjoying the internet with superfast speed and amazing reliability. What is Fios? Verizon Internet, TV and Digital Voice Phone Plans ",
            "date": "Answered May 30, 2020",
            "views": "88",
            "upvotes": " Answer requested by Babs Wratten",
            "upvoters": [
                {
                    "user_id": "Fred Goodwin",
                    "user_href": "/profile/Fred-Goodwin"
                }
            ]
        },
        {
            "author_info": {
                "name": "Lee Nelson",
                "href": "/profile/Lee-Nelson"
            },
            "answer_text": "I take some exception to the comment \"cable TV and line phone companies will continue to interfere with the development of video streaming services\".  I work at a rural telco that is also an IPTV service provider.  We offer DSL speeds up to 26Mbps (downstream to the user) with 6Mbps being our most common offering.  Additionally, we offer Fiber to the Prem.  I live in a community in rural Montana with less than 700 residents, but we all have fiber to our homes running at GigE (1000Mbps) speeds. On Fiber, we offer the same Internet speeds that we offer on DSL, in addition to bandwidth for IPTV and VoIP.  A typical IPTV subscriber is getting around 18Mbps of service from us.  This is becoming common in rural and independent telco markets.  If 2Mbps seems like a dream to you, then that is a problem with your service provider and the technology they are using, not a problem with the phone company industry as a whole or with available technology. ",
            "date": "Answered January 4, 2011",
            "views": "782",
            "upvotes": " View 1 Upvoter"
        },
        {
            "author_info": {
                "name": "David Brower",
                "href": "/profile/David-Brower"
            },
            "answer_text": "There are providers that will deliver plain internet over fiber, for example sonic dot net in parts of the SF Bay area. Verizon has FIOS in a few places, but stopped rolling it out a while back. ",
            "date": "Answered May 27, 2020",
            "views": "23",
            "upvotes": " Answer requested by Babs Wratten"
        },
        {
            "author_info": {
                "name": "David Vanderschel",
                "href": "/profile/David-Vanderschel"
            },
            "answer_text": "A2A: fiber, 5G (with directional antennas on the outsides of buildings), and satellite (soon to improve with low-earth orbit satellites). ",
            "date": "Answered May 26, 2020",
            "views": "35",
            "upvotes": " Answer requested by Babs Wratten"
        }
    ]
}