{
    "title": "Are there any good websites to learn Technology? - Quora",
    "tags": [
        "Website Recommendations",
        "Websites"
    ],
    "response": [
        {
            "author_info": {
                "name": "Nick Kapatais",
                "href": "/profile/Nick-Kapatais"
            },
            "answer_text": "There are loads. My first go-to site is Udemy and only if Udemy doesn’t have something I want, I’ll look elsewhere but that’s quite rare. A list of top alternative sites can be found here. From that list, I’ve used Alison, Udacity and Lynda. From those 3 I found that Lynda’s tutors were a bit more clear with their explanations but me saying that doesn’t mean much as it all depends on the person, it’s a personal opinion. Generally, I was pleased with all of them but I still have Udemy as a first choice though. ",
            "date": "Answered October 23, 2019",
            "views": "368",
            "upvotes": " View 2 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Asad Jani",
                    "user_href": "/profile/Asad-Jani-4"
                },
                {
                    "user_id": "Arun Kumar",
                    "user_href": "/profile/Arun-Kumar-25891"
                }
            ]
        },
        {
            "author_info": {
                "name": "Jeffrey Crowder",
                "href": "/profile/Jeffrey-Crowder"
            },
            "answer_text": "Can you please explain in more specifics what you wish to learn? Are you wanting to know how to use Windows 10 or are you wanting to know how to write HTML? I need to know there is a difference in the two and usually folks are more “in depth” and have a description. Edit: I added this in comments below as the question was explained. Okay so look at sites like PC magazine, Popular Science, Cnet, and Also look at Microsoft’s website for a tech blog I forget the name… ",
            "date": "Answered June 14, 2016",
            "views": "695",
            "upvotes": " Answer requested by Qianghao Ken Wu",
            "upvoters": [
                {
                    "user_id": "Matthiew Ave",
                    "user_href": "/profile/Matthiew-Ave"
                }
            ]
        },
        {
            "author_info": {
                "name": "Akash Biswas",
                "href": "/profile/Akash-Biswas-86"
            },
            "answer_text": "The Technology sphere is always changing. Tech-Industry has seen more growth in the last decade than any other industry has witnessed since their birth. I try to keep myself updated with all the latest Tech News, Developments, Announcements, and How-Tos. But sadly there is no One-Stop-Solution for all the Tech-Industry Buzz. I follow a handful of websites for keeping up with Tech-Buzz. The Verge- Tech-Buzz, Industry News, Announcements. Android Authority - Android Development, Tips, Expert Opinion. Space - Space News, Exploration Projects, Rocket Development. ",
            "date": "Updated June 12, 2020",
            "views": "456",
            "upvotes": " View 1 Upvoter"
        },
        {
            "author_info": {
                "name": "Maria Porter",
                "href": "/profile/Maria-Porter-19"
            },
            "answer_text": "Top 5 websites to update with latest technological news and information: Tech CrunchTNWGizmodoMashableTechnoratiThese are the websites which tech professionals read on a daily basis to update with the latest information. In most of the best web development agencies, professional recommend these sites for their juniors through which they are updated about the latest development in the world of technology. ",
            "date": "Answered October 23, 2019",
            "views": "336",
            "upvotes": " Answer requested by Arun Kumar"
        },
        {
            "author_info": {
                "name": "Mohammed Bilal Shaikh",
                "href": "/profile/Mohammed-Bilal-Shaikh-8"
            },
            "answer_text": "Yes, of course, there is a good website to learn something new Udemy is the best website to learn I hope you people get your answer If any type of Question in your mind ask me! And follow me on Quora ",
            "date": "Answered May 11, 2020",
            "views": "95",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Donald Sheng",
                "href": "/profile/Donald-Sheng"
            },
            "answer_text": "Programmers love GitHub Build software better, together, Stack Overflow - Where Developers Learn, Share, & Build Careers , and others. ",
            "date": "Answered October 23, 2019",
            "views": "207",
            "upvotes": " Answer requested by Arun Kumar"
        },
        {
            "author_info": {
                "name": "Linda Harper",
                "href": "/profile/Linda-Harper-1"
            },
            "answer_text": "The best online technology learning website. GreyCampus ",
            "date": "Answered July 24, 2019",
            "views": "121",
            "upvotes": "0"
        }
    ]
}