{
    "title": "Are Huawei phones better than iPhones? - Quora",
    "tags": [
        "Huawei Devices",
        "Huawei (company)",
        "iPhones (product)"
    ],
    "response": [
        {
            "author_info": {
                "name": "Ryan Lee Jackson",
                "href": "/profile/Ryan-Lee-Jackson"
            },
            "answer_text": "Well, I have used both, let's see….. Price, MUCH better. The best that Huawei can offer is the P30 Pro, which costs 8990 Norwegian kr. The best that Apple can offer is the iPhone 11 Pro, which costs 16000 Norwegian kr. The phones are pretty much identical, though Apple may have tiny miscellaneous advantages. Any options to chop down the price? Huawei can offer you the P30 Lite, which will cut down battery power by 25, RAM from 8 to 6 GB, but lowers price to 2990 Norwegian kr, which is 30% of a Pro. Yes, I bought the Lite, and there are some problems, which are understandable since It’s cheap and should be worse. Huawei loses a big aspect to Apple, which is device capacity. Some games on Huawei are limited to 30 FPS, which is quite a bummer. The iPhones takes the crown, as they can offer 60FPS on almost everything. But, this is a hollow victory, as games will add 60 FPS to more devices, so sooner or later, Huawei will also gain 60 FPS, and this advantage will be gone. Another notch Huawei seizes is Battery capacity. (To make a fair fight, I’m comparing the iPhone X to the P30 Lite, as I couldn’t dig up capacity for the 11 yet.) The XR packs 2900 milliamps The Lite packs 3300 milliamps. They are quite the same, but Huawei has the edge. Wait, I found the iPhone 11 Pro capacity. Let’s do the proper comparison! The 11 Pro packs 3900 milliamps The P30 Pro packs 4200 milliamps. Thumbs up, both Apple and Huawei, that was a quite large improvement from one development! Again, they are quite similar, but Huawei has the edge. Another important aspect is storage, and it’s…….a mixed bag. It’s in Apple’s favor if you wanna toss money around, and in Huawei’s, if you need a cheap phone. Apple starts at 32 GB and 64 GB and ends at an Impressive 512 GB Huawei starts at 64 GB and ends at 256 GB. The P20 Lite has the lowest at 64 GB, but then, they are priced nearly the same (P30 Lite is 400 kr more expensive) as a P30 lite, so why not get the newer? So, if you are a rich son of the mayor, and need a humongous storage, the iPhones are the better, but if you are a college student scraping together money for a phone, the Huawei phones are better. Theoretically, Huawei is better, but they won’t gain much more former iPhone users unless Apple tragically fails them, or gets obviously behind on quality, which I honestly don’t think will happen. If I had mistaken anything, do please tell me. ",
            "date": "Answered October 1, 2019",
            "views": "87",
            "upvotes": " View 12 Upvoters",
            "upvoters": [
                {
                    "user_id": "Pramod K",
                    "user_href": "/profile/Pramod-K-160"
                },
                {
                    "user_id": "Yigng Li",
                    "user_href": "/profile/Yigng-Li"
                },
                {
                    "user_id": "Lawrence Wong",
                    "user_href": "/profile/Lawrence-Wong"
                },
                {
                    "user_id": "Mohamed Islam",
                    "user_href": "/profile/Mohamed-Islam-24"
                },
                {
                    "user_id": "Martin Hancock",
                    "user_href": "/profile/Martin-Hancock-10"
                },
                {
                    "user_id": "Elan Pillay",
                    "user_href": "/profile/Elan-Pillay"
                },
                {
                    "user_id": "Maitu Namboodiri",
                    "user_href": "/profile/Maitu-Namboodiri"
                },
                {
                    "user_id": "Sanjoy Chatterjee",
                    "user_href": "/profile/Sanjoy-Chatterjee-35"
                },
                {
                    "user_id": "Meisie Moabi",
                    "user_href": "/profile/Meisie-Moabi"
                },
                {
                    "user_id": "Bighead Teoh",
                    "user_href": "/profile/Bighead-Teoh"
                },
                {
                    "user_id": "Oleg Vishmidt",
                    "user_href": "/profile/Oleg-Vishmidt"
                },
                {
                    "user_id": "Reginald Jacques",
                    "user_href": "/profile/Reginald-Jacques-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Juan Huitz",
                "href": "/profile/Juan-Huitz"
            },
            "answer_text": "My opinion is yes. 100%. Here’s why: Price: I always start with price, because that is simply the worst simple thing about iphones. Iphones are actually terrific phones, the problem is, they can never (and have never been able to) justify it’s status giving price. Huawei phones are always better priced than iphones, even if huawei’s latest flagships have also been expensive devices.New technologies. You always see huawei implement new technoloogies in their phones, trying to innovate and offer new things. Apple does almost never do it. Apple is rather slow while implementing new technologies, they don’t try, they wait for others to test it and then introduce it.The wide variety: If you want an iphone, you either have to spend somewhere around the 1000 USD or settle for an older device. Nobody should spend so much on a phone and nobody should buy a phone that is over 4 years old. (Look at how many people still buy the terribly slow iphone 6 from 2014 just for the sake of having an iphone). Huawei on the other hand has a phone for every budget, current phone, with newer specs and software.Staying in the variety: With iphone you have 3 phones (finally, they used to be just one). So you have the big one, the smaller one or the cheaper one. That’s it. With huawei’s many many options you can find the one that suits you best.I will leave it at that. There are so many many reasons why huawei and many brands are infinitely better than apple. But those for another time. ",
            "date": "Answered March 5, 2019",
            "views": "172",
            "upvotes": " View 63 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Yigng Li",
                    "user_href": "/profile/Yigng-Li"
                },
                {
                    "user_id": "Richard Davis Winters",
                    "user_href": "/profile/Richard-Davis-Winters"
                },
                {
                    "user_id": "Lawrence Wong",
                    "user_href": "/profile/Lawrence-Wong"
                },
                {
                    "user_id": "Xiaocheng Zhu",
                    "user_href": "/profile/Xiaocheng-Zhu-2"
                },
                {
                    "user_id": "Mingchao Shi",
                    "user_href": "/profile/Mingchao-Shi-1"
                },
                {
                    "user_id": "Greek Mapping",
                    "user_href": "/profile/Greek-Mapping-1"
                },
                {
                    "user_id": "Francisca Amaka",
                    "user_href": "/profile/Francisca-Amaka-1"
                },
                {
                    "user_id": "Zhan Lizhan",
                    "user_href": "/profile/Zhan-Lizhan"
                },
                {
                    "user_id": "Dexter Chu",
                    "user_href": "/profile/Dexter-Chu-6"
                },
                {
                    "user_id": "Jefri Zayin",
                    "user_href": "/profile/Jefri-Zayin"
                },
                {
                    "user_id": "Daniel Dragoi",
                    "user_href": "/profile/Daniel-Dragoi-5"
                },
                {
                    "user_id": "Maitu Namboodiri",
                    "user_href": "/profile/Maitu-Namboodiri"
                },
                {
                    "user_id": "Albert LV",
                    "user_href": "/profile/Albert-LV"
                },
                {
                    "user_id": "Karl Peacock",
                    "user_href": "/profile/Karl-Peacock-3"
                },
                {
                    "user_id": "Sanjoy Chatterjee",
                    "user_href": "/profile/Sanjoy-Chatterjee-35"
                },
                {
                    "user_id": "Raven Knight",
                    "user_href": "/profile/Raven-Knight-38"
                },
                {
                    "user_id": "EAP Ki",
                    "user_href": "/profile/EAP-Ki"
                },
                {
                    "user_id": "杨 一凡",
                    "user_href": "/profile/杨-一凡-1"
                },
                {
                    "user_id": "Pavel Bogdanov",
                    "user_href": "/profile/Pavel-Bogdanov-4"
                },
                {
                    "user_id": "Ruo Chen Zhang",
                    "user_href": "/profile/Ruo-Chen-Zhang-1"
                },
                {
                    "user_id": "Tom Sharp",
                    "user_href": "/profile/Tom-Sharp-83"
                },
                {
                    "user_id": "Grant Childs",
                    "user_href": "/profile/Grant-Childs-1"
                },
                {
                    "user_id": "InnoMgmt M-Retail",
                    "user_href": "/profile/InnoMgmt-M-Retail"
                },
                {
                    "user_id": "EddieG Wright",
                    "user_href": "/profile/EddieG-Wright"
                },
                {
                    "user_id": "Valerie Vedette",
                    "user_href": "/profile/Valerie-Vedette"
                },
                {
                    "user_id": "Azhari Baharuddin",
                    "user_href": "/profile/Azhari-Baharuddin"
                },
                {
                    "user_id": "Henry Wang",
                    "user_href": "/profile/Henry-Wang-391"
                },
                {
                    "user_id": "Mika Boolis",
                    "user_href": "/profile/Mika-Boolis"
                },
                {
                    "user_id": "Xiuqi Shan",
                    "user_href": "/profile/Xiuqi-Shan"
                },
                {
                    "user_id": "Tardai",
                    "user_href": "/profile/Tardai"
                },
                {
                    "user_id": "Martin Hancock",
                    "user_href": "/profile/Martin-Hancock-10"
                },
                {
                    "user_id": "Zhongzhen Wang",
                    "user_href": "/profile/Zhongzhen-Wang"
                },
                {
                    "user_id": "Meisie Moabi",
                    "user_href": "/profile/Meisie-Moabi"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/MJ-870"
                },
                {
                    "user_id": "Series Taylor",
                    "user_href": "/profile/Series-Taylor"
                },
                {
                    "user_id": "Hlonela Ntswam",
                    "user_href": "/profile/Hlonela-Ntswam"
                },
                {
                    "user_id": "Ian R. Frank",
                    "user_href": "/profile/Ian-R-Frank-1"
                },
                {
                    "user_id": "Phoenix Raj",
                    "user_href": "/profile/Phoenix-Raj-1"
                },
                {
                    "user_id": "Yasir Ali",
                    "user_href": "/profile/Yasir-Ali-340"
                },
                {
                    "user_id": "Emmanuel Adewusi",
                    "user_href": "/profile/Emmanuel-Adewusi-1"
                },
                {
                    "user_id": "Vivek Chaudhari",
                    "user_href": "/profile/Vivek-Chaudhari-6"
                },
                {
                    "user_id": "Huang XinLong",
                    "user_href": "/profile/Huang-XinLong-1"
                },
                {
                    "user_id": "Michael Lungu",
                    "user_href": "/profile/Michael-Lungu-3"
                },
                {
                    "user_id": "X Qi",
                    "user_href": "/profile/X-Qi-1"
                },
                {
                    "user_id": "Danielle Ma",
                    "user_href": "/profile/Danielle-Ma-9"
                },
                {
                    "user_id": "Kai Jun",
                    "user_href": "/profile/Kai-Jun-31"
                },
                {
                    "user_id": "Reginald Jacques",
                    "user_href": "/profile/Reginald-Jacques-1"
                },
                {
                    "user_id": "Franklin Wien",
                    "user_href": "/profile/Franklin-Wien"
                },
                {
                    "user_id": "Qiu Qiu",
                    "user_href": "/profile/Qiu-Qiu-60"
                },
                {
                    "user_id": "Cristiano Curry",
                    "user_href": "/profile/Cristiano-Curry"
                },
                {
                    "user_id": "Dimitar-Esperanto Berberu",
                    "user_href": "/profile/Dimitar-Esperanto-Berberu"
                },
                {
                    "user_id": "C C Chan",
                    "user_href": "/profile/C-C-Chan"
                },
                {
                    "user_id": "Mado El",
                    "user_href": "/profile/Mado-El"
                },
                {
                    "user_id": "Cactus Bob",
                    "user_href": "/profile/Cactus-Bob-1"
                },
                {
                    "user_id": "Knife Jack",
                    "user_href": "/profile/Knife-Jack"
                },
                {
                    "user_id": "Rajee Ola",
                    "user_href": "/profile/Rajee-Ola"
                },
                {
                    "user_id": "Neale Johns",
                    "user_href": "/profile/Neale-Johns"
                },
                {
                    "user_id": "Aaron Wong",
                    "user_href": "/profile/Aaron-Wong-68"
                },
                {
                    "user_id": "En Li",
                    "user_href": "/profile/En-Li-4"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/Tan-Wh-1"
                },
                {
                    "user_id": "Ben Hui",
                    "user_href": "/profile/Ben-Hui-17"
                },
                {
                    "user_id": "Max Zhang",
                    "user_href": "/profile/Max-Zhang-31"
                },
                {
                    "user_id": "Jeffrin Syow",
                    "user_href": "/profile/Jeffrin-Syow-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Vasco Pais Brandão",
                "href": "/profile/Vasco-Pais-Brandão-1"
            },
            "answer_text": "In this matters, you have to regard all answers as personal opinions, some more technical, some more from the perspective of a simple user. I’m not a fan of any of the them, or any other manufactures or software house. What I can do is find the logical behind the way this two companies are managed and the core industrial strategy behind them. Please disregard any answer that’s to aggressively in defense of one or the other and never mind the childish persecution of Huawei by the USA administration. I suppose everybody can understand what’s behind this absurd claims (Apple also makes their phones in China). Both manufacturers are week established ones, with very good products. The advantage Apple has is the fax they developed a system, rather then just the hardware. They are able to perfect the fusion between software and hardware in a way that no other manufacturer can. The develop and test the bonding of the os with the equipments close to perfection. They are surely not the most innovative or revolutionary but what they implement normally becomes the industry standard regarding that same implementation. They are not in ““the lead”, they do not take many risks and they are have a very well thought off marketing strategy that’s been working for them, for ages. One additional point is the fact that they have a all ecosystem that involves softwares and all the hardware you use for work and leisure everyday, in a very integrated and easy way. They have MacBooks, imacs, iPads (and this is a implementation nobody could even get close to), iPhone, Apple Watch etc. Huawei (and all of there competitors) don’t have that (yet). They still rely on third party software and have to implant adaptation measures, filling the phones with bloatwate). Huawei makes great phones, with amazing cameras and good battery life. They are very good quality and if you don’t mind all that’s said above, and is not inside apples ecosystem, you cannot to wrong with Huawei. Apple and iPhones are just a world apart, not in terms of sheer quality or ““better of worse”, just very different. Ps: do you think Huawei could release a phone that’s 4/ 5 year old design and make it a sales success (iPhone SE 2)? No! It’s just another dimension of the same industry. ",
            "date": "Answered August 29, 2020",
            "views": "924",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "CGTN Social Team",
                "href": "/profile/CGTN-Social-Team"
            },
            "answer_text": "In terms of tech innovation, Huawei has come from behind to beat Apple.  Huawei launched its new big-screen flagship smartphone series, the Mate 30, in Berlin on Thursday. During the launch, the Chinese phone-maker bashed U.S. rival Apple for copying its iconic \"bathroom heater-shaped\" rear camera module on the Mate 20 series, and introduced a new round design which looks more like a standalone camera. In CGTN's Mate 20 X 5G review, we mentioned the possibility that iPhone 11's camera module design was inspired by Huawei. Watch the full review here and find out why the Mate 20 X still matters. The iPhone 11 series not only has a similar camera module to Mate 20, but an identical triple-camera setup: Main, telephoto and wide-angle cameras. Huawei claimed in 2018 they were the first to bring such a setup to a smartphone. The Mate 30 series In addition to the leaked information reported on Wednesday, Huawei revealed more details about the series. Screen: The Mate 30 Pro has a 6.53-inch screen with 88-degree double-curved edges. Huawei calls the design \"Flex OLED,\" though it's more commonly known as \"waterfall.\" The screen of Mate 30 is bigger than Mate 30 Pro, at 6.62 inches. Besides using it to replace the volume rockers, Huawei said it also added a camera shutter button on the edge, making it easier for users to take photos with one hand. Weight: The Mate 30 and Mate 30 Pro both weigh a little under 200 grams, about 88 percent of the iPhone 11 Pro Max. Yet Huawei's consumer product CEO Richard Yu said the Mate 30 has a longer battery life than Apple's product. Color options: In addition to traditional black, silver, purple and green, Huawei also added two \"vegan leather\" options. The green and orange leather will not break as easily as glass and is more skin-friendly. Chip: The Kirin 990 5G chip has already been made known to the public. Yu said the 5G version of the Mate 30 Pro can make use of the 5G network around the world, unlike Samsung's limited 5G capacity or iPhone 11's complete lack of 5G. Charging: Contrary to leaked information, the Mate 30 only supports 27 watt wireless charge, but the Mate 30 Pro can be charged wirelessly at a speed of 40 watts. Huawei also built in-car wired/wireless chargers for car owners to enjoy faster charging time. Camera: Huawei upgraded the triple-camera set to enable a 45-time zoom, from 30 in the P30 series. They also imported P30's RYYB sensor to the Mate series to let in more light in dark places. The sensor size is \"137 percent\" larger than the iPhone 11 Pro Max, according to Yu. The Mate 30 Pro takes one step further with higher specifications. Check the picture below for details. These enable the Mate 30 Pro to use night-shot and HDR functions on the wide-angle camera.  On the video side, Huawei said they have reached the \"world's highest video light sensitivity on smartphone.\" Bokeh video can also be taken with the faster sensor and CPU. Huawei even challenged the GoPro on extreme sport videography. Source:Huawei bashes Apple for copying camera module design at Mate 30 launch ",
            "date": "Answered September 20, 2019",
            "views": "61",
            "upvotes": " View 13 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Yigng Li",
                    "user_href": "/profile/Yigng-Li"
                },
                {
                    "user_id": "Martin Hancock",
                    "user_href": "/profile/Martin-Hancock-10"
                },
                {
                    "user_id": "Mingchao Shi",
                    "user_href": "/profile/Mingchao-Shi-1"
                },
                {
                    "user_id": "Jefri Zayin",
                    "user_href": "/profile/Jefri-Zayin"
                },
                {
                    "user_id": "Sanjoy Chatterjee",
                    "user_href": "/profile/Sanjoy-Chatterjee-35"
                },
                {
                    "user_id": "Patrick Lu",
                    "user_href": "/profile/Patrick-Lu-64"
                },
                {
                    "user_id": "Leslie Volgy",
                    "user_href": "/profile/Leslie-Volgy-1"
                },
                {
                    "user_id": "Meisie Moabi",
                    "user_href": "/profile/Meisie-Moabi"
                },
                {
                    "user_id": "Sam King",
                    "user_href": "/profile/Sam-King-451"
                },
                {
                    "user_id": "Maha Dhamma Yarzar",
                    "user_href": "/profile/Maha-Dhamma-Yarzar"
                },
                {
                    "user_id": "Xiao Wang",
                    "user_href": "/profile/Xiao-Wang-64"
                },
                {
                    "user_id": "Perng Cheah",
                    "user_href": "/profile/Perng-Cheah"
                },
                {
                    "user_id": "Xu Wentao",
                    "user_href": "/profile/Xu-Wentao-6"
                }
            ]
        },
        {
            "author_info": {
                "name": "Leon Funnell",
                "href": "/profile/Leon-Funnell"
            },
            "answer_text": "It is highly subjective, but if you take face-value alone, see for yourself: The iPhone XS-Max with 512GB storage (the best iPhone available) retails in the UK for £1,449. It has two cameras, with 2x optical zoom, at best at 12 megapixels, 6 CPU cores, 4GB RAM and a 3174mAh battery and a 6.5″ OLED 1242 x 2688 screenA Huawei P30 Pro with 512GB storage (arguably the best phone available) retails in the UK for £1,094. It has three cameras, with 5x optical zoom, at best 40 megapixels, an 8-core CPU, 8GB RAM and a 4200mAh battery, 6.47″ OLED 1080 x 2340 screenThe iPhone has half the RAM, 75% the battery capacity of the Huawei, and the Huawei camera setup is MILES better than anything else on the market, yet the iPhone is nearly 40% more expensive. Both the above phones are furiously fast, and the battery would easily last more than 24 hours in all cases, as you would expect for a top-of-the-line phone, but you get better bang-for-buck with the Huawei. Having owned and used devices from Apple, Samsung and Huawei, I can categorically state that my P20 Pro (last year’s model) is the best phone I have ever owned in almost every respect. The photos are breathtaking, the device NEVER slows down, and the battery reliably lasts more than 24 hours even with heavy use, and I have 80+ apps installed. I tried an iPhone for 6 months last year, and though it was fast, I was constantly frustrated by the poor usability and the lack of innovation. See my other post Are Samsung phones really as good as iPhones?. I suggest most new phones are good, so go with what you know (and can afford) unless you are prepared for the pain of switching and trying to migrate all your stuff across!!! ",
            "date": "Answered April 4, 2019",
            "views": "122",
            "upvotes": " View 26 Upvoters",
            "upvoters": [
                {
                    "user_id": "Sureshkumar Sureshkumar",
                    "user_href": "/profile/Sureshkumar-Sureshkumar-12"
                },
                {
                    "user_id": "Charles Gao",
                    "user_href": "/profile/Charles-Gao-6"
                },
                {
                    "user_id": "Kevin Lam",
                    "user_href": "/profile/Kevin-Lam-245"
                },
                {
                    "user_id": "Martin Hancock",
                    "user_href": "/profile/Martin-Hancock-10"
                },
                {
                    "user_id": "Mingchao Shi",
                    "user_href": "/profile/Mingchao-Shi-1"
                },
                {
                    "user_id": "Sanjoy Chatterjee",
                    "user_href": "/profile/Sanjoy-Chatterjee-35"
                },
                {
                    "user_id": "Raven Knight",
                    "user_href": "/profile/Raven-Knight-38"
                },
                {
                    "user_id": "Ryan 淡紫",
                    "user_href": "/profile/Ryan-淡紫"
                },
                {
                    "user_id": "Viktoria Tiszai",
                    "user_href": "/profile/Viktoria-Tiszai-1"
                },
                {
                    "user_id": "Ruo Chen Zhang",
                    "user_href": "/profile/Ruo-Chen-Zhang-1"
                },
                {
                    "user_id": "Eggy Wilde",
                    "user_href": "/profile/Eggy-Wilde"
                },
                {
                    "user_id": "Edward Chen",
                    "user_href": "/profile/Edward-Chen-133"
                },
                {
                    "user_id": "Phoenix Raj",
                    "user_href": "/profile/Phoenix-Raj-1"
                },
                {
                    "user_id": "Sam King",
                    "user_href": "/profile/Sam-King-451"
                },
                {
                    "user_id": "Michael Lungu",
                    "user_href": "/profile/Michael-Lungu-3"
                },
                {
                    "user_id": "Danielle Ma",
                    "user_href": "/profile/Danielle-Ma-9"
                },
                {
                    "user_id": "Shouritsu Woh",
                    "user_href": "/profile/Shouritsu-Woh"
                },
                {
                    "user_id": "Franklin Wien",
                    "user_href": "/profile/Franklin-Wien"
                },
                {
                    "user_id": "Jefri Zayin",
                    "user_href": "/profile/Jefri-Zayin"
                },
                {
                    "user_id": "Dimitar-Esperanto Berberu",
                    "user_href": "/profile/Dimitar-Esperanto-Berberu"
                },
                {
                    "user_id": "Ziqiang Guan",
                    "user_href": "/profile/Ziqiang-Guan-3"
                },
                {
                    "user_id": "Firman Gunawan",
                    "user_href": "/profile/Firman-Gunawan-4"
                },
                {
                    "user_id": "Francs Tan",
                    "user_href": "/profile/Francs-Tan"
                },
                {
                    "user_id": "Dra Putt",
                    "user_href": "/profile/Dra-Putt"
                },
                {
                    "user_id": "Kangzhi Lou",
                    "user_href": "/profile/Kangzhi-Lou"
                },
                {
                    "user_id": "Duncan Leung",
                    "user_href": "/profile/Duncan-Leung-6"
                }
            ]
        },
        {
            "author_info": {
                "name": "Bugra Kanargi",
                "href": "/profile/Bugra-Kanargi"
            },
            "answer_text": "I have been an iPhone user for almost 6 years. My favorite phone (that I currently have) is the iPhone SE. I even find the iPhone 7 a little too large to easily hold in one hand and use comfortably. Once Apple discontinued the 3.5-inch screen size with iPhone SE and replaced the whole batch of iPhones with outrageously expensive models, I was so pissed that I started looking for an Android phone. There were no compact smartphones with 3.5 to 4-inch display sizes anymore and I purchased a Mi A2 Lite (that costs about 1/10th of the cost of an iPhone XS) with AndroidOne installed in it. The phone I tested at the shop was running Android version 8. After I purchased, I upgraded it to version 9. After the update, the phone started experiencing some lags while scrolling. Besides, Android doesn’t give the feeling that iOS gives. I can’t explain it well but there is something either wrong or missing. The Android settings are far more complicated than iOS. There are more features but they are complicated to set and for the first few days, you may not get them right. Your phone may not come out of the “do not disturb” mode or may vibrate while it is supposed to ring only. I was thinking that AnroidOne, which is the purest form of Android, would be better than some third party user interfaces (UIs) developed by the phone makers. I might have been mistaken. UIs developed by smartphone manufacturers for Android may actually give a better user experience but I recommend you to read all comments before you proceed with buying one. Because some users say those UIs don’t get as many updates as AndroidOne gets. So, you should definitely study before buying an Android. You have asked if you should get an iPhone or a Huawei but the answer I gave was all about the operating systems. In terms of hardware, you can’t go wrong with Huawei or Samsung. I tested many phones before I decided to buy this very affordable Mi A2 Lite and they were all great pieces of hardware. Even this Mi A2 Lite has 3-day battery life with a 5.84-inch screen. Now I use it as my Netflix remote at home and I do some browsing on it and its great. I charge once a week. Under daylight, it takes better photos than my iPhone SE. But iOS gives me a smoother user experience in my daily life. That’s why I replaced my iPhone SE’s battery and I am back on it. ",
            "date": "Answered September 18, 2019",
            "views": "41",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Pramod K",
                    "user_href": "/profile/Pramod-K-160"
                },
                {
                    "user_id": "Sanjoy Chatterjee",
                    "user_href": "/profile/Sanjoy-Chatterjee-35"
                }
            ]
        },
        {
            "author_info": {
                "name": "Kevin Shafer",
                "href": "/profile/Kevin-Shafer-3"
            },
            "answer_text": "I don’t think an iPhone is better than Huawei phones. Sure, they may have better security but that is because you can’t do to an iPhone what you can do with any (not just Huawei) android phones. I need my apps to be able to work together, I need to be able to customize easily without jumping through hoops. Oh, and I need to save my money instead of throwing it away on a phone that cost half what you paid for it to make to contribute to a company becomeing the first trillion dollar company. A company that won’t fix a keyboard issue in it’s laptops for three generations now and issues a comment like “we are aware there are a small number of users that are having issues with our keyboards and for that we are sorry.” No recourse, no offer to fix it, just an apology aka a dismissal. Yep, keep buying into the Apple culture, sheeple. ",
            "date": "Answered April 7, 2019",
            "views": "28",
            "upvotes": " View 11 Upvoters",
            "upvoters": [
                {
                    "user_id": "Yigng Li",
                    "user_href": "/profile/Yigng-Li"
                },
                {
                    "user_id": "Lawrence Wong",
                    "user_href": "/profile/Lawrence-Wong"
                },
                {
                    "user_id": "Daniel Dragoi",
                    "user_href": "/profile/Daniel-Dragoi-5"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/MJ-870"
                },
                {
                    "user_id": "Yasir Ali",
                    "user_href": "/profile/Yasir-Ali-340"
                },
                {
                    "user_id": "Martin Hancock",
                    "user_href": "/profile/Martin-Hancock-10"
                },
                {
                    "user_id": "Franklin Wien",
                    "user_href": "/profile/Franklin-Wien"
                },
                {
                    "user_id": "Dimitar-Esperanto Berberu",
                    "user_href": "/profile/Dimitar-Esperanto-Berberu"
                },
                {
                    "user_id": "Leon Funnell",
                    "user_href": "/profile/Leon-Funnell-1"
                },
                {
                    "user_id": "Knife Jack",
                    "user_href": "/profile/Knife-Jack"
                },
                {
                    "user_id": "Jeffrin Syow",
                    "user_href": "/profile/Jeffrin-Syow-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Hitesh Lalwani",
                "href": "/profile/Hitesh-Lalwani-35"
            },
            "answer_text": "It's a subjective topic but as per current scenario iPhone is better placed than Huawei and there are so many reasons for that: Huawei is a Chinese company and iPhone is an American company and as per country laws, iPhone doesn't share any private data with any government body whereas all the Chinese companies are supposed to share whatever data government of China asks them to.China secretly uses its companies to spy on other people and country, so reliability issue will always be there.iPhones are more secure than Huawei phones but if you want an android phone then there are other alternatives to Huawei like Samsung, LG, Asus, Google Pixel and Sony.If budget or features are your concern then Android phones are cheaper than an iPhone. Recently Apple came up with a new phone which is quite similar to iPhone 8 but it comes with the latest hardware like new camera sensor, new chip, more ram and its name is iPhone SE 2 or 2020. It'll still cost you somewhere around $564 or ₹42,500. There are so many Android phones that come cheaper than iPhone SE like: Samsung Galaxy A10s - $119.2 or ₹8,989Samsung Galaxy M21 - $168.6 or ₹12,699Samsung Galaxy M30 - $172.5 or ₹12,999Samsung Galaxy M30s - $199.1 or ₹14,999Samsung Galaxy M31 - $212.3 or ₹15,999Samsung Galaxy M40 - $239 or ₹17,999Yes, they all are Samsung midrange smartphones but the best things about them are they come with a super AMOLED screen, 15/18 Watt Fast Charger, at least 4000 mAH battery, triple or quad-camera setup and on top of that with their new One UI 2.0 which runs on Android 10. ",
            "date": "Updated July 1, 2020",
            "views": "11",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Sanjoy Chatterjee",
                    "user_href": "/profile/Sanjoy-Chatterjee-35"
                }
            ]
        },
        {
            "author_info": {
                "name": "Michael Oppert",
                "href": "/profile/Michael-Oppert"
            },
            "answer_text": "Huawei is a superior device. My wife has the new Apple XS and I have the new Mate 20pro. First of all, the battery life is far superior, she needs to start charging her phone around 2–3pm at the office, my Huawei can get through the entire day without a top up. My call count is on average 185 per day. Plus what's app groups and messages, plus é mails. Very hectic, but the device handles all this activity at great speed and with ease. The I phone XS is definitely noticeably slower when multitasking. One disappointing feature that Android 9 (Pie), brings is that call recordings are now disallowed. Its an important feature for business to be able to have back up conversational evidence. The I phone has never allowed call recording. In summary, I would choose the Huawei above the I phone. ",
            "date": "Answered December 9, 2018",
            "views": "43",
            "upvotes": " View 20 Upvoters",
            "upvoters": [
                {
                    "user_id": "Yigng Li",
                    "user_href": "/profile/Yigng-Li"
                },
                {
                    "user_id": "Dave Collins",
                    "user_href": "/profile/Dave-Collins-162"
                },
                {
                    "user_id": "Lawrence Wong",
                    "user_href": "/profile/Lawrence-Wong"
                },
                {
                    "user_id": "Kevin Lam",
                    "user_href": "/profile/Kevin-Lam-245"
                },
                {
                    "user_id": "Martin Hancock",
                    "user_href": "/profile/Martin-Hancock-10"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/L-B-57"
                },
                {
                    "user_id": "Daniel Dragoi",
                    "user_href": "/profile/Daniel-Dragoi-5"
                },
                {
                    "user_id": "Cheng Hu",
                    "user_href": "/profile/Cheng-Hu-36"
                },
                {
                    "user_id": "Stone Cao",
                    "user_href": "/profile/Stone-Cao-2"
                },
                {
                    "user_id": "Sanjoy Chatterjee",
                    "user_href": "/profile/Sanjoy-Chatterjee-35"
                },
                {
                    "user_id": "Guo Shaoguang",
                    "user_href": "/profile/Guo-Shaoguang"
                },
                {
                    "user_id": "Violet Town",
                    "user_href": "/profile/Violet-Town-1"
                },
                {
                    "user_id": "Li Dada",
                    "user_href": "/profile/Li-Dada-5"
                },
                {
                    "user_id": "Jefri Zayin",
                    "user_href": "/profile/Jefri-Zayin"
                },
                {
                    "user_id": "Danny Williams",
                    "user_href": "/profile/Danny-Williams-316"
                },
                {
                    "user_id": "Lionel Messi",
                    "user_href": "/profile/Lionel-Messi-342"
                },
                {
                    "user_id": "Yaliyomo Vitabuni",
                    "user_href": "/profile/Yaliyomo-Vitabuni-1"
                },
                {
                    "user_id": "Rajee Ola",
                    "user_href": "/profile/Rajee-Ola"
                },
                {
                    "user_id": "Grom Daminsi",
                    "user_href": "/profile/Grom-Daminsi"
                },
                {
                    "user_id": "Donald Falker",
                    "user_href": "/profile/Donald-Falker"
                }
            ]
        },
        {
            "author_info": {
                "name": "Lawrence Chen",
                "href": "/profile/Lawrence-Chen-66"
            },
            "answer_text": "For 2019, you should absolutely get an iPhone. FIVE reasons to support so. Battery life, yes, I am not joking, iPhone efficiency can be on par with Sony Xperia considering theri efficiency, but now Apple expand their capqacity to a crazy level. Yes, 3900mAh for their Max phone, we would see a phone that give you 15hours content consumption hours in broswering. Not any Huawei phone or other phone may even peek at.A13 means performance. Kirin series is the 2nd weakest soc among all soc vendors. Even K990 would not stand a chance to bite A13. A13 would be likely on par with the newly launched Snapdragon865 in CES 2020. Huawei just cannot compete.Better support in both Modem and country. Nobody knows if USA would process sanction to Huawei, you may encounter limited support and warranties and even android support in near future. It would be foolish to get an unclear future machine in 2019. A phone means your wallet, phone and browser. Do not risk yourself. Besiders, huawei warranty is not good in USA for a long time. check with consumer report.Unbeatable video capture capability. 3 cameras in use in the same time but not even alter in white balance, or color range. It is terrific.Better quality display. Easily crush any Huawei phone.Above ",
            "date": "Answered September 19, 2019",
            "views": "26",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Sanjoy Chatterjee",
                    "user_href": "/profile/Sanjoy-Chatterjee-35"
                }
            ]
        },
        {
            "author_info": {
                "name": "Tianjie Lu",
                "href": "/profile/Tianjie-Lu"
            },
            "answer_text": "If you're looking at build quality, then yes, iPhone is slightly better. Apple used a steel frame while Huawei used an aluminum. But don’t be fooled by that, the steel frame of the iPhone is MUCH heavier and inefficient. If Apple really wanted to focus on durability, they would’ve used a titanium frame. If your looking at spec quality (camera, display, etc) then Huawei does a better job. Their camera uses Red,Yellow,and Blue while iPhones use Red,Green,Blue. This allows the Huawei to do 40% better in low-light. And Huawei’s display is slightly better. But you have to consider the price, the P30 is about the price of a S10 in China, but a iPhone can be hundreds more expensive. ",
            "date": "Answered April 3, 2019",
            "views": "17",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Yigng Li",
                    "user_href": "/profile/Yigng-Li"
                },
                {
                    "user_id": "Yasir Ali",
                    "user_href": "/profile/Yasir-Ali-340"
                },
                {
                    "user_id": "Martin Hancock",
                    "user_href": "/profile/Martin-Hancock-10"
                }
            ]
        },
        {
            "author_info": {
                "name": "Adrian George",
                "href": "/profile/Adrian-George-40"
            },
            "answer_text": "Before I begin. This answer is biased. I’ll admit that right off the bat. BUT there are reasons why! New Huawei phones can no longer access Google’s Play services. For almost everyone outside of China, this is a dealbreaker. Iphone’s Battery life is now impeccable. I own an XR and I’ve never had to charge it during the day even after extremely heavy use. I’m still amazed by it. iPhones are quick. iPhones are generally more secure. The App Store is a lot safer than Google Play. This is because of Apples strict control over it. Some people have a gripe with this and I’m not sure why. Support and updates for iPhones go well beyond any other manufacturer. You could receive updates for up to 5 years. iPhone apps generally tend to be better than their android equivalent. Although this gap is reducing. iPhones do cost more initially. But when you consider the support. Long life and resale value is greater. It can make more economic sense. So I’d say go for an iPhone. If you must have Android though. Pick Samsung or a Google Pixel. ",
            "date": "Answered September 22, 2019",
            "views": "15",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Julian Garrett",
                    "user_href": "/profile/Julian-Garrett-1"
                },
                {
                    "user_id": "Sanjoy Chatterjee",
                    "user_href": "/profile/Sanjoy-Chatterjee-35"
                },
                {
                    "user_id": "Paul Impola",
                    "user_href": "/profile/Paul-Impola"
                },
                {
                    "user_id": "Ruslan Babura",
                    "user_href": "/profile/Ruslan-Babura"
                }
            ]
        },
        {
            "author_info": {
                "name": "Lorrn Edmonds",
                "href": "/profile/Lorrn-Edmonds"
            },
            "answer_text": "Let’s skip the hardware. Support - Apple is a known quality. Best support in the world. Security - even the FBI is trying to get Apple to let them see what’s on peoples phones and Apple said no can not do. If I lived in certain countries or travelled across borders this would be a big plus. Resale - Apple has a known resale. App Store - apps that are not buggy. Apple often repairs stuff long out of warrantee. Example iPhone 6, Apple just announced they will do a out of warrantee fix. Apple has a history of supporting their phones for years. July 22, 2019 they released 9.3.6 and 10 something for almost pre-historic iPhones. Consumers reports (which I do not trust) just rated the iPhone as the best phone. And many of my friends have them and we often help each other. Apple phones come with a lot of free usable software. There is enough there so you will never have to buy anything else. repair parts available for years. My iPad got dropped. Smashed. They did not repair it. They gave me a brand new one. And then there is the Apple Store. I have a friend who I think would live there if they had beds. ",
            "date": "Answered October 7, 2019",
            "views": "12",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Sanjoy Chatterjee",
                    "user_href": "/profile/Sanjoy-Chatterjee-35"
                },
                {
                    "user_id": "Sergio Bendeck Paranky",
                    "user_href": "/profile/Sergio-Bendeck-Paranky"
                }
            ]
        },
        {
            "author_info": {
                "name": "Tim Crannigan",
                "href": "/profile/Tim-Crannigan"
            },
            "answer_text": "You would buy Huwaei because they are currently producing the best value phones in the mid to high range with very good quality, rock solid build. They also have expandable memory which is a must for me (though the Mate series uses a proprietary card, which is a very bad move, non standard accessories always are) Honor View 10,Mate 10, mate 10 Pro, magic 2,honor play etc etc they have an excellent phone for every need. I regard Huwaei as the best phone manufacturers on the market (Samsung now being too expensive) Apple make phones that are very highly priced, totally restrictive (can't replace the Launcher, expand the memory, tinker generally) but are part of a larger Apple ecosystem. If you like Android and the ability to tweak everything about your phone, Huwaei is a very good choice. If you have a lot of Apple gear or like the image and have cash to spare, buy an iPhone. ",
            "date": "Updated December 14, 2018",
            "views": "14",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Yigng Li",
                    "user_href": "/profile/Yigng-Li"
                },
                {
                    "user_id": "Martin Hancock",
                    "user_href": "/profile/Martin-Hancock-10"
                },
                {
                    "user_id": "RAY CHANG",
                    "user_href": "/profile/RAY-CHANG-81"
                },
                {
                    "user_id": "Lionel Messi",
                    "user_href": "/profile/Lionel-Messi-342"
                }
            ]
        },
        {
            "author_info": {
                "name": "Petr Widimský",
                "href": "/profile/Petr-Widimský"
            },
            "answer_text": "Well you need to specify what Huawei phone and specify in which things you mean, Huawei flagship (top phone right now) is Huawei P30 Pro. And this phone is amazing. Iphones have IOS software so that makes them look clearer, but it depends on preference. I like android more, because I can customize the look, install more apps, work with different shortcuts… Huawei P30 Pro has a better camera then any of the iPhones, better battery, fingerprint sensor built in the screen… On the other side iPhones have FaceID so that’s about what you prefer too. People buy iPhone because it has the Apple logo which guarantees that it will be at least pretty decent. People buy it because they can be sure that it will be enough for them. ",
            "date": "Answered April 25, 2019",
            "views": "17",
            "upvotes": " View 3 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Yigng Li",
                    "user_href": "/profile/Yigng-Li"
                },
                {
                    "user_id": "Martin Hancock",
                    "user_href": "/profile/Martin-Hancock-10"
                },
                {
                    "user_id": "Dimitar-Esperanto Berberu",
                    "user_href": "/profile/Dimitar-Esperanto-Berberu"
                }
            ]
        },
        {
            "author_info": {
                "name": "Chris Summers",
                "href": "/profile/Chris-Summers-22"
            },
            "answer_text": "That could only be answered by you. We can't make that decision for you. Both offer some of the greatest devices. iPhones are great and very secure with updates for up to 5+ years from Apple. Huawei phones offer some great build quality and very nice devices. The current situation may concern you but not many, I would get one. Should you change would be your decision. If you like your iPhone then I guess no. If you want a change then ok, sure. But what every you choose should be yours not mine or anyone elses choice for you. ",
            "date": "Answered June 26, 2019",
            "views": "447",
            "upvotes": " Answer requested by Jack Alhadeff",
            "upvoters": [
                {
                    "user_id": "Dimitar-Esperanto Berberu",
                    "user_href": "/profile/Dimitar-Esperanto-Berberu"
                }
            ]
        },
        {
            "author_info": {
                "name": "Connor Dalton",
                "href": "/profile/Connor-Dalton-13"
            },
            "answer_text": "Depends on what you are after. Huawei devices are renowned for their excellent ability to preserve a charge, and their camera capabilities, especially in still photography ( along with google, they are considered the market leaders in still images). iPhones tend to feel like they handle faster though ( thanks to IOS’s optimizations) and iPhones are notorious for their strong handling of video recording. ",
            "date": "Answered June 19, 2019",
            "views": "15",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Elliot Tasman",
                "href": "/profile/Elliot-Tasman"
            },
            "answer_text": "I had a Huawei Mate 2 for 1.5 years before the battery started going on me. In addition my carrier never provided an OS update and that is a problem in itself. I’m currently using an iPhone 6S Plus, +4 years and going strong. Although I didn’t need to I changed the battery just before the Apple battery swap ended. I’m going to baby this iPhone till end of next year and decide on my next phone. In terms of value for money Apple any day. If Huawei flagship phones were cheaper I might consider it. ",
            "date": "Answered October 6, 2019",
            "views": "423",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Giulio Moro",
                "href": "/profile/Giulio-Moro"
            },
            "answer_text": "Without a doubt, yes. But most people look for great value, outstanding performance and dependability or durability. But when a company locks down their devices and dictates to the paying customer how to yet their products, and what can or can't be installed onto them, they're not a company is l I'd support by buying tickets products, especially when they're way too overpriced coming from China. ",
            "date": "Answered April 28, 2019",
            "views": "11",
            "upvotes": " Answer requested by Dylan Jacobs",
            "upvoters": [
                {
                    "user_id": "Martin Hancock",
                    "user_href": "/profile/Martin-Hancock-10"
                }
            ]
        },
        {
            "author_info": {
                "name": "Rhea Johnson",
                "href": "/profile/Rhea-Johnson-24"
            },
            "answer_text": "Well, Huawei has been well recognized all around the world. And if you are fond of this brand, just to have a new one. Especially that Huawei is now having their own Harmony OS. It can in some degree bring your different experience on mobile phone using. And if you are a switcher from iPhone to Huawei, i will share with a tutoiral teaching you how to use a program to seamlessly transfer the iPhone data to Huawei. Syncios Data Transfer is the key point!  ",
            "date": "Answered August 19, 2019",
            "views": "339",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Banh Dau",
                "href": "/profile/Banh-Dau"
            },
            "answer_text": "Neither. Get a Samsung phone. iPhone is way overpriced, and you pay a lot of money just for the name. Apple has been playing catch up and trend follower to the Asian phone makers for quite a few years now. It’s now content to just sit pretty and monetize its once famous innovative reputation. Unless you live in China and absolutely have no need for Google Map, Gmail, Google search, Youtube, and other Google services, then Huawei phones make sense. New Huawei phones will not have access to the Google Play store and other Google services. Samsung is still innovating, and it makes good quality phones from high end to low end. ",
            "date": "Answered September 18, 2019",
            "views": "553",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Westley Mapper",
                "href": "/profile/Westley-Mapper"
            },
            "answer_text": "Well, Im not sure as long as oficall list says: 1.Samsung 2.Apple 3.Huawei 4. Xiaomi But, Huawei is supossed to surpass Apple, but there is problem as long as Xiaomi has similliar quality slas Huawei’s and Apples. If you want better softwares and build - take one Iphone for you, but if you want bigger screen, better camera and speakers, and so good hardwares buy one Huawei smartphone. But yeah… Both of them together ain’t even close to Samsung ",
            "date": "Answered April 6, 2019",
            "views": "1",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Martin Hancock",
                    "user_href": "/profile/Martin-Hancock-10"
                }
            ]
        },
        {
            "author_info": {
                "name": "Naeem Javid Muhammad Hassani",
                "href": "/profile/Naeem-Javid-Muhammad-Hassani"
            },
            "answer_text": "Smartphones are getting better day by day. If we talk about quality, both offer good services. The main differentiating factor is the operating system (OS). Huawei phones work on Android while iPhones work on iOS. So, if you’re an Android phone, out of these two Huawei is for you. :) ",
            "date": "Answered April 30, 2019",
            "views": "281",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Ruslan Babura",
                    "user_href": "/profile/Ruslan-Babura"
                },
                {
                    "user_id": "Leroy Holiday",
                    "user_href": "/profile/Leroy-Holiday"
                }
            ]
        },
        {
            "author_info": {
                "name": "Abdul Hadi Mirxa",
                "href": "/profile/Abdul-Hadi-Mirxa"
            },
            "answer_text": "If you can’t answer this question for you, how do you even expect us to comment on it? The answer depends on personal choices. I am an iPhone user and I am very much used to it. I am not looking to change to Huawei but who knows someone may. Same is the case with you. Better analyze your own needs and you will find the answer for sure. ",
            "date": "Answered June 27, 2019",
            "views": "185",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Daniel Lee Shaw",
                "href": "/profile/Daniel-Lee-Shaw"
            },
            "answer_text": "Depends on what operating system you prefer ( IOS or Android ) personally I would choose the Huawei because it runs android (my preferred OS( and there phones look and perform very well but if you would prefer a more simple OS experience with good performance the iPhone would be good I would suggest either one of the X range or 11 range of iPhone (depending on what your willing to pay) ",
            "date": "Answered October 21, 2019",
            "views": "186",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Ruslan Babura",
                    "user_href": "/profile/Ruslan-Babura"
                },
                {
                    "user_id": "Randall Goetz",
                    "user_href": "/profile/Randall-Goetz"
                }
            ]
        },
        {
            "author_info": {
                "name": "Swagat Raj Pyakurel",
                "href": "/profile/Swagat-Raj-Pyakurel-1"
            },
            "answer_text": "It depends on what your requirements are. If you want a well built phone with necessary tech and ease of use and have a lot of money to spare, you might consider Apple. But if you want to be at the cutting edge of mobile phone technology and would like to fiddle with customization of your phone, and not eager to break a bank, Huawei would be the best option. ",
            "date": "Answered December 9, 2018",
            "views": "507",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Liran Cohen",
                "href": "/profile/Liran-Cohen-26"
            },
            "answer_text": "Whatever suits your needs: Are you more onto Privavy and security? Go iPhone, Versatility is what you seek? GO ANDROID! Nobody on quora can tell you what are YOUR needs. ",
            "date": "Answered October 6, 2019",
            "views": "168",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Sanjoy Chatterjee",
                    "user_href": "/profile/Sanjoy-Chatterjee-35"
                }
            ]
        },
        {
            "author_info": {
                "name": "Daniel McDonnell",
                "href": "/profile/Daniel-McDonnell-10"
            },
            "answer_text": "Thanks for your A2A Kris :) It depends on your needs. If you enjoy flexibility and using media features on a phone then a Huawei would be a better choice and if those don’t matter then a iPhone would be fine. Personally, I would choose a Motorola or LG phone because the specs are better and have found chinese phones to be subpar quality, ",
            "date": "Answered October 7, 2019",
            "views": "285",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Ruslan Babura",
                    "user_href": "/profile/Ruslan-Babura"
                }
            ]
        },
        {
            "author_info": {
                "name": "Akshat Kumar",
                "href": "/profile/Akshat-Kumar-188"
            },
            "answer_text": "Well both iPhone and Huawei provide some really great options in the flagship range. However, it would be totally up to your preference of opting for an iOS or going with Android.  Both the software platforms are poles apart and as someone who is hooked to Android smartphones, I feel switching to an iOS phone would be uncomfortable and vice-versa. So pick your option wisely. ",
            "date": "Answered May 31, 2020",
            "views": "243",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Ruslan Babura",
                    "user_href": "/profile/Ruslan-Babura"
                }
            ]
        },
        {
            "author_info": {
                "name": "Fredy Setiawan Chandra",
                "href": "/profile/Fredy-Setiawan-Chandra"
            },
            "answer_text": "For me, what you choice to buy is base with your need. If you think iPhone is already make your need is done so buy that. I Think for everything you need to use for everyday use, you can buy anything with your need right now or for future. ",
            "date": "Answered October 6, 2019",
            "views": "144",
            "upvotes": " View 1 Upvoter"
        },
        {
            "author_info": {
                "name": "Aman",
                "href": "/profile/Aman-1628"
            },
            "answer_text": "Hi, According to global market share 2020. iphones is at 2nd rank. and Huawei is that 3rd. Here is a amazing bar graph racing video of top smartphone companies by global market share from 2010 to 2020 (Monthly Basis).  Keep smiling. ",
            "date": "Answered May 19, 2020",
            "views": "182",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Afsar Ali",
                "href": "/profile/Afsar-Ali-334"
            },
            "answer_text": "The processor which is used in iPhone is very secure processor and this is very hard to hack that software. And the processor that is used in huawei smartphone is not much secure like iphone. iPhone use his own IOS in their phone. But huawei use android os in thari phone. iPhone are very costly but Huawei smartphone are cheap then apple . ",
            "date": "Answered June 3, 2019",
            "views": "267",
            "upvotes": " Answer requested by Jerin Xavier"
        },
        {
            "author_info": {
                "name": "Sergio Bendeck Paranky",
                "href": "/profile/Sergio-Bendeck-Paranky"
            },
            "answer_text": "No yet. They are still a long way from that. However their camera is better and they will have 5G before iPhone. ",
            "date": "Answered April 10, 2019",
            "views": "122",
            "upvotes": " Answer requested by Dylan Jacobs and Pedro Tejado"
        },
        {
            "author_info": {
                "name": "Harry Munday",
                "href": "/profile/Harry-Munday-1"
            },
            "answer_text": "For Video with Filmic Pro yes apple wins (does a good job with DNG photos too with 3rd party apps) For DNG Photo Huawei has a physically better sensor. Don't believe comparisons that are using JPEGs and under 100mbps 4K video. ",
            "date": "Answered April 3, 2019",
            "views": "882",
            "upvotes": " Answer requested by Dylan Jacobs"
        },
        {
            "author_info": {
                "name": "Osp Ram Kumar",
                "href": "/profile/Osp-Ram-Kumar"
            },
            "answer_text": "Buying either of these companies is risky at the moment. I personally feel Apple is overvalued and their recent stock crash has helped a bit but Huawei seems to have a better future. Of course, I'm assuming you have billions of dollars lying around and looking for financial advice on quota. ",
            "date": "Answered December 9, 2018",
            "views": "115",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Ian Goss",
                "href": "/profile/Ian-Goss"
            },
            "answer_text": "It’s the OS. ",
            "date": "Answered October 6, 2019",
            "views": "95",
            "upvotes": " View 1 Upvoter"
        },
        {
            "author_info": {
                "name": "Brian Gaudenti",
                "href": "/profile/Brian-Gaudenti"
            },
            "answer_text": "Break international laws, steal intellectual property illegally, spy on users… that sort of thing. ",
            "date": "Answered March 3, 2019",
            "views": "124",
            "upvotes": "0"
        }
    ]
}