{
    "title": "Are Gas Furnaces More Efficient Then Electric And Oil Furnaces? - Quora",
    "tags": [
        "Blast Furnace",
        "Natural Gas Furnaces",
        "Furnaces",
        "Energy Efficiency",
        "Heating",
        "Natural Gas",
        "Oil (fossil fuel)",
        "Household Appliances",
        "Oil and Gas Industry"
    ],
    "response": [
        {
            "author_info": {
                "name": "Tim Fierens",
                "href": "/profile/Tim-Fierens-1"
            },
            "answer_text": " Efficiency ratings, commonly referred to as Annual Fuel Utilization Efficiency (AFUE), measures and indicates the efficiency of your furnace’s combustion. In the AFUE standard, the higher the rating, the higher the efficiency of the unit is. Gas furnaces have efficiency ratings between 89% and 98%. Oil furnaces have lower efficiency ratings between 80% and 90%. And finally, electric furnaces have efficiency ratings of as high as 100%. This makes electric furnaces the most efficient heating system among the three types of furnaces, followed by gas furnaces then oil furnaces as the least efficient. However, efficiency is just but one factor of the many considerations to look out for between the heating systems. Check out these blogs, Gas & Electric Furnace Pros And Cons: All You Need To Know and Oil & Gas Furnace Pros And Cons: All You Need To Know, to help you come to an educated decision on which heating system is better for you. ",
            "date": "Answered November 28, 2019",
            "views": "39",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Peter Maddison",
                "href": "/profile/Peter-Maddison-8"
            },
            "answer_text": "By furnace do you mean heater, i’ve never heard of an electric furnace except in steel and aluminium making, Are you confusing “cost to run”with efficiency? The heating efficency of heating units is quite high. Electrical units are 95%+ efficient, gas heaters 85%+ and oil heaters 75 to 80% (due to heat up the flue) . Taking cost per unit of heat output electrical heaters would seem to be the most cost effective. But here comes the odd part, electricity is a secondary fuel or heat source. It has to be made and therfore can cost 1.5 to 2 times gas or oil per unit of heat delivered. In addition, oil fired heaters and equipment requires more maintenance and cleaning than gas appliances so increasing costs. Therfore gas fired equipment is cheaper to run than the other two systems. ",
            "date": "Answered April 14, 2019",
            "views": "19",
            "upvotes": "0"
        }
    ]
}