{
    "title": "Are flying cars dangerous? - Quora",
    "tags": [
        "Flying Cars"
    ],
    "response": [
        {
            "author_info": {
                "name": "Joe Shelton",
                "href": "/profile/Joe-Shelton-6"
            },
            "answer_text": "Are flying cars dangerous? Let’s cut to the chase. A flying car is, for all intents and purposes, really a “Roadworthy” or drivable airplane. Which means that unless it’s an unusual design, it’s going to be subject to all of the issues and constraints that airplanes are. Specifically; Different types of airplanes handle differently.Different types of airplane are more subject to unusual aerodynamic issues.Different types of airplanes are easier to learn to fly.Different types of airplanes are easier to fly that others.Different types of airplanes need longer runways for landing and taking off.Different types of airplanes have better safety records than others.And on and on…Most of the above is essentially the same thing — different airplanes fly differently. There’s no reason drivable airplanes shouldn’t have the same issues/constraints as airplanes. Oh, and BTW, unless the Federal Aviation Administration changes the Rules, while operating the “flying” aspect of the vehicle, you’ll need a pilot’s license. ",
            "date": "Answered March 22, 2018",
            "views": "215",
            "upvotes": " View 2 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Maximilliano Serna",
                    "user_href": "/profile/Maximilliano-Serna"
                },
                {
                    "user_id": "Evans Amekudzi",
                    "user_href": "/profile/Evans-Amekudzi"
                }
            ]
        },
        {
            "author_info": {
                "name": "Tony Vincent",
                "href": "/profile/Tony-Vincent-5"
            },
            "answer_text": "Do you mean a passenger vehicle that has wheels and can also fly? You could call them flycraft, or aircars, or even aircraft! They would be as dangerous as the drivers competence to drive (or perhaps pilot?) them. Given their lack of ability to stay in the air if they had mechanical trouble I imagine there would be a ‘fly-in-the-air’ or ‘Airgoodness Certificate’ of some sort, so would have to reach a higher standard of ‘fly-in-the-airness’ than ground based vehicles. All a bit of a dream really. ",
            "date": "Answered April 20, 2020",
            "views": "101",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Miguel Valdespino",
                "href": "/profile/Miguel-Valdespino"
            },
            "answer_text": "Energy usage. Flying takes much more energy than rolling. Most people would have difficulty affording the massive increase in fuel costs to go the same distance. More fuel or batteries mean a heavier craft, which further reduces efficiency.Licensing. The procedure to get a pilot’s license is much harder than getting a driver’s license. Many people cannot afford this.Difficulty of use. We have lots of bad drivers. When they need to work with a third dimension, this will be much harder.Coordinating traffic. Current air-traffic systems are not created for flying cars in urban areas. It would take a major overhaul to support this.Maintenance. Ground vehicle require much less maintenance than air vehicles. In part, this is because most failures in ground vehicles simply mean the vehicle has to be towed. Air vehicle failures often mean a crash landing.Safety issues. Current vehicle accidents are very dangerous. Flying vehicles have more potential energy because of gravity, and they will likely carry more fuel than ground vehicles.Landing/parking area. Air vehicles require a place to land and take off. They also require more space to park than ground vehicles.",
            "date": "Answered February 20, 2019",
            "views": "872",
            "upvotes": " View 6 Upvoters",
            "upvoters": [
                {
                    "user_id": "James Stainrook",
                    "user_href": "/profile/James-Stainrook"
                },
                {
                    "user_id": "Tierney Kuhn",
                    "user_href": "/profile/Tierney-Kuhn"
                },
                {
                    "user_id": "Jonas Rejanovinsky",
                    "user_href": "/profile/Jonas-Rejanovinsky-1"
                },
                {
                    "user_id": "Deeptanshu Singh",
                    "user_href": "/profile/Deeptanshu-Singh-7"
                },
                {
                    "user_id": "Abhishek Gattani",
                    "user_href": "/profile/Abhishek-Gattani-3"
                },
                {
                    "user_id": "Dhaval Shah",
                    "user_href": "/profile/Dhaval-Shah-152"
                }
            ]
        },
        {
            "author_info": {
                "name": "Glen Towler",
                "href": "/profile/Glen-Towler"
            },
            "answer_text": "It is the pilot who makes a aircraft dangerous. Flying cars wouldn’t be any different they have to certified by the FAA or CAA depending on which country they will be operated in. ",
            "date": "Answered April 19, 2020",
            "views": "43",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "BC Shelby",
                    "user_href": "/profile/BC-Shelby"
                }
            ]
        },
        {
            "author_info": {
                "name": "Cosmin Fence",
                "href": "/profile/Cosmin-Fence"
            },
            "answer_text": "The closest thing we have to flying cars are multicopters (drone-like vehicles). In this case there are multiple shortages: autonomy (time of flight is short - about 10-15 min), sound pollution, payload is very small. The other solutions for flying cars available have other issues as well: need of a runway for some, putting wings or propellers up procedure. All these makes it unpractical to use as a car and more suited as a hoby. ",
            "date": "Answered December 10, 2018",
            "views": "86",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Richard Hammersley",
                "href": "/profile/Richard-Hammersley-4"
            },
            "answer_text": "Well next time you’re out look at all the dickheads on the road doing dumb things. Now imagine they could fly and you would get some idea of the mayhem they would cause ",
            "date": "Answered April 19, 2020",
            "views": "22",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Paul Stockley",
                    "user_href": "/profile/Paul-Stockley"
                }
            ]
        },
        {
            "author_info": {
                "name": "Ed Martyniuk",
                "href": "/profile/Ed-Martyniuk"
            },
            "answer_text": "flying cars are not as dangerous as the people using them. Society is not ready for this type of local transit, try a hover car first? ",
            "date": "Answered March 22, 2018",
            "views": "22",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Mike Rommel",
                "href": "/profile/Mike-Rommel"
            },
            "answer_text": "Take the number of accidents on the ground, multiply that by probably 1000. They are only dangerous if they hit something, break down, have a driver who has a phone....... ",
            "date": "Answered March 22, 2018",
            "views": "12",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Andrew Mark",
                "href": "/profile/Andrew-Mark-16"
            },
            "answer_text": "Non-flying cars are already dangerous. Multiply that level of danger by at least 10 for a “car” that flies more than a foot above the road. ",
            "date": "Answered April 3, 2019",
            "views": "29",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "John Pick",
                "href": "/profile/John-Pick-5"
            },
            "answer_text": "Safe as houses as they say, no problems at all. The trouble comes when you put a human in who turns the key, bit like a machine gun fine without a human lethal with it. They’ll never come, apart from a toys for rich Arabs, always a few prototypes about. ",
            "date": "Answered April 20, 2020",
            "views": "39",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Colin Povey",
                "href": "/profile/Colin-Povey"
            },
            "answer_text": "Weight, getting licenses for the pilots (pilots and probably instrument rating, which takes about a year, and costs around $20,000), weight, Air Traffic Control, weight, landing places, weight, cost, weight, and oh yes, weight. ",
            "date": "Answered July 13, 2018",
            "views": "254",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Wayne Neath",
                "href": "/profile/Wayne-Neath"
            },
            "answer_text": "FAA regulations that will ground the vehicle before it has even left the garage. Under today’s aviation protocols, they can never be allowed to operate. ",
            "date": "Answered August 18, 2019",
            "views": "120",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Nicholas Ireland",
                "href": "/profile/Nicholas-Ireland-1"
            },
            "answer_text": "They will be once there are a lot of them about. ",
            "date": "Answered March 22, 2018",
            "views": "37",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "David Bäckman",
                "href": "/profile/David-Bäckman"
            },
            "answer_text": "Fuel consumption, pollution, traffic control of densely trafficked areas. ",
            "date": "Answered July 13, 2018",
            "views": "143",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Chris Huffman",
                "href": "/profile/Chris-Huffman-7"
            },
            "answer_text": "Flying drunk. ",
            "date": "Answered July 17, 2018",
            "views": "170",
            "upvotes": "0"
        }
    ]
}