{
    "title": "Are IP phones interchangeable between VoIP service providers? - Quora",
    "tags": [
        "Mobile VoIP",
        "VoIP Software and Services",
        "VoIP"
    ],
    "response": [
        {
            "author_info": {
                "name": "Jahmal Abbott",
                "href": "/profile/Jahmal-Abbott"
            },
            "answer_text": "Kinda. It’s something you really have to look into before deciding to make the switch between VoIP providers. In theory, as long as you have the appropriate firmware load on the phone that’s supported by the VoIP provider, there should be no issues using / bring your own IP phone. But also consider what the providers terms of service are. Let’s say you got VoIP phones from 10 years ago and can’t accept new firmware upgrades or not supported on the providers network, then you’re out of luck. Many of the cloud services use phones from vendors like Poly, Yealink and Cisco which can be used between providers which is good for interchangeability. Bottom line is to do your research. Have the conversation with a potential provider before assuming phones can be moved over. You’ll save yourself time and a headache by learning this upfront instead of the hard way. ",
            "date": "Answered June 24, 2020",
            "views": "54",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Lee Howells",
                "href": "/profile/Lee-Howells"
            },
            "answer_text": "Yes they, but assuming your login details have not been locked. The majority of IP phones seem to be extremely complicated to set up, but with the correct login details for whichever supplier you wish to use, you should be able to use any IP Phone. Most IP Phones will have a version of their user manual online, this should also tell you the IP address of the handset. The easiest way to find out if your handset is locked or not, is to try this first. If the factory login details do not work, then your previously supplier has a lock on the handset. If you do log in, just as your new supplier for their setup details. If you need help, head over to VoiceRules - Global Phone System as they have options for setting up remote handsets and phone systems ",
            "date": "Answered July 28, 2020",
            "views": "24",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Michael Amici",
                "href": "/profile/Michael-Amici-1"
            },
            "answer_text": "Yes and No H323 sets are generally proprietary, SIP set set are generally not however this not a hard and fast rule. A H323 set from Avaya Mitel or Cisco generally only on their PBX’s SIP set like Polycom and newer SIP set from Avaya Mitel and Cisco will work just find on any SIP based platform. The feature integration is easier if you are using the same PBX. I think that the major PBX suppliers seam to go out of their was to make SIP phone integration difficult but they do work. ",
            "date": "Answered May 5, 2018",
            "views": "196",
            "upvotes": " View 3 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Michael Anderson",
                    "user_href": "/profile/Michael-Anderson-28"
                },
                {
                    "user_id": "Bob Hannent",
                    "user_href": "/profile/Bob-Hannent"
                },
                {
                    "user_id": "Peter Ramirez",
                    "user_href": "/profile/Peter-Ramirez-9"
                }
            ]
        },
        {
            "author_info": {
                "name": "Bob Hannent",
                "href": "/profile/Bob-Hannent"
            },
            "answer_text": "I have seen phones or ATA converters which are locked to a certain provider or system but this is usually when they are provided subsidised by the provider. When they are simply sold to be used with the service I think it is rare for them to be locked and they are mostly compatible with each other. ",
            "date": "Answered May 8, 2018",
            "views": "96",
            "upvotes": " View 2 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Michael Anderson",
                    "user_href": "/profile/Michael-Anderson-28"
                },
                {
                    "user_id": "Peter Ramirez",
                    "user_href": "/profile/Peter-Ramirez-9"
                }
            ]
        },
        {
            "author_info": {
                "name": "Omona Tonny",
                "href": "/profile/Omona-Tonny"
            },
            "answer_text": "Yes if they are open standard SIP Phones. You could as well use analog phones (via ATA/IAD) with VoIP service providers. I use Huawei IAD, Grandstream ATAs, Yeastar ATAs, Dinstar ATAs and many others to convert from VoIP to Analog phones. ",
            "date": "Answered May 5, 2018",
            "views": "117",
            "upvotes": " View 2 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Bob Hannent",
                    "user_href": "/profile/Bob-Hannent"
                },
                {
                    "user_id": "Peter Ramirez",
                    "user_href": "/profile/Peter-Ramirez-9"
                }
            ]
        },
        {
            "author_info": {
                "name": "Benjamin Black Perley",
                "href": "/profile/Benjamin-Black-Perley"
            },
            "answer_text": "Mine are, but they were sold to work with any SIP provider. I wouldn’t count on that from any random pile of office desk sets you find at a junk store though. Confirm before you buy. ",
            "date": "Answered May 8, 2018",
            "views": "11",
            "upvotes": "0"
        }
    ]
}