{
    "title": "Are Japanese automotive engineers better than American automotive engineers? - Quora",
    "tags": [
        "Engineering in the United States of America",
        "Automobile Engineering",
        "Automotive Engineering",
        "Engineers",
        "Mechanical Engineers",
        "Automotive Industry",
        "Japan",
        "Cars and Automobiles"
    ],
    "response": [
        {
            "author_info": {
                "name": "Paul V. Willson",
                "href": "/profile/Paul-V-Willson"
            },
            "answer_text": "First, I challenge your assertion at least as far as Infiniti goes.  Nissan's overall reliability rating isn't that great, at least according to Consumer Reports.  Toyota and Lexus are a different matter.  Next, I think you need to look at a much broader picture before saying any differences are purely a matter of how good the engineers are.  There's a lot going on within a company like that which influences the quality of the end product.   Engineering, as much as anything, is about creating a technical solution for a problem or requirement that can be feasibly produced.  Feasible is mostly about cost.  If we look at the US manufacturers, it's clear that they have some serious cost of business problems.  If GM (as an example) has to pay benefits to retired employees that amount to thousands of dollars per vehicle produced (GM Unloads $26 Billion in White-Collar Pensions; Could Union Workers Be Next?), that's money they can't spend on better quality materials and still remain competitive in terms of market price. I think you need to look to management as much as anything if American cars really aren't as good as Japanese cars.  After all, it wasn't the engineers who chose to bring this abomination to market.  Finally, you seem to only be using maintenance costs and reliability as your criteria. At least when it comes to Toyota/Lexus and a few other Japanese brands, you may well be correct. However, there are other factors when it comes to judging if a car is good or not and one of those is performance.  I suggest going and test driving a Toyota Highlander or Camry against a Ford Explorer or Fusion. I'd certainly expect the Toyota products to be less repair prone over time, but the driving experience just isn't as good. Toyota seems to tune the suspensions and steering for people who are used to 75 Buicks.  ",
            "date": "Answered May 6, 2016",
            "views": "21",
            "upvotes": " View 9 Upvoters",
            "upvoters": [
                {
                    "user_id": "Matthew Strickland",
                    "user_href": "/profile/Matthew-Strickland-26"
                },
                {
                    "user_id": "Daniel Rogers",
                    "user_href": "/profile/Daniel-Rogers-57"
                },
                {
                    "user_id": "Andrew Shingange",
                    "user_href": "/profile/Andrew-Shingange"
                },
                {
                    "user_id": "Vương Hoàng",
                    "user_href": "/profile/Vương-Hoàng"
                },
                {
                    "user_id": "David Allen",
                    "user_href": "/profile/David-Allen-11"
                },
                {
                    "user_id": "Mark Kaplan",
                    "user_href": "/profile/Mark-Kaplan-9"
                },
                {
                    "user_id": "Shane Neary",
                    "user_href": "/profile/Shane-Neary"
                },
                {
                    "user_id": "Bill McDonald",
                    "user_href": "/profile/Bill-McDonald"
                },
                {
                    "user_id": "Arunraj A P",
                    "user_href": "/profile/Arunraj-A-P-1"
                }
            ]
        }
    ]
}