{
    "title": "Are there any free patent search software? - Quora",
    "tags": [
        "Patent Search",
        "Software Patents",
        "Software Recommendations",
        "Free Software",
        "Patent Law",
        "Patents",
        "Intellectual Property"
    ],
    "response": [
        {
            "author_info": {
                "name": "Iranna",
                "href": "/profile/Iranna-2"
            },
            "answer_text": "Yes, there are many free patent search software or database. But, free patent software has limitations to search and do not get consolidated data like a paid database. Free available software for patents and applications are. Google Patents-Google patent is one of the best free patent databases to search for patents. It covers patents filed in below-mentioned countries As per Google, patents from 1790 to 2019 are available. Number of granted patents are 11,197,621 and applications are 5,692,196.  If you are looking for patents which are filed in other than mentioned countries, please use that country database or paid database. 2. Espacenet Espacenet is the free database to search millions of patents and applications. It was developed by Europen Patent office with member states. This database provides patents and application of their member states only means for the only Europe region. It does not provide information about other countries.  3. Intellectual Property India (InPass -Indian patent advanced search system) inPass is India’s patent database to provide information about patents and application filed in India. Website is  4.Patentscope (WIPO) Patentscope is launched by the World Intellectual Property Organization. This database contains millions of patents and applications. You can also search for design patents.  5. USPTO Search for patents USPTO is United States Patents and Trademark Office to search patents filed in the US.  I hope this is useful for you and got whatever you are looking for. ",
            "date": "Answered June 9, 2019",
            "views": "105",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Steve Pearson",
                    "user_href": "/profile/Steve-Pearson"
                }
            ]
        },
        {
            "author_info": {
                "name": "Govindha Srinivas",
                "href": "/profile/Govindha-Srinivas"
            },
            "answer_text": "The exhaustive patent search should be carried out using (i) the technical keywords (and their related terms even if found peripheral to the technology) related to the invention in question (ii) classification codes related to the technology area (iii) combination of keywords and classification codes to narrow down the search (iv) search using chemical structures or smileys, if the invention relates to a chemical compound (v) use of limitations with critical dates if the case needs identification of a prior-art for the given invention. There are various open-source and subscription-based databases are available conducting the patent search. However, Google Patents, Patentscope ® and Espacenet are the preferred open source databases mainly preferred by the patent search professionals. Additionally, most of the patent offices from developed and developing nations have their own databases for patent search (E,g: CNIPL, IPDL, Depatisnet, etc.). We, at Khurana and Khurana & IIPRD offer exhaustive searches through best-in-class search methodologies to meet various requirements of the client. ",
            "date": "Answered July 31, 2020",
            "views": "4",
            "upvotes": "0"
        }
    ]
}