{
    "title": "Are there any drones that are completely silent? - Quora",
    "tags": [
        "AR Drone",
        "Personal Drones",
        "Silence",
        "Remote-Controlled Vehicles",
        "Unmanned Aerial Vehicles and Drones"
    ],
    "response": [
        {
            "author_info": {
                "name": "G Saunders",
                "href": "/profile/G-Saunders-2"
            },
            "answer_text": "A Mavic 2 is the quietest of the larger camera drones and anything like a Spark or Mavic Air, or even a Pro is lots louder. People can’t hear a Mavic 2 at a 150 or 200 feet, but everybody would be looking for an Inspire, which is a big, badass drone, or an Air which is small, but is obnoxiously loud. Some of the little Whoop class and larger drones are quieter than others. A TinyHawk Freestyle is quiet at 100 feet but much closer and it’s like a swarm of bees. And, they’ve only got several minutes battery life, enough for a race, and they don’t have good cameras, only enough to support FPV goggles. I don’t know of a ‘completely silent’ drone in production, although searching gets you to some experimental drones with some kind of ion propulsion, or maybe an ornithopter that’s interesting but no real solution yet. I don’t drones are a good way to sneak up on people or critters if that’s what you’ve got in mind, and ‘peeping’ into private areas with a drone is illegal in most places… ",
            "date": "Answered September 5, 2019",
            "views": "87",
            "upvotes": " View 2 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Richard Petek",
                    "user_href": "/profile/Richard-Petek"
                },
                {
                    "user_id": "Pavel Morava",
                    "user_href": "/profile/Pavel-Morava"
                }
            ]
        },
        {
            "author_info": {
                "name": "David Kitson",
                "href": "/profile/David-Kitson-1"
            },
            "answer_text": "Nothing is ever completely silent, but there are drones that glide that would be close to silent, even if they went right by your ear. There are also underwater drone “gliders” that can cross vast distances and obtain propulsion through variation in buoyancy and then move underwater through this. There are also airship drones that use helium for lift and low-speed propellers for control and propulsion - these are incredibly quiet - and there’s even some that swim through the air like a fish or a bird. Anything with a propeller will cause noise - because moving air around is noise - but a lot of newer quadcopters are quite quiet and you generally won’t hear them if they are a few hundred feet away. ",
            "date": "Answered September 6, 2019",
            "views": "49",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Richard Petek",
                    "user_href": "/profile/Richard-Petek"
                },
                {
                    "user_id": "Dominique Lavault",
                    "user_href": "/profile/Dominique-Lavault"
                }
            ]
        },
        {
            "author_info": {
                "name": "Gerry Nance",
                "href": "/profile/Gerry-Nance"
            },
            "answer_text": "There are radio controlled gliders, but a tethered inflatable can do real estate photography. ",
            "date": "Answered September 5, 2019",
            "views": "17",
            "upvotes": "0"
        }
    ]
}