{
    "title": "Are there smartphones with lead-acid batteries? - Quora",
    "tags": [
        "Lead Acid Battery",
        "Smartphone Batteries",
        "Acids",
        "Batteries",
        "Electronics"
    ],
    "response": [
        {
            "author_info": {
                "name": "Barry Hunter",
                "href": "/profile/Barry-Hunter-6"
            },
            "answer_text": "Not anymore. The first cell phones required lots of power hungry electronics and were installed in cars and trucks and operated off the vehicle battery system. 12V lead acid. They were by no means portable. The first cell phone call I made was from a handset mounted on the console between the front seats. All the electronics were in a good size black box in the trunk. It was amazing! The owner of the car was a telephone company technician and good friend who was part of the telco’s division assigned to enabling cellular service. It was voice service only. Advances in technology for both the handsets and networks cam came quickly. By that time I was working for a Canadian Ericsson agent. Ericsson was a world leader in cell network technology. We constantly received bulletins keeping us up to date on the technology. A couple of years later I worked for one of the first local companies to make use of cell phones. We had “the brick”. It weighed about 2 pounds and used a nicad battery. I would leave home in the morning with a fully charged battery and 2 charged spare batteries. At noon I would go back to the shop and exchange my fully or partially discharged batteries for fully charged ones. It was still voice only and the charges for both outgoing and incoming calls were high. Technology advanced very rapidly. The brick was replaced by flip phones and the network was advancing even faster. A huge enabler for the smaller and better handset was the lithium battery and it still is. Lithium provides a much higher energy density than any alternative even now. Lead acid lacks the power density of lithium or even nicad or NMH batteries. That does not mean lead acid batteries are obsolete. Far from it. There is no better technology for vehicle starting batteries. Everything you buy in a grocery store, restaurant, or any other kind of store has been moved time and time again by pallet jacks, forklifts, reaches, pickers etc powered by lead-acid batteries That will change but not for a long time. ",
            "date": "Answered February 4, 2019",
            "views": "507",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Alexander Lee",
                    "user_href": "/profile/Alexander-Lee-梅治-新太"
                }
            ]
        },
        {
            "author_info": {
                "name": "David Annett",
                "href": "/profile/David-Annett"
            },
            "answer_text": "No smart phones, but some of the first ‘portable’ cellphones used SLA batteries (Sealed Lead Acid). They looked like this:  The design of lead acid batteries never seems to have been scaled done to the size need for a smartphone but if they had they would have an operation time measured in minutes, not hours. ",
            "date": "Answered February 4, 2019",
            "views": "181",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Andrew Daviel",
                    "user_href": "/profile/Andrew-Daviel"
                },
                {
                    "user_id": "Alexander Lee",
                    "user_href": "/profile/Alexander-Lee-梅治-新太"
                }
            ]
        },
        {
            "author_info": {
                "name": "Murari Satya",
                "href": "/profile/Murari-Satya"
            },
            "answer_text": "Nope, most of the smartphone batteries are of Lithium-ion and some are Lithium-polymer, lithium ion takes off the major share because it has high capacity/g and safer than Lithium-polymer. Comming to lead acid battery that chemistry is not suitable for smartphone purpose bcoz of chances of acid leakage low capacity/g. ",
            "date": "Answered February 4, 2019",
            "views": "163",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Alexander Lee",
                    "user_href": "/profile/Alexander-Lee-梅治-新太"
                }
            ]
        }
    ]
}