{
    "title": "Are all technologies being developed or will they be mainstreamed in the next 5 years or so? - Quora",
    "tags": [
        "Time Travel",
        "Invention and Inventions"
    ],
    "response": [
        {
            "author_info": {
                "name": "Tim Ventura",
                "href": "/profile/Tim-Ventura-2"
            },
            "answer_text": " No, not even close. Technologies such as nuclear fusion aren’t expected to become commercially viable energy sources until 2030 at the soonest. Other technologies like SpaceX plans for Mars will likely take closer to a decade to become practical (although I hear rumors they’re pushing for a much tighter timeline). On the other side of the spectrum, the iPhone X that I bought last week will be outdated in a year - making all those “unboxing videos” we’re about to see hit YouTube will seem really antiquated. I could go on & on, but you get the point: technology development timelines vary depending on the technology and the company creating it. Some of the limiting factors here include the cost to develop technologies - which various companies may decide to spread over a multi-year period - as well as the availability of required enabling technologies. For instance, as I recall the new iPhone 8 has a chipset that supports gigabit LTE, but until those high-speed networks become available, you’re stuck using regular speeds. Even when gigabit LTE is available, apparently the iPhone 8 lacks the correct antennas to take advantage of it - so more than one enabling technology is required. From a business perspective, it does make sense to invest in technologies that can be commercialized within 5 years, so typically there’s a balance between the time to develop a technology and the time required to make some of that money back - both factors push in opposite directions, and meet somewhere in the middle. ",
            "date": "Answered November 3, 2017",
            "views": "17",
            "upvotes": " View 2 Upvoters ",
            "upvoters": [
                {
                    "user_id": "David Clark",
                    "user_href": "/profile/David-Clark-483"
                },
                {
                    "user_id": "Adam J. Adel",
                    "user_href": "/profile/Adam-J-Adel-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "John P Benfield",
                "href": "/profile/John-P-Benfield"
            },
            "answer_text": "Absolutely not. There's research and development going on that probably won't see any sort of direct mainstream application for decades, centuries or more. However, the things that we learn very often create branches and offshoots of R&D that do have more immediate commercial applications. (just google for all of the things that came out of the Apollo program for examples. That was discovery for the sake of discovery and it was a huge source of commercial opportunities. This happens again and again when we push the boundaries of the possible) Unfortunately, we live in a society that rarely thinks beyond the next few months, let alone the next few decades or centuries. So, funding for pure research and scientific investigation is rapidly losing support. The result is that we've already lost huge pipelines of new and unexpected opportunities and we're losing more every day. More and more breakthroughs have to come from more siloed commercial research. This really lends itself more to incremental improvements and less to the huge leaps in understanding. ",
            "date": "Answered November 5, 2017",
            "views": "184",
            "upvotes": " Answer requested by Johnathan MiltenBerger",
            "upvoters": [
                {
                    "user_id": "Steven Neville",
                    "user_href": "/profile/Steven-Neville-4"
                }
            ]
        },
        {
            "author_info": {
                "name": "Rick Chapman",
                "href": "/profile/Rick-Chapman-4"
            },
            "answer_text": "Don’t expect warp drive to come on line soon. Though when I was watching the original Star Trek, I thought matter transportation was the last thing we’d develop, yet, in a sense, it’s the first of the three big ST tech-calls that we’ve developed. rick ",
            "date": "Answered November 3, 2017",
            "views": "68",
            "upvotes": " Answer requested by Johnathan MiltenBerger"
        },
        {
            "author_info": {
                "name": "Mark R. Hill",
                "href": "/profile/Mark-R-Hill"
            },
            "answer_text": "Not sure what you’re asking. If you’re wondering whether all potential technologies that will ever be invented be mainstreamed in the next 5 years, I would say no. ",
            "date": "Answered November 3, 2017",
            "views": "18",
            "upvotes": " Answer requested by Johnathan MiltenBerger"
        },
        {
            "author_info": {
                "name": "Holland James Phillips",
                "href": "/profile/Holland-James-Phillips"
            },
            "answer_text": "Huh? ",
            "date": "Answered November 3, 2017",
            "views": "27",
            "upvotes": " View 1 Upvoter"
        }
    ]
}