{
    "title": "Are people stupid enough to actually believe the Russian hacking? - Quora",
    "tags": [
        "Federal Bureau of Investigation",
        "Trump Presidency (2017-21)",
        "Hackers"
    ],
    "response": [
        {
            "author_info": {
                "name": "Anthony A Chiello",
                "href": "/profile/Anthony-A-Chiello"
            },
            "answer_text": "It Not Stupid! To ask? was it or was it not, and why would not think it mite be true. RUSSIAN could be responsible The hacking did change the vote. But mite give a bigger lead in some place. As her emails where hacked and put out. News that was false washing posted. Where Trump some times tweeted things out. He did that. Where some one hacking and posting and writing things that are false is something else. Trump himself said keep up! meaning the hackers should keep putting stuff out. Im not saying Trump was paying or talking to RUSSIA or Putin. This doesn’t mean we need have a war with RUSSIA or should not be friendly with RUSSIA. Ronal Reagan said trust but verified meaning disable nukes. Have a good relation ship with RUSSIA is good and should be looked at. But when a government is hacking business governments and personally emails it criminal. Now saying that is just the truth. But are own government does the same thing! In fact Many times companies try to fix or create something. There forced give The USA government a key or some kinda way to hack in. We could have computer systems strong that could not be hacked. Apple and Microsoft along with other companies could create a system But if they did. We lose out. And if want know how it RUSSIA. It has to do with the most basic TCP/IP And even if they used a Proxy server to hide Many nations court system can get information and there services. It just not stupid to think it did or not happen. ",
            "date": "Answered January 8, 2017",
            "views": "66",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Todd Ness",
                "href": "/profile/Todd-Ness"
            },
            "answer_text": "Are people stupid enough to actually believe Russia DIDN’T try to hack as purported in the media. Of course they did, as did China, as did Wikileaks, as did anyone with tech savvy, loose ethics and an interest in the US election. Just as we do in other nations’ elections, I suspect. The extent to which Russian activities influenced the outcome and the extent to which Russia colluded with Trump, as recent unsubstantiated allegations state, is a legitimate source of great debate. But to suggest the Russians have no motive or means to hack into American resources is the height of naivete. ",
            "date": "Answered January 12, 2017",
            "views": "38",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Jaime Camhi",
                "href": "/profile/Jaime-Camhi-1"
            },
            "answer_text": "I’d love to see your evidence before answering this question. I do have to mention that when all intelligence agencies of the country agree on something like this, i’d like to believe they are not all in some powerful conspiracy. I do appreciate skepticism, but unless you have your own evidence as a result of your detailed investigation to claim what you are with your question, I tend to believe the agencies… at least more than I believe Trump, which I consider vastly more naive (or stupid as you called it) ",
            "date": "Answered January 8, 2017",
            "views": "70",
            "upvotes": "0"
        }
    ]
}