{
    "title": "Are iPhones very costly? How is it a reasonable price? - Quora",
    "tags": [
        "iPhones (product)",
        "Costs"
    ],
    "response": [
        {
            "author_info": {
                "name": "Achintya Srivastava",
                "href": "/profile/Achintya-Srivastava-14"
            },
            "answer_text": "I will explain you what is the reason behind iphones are so costly why we have to pay so much for an iPhone There was once a time when an iPhone was arguably much better than flagship Android device, largely because Android as an OS was still very new and just getting its bearings. Times have certaintly changed and now there are more than a few Android phones that are arguably better than the new iPhones. And outclassing the iPhone in a myriad of different ways (camera, battery, customization etc), the average iPhone still costs an arm and a leg more than the ‘equivalent’ Android phone. So why is Apple still able to command such an extravagant price for its phones? Comparing Apple Before we move further let’s compare Iphone price with anroid flagship The 4.7-inch iPhone 8 starts at $699 and the larger iPhone 8 Plus starts at $799 for the 64GB iPhone has 256 gb iphone option which is $100 more than 64 gb iphone in india iphone 8cost around 64000 rs for 64 gb iphone 8 and 74000 for 64 gb iphone 8 plus A basic pattern of $100 more for doubling the internal flash storage applies only By comparison, the 5.1-inch Galaxy S7 comes in a 64 GB it also supports a microSD expansion up to an additional 200 GB. Depending on where you bought it at launch, in india its cost 53000 rs for S8 and 57000 for S8 +Looking at the “base model” comparison, the iPhone 8 costs $100 more than the Galaxy S8 and the iPhone 8 Plus costs $100 more than the Galaxy S8 Edge. This is despite the Samsung phones having a higher resolution display, larger battery, double the internal storage, more RAM, microSD card slot, IP68 rating and so on.Without getting into the sticky specifics of whether the Galaxy S8 is a better phone or iphone 8 is better how is it that Apple can get away with charging a higher price for a phone that, at least on paper, is weaker in some respect?compared to Galaxy S8 It’s not just the new Galaxy S8 and S8 plus either, there are multiple other Android phones that cost less and have better hardware and features than the iPhone.  Still iphone is more costly because and apple can get away by charging what ever price they wants even though there are multiple Anroid phone that cost less and have better hardware and features than the iPhone. I will explain you why and why I think iphone price is justified 1.It just works If I had a money I would buy iphone for every time I’d heard this statement From an Apple loyalist also I have heard This statement from many people who want an iPhone and their dream is to own iphone I’d have enough money to buy a 64GB iPhone 8 Plus with an extended Apple Care warranty — every year for the rest of my lime It’s no secret that Apple’s “walled garden” ecosystem allows it to fine-tune its software and hardware almost perfectly, resulting in a very stable and fluid user experience. While Android has become increasingly smooth and stable in recent years, Apple still has a reputation for being easier to use and more reliable than Android  For all the freedoms and customization that Android allows, still there is a huge population of smartphone users that couldn’t care less about custom launchers, root apps, theme engines, custom ROMs and sideloading APKs. Android has always been the enthusiast’s OS while Apple has been the platform for those that don’t want to think about the platform.The only time most Android fans tend to hear why ios is from Apple owners is when they get an instant update or when there’s some big Android security scandal going on.this is definitely not a case with iphone as The recent battle between Apple and the FBI shows that Apple believes privacy and security are fundamental to the Apple brand. Apple is increasing the depth of its encryption. Android is behind on this. We've all become so lax about our security, as we desperately click \"I agree\" on things we really shouldn't agree to, that we just hope for the best if we think about it at all. Perhaps we still don't care enough. But with ever more personal information on our phones than ever, Apple is showing that security matters.iPhones and iOS are known to be built like tanks when it comes to security and encryption. The memory on the smartphone is encrypted so no one can hack into the hardware to go through the confidential information. Your fingerprint data, as well as the new Face ID data on the iPhone X, will be stored on the iPhone and not on a cloud server, keeping your data with you always. Is an experience that “just works” really enough to justify charging such a premium price tag for an iPhone? Yes as security matters to me a lot as now days we store so much personal data on our phone such as credit card information debit card information security matters to me a lot 2.The cult of Apple There is no denying that Steve Jobs understood the potential of cool. In many ways the iPhone’s success is largely based on it being the “cool” phone. Instantly recognizable, used by celebrities and with an extraordinary marketing budget, the iPhone has become the phone people wanted to be seen with. It was, and largely remains, the one gadget that everyone knows, even those not inclined to care about tech. The iPhone isn’t just a product, it’s a community. A lifestyle. A belief structure Resources and Information. many surveys when people were asked about thier opinions about LG G6 and Samsung galaxy S8+ edge Many of these people were iPhone users, and a number of them said they found it really impressive but would “never own an Android.(I am also a iPhone user and in reality I also find LG G6 and galaxy S8 + impressive but I would never switch to anroid from iphone) The influence of peer pressure, aspirational psychology and clever marketing has helped keep the iPhone at the top of its game. The influence of peer pressure, aspirational psychology and clever marketing has helped keep the iPhone at the top of its game for a long time, even if Apple has been accused of failing to innovate for years. Likewise, despite its high pricing, which works in its favor as the phone to own when you’ve “made it”, the iPhone isn’t the most expensive phone of all. But it is the most expensive phone in it class.  Android fans love to throw around the “Apple cult” tag and call iPhone owners iSheep and so on, but the blind adherence to Android is simply another side of the exact same As you know many people are self-professed Android fanboys, with all the vehement passion as their iOS brethren, so what makes them pay less likely to want to spend a thousand dollars on a phone than Apple fans? Are Android fans simply more discerning? More interested in the specs sheet, feature-set and open-source nature of the platform? Not necessarily, as the vast majority of Android owners I know are not part of the technical elite either. In my experience, most people come to Android because Android phones typically don’t cost as much as iPhones. Also anyone can buy anroid because due to their low cost anyone can buy them as they fits in every budget which person has decided to spend on smartphone you can find anroid phone ranging from Rs 3000 to 68000 Rs this definitely not case with iphone as iphone models are lot more expensive and their is not much choice 3. Price fixing Another part of the equation is Apple’s control over the pricing of its devices. They tend to remain at fixed prices throughout their lifetime and are rarely discounted. When a phone is discounted at Apple it will see a similar price drop at all retailers.Apple doesn't offer significant wholesale discounts, so there is less potential for retailers to undercut Apple itself.This is largely because Apple doesn’t offer significant wholesale discounts, so there is less potential for retailers to undercut the RRP on Apple’s own site. All this just adds to the sense of Apple products being exclusive and worth what Apple charges for them.  Apple has built on the cache that goes with selling the iPhone and uses this position to exert control over retailers stocking the product. The only way carriers can compete is by offering various subsidies or contract discounts on two-year service plans. Apple even reportedly offers cash incentives if retailers don’t try to offer the iPhone at the lower end of the pricing scale to challenge its competitors.This prevents Apple’s own high prices from seeming exorbitant. On the other hand, Android device pricing can fluctuate by hundreds of dollars, primarily because of the large wholesaler discounts offered and the aggressive pricing structure retailers are willing to offer in order to capture the market. Rather than allow retailers to make a profit out of discounting the iPhone, Apple essentially pays them not to. By maintaining high prices in the market place, Apple itself doesn’t have to compete with retailers offering its products for lower prices. So, rather than allow retailers to make a profit out of discounting the iPhone, Apple essentially pays them not to discount it. 3.Faith Success of any brand depend upon how loyal it's coustmer are towards it Another big factor in all of this is that Apple charges as much as it does because it can. In Samsung’s recent shake-up it inflated the price of the Samsung Galaxy series and many thought it would be game over. Not so, with the Galaxy S7and S8 selling very well despite their iPhonesque pricing (not discounting the fact that Samsung’s sales figures have repeatedly failed to meet market expectations and Samsung is still in the midst of declining smartphone sales generally).If other smartphone makers could get away with charging a thousand dollars for a phone and feel confident that it would be bought regardless, then they would absolutely mirror Apple’s pricing. Apple can do this for many of the reasons outlined above. As Tim Cook has said, Apple doesn’t want to sacrifice quality for price. If you drink the Kool-Aid, Apple would prefer not to release a product at all than release anything less than “magic”. And all that magic costs money. Apple has proven itself a capable smartphone maker and inflated that reputation with cultural cache and effective marketing. It has built a community around its products and convinced consumers that they are more than just gadgets. It has created ingenious pricing strategies to keep its prices high and used the additional profit to produce products that look and feel superior to the majority that use them. That faith – that an Apple product is worth what you pay for it – is backed up by the legions of Apple product owners that are absolutely Apple fanboys.(I am not a apple fan boy but still I love iphone a lot)This faith is the same reason retailers follow Apple’s orders on pricing. They believe that by stocking the iPhone and obeying Apple’s orders that they will benefit in the long run (which they typically do on the high profit margin accessories front). After all, many smartphone shoppers simply wouldn’t go into a store that didn’t have the iPhone alongside Android phones. 4. The cost of Research and Development and Manufacturing Although phone components are becoming cheaper day by day Apple tries to keep the technology inside the iPhone best and latest Apple puts in billion of dollar Now you may already know that Apple spend lot of money on research and development also apple build its iphone with premium material which cost more that's why iphone last longer compared to anroid 5.Works Great with all your devices I own an iPhone iPad as well as Mac trust me it’s best feature in iPhone I can quickly sync photos in my all devices answer a phone call on iPad or Mac send text messages from my other devices there is also one feature known as handoff suppose I am writing a mail on my Mac and suppose I got a urgent call and I have to leave house I can start writing same mail on my iphone from where I left on my Mac overall connectivity between these devices is something which anroid doesn't even match 6.Sharing a file from your iPhone to your Mac or iPad or other iphone users is also easier and faster thanks to Air drop feature This is built in service that sends file wirelessly directly to Mac or iPad even when there is no other wifi around.Iphone interacts with Macbook and simplest task I perform multiple times every day 7. Iphone warranty and best coustmer support Apple offers iphone warranty for 12 months and telephonic support upto 9 months trust me no company can match the best coustmer support Service given by Apple if your phone gets some problem apple replaces your iPhone at no additional cost Samsung or any company cannot match service provided by Apple I remember once my Samsung phone got some problems Samsung return my phone after 21 days 8.Worth More when you Resell The iPhone hold its value better than an anroid phone if you sell your one year old or two year old anroid flagship device you will often get much less than you paidWhen you sell an older iphone it easy to update offers almost doubt he value of an anroid phone that came out at same time With better build quality software support for longer duration and high demand that's why iphone offers a better resale value over Anroid flagship 9.Apple stores Customer support at an Apple Store is often a step above what Android manufacturers can provide over the phone or at Shop Apple Store staff help users who need To know about how to use iphone features you can get hands-on experienceof latest iPhone and Mac there are also classes where apple teaches people how to use iphone it's best feature there also people who will help you if you are facing problem with your iPhone if you live in western countries like me than apple stores are best Apple Store staff can also use some flexibility in helping users who need a replacement device and there are even out of warranty replacements that are significantly cheaper than buying an iPhone off contract. During Hurricane Harvey we even saw Apple Stores offering free replacements to many people with broken iPhones. 7.Ease if use over anroid The iPhone is still easier to pick up and use without issues than most Android phones on the market.Google delivers more ease of use than in older versions of Android, but not all phones run these updates yet. Samsung has come a long way in making Android easier to adopt with an Easy Mode, but there are still issues.While helping friends and family with iPhone and Android there are more instances where I need to help turn a setting on again on Android than on iPhone and it takes users longer to understand how something works.This isn’t an issue for power users, but for the average user who doesn’t want settings to change randomly or for WiFi or Cellular to randomly turn off crippling functionality it is a real Issue my grandpa is using anroid phone he found anroid very difficult because there are much more features in anroid which he even does not use these features in day to day life this is not case with iphone anyone can learn how to use iphone within few seconds 9.iMessage, FaceTime & FaceTime Audio Apple makes it easier to communicate with other iPhone and iPad owners with a trio of services that allow for fast and simple connectivity.iMessage allows users to send longer messages at one time and the messages can go to any Apple device that user owns iMessage is better than many messaging application like hangout whatsapp FaceTime delivers an excellent way to video chat. Unlike Hangouts, it is built into the phone app so it is easy to switch from phone call to video call with the push of a button.FaceTime Audio also helps iPhone users call when coverage is spotty, by using data to make an audio call. FaceTime Audio calls also sound better much better than a normal call and work when you have a poor cell signal, but still have wifi 10.much much faster If you’re thinking of buying the iPhone 8, iPhone 8 Plus or iPhone X, know that the A11 Bionic chip inside blows away anything from the Android camp. Not only did this processor pace Apple’s flagship to huge wins in synthetic benchmarks such as Geekbench 4 and 3DMark; it also ran circles around the likes of the Galaxy Note 8 and the Galaxy S8 when doing things like editing 4K video and opening large files.This speed difference should also make playing the most intensive games, and especially enjoying demanding augmented-reality apps, a smoother experience. 11.The best cameras Samsung held the camera phone crown for nearly two years, but Apple has vaulted to the top spot, thanks to the cameras inside the iPhone 8 and iPhone 8 Plus. (The iPhone X will have a dual-lens setup similar to the iPhone 8 Plus'.)Apple’s flagship takes more vibrant photos with more vivid and more natural-looking colors. It especially excelled in sunlight, where the Note 8 washed out some images.There are plenty of great Android phone cameras, but at least for now, the iPhone is the champ. 12.Better hardware and software integration The 3D Touch display first introduced with the iPhone 6s and featured in all but one model released since then is smart enough to sense pressure, allowing you to take quick actions from the home screen just by long-pressing on an app icon. The new Portrait Mode on the iPhone 8 Plus can add sophisticated lighting effects with a tap. And the iPhone X can scan your face to log you in, even if you grow a beard and start wearing glasses.These are just a few of the examples of how Apple’s hardware and software designers work together to make the iPhone better than Android. And it’s no coincidence that Google recently spent over $1 billion to acquire HTC’s smartphone business. It wants to re-create that same magic by better integrating its mobile OS with its devices. 13.No bloatware! It's not a good sign for prospective Android phone buyers that They see bloatware Samsung and others have gotten better at minimizing the pain for users by lumping all bloatware into a single folder, but it's still just crap taking up space on your phone.You won't find a single piece of software preloade on an iPhone, making for a clean out-of-the-box experience. Apple does include some apps you might not want or need, like Apple Watch, but it has much more restraint than other manufacturers when it comes to bundling its own stuff. And on iOS 11, you can at least disable built-in apps you don't need. 14.iPhone Is Consistent. Android Is All Over The Place. By controlling the number of different phones it releases, Apple creates a consistent design, with consistent operating principles and consistent performance (mostly). Android phones are so different from each other that Google has now, lamentably late, begun to advertise Android by saying: \"Be Together, Not The Same.\" However, there is no real togetherness among Android phones. There are just too many of them and they're all of such differing quality. 15.the feeling just feeling Samsung has made great progress, especially with its Galaxy S7 Edge. The attention to detail, however, both in hardware and software is still edged by Apple. Apple's progress has undoubtedly slowed. Its phones are in danger of seeming samey. But the whole Apple ecosystem, once it has you in its grasp, is hard to leave. 16.Better design and best fingerprint sensor With a few exceptions, like the gorgeous HTC One and Xiaomi Mi Note, there aren't many great-looking Android phones out there. Many are chunky and plasticky.The iPhone consistently has had a better design than Android phones.Some Android phone makers like Samsung and HTC have tried adding fingerprint sensors to their phones, but none of them are as useful and accurate as the TouchID sensor on the iPhone. A few years ago, Apple bought a company called Authentec that makes the best fingerprint sensors for mobile devices. No one else has been able To beat touch I'd 17.Fixed iOS choice spares Android-like confusion Sure iPhones don’t have a lot of variety when compared to Android devices, but with the iPhone’s currently in the market, you really cannot go wrong, as there are only two to three iPhone models that are launched every year. And the only way these devices differ is in screen size, storage space and the camera modules they’re loaded with. Compare this with Android, and you get a ton of options with different specifications and hardware options to totally confuse an innocent buyer, which can at times make him take the wrong decision. 18.The hardware and software integration Apple manufactures not only the software but also the hardware of its devices. This gives Apple a striking edge as it can then create a software experience to run in a fluid synchronisation with the hardware. This, in turn, helps it to be far more optimised than Android, as firstly the hardware is made by brands like Qualcomm and MediaTek, and not Google. Secondly, the OS has to be made generic for numerous devices and brands, and they also add their own flavour to the smartphone, like how Samsung has its own skin, so does HTC, LG, and other brands. 19.App Store is home to quality apps Apple has a stringent process of adding a specific application to the App Store. This includes a set of quality and security checklist to make the app not only responsive but also good to appear on the screen. Due to this stringent scrutiny, the apps that you get to use on an iPhone are much better in quality than their Android counterparts. 20.3d touch goodness Apple uses 3D Touch which allows the device to add separate touch inputs which enable micro-menu options. 3D Touch senses your pressure sensitivity on the touch screen and enables different input options. This has been very beautifully adopted by app developers too, and something Android hasn’t really inculcated into its devices. Sure, Android has the long press menu option, but 3D Touch is far more responsive. The only way you can really feel the goodness of 3D Touch is by actually experiencing it. These features adds to selling of iphone in large no people are ready to pay huge amount for iPhone because of apple brand reputation brand loyalty and there passion to change to change smartphone market by making revolutionary in every release of iphone Is iphone Costly? iPhones are expensive relative to many Android phones for a couple of reasons—first, Apple designs and engineers not only the hardware of each phone, but the software too. Apple crafts and controls the entire user experience. Historically, competitors like Samsung have built the handsets, and used Google’s Android operating system to run them. Carefully integrating software and hardware is more resource intensive, and thus, naturally, raises the price of the phone.Apple also continues to position the iPhone as a higher-end product, which, while keeping it from being a major player in some major developing markets like India, allows the company to reap much higher profit margins on each phone than its competitors. The gambit has worked, thus far: the iPhone is the most profitable product in modern history.I’d add another point, though. When you consider everything that goes into the iPhone, and the fact that there are dozens of metals that must be sourced from every corner of the globe, manufactured at scale by hand, each at sometimes a rather high human cost, and that there are scores of highly complex component parts like gyroscopes, accelerometers, multitouch sensors, Gorilla Glass, and incredibly compact and powerful A-series processors, the iPhone is, in another sense, rather inexpensive. It can do more than many 5-year-old computers can, for a fraction of the price. Is iphone price reasonable? Let's be real here: the iPhone has never, ever been cheap. Even when it debuted in 2007, it started at the then-eye-watering price of $500. The thing is, many countries iphone are sold in contract so people in those country can buy iphone at reasonable prices so they don't worry about but here in india we use to buy unlocked phone because in india there is no contract system fact is iphone X cost is 1000 dollars in US so people are saying it lot expensive but we. The iPhone X made waves not just because of its new edge-to-edge OLED display but because it's the most expensive iPhone that Apple has ever made. Many folks across the world wide web were heard complaining about its primo $999 starting price. The thing is that, if you know how much phones cost, $999 isn't that expensive.We Indians use to pay more than 1000 dollars for every iphone for eg I have purchased iphone 7 when I was in india at 92000 for 256 gb which is more than price of iphone X 64 gb for me (i have already bought my iPhone X) but if I have bought iphone X from India iphone X is cheaper to me as it cost 4000 less to me than my previous iPhone which I have purchased at 92000 Rs A couple of years ago, my friend who lives in US has signed up for Apple's iPhone Upgrade plan he told me when he bought a shiny new iPhone 6S. he went with this payment program because he simply couldn't justify the out-of-pocket cost of a top-of-the-line 128 GB iPhone 6S, which would have been $849 (plus you get AppleCare+ for the duration of the two-year loan period). With the Upgrade Program, he was able to get this phone for only around $40 a month. Save for one other model (the 128 GB iPhone 6S Plus), this was the most expensive iPhone on sale in late 2015 when he bought it.Today, iphone what it'd cost to buy into the latest and greatest that Apple has for 2017. A brand-spanking-new 64 GB iPhone X costs him $49.91 per month—only about $10 more than my top-shelf 6S—under the same Apple payment plan. If you want more storage space than that, the 256 GB iPhone X is $56.16 a month. That's … not very much for such an impressive phone. In india also there are such offer such as flipkart upgrade programs and jio iphone X 70 percent money back guarantee with this offer iphone X will cost you 26777 rs Wrap Up Now, don't get me wrong—the iPhone is a premium device and it's not attainable for everyone. Nor do I recommend that most shoppers spring for the super duper iPhone either (for most people, the iPhone SE is an awesome, affordable device). But, in the scheme of things, the iPhone X isn't ridiculously priced for what you get.Apple's offering a phone that seems a bit nicer and if you break it down into 24 monthly payments, it's not much more money. It's not worth giving up real necessities such as food, water, and shelter … but whether you buy it from Apple or purchase it on a carrier plan, the month-to-month reality is that it's only a bit more than any other fully loaded iPhone from years past.In all honesty, I don’t know why Apple can get away with charging more for devices(even thoughI am apple fan)iphone Have less features and objectively poorer than many other comparable products in multiple ways. A large part of it is certainly that those that happily pay as much as they do for an iPhone don’t typically tend to feel that they’ve ever been “ripped off” (or would never admit it to their friends if they did). They feel like the service, the product, the cultural cache and so on are justified by the price There’s also the consideration that people with higher incomes typically tend to gravitate toward the iPhone, whether as a status symbol or simply because a more expensive phone is more suited to their disposable income. Apple can charge a lot, so they do. Apple tightly controls the market pricing of its products and it works. People appreciate the build quality, experience and community. Apple has a reputation for being cool or innovative (even if it’s not particularly either any more). At end apple will continue to sell its iphone at premium price even though it's high pricing apple fan will keep On buying iphone no matter how expensive iphone is But, in the scheme of things, the iPhone isn't ridiculously priced for what you get.Apple's offering a phone that seems a bit nicer and if you break it down into 24 monthly payments, it's not much more money.but remember It's not worth giving up real necessities such as food, water, and shelter …Remember iphone is not made for every one if you want iphone you have to pay premium price for it don't get me wrong for me Iphone are costly but it's reasonable because apple is only company which is known for innovation rest company are following apple so iphone price is pretty justified as iphone has changed my life a lot its depend on you you want to pay premium price for iPhone or buy anroid phone which suits in every budget Suggestions are welcomed hope my Answer is helpful to you. ",
            "date": "Answered November 8, 2017",
            "views": "666",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Atchutha Raman",
                    "user_href": "/profile/Atchutha-Raman"
                },
                {
                    "user_id": "Shri Bajpai",
                    "user_href": "/profile/Shri-Bajpai"
                }
            ]
        },
        {
            "author_info": {
                "name": "Noaman Khalil",
                "href": "/profile/Noaman-Khalil"
            },
            "answer_text": "How you might ask ?well here below are some listed reasons . Did you know Apple has a 14 day exchange & return policy wherein you can return your device for a 100% cashback if you don’t like itThe phone retains its value unlike the competitors devices .It offers a superior user experience in contrast to its competitors .It does more with less , it is significantly more efficient wherein you get an entire day of usage .Superior camera quality , the iPhone 8plus scores a 99/100 while an average competitor would be in the 80th percentile range .Storage , the phones storage is much faster & higher in capacity than most devices .Powerful IWork apps which are free such as iPhoto , iMovies & GarageBand .Powerful a series processors . Apple has one of the highest benchmarking silicon in the industry , the iPhone sets the bar for performance .The list of reasons go on . ",
            "date": "Answered November 30, 2017",
            "views": "179",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Jitesh Jeswani",
                "href": "/profile/Jitesh-Jeswani-1"
            },
            "answer_text": "Well iphones are costly because it’s luxury. Just as a Mercedes S class or a Rolls Royce. You get the best in everything. Same way iPhones are always the market leaders in smartphones. And with the launch of iPhone 10 or X; it proved that it is truly the best smartphone manufacturer. Their service, their reliability, their quality everything is top level. No other company offers or can offer that as on today. ",
            "date": "Answered November 7, 2017",
            "views": "47",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Ronit Patel",
                "href": "/profile/Ronit-Patel-27"
            },
            "answer_text": "Hello, it’s Not about the price but it’s about the experience that you get with iPhones best hardwares and seamless software integrity and privacy is main point for this long term usable device also you will get the every updates, as many people believe that iPhones are high price but they give you sure something that you will use in other countries they have high income compare to India that means they have higher purchase power and that means they have easy EMI and loan system too that’s why they said affordable. ",
            "date": "Answered November 9, 2017",
            "views": "105",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Vasudev Menon",
                "href": "/profile/Vasudev-Menon-4"
            },
            "answer_text": "Apple aims at high end market and not at all budget oriented. You can buy an iPhones from the US or Middle east for lower rate than Indian price, you get 1 yr. warranty. So, it is a win-win situation. Apple makes money from their hardware so they price it aggressively and take pride that hardware and software co-exists very well and long lasting than other manufacturers. ",
            "date": "Answered November 9, 2017",
            "views": "78",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "John Britto",
                    "user_href": "/profile/John-Britto-172"
                }
            ]
        },
        {
            "author_info": {
                "name": "Rushikesh Jagtap",
                "href": "/profile/Rushikesh-Jagtap-11"
            },
            "answer_text": "This is very silly question…… if you want better optimisation,better service,and most important states symbol then you have to pay extra…..iPhone is not a toy like android ",
            "date": "Answered November 10, 2017",
            "views": "27",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Surya",
                    "user_href": "/profile/Surya-948"
                }
            ]
        },
        {
            "author_info": {
                "name": "Joe Belkin",
                "href": "/profile/Joe-Belkin"
            },
            "answer_text": "Apple sells about 235 MILLION every year and has sold over 1 BILLION phones so clearly prices are within a price range that interests people. ",
            "date": "Answered June 26, 2019",
            "views": "22",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Deep Das",
                "href": "/profile/Deep-Das-141"
            },
            "answer_text": "The price of iPhones are highly costly in India comparing to other countries, well there are even more countries where it is more costlier than India, according Apple India, the customs charges and the taxes which are levied while importing the products are very high, which results in making the iPhones costlier in the market. ",
            "date": "Answered November 6, 2017",
            "views": "55",
            "upvotes": "0"
        }
    ]
}