{
    "title": "Are handheld consoles obsolete now that cell phones are capable of playing games? - Quora",
    "tags": [
        "Console Games",
        "Video Game Consoles",
        "Games",
        "Video Games"
    ],
    "response": [
        {
            "author_info": {
                "name": "Njeru Richard",
                "href": "/profile/Njeru-Richard-1"
            },
            "answer_text": "Not by a long shot, and here's why. Using the example of a PS4 and a PC of similar power, a cross platform title will look and perform much better on the PS4. Do you know why? The PC version is a jack of all trades. It is supposed to run acceptably on many variations of PC's, of which ours is just one of potential hundreds. The PS4 version is a master of one, optimized for the PS4 and the PS4 alone. The same I would say goes for smartphones and handheld consoles. So no, handhelds aren't becoming obsolete any time soon. Why? Because game developers are constantly craving quality, optimized hardware to develop for. That was reason number one. Here's reason number two. Smartphones aren't built for intense gaming for long periods of time. Light casual games (think candy crush and fruit ninja) are fine. These are easy on the cpu and battery. More intensive games (real racing 3 and beach buggy for instance) make the CPU work harder (producing more heat therefore necessitating thermal throttling which lowers the performance of the device at that instance) and draw more current from the battery, also making it heat up. The point I'm trying to make is this. Smartphones aren't made for gaming. Yes they can be used as gaming devices, but that is just a by the way and not a core function. A third reason I should probably add is support. I'll use Nintendo as an example. The Wii was released in 2006, and enjoyed consistent quality support up to(and probably for some time after) 2012 when it's successor was released. That is 6 years of solid support. Can you name any smartphone manufacturer that can support a single phone for that long, especially with the current trend of a new flagship every year? Last but not least is price. The switch for instance costs 299 USD. The premier smartphone gaming device currently (2018) costs upwards of 1000USD. You do the math. No, handheld consoles are not becoming obsolete anytime soon. ",
            "date": "Answered October 1, 2018",
            "views": "347",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Dierra Godfrey",
                    "user_href": "/profile/Dierra-Godfrey"
                },
                {
                    "user_id": "Charles Serrano",
                    "user_href": "/profile/Charles-Serrano-7"
                }
            ]
        },
        {
            "author_info": {
                "name": "Francis Dickinson",
                "href": "/profile/Francis-Dickinson"
            },
            "answer_text": "Super Mario Bros came out for the Nintendo Entertainment System in 1985, and was a masterpiece that is still fun to play even now - and 1988’s Super Mario Bros 3, 30 years ago was even better. Nintendo has also produced a Mario game for the iphone; it’s called Super Mario Run and you can see it being played below.  Due to the limits on precision of the inputs available on the iPhone Super Mario Run is designed so that the only thing you really do with Mario is press the screen to have Mario jump. Can cell phones have more complex games than that? Of course - but they don’t come with console style controllers and aren’t very good at pretending to be consoles. There is an option available; a number of companies (including Apple with the gamevice) have taken to producing add-ons to fit mobile phones that have gamepads and digital buttons attached. This is better for classic console games than an unadorned smartphone, but the install base is low enough people aren’t designing games for them. Also games burn through smartphone batteries - and smartphones don’t (unlike the Switch) have fans, so heat issues are more serious. No handhold consoles aren’t obsolete. That said, I’ve said before and I’ll say again that Nintendo could make an absolute mint if they produce the Switch Mini that can also work as a smartphone with some of the common smartphone apps. ",
            "date": "Answered October 1, 2018",
            "views": "647",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "João Guilherme Madeira Araújo",
                    "user_href": "/profile/João-Guilherme-Madeira-Araújo"
                },
                {
                    "user_id": "Sarthak Shrivastava",
                    "user_href": "/profile/Sarthak-Shrivastava-16"
                }
            ]
        },
        {
            "author_info": {
                "name": "Anthony Nelson Echevarria",
                "href": "/profile/Anthony-Nelson-Echevarria"
            },
            "answer_text": "No, not in the slightest. Cell phones simply can’t do what a console can. Yes, even smartphones. You try playing Persona Q: Shadow of the Labyrinth on a cell phone. Even Mario, as far as I can tell, can’t be replicated; it has to be toned down, made easier and simple to control, in order to work. What the hell kinda replacement for consoles is that? Cell phones aren’t really meant to play complex games. They’re meant to play frivolous casual games, that you can pass the time with when you’re stuck at somewhere else. And yet, some of my best experiences on a handheld have been playing games like Silent Hill: 0rigins, and Persona 3 Portable, and the old Game Boy games. Until smartphones get an actual control scheme, with buttons (or at least the digital approximation of ones), and an analog pad/stick, you ain’t ever gettin’ rid of handheld consoles! ",
            "date": "Answered October 1, 2018",
            "views": "200",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Sarthak Shrivastava",
                    "user_href": "/profile/Sarthak-Shrivastava-16"
                },
                {
                    "user_id": "Nicholas Wee",
                    "user_href": "/profile/Nicholas-Wee"
                }
            ]
        },
        {
            "author_info": {
                "name": "Praveen Kn",
                "href": "/profile/Praveen-Kn"
            },
            "answer_text": "Consoles are cheaper than a cellphone which can handle real gaming experience. buying a PS4, XBOX, PS Vita, Nintendo Switch will be cheaper with lot of gaming options than buying an IPhone X, Galaxy 9 etc. for gaming. ",
            "date": "Answered October 1, 2018",
            "views": "126",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Sven Perlberg",
                    "user_href": "/profile/Sven-Perlberg-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Esme Rylan",
                "href": "/profile/Esme-Rylan"
            },
            "answer_text": "Nope, because touch screen controls alone can never substitute for the variety of control methods available on a dedicated handheld. Just look at WarioWare Gold for an example. ",
            "date": "Answered October 1, 2018",
            "views": "49",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Ben English",
                "href": "/profile/Ben-English-5"
            },
            "answer_text": "Uh…. No ",
            "date": "Answered October 1, 2018",
            "views": "30",
            "upvotes": " Answer requested by Sven Perlberg"
        }
    ]
}