{
    "title": "Are all the real species shown in the Jurassic Park franchise from the Jurassic period? - Quora",
    "tags": [],
    "response": [
        {
            "author_info": {
                "name": "Matthew Haynes",
                "href": "/profile/Matthew-Haynes-1"
            },
            "answer_text": "No. Brachiosaurus, Dilophosaurus, Stegosaurus, Mamenchisaurus, Compsognathus, Ceratosaurus, Apatosaurus, and Dimorphodon are all Jurassic. Velociraptor, Parasaurolophus, Triceratops, Tyrannosaurus, Gallimimus, Pachycephalsaurus, Ankylosaurus, Pteranodon, Mosasaurus, Spinosaurus, and Corythosaurus are all Cretaceous. Jurassic is used simply because it is a shorter, easier to pronounce, and cooler-sounding word than Cretaceous is. Words beginning with J also I think have s rather exotic sound to them, something Michael Crichton wanted to employ when he named his book/fictional amusement park. He may have also been subtly conveying how little the creators knew about what they were doing— both the novel and the first film are better and deeper than they are often given credit for. But in any case, most of the iconic dinosaur and pterosaur species are from the Cretaceous. ",
            "date": "Answered November 24, 2017",
            "views": "291",
            "upvotes": " View 7 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Brody James Handwerk",
                    "user_href": "/profile/Brody-James-Handwerk"
                },
                {
                    "user_id": "Daniel Dvorkin",
                    "user_href": "/profile/Daniel-Dvorkin-3"
                },
                {
                    "user_id": "Pablo Worcel",
                    "user_href": "/profile/Pablo-Worcel"
                },
                {
                    "user_id": "Andrew Givens",
                    "user_href": "/profile/Andrew-Givens-1"
                },
                {
                    "user_id": "Johnny Yelnats",
                    "user_href": "/profile/Johnny-Yelnats"
                },
                {
                    "user_id": "Hamza Shaikh",
                    "user_href": "/profile/Hamza-Shaikh-3"
                },
                {
                    "user_id": "Omar Roncal",
                    "user_href": "/profile/Omar-Roncal"
                }
            ]
        },
        {
            "author_info": {
                "name": "Daniel Lindsäth",
                "href": "/profile/Daniel-Lindsäth"
            },
            "answer_text": "Are all the real species shown in the Jurassic Park franchise from the Jurassic period? Nope. The T-Rex is from the Cretaceous period, as were the Velociraptors. Of course, Velociraptors don’t look like in the movies at all. They were about the size of a turkey, not the human height monsters we all know and love. They also had feathers, but there are in-universe reasons why they don’t in the movies. I’m sure several of the other dinosaurs and plants weren’t from the Jurassic either, but they weren’t meant to be either. “Jurassic Park” was just a cool name, not meant to imply that everything in there was from the Jurassic period. ",
            "date": "Answered November 24, 2017",
            "views": "108",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Pablo Worcel",
                    "user_href": "/profile/Pablo-Worcel"
                },
                {
                    "user_id": "Simon Meisinger",
                    "user_href": "/profile/Simon-Meisinger-1"
                },
                {
                    "user_id": "Omar Roncal",
                    "user_href": "/profile/Omar-Roncal"
                }
            ]
        },
        {
            "author_info": {
                "name": "Matthew Gleeson Dunn",
                "href": "/profile/Matthew-Gleeson-Dunn"
            },
            "answer_text": "No, in fact most of them are not. The Tyrannosaurus Rex, Velociraptors and the Triceratops are both from the late Cretaceous Period, which was actually about 54 million years after the Jurassic Period. Some species, though, were from the Jurassic Period, such as the Dilophosaurus. So, Jurassic Park really had a mixture of species, from many different time periods. I assume it was called Jurassic Park because it just sounds better and is easier to pronounce. I mean, Cretaceous Park really doesn’t have a ring to it, does it! ",
            "date": "Answered November 25, 2017",
            "views": "95",
            "upvotes": " View 2 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Damon Verbeyst",
                    "user_href": "/profile/Damon-Verbeyst"
                },
                {
                    "user_id": "David Currey",
                    "user_href": "/profile/David-Currey"
                }
            ]
        },
        {
            "author_info": {
                "name": "Reid Kenney",
                "href": "/profile/Reid-Kenney"
            },
            "answer_text": "No not at all the Tyranosaur lived in the Cretaceous the raptors were late Cretaceous and others were also spread through the three periods ",
            "date": "Answered November 24, 2017",
            "views": "6",
            "upvotes": "0"
        }
    ]
}