{
    "title": "Are satellites visible at night? - Quora",
    "tags": [
        "Satellites",
        "Outer Space"
    ],
    "response": [
        {
            "author_info": {
                "name": "Brett Kuntze",
                "href": "/profile/Brett-Kuntze"
            },
            "answer_text": "Satellites orbit between 250 to 2000 miles above us . Geostationary and geosynchronous ones are much higher at 25,000 miles . They are seen usually when reflected by the Sun, so the lower satellites reflect up to three hours before sunrise or after sunset as they see the sun rise or set before or after we do. . Geo ones reflect the sun constantly as the sunlight pass over Earth easily to reach the highest ones but they are very tiny and very dim. They appear to be moving against the stars because of Earth rotation in synch to those geo high ones. when you are looking at the stars with a telescope, you will see those lower satellites zipping by and you can turn your telescope to follow them if you want to. They move pretty fast at around 5 to 8 or 9 kilometers a second! ",
            "date": "Answered July 12, 2020",
            "views": "138",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Paul McQuesten",
                    "user_href": "/profile/Paul-McQuesten-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Nelson Cruz",
                "href": "/profile/Nelson-Cruz-9"
            },
            "answer_text": "Yes. The International Space Station is the easiest to see with unaided eye. The much smaller Chinese space station Tiangong-2 was also visible, before it was deorbited in July 2019. Iridium satellites where also famous for their “flares” when reflecting the Sun, but I don’t know if there are any left. During 2019 SpaceX launched 60 Starlink satellites in a single launch on two occasions (Starlink is SpaceX’s upcoming internet via satellite service). They were visible for at least a few days, while they were all together in a train like fashion. As they spread and gained altitude to reach their operating orbits, they stopped being visible to unaided eyes. Astronomers can still see them on their telescopes and have complained a lot. SpaceX is trying to make their next satellites less reflective. With a decent telescope, a lot more satellites can be easily seen. Including the geostationary ones, that appear more or less “fixed” in their positions. There are websites and phone apps that can tell you when the ISS or some other visible object is going to pass over you. I an app called ISS Detector on my phone. ",
            "date": "Answered December 21, 2019",
            "views": "263",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Stephen Zumbo",
                "href": "/profile/Stephen-Zumbo"
            },
            "answer_text": "Yes. There are websites and apps for your computer that can help you find when dozens of satellites will be visible from your location when they pass overhead. I have seen from my city the International Space Station several times pass rapidly overhead (2 to six minutes, depending on how close to the zenith) exactly when predicted, using such software. Most other satellites are not as bright, but still visible if your patient and your sky is not light polluted. Before such computer helps, people would often see satellites when enjoying the dark sky with the naked eye, especially before dawn and after dusk, when the Sunlight would still be reflected off these objects high above the dark Earth below. Try it yourself and see! ",
            "date": "Answered July 13, 2020",
            "views": "51",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Steve Grey",
                "href": "/profile/Steve-Grey"
            },
            "answer_text": "Yes. Depending on the darkness of your night sky, you could see satellites every night. Recently, I was scanning the sky from fairly dark site and spotted with a pair of binoculars about a half dozen within a couple minutes. You can see brighter satellites with the naked eye, if you know when and where to look. The brightest would be the International Space Station. You may not think about it as a satellite but, technically, it is. A great site for satellite spotting is Heavens Above. There are also several satellite tracking apps. Heavens-Above ",
            "date": "Answered July 12, 2020",
            "views": "67",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Steve Anderson",
                "href": "/profile/Steve-Anderson-226"
            },
            "answer_text": "Yes, some are. The ISS is clearly visible to the naked eye. Smaller satellites can be seen with binoculars, if you know where and when to look. They are difficult or very hard to track or focus with telescopes because they move so fast. Telemetry is available here thanks to NOAA. You only get ~3-5 minutes horizon to horizon, once every orbit ~45–50 minutes. Satellite telemetry There are tiny cubesat trackers (except for one possibilty), these are only “seen” with rf antennas. Amateur Radio - PEØSAT ",
            "date": "Answered July 12, 2020",
            "views": "42",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Roshan Ingle",
                "href": "/profile/Roshan-Ingle-1"
            },
            "answer_text": "Yeah they shine too. And could have been visible to earth if those were just big enough! It's hard to spot it on earth even with ordinary telescopes. But yeah, space station aka ISS is visible. You can use a star locater app to track the position of station and see it with scope. But yeah, it revolves earth quite fast. So it's not gonna be easy to see it properly. Hope it helped! ",
            "date": "Answered June 21, 2018",
            "views": "725",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Vigneshwaran Kalidasan",
                    "user_href": "/profile/Vigneshwaran-Kalidasan"
                }
            ]
        },
        {
            "author_info": {
                "name": "Arya Bhagwat",
                "href": "/profile/Arya-Bhagwat-1"
            },
            "answer_text": "The largest artificial satellite is the International Space Station (ISS ) which can be clearly seen with naked eyes , it being the second brightest object in the night sky after the Moon. It is most visible at dawn and dusk , provided you know where to look. It can be tracked conveniently by using ISS tracking apps available on Google playstore. Be warned however that sighting the ISS can become quite addictive. Smaller satellites can be observed through telescopes or binoculars. ",
            "date": "Updated April 19, 2020",
            "views": "387",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Hasindu Lakshan",
                    "user_href": "/profile/Hasindu-Lakshan-1"
                },
                {
                    "user_id": "Himadri Saha",
                    "user_href": "/profile/Himadri-Saha-18"
                }
            ]
        },
        {
            "author_info": {
                "name": "Ashray Jain",
                "href": "/profile/Ashray-Jain-4"
            },
            "answer_text": "Yes..light from satellite is visible and some of them like ISS shine almost as bright as Jupiter in the night sky. Twinkling though is not much evident. One major difference between gazing a star and watching a satellite is that a satellite goes across the sky pretty quickly. More quickly than you would expect an aircraft going. ",
            "date": "Answered April 28, 2018",
            "views": "871",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Vigneshwaran Kalidasan",
                    "user_href": "/profile/Vigneshwaran-Kalidasan"
                }
            ]
        },
        {
            "author_info": {
                "name": "Panakkal Chandramohan",
                "href": "/profile/Panakkal-Chandramohan"
            },
            "answer_text": "What you have seen most probably are planets Venus and Jupiter Now in Conjunction.artificial satellites are visible few hours after Sun set and few hours before dawn.They move slowly, flicker as the solar panels reflect light when they rotate..The brightest among them the international space station is visible.Look at heavens. above.comOr spot the station.Nasa.site.. ",
            "date": "Answered July 2, 2015",
            "views": "433",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Sage Carroll",
                "href": "/profile/Sage-Carroll-1"
            },
            "answer_text": "Yes! I’ve done it many times. You can see the Space Station without a telescope or even binoculars. If you want to see it in detail, you should use a telescope. As for Natural satellites, yes. Yes you can. ",
            "date": "Answered December 21, 2019",
            "views": "66",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Martin Cohen",
                    "user_href": "/profile/Martin-Cohen-25"
                }
            ]
        },
        {
            "author_info": {
                "name": "James Oppenheimer-Crawford",
                "href": "/profile/James-Oppenheimer-Crawford"
            },
            "answer_text": "When the satellite is low in the sky, and sunlight reflects off of it — you BET you can see them, if you know when and where to look. The ISS seems to be popular for this. ",
            "date": "Answered December 21, 2019",
            "views": "31",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Philip Rabe",
                "href": "/profile/Philip-Rabe"
            },
            "answer_text": "You need to go outside at night and look up. It helps to know When a satellite or the ISS will be flying overhead. There are apps for iPhone or Android that can alert you. I have the “ISS Spotter” on my iPad. ",
            "date": "Answered May 18, 2019",
            "views": "41",
            "upvotes": "0"
        }
    ]
}