{
    "title": "Are Cutco Kitchen knives of good quality? - Quora",
    "tags": [
        "Cutco Cutlery",
        "Quality (business)",
        "Knives"
    ],
    "response": [
        {
            "author_info": {
                "name": "Ron Irwin",
                "href": "/profile/Ron-Irwin-14"
            },
            "answer_text": "This is a subject very dear to my heart because I actually sold Cutco knives for almost two years in college. I was good at it. I actually have an award somewhere in the attic for being the number one Northeast Division sales rep and I have lots of knives that were given to be free because my sales levels were so high. When I graduated from college in 1992 (Trinity College in Hartford, CT), I was given a chance to run a regional office with another top guy. That would have been a paying job with growth potential—-right out of college. I turned it down to travel to Africa and decided to become an academic...although my focus is on brand management and marketing, things you learn a great deal about at Cutco (You actually work for a company called Vector, which is the sales arm of the company, but I’ll keep this simple and just say I worked for Cutco). So I obviously am fond of the knives. The good salespeople are really ambassadors for the brand and we all have a real respect for the product. Some of the young people I worked with really amped up the sales, managed to buy cars and go on cruises and essentially become devotees of the salesmanship needed to sell these knives. The sales conferences were FUN and there were many people who had inspiring stories to tell. Yes, you can make money selling knives, because everybody needs them and most people have bad knives. There are two major objections that people bring up about Cutco. The first is that the knives are not as good as some of the (slightly) cheaper brands out there. The argument hinges on the “plastic” handles and the grade of high carbon stainless steel they use. Grrrr. The second objection is that the sales procedures are seen as “manipulative” and people are roped into selling to sympathetic buyers like friends and family. Let me handle both of these as honestly as possible. I do not work for the company anymore and have nothing to gain by tooting their horn. Let’s tackle the argument that the knives are not quite high quality because they are stamped out of a machine (partly true, but they are finished by hand) and the steel is good but not great. First of all, here is a shot of (most of) my Cutco knives. Yes, I still use them. These knives are now 27 years old and reside in my Cape Town kitchen  Notice how new they look? I use them all the time. Every day, in fact. They have literally travelled 10,000 miles to get here in Cape Town. They are untarnished, shiny, and sharp. After 27 years of use. In a house with two kids and a wife who is not really interested in knives. These have been in the sink, in the dishwasher, outside by the BBQ (called a “braai”) here), and they have been used to cut plastic, rope and all kind of meats and vegetables.  They often are tossed in drawers or spend the night in the drainage rack by the sink. They are taken care of but not babied. As you can see, these will last me for the rest of my life quite easily. I have only replaced the white handled medium knife and the “spatula spreader” (not pictured because I was actually using it and it was covered in mayo) because they were getting slightly dull. The company took in these knives and sent me new ones to my USA office without any hassle. They were 25 years old when I sent them in for replacement. In fact, I just wanted them to replace the DD blade on them but they simply gave me new knives. That’s good service. I also have some Wusthof Trident Knives. See below. These were given to me in 2000, when I was married, and yes, they are good knives. But they are not in the same kind of shape as the Cutcos. Note that one of the rivets is missing in the knife in the picture. And note how the rivets and the PLASTIC handles have started to corrode over time. One of the knives fell down into the dishwasher element and the handle is a bit warped.  I sharpen these knives often. On a stone. The DD edge knives do not need sharpening, ever. And they never lose their shine, and they never corrode. So, to the people who complain about the quality of the steel in Cutco knives, I have to ask why my Wusthofs are more corroded and duller than my Cutcos? And to those people who say that Cutcos have “plastic” handles, I would like to point out that they have “thermoresin” handles, the same stuff you find on bowling balls and on the old tiles on the Space Shuttle. That’s not “plastic”. The Wusthof knives above have “plastic” handles or stuff that feels alot like it. The hard steel used in the flush rivets on the Cutco handles never corrodes. Look at these 27 year old rivets on the Cutcos. Uncorroded, and still flush to the handle. The handles, of course, are still fine. Because that thermoresin can handle the heat of a dishwasher element or pretty much anything else it’s likely to touch save for a stove burner. The handle design fits a person’s large or small hands and does not slip…designed by Thomas Lamb, I believe, it has won a number of awards. The Wusthof handles are smaller and not as easy to hold if you are a bigger guy.  I grant you that the steel might technically be better on the really high end knives. And there are cheaper knives out there, for sure, that will take a lovely edge and last. I readily admit that if you like knives, and look after them, and know your stuff, then there are some great choices out there for the enthusiast. Yes, they may even be a bit cheaper. So if you are a knife guy or gal with a lovely set of Sabatiers or a Japanese sushi knife and vegetable knife you bought in Tokyo for less than a Cutco knife, then good on you. But here’s the thing. I gave probably a hundred or more sales presentations while I worked at Cutco. And part of that presentation is asking the person to bring out their sharpest knife in the house and cut some rope or leather or paper. Never ONCE did anyone bring out a knife that was sharp enough to do this. NOT ONCE. My knives always did it, perfectly, and then we would cut whatever was in the customer’s fridge, like a tomato or meat or whatever, and my knives were ALWAYS SHARPER. Some of my customers had decent knives. Lots of Wusthofs and Henckels and Chicago Cutlery knives were brought out of drawers or battered butcher blocks to bend the knee to my Cutco knives. NOT BECAUSE THEY ARE BAD KNIVES, but because the average person really doesn’t have the time or inclination to keep them dry and sharp. You can get a $20 knife at the kitchen supply store and it will be great, so long as you are willing to sharpen it and use a steel on it and keep it dry. But you won’t always feel like doing that, will you? A Cutco DD edge knife will always be sharper than the a good kitchen knife that is really not looked after. I never ran into anyone—-no matter how massive their house was or how great their kitchen was —-who kept their knives properly sharp. People just forget to do it. Sharpening knives is a pain in the A$$ . Most people want to grab a knife, cut up some meat and veg, throw it in the dishwasher or the sink, and that’s it. They don’t want to run it over a steel each time, or hand dry it, or whip out a whetstone. Thats a hassle. And Cutcos, with their 440A surgical steel and thermoresin handles, are designed for THE KIND OF PERSON WHO WANTS A SHARP KNIFE WITHOUT THE HASSLE. They are meant to be very, very durable OVER TIME. In fact, the only people who had decent knives in their kitchens were the ones who happened to have a Cutco knife they inherited from their Great Aunt. And if it was fifty years old and in bad shape, I had it replaced for them—although most people had sentimental value on these and declined to hand them over—because they still cut well and they were heirlooms!!! So I am not arguing that Cutco knives are a better value or even better than a lovely set of Sabatiers or the even the high end Wusthofs or even the mid range knives over at Target. I AM saying that if you are like 95% of the knife buyers out there, you are not going to bother sharpening, cleaning and drying those knives regularly and they will get a bit dull…or alot dull. By the way, when the knife gets too dull, you need to have a pro sharpen it. It takes too long to do it yourself and you can’t just run it over the steel. Fun, fun, fun. A set of Cutco doesn’t need babying. You can use the knives to cut up pizza or cut open a Barbie Doll package or hack open an ice cream container (like regular people do) and they will still carve up a chicken or a tomato that evening with zero hassle. They can handle the dishwasher. They can handle being thrown in the drawer with your other cutlery. AND THEY WILL BE SHARP TEN YEARS FROM NOW AND IF THEY ARE NOT, JUST SEND THEM BACK AND GET YOUR FREE REPLACEMENT SET. Does this mean they are worth the premium price? I think so. I sold hundreds of knives to dozens of people and never once did anyone complain. In fact, many of my sales were repeat orders—-people bought one knife and then wanted more of them. Their steak knives, for instance, are incredible (article continues below the pic)….  I had a few of these in my sales bag and when I liked a client, I would simply let her borrow it for a weekend, and sure enough somebody in the house would use it and want a whole set. The knives ZIP through meat. No more sawing back and forth with a cheapo steak knife. These WORK. And so people get curious about the bigger knives. People don’t come back for more knives if they are not impressed by what they bought. Simple. So, if you re interested in knives and you are ready to keep them dry and sharp and run them over a steel because that’s your hobby, then by all means, shop around. But if you are like the rest of us and think running a knife over a slimy stone at 15 degrees for fifteen minutes per knife is about as much fun as watching flies fornicate, get a Cutco set. 27 years from now you will be enjoying it. Right. On to the complaint about sales practices. Cutco recruits college students (and lots of other people), trains them on how to use the product, and gives them a very strong sales script. They then ask you to contact everybody you know who might be willing to listen to a free presentation. This includes family, friends, the dentist and Great Aunt Sadie. Now, some people say that is manipulative and those people will buy anyway because they like the bright eyed college kid trying to make a buck. Guys. No matter what sales job you get, you will be hitting up the people you know first because thats how sales work!!!!!! My brother worked for a big investment house selling investment ideas and guess who he went to first? ALL OF HIS FRIENDS. If you sell anything from knives to cars to medical services to financial services to insurance, you are going to call up your friends and family first. THAT’S HOW IT WORKS. The point is, you do not want to rip off your friends or your mom. And when your friends start buying lots of the product, and call you when they are going to a wedding and want to give a nice gift, or want to give Uncle Festus a nice fishing knife, then by golly you must have a good product!!! Not one of my friends and family ever came back to me and said, “Hey, that knife set you sold me was awful. And I feel ripped off.” Never. Instead, they always mention to me how they are still using the knives I sold them BEFORE THE INTERNET WAS INVENTED. My success rate was about 60%. 60% of the people who saw the presentation bought something. Many times they bought full sets. My average sale was about $150. PLUS, I always offered a free knife if the friends I had would refer me to twenty of THEIR friends. And so on. So, by the time I had run through all of the people I knew, I had a list of strangers who were friends with people I had sold to. And it was only marginally harder to sell to those people. When people say “Cutco salespeople only sell to immediate friends and family so it’s a rip off”, they are talking about BAD SALESPEOPLE. And, alas, 90% of the world seems to be made up of bad salespeople. People who want to make a quick buck or don’t care about the product or just don’t like selling. I am NOT saying these are bad PEOPLE. I am saying that sales is not for everyone. You need to love the product, the company and the customers. You need to really believe you’re selling them a product they will like and will reflect well upon you. You need to be be able to cold call people and give presentations to ANYONE (I sold them to my college professors. I sold to women I met in bars. I sold a set to my high school English teacher.) The top sales people at Cutco are routinely selling to utter strangers. You run through your immediate family within a few weeks. Yes, those sales keep the company going, but there are people at Cutco who are really motivated and sell lots of knives year on year. One person in our division blew through a MILLION DOLLARS in face to face knife sales. It suits some people. You set your own hours, you don’t have to sit in an office all day, and frankly, it’s an addiction. Plus, the knives are awesome. And made in the USA. ",
            "date": "Answered October 30, 2019",
            "views": "134",
            "upvotes": " View 63 Upvoters",
            "upvoters": [
                {
                    "user_id": "Charlyn McNamara",
                    "user_href": "/profile/Charlyn-McNamara"
                },
                {
                    "user_id": "Matthew Cowell",
                    "user_href": "/profile/Matthew-Cowell-4"
                },
                {
                    "user_id": "Cloyce Martin",
                    "user_href": "/profile/Cloyce-Martin"
                },
                {
                    "user_id": "Jade Nguyen-Beck",
                    "user_href": "/profile/Jade-Nguyen-Beck"
                },
                {
                    "user_id": "Micah DuCasse",
                    "user_href": "/profile/Micah-DuCasse"
                },
                {
                    "user_id": "Darren Sellner",
                    "user_href": "/profile/Darren-Sellner"
                },
                {
                    "user_id": "Rebecca Boruszewski",
                    "user_href": "/profile/Rebecca-Boruszewski"
                },
                {
                    "user_id": "Bethann Siviter",
                    "user_href": "/profile/Bethann-Siviter"
                },
                {
                    "user_id": "Soo Jung Lee",
                    "user_href": "/profile/Soo-Jung-Lee-11"
                },
                {
                    "user_id": "Jeanette Gosal",
                    "user_href": "/profile/Jeanette-Gosal"
                },
                {
                    "user_id": "Quentin Israelsen",
                    "user_href": "/profile/Quentin-Israelsen"
                },
                {
                    "user_id": "Mala Venkateswaran",
                    "user_href": "/profile/Mala-Venkateswaran-1"
                },
                {
                    "user_id": "Dawn R Fischer",
                    "user_href": "/profile/Dawn-R-Fischer"
                },
                {
                    "user_id": "Paul Johnson",
                    "user_href": "/profile/Paul-Johnson-881"
                },
                {
                    "user_id": "Zoe Estus",
                    "user_href": "/profile/Zoe-Estus"
                },
                {
                    "user_id": "Kace Ezzet",
                    "user_href": "/profile/Kace-Ezzet"
                },
                {
                    "user_id": "Jessica Mason",
                    "user_href": "/profile/Jessica-Mason-82"
                },
                {
                    "user_id": "Billy Fischer",
                    "user_href": "/profile/Billy-Fischer-8"
                },
                {
                    "user_id": "Robert J. Smith",
                    "user_href": "/profile/Robert-J-Smith-11"
                },
                {
                    "user_id": "Eric Silvers",
                    "user_href": "/profile/Eric-Silvers"
                },
                {
                    "user_id": "Samantha Mangum",
                    "user_href": "/profile/Samantha-Mangum-2"
                },
                {
                    "user_id": "Emily Buckingham",
                    "user_href": "/profile/Emily-Buckingham-1"
                },
                {
                    "user_id": "Susan Chen",
                    "user_href": "/profile/Susan-Chen-63"
                },
                {
                    "user_id": "Myche Jordan",
                    "user_href": "/profile/Myche-Jordan"
                },
                {
                    "user_id": "Nadia Maria",
                    "user_href": "/profile/Nadia-Maria-11"
                },
                {
                    "user_id": "Amanda Ecret",
                    "user_href": "/profile/Amanda-Ecret"
                },
                {
                    "user_id": "Joseph Wright",
                    "user_href": "/profile/Joseph-Wright-272"
                },
                {
                    "user_id": "Jim Gordon",
                    "user_href": "/profile/Jim-Gordon"
                },
                {
                    "user_id": "Troy Huggins",
                    "user_href": "/profile/Troy-Huggins-3"
                },
                {
                    "user_id": "Anna Ngo",
                    "user_href": "/profile/Anna-Ngo-6"
                },
                {
                    "user_id": "Britt McRae",
                    "user_href": "/profile/Britt-McRae"
                },
                {
                    "user_id": "Didi Wenger",
                    "user_href": "/profile/Didi-Wenger"
                },
                {
                    "user_id": "Dave Yergin",
                    "user_href": "/profile/Dave-Yergin"
                },
                {
                    "user_id": "Michael White",
                    "user_href": "/profile/Michael-White-471"
                },
                {
                    "user_id": "Eric Hollan",
                    "user_href": "/profile/Eric-Hollan-2"
                },
                {
                    "user_id": "Taalib Jaye",
                    "user_href": "/profile/Taalib-Jaye"
                },
                {
                    "user_id": "Brian Casady",
                    "user_href": "/profile/Brian-Casady-1"
                },
                {
                    "user_id": "Christopher Mulhauser",
                    "user_href": "/profile/Christopher-Mulhauser"
                },
                {
                    "user_id": "Tom Kehoe",
                    "user_href": "/profile/Tom-Kehoe-1"
                },
                {
                    "user_id": "Melody Horton",
                    "user_href": "/profile/Melody-Horton-7"
                },
                {
                    "user_id": "Ronniel Padua",
                    "user_href": "/profile/Ronniel-Padua"
                },
                {
                    "user_id": "Michael Sakmar",
                    "user_href": "/profile/Michael-Sakmar"
                },
                {
                    "user_id": "Heidi Diener",
                    "user_href": "/profile/Heidi-Diener"
                },
                {
                    "user_id": "Tom Sierra",
                    "user_href": "/profile/Tom-Sierra-1"
                },
                {
                    "user_id": "Bonnie Hays",
                    "user_href": "/profile/Bonnie-Hays-8"
                },
                {
                    "user_id": "Nine Carp",
                    "user_href": "/profile/Nine-Carp"
                },
                {
                    "user_id": "Martin Shank",
                    "user_href": "/profile/Martin-Shank-1"
                },
                {
                    "user_id": "Dora Thomsan",
                    "user_href": "/profile/Dora-Thomsan"
                },
                {
                    "user_id": "Rebecca Caisse",
                    "user_href": "/profile/Rebecca-Caisse"
                },
                {
                    "user_id": "Betsy Megas",
                    "user_href": "/profile/Betsy-Megas"
                },
                {
                    "user_id": "Chad Nicely",
                    "user_href": "/profile/Chad-Nicely-2"
                },
                {
                    "user_id": "Darshan Davis",
                    "user_href": "/profile/Darshan-Davis"
                },
                {
                    "user_id": "Donna Wildes",
                    "user_href": "/profile/Donna-Wildes-2"
                },
                {
                    "user_id": "Tim Abell",
                    "user_href": "/profile/Tim-Abell-1"
                },
                {
                    "user_id": "Michael Aumock",
                    "user_href": "/profile/Michael-Aumock"
                },
                {
                    "user_id": "Vivian Chern Shnaidman",
                    "user_href": "/profile/Vivian-Chern-Shnaidman"
                },
                {
                    "user_id": "Elaine Johns Reed",
                    "user_href": "/profile/Elaine-Johns-Reed"
                },
                {
                    "user_id": "Max Mason",
                    "user_href": "/profile/Max-Mason-19"
                },
                {
                    "user_id": "Udaum Kor",
                    "user_href": "/profile/Udaum-Kor"
                },
                {
                    "user_id": "Luna Regina",
                    "user_href": "/profile/Luna-Regina-2"
                },
                {
                    "user_id": "Doug Fletcher",
                    "user_href": "/profile/Doug-Fletcher-21"
                },
                {
                    "user_id": "Zero Walters",
                    "user_href": "/profile/Zero-Walters"
                },
                {
                    "user_id": "Garrick Saito",
                    "user_href": "/profile/Garrick-Saito"
                }
            ]
        },
        {
            "author_info": {
                "name": "Lucia De Marchi",
                "href": "/profile/Lucia-De-Marchi"
            },
            "answer_text": "YES, they are worth purchasing! If you are a person that cooks for yourself and family everyday, several times throughout the day, you enjoy cooking, and actually use your knives heavily, I believe that you will be very pleased with your purchase of Cutco knives!! I love cooking and have been the main cook for my family of four for over 20 years. Like many couples, when we first got married we purchased what I could afford, which were unknown cheaper brands. Worked well for a few months then would fail in no time (cracking handles, rust spots, dulling etc). To be expected but we just replaced them as needed. Got older and realized this was a waste of money and wanted to invest in better more expensive knives but only a few so bought a few Henckel and Wusthof (smooth blade knives, not serrated). These were great for a few years, but needed constant sharpening. When not constantly sharpened they get really dull. I DON’T like constantly sharpening. Was offered a demo of Cutco knives last year and before sales rep even came I was ready to not buy much due to high price. BUT was sold by sharpness of their knives over my sharpened Henckle and Wusthof. I bought 11 specialty knives ( butchering, carving, bread, sandwich, etc) I am am not saying that Henckle and Wusthof are poor quality. I am sure they are great FOR PEOPLE THAT LOVE SHARPENING THEIR KNIVES DAILY OR EVERY FEW DAYS AND ARE TALENTED AT PROPERLY SHARPENING KNIVES, for butchers, for restaurant chefs, knife-lovers/hobbyists, etc. I get that. However, for regular everyday cooks that just want to pick up their knives, get to work cooking AND LOVING HOW GREAT THEIR KNIVES ARE EVERYDAY WITHOUT ANY EXTRA WORK, dishwasher safe, WITH AMAZING LIFETIME GUARANTEE, you will not regret a Cutco purchase. I don’t. In fact I always reach for Cutco over other brands in my knife drawer. I especially recommend the double d blades, not the smooth blades, only because smooth blades will still need periodic sharpening, but of course Cutco will do this for free which is still great. The ‘double d’ blades stay sharp as is! They are amazingly sharp, different than any knife I have ever used. Nothing like the run of the mill serrated knives you find in stores. I recommend you read about this special type of blade online. It has many advantages. Haven’t had to get any sharpened yet, but nice to know that I can for free whenever I need to. As a side note, 2 friends, separate occasions recently came over for dinner. Both noticed my Cutco knives (one noticed the bread knife out on counter, and other friend noticed the cheese knife). Asked me about them and I told them how happy I was with my purchases. They had never heard of Cutco but got interested. Both mentioned that they had bought whole block sets from other reputable names for a lot of money within the last 2 years. I asked both if they were happy with their purchase, and both said no because they had become dull and weren’t worth the money. IT ISN’T THAT THEY ARE BAD SETS, it’s that regular kitchen cooks can’t be bothered to constantly sharpen their knives!! It is just the way it is. Cutco costs just a tad more than these big name knife brands, but their ease of use, no need for home sharpening, makes them the best I have ever used. Again, I don’t find joy in sharpening every 2 days. IF YOU DO, I don’t doubt that your knives are amazing and perhaps better than Cutco, but then we are comparing apples to oranges, which wouldn’t be fair. KNOW YOUR NEEDS, and buy accordingly. I plan on buying more Cutco in the near future to replace any remaining old knives that I still have ",
            "date": "Answered January 5, 2020",
            "views": "28",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "José Flores",
                    "user_href": "/profile/José-Flores-8"
                },
                {
                    "user_id": "Zoe Estus",
                    "user_href": "/profile/Zoe-Estus"
                }
            ]
        },
        {
            "author_info": {
                "name": "Tom Kehoe",
                "href": "/profile/Tom-Kehoe-1"
            },
            "answer_text": " There’s more to making a fine knife than taking a wafer-thin piece of steel and grinding an edge on it. The photo above shows the steps involved in making a Sabatier chef’s knife. The knife begins as a 5/8ths rod of high-carbon steel. A high-pressure hammer forges it out into the basic form of the knife. The forging compresses and aligns the grain in the steel. A laser cuts it to the precise shape. It’s then heat-treated and sharpened. I have a 10-inch Sabatier’s chef’s knife that is more than 60 years old (it belonged to my mother). It has perfect balance at the bolster, and can easily be brought to a razor’s edge. The long, tapered sides make accurate slicing and dicing easy. It’s springy and shock-resistant. It really is as good today as it was when it was made. And it will be 50 years from now. Contrary to what many manufacturers claim, there’s nothing magic or secret about steel. Here’s the truth: NO knife that is used every day will stay sharp for two years. Or one year. Or six months. They have to be sharpened on a regular basis, and touched up with a steel every few days. Now, it’s perfectly true that serrated blades, like the Cutcos, cut better than a standard blade when dull. But that doesn’t man they’re actually sharp — it’s just that serrated blades cut better when dull than standard blades. With all due respect to their fans, the design of Cutco knives, the materials and engineering of them, is not that of a high-quality knife. They’re designed for ease of manufacture and to give casual users a product that doesn’t have to be sharpened often. Cutco sells mid-range knives at top-of-the line prices. They are 3–4 times as expensive as knives of comparable quality available from most manufacturers. For a casual user, they may perform well enough, but they could get knives of similar quality for much, much less. UPDATE: You purchase tools based on the criteria that are important to you, personally. Most of my mechanical tools are Craftsman, which I think give the best balance of quality and value. But I also have speciality tools from Williams, Proto, S-K, Knipex, Wiha and Snap-On. I own a wide variety of kitchen knives: A walnut-handled, stainless, 11-inch Case butcher’s knife I bought 40 years ago; my Mom’s 65-year-old old Sabatier chef’s knife; a Global chef’s knife I bought on Anthony Bourdain’s recommendation; a Victorinox slicing knife similarly bought on Bourdain’s recommendation; several serrated knives; a 40-year-old Chinese cleaver that was made in solingen Germany; a commercial-quality, carbon-steel Dexter chef’s knife that was made 50 years ago; a 3-inch Japanese-style “shallot knife” I bought in San Francisco’s Chinatown 15 years ago; an 8-inch Russell filet knife; and paring knives from Cutco, Wusthoff, Global and Henckels. The most expensive of these would be the Global — about $140. That’s $15 less than the similar model from Cutco. And the Global is a far better knife. It takes a better edge, feels better in the hand, but it’s not as shiny. You don’t have to spend a lot of money to get a fine kitchen knife. The shallot knife cost about $15. You can buy a new Sabatier for $80 from Amazon. On Bourdain’s suggestion, one year I gave out F-Dick offset handled serrated knives as Christmas presents. They cost about $25 apiece, and the recipients raved about them. There is nothing magic about blade steel. None of the knives I listed above have top-of-the-line steels. They have steels that are suited to the tasks for which they are designed. Now, my everyday carry is a Benchmade Contego with a M-4 blade, a $250 pocketknife with a blade that rusts if you look at to the wrong way. But it will take a (literally) razor-sharp edge, and hold it through all manner of abuse, with little chance of deforming or breaking. The handle is space-age, non-slip G-10, and it uses the most effective locking mechanism ever designed. But I wouldn’t use it for chopping up a chicken. The Global is a far better choice. The Chinese cleaver is even better. But the blade will never be shiny. ",
            "date": "Updated March 30, 2020",
            "views": "323",
            "upvotes": " View 94 Upvoters",
            "upvoters": [
                {
                    "user_id": "Tilman Ahr",
                    "user_href": "/profile/Tilman-Ahr"
                },
                {
                    "user_id": "Thomas Hodges",
                    "user_href": "/profile/Thomas-Hodges-1"
                },
                {
                    "user_id": "Eric Silvers",
                    "user_href": "/profile/Eric-Silvers"
                },
                {
                    "user_id": "Spencer Roe-Weaver",
                    "user_href": "/profile/Spencer-Roe-Weaver"
                },
                {
                    "user_id": "Anna Ngo",
                    "user_href": "/profile/Anna-Ngo-6"
                },
                {
                    "user_id": "Manuel Daponte",
                    "user_href": "/profile/Manuel-Daponte"
                },
                {
                    "user_id": "Ronniel Padua",
                    "user_href": "/profile/Ronniel-Padua"
                },
                {
                    "user_id": "Dora Thomsan",
                    "user_href": "/profile/Dora-Thomsan"
                },
                {
                    "user_id": "Phuzzy Bear",
                    "user_href": "/profile/Phuzzy-Bear"
                },
                {
                    "user_id": "Luther Leong",
                    "user_href": "/profile/Luther-Leong-2"
                },
                {
                    "user_id": "Chee-Eng, Lim",
                    "user_href": "/profile/Chee-Eng-Lim"
                },
                {
                    "user_id": "Mary Ohlfs",
                    "user_href": "/profile/Mary-Ohlfs-1"
                },
                {
                    "user_id": "Donnel Huddleston",
                    "user_href": "/profile/Donnel-Huddleston-1"
                },
                {
                    "user_id": "Vanessa Lum",
                    "user_href": "/profile/Vanessa-Lum-3"
                },
                {
                    "user_id": "John Spencer",
                    "user_href": "/profile/John-Spencer-207"
                },
                {
                    "user_id": "Cindy Siqueiros",
                    "user_href": "/profile/Cindy-Siqueiros"
                },
                {
                    "user_id": "Wesley Riggs",
                    "user_href": "/profile/Wesley-Riggs"
                },
                {
                    "user_id": "James Miller",
                    "user_href": "/profile/James-Miller-26"
                },
                {
                    "user_id": "Thomas Bostick",
                    "user_href": "/profile/Thomas-Bostick"
                },
                {
                    "user_id": "James Harding",
                    "user_href": "/profile/James-Harding-40"
                },
                {
                    "user_id": "James Martin",
                    "user_href": "/profile/James-Martin-857"
                },
                {
                    "user_id": "Josiah Alexander",
                    "user_href": "/profile/Josiah-Alexander-3"
                },
                {
                    "user_id": "Mark Mobs",
                    "user_href": "/profile/Mark-Mobs"
                },
                {
                    "user_id": "Cecil Gabriel",
                    "user_href": "/profile/Cecil-Gabriel-1"
                },
                {
                    "user_id": "Christopher Atkins",
                    "user_href": "/profile/Christopher-Atkins-11"
                },
                {
                    "user_id": "Andres Soolo",
                    "user_href": "/profile/Andres-Soolo"
                },
                {
                    "user_id": "Frans van Oostveen",
                    "user_href": "/profile/Frans-van-Oostveen"
                },
                {
                    "user_id": "Sasha Webber",
                    "user_href": "/profile/Sasha-Webber-2"
                },
                {
                    "user_id": "Jacqueline Howard",
                    "user_href": "/profile/Jacqueline-Howard-1"
                },
                {
                    "user_id": "Rick Richardson",
                    "user_href": "/profile/Rick-Richardson-27"
                },
                {
                    "user_id": "Peter Sutherland",
                    "user_href": "/profile/Peter-Sutherland-6"
                },
                {
                    "user_id": "James Berg",
                    "user_href": "/profile/James-Berg-21"
                },
                {
                    "user_id": "Robert Stephen Campbell",
                    "user_href": "/profile/Robert-Stephen-Campbell"
                },
                {
                    "user_id": "Paul Matthews",
                    "user_href": "/profile/Paul-Matthews-108"
                },
                {
                    "user_id": "Jonathan Li",
                    "user_href": "/profile/Jonathan-Li-12"
                },
                {
                    "user_id": "Marjorie Monahan",
                    "user_href": "/profile/Marjorie-Monahan-1"
                },
                {
                    "user_id": "Greg Zap",
                    "user_href": "/profile/Greg-Zap"
                },
                {
                    "user_id": "James Feazell",
                    "user_href": "/profile/James-Feazell"
                },
                {
                    "user_id": "Shane Doerre",
                    "user_href": "/profile/Shane-Doerre-1"
                },
                {
                    "user_id": "Nelson Brown",
                    "user_href": "/profile/Nelson-Brown-14"
                },
                {
                    "user_id": "Charles Levin",
                    "user_href": "/profile/Charles-Levin-3"
                },
                {
                    "user_id": "Peter Csucska",
                    "user_href": "/profile/Peter-Csucska"
                },
                {
                    "user_id": "John Mill",
                    "user_href": "/profile/John-Mill-21"
                },
                {
                    "user_id": "Brian R. Sanderson",
                    "user_href": "/profile/Brian-R-Sanderson"
                },
                {
                    "user_id": "Steve Wellendorf",
                    "user_href": "/profile/Steve-Wellendorf"
                },
                {
                    "user_id": "Rob Dempwolf",
                    "user_href": "/profile/Rob-Dempwolf"
                },
                {
                    "user_id": "Bryan Gabriell",
                    "user_href": "/profile/Bryan-Gabriell"
                },
                {
                    "user_id": "Mike Hurst",
                    "user_href": "/profile/Mike-Hurst-21"
                },
                {
                    "user_id": "Lukáš Kubacki",
                    "user_href": "/profile/Lukáš-Kubacki"
                },
                {
                    "user_id": "Matthew Plascencia",
                    "user_href": "/profile/Matthew-Plascencia-2"
                },
                {
                    "user_id": "Courtney Ballard",
                    "user_href": "/profile/Courtney-Ballard-2"
                },
                {
                    "user_id": "Jesse Cabell",
                    "user_href": "/profile/Jesse-Cabell"
                },
                {
                    "user_id": "Iris Merilo",
                    "user_href": "/profile/Iris-Merilo"
                },
                {
                    "user_id": "Michael Cheng",
                    "user_href": "/profile/Michael-Cheng-58"
                },
                {
                    "user_id": "Luke Gratkowski",
                    "user_href": "/profile/Luke-Gratkowski"
                },
                {
                    "user_id": "Gary Rush",
                    "user_href": "/profile/Gary-Rush-3"
                },
                {
                    "user_id": "Emilio Desalvo",
                    "user_href": "/profile/Emilio-Desalvo"
                },
                {
                    "user_id": "Jean-Claude Oligario",
                    "user_href": "/profile/Jean-Claude-Oligario"
                },
                {
                    "user_id": "Vernon Averill",
                    "user_href": "/profile/Vernon-Averill"
                },
                {
                    "user_id": "Kat Kruse",
                    "user_href": "/profile/Kat-Kruse"
                },
                {
                    "user_id": "Andrew Laughton",
                    "user_href": "/profile/Andrew-Laughton"
                },
                {
                    "user_id": "Marc Antonio",
                    "user_href": "/profile/Marc-Antonio"
                },
                {
                    "user_id": "Connor Kuhn",
                    "user_href": "/profile/Connor-Kuhn"
                },
                {
                    "user_id": "Will Keller",
                    "user_href": "/profile/Will-Keller"
                },
                {
                    "user_id": "Awesomeness Inc.",
                    "user_href": "/profile/Awesomeness-Inc"
                },
                {
                    "user_id": "STuart Rosenfeld",
                    "user_href": "/profile/STuart-Rosenfeld"
                },
                {
                    "user_id": "Shourya Ray",
                    "user_href": "/profile/Shourya-Ray"
                },
                {
                    "user_id": "Mark Parker",
                    "user_href": "/profile/Mark-Parker-50"
                },
                {
                    "user_id": "Joseph Sands",
                    "user_href": "/profile/Joseph-Sands"
                },
                {
                    "user_id": "Stan Hanks",
                    "user_href": "/profile/Stan-Hanks"
                },
                {
                    "user_id": "Chuck Erb",
                    "user_href": "/profile/Chuck-Erb-1"
                },
                {
                    "user_id": "Robert Narracci",
                    "user_href": "/profile/Robert-Narracci"
                },
                {
                    "user_id": "Hajarrul Aswad",
                    "user_href": "/profile/Hajarrul-Aswad"
                },
                {
                    "user_id": "Steve Schilling",
                    "user_href": "/profile/Steve-Schilling"
                },
                {
                    "user_id": "Gaelen Hudson",
                    "user_href": "/profile/Gaelen-Hudson"
                },
                {
                    "user_id": "Bill Crimando",
                    "user_href": "/profile/Bill-Crimando"
                },
                {
                    "user_id": "John Bridges",
                    "user_href": "/profile/John-Bridges-10"
                },
                {
                    "user_id": "George Sawyer",
                    "user_href": "/profile/George-Sawyer-1"
                },
                {
                    "user_id": "Nikhil Ramkarran",
                    "user_href": "/profile/Nikhil-Ramkarran"
                },
                {
                    "user_id": "Robert Powell",
                    "user_href": "/profile/Robert-Powell-18"
                },
                {
                    "user_id": "Jeff Muscato",
                    "user_href": "/profile/Jeff-Muscato"
                },
                {
                    "user_id": "Robert Stuckart",
                    "user_href": "/profile/Robert-Stuckart"
                },
                {
                    "user_id": "Jim Ellis",
                    "user_href": "/profile/Jim-Ellis-14"
                },
                {
                    "user_id": "Kathy Tugman Phillips",
                    "user_href": "/profile/Kathy-Tugman-Phillips"
                },
                {
                    "user_id": "Lars Jaderlund",
                    "user_href": "/profile/Lars-Jaderlund"
                },
                {
                    "user_id": "Matt Jepson",
                    "user_href": "/profile/Matt-Jepson"
                },
                {
                    "user_id": "Eric Schnorr",
                    "user_href": "/profile/Eric-Schnorr-1"
                },
                {
                    "user_id": "Chris Thain",
                    "user_href": "/profile/Chris-Thain"
                },
                {
                    "user_id": "Praveen Kumar",
                    "user_href": "/profile/Praveen-Kumar-1379"
                },
                {
                    "user_id": "Larry Ellis",
                    "user_href": "/profile/Larry-Ellis"
                },
                {
                    "user_id": "Sawyer Lawrence",
                    "user_href": "/profile/Sawyer-Lawrence"
                },
                {
                    "user_id": "Ari Blekh",
                    "user_href": "/profile/Ari-Blekh"
                },
                {
                    "user_id": "John Arceneaux",
                    "user_href": "/profile/John-Arceneaux-1"
                },
                {
                    "user_id": "Mary Nelson",
                    "user_href": "/profile/Mary-Nelson-4"
                }
            ]
        },
        {
            "author_info": {
                "name": "Brian Madigan",
                "href": "/profile/Brian-Madigan-2"
            },
            "answer_text": "Yes, they are of good quality for what they are. They are made to be mass produced by skilled workers in their US plant. They have a video of their process here:  The blades are blanked/laser cut from 440A stainless. 440A is very low maintenance, with medium edge holding performance compared to more expensive alloys. It can be washed thousands of times in a dishwasher without losing its shine. There are much better performing steels, but the cost and low maintenance of 440A make it a good alloy for mass production. Cutco does its own heat treating, instead of cutting blanks from pre-treated strips like some of the even cheaper manufacturers do. The knife blanks are hollow ground using a CNC double wheel grinder and then sharpened by hand on a flat platen grinder. The thermoplastic resin used for the handles is very stable and durable. Most Cutco knives are not very well taken care of by their owners, and rapidly lose their factory edge. This is partly due to the blade material, and mostly due to the type of user the knives are marketed to. Their plain ground blades are easily sharpened to the correct angle by using Cutco’s sharpener, but I’ve never seen anyone with a set of Cutco knives bother to sharpen them. The serrated edges are not user-maintainable. They are good quality in that they are consistent. The manufacturing process is well controlled by skilled workers. The design, however, is not great compared to more expensive knives. The blade is a flat strip, and has neither distal taper or a tapered tang. This makes the balance of the knife poor, and it flexes equally from the handle to the tip, instead of increasing in rigidity towards the handle. This makes it feel like you’re holding a sharpened strip of metal. The handle scales are attached by nickel silver pins, but lack bolsters that give better knives more strength and rigidity. I would definitely not take a Cutco knife dinosaur hunting. If you had to thrust this blade into a Velociraptor to save your life, it would most likely bend near the handle and be useless. ",
            "date": "Answered June 20, 2018",
            "views": "51",
            "upvotes": " View 7 Upvoters",
            "upvoters": [
                {
                    "user_id": "Anton Szabo",
                    "user_href": "/profile/Anton-Szabo"
                },
                {
                    "user_id": "Anna Ngo",
                    "user_href": "/profile/Anna-Ngo-6"
                },
                {
                    "user_id": "Darshan Davis",
                    "user_href": "/profile/Darshan-Davis"
                },
                {
                    "user_id": "Zacko Conley",
                    "user_href": "/profile/Zacko-Conley"
                },
                {
                    "user_id": "Dante Porrazzo",
                    "user_href": "/profile/Dante-Porrazzo-1"
                },
                {
                    "user_id": "MsPeabody",
                    "user_href": "/profile/MsPeabody"
                },
                {
                    "user_id": "Andy Parris",
                    "user_href": "/profile/Andy-Parris-2"
                }
            ]
        },
        {
            "author_info": {
                "name": "Dan Bourlotos",
                "href": "/profile/Dan-Bourlotos"
            },
            "answer_text": "I had the luck of going to college about 40 minutes away from Cutco’s facility in Olean NY. As a bladesmith and a metallurgy student I was pretty pumped to get a factory tour. From a manufacturing perspective, it was pretty cool. The blades are all stamped out of stainless, ground by robots and then sharpened by hand. It was my first experience viewing a large-scale production of knives and from an the engineering side, I was pretty impressed. From the blade-maker side, not so much. Cutco uses low grade stainless for their knives. When I asked them which kind, they gave me some proprietary BS, but it is either 420 or 440A. Either way, these are more or less the bare minimum cutlery steels. The trick here is that Cutco uses a cryogenic process to milk the absolute most out of those steels. It isnt magic or anything, but it does make them function better than other blades made of those steels that dont have such a fine-tuned HT process. From a fit and finish perspective, its more or less run-of-the-mill: Injection molded and riveted plastic handles. Quality isnt great, but it isnt crap either. I would say they are of “acceptable” quality, for a upper-middle-class price. The thing that really endears people to Cutco though is the warranty. Cutco claims that at any moment if you knives break they will replace them: period. It is a great selling point, and their products are good enough that they dont have to actually act on it that often. Would I buy Cutco knives? No. Does that mean no one should? Also no. ",
            "date": "Answered September 21, 2017",
            "views": "378",
            "upvotes": " View 87 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Nadezhda Gancheva",
                    "user_href": "/profile/Nadezhda-Gancheva"
                },
                {
                    "user_id": "Kolja Kauder",
                    "user_href": "/profile/Kolja-Kauder"
                },
                {
                    "user_id": "Brace Johnson",
                    "user_href": "/profile/Brace-Johnson-1"
                },
                {
                    "user_id": "Jonathan Carson",
                    "user_href": "/profile/Jonathan-Carson-12"
                },
                {
                    "user_id": "John Spencer",
                    "user_href": "/profile/John-Spencer-207"
                },
                {
                    "user_id": "Alicia Dunbar",
                    "user_href": "/profile/Alicia-Dunbar-1"
                },
                {
                    "user_id": "Terry Lo",
                    "user_href": "/profile/Terry-Lo-2"
                },
                {
                    "user_id": "Eric Silvers",
                    "user_href": "/profile/Eric-Silvers"
                },
                {
                    "user_id": "Avtar Sidhu",
                    "user_href": "/profile/Avtar-Sidhu-21"
                },
                {
                    "user_id": "Charles Jones",
                    "user_href": "/profile/Charles-Jones-297"
                },
                {
                    "user_id": "Spencer Killpack",
                    "user_href": "/profile/Spencer-Killpack-1"
                },
                {
                    "user_id": "Andrew Cless",
                    "user_href": "/profile/Andrew-Cless"
                },
                {
                    "user_id": "Sandhya Rao",
                    "user_href": "/profile/Sandhya-Rao-26"
                },
                {
                    "user_id": "Anna Ngo",
                    "user_href": "/profile/Anna-Ngo-6"
                },
                {
                    "user_id": "Tiffany Yang",
                    "user_href": "/profile/Tiffany-Yang-38"
                },
                {
                    "user_id": "Didi Wenger",
                    "user_href": "/profile/Didi-Wenger"
                },
                {
                    "user_id": "Anton Dambaev",
                    "user_href": "/profile/Anton-Dambaev"
                },
                {
                    "user_id": "Mark Kalscheuer",
                    "user_href": "/profile/Mark-Kalscheuer-1"
                },
                {
                    "user_id": "Brian Casady",
                    "user_href": "/profile/Brian-Casady-1"
                },
                {
                    "user_id": "James Golden",
                    "user_href": "/profile/James-Golden-13"
                },
                {
                    "user_id": "Glenda King",
                    "user_href": "/profile/Glenda-King-1"
                },
                {
                    "user_id": "Jim Miller",
                    "user_href": "/profile/Jim-Miller-139"
                },
                {
                    "user_id": "Alexander Prinzler",
                    "user_href": "/profile/Alexander-Prinzler"
                },
                {
                    "user_id": "Jerry Owen",
                    "user_href": "/profile/Jerry-Owen-13"
                },
                {
                    "user_id": "Ralph Keeping",
                    "user_href": "/profile/Ralph-Keeping"
                },
                {
                    "user_id": "Alicia Wang",
                    "user_href": "/profile/Alicia-Wang-2"
                },
                {
                    "user_id": "Ronniel Padua",
                    "user_href": "/profile/Ronniel-Padua"
                },
                {
                    "user_id": "Andrew Rothman",
                    "user_href": "/profile/Andrew-Rothman-6"
                },
                {
                    "user_id": "Allan Blackmon",
                    "user_href": "/profile/Allan-Blackmon"
                },
                {
                    "user_id": "Denise Breard",
                    "user_href": "/profile/Denise-Breard"
                },
                {
                    "user_id": "Rebecca Caisse",
                    "user_href": "/profile/Rebecca-Caisse"
                },
                {
                    "user_id": "Betsy Megas",
                    "user_href": "/profile/Betsy-Megas"
                },
                {
                    "user_id": "Dan Steele",
                    "user_href": "/profile/Dan-Steele-2"
                },
                {
                    "user_id": "Anthony Darpino",
                    "user_href": "/profile/Anthony-Darpino-1"
                },
                {
                    "user_id": "Andrew Bodman",
                    "user_href": "/profile/Andrew-Bodman-1"
                },
                {
                    "user_id": "Jacinta Vattuone",
                    "user_href": "/profile/Jacinta-Vattuone"
                },
                {
                    "user_id": "Luther Leong",
                    "user_href": "/profile/Luther-Leong-2"
                },
                {
                    "user_id": "James Spurgeon",
                    "user_href": "/profile/James-Spurgeon"
                },
                {
                    "user_id": "John Cantwell",
                    "user_href": "/profile/John-Cantwell-20"
                },
                {
                    "user_id": "Lora Ririe",
                    "user_href": "/profile/Lora-Ririe-1"
                },
                {
                    "user_id": "Matt Carey",
                    "user_href": "/profile/Matt-Carey-6"
                },
                {
                    "user_id": "Lois Wickstrom",
                    "user_href": "/profile/Lois-Wickstrom"
                },
                {
                    "user_id": "Alejandro Maldonado",
                    "user_href": "/profile/Alejandro-Maldonado-8"
                },
                {
                    "user_id": "Andrew Redmayne",
                    "user_href": "/profile/Andrew-Redmayne-1"
                },
                {
                    "user_id": "Juha Oksanen",
                    "user_href": "/profile/Juha-Oksanen-1"
                },
                {
                    "user_id": "Adebayo Braimah",
                    "user_href": "/profile/Adebayo-Braimah"
                },
                {
                    "user_id": "Donnel Huddleston",
                    "user_href": "/profile/Donnel-Huddleston-1"
                },
                {
                    "user_id": "Stephen Binion",
                    "user_href": "/profile/Stephen-Binion-1"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/Vivek-Viveka-1"
                },
                {
                    "user_id": "LaNita Darden",
                    "user_href": "/profile/LaNita-Darden-1"
                },
                {
                    "user_id": "Brendan Barry",
                    "user_href": "/profile/Brendan-Barry-31"
                },
                {
                    "user_id": "Ron Restorff",
                    "user_href": "/profile/Ron-Restorff"
                },
                {
                    "user_id": "Catherine Morse",
                    "user_href": "/profile/Catherine-Morse-2"
                },
                {
                    "user_id": "MsPeabody",
                    "user_href": "/profile/MsPeabody"
                },
                {
                    "user_id": "Wesley Riggs",
                    "user_href": "/profile/Wesley-Riggs"
                },
                {
                    "user_id": "Janet Heberling",
                    "user_href": "/profile/Janet-Heberling-1"
                },
                {
                    "user_id": "Derek Swanson",
                    "user_href": "/profile/Derek-Swanson-1"
                },
                {
                    "user_id": "Mary Ahmed",
                    "user_href": "/profile/Mary-Ahmed-17"
                },
                {
                    "user_id": "Anthony Mohn",
                    "user_href": "/profile/Anthony-Mohn"
                },
                {
                    "user_id": "Russell Wong",
                    "user_href": "/profile/Russell-Wong-32"
                },
                {
                    "user_id": "Thomas Bostick",
                    "user_href": "/profile/Thomas-Bostick"
                },
                {
                    "user_id": "Nicholas Dunham",
                    "user_href": "/profile/Nicholas-Dunham"
                },
                {
                    "user_id": "James Harding",
                    "user_href": "/profile/James-Harding-40"
                },
                {
                    "user_id": "Bob McDonald",
                    "user_href": "/profile/Bob-McDonald-5"
                },
                {
                    "user_id": "Mark Mobs",
                    "user_href": "/profile/Mark-Mobs"
                },
                {
                    "user_id": "Ann Williams",
                    "user_href": "/profile/Ann-Williams-137"
                },
                {
                    "user_id": "James Martin",
                    "user_href": "/profile/James-Martin-857"
                },
                {
                    "user_id": "Chad Alan",
                    "user_href": "/profile/Chad-Alan-2"
                },
                {
                    "user_id": "Larry Paden",
                    "user_href": "/profile/Larry-Paden-2"
                },
                {
                    "user_id": "Christopher Atkins",
                    "user_href": "/profile/Christopher-Atkins-11"
                },
                {
                    "user_id": "John Martinez",
                    "user_href": "/profile/John-Martinez-91"
                },
                {
                    "user_id": "Jim Mann",
                    "user_href": "/profile/Jim-Mann-27"
                },
                {
                    "user_id": "Merry Cruise",
                    "user_href": "/profile/Merry-Cruise"
                },
                {
                    "user_id": "Ben Hawkins",
                    "user_href": "/profile/Ben-Hawkins-6"
                },
                {
                    "user_id": "Michael Huff",
                    "user_href": "/profile/Michael-Huff-16"
                },
                {
                    "user_id": "Robert Klute",
                    "user_href": "/profile/Robert-Klute"
                },
                {
                    "user_id": "Roderick Chow",
                    "user_href": "/profile/Roderick-Chow"
                },
                {
                    "user_id": "Gary Rush",
                    "user_href": "/profile/Gary-Rush-3"
                },
                {
                    "user_id": "Ignacio Rubio-Landaluce",
                    "user_href": "/profile/Ignacio-Rubio-Landaluce"
                },
                {
                    "user_id": "Karen Carr",
                    "user_href": "/profile/Karen-Carr-4"
                },
                {
                    "user_id": "John Hulet",
                    "user_href": "/profile/John-Hulet-1"
                },
                {
                    "user_id": "Sage Gallagher",
                    "user_href": "/profile/Sage-Gallagher"
                },
                {
                    "user_id": "William Cleveland",
                    "user_href": "/profile/William-Cleveland"
                },
                {
                    "user_id": "Ed Zivic",
                    "user_href": "/profile/Ed-Zivic"
                },
                {
                    "user_id": "Jean Komatsu",
                    "user_href": "/profile/Jean-Komatsu"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/Mac-Shout"
                },
                {
                    "user_id": "Ethan Coffin",
                    "user_href": "/profile/Ethan-Coffin-2"
                }
            ]
        },
        {
            "author_info": {
                "name": "Shawn Ramirez",
                "href": "/profile/Shawn-Ramirez"
            },
            "answer_text": "They are ok. Cutco is really selling you their sharpening services, which are ok.  If you use their sharpening services, then it's worth it.  Otherwise, the knives aren't worth the cost. The knives are really shiny, and this means they are high in chromium.  That makes the knives more difficult to maintain a sharp edge.  They can hold a rough edge well, but a finely polished scalpel won't have as mcuh chromium.   For the general public who doesn't EVER sharpen their knives, I would suggest buying a cutco chef's knife, and using their sharpening service regularly.  Hell, buy 2, and rotate them. For a chef?  Not worth it in the slightest. You need to know how to reasonably sharpen a knife.  You can get by without it, but in that case, you should just buy a $20 Victorinox and then recycle it whenever it gets dull. For $100-$200 I can buy high quality knives that fit whatever I need to do.  No knife from Cutco will satisfy my needs, especially because I sharpen my own knives. Granted, I have invested around $100 in sharpening tools, stones, stone fixers, and the like.  Would I be better off spending that on Cutco knives and rotating them?  No ... I wouldn't opt for that. If I wanted to invest a lot in a bread knife, it's arguable that I could have a regularly sharp serrated knife that I would love.  It's also arguable that, for the same cost, I could shuffle $20 serrated knives and just recycle them when they get dull. For the sharpening service, I would purchase them.  The large knife block costs something like $1.5k, if I remember right.  For $400-$500 I could almost buy any knife block, and still have $1k to spend on sharpening services.  You could keep your knives very sharp if you committed to paying someone to sharpen them regularly. That would be about 5 years under heavy use.  At that point, you might need new knives, or you could just live with less than razorsharp knives, which is what most people do. ",
            "date": "Answered January 27, 2016",
            "views": "148",
            "upvotes": " View 14 Upvoters",
            "upvoters": [
                {
                    "user_id": "Thomas Hodges",
                    "user_href": "/profile/Thomas-Hodges-1"
                },
                {
                    "user_id": "Alicia Dunbar",
                    "user_href": "/profile/Alicia-Dunbar-1"
                },
                {
                    "user_id": "Eric Silvers",
                    "user_href": "/profile/Eric-Silvers"
                },
                {
                    "user_id": "Ronniel Padua",
                    "user_href": "/profile/Ronniel-Padua"
                },
                {
                    "user_id": "Ann Nelson",
                    "user_href": "/profile/Ann-Nelson-75"
                },
                {
                    "user_id": "Joseph TerZino",
                    "user_href": "/profile/Joseph-TerZino"
                },
                {
                    "user_id": "Thomas Bostick",
                    "user_href": "/profile/Thomas-Bostick"
                },
                {
                    "user_id": "Gary Rush",
                    "user_href": "/profile/Gary-Rush-3"
                },
                {
                    "user_id": "Brian Bezanson",
                    "user_href": "/profile/Brian-Bezanson"
                },
                {
                    "user_id": "N Larson",
                    "user_href": "/profile/N-Larson"
                },
                {
                    "user_id": "Chen Shao",
                    "user_href": "/profile/Chen-Shao-5"
                },
                {
                    "user_id": "Johnny Thejen",
                    "user_href": "/profile/Johnny-Thejen"
                },
                {
                    "user_id": "John Roach",
                    "user_href": "/profile/John-Roach-20"
                },
                {
                    "user_id": "Jay Amsbaugh",
                    "user_href": "/profile/Jay-Amsbaugh"
                }
            ]
        },
        {
            "author_info": {
                "name": "Rick Hunter",
                "href": "/profile/Rick-Hunter-46"
            },
            "answer_text": "I have a few and think they are good, though not as good as the company claims nor worth the price. I personally think it is funny how their reps are so ignorant about knives yet are told they are experts, and then go to knife forums where people are REALLY into knives and try to “educate” the members about how there are only two types of steel, stainless and carbon, but Cutco uses “high carbon stainless” which is 440A, the lowest carbon stainless steel in the 440 series and one of the lowest carbon stainless steels suitable for knife use. Basically it is one of the cheapest steels used in knives, but still better than 420J2 and AUS6, not that being better than those steels is something to brag about. I’ll agree that 440A is OK for people who just dump their knives in the sink, but telling people it is “the best steel money can buy” is dishonest and laughably stupid. I can understand Busse claiming that INFI is the best steel money can buy, but not anyone claiming this about 440A. My most-used kitchen knife is a Buck 119 in 420HC. As heat treated by Buck 420HC is a good steel and holds and edge. For me it works better on meat than my Cutco knives. I do like their shears, though they are also overpriced. As for their marketing, they recruit kids out of high school mainly to sell to relatives. It is like a MLM but without the recruiting and residual income. Adults wouldn’t put up with their manipulative tactics. Those I knew who joined quit within weeks due to this. ",
            "date": "Answered February 8, 2020",
            "views": "12",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Kwasi Baryeh",
                    "user_href": "/profile/Kwasi-Baryeh-2"
                },
                {
                    "user_id": "Thomas Hodges",
                    "user_href": "/profile/Thomas-Hodges-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "John Wegner",
                "href": "/profile/John-Wegner-8"
            },
            "answer_text": "Oh … so many Cutco ex-sales people and home cooks are in love. Even a few professional users seem to “like” Cutco. I have a few that were gifts. Meh. My San-Mai Shuns are about the same price. They’re supposed to be equal? I laugh. These people must be mad. “Gosh, they still shine like the day they were new, 40 years ago!” Yeah, that would be the 440A “surgical stainless” (which means absolutely nothing — I cut with a Havalon “surgical stainless” scalpel blade once or for maybe an hour and then throw the blade away.) Let’s get a straight edge CPM154, 20° polished edge blade, and a Cutco straight edge “magic grind” blade, both cryo-tempered, and put them through a full battery of edge tests. I don’t have to wonder for a second about the results. Talking turkey: I do the vast majority of my kitchen cutting with a crappy Opinel carbon paring knife and a $12 El Salvadoran Tramontina-brand (German stainless) chef’s knife. The Opinel sees a steel about every 3 uses and the chef’s knife sees a fine diamond hone or plate once a week or two. You can shave with either. They cut a LOT of meat and miscellaneous kitchen stuff, every day. Since Case Cutlery once owned Cutco, they surely know the “Magic Steel” recipe, grind & heat treat. How come they’re not equal or better (since they’re using far more modern steels than Cutco)? Cutco’s current holding company also owns Ka-Bar. How come Ka-Bar doesn’t deep-six their proven military blades and switch to the magic Cutco system? Inquiring minds want to know. ",
            "date": "Answered December 22, 2019",
            "views": "13",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Thomas Hodges",
                    "user_href": "/profile/Thomas-Hodges-1"
                },
                {
                    "user_id": "Tiger Ebersole",
                    "user_href": "/profile/Tiger-Ebersole"
                }
            ]
        },
        {
            "author_info": {
                "name": "Scott Rivers",
                "href": "/profile/Scott-Rivers-5"
            },
            "answer_text": "Short answer is “No”. Cutco claims they use the highest quality steel money can buy. They call it high carbon surgical grade steel. Not exactly the best alloy for knives: Cutco uses 440A grade steel while most top of the line knives (which is where Cutco is priced at) uses 440C, which is higher in carbon, or even better alloys of stainless steel. 440C is more expensive to make, buy, and manufacture with. Because of the higher carbon content, 440C also takes a sharper edge, and holds it better. I wouldn’t make a knife out of 440A stainless unless maybe it’s a saltwater filet knife. This is because 440A is very corrosion resistant; more so than 440C. Better knives in the price range of Cutco can be found that not only are a better alloy, but are also forged, not stamped like Cutco. Look for a brand that uses the alloy X50CrMoV15, AUS-8 or VG10. X50CrMoV15 is the most commonly used stainless steel type for kitchen knives by German manufacturers. It is a good steel type for most non-professional cooks. The rust resistance is high and the cutting characteristics are excellent.The X stands for stainless, 50 for 0.50% carbon and 15 for 15% Chrome. In addition the steel contains small quantities of Molybdenum and Vanadium to improve the grain structure and durability. AUS-8 has similar properties to 440C stainless steel, but it features a larger amount of vanadium in the alloy. It's an excellent blade steel when forged and heat treated properly. It’s about 0 ‎.75% carbon, : ‎0.26% Vanadium, : 0‎.3% Molybdeum, and 0.5% Chromium. If you're looking at an AUS-8 knife, make sure you're buying from a maker who knows his stuff. While it gets sharp, AUS-8 also tends to dull quickly, so make sure to hone it often during use, and sharpen it regularly to get the best results. VG-10 is a premium high-carbon stainless steel that gets so sharp that you usually find it in some of the best kitchen knives your money can buy. Combine that with its excellent rust resistance and its ability to be forged into the waved patterns of Damascus steel and you have something that brings your cutlery to a higher level. VG 10 stainless steel is a mixture that contains roughly 1% carbon, 1% molybdenum, 15% chromium, .2% vanadium and 1.5% cobalt. For a store-bought kitchen knife I’d look at Henckels , Wusthof, Misen (on line only). The AUS 8 alloy from Misen is a great knife at 1/2 the price of the others. ",
            "date": "Updated October 22, 2019",
            "views": "75",
            "upvotes": " View 10 Upvoters",
            "upvoters": [
                {
                    "user_id": "Eric Silvers",
                    "user_href": "/profile/Eric-Silvers"
                },
                {
                    "user_id": "Ronniel Padua",
                    "user_href": "/profile/Ronniel-Padua"
                },
                {
                    "user_id": "Charles P. Hobbs",
                    "user_href": "/profile/Charles-P-Hobbs"
                },
                {
                    "user_id": "Betsy Megas",
                    "user_href": "/profile/Betsy-Megas"
                },
                {
                    "user_id": "Phuzzy Bear",
                    "user_href": "/profile/Phuzzy-Bear"
                },
                {
                    "user_id": "Jonathan Goff",
                    "user_href": "/profile/Jonathan-Goff-6"
                },
                {
                    "user_id": "Zakaria Puteh",
                    "user_href": "/profile/Zakaria-Puteh"
                },
                {
                    "user_id": "Kevin Burk",
                    "user_href": "/profile/Kevin-Burk-1"
                },
                {
                    "user_id": "Jaime Alonso Rodríguez",
                    "user_href": "/profile/Jaime-Alonso-Rodríguez"
                },
                {
                    "user_id": "Andrew Redmayne",
                    "user_href": "/profile/Andrew-Redmayne-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Joseph Mccray",
                "href": "/profile/Joseph-Mccray-3"
            },
            "answer_text": "First, not all Cutco knives are serrated. I only use serrated for my bread knife. I have a large set of Cutco knives that I have used for several years, and they have provided me with excellent service. When I purchased them, I hand picked them personally to meet all my requirements, and they gave me a price for a set of some of them. I generally hone them after every 2–3 uses. When cooking commercially, the knives we were provided were generally cheap, low quality, and we went through them quite regularly. There was one answer that compared them as inferior to Wustof. I beg to differ, as I have a set of Wustof knives and there is no comparison. The set I have, though is the typical home cook set. My Cutco knives put them to shame. I like a heavier blade so the knife does much of the work for me, and when slicing, allows me to make straighter, more even cuts. I have used commercial Wustof knives and I didn’t find much difference. I also have the white handles, which look customized from the usual knives, and carry them in a Henkel knife roll, never a drawer or block. I also have matching accessories like the spreaders, and vegetable peeler. On the rare times I took them to work with me for doing specialty cutting jobs, I dared anyone to touch them. Noone used my knives! I also like that they are a good knife that is American made. For what it’s worth, I have found the Cutco knives to be of good quality, hold a good edge, and will last a long time with proper care. Kudos for the kitchen shears! ",
            "date": "Answered August 8, 2018",
            "views": "42",
            "upvotes": " View 10 Upvoters",
            "upvoters": [
                {
                    "user_id": "Geneva Craven Schult",
                    "user_href": "/profile/Geneva-Craven-Schult"
                },
                {
                    "user_id": "Denise Breard",
                    "user_href": "/profile/Denise-Breard"
                },
                {
                    "user_id": "Elaine Johns Reed",
                    "user_href": "/profile/Elaine-Johns-Reed"
                },
                {
                    "user_id": "John Cantwell",
                    "user_href": "/profile/John-Cantwell-20"
                },
                {
                    "user_id": "Chris Hansen",
                    "user_href": "/profile/Chris-Hansen-96"
                },
                {
                    "user_id": "Zacko Conley",
                    "user_href": "/profile/Zacko-Conley"
                },
                {
                    "user_id": "Lenaigh Higgins",
                    "user_href": "/profile/Lenaigh-Higgins"
                },
                {
                    "user_id": "Dante Porrazzo",
                    "user_href": "/profile/Dante-Porrazzo-1"
                },
                {
                    "user_id": "Jason Farrell",
                    "user_href": "/profile/Jason-Farrell-16"
                },
                {
                    "user_id": "Mary Rivera",
                    "user_href": "/profile/Mary-Rivera-84"
                }
            ]
        },
        {
            "author_info": {
                "name": "Nine Carp",
                "href": "/profile/Nine-Carp"
            },
            "answer_text": "Are Cutco Kitchen knives of good quality? Again, I answer a question with a question. For what purpose? I'm a cook, and I'm solid middle-class, economically. I have Chicago cutlery professional knives, Henckels professional, and Chinese restaurant supply knives and I use them a lot. I need knives with a good balance, a handle that is easy to maneuver, and that sharpen to a really nice edge. My sister-in-law is not a cook, per se, but she gets something tasty to eat on the table reliably. She's solidly upper-middle-class economically. When she married my brother, they bought Cutco knives and KitchenCraft waterless cookware. That was 48 years ago. They still use both. The pans are heavy and so have never warped, plus, since you bring them to the proper heat, and then a low burner maintains that heart, she almost never burns anything. The knives are serviceable and maintain an edge well enough for someone who occasionally cuts up an onion, prepares salad several times a month and makes a few gallons of fruitcake batter a year. And she's never thought about buying those tools again. Which is good, because she's raised children, gotten her bachelor's and master's degrees, gotten Montessori training, taught school, and become a college professor over that time. ",
            "date": "Answered September 12, 2019",
            "views": "16",
            "upvotes": " View 5 Upvoters",
            "upvoters": [
                {
                    "user_id": "M.C. Thompson",
                    "user_href": "/profile/M-C-Thompson"
                },
                {
                    "user_id": "Dana McDole",
                    "user_href": "/profile/Dana-McDole"
                },
                {
                    "user_id": "Brian Casady",
                    "user_href": "/profile/Brian-Casady-1"
                },
                {
                    "user_id": "Rebecca Caisse",
                    "user_href": "/profile/Rebecca-Caisse"
                },
                {
                    "user_id": "Elaine Johns Reed",
                    "user_href": "/profile/Elaine-Johns-Reed"
                }
            ]
        },
        {
            "author_info": {
                "name": "James Spurgeon",
                "href": "/profile/James-Spurgeon"
            },
            "answer_text": "Their recent production hasn’t been anything I would seek out. Blades may or may not last, can’t tell that from handling them a few times. The handles on the other hand are poorly balanced and feel flimsy. Worst part on the handles was, they didn’t bother to clean up the ridged line from the seam of the mold in which they were cast. One of my brothers was a sales representative for them for a few months, just long enough to earn the employee discount on a full set. He has them, and uses them for now, but after using the Cutco set for a few months, he ordered two custom knives from me* so he doesn’t have to use the Cutco for anything requiring heavy cutting or very fine precise cuts. Based on handling his set, I would describe them more as “good for a starter set” for new households these days and somewhat overpriced for that market. That wasn’t always true though, my parents’ set of Cutco knives from 40+ years ago are still going strong and have a reasonable balanced feel. Maybe they will notice their customers aren’t so happy and actually step the quality back up… it could happen. *He gets a “brother” discount from me, so why not get them custom made… but you don’t have to jump all the way to custom knives to get a decent kitchen set. ",
            "date": "Answered June 30, 2016",
            "views": "38",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Catherine Rylatt",
                    "user_href": "/profile/Catherine-Rylatt"
                },
                {
                    "user_id": "Tom Kehoe",
                    "user_href": "/profile/Tom-Kehoe-1"
                },
                {
                    "user_id": "Phil Hutton",
                    "user_href": "/profile/Phil-Hutton-2"
                }
            ]
        },
        {
            "author_info": {
                "name": "Dylan Skola",
                "href": "/profile/Dylan-Skola"
            },
            "answer_text": "They are perhaps a step above a grocery store special, but they are not high-end knives and are vastly overpriced for what they are (which leads to big profits that can drive their multi-level marketing AKA pyramid distribution scheme). They are made from stamped (cheap) 440A steel, which probably the cheapest, lowest-grade stainless steel that one can use for knife-making.I have not handled them, but from most reports their construction quality is OK, not great, but passable.They are serrated (so-called “double-D”) which means that the inside of the serrations will stay sharp longer (though the points will dull), but it also means you can’t make fine smooth cuts like you can with a straight blade. Instead you just end up “sawing” all your food. It also means that you can’t just sharpen them up at home — you have to send them back to Cutco.Here’s a more in-depth rundown: Cutco knives? Search for “Cutco” on any knife forum and you’ll find that the general consensus is similar. For the prices they charge you can buy vastly superior knives from Victorinox, Shun, Wusthoff, or my personal recommendations for a good budget knife: Tojiro DP or Togiharu Molybdenum. And still have enough change for a nice restaurant meal. Cutco’s MLM scheme relies on people selling to friends, neighbors and relatives and exploits the implicit trust and sympathy inherent in those relationships. Suffice it to say my opinion of that type of business practice is . . . low. ",
            "date": "Answered July 27, 2017",
            "views": "56",
            "upvotes": " View 10 Upvoters",
            "upvoters": [
                {
                    "user_id": "Phuzzy Bear",
                    "user_href": "/profile/Phuzzy-Bear"
                },
                {
                    "user_id": "Scott Rae",
                    "user_href": "/profile/Scott-Rae-3"
                },
                {
                    "user_id": "Carol Mello",
                    "user_href": "/profile/Carol-Mello-3"
                },
                {
                    "user_id": "Anthony Mohn",
                    "user_href": "/profile/Anthony-Mohn"
                },
                {
                    "user_id": "Gary Rush",
                    "user_href": "/profile/Gary-Rush-3"
                },
                {
                    "user_id": "Chen Shao",
                    "user_href": "/profile/Chen-Shao-5"
                },
                {
                    "user_id": "Marc Antonio",
                    "user_href": "/profile/Marc-Antonio"
                },
                {
                    "user_id": "Sage Gallagher",
                    "user_href": "/profile/Sage-Gallagher"
                },
                {
                    "user_id": "Steve Schilling",
                    "user_href": "/profile/Steve-Schilling"
                },
                {
                    "user_id": "Mark Whittaker",
                    "user_href": "/profile/Mark-Whittaker-10"
                }
            ]
        },
        {
            "author_info": {
                "name": "Peter Wallace",
                "href": "/profile/Peter-Wallace-50"
            },
            "answer_text": "Cutco is the equivalent of Bose. Marketed as “high end” for the uneducated consumer, but remarkably low end/overpriced for the educated consumer. The steel they use is…well garbage. It is the “surgical steel” 440A that you see in no-name chinese knives you get at gas stations. The cost that they ask for, you should be getting (at the low end) 440C. Probably VG10 or some other supersteel. As for their sharpening service, most companies in that price range will offer some similar service…which is probably a couple seconds on a belt sander. I would highly suggest just buying a leather strop and sharpening set like edge pro to compliment your expensive knives. Their serrated edges are something you can’t do at home Want an excellent cheap set of kitchen knives? Get Old Hickory or Victorinox. I bought a set of 4 old hickories (made in the USA) for $30. 1095 is a excellent cheap steel that Ontario is known for. Holds a edge very well, very easy to sharpen. If you want a high end kitchen knives, get something from Cut Brooklyn, Bark River, or Shun knives. Get 3 quality cooking knives a chefs/santoku, a pairing knife, and a break knife. ",
            "date": "Answered July 26, 2017",
            "views": "58",
            "upvotes": " View 10 Upvoters",
            "upvoters": [
                {
                    "user_id": "Alex Lewin",
                    "user_href": "/profile/Alex-Lewin"
                },
                {
                    "user_id": "Anna Ngo",
                    "user_href": "/profile/Anna-Ngo-6"
                },
                {
                    "user_id": "John Wegner",
                    "user_href": "/profile/John-Wegner-8"
                },
                {
                    "user_id": "Phuzzy Bear",
                    "user_href": "/profile/Phuzzy-Bear"
                },
                {
                    "user_id": "Chris Hansen",
                    "user_href": "/profile/Chris-Hansen-96"
                },
                {
                    "user_id": "Felix Lu",
                    "user_href": "/profile/Felix-Lu-9"
                },
                {
                    "user_id": "Ktot Madison",
                    "user_href": "/profile/Ktot-Madison"
                },
                {
                    "user_id": "Brian Bezanson",
                    "user_href": "/profile/Brian-Bezanson"
                },
                {
                    "user_id": "Derek Pavlicek",
                    "user_href": "/profile/Derek-Pavlicek"
                },
                {
                    "user_id": "N Larson",
                    "user_href": "/profile/N-Larson"
                }
            ]
        },
        {
            "author_info": {
                "name": "Martin Offield",
                "href": "/profile/Martin-Offield"
            },
            "answer_text": "I sold Cutco for 8 weeks in the summer of 1987 in the Fort Worth/Dallas area. I sold sets to my grandmother, mother and sister and still have the set I demonstrated. All sets are as sharp as the day we opened them. I touch up the straight edge knives periodically but the serated edge knives have never needed sharpening even though I used to cut rope several times a day when I was selling them. As to the comment of “they are shiny so they must contain alot of Chromium” high chromium steel won't hold an edge. Cutco knives are all surgical stainless steel which is why they stay sharp even with daily use. These are the only knives I have ever owned. They look like the day I took them out of the box 31 years ago. They cost about $200 for the small set back then. About double that now. If you keep up with your things, it's the only set you'll ever need. If you can't make it to February without losing your coat, then probably the $30 dollar set at Walmart is the better choice. ",
            "date": "Answered November 28, 2018",
            "views": "22",
            "upvotes": " View 9 Upvoters",
            "upvoters": [
                {
                    "user_id": "M.C. Thompson",
                    "user_href": "/profile/M-C-Thompson"
                },
                {
                    "user_id": "Benjamin Van Impe",
                    "user_href": "/profile/Benjamin-Van-Impe"
                },
                {
                    "user_id": "Ron Irwin",
                    "user_href": "/profile/Ron-Irwin-14"
                },
                {
                    "user_id": "Lilyana Paramita",
                    "user_href": "/profile/Lilyana-Paramita"
                },
                {
                    "user_id": "Aaliyah Naranjo",
                    "user_href": "/profile/Aaliyah-Naranjo-1"
                },
                {
                    "user_id": "Terry McIntosh",
                    "user_href": "/profile/Terry-McIntosh-16"
                },
                {
                    "user_id": "Jason Farrell",
                    "user_href": "/profile/Jason-Farrell-16"
                },
                {
                    "user_id": "Lina Morrar",
                    "user_href": "/profile/Lina-Morrar"
                },
                {
                    "user_id": "Zacko Conley",
                    "user_href": "/profile/Zacko-Conley"
                }
            ]
        },
        {
            "author_info": {
                "name": "Cassius Nielsen",
                "href": "/profile/Cassius-Nielsen"
            },
            "answer_text": "Cutco knives are not worth their price. From a quick look on their website the space saver block for $589 has an extremely mediocre set of knives. You can do everything you want in the kitchen with two of those knives, the petite chef’s knife and petite carver. Speaking of those two knives, the chef knife barely makes the cut to actually be a “chefs” knife with its 7 5/8th inch length and the petite carver at 6 3/4in isn’t going to carve anything effectively. Maybe if you were carving quail. This isn’t even getting into what the blade of the knives are made from. It is extremely soft steel in the realm of knives that actually work. Cutco markets their knives to people who buy the Target or Walmart block set. Cutco is an upgrade from those. Your money would be much better spent and saved at the same time on a Tojiro chef knife, bread knife and parying knife. If you want the block set at least get a Wustoff. Please explore your knife options past Cutco because I can guarantee you will wonder why they are so expensive the first time you use a knife made from decent steel that is actually sharp. All that said I will say Cutco makes a nice pair of kitchen shears. And if you buy nothing else, get the Tojiro 270mm bread knife. It will last a while and do it’s job on everything way past what you can expect a Cutco knife to do. ",
            "date": "Answered March 1, 2019",
            "views": "19",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Phuzzy Bear",
                    "user_href": "/profile/Phuzzy-Bear"
                },
                {
                    "user_id": "Andy Tzortzinis",
                    "user_href": "/profile/Andy-Tzortzinis"
                }
            ]
        },
        {
            "author_info": {
                "name": "Michael Sakmar",
                "href": "/profile/Michael-Sakmar"
            },
            "answer_text": "For all of the price point detractors a couple of hundred dollars (which was a lot of $$$ in the 1970's) would be many hundreds now. But I have had use of them for 45+ years. Since I am not a professional cook, I don't really care that they are not the best knife or the best quality for the value. They were paid for when I was in junior high school, and are still usable today (I'm 57 yrs. old now) When they were purchaced there was no internet as we know it today. No one but professional chefs or custom blade makers really knew or cared about the pro level of cutlery. And in comparison would have been extraordinarily expensive and difficult to find/obtain. They are easy to sharpen and almost indestructible if used within reason. I my world I have reasonably good knives that are easy to sharpen and maintain. Perhaps I have adapted to their shortcomings over the years, but I have never cut myself or felt disadvantaged due to either the design or the materials. They are neither the best knives available nor the best value for $$$ spent. That doesn't make them crap! It's kinda nice to have a decent usable set of knives that were paid off when President Nixon was in office that still look like new. ",
            "date": "Answered February 21, 2020",
            "views": "615",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "M.C. Thompson",
                    "user_href": "/profile/M-C-Thompson"
                }
            ]
        },
        {
            "author_info": {
                "name": "Gopal Rao",
                "href": "/profile/Gopal-Rao-1"
            },
            "answer_text": "I sold Cutco knives very briefly after high school, and I held onto the starter set for about a decade before it got broken up and claimed in pieces by various parties. The big chef’s knife and the multipurpose big kitchen knife seemed to be about the same quality as the German-made Henckels knives that I currently use. The mayo spreader was totally unique, and probably the first item to disappear from the set. The scissors were very good as well. As other posters have mentioned, you can’t sharpen the knives at home because of their “double d” serrated edge. I don’t know about the quality of the steel, but it seemed to stay sharp for years. The knives had a full tang, 3 rivets, and the handles were made out of some kind of material that didn’t require much maintenance, and could be washed in a dishwasher. This is all part of the sales pitch, of course, so regard those details as you will. ",
            "date": "Answered July 27, 2017",
            "views": "29",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Brian Casady",
                    "user_href": "/profile/Brian-Casady-1"
                },
                {
                    "user_id": "MsPeabody",
                    "user_href": "/profile/MsPeabody"
                },
                {
                    "user_id": "David Sandy",
                    "user_href": "/profile/David-Sandy"
                },
                {
                    "user_id": "Sage Gallagher",
                    "user_href": "/profile/Sage-Gallagher"
                }
            ]
        },
        {
            "author_info": {
                "name": "Daniel Laureano",
                "href": "/profile/Daniel-Laureano-3"
            },
            "answer_text": "The Steel used is a major factor. Will the steel keep the sharp edge or will it dull on you first few cuts? Not everyone uses our knifes only on the food. Sometimes through the plastic that binds our food or the little strap that holds our celery together.  for these factors, all you really have to do is make sure that the type of steel is what you want. The cheaper the steel,  the more time you will spend sharpening it. Whats the quality of the knife? How does the handle feel? Does the metal of the blade go from the tip of the blade all the way down and through bottom of the handle (this would be the strongest kind)? Can you feel the seams of where the handle is put together. When you hold it, are there any moving parts when you press the knife on something? If you have a wood handle sometimes they will make them so that if you were to soak them in water, the handle will not splinter.  Basically, a lot of little questions is what I ask myself when buying a knife. A lot of the time you can find what you want at a lower price then what Cutco will offer then for.  ",
            "date": "Answered January 27, 2016",
            "views": "33",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Barry Brevik",
                "href": "/profile/Barry-Brevik"
            },
            "answer_text": "Since nobody has answered this, I will wade in with my own personal experience. I am, I will admit, a knife-a-holic. That is to say, a card carrying enthusiast. I have a rather broad selection of kitchen knives; Henckels, Wusthoff, Pampered Chef, and a set of hand made knives made with S30V steel. In addition, I have 3 Cutco knives; a 3 inch paring, 4 inch paring, and a mega-chef's knife that must have a 9 inch blade. In my opinion they are crap! Mine do not take, nor hold an edge worth a damn, and I find that the handles seem to be deliberately designed to be as non-ergonomic as possible. Knowing what I know now, I would not have these knives at *any* price, but as it is, Cutco knives are sold with just a stupid amount of markup. The knives are worth perhaps 1/4 the price they sell for, and I do not exaggerate! ",
            "date": "Answered January 27, 2016",
            "views": "114",
            "upvotes": " View 15 Upvoters",
            "upvoters": [
                {
                    "user_id": "Shailendra Negi",
                    "user_href": "/profile/Shailendra-Negi-3"
                },
                {
                    "user_id": "Phuzzy Bear",
                    "user_href": "/profile/Phuzzy-Bear"
                },
                {
                    "user_id": "Scott Rae",
                    "user_href": "/profile/Scott-Rae-3"
                },
                {
                    "user_id": "Neil Hunter",
                    "user_href": "/profile/Neil-Hunter-17"
                },
                {
                    "user_id": "MsPeabody",
                    "user_href": "/profile/MsPeabody"
                },
                {
                    "user_id": "Carol Mello",
                    "user_href": "/profile/Carol-Mello-3"
                },
                {
                    "user_id": "Anthony Mohn",
                    "user_href": "/profile/Anthony-Mohn"
                },
                {
                    "user_id": "Judy McElearney",
                    "user_href": "/profile/Judy-McElearney"
                },
                {
                    "user_id": "Gary Rush",
                    "user_href": "/profile/Gary-Rush-3"
                },
                {
                    "user_id": "Jeremiah Baur",
                    "user_href": "/profile/Jeremiah-Baur"
                },
                {
                    "user_id": "Nicholas Dunham",
                    "user_href": "/profile/Nicholas-Dunham"
                },
                {
                    "user_id": "Robert Ross",
                    "user_href": "/profile/Robert-Ross-3"
                },
                {
                    "user_id": "Chen Shao",
                    "user_href": "/profile/Chen-Shao-5"
                },
                {
                    "user_id": "Mark Seiffer",
                    "user_href": "/profile/Mark-Seiffer-1"
                },
                {
                    "user_id": "Jay Amsbaugh",
                    "user_href": "/profile/Jay-Amsbaugh"
                }
            ]
        },
        {
            "author_info": {
                "name": "Bethann Siviter",
                "href": "/profile/Bethann-Siviter"
            },
            "answer_text": "I have a full set of Cutco knives with steak knives. They are 35 years old. My parents’ set is 60 years old. Both mine and my parents’ have been repeatedly sharpened … and are still in good shape. They hold a sharp edge and the handles are exceptionally durable. The only problem we both had was the tip on the paring knife broke. They were replaced without question. If I’d had to pay full price, I would not have bought them as they were not cheap (probably to cover salesman’s commission), but they have lasted longer and are more comfortable to use than any other knives except my Japanese boning and fillet knives (those were very expensive). I know a lot of people are saying they are rubbish, but they have been used for so long and still take an edge, and cut well. I guess that says something. ",
            "date": "Answered March 16, 2019",
            "views": "12",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "M.C. Thompson",
                    "user_href": "/profile/M-C-Thompson"
                },
                {
                    "user_id": "Ron Irwin",
                    "user_href": "/profile/Ron-Irwin-14"
                },
                {
                    "user_id": "Cherry James",
                    "user_href": "/profile/Cherry-James-7"
                },
                {
                    "user_id": "Mary Nelson",
                    "user_href": "/profile/Mary-Nelson-4"
                }
            ]
        },
        {
            "author_info": {
                "name": "Frank David Valenzuela",
                "href": "/profile/Frank-David-Valenzuela"
            },
            "answer_text": "No,no,no,didn't want that to be taken as a double negative. That is why young kids are given them to sell to friends and family! A forged non serrated chef or santoku knife will handle most cooking needs. You will need one serrated knife for cutting bread (not cutco) And a small paring knife. I believe you may find some good knives starting around $30-$40 Forschner (Victornox now) or go with some of the standards Wustof or Henckels for $50-$100. I have had all of these brands last me 25 years and going strong. Learn to use a maintainance rod and sharpen once a year. Cutco’s are not quality knives and rarely need sharpening since the cutting area is raised and protected by the tips. And dang, they sure are expensive. ",
            "date": "Answered July 9, 2017",
            "views": "36",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Thomas Hodges",
                    "user_href": "/profile/Thomas-Hodges-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Jack Blade",
                "href": "/profile/Jack-Blade"
            },
            "answer_text": "I have a couple Cutco knives, their vegetable slicer, hardy slicer and cheese knife. Plus the shears, which truly are fantastic, but spendy! I do think that Cutco knives are over priced for what they are. Having said that, I have no complaints about their performance of the tasks I bought them for specifically. At the price point they sell them at, you can get some truly great brand name knives like Wusthof, MAC, Global, Sabatier, Zwilling etc etc. They do use 440A steel, which you see in a lot of mass produced Chinese made junk knives. Though Cutco does do a good job as far as tempering the steel so that it performs better than the Chinese produced 440A junk. I have been using a couple of the Cutco knives regularly. Especially the Vegetable slicer, reminds me of a heavier Japanese Nakiri. Haven’t had it sharpened yet. Normally that is not the case with junk 440A. If you are a Cutco fan so to speak, then more power to you! If not, there are brand name knives out there with superior blade material at the same price point or a liitle less in some cases. I happen to have both! Live Good! ",
            "date": "Answered April 8, 2020",
            "views": "459",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Garrick Saito",
                "href": "/profile/Garrick-Saito"
            },
            "answer_text": "I've been using the same set for almost 40 years now.  None of the blades have ever broken, but I have had one or two of the meat (steak) knives handles crack, after they went down the garbage disposal.  That wasn't Cutco's fault, though.  The blades will stay sharp for five to seven years, but sharpening is free for your lifetime (in the case of the non-straight-edged knives). Here's what mine looks like (with ordinary care) after several decades of daily use.  Almost as new as the day I bought them.   I'd say yes, they're good quality. ",
            "date": "Answered June 29, 2015",
            "views": "48",
            "upvotes": " View 36 Upvoters",
            "upvoters": [
                {
                    "user_id": "Jason Farrell",
                    "user_href": "/profile/Jason-Farrell-16"
                },
                {
                    "user_id": "Sean Kauder",
                    "user_href": "/profile/Sean-Kauder"
                },
                {
                    "user_id": "Wanli Liu",
                    "user_href": "/profile/Wanli-Liu-2"
                },
                {
                    "user_id": "Charles Spencer",
                    "user_href": "/profile/Charles-Spencer-7"
                },
                {
                    "user_id": "Thurman Snell",
                    "user_href": "/profile/Thurman-Snell"
                },
                {
                    "user_id": "Gopal Rao",
                    "user_href": "/profile/Gopal-Rao-1"
                },
                {
                    "user_id": "Finn Uyeki",
                    "user_href": "/profile/Finn-Uyeki"
                },
                {
                    "user_id": "Anubhav Karanseth",
                    "user_href": "/profile/Anubhav-Karanseth"
                },
                {
                    "user_id": "Krishna Bhandary",
                    "user_href": "/profile/Krishna-Bhandary"
                },
                {
                    "user_id": "Evan Grossman",
                    "user_href": "/profile/Evan-Grossman-1"
                },
                {
                    "user_id": "Jim Gordon",
                    "user_href": "/profile/Jim-Gordon"
                },
                {
                    "user_id": "Roopesh Rishi",
                    "user_href": "/profile/Roopesh-Rishi"
                },
                {
                    "user_id": "Ashraf Cherukuru",
                    "user_href": "/profile/Ashraf-Cherukuru"
                },
                {
                    "user_id": "Dick Karp",
                    "user_href": "/profile/Dick-Karp"
                },
                {
                    "user_id": "Ruby Gao",
                    "user_href": "/profile/Ruby-Gao-1"
                },
                {
                    "user_id": "Brian Huang",
                    "user_href": "/profile/Brian-Huang-2"
                },
                {
                    "user_id": "Tarun Sukhija",
                    "user_href": "/profile/Tarun-Sukhija"
                },
                {
                    "user_id": "Nouman Ahmed",
                    "user_href": "/profile/Nouman-Ahmed-10"
                },
                {
                    "user_id": "A K Pandey",
                    "user_href": "/profile/A-K-Pandey-4"
                },
                {
                    "user_id": "Robert Oswald",
                    "user_href": "/profile/Robert-Oswald"
                },
                {
                    "user_id": "Romain Cottard",
                    "user_href": "/profile/Romain-Cottard"
                },
                {
                    "user_id": "Eric Perich",
                    "user_href": "/profile/Eric-Perich"
                },
                {
                    "user_id": "Katherine Hunter",
                    "user_href": "/profile/Katherine-Hunter-5"
                },
                {
                    "user_id": "Kenneth Ryu",
                    "user_href": "/profile/Kenneth-Ryu"
                },
                {
                    "user_id": "Bertram Parsons",
                    "user_href": "/profile/Bertram-Parsons"
                },
                {
                    "user_id": "AiDiL Jamaluddin",
                    "user_href": "/profile/AiDiL-Jamaluddin"
                },
                {
                    "user_id": "Seth Goonetilleke",
                    "user_href": "/profile/Seth-Goonetilleke"
                },
                {
                    "user_id": "Gudjon Andri",
                    "user_href": "/profile/Gudjon-Andri"
                },
                {
                    "user_id": "Albert Perry",
                    "user_href": "/profile/Albert-Perry-1"
                },
                {
                    "user_id": "Judy Levy Pordes",
                    "user_href": "/profile/Judy-Levy-Pordes"
                },
                {
                    "user_id": "Kim Willson",
                    "user_href": "/profile/Kim-Willson-1"
                },
                {
                    "user_id": "Emily Bowman",
                    "user_href": "/profile/Emily-Bowman-62"
                },
                {
                    "user_id": "Kent Fung",
                    "user_href": "/profile/Kent-Fung"
                },
                {
                    "user_id": "Jon Mixon",
                    "user_href": "/profile/Jon-Mixon-1"
                },
                {
                    "user_id": "Sameer Ketkar",
                    "user_href": "/profile/Sameer-Ketkar"
                },
                {
                    "user_id": "Scott Young",
                    "user_href": "/profile/Scott-Young-5"
                }
            ]
        },
        {
            "author_info": {
                "name": "Daniel Berry",
                "href": "/profile/Daniel-Berry-18"
            },
            "answer_text": "I don’t like them. I’m honestly surprised they are still in business since the internet makes research on something so easy. Personally, if I needed some decent knives for not a lot of money, I’d visit a restaurant supply store and find some that fit your hand.  This chef’s knife is less than 20 dollars and will do anything you ask of it. Keep it sharp and it will function just as well as a 500 dollar chef’s knife. I’m a bit of a knife snob, and have some very expensive knives for my amusement. I still keep these inexpensive knives and use them every day. If 20 dollars is too much, visit your local thrift store or flea market and look for old Chicago Cutlery for a buck or two. They can look pretty sad, but a skilled knife sharpener can make them better than new. Get some walnut oil for the handles and they will look fantastic too. Thanks for the A2A. ",
            "date": "Answered February 28, 2019",
            "views": "13",
            "upvotes": " View 4 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Rainer Habeck",
                    "user_href": "/profile/Rainer-Habeck"
                },
                {
                    "user_id": "Anna Ngo",
                    "user_href": "/profile/Anna-Ngo-6"
                },
                {
                    "user_id": "Phuzzy Bear",
                    "user_href": "/profile/Phuzzy-Bear"
                },
                {
                    "user_id": "Stan Jetton",
                    "user_href": "/profile/Stan-Jetton"
                }
            ]
        },
        {
            "author_info": {
                "name": "Jim Gordon",
                "href": "/profile/Jim-Gordon"
            },
            "answer_text": "I think Cutco knives are excellent for an average home cook.  They are very well-designed, well-made, look good with minimal care, hold an edge very well, and have a lifetime guarantee.  Rather than have my wife abuse my knives, we have a set of Cutco knives that she can use -- and I admit to using a couple of them for specialized tasks.  We also use a set of Cutco's steak knives. If they were a little lighter, if the handles fit my grip, and if the plastic handles weren't a bit slippery, I'd use all of them myself. Cutco makes THE best general purpose scissor (Sellers often demonstrate their quality by cutting a penny in half.),    an excellent garden pruner, and the incomparable Ka-Bar military fighting utility knife. ",
            "date": "Answered July 14, 2015",
            "views": "42",
            "upvotes": " View 9 Upvoters",
            "upvoters": [
                {
                    "user_id": "Ana Reder",
                    "user_href": "/profile/Ana-Reder"
                },
                {
                    "user_id": "Anna Ngo",
                    "user_href": "/profile/Anna-Ngo-6"
                },
                {
                    "user_id": "Jason Farrell",
                    "user_href": "/profile/Jason-Farrell-16"
                },
                {
                    "user_id": "Andrew Free",
                    "user_href": "/profile/Andrew-Free-4"
                },
                {
                    "user_id": "Mike Giles",
                    "user_href": "/profile/Mike-Giles-29"
                },
                {
                    "user_id": "Merry Cruise",
                    "user_href": "/profile/Merry-Cruise"
                },
                {
                    "user_id": "Tony Garcia",
                    "user_href": "/profile/Tony-Garcia"
                },
                {
                    "user_id": "Marc Bodnick",
                    "user_href": "/profile/Marc-Bodnick"
                },
                {
                    "user_id": "Garrick Saito",
                    "user_href": "/profile/Garrick-Saito"
                }
            ]
        },
        {
            "author_info": {
                "name": "Mark Seiffer",
                "href": "/profile/Mark-Seiffer-1"
            },
            "answer_text": "Cutco knives aren’t worth the money. Their blades are cheap stamped metal with aggressive serrations which the average person can’t sharpen. They make ragged cuts through meat, their breadknives don’t have offset handles, and the comparisons their salesmen are instructed to make between their brand and higher-end knives are fantasy. Get a three-piece set from Wusthof or Henckels (or drop a little more money and get a set from Shun). They’re nice and heavy, the handles are neutrally shaped, so you can grip them one way to chop and another to slice, and you can sharpen them with a home sharpener (I like to sharpen my own knives by hand, but an electric sharpener will put a razor edge on a good knife in seconds. Many people have never used a very sharp knife to prepare food; the difference is eye-opening). You can do more with them and they’ll last you the rest of your life. ",
            "date": "Answered June 22, 2017",
            "views": "41",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Phuzzy Bear",
                    "user_href": "/profile/Phuzzy-Bear"
                },
                {
                    "user_id": "Thomas Hodges",
                    "user_href": "/profile/Thomas-Hodges-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Christina Fojttl",
                "href": "/profile/Christina-Fojttl"
            },
            "answer_text": "Short answer: Yes I think Cutco knives are good quality, but the price seems to be little bit too high for the actual quality you are getting. I thought about buying Cutco knife set last month and decided not to do it after reading this review. Cutco Knives Reviews: Is It Really Worth It? - Knives Reviews ",
            "date": "Answered July 10, 2019",
            "views": "808",
            "upvotes": " View 52 Upvoters",
            "upvoters": [
                {
                    "user_id": "Nadezhda Gancheva",
                    "user_href": "/profile/Nadezhda-Gancheva"
                },
                {
                    "user_id": "Virginia K Thomas",
                    "user_href": "/profile/Virginia-K-Thomas"
                },
                {
                    "user_id": "Timothy E Lane",
                    "user_href": "/profile/Timothy-E-Lane"
                },
                {
                    "user_id": "Michale S Minnis",
                    "user_href": "/profile/Michale-S-Minnis"
                },
                {
                    "user_id": "Lindsey C Frazier",
                    "user_href": "/profile/Lindsey-C-Frazier"
                },
                {
                    "user_id": "Dale S Bethea",
                    "user_href": "/profile/Dale-S-Bethea"
                },
                {
                    "user_id": "Wayne H Ruby",
                    "user_href": "/profile/Wayne-H-Ruby"
                },
                {
                    "user_id": "Hattie E Morris",
                    "user_href": "/profile/Hattie-E-Morris"
                },
                {
                    "user_id": "Henry A Spivey",
                    "user_href": "/profile/Henry-A-Spivey"
                },
                {
                    "user_id": "Isaias L Smith",
                    "user_href": "/profile/Isaias-L-Smith"
                },
                {
                    "user_id": "John V Quick",
                    "user_href": "/profile/John-V-Quick"
                },
                {
                    "user_id": "Lawrence R Morin",
                    "user_href": "/profile/Lawrence-R-Morin"
                },
                {
                    "user_id": "Larry M Kyles",
                    "user_href": "/profile/Larry-M-Kyles"
                },
                {
                    "user_id": "Lisa R Hall",
                    "user_href": "/profile/Lisa-R-Hall"
                },
                {
                    "user_id": "Bessie J Bentley",
                    "user_href": "/profile/Bessie-J-Bentley"
                },
                {
                    "user_id": "Christina S Kang",
                    "user_href": "/profile/Christina-S-Kang"
                },
                {
                    "user_id": "Gregoria R Hewitt",
                    "user_href": "/profile/Gregoria-R-Hewitt"
                },
                {
                    "user_id": "Rosemary N Breeden",
                    "user_href": "/profile/Rosemary-N-Breeden"
                },
                {
                    "user_id": "Lora P Harper",
                    "user_href": "/profile/Lora-P-Harper"
                },
                {
                    "user_id": "Katherine R Baldwin",
                    "user_href": "/profile/Katherine-R-Baldwin"
                },
                {
                    "user_id": "Janet K Walker",
                    "user_href": "/profile/Janet-K-Walker"
                },
                {
                    "user_id": "Marie J Travers",
                    "user_href": "/profile/Marie-J-Travers"
                },
                {
                    "user_id": "Rebecca G Byrd",
                    "user_href": "/profile/Rebecca-G-Byrd"
                },
                {
                    "user_id": "Carl A Smith",
                    "user_href": "/profile/Carl-A-Smith-2"
                },
                {
                    "user_id": "Guy M Custer",
                    "user_href": "/profile/Guy-M-Custer"
                },
                {
                    "user_id": "Jimmy A Henderson",
                    "user_href": "/profile/Jimmy-A-Henderson"
                },
                {
                    "user_id": "Joshua L Brown",
                    "user_href": "/profile/Joshua-L-Brown"
                },
                {
                    "user_id": "Rony Cothran",
                    "user_href": "/profile/Rony-Cothran"
                },
                {
                    "user_id": "Julia Christine",
                    "user_href": "/profile/Julia-Christine-50"
                },
                {
                    "user_id": "Jeff Rivas",
                    "user_href": "/profile/Jeff-Rivas-2"
                },
                {
                    "user_id": "Haley Ethel",
                    "user_href": "/profile/Haley-Ethel"
                },
                {
                    "user_id": "Emily Kenned",
                    "user_href": "/profile/Emily-Kenned"
                },
                {
                    "user_id": "Joan G Speier",
                    "user_href": "/profile/Joan-G-Speier"
                },
                {
                    "user_id": "Dixie R Mathews",
                    "user_href": "/profile/Dixie-R-Mathews"
                },
                {
                    "user_id": "Nedra D Carter",
                    "user_href": "/profile/Nedra-D-Carter"
                },
                {
                    "user_id": "Shelia K Cunningham",
                    "user_href": "/profile/Shelia-K-Cunningham"
                },
                {
                    "user_id": "Paula W Hinson",
                    "user_href": "/profile/Paula-W-Hinson"
                },
                {
                    "user_id": "Hollie D Calderon",
                    "user_href": "/profile/Hollie-D-Calderon"
                },
                {
                    "user_id": "Ruby S Folk",
                    "user_href": "/profile/Ruby-S-Folk"
                },
                {
                    "user_id": "Edythe G Bachman",
                    "user_href": "/profile/Edythe-G-Bachman"
                },
                {
                    "user_id": "Martha J Hutchison",
                    "user_href": "/profile/Martha-J-Hutchison"
                },
                {
                    "user_id": "Stephanie J Jackson",
                    "user_href": "/profile/Stephanie-J-Jackson"
                },
                {
                    "user_id": "Philomena A Colley",
                    "user_href": "/profile/Philomena-A-Colley"
                },
                {
                    "user_id": "Gerardo H Thrash",
                    "user_href": "/profile/Gerardo-H-Thrash"
                },
                {
                    "user_id": "Derek V Pinson",
                    "user_href": "/profile/Derek-V-Pinson"
                },
                {
                    "user_id": "Mohammed T Bass",
                    "user_href": "/profile/Mohammed-T-Bass"
                },
                {
                    "user_id": "Thomas I Hartwell",
                    "user_href": "/profile/Thomas-I-Hartwell"
                },
                {
                    "user_id": "Miles T James",
                    "user_href": "/profile/Miles-T-James"
                },
                {
                    "user_id": "Robert C Renaud",
                    "user_href": "/profile/Robert-C-Renaud"
                },
                {
                    "user_id": "Jame G Peters",
                    "user_href": "/profile/Jame-G-Peters"
                },
                {
                    "user_id": "Vincent T Miller",
                    "user_href": "/profile/Vincent-T-Miller"
                },
                {
                    "user_id": "Jason A Collier",
                    "user_href": "/profile/Jason-A-Collier"
                }
            ]
        },
        {
            "author_info": {
                "name": "Lenaigh Higgins",
                "href": "/profile/Lenaigh-Higgins"
            },
            "answer_text": "I bought a 3 piece set (paring knife, spreader and a longer paring knife) maybe 20 years ago. I use them every day. I love them and totally happy with their quality. Over the years I've found more pieces in thrift stores. Like the cutco wooden block for $1, large chefs knife for .25, a ladle and wire stirrer for $1 each then the really long skinny carving knife for .50. I love that they are substantial, comfortable to hold, and made in the USA. ",
            "date": "Answered September 14, 2019",
            "views": "439",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "John McCormick",
                "href": "/profile/John-McCormick-165"
            },
            "answer_text": "I have had two sets of Cutco knives for at separate houses for more than twenty years. They work well and the company has been good about free resharpening of them. These are very utilitarian knives and hold their edge well in spite of misuse. If you are an expert chef you may want to spend more money on another brand. In my experience, Cutco delivers as promised, their stainless steel looks as good now as it did when I purchased it. No corrosion on the knives at the beach house where everything eventually corrodes. ",
            "date": "Answered June 28, 2019",
            "views": "570",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Scott Peterson",
                    "user_href": "/profile/Scott-Peterson-39"
                }
            ]
        },
        {
            "author_info": {
                "name": "Neeta Sharma",
                "href": "/profile/Neeta-Sharma-10"
            },
            "answer_text": "I've used Cutco knives before, and specifically the Santoku.  I prefer  my Wustof Santoku, honestly.  Long term, the Wustof held up better and  is my go-to knife.  The Cutco Santoku just sits in the knife drawer,  waiting for it's turn when I'm cooking like mad for the holidays and  can't be bothered to wash up my knives and just get out a new one to  keep chopping.  I find the Wustof more comfortable too, and slightly  more lightweight in a pleasing way. ",
            "date": "Answered June 30, 2015",
            "views": "12",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "John Ahn",
                    "user_href": "/profile/John-Ahn-30"
                }
            ]
        },
        {
            "author_info": {
                "name": "Joe Pepersack",
                "href": "/profile/Joe-Pepersack"
            },
            "answer_text": "No. They are made of cheap steel and very low grade construction. They are very overpriced for what they are and use a very aggressive, manipulative, and deceptive sales pitch to foist them off on people… the same kind of chicanery that vacuum cleaner salesmen use. Basically they set up a rigged apples-to-oranges comparison that most people don't see thru to show that their product is “better\". And, judging from the comments here, the marketing / sales pitch works in selling a $40 knife for $150 ",
            "date": "Answered March 9, 2020",
            "views": "273",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Aaron Jantzen",
                "href": "/profile/Aaron-Jantzen"
            },
            "answer_text": "They’re ok, but there are some substantially better knives available for reasonable prices. Cutco handles aren’t particularly ergonomic and lack some safety features and heft of better knives. I’d prefer a set of Mercers, which are better made, sharpen more easily and should last longer.  Compare that to the Cutco’s:  ",
            "date": "Answered July 27, 2017",
            "views": "26",
            "upvotes": " View 6 Upvoters",
            "upvoters": [
                {
                    "user_id": "Anna Ngo",
                    "user_href": "/profile/Anna-Ngo-6"
                },
                {
                    "user_id": "Eileen Wilson",
                    "user_href": "/profile/Eileen-Wilson-77"
                },
                {
                    "user_id": "Gary Rush",
                    "user_href": "/profile/Gary-Rush-3"
                },
                {
                    "user_id": "Daniel Berry",
                    "user_href": "/profile/Daniel-Berry-18"
                },
                {
                    "user_id": "Vern Stewart",
                    "user_href": "/profile/Vern-Stewart"
                },
                {
                    "user_id": "Lovisha Arora",
                    "user_href": "/profile/Lovisha-Arora"
                }
            ]
        },
        {
            "author_info": {
                "name": "Avi Goodman",
                "href": "/profile/Avi-Goodman"
            },
            "answer_text": "No. I use to sell them. They are made from soft steel that gets dull fast. They will offer to send someone out to sharpen your knives in your own home, so they can get a salesman in front of you to sell you more stuff. When I was selling cutco I didn't understand the steel. Now that I'm my own bladesmith and smelt my own steel for my own knives, I understand much more about the steel and I'll never sell, buy, or recommend Cutco ever again. ",
            "date": "Answered October 27, 2018",
            "views": "774",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Phuzzy Bear",
                    "user_href": "/profile/Phuzzy-Bear"
                }
            ]
        },
        {
            "author_info": {
                "name": "James Browne",
                "href": "/profile/James-Browne-33"
            },
            "answer_text": "I had a friend who was given a set of Cutco knives about 15 years ago. They are beautiful knives don't think I wasn't impressed but for the cost I would have liked a change or better selection. But they cut great, I am just personally not a serrated blade fan and I found the filet blade rigid, where a flexible one serves Pacific Salmon and Rock Cod better in my hand. ",
            "date": "Answered May 9, 2018",
            "views": "42",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Brenton Greenwood",
                "href": "/profile/Brenton-Greenwood"
            },
            "answer_text": "I sold Cutco knives when I was 17. I had one customer, my mommy. She used them until she died 6 years ago and I inherited them and use them daily. They still work very well. I’ve worked professionally in the food industry as a chef and a cook, but I wouldn’t buy them for that kind of work. A couple months ago I turned 63. That’s not a typo. ",
            "date": "Answered May 7, 2020",
            "views": "110",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Albert Ho",
                "href": "/profile/Albert-Ho-17"
            },
            "answer_text": "Cutco gets a bad reputation in many circles because their knives are stamped rather than forged. I generally agree. Cutco knives are usually not well balanced, dull pretty quickly, and just don't match the tried-and-true Wusthof or Henckels in cutting ability. However, they make the best scissors and spreader that I have seen.  ",
            "date": "Answered January 10, 2016",
            "views": "23",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Daniel Sooner",
                "href": "/profile/Daniel-Sooner"
            },
            "answer_text": "Personally, I can’t really speak to the make or materials or anything, I’m not really qualified. I’ve had mine for a few years now, and I still haven’t had to have them sharpened, yet, they still cut really well. My parents have only had to have them sharpened twice as far as I know, and they’ve had them since my dad was in college. They seem to do really well for me, though I’m no pro cook. ",
            "date": "Answered June 17, 2018",
            "views": "533",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Ron Wiseman",
                "href": "/profile/Ron-Wiseman"
            },
            "answer_text": "No. I’ve had Cutco knives and I’ve had other high-end knives. I much prefer the other ones. I’ve found Cutco knives to be easy to break the tips off of, and easy to bend the blade. You can sharpen them, but they don’t hold an edge for very long. ",
            "date": "Answered February 28, 2019",
            "views": "154",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Peter Zaper",
                    "user_href": "/profile/Peter-Zaper-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Christian Gehman",
                "href": "/profile/Christian-Gehman"
            },
            "answer_text": "Cutco knives are great.  The scissors that cut a penny are great.  The \"steak\" knives make one of the best paring knives I ever owned.  Mine were purloined by a brother in law - may he live in Thule forever. ",
            "date": "Answered July 10, 2015",
            "views": "455",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Sawblade Express",
                "href": "/profile/Sawblade-Express"
            },
            "answer_text": "Yes of course Cutco is of good quality it should be stainless steel because you can cut leaves bay leaves or cilantro or any herb from cutco knives so they are made for kitchen use only. Saw blade express offer a huge range of variety. ",
            "date": "Answered December 28, 2018",
            "views": "93",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Adrian Lopez",
                "href": "/profile/Adrian-Lopez-187"
            },
            "answer_text": "Yes just got a set, sharp as hell though. My mother in law recommended them to us and we got the same ones she got 30 years ago. Free sharpening for life and free replacement if they break, she’s had to do neither. A lil pricey but a set you can pass down to the next gen for sure. ",
            "date": "Answered October 11, 2019",
            "views": "319",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Mark Fisher",
                "href": "/profile/Mark-Fisher-47"
            },
            "answer_text": "Not really. I bought a couple at an estate sale and tried to sharpen it. It was obviously a soft, low quality stainless. I got rid of them. There are worse, but not for the price they charge. ",
            "date": "Answered April 20, 2019",
            "views": "97",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Steve Snyder",
                "href": "/profile/Steve-Snyder-49"
            },
            "answer_text": "bleah. For SS knives get Globals.  For carbon steel knives I like Warthers.  Stamped knives (like cutco) should generally be avoided. ",
            "date": "Answered October 13, 2017",
            "views": "911",
            "upvotes": "0"
        }
    ]
}