{
    "title": "Can the Xbox Series S play Xbox One games? - Quora",
    "tags": [
        "Xbox One (video game console)",
        "Xbox (console series)",
        "Video Game Consoles"
    ],
    "response": [
        {
            "author_info": {
                "name": "Sean Sivils",
                "href": "/profile/Sean-Sivils-2"
            },
            "answer_text": "The Series S will be the all digital version of the Series X. So if you have any One games on disc, you won’t be able to play them on the Series S. However, Smart Delivery is one of the selling features for the next-gen system. It will automatically give you the best version of your games. So if you bought last year’s smash hit Resident Evil 2, if you play it on the Series X, it will be updated to a Series X version. The best part of it is that you’ll still be able to play the same games on your Xbox One, so long as they’re actually Xbox One games. This is so you won’t have to repurchase your entire library. A good thing for me, because I have several games on my Xbox One, and it’d be cost-prohibitive to rebuy them. Especially with the price increase for the next-gen games. So if your One has digital games, you should be able to play them on the Series S. So long as they’re on the list. I expect the library of eligible games to constantly be expanded, as more people decide to upgrade to the next-gen system, to be released this Holiday season. Microsoft Unveils Xbox Series S Specs During a Week of Next-Gen Console News ",
            "date": "Answered September 10, 2020",
            "views": "50",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Patrick Devik",
                "href": "/profile/Patrick-Devik"
            },
            "answer_text": "Microsoft has stated that Xbox Series X will support all games playable on Xbox One (excluding those that require the Kinect sensor), including those Xbox 360 and original Xbox console games currently supported through backward compatibility on the Xbox One. ",
            "date": "Answered September 10, 2020",
            "views": "24",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Hector De la Rocha",
                "href": "/profile/Hector-De-la-Rocha"
            },
            "answer_text": "Short answer: Yes. Long answer: Yes, but only if it is digital. If you have a disk you won’t be able to because it has no disk drive. In fact, you would be able to play all Xbox One games in the Series S. (Again, as long as it is digital) ",
            "date": "Answered September 15, 2020",
            "views": "5",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "David Sexton",
                "href": "/profile/David-Sexton-3"
            },
            "answer_text": "Yes because games are digital it just loads up as norm! The biggy is if they play on they New version coming out in October hopefully it should play both versions! ",
            "date": "Answered September 16, 2020",
            "views": "14",
            "upvotes": "0"
        }
    ]
}