{
    "title": "Can you explain what Google Fi is? - Quora",
    "tags": [
        "Google Fi",
        "Wireless Technology",
        "Wi-Fi",
        "iPhones (product)",
        "The Internet",
        "Google (company)",
        "Technology"
    ],
    "response": [
        {
            "author_info": {
                "name": "Alexander Lee",
                "href": "/profile/Alexander-Lee-梅治-新太"
            },
            "answer_text": "Google Fi is a phone plan, much like the ones you get from Verizon and AT&T. Unlike Verizon and AT&T, however, Google Fi has one very straightforward plan— and it doesn’t come with any bells or whistles. Unlimited talk and text comes with the plan, and costs $20 a month. As for data, you pay for what you use; if you use more data this month, your bill will be higher for this month (plus $20 for talk and text)if you use less data this month, your bill will be lower for this month (plus $20 for talk and text)For the average consumer, this is all you need to know. For curious individuals, continue reading: Google Fi is a wireless telecommunications network carrier, much like Verizon and AT&T. The technical term is “virtual network operator”, because, unlike Verizon and AT&T, Google Fi doesn’t actually own the physical networking infrastructure— instead, they borrow existing infrastructure from Sprint, T-Mobile, U.S. Cellular, and Three (for international coverage). Google Fi can also use public WiFi hotspots to fill in the gaps when signal strength is low or unstable. Phones that are designed for Google Fi (Google Pixel phones) are able to switch between these networks seamlessly, depending on signal strength. Other phones, however, will take a little more time to switch between the networks. ",
            "date": "Answered November 28, 2018",
            "views": "37",
            "upvotes": " View 8 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Satyam Kumar",
                    "user_href": "/profile/Satyam-Kumar-447"
                },
                {
                    "user_id": "Ed Chang",
                    "user_href": "/profile/Ed-Chang-1"
                },
                {
                    "user_id": "K Hemanth",
                    "user_href": "/profile/K-Hemanth-1"
                },
                {
                    "user_id": "Aditya Krishna",
                    "user_href": "/profile/Aditya-Krishna-89"
                },
                {
                    "user_id": "Sumedh Khanolkar",
                    "user_href": "/profile/Sumedh-Khanolkar"
                },
                {
                    "user_id": "Guy D McCardle, Jr.",
                    "user_href": "/profile/Guy-D-McCardle-Jr"
                },
                {
                    "user_id": "Greg Osborne",
                    "user_href": "/profile/Greg-Osborne-8"
                },
                {
                    "user_id": "Rohan A Kaushal",
                    "user_href": "/profile/Rohan-A-Kaushal"
                }
            ]
        },
        {
            "author_info": {
                "name": "Joe Emanon",
                "href": "/profile/Joe-Emanon"
            },
            "answer_text": "Google Fi is a cellular voice/text/data plan utilizing the Sprint, T-Mobile and US Cellular networks to offer a \"different\" type of monthly plan. Basically you pay a monthly base fee ($20) for unlimited voice and text then pay for data usage at a per gb rate of $10. The per gb rate caps a 6gb thereafter it's \"free\" (subject to throttling once you pass an upper limit). If your device(s) are compatible with the networks used its possible to save a few bucks depending upon the amount of data you use on a monthly basis. Go to the Fi website and use the online calculator to estimate your monthly costs. It can also estimate a plan for multiple users. For me, it's not useful as my carrier isn't included and the Fi networks used have lesser network coverage in my area. Perhaps once SprinT-Mobile fully merges and implements their 5G network, Google Fi could become a strong competitor for the three biggest MSP's (Mobile Service Providers). Of course that means owning new 5G supported phonre/devices. The plus to that is once 5G is fully operational (with 4G LTE-A as the secondary backup) the USA mobility market will finally be wholly GSM based as CDMA fades into history. After that it's a matter of getting OEMs to manufacture devices that support all of the LTE-A/5G frequency bands. Then any unlocked device can be networked to any MSP. NOTE: read and review the terms and conditions of the Google Fi network. ",
            "date": "Answered November 28, 2018",
            "views": "205",
            "upvotes": "0"
        }
    ]
}