{
    "title": "Can the global Internet be saved? - Quora",
    "tags": [
        "China Focus",
        "World Wide Web",
        "Globalization",
        "Information Technology",
        "Computer Networking",
        "The Internet"
    ],
    "response": [
        {
            "author_info": {
                "name": "Tony Li",
                "href": "/profile/Tony-Li-19"
            },
            "answer_text": "No, the Internet cannot be saved. Nor does it need to be saved. The real question is whether or not we can have the intelligence to ignore ignorant columnists who don’t understand what they are talking about. The Internet does not need censorship. That is a tool used by oppressive regimes to limit the flow of information. It’s a means of oppressive control. TikTok and WeChat present no threat to the Internet or to the United States. But censorship does. The real question is whether or not the U.S. can be saved from its current administration. We will find out November 3rd. ",
            "date": "Answered October 23, 2020",
            "views": "229",
            "upvotes": " View 5 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Al Klein",
                    "user_href": "/profile/Al-Klein"
                },
                {
                    "user_id": "Bol Stevenhagen",
                    "user_href": "/profile/Bol-Stevenhagen"
                },
                {
                    "user_id": "Darren Cromer",
                    "user_href": "/profile/Darren-Cromer"
                },
                {
                    "user_id": "Mohamed Abdullahi",
                    "user_href": "/profile/Mohamed-Abdullahi-28"
                },
                {
                    "user_id": "Marty Fouts",
                    "user_href": "/profile/Marty-Fouts-2"
                }
            ]
        },
        {
            "author_info": {
                "name": "Hans Witvliet",
                "href": "/profile/Hans-Witvliet"
            },
            "answer_text": "You might perceive the impression that there is a “global internet”, but there ain’t. World-wide there are millions of data-networks. And there are companies connecting some of those networks together. also, there is a mechanism to uniquely identify machines/resources: DNS, And there are mechanisms to route data from one to another. All of those together form the basis of what people perceive as “Internet”, a concept. So Internet can not “be saved” ",
            "date": "Answered October 23, 2020",
            "views": "43",
            "upvotes": " Answer requested by China Focus"
        }
    ]
}