{
    "title": "Can someone remotely access my phone? - Quora",
    "tags": [
        "Remote Access",
        "Computer Hacking (security)",
        "Mobile Technology",
        "Technology"
    ],
    "response": [
        {
            "author_info": {
                "name": "Maxime Jouhan  Chevallier",
                "href": "/profile/Maxime-Jouhan-Chevallier"
            },
            "answer_text": "When the Mobile telephone got officially first introduced, UK Police criticized it, saying it was a gift to the criminal fraternity of the underworld. They were entirely correct. Mobile phones now get annoyingly used to take illegal, non-authorized photographs of people without their knowledge or consent, said photographs then getting sent to burglars, gangs of train and airport or high street pickpockets, thieves, rapists, Hotel watching thieves in and other scum to set up their victims. When the author was living and working in Paris, he even caught several Jehovah's Witness Elders and Ministerial Servants secretly and by the way, completely, ILLEGALLY filming an ex member of their cult church whose daily travel routine took him to several points where the group regularly placed their bookselling trolleys during the day on the Paris pavements. Also, criminal gangs, and spies, also use them to send data about somebody they rea trying to track down to kill or interrogate, right the way around the world in just a few annoying seconds. Also, those who “have something against someone” such as jilted unwanted or obessive “lovers”, troublesome divorced partners seeking to wreck or to spoil the new relationship of their former partner, or sex pests, stalkers, and those with so-called mental illness, use their smartphones or I Pads to terrorise innocent people they seem to think they have some imagined or deluded “right” to hunt down, terrorize, and intimidate anywhere they try to go on the planet (i do not exagerate this point!!!), and ruin their lives. DEREK BOND “amnesia canoe man”. Remember the strange remarkable case of Derek Bond? he and his wife did an Insurance con, a financial sting, and faked Derek's death in a canoeing accident. They then purchased an apartement in the Far East using the ill-gotten Insurance monies. But guess how he got captured and “blown?” Strangely, unbelievably, apparently, someone took the couple's photograph on a smartphone or digital camera, the photo got uploaded onto internet site, and BINGO! Voila Mr. Derek BOND (not quIte James BOND Derek, but I have to say, congratulations are in order for such a daring and audacious manoeuvre, it NEARLY work.!!!!! Pity he does not get a job with HMG really, you need those types on the right side!!! Never underestimate the power of a piece of paper such as a photograph. Dereks “ruse” to walk into the police post and claim amnesia forgetfulness, was truly unforgettable….. To “save her Majestys Government further future embarrassments” Mr Derek BOND (not James) is now understood from newspaper articles, to be under round the clock surveillance by MI5……..and disuadedfrom leaving the country to Ukraine on “holiday”….hmmmmm When I was away visiting England, a ex britsh army runaway, broke his way inside my seven-ton Motorhome, stole goods of value, and then sprayed faeces all over the place, took photograph of this, and maliciously sent it to someone else, claiming entirely falsely and maliciously, taht this was “somehow” done by me. Except that i was two thousand miles away at the sodding time, and being the victim of their “number two” who had also broekn into my Renault van and damaged the steering hydraulics to prevent me returning in time to stop the other chap stealing the Motorhome to try to illegally “resell” himself, to give the gang money for their “hand to mouth” lifestyle in Southern France. Do NOT be too relaxed about smartphone security, or about emails. Criminal gangs often have eyes and ars in a certain cyber net or cyber cafes and watch to see who writes in what language, and take the photo of your screen or passwords etc behind your back, or have hidden camera above behind the credit card terminal to steal your money. I personally had direct experience of a so-called Buddhist man in the French South who preys on vulnerable women, steals their jewellery, and also formed a criminal cadre or framework, of persons watching tourist used cash distributor machines in the town of Albi in the French South. Very simply he was NOT who or how he appeared to others and used and abused his way into peoples trust and confidences. The Law needs to be changed. Criminals operating in France but based and from England, have used Smartphones to track down people to rob and pilfer their homes or places of Business. Sharing and sending stolen emails and text messages, as well as stolen smartphones from their victims. DRONES DRONES are now increasingly being used by snooping, nosey individuals to spie or watch properties in France to see if their owners are at home or not. Whilst this is against the law, you try “proving it”. You might catch the machine on film over or above your property, but this is only a beginning. The legal process costs YOU THE VICTIM much money and time. It is better is possible to follow the annoying machine to try to identify the address it has taken off from and returned to, and politely knock on the front door. DRONES are fitted with cameras, can take films, recordings, and VIOLATE PROPERTY OR PRIVACY LAWSwhen used incorrectly. Acquire your local law enforcement statements policies and READ them FIRST!!! Smartphone-equipped remote drone operators, or computer laptops etc, can view your house or garden from above (Royals going on Holiday with no bikini tops on taking strong note!!!!!!) I tire of every few years ANOTHER Royal missing bikini cheap Tabloid newspaper revolting scandals….don't give the buggers the chance!!!!!!! We also bought a drone, rather “earlier”, along with a remote control aeroplane and helicopter, to which can be fitted CCTV camera linked to a smartphone, to film “pimping trespasser” as he tries to break through your garden fence. He actually threw a smoke grenade then crept inside our garden at 1,30 pm one dark night, and knocked out a new CCTV camera I had hidden inside an old ruined building. Until one night someone accidentally left the cellar trap door open…. CHECK LOCAL LAWS FIRST!!!! Runaway British ex Military Mr. PETER SEYMOUR was last week arrested in SURENS in France, after terrorizing the British ex-patriot and French community, including me, for several years. At one time, I went public, on Facebook last year, asking to form a team to track this type of troublemaker down, who had been regularly trespassing, damaging, stealing, taking tools etc across France.. We had to stop building work and concentrate instead on security and CCTV etc, to slow down and aggravate this sort of person, i even one day used army field craft to track him down to the nearby village tree line where he was hiding up a large tree, using it to watch our village to select his next house victim….I played cat and mouse with that bastard for two years, it was “high on content” i can tell you. Want the bad news? there still someone else out their who also does these things, another British army runs away….can you people keep anyone under control?????!!!!! Such persons are scum and filth. Do NOT accept this situation, and fight back legally and change things. In France recently, the “Black Square” organisation used smartphones and social Media to hijack a Demonstration in Paris. People from Germany, Scandinavia, Spain, Italy, Portugal, as well as France, all used social media linked to smartphones to organise civil demonstration and disruptions in Paris, police reported here. Mobile telephones Signal reseau can be triangulated. Whether you give “Google” permission to use the GeoLocation setting or not. It has been publicly known for years that the American NSA and certain other Monitoring organisation, such as DST and GCHQ Cheltenham monitor telephones and emails for legal reasons..The recent and infamous case of the former soldier and child murderer Nordahl Leylande is a strong case in point. He had lied to the Police, and it was hard to get evidence against him. So, the Gendarmerie of Police TRIANGULATED HIS ENTIRE MOBILE PHONE POSITION HISTORY, they went back a long time, to show up his personal presence at a place and location he had denied being. Because of this, it is that he was implicated. There exists ALWAYS the risk of SMS text and MMS Data packets of the signal from your Smartphone being intercepted and hijacked, and taken and read on a “remote Device” by third-party persons who may have hostile intentions. Pay special ATTENTION if your text messages arrive at your friends Smartphone unusually slowly, later than they should do. And especially too, if those newly arrived messages are “out of sequence” from the time and order in which they “left” got sent from, your own Smartphone. One unusual feature that sometimes occurs is when suddenly, for no obvious reason, your smartphone time gets changed, typically by one hour, or the date setting seems to change on its own. This is an incidental outcome arising from your smartphone device being tampered with remotely. One other less common, but an obvious sign, is the “fente” or sim card slot in your smartphone suddenly getting “blocked” but by an outside cause rather than your regular telephone service operator provider. This means someone is trying to isolate you and cut you off from help, and might also be a pre-warning that some sort of wrongdoing is imminent. I strongly recommend to any vulnerable person, that they buy and conceal, a small emergencey telephone handset, with charged battery, somewhere they can reach it in case of emergency. if you are being persistently targeted by a criminal, there is a reason, and you could be in real danger. Make so that it is you can call for help and get away from the area. Tell a friend immediately if anything like this happens. it is rare, but it is also serious. Beware because this is a sure sign you are being targeted.if an entire document or email suddenly dissapears while you are working on it, or, when you click on a well known friends e mail, the whole email also vanishes, again, THIS IS A CERTAIN SIGN of illegal and wrongfull computer actions carried out by criminals. These are clear warning signs that an OP Point has been inserted somewhere between YOU and everyone “else” in the public Domain.Data headers, contained in web browser lines, (the long lines and numbers in the web navigation bar) can give a certain amount of clues, and you should read them carefully. (the Book How to set up and run a web site 4th Edition, gives the break down of this information and how to interpret it.) I first came across this when building a charity web site in England some years ago. Someone hacked into the e mailer bulk, and began to send crackpot and malicious nonsense e mails to us. By the time whoever this person was had finished, we had several hundred “potty” and strange Emails. I later discovered they had also stolen the name and address of a solicitor I used, and sent him a weitd parcel containing more rubbish and queeer strange nonsense. It was highly dangerous as well as deeply embarrassing, and i vowed to catch the devil who was doing it. I bought a book on computer FORENSICS, (the latest version of this book is by the way called “incident response and computer Forensics” by Jason T. Lutgens, Mathew Pepe, and Kevin Mandia, published by Mr Graw Hill Education”. and several other good quality computer and internet type security books, and got down to work to study the audit trail. It took bloody weeks, but after the trouble, we had all had, it was worth It on THIS occasion. But I caution, it is often BETTER if possible, to simply create a ALL NEW Informatic environment, system, rather than to spend long tiresome hours and weeks of days searching through server and browser and log file informations…YAWNNNNN very boring!!!!! It is really better not to link or attach files or devices of your smartphones to internet connection or wifi connected computers. Once your details are out there, you just dont know who has them anymore. They were, of course, a stay at home all day weirdo computer freak, and trying to get them busted was sadly impossible because he claimed “mental illness”!!!!! The UK Law about so-called “mental Illness” needs review and Reform, because abusers and computer freaks and stalkers, and internet bullying, easily go unpunished because the abusers who perpetrate this, know they can “get out of it” by “becoming unwell” when it suits them!!!!! This has NOT, however, stopped us from identifying and avoiding the sham, phoney, false sick “Nutter” who did all this damage to our Facebook and computer hard drive. Clever enough to horrify everybody, run several busy computers and with a bedroom that looked like Jodrell bank or NASA, write strange things, and hack our computer email, try to make trouble with my lawyers, yet “not fit to be detained”???? !!!!! Rubbish in my view. The laws about data theft need urgent review!!!! Same for Smartphones, nowadays nearly as powerful a gadget as a computer after all. The computer misuse act is a noble piece of legislation, but only vulnerable people respect this law. However, be aware, professional hackers also KNOW the same things, and it has not been unheard off for finaly the Federal Agency or the Police to arrive, at the location, only to discover a laptop inside an old truck or abandoned building, and NO person. They “bounce” the data and signals halfway around the world and you have been clever enough to reach just one end of the “octopus” of their data theft and fraud.Echoes on your telephone during conversations are also a sure sign especially concerned when for example, photographs, or emails, or documents “somehow” vanish from your folders, or files. Or you suddenly find you cannot log on to a social media or known and frequently used site. It strongly implies someone has stolen through “phishing” your smartphone passwords. Check your social media urgently, if you suspect data theft on your smartphone, because it is not unknown for criminal persons, with a malicious nature, to attack, steal, or try to delete, destroy, the albums or articles you have written on media sites. If you are an International business person, and own copyrights, or some intellectual property, be especially prudent to secure the information. Personally, I do NOT recommend storage of Intellectual property on a Tablet or Smartphone for this reason. But please read below for alternative, higher security methods to safeguard personal or Corporate data, by using HIGH SECURITY FEATURED surveillance proof smartphones in urgency, I can only recommend you change your telephone handset (and IP address) every week or so until you can get rid of them because it takes apparently a week for a hacker team to realign their equipment to Monitor you again. But stay ahead of the “game” because technology is always changing rapidly, and what was impossible yesterday might happen tomorrow. During the late 1980s and early 1990s, i was under illegal private surveillance by a neo-nazi Group in England. I became aware of this due to certain “similar” events, on my then ordinary BT telephone. I knew a civil servant, recently retired, who checked and confirmed that i was being eavesdropped. Which is what from the odd calls, and noise on the line I had suspected for some time. If you discover a “problem” and then take “steps” to buy a new telephone, but then you receive soon after activation a “quiet and not spoken call” from an unknown number, which, when you try ringing back proves to be “unavailable” it is a sure sign that the persons hacking into your Smartphone are trying to regain a “handle” back into your Phone handset signal. Be suspicious, this again tells you things are not normal.And by the way, the ONLY LEGAL AUTHORISATION TO TAP A PHONE WIRE HAS TO BE ISSUED BY THE UK GOVERNMENT HOME OFFICE. Anybody else doing this, is surely Hostile. You have been warned. I do not recommend that you use WIFI or Wireless Transmissions, as, especially in a densely populated City or urban areas, there are an enormous amount of Wireless signals, Hacking across WIFI and Orange WIFI Boxes wifi signals to read private information is a serious problem. WARNING In France and England, a certain number of British persons operate a criminal gang, which specializes in targeting Ex patriot couples and families houses, to hack into their financial transactions and Internet contacts, and phone numbers, then track them to rob your house when you are “out”.The signals and frequencies from some of these type boxes can be illegaly “modified” and changed to other frequencies. Commensurately, so therefore also are the Mobile phone telephone numbers that become associated with the Orange type boxes , as listed network shared devices, on any “Home network”.I heard about one UK household who suddenly had their orange Box “spiked”. It was then cunningly “Modified” and switched to a frequency monitored by the gang, so they could target associates and other English people in the area to steal their money.And by the way, any WIFI CCTV home security products linked, can also be hacked and altered, or wiped and turned off from their recording schedules and settings, as i recently found out. WIFI, along with access to Smartphones and Computers, is NOT a safe technology, (show me what is??).One less obvious, yet lethal trick, as tried on me a few years ago. A New Age “religious Leader” showed up uninvited and unannounced at a farm i was renting in France. He asked to recharge his smartphone tablet in our house. He then set about various other “scams” with our n french neighbours. Checking the smartphone, i discovered he had set it to the geolocation of our address.Presumably to then give our whereabouts to cronies. This annoying and dishonest individual then sent encoded pictures, (x vif y vif) of our rented private house to certain persons, who, unsurprisingly, turned out to once again have connections to the gang who robbed us several years before!!! So they sent data knowing it would reveal our address, and abusing us in our own home. The hundred thousand dollar question I ask is this. How the hell did HE find us???? We had just moved house over 850 kilometres to get away from this!!! This sort of thing makes me feel really mean and nasty!!! I also took his car registration and some photographs to protect our position in case there was trouble from them later. We did experience serious trouble with intruders and finished up having to move house. Be warned!French Police came to within 3.5 minutes of catching the intruders, who had by the way, also jammed and technically altered our WIFI CCTV Cameras, so that they failed to function properly or give evidence to the cops. I strongly recommend to you that you avoid where practical WIFI CCTV based security camera type systems because there are proven ways for criminals to tamper with them, leaving you wide open to attack and vulnerable without legal proof of their illegal intrusion. Wired systems do provide a good range of wired type CCTV cameras which overcome this problem, by non use of WIFI sensitive cameras and wires instead of wifi.The subject of home security is beyond the remit of this question article, but is equally a part of resolving persistent criminal privacy issues. We did manage to get some pictures later. the technical nightmare of trying to defend your home, property, and loved ones from criminal menaces such as these, became a full-time job for me, and soon became knowledgeable about some of the issues surrounding WIFI Smartphones and the home was I can tell you, a real EYE OPENER WARNING. Another dirty and common trick used by criminals, and persons who practice illegal surveillance of subjects abroad, also involves misuse of the Smartphone.They set their smartphone to “record”, or “Video record” to spie and eavesdrop on people they are setting up for a scam or a sting or robbery or violent assault of some sort. BEWARE!!! Warning. Thieves, Burglars, and Assassins, usually follow around and shadow, stalk, their next victim for some time before making their attack, so if you become aware of someone repeatedly in the background, repeated unusual or irregular events, take urgent steps. Acting as if they have just texted someone, or written a text or some “normal” reason, they then place their smartphone on your restaurant table or nearby, or somewhere hidden under a coat they are holding, to take illegal tape recordings and films of their victims and their motor vehicles. They also stick GPS Tracker Dots onto your motor vehicle, scooter or Motorbike, etc, to have you tracked to your address or a friends etc.They then park outside nearby to watch and take more illegal photos. And often they park a vehicle with a smartphone mounted on the dashboard, which is also taking illegal surveillance footage and recordings. They frequently establish the “routine” and “pattern” of their targets. Such as where you go to the shops and the bank, what bus you take or where you park your car often.And of course, when you will be not at home. There are a few steps you can do to prove or prevent his, other than installing your own secret surveillance camera in your own bag or motor vehicle, to take pictures of those persons. Or use your own Smartphone to catch the devils out doing it.Check your local laws on the subject first. It is a nasty dirty situation to find yourself in, and believe me, all this happens rather more often than innocent passers-by could imagine. Smartphones are a daily normal object now, and far too easy for a wrongdoer to abuse.Mobile phones and computers have become a major source of criminal income in recent years. While it might be “possible” to prove illegal surveillance over time, through hidden legally approved CCTV camera etc, which by the way, can be linked to your own Smartphone, going to the Police or courts is expensive, embarrassing, time-consuming, and does not stop the illegal actions on its own. And hiring a Private eye detective, another way, is also highly expensive and time-consuming. An ounce of prevention is a better way than a pound of cure.If you become aware of any “irregularities” and unusual people vehicles or events, and believe you are being targeted, keep a diary, tell a friend, IF you can take discreet photos of persons hanging around, change your shopping and leisure routines and places, and try to “randomize” your activity.where possible, to confuse them and shake them off your trail. DO NOT under any circumstances confront a suspicious person, and leave the area immediately.Go to the Police, and take a friend with you for moral support. Take Legal Advice from an Advocate qualified in the Legal field you need.Make arrangements to improve the safety and security of your home. Consider your recent activity, to see if you can discover where you have acquired your two-legged problems from. Make changes. See if the “problem” walks. If not, take further steps. I remember a while ago, people on the London Underground and on Buses, were getting “Blue jacked”, by somebody sat very nearby, who was able to intercept he Bluetooth settings of their Smartphones, intercept them, and then set up a hacking portal to steal Financial and personal Confidential Data.Smartphones, NEVER has the word “smart” been more deceitfully used. these are open doors to theives. You might change passwords, change sims, change E Mails, but if you have a bandit on your tail, you must take more serious countermeasures. Regardless of whether you run a Security programme, Firewall, or Anti Virus Applications, or one operating system based on Windows or Android, there are few Smartphones that claim to be hack proof, but there are SOME. There are four or five high security smartphones currently under review, if you search the internet you can read what they have to offer. It is worth examining the possibilities offered by these different designs because they are currently available on the Western European market for the public.Not believed currently to be available yet, there is also another smartphone device that is causing quite a stir right now.In response to the nuisance of cyber criminality, Russia has developed the TAIGA. A Smartphone Made in Russia Claims to be “Surveillance-Proof” I mention this smartphone here, because of my knowledge and belief, this is the only handset device that claims to be totally hacker proof, surveillance proof. And therefore, hopefully, finaly gets over all of the associated troubles with smartphone usage. In Brief Russian IT-security firm InfoWatch unveiled a new smartphone that promises to protect against hacking and spyware. The TaigaPhone claims to give users full control over their information and prevent unauthorized remote connections. As the little computing devices in our hands become smarter and connectivity becomes simpler, it’s no surprise security breaches have become more common. While most smartphones generally promise security, none perhaps can compare to Russian IT-security firm and their newest device.TAIGA unveiled on Friday by InfoWatch president Natalya Kaspersky . The TAIGA smartphone promises to be surveillance-proof. “We have created it for the corporate market,” the Kaspersky Lab co-founder said.InfoWatch CEO Alexei Nagorniy said that TaigaPhone users have the ability to “fully control all the information which goes through this mobile device,” thanks to a system developed by mobile cybersecurity solutions firm.InfoWatch’s firmware protects it from “an unauthorized remote connection to the phone’s data as well as the information capture,” he added. Anti-Spyware Device InfoWatch claims that the TaigaPhone guarantees total user confidentiality, device location tracking, and protection from data leaks. “Half of all data loss in Russia happens on mobile devices, we intend to fix that problem with the TaigaPhone,” said InfoWatch representative Grigoriy Vasilyev, speaking to investors at BIS.Below. High security smartphones do exist, and are another alternative now available to stop the serious problems caused by Data theft and criminal gangs stealing from private telephones. The Russian TAIGA is quietly causing quite a stir. It claims to be surveillance proof. For me personaly, given my already very large and rather annoying extra unpaid workload, fixing software, Telecharge Appplications, repairing sabotaged WIFI CCTV systems and vehicles, caused from malicious Smartphone hackers and Computer hackers, stealing photos, letters or e mails and generaly messing up the smartphone settings or computers i might have linked to them sometimes,I welcome any reliable Secured Smartphone option that stops this public and private nuisance. I strongly recommend you buy a smartphone “backup device” and regularly once a week or more, make data backups of your smartphone, as you should a computer system. One often has forgotten problem, is the disruption, upset, and hurt, caused by such actions, to the victims, and the high financial costs to victims or business interests who have had things stolen or corrupted, and their privacy violated. Having to report the issue to the Police, can be upsetting and embarrassing, and make victims feel rather stupid. Also the costs of replacing smartphones or repairing them, is very high financially. Worse still, if you have had irreplaceable photographs or important files stolen. Some Police forces, operate an Online cyber or data theft crime reporting force, where you can simply log on and report what is happening to the police; We did this with the Gendarmerie of Police who run one in France. Check with your local law enforcement station for their policy. I show the above Taiga smartphone phone solely because it is the one causing a big sensation in the smartphone world right now, there are other smartphones, available from five other makers who also claim similar high-security features. The point I am trying to make here, is that rather than spending a disproportionate amount of time on trying to track down thieves, and spend lots of money doing it, and then finding the problem returns again later, another better alternative now seems to exist in the technological marketpalce, offering a better solution to the perennial pest of cyber phone data theft. Buying a high-security mobile phone, such as a TAIGA or a similar type, that is supposed to be surveillance and data theft proof is another better option. If i buy a high-security smartphone enxt time, it will save me alone, personaly, a MONTH of wasted and aggravating time every year currently lost fooling around because of someones cyber crimes…and repairng the problems caused. A Smartphone that really IS SMART? I sure hope so! Google does operate a geolocalisation system if you have your phone stolen, but in reality, this si useless because the thieves have already taken steps to prevent this.I PAD Phones are one special area of concern, and criminal anarchy. A criminal malicious user using a remote I Pad can send you or your Facebook or Email “hate” messages and threats, but fake their location and details, and to be able to effectively stop or isolate the abuser, the police have to shut down the entire area where they believe the malicious operatoris really based, to reveal them. this of course beggars up everybody in the entire shut down zone, who is entirely innocent, and stops innocent users from useing their telephones also. I specifically make mention of the I Pad type phones because we have had some experience of specifically having to deal with and stop, a malicious person connected to a UK French-based criminal gang, who is useing one of these remote devices to send threats and intimidating messages. Also, they broke inside our farm and stole 600 euros in cash when we were out by useing a similar method. The telephone mentioned runs a utility known as Foursquare, which annoyingly, can also be used and abused by criminals, and stalkers, to track down people, and harass them. While you can change certain settings on your smartphone or social media, they were using data contained inside PHOTOGRAPHS TAKEN WITH A DIGITAL OR SMARTPHONE CAMERA. WARNING!!! Digital images, taken using your smartphone camera, etc, can contain ACTUAL GEOGRAPHICAL data and information which a abuser can use to relocate you and your family. There is now (supposedly) a “solution” to this hellish problem, by using a downloaded “X Vif” and “Y Vif” software programme. The software “cleans away” the geographical data contained in the encodeing of your Digital camera pictures (you HOPE!). Personally, i feel the law should be changed to stop such abuses, and technology from getting into the hands of dangerous or unstable persons. For this reason, i strongly discourage you from plastering un edited, un cleaned (x vif y vif) smartphone or numericc camera photo image files, your photographs all over a Social media Site, such as for only one example, Facebook accounts. It can be asking for trouble sadly. Consider instead, buying the recently relaunched polaroid type instant cameras, that use the film papers DIRECTLY within the camera, to produce an INSTANT photography image, into your hands (no one elses!!!) and which, I understand* , cannot be traced if you copied your photos onto a computer. A bit more time, yes, to do it, but a LOT more safety as well. If you are being stalked online, on your smartphone and social media, It should form a part of your personal security assessment, to be aware of the fact that a malicious stalker, criminal thief, or other type computer attacker, will aim to make as great a nuisance of themselves s possible, tie you and your time up, waste your efforts, and then, once you think you've stopped them, return again, using a false name, and repeat the entire abuse and threats all over again. Like a disease, this repetitive issue needs to find a solution, so you should seriously stop doing the same things over and over again, the thief knows you will. I find, the first person to do something unexpected, different, or adaptive, tends to gett he edge over vermin such as this. Consider other options. Be bold, be creative. Think and act outside the “box”. try to come up with things that crooks can't fathom out you are doing now. Sometimes you must try to “think as the attacker would think” and test your systems, as well as your home security, as if you were yourself trying to break in. Try to resist using your Moible Smartphone for everything. Shopping, payments, Cinema tickets, Train tickets or holiday hotel bookings, might be deemed convenient, but remember they also give important data to a hacker or a thief about your life. Things such as restaurant bookings and schedules diaries and rendezvous can tell a data thief or phone pickpockets, far too much about you and your households movements. Hacking E-Mails is nothing new. read Gould and Schiffners book about data security. (the men who hacked into Prince Charles personal E-Mail and left a message for him telling him hey had done it!!!!). Turning Queen's evidence, they wrote a rather helpful book, and I believe became security advisors on Internet and Data theft problem areas. Beware then, if you decide to use your Smartphone to send and to receive your emails. The same applies. Social Media such as Facebook, is especially unsafe, even potentialy dangerous (remember the Cambridge Analytica scandal recently?!!). Personal data or email locations can be “parsed” off from the software legaly and also illegaly, and this too can bring an abuser to your doorstep. My own personal recommednation, is not to use sites such as Facebook precisely for this reason. With the criminals watching and reading everything you do, you are only giving them more information to use to harm you. Cases such as this, hopefully, remain rare, but you should not be complacent. Until the LAW ON STALKING can be changed or altered to result in an arrest for internet abuse and targeting a specific person at home through the internet, this is about all you can realistically do. My wife and I also found just when newly married, that a stalker (who claims mental illness and lives at a care home) was persistently hanging around the front door of our town apartment. When the stalker claims reduced or diminished capacity, it is annoyingly complicated, long drawn out, and downright worrying for their victims, because it takes the police far too long before finaly they can act to secure a positive criminal conviction against these perverts. We wanted to move house because of him, but it was not going to be so easy…. The laws need to be changed to stop people faking illness as an excuse to avoid prison or paying fines for abusive, sexually perverted behaviour. My personal sleep, health ability to work and fear of leaving my wife alone with someone like that around, really was damaging to our marriage for a very long time, and seriously affected my ability to focus upon important tasks at work. And no amount of financial compensation can fix or put that kind of damage right. Only a change in the Law can. UPDATE Due to recent experience, it has come to our attention that it is POSSIBLE for a thief and hacker to hack a E Mail Passsword, (repeatedley, someones passwords got changed ten times in less than a Month !!! ) and then gain access via linked e mail messages or social Media Feeds, on your e mail boxes, to some Online services you use. A telephone number NOT EVER USED before for Online services, by the victim, was discovered, deliberately substituted bya hacker, on a E mail Account, and then it got used for Illegal triangulation purposes, resulting around a week or so later, in a man being violently attacked at his own home in a remote area. The Hackers, a criminal gang strongly suspected of having links to organised crime, stole the telephone number. At the same tipe, the victims telephone SMS and reseau for recieving or making calls got blocked maliciously, presumabky by the same people. This left the victim cut off from making calls for help or sending or getting any text messages. VERY NASTY INDEED. !!!! It is worth considering carrying one of those cheap pocket mobil telephones if your work takes you sometimes to very remote areas or you are working sometimes on your own, even by daylight. A second or “back up” phone, (hide it somewhere safe until you need it) is a excellent idea for a situation such as this one. It is alas not only the Gendarmerie of Police who can triangulate phone calls or GPRS signals, Organised crime and also foreing Intelligence services do it a lot too. If this happens to you, notify the Police, and also consider writing to a Agency responsible for manageing Crime such as this. And change all your telephone numbers too straight away. Though not quite the same thing, another situation giving rise for alarm, is miss use by dishonest persons working in restaurants of your Credit card payment details. Recently a Credit card payment terminal was handed to the victim of the violent attack, it had a broken smashed screen, and NO VERIFICATION OF WHAT WAS HAPPENNING WAS POSSIBLE. The card was taken, inserted, a code entered in the normal way, BUT, NO ON SCREEN CONFIRMATIONS OR DIGITS AT ALL were visible, the terminal appeared “rigged”. it would be difficult to prove, but there appearsvery much to be a criminal link between the attack and a gang member, who has since been identified as the man working in the restaurant who took the card details and used the terminal handling the victims credit card. IF IN DOUBT DO NOT USE A BADLY DAMAGED OROBSCURED Business or restaurant Credit card terminal.. It just may be scam!!! ",
            "date": "Updated September 28, 2020",
            "views": "161",
            "upvotes": " View 8 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Jim Springer",
                    "user_href": "/profile/Jim-Springer-8"
                },
                {
                    "user_id": "Emma Patterson",
                    "user_href": "/profile/Emma-Patterson-83"
                },
                {
                    "user_id": "Maggie Ng",
                    "user_href": "/profile/Maggie-Ng-2"
                },
                {
                    "user_id": "Suz Gonz",
                    "user_href": "/profile/Suz-Gonz-1"
                },
                {
                    "user_id": "Anastasia Sky",
                    "user_href": "/profile/Anastasia-Sky-6"
                },
                {
                    "user_id": "Lisa Feldt",
                    "user_href": "/profile/Lisa-Feldt-3"
                },
                {
                    "user_id": "Manu Shukla",
                    "user_href": "/profile/Manu-Shukla-11"
                },
                {
                    "user_id": "Danielle Love",
                    "user_href": "/profile/Danielle-Love-9"
                }
            ]
        },
        {
            "author_info": {
                "name": "Carlos Flake",
                "href": "/profile/Carlos-Flake-1"
            },
            "answer_text": "When it comes to accessing someone’s phone without them finding out, we understand that you would only take such steps if the situation absolutely called for it. There are certain situations where you might feel the need to access someone’s phone remotely. I would suggest password peeking as the most basic method by which you can access someone’s phone without their knowledge. This involves sneaking a peek when they unlock their phones or asking them to open their phones so you can show them something while making sure you can see the password. Once you know what the password is, it is simply a matter of waiting for them to leave their phone unattended while you are around. Just make sure not to rearrange or delete anything otherwise you will be found out. There is also another method you can remotely get access by cracking and unlocking, this process is a little more complicated and would involve a clear understanding of how phone operating systems work internally. Many such applications allow direct backdoor access and if you have the right software on your computer, you can crack open and access any and all data on the target phone. Though this method is pretty reliable for those who have the software and know how to use it, it still requires the individual in question to leave their phone around you long enough. Possibly one of the most foolproof ways to access someone else’s phone without them knowing is by using bevanmattew atgmailcom certified solution method which is available for both Android devices and iPhones. Such spy software solution allows you to track and monitor any and all media and messages exchanged via the target phone system. Since this software works undetected on the background and are hidden, the owners of the phones being monitored are unable to tell that you have access to their devices. If you are left with no choice but to covertly monitor someone, this procedure should allow you to do just that and hence come to the conclusions or take the steps that are needed. I hope this article was helpful trying to remotely access someone's phone. Thanks. ",
            "date": "Answered October 26, 2020",
            "views": "229",
            "upvotes": " View 13 Upvoters",
            "upvoters": [
                {
                    "user_id": "Racer Curry",
                    "user_href": "/profile/Racer-Curry"
                },
                {
                    "user_id": "Sit Ben Jack",
                    "user_href": "/profile/Sit-Ben-Jack"
                },
                {
                    "user_id": "Andreus Josaiah",
                    "user_href": "/profile/Andreus-Josaiah"
                },
                {
                    "user_id": "Bjorn Barney",
                    "user_href": "/profile/Bjorn-Barney"
                },
                {
                    "user_id": "Tajai Adrain",
                    "user_href": "/profile/Tajai-Adrain"
                },
                {
                    "user_id": "Camdon Gregory",
                    "user_href": "/profile/Camdon-Gregory"
                },
                {
                    "user_id": "Derrik Demetri",
                    "user_href": "/profile/Derrik-Demetri"
                },
                {
                    "user_id": "Valin Jaseon",
                    "user_href": "/profile/Valin-Jaseon"
                },
                {
                    "user_id": "Evion Kazim",
                    "user_href": "/profile/Evion-Kazim"
                },
                {
                    "user_id": "Ariel Tiyon",
                    "user_href": "/profile/Ariel-Tiyon"
                },
                {
                    "user_id": "Sullivan Tyjuan",
                    "user_href": "/profile/Sullivan-Tyjuan"
                },
                {
                    "user_id": "Ukiah Brazen",
                    "user_href": "/profile/Ukiah-Brazen"
                },
                {
                    "user_id": "Idris Zakariyah",
                    "user_href": "/profile/Idris-Zakariyah"
                }
            ]
        },
        {
            "author_info": {
                "name": "Richard Comroe",
                "href": "/profile/Richard-Comroe"
            },
            "answer_text": "If you’ve installed (or anyone else without your knowledge) a remote control application on your cellphone … yes. If you have no remote control application installed on your cellphone … no. Remote control applications exist for virtually every computer OS (such as VNC) and have perfectly legitimate, as well as nefarious purposes. Smartphones come delivered with an OS and preloaded applications from the carrier, or whatever system builder configured it. Many have provided technical evidence that Android smartphones from China come bundled with applications that regularly upload data to collection servers in China. Data collection is a malware, just like remote control applications (if you didn’t purposefully install for your own use), but I’d never heard any allegation that phones from any provider come with remote control applications pre-bundled. ",
            "date": "Answered April 26, 2018",
            "views": "23",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Om",
                "href": "/profile/Om-201"
            },
            "answer_text": "Yes , Phones can be remotely accessed . The Person will be able to access your device remotely and steal your data. He will mislead you to install unknown applications or He may put some programs (codes) which will work on their own. If you think your phone is behaving abnormal (like it has been hacked) one way is to 1.Disconnect the device from network as its needed for transfer. 2. Finding the apps you think you haven't installed or cause the errors, letting to remotely access your device. 3. See the permissions you grant to application while installing and installing application from trusted sources. ",
            "date": "Answered August 11, 2017",
            "views": "301",
            "upvotes": " View 8 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Sam Swann",
                    "user_href": "/profile/Sam-Swann-11"
                },
                {
                    "user_id": "Ramesh Ganwaya",
                    "user_href": "/profile/Ramesh-Ganwaya"
                },
                {
                    "user_id": "Jonathan Waltiere",
                    "user_href": "/profile/Jonathan-Waltiere"
                },
                {
                    "user_id": "Christopher Dyer",
                    "user_href": "/profile/Christopher-Dyer-50"
                },
                {
                    "user_id": "Mickey Cannon",
                    "user_href": "/profile/Mickey-Cannon-1"
                },
                {
                    "user_id": "Aaqib Javed",
                    "user_href": "/profile/Aaqib-Javed-25"
                },
                {
                    "user_id": "Sonja Nektarijevic",
                    "user_href": "/profile/Sonja-Nektarijevic"
                },
                {
                    "user_id": "Kenneth Satterfield",
                    "user_href": "/profile/Kenneth-Satterfield-3"
                }
            ]
        },
        {
            "author_info": {
                "name": "Al Klein",
                "href": "/profile/Al-Klein"
            },
            "answer_text": "Is it possible? Yes, if someone else had your phone for a while. (They could install Team Viewer [or AeroAdmin] on it, and control it with Team Viewer [or AeroAdmin] on their phone or computer.) Is it likely? It’s more likely that you have a virus, some other malware or even condensation in your phone (causing the same problems as dropping it into a lake). ",
            "date": "Answered June 26, 2017",
            "views": "337",
            "upvotes": " View 9 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Michael Ezell",
                    "user_href": "/profile/Michael-Ezell-15"
                },
                {
                    "user_id": "Summer Barnes",
                    "user_href": "/profile/Summer-Barnes-15"
                },
                {
                    "user_id": "Ananda Castillo",
                    "user_href": "/profile/Ananda-Castillo"
                },
                {
                    "user_id": "SHERELLE THOMAS",
                    "user_href": "/profile/SHERELLE-THOMAS-2"
                },
                {
                    "user_id": "Howard Schaap",
                    "user_href": "/profile/Howard-Schaap-1"
                },
                {
                    "user_id": "Daniel Wright",
                    "user_href": "/profile/Daniel-Wright-627"
                },
                {
                    "user_id": "B Terebelo",
                    "user_href": "/profile/B-Terebelo"
                },
                {
                    "user_id": "Jennifer Hatcher",
                    "user_href": "/profile/Jennifer-Hatcher-20"
                },
                {
                    "user_id": "Tariq Abid",
                    "user_href": "/profile/Tariq-Abid-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Adewale Olalekan",
                "href": "/profile/Adewale-Olalekan-1"
            },
            "answer_text": "Sure, someone can remotely access your phone if they had previously installed a Trojan android app on your phone. They can do this by having physical access to your phone and install the malicious application or tricked you into installing it yourself. And worst still if you have a rooted android. They will be able to read your messages, your phone book directory and just about anything. That is one reason you should only install applications from the play store unless you know what you're doing. ",
            "date": "Answered August 5, 2017",
            "views": "44",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Shawanna Bob",
                    "user_href": "/profile/Shawanna-Bob"
                }
            ]
        },
        {
            "author_info": {
                "name": "Kelvin Stanley",
                "href": "/profile/Kelvin-Stanley"
            },
            "answer_text": "Brian is indeed correct, there is a way to remotely access a mobile phone, This is one of the reasons I tend to tell people not to ROOT their mobile phone because with a Remote Access Tool the server is sent to the mobile phone in which the owner of that mobile phone would need to install it, an unrooted mobile phone is more secure than a rooted mobile phone as the unrooted phone would potentially inform you that unauthorised software is trying to install on your phone. The Rooted phones security would be able to be circumvented and not inform you of the software being installed. ",
            "date": "Answered September 21, 2018",
            "views": "59",
            "upvotes": " View 2 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Jim Gwewe",
                    "user_href": "/profile/Jim-Gwewe"
                },
                {
                    "user_id": "Kim Trieskey",
                    "user_href": "/profile/Kim-Trieskey"
                }
            ]
        },
        {
            "author_info": {
                "name": "Srikanth Reddy",
                "href": "/profile/Srikanth-Reddy-1-1"
            },
            "answer_text": "No. It's not possible. As you said your phone is doing a lot of things on its own and opening apps and texting itself, I thought you're connected your charger while you observed this. If it's true then disconnect your charger and observe your phone will be function normally. To overcome this issue use your phone's own company charger. Even though it behaving same then your supply may have fluctuations and it'll be OK soon. Try to charge your phone from other socket or in other place. ",
            "date": "Answered June 26, 2017",
            "views": "169",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Shanthini",
                    "user_href": "/profile/Shanthini-18"
                },
                {
                    "user_id": "Kerby Applebee",
                    "user_href": "/profile/Kerby-Applebee"
                }
            ]
        },
        {
            "author_info": {
                "name": "Mirajul Shawon",
                "href": "/profile/Mirajul-Shawon"
            },
            "answer_text": "It's possible to remotely control your phone in these conditions, If it has a secret keylogger installed. Keylogger is dangerous. It keeps a record of your every keystrokes without letting you know and delivers them to the desired email address.By using AirDroid it's easy to remotely control any phone via Manage your phone on webTher are many untrusted apps(malware) in the internet which can easily access the sensitive permissions on your phone, so it's safe to use trusted apps and unknown apps with caution.",
            "date": "Answered August 6, 2017",
            "views": "34",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Lorie Whittington",
                    "user_href": "/profile/Lorie-Whittington"
                }
            ]
        },
        {
            "author_info": {
                "name": "Kiyac Brighton",
                "href": "/profile/Kiyac-Brighton"
            },
            "answer_text": "Yes , Phones can be remotely accessed . The Person will be able to access your device remotely and steal your data. He will mislead you to install unknown applications or He may put some programs (codes) which will work on their own. If you think your phone is behaving abnormal (like it has been hacked) one way is to 1.Disconnect the device from network as its needed for transfer.  ",
            "date": "Answered March 12, 2020",
            "views": "16",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Barry D Lewis",
                "href": "/profile/Barry-D-Lewis"
            },
            "answer_text": "Can it be done? Yes. Is it likely? No. If you downloaded some app that had malware then it would be feasible however if you are using legit apps, again not likely. If someone had use of your phone for a they could install hidden apps on your phone. Should you worry? Not yet. Smartphones are still relatively safe compared with laptops etc but give them time and you'll want antivirus running ",
            "date": "Answered April 27, 2018",
            "views": "762",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Hristo Samandjiev",
                "href": "/profile/Hristo-Samandjiev"
            },
            "answer_text": "If you've given someone else the right to enter the Gagle account or use the remote-to-the-out option, it can scramble into your phone. Also, if you have a virus that has affected your device, you will have problems such as recording calls and other unpleasant things. If you feel that your phone behaves strangely, make sure you reset the hook settings. Of course, first remove the sim card and memory card. ",
            "date": "Answered August 6, 2017",
            "views": "31",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Hit Like a King",
                "href": "/profile/Hit-Like-a-King"
            },
            "answer_text": "Yes, remote access to your phone can be achieved. It depends what type of remote access you are talking about like you can have authorized remote control like using /intalling remote access softwares or parental control softwares or find my device for the mobile phone . The other way is unauthorized like using RAT ( malicious apks) to get access of the device. Theres actually a book on hacking mobile security , i would recommend giving it a read. The name of the book is Certified blackhat: Practical ways to hack mobile security. Go through it, you will get valuable information. ",
            "date": "Answered August 24, 2020",
            "views": "466",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "John McDowell",
                "href": "/profile/John-McDowell-124"
            },
            "answer_text": "As far I know, if you are using an Android, the answer is Yes. My mom uses an Android phone and she often asks me to help push the settings on it. I will use the remote desktop app called awesun to control her phone from my iPhone or even my pc. It is very effective and convenient. But for ios, there is no way to do that. ",
            "date": "Answered September 4, 2020",
            "views": "15",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Yong YaoHui",
                    "user_href": "/profile/Yong-YaoHui"
                }
            ]
        },
        {
            "author_info": {
                "name": "Tyler Pohanic",
                "href": "/profile/Tyler-Pohanic"
            },
            "answer_text": "They would need to have a iOS device and they would need to have your passwords. Consider turning on 2 factor security if you have any concerns. That way if someone attempts to sign in you will be alerted on your iPhone and can deny them. Heres an article you should review. Two-factor authentication for Apple ID ",
            "date": "Answered July 30, 2018",
            "views": "18",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Robbin Stevenson",
                    "user_href": "/profile/Robbin-Stevenson-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Stephen Jombori",
                "href": "/profile/Stephen-Jombori-1"
            },
            "answer_text": "Yes , Phones can be remotely hacked . Yes someone will be able to access the your device remotely and steal your data remotely,join my Quora space Lizard Squad Hackers He will install some unknown applications or He may put some programs (codes) which will work on your your phone to stop the hacker Lizard Squad Hackers ",
            "date": "Answered September 18, 2020",
            "views": "221",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Gail Leeming",
                    "user_href": "/profile/Gail-Leeming"
                },
                {
                    "user_id": "Patricia Mcanistan",
                    "user_href": "/profile/Patricia-Mcanistan"
                }
            ]
        },
        {
            "author_info": {
                "name": "Md Sabbir Rahman Sajan",
                "href": "/profile/Md-Sabbir-Rahman-Sajan"
            },
            "answer_text": "Yes, you can. Nowadays, different types of Android-powered gadgets are frequently used on a daily basis. If you're a proud owner of an Android device, at times you may have felt the need to access it remotely in different situations. **Before using the apps you have to accept the control conditions. Some popular apps name: TeamViewer,Airdroid,Anydesk,HoneywellScrcpyVysorDeskDockTaskerISL LightMobizenSTFBBQScreenMoboRoboVysorIf you need any more suggestions you can comment here. Have a good day. :) ",
            "date": "Answered September 7, 2020",
            "views": "13",
            "upvotes": " View Sharers",
            "upvoters": [
                {
                    "user_id": "Kristin Foret",
                    "user_href": "/profile/Kristin-Foret-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "John",
                "href": "/profile/John-3528"
            },
            "answer_text": "A few things I do to make my phone safer: Disable BluetoothRename my phone to something other than my name. For example, when I setup a personal hotspot, I don’t want to broadcast my name.Ensure a complex (non simple) password is implemented. More than 4 digits in length.Don’t connect to any WIFI networks unless you know they are safeIf you must connect to an untrusted WIFI network, make sure to use a VPN connection to encrypt your traffic.",
            "date": "Answered February 13, 2018",
            "views": "21",
            "upvotes": " View 1 Upvoter "
        },
        {
            "author_info": {
                "name": "Kevin Rome",
                "href": "/profile/Kevin-Rome-2"
            },
            "answer_text": "Yes. There are different forms of “access”. There are many apps capable of creating an http server to share content/files. I use one that allows me to share pictures from my photo roll. I can use any web browser on the same network to view or download the pictures. ",
            "date": "Answered November 25, 2019",
            "views": "807",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Mohd Akif",
                "href": "/profile/Mohd-Akif-13"
            },
            "answer_text": "As far my knowledge there are so many apps that can take control of your phone. But before taking control it will ask some permission. Apps like- Airdroid, Teamviewer, Anydesk etc. for more queries, you can text me. ",
            "date": "Answered July 13, 2020",
            "views": "23",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Esay Hacks",
                "href": "/profile/Esay-Hacks"
            },
            "answer_text": "Yes they can by using RATS like sypnote v4, droidjack or androrat. If you think your phone is being access by someone install a antiviruses like avg or avast ",
            "date": "Answered August 7, 2017",
            "views": "953",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Uday Chaitanya Krishna",
                "href": "/profile/Uday-Chaitanya-Krishna"
            },
            "answer_text": "There are some parental control apps for mobiles of their children to monitor their activities with their mobiles. Just search for parental apps. - SillyBoy ",
            "date": "Answered September 1, 2018",
            "views": "26",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Jody Ver",
                "href": "/profile/Jody-Ver-1"
            },
            "answer_text": "Anything is possible ",
            "date": "Answered August 19, 2018",
            "views": "15",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Pamela Booth",
                "href": "/profile/Pamela-Booth-4"
            },
            "answer_text": "Yes ",
            "date": "Answered April 7, 2019",
            "views": "524",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Juma Athumani",
                "href": "/profile/Juma-Athumani"
            },
            "answer_text": "No ",
            "date": "Answered July 12, 2019",
            "views": "510",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Gray Larry",
                "href": "/profile/Gray-Larry-1"
            },
            "answer_text": " ",
            "date": "Answered February 5, 2020",
            "views": "12",
            "upvotes": " View Sharers"
        }
    ]
}