{
    "title": "Can hybrid cars run on electricity only? - Quora",
    "tags": [
        "Plug-in Hybrid Electric Vehicle (PHEV)",
        "Hybrid Cars",
        "Hybrid Electric Vehicles (HEV)",
        "Battery Electric Vehicles (BEV)",
        "Electric Vehicles",
        "Electric Cars",
        "Alternative Energy",
        "Electricity",
        "Electrical Engineering"
    ],
    "response": [
        {
            "author_info": {
                "name": "Jeff Jo",
                "href": "/profile/Jeff-Jo-4"
            },
            "answer_text": "Can hybrid cars run on electricity only? Many can. In a plug-in hybrid, that is the point: it acts as a pure electric vehicle for normal day-to-day driving, and then switches to act as “regular” hybrid when the initial charge is depleted for longer trips. But in a “regular” hybrid, running on electricity only is called “EV mode.” And it IS NOT THE POINT. I apologize for shouting, but those who tell you otherwise have been misled. It sounds good, and unscrupulous advertising has taken advantage of that, but relying on it can decrease efficiency. EV mode is not using “free” energy, it is energy that the came from burning gas at an earlier time. In a conventional car, the ICE has to produce the exact amount of power need to propel the car. The reason a “regular” hybrid is more efficient than a non-hybrid, is that it can burn more, or less, gas when it is more efficient to do so. And it almost always is. It can do this because the extra energy is stored in a battery, to be used later; whether that is in EV mode or not is irrelevant. This deference decreases the overall efficiency of the process, but it is still better than requiring the gas engine to drive the car, alone, at inefficient load levels. But one shouldn’t classify a “regular” hybrid’s battery as “small.” Yes, it has much less capacity than a plug-in has. But again, IT IS NOT THE POINT TO RUN ON ELECTRICITY ONLY. The point is to hold the energy temporarily. A much lower-capacity battery can be “large” for this purpose. ",
            "date": "Updated August 13, 2020",
            "views": "96",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Leo McDevitt",
                    "user_href": "/profile/Leo-McDevitt"
                },
                {
                    "user_id": "Anthony de Vries",
                    "user_href": "/profile/Anthony-de-Vries"
                }
            ]
        },
        {
            "author_info": {
                "name": "Anthony de Vries",
                "href": "/profile/Anthony-de-Vries"
            },
            "answer_text": "It depends a bit on what you actually mean by the question… Do you mean driving only on the electric motor, instead of always having the petrol engine running, or do you mean only running on electricity, without having had the petrol engine running for the whole trip? There are many types of hybrids, and the answers are different depending on the exact question… In a plug-in hybrid, the battery is relatively big, and can be charged from a wall socket without turning on the engine. These cars can run about 30 to 50 km purely electric on the battery alone, without ever turning on the engine. In a more regular hybrid, for example the Toyota’s with a power-split-device, the petrol engine can drive the car, but the system can only drive purely on the electricity stored in the battery. Now… the distance it can do that in one go, it relatively minor… about 2 to 3 km or so… BUT, because the engine can recharge the battery at any time, it can repeat this very often. What is typically happening is that during high power demand (accelerating), the engine is working, but then switches off during the low power cruising. At low speeds, it can keep the car running for a very long time, even with a small battery. I drove the 2020 Toyota Corolla recently, and was amazed for how long the engine was turned off! In a test drive of 45 minutes, the engine was on for less than half of the time! Meaning that the car was running purely electric for half of the time, for probably 20 km or so… Of course, this electricity is by definition generated by the petrol engine, as there is no plug-in option. So people might also argue that this is not electric driving, even though for half the time, the petrol engine was off. On the other hand, we used only 4 liter / 100km on that test drive… regular non-hybrids use about 8 liter / 100km on that trip. Saying that it drove 50% electric without the engine, is perfectly in line with practical fuel consumption. Finally, there are also ‘mild-hybrids’ where the electric motor is coupled to the engine axel, and only used as an engine starter and booster, and to regenerate braking energy. In those hybrids, the engine is always on, and these cannot drive on electricity only. The fuel consumption also shows this clearly, as they don’t come anywhere near the low fuel consumption that hybrids can achieve. Finally, it of course depends on what kind of roads you drive. Hybrids are all about optimizing engine load and efficiency. On the highway, the engine is running at decent load and pretty good efficiency, and hybrid technology can only make a small improvement in efficiency. (typically 10 to 15% better fuel economy compared to regular cars). However, in the city, the engine is operating at a super low load, for which the engine is far too big, and hence has terrible efficiency. Thus, it is much better to run the engine for a short time at high load and associated high efficiency, and store this energy in the battery, where it can then be slowly drained by the electro motor, while the engine is completely off. The conversion losses from converting in electricity are far less than the loss in efficiency when running the engine at such low power. That is the main reason why a hybrid can reduce fuel consumption by 50% in the city. And why indeed, it is possible for Toyota Hybrids to drive 50% of the time electric, even though the battery only hold a few km range. ",
            "date": "Answered August 13, 2020",
            "views": "79",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Leo McDevitt",
                    "user_href": "/profile/Leo-McDevitt"
                },
                {
                    "user_id": "Steven Baddeley",
                    "user_href": "/profile/Steven-Baddeley"
                }
            ]
        },
        {
            "author_info": {
                "name": "Roberto Santocho",
                "href": "/profile/Roberto-Santocho"
            },
            "answer_text": "Q: Can hybrid cars run on electricity only? A: My regular hybrid can and does run on electric only, that is the point of a hybrid. When it reverse gear, it only runs on electric (in fact he gas engine has no physical connection to go in reverse at all). When in Drive (going forward), my regular hybrid switches between electric only, gas (fuel) only, electric and gas, or regeneration (when it is generating electricity via forward motion and charging the batteries with that motion, this generally happens when you take your foot off the accelerator pedal or are braking), depending on what the computer calculate that you want to do. It will run on electric only when accelerating gently, or when cruising at a steady speed (at below highway speeds, once on the highway the engine is always running) which is most effective for low emissions (best fuel economy). So yes, hybrids can run on electricity only (under certain circumstances for limited amounts of time). ",
            "date": "Answered November 22, 2019",
            "views": "154",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Leo McDevitt",
                    "user_href": "/profile/Leo-McDevitt"
                },
                {
                    "user_id": "Mike Evans",
                    "user_href": "/profile/Mike-Evans-172"
                }
            ]
        },
        {
            "author_info": {
                "name": "Leo McDevitt",
                "href": "/profile/Leo-McDevitt"
            },
            "answer_text": "Some plug-in hybrid cars, like my Chevy Volt always run on electricity. My car has no transmission. If needed, the ICE switches on to run a generator. Even then, the car is still running on electricity. At speeds of over 50 MPH, the car has a lockup clutch that connects the ICE directly to the drive axle. But even then, the electric motor is still driving the car, it’s just doing so along with the ICE. Thanks to the ‘rona pandemic, most of my trips are local. I just keep the car plugged in and charged so it always has a charged battery. I only need to get gas about once every six months. ",
            "date": "Answered October 28, 2020",
            "views": "71",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Kevin Davidson",
                "href": "/profile/Kevin-Davidson-9"
            },
            "answer_text": "Plug-in hybrid cars can run for some distance on electricity only. Regular hybrids only run on gasoline/petrol. The Chevrolet Volt plug-in hybrid can run 53 miles on electricity only. A Prius Prime can go 25. The Hyundai Ioniq plug-in hybrid goes 29 miles. ",
            "date": "Answered November 21, 2019",
            "views": "58",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Leo McDevitt",
                    "user_href": "/profile/Leo-McDevitt"
                },
                {
                    "user_id": "Mike Evans",
                    "user_href": "/profile/Mike-Evans-172"
                }
            ]
        }
    ]
}