{
    "title": "Can robots save lives? - Quora",
    "tags": [
        "Saving Lives",
        "Robots",
        "Robotics",
        "Artificial Intelligence"
    ],
    "response": [
        {
            "author_info": {
                "name": "Androidrobo",
                "href": "/profile/Androidrobo"
            },
            "answer_text": "Intelligent robots save lives Rescue teams risk their lives saving people during fires, floods, earthquakes, chemical accidents and bomb disposal work. they are termed as rescue robots. Rescue robots are designed to perform rescue operations or assist in performing rescue operations. They are used by defense people to carry out rescue where sending humans might be a danger or to help humans in doing a rescue operation to make it easier. They are completely or partially controlled by humans to perform the rescue operations. They have sensors installed in them that can track parameters which can then be used in the operation. Few robots even have AI in them that makes it more intelligent and thus reducing the control load on humans. They don’t completely take over the control but they do automate many of their operations. ",
            "date": "Answered April 14, 2020",
            "views": "5",
            "upvotes": " Answer requested by Kanaga Lakshmi",
            "upvoters": [
                {
                    "user_id": "Lisa Smith",
                    "user_href": "/profile/Lisa-Smith-909"
                }
            ]
        },
        {
            "author_info": {
                "name": "Vishnu U",
                "href": "/profile/Vishnu-U-39"
            },
            "answer_text": "Yes, they are termed as rescue robots. Rescue robots are designed to perform rescue operations or assist in performing rescue operations. They are used by defense people to carry out rescue where sending humans might be a danger or to help humans in doing a rescue operation to make it easier. They are completely or partially controlled by humans to perform the rescue operations. They have sensors installed in them that can track parameters which can then be used in the operation. Few robots even have AI in them that makes it more intelligent and thus reducing the control load on humans. They don’t completely take over the control but they do automate many of their operations. ",
            "date": "Answered April 11, 2020",
            "views": "9",
            "upvotes": " Answer requested by Kanaga Lakshmi"
        },
        {
            "author_info": {
                "name": "Himanshu Verma",
                "href": "/profile/Himanshu-Verma-1624"
            },
            "answer_text": "Yes, Intelligent Robots can save lives, it can be useful in many ways. Our goal is to tackle human emergency personnel.Robots can save humans by rescuing them from emergencies like floods, chemical accidents, earthquakes and bomb disposal work. Further, if you want detailed information about the same you can visit the website( Appknock dot co ) ",
            "date": "Answered April 10, 2020",
            "views": "22",
            "upvotes": " View 1 Upvoter "
        }
    ]
}