{
    "title": "Can you hear a Predator drone? - Quora",
    "tags": [
        "MQ-1 Predator",
        "Remote-Controlled Vehicles",
        "Unmanned Aerial Vehicles and Drones",
        "Hearing",
        "Military Aircraft",
        "Military Technology"
    ],
    "response": [
        {
            "author_info": {
                "name": "Jon Mixon",
                "href": "/profile/Jon-Mixon-1"
            },
            "answer_text": "It depends. Here’s a video shot in 2012 northwest of Downtown Chicago where a Predator flies over. While the video person didn’t use a windsock on his mic (Bad video guy!) if you listen carefully the engine of the drone can be heard as a steady, almost buzzing noise:  As other answers have noted, if the drone is above a certain altitude and is downrange of a target, it’s unlikely that the target would ever hear, much less see, the drone. NOTE: Something extremely odd is that there should be HUNDREDS of videos online of these UAVs in flight as Predators have been in the inventory for more than a decade. While US citizens might not be inclined to post such videos, it’s odd that the people in The Levant, Mesopotamia, Pakistan and The Horn of Africa have not. There may be an active attempt by one or more sources to prevent such videos from being posted online or remaining there for any length of time. ",
            "date": "Answered August 7, 2016",
            "views": "28",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Bill McDonald",
                    "user_href": "/profile/Bill-McDonald"
                },
                {
                    "user_id": "Jean Amarante",
                    "user_href": "/profile/Jean-Amarante"
                },
                {
                    "user_id": "Toms Thomas",
                    "user_href": "/profile/Toms-Thomas"
                }
            ]
        },
        {
            "author_info": {
                "name": "David Hambling",
                "href": "/profile/David-Hambling"
            },
            "answer_text": "Sometimes. At 5,000 feet the MQ-1 Predator is often described as sounding like a distant lawnmower, and the noise is considered to be a stress factor for those who have to live with drones constantly circling overhead with the implied threat of a missile. \"Why would we not be scared?\" Said a father of three from a different family unit, \"drones are always on my mind. It makes it difficult to sleep. They are like a mosquito. Even when you don't see them, you can hear them, you know they are there.\" 'Every Person Is Afraid of the Drones': The Strikes' Effect on Life in Pakistan However, at 10,000 feet you will generally not hear it. The AGM-114 Hellfire is subsonic, and there are cases of people hearing before it hits. Allegedly dogs can hear it more easily than humans and get out of the way, but this is anecdotal . ",
            "date": "Answered June 30, 2016",
            "views": "53",
            "upvotes": " View 8 Upvoters",
            "upvoters": [
                {
                    "user_id": "Waylon Jennings",
                    "user_href": "/profile/Waylon-Jennings-6"
                },
                {
                    "user_id": "Jon Mixon",
                    "user_href": "/profile/Jon-Mixon-1"
                },
                {
                    "user_id": "Lucas Hoffmeister",
                    "user_href": "/profile/Lucas-Hoffmeister"
                },
                {
                    "user_id": "Tom Jez",
                    "user_href": "/profile/Tom-Jez"
                },
                {
                    "user_id": "Sanjeev Ravindranathan",
                    "user_href": "/profile/Sanjeev-Ravindranathan-1"
                },
                {
                    "user_id": "Zhao Zheyuan",
                    "user_href": "/profile/Zhao-Zheyuan"
                },
                {
                    "user_id": "John Hopkin",
                    "user_href": "/profile/John-Hopkin-3"
                },
                {
                    "user_id": "Randy Garbin",
                    "user_href": "/profile/Randy-Garbin"
                }
            ]
        }
    ]
}