{
    "title": "Can students be taught better if teachers don't use any technology or limited technology? If so, what is best? - Quora",
    "tags": [
        "Teaching Methods",
        "Educational Technology",
        "Teachers",
        "Teaching",
        "Students",
        "Learning",
        "Schools",
        "Technology"
    ],
    "response": [
        {
            "author_info": {
                "name": "Darwin Smith",
                "href": "/profile/Darwin-Smith-3"
            },
            "answer_text": "About a year ago I attended a workshop session on this topic at the national conference of the NSTA (National Science Teachers Association, now the National Science Teaching Association) in St. Louis. The presenters made very powerful and persuasive arguments, backed up with copious data, for limiting the use of technology much more severely than is currently fashionable. Among the best evidence were experimental studies that supported the idea that our brains have been hard-wired (through evolution) to learn and think differently than what screen technology requires. There are some interesting bits about the use of hands and eyes and brain together. Here are a couple of the resources they quoted from: “Multiple Pathways to the Student Brain” (I know this should be underlined but that option doesn’t seem to be available), a book by Janet Nay Zadina; “Digitizing Literacy: Reflections on the Haptics of Writing,” by Anne Mangen and Jean-Luc Velay. (I think this is a peer-reviewed article or a chapter in a larger book.) A couple other notes about tech and students. I have read that Bill Gates and Steve Jobs sent their own kids to schools that used little or no tech, no screen time. Some have speculated that this was because they understood better than most the negative effects of screen time on kids’ thinking ability or other developmental aspects. I believe the sources of the information were reliable. If not, I apologize for spreading false rumors. On a personal note: The last high school where I taught had gone one-to-one with iPads just the year I arrived. In the four years for which I saw testing results, the ACT scores had declined every year. The administration refused to even entertain the possibility that there was a cause-effect link of any sort. Bad optics for the donors to the private (Catholic) school, you know. There was a constant battle to keep games and distracting apps off the iPads. The students were always a step or two ahead of the tech guy on this, and he was no slouch. There are just too many ways to misuse tech. The iPads were a constant distraction in classes whether teachers were using them or not. This question also includes phones, I suppose, which are especially distracting, since the school can not control in any way what a student has on their phone. S0 - email, twitter, instagram, facebook, shopping, etc., etc. And they are a very useful tool for cheating. Not only have I caught students using phones to cheat, I once saw a TV news story about cheating in France or Switzerland. I saw it while I was eating pizza in Switzerland. I couldn’t understand a word of French, but the gist of the story was very plain. Bottom line: I am not a big fan of screen technology in the classroom. I am, however, a fan of lab technology in the science lab/classroom, and I believe students ought to learn how to write code beginning no later than junior high/middle school. Teach them real tech use. They already know how to use the internet. That reminds me of one other problem of tech: the internet. Students can often find homework answers online, not to mention the availability of papers. I once had students who found an entire teachers edition of a physics text which someone had posted online. I used a chemistry resource called ChemQuest written by a teacher in Michigan. People had posted numerous copies of his work, answers included. (This really bugged me because he had written this by himself, and these posters were denying him his hard-earned financial reward.) Students used to copy the answers without doing the work. Once I figured this out I started changing the numbers in my PDFs of the homework I took for a grade. Since it wasn’t the brightest students who were cheating, it took some of them a while to catch on. It was quite gratifying to use technology to stop their cheating. ",
            "date": "Answered February 15, 2020",
            "views": "217",
            "upvotes": " Answer requested by Czarek Plotczyk",
            "upvoters": [
                {
                    "user_id": "Holly Kelly",
                    "user_href": "/profile/Holly-Kelly-74"
                },
                {
                    "user_id": "Roberta King",
                    "user_href": "/profile/Roberta-King-11"
                }
            ]
        },
        {
            "author_info": {
                "name": "James Clawson",
                "href": "/profile/James-Clawson-2"
            },
            "answer_text": "Here’s my answer from a similar Quora Question: What's the role of technology in education? I was always an early and avid adopter. What kills learning in the classroom is boredom. Lectures are boring. High student participation with open debate based on pre-reading and especially well-chosen open-ended case studies heightens energy and learning in the classroom. Technology is a part of a multi-channel approach to facilitating learning. Chalkboards, overhead projectors, document cameras, wifi internet connections (fraught with challenges), simulations, video clips, lighting management, audio clips, flip charts (3M Post-It versions that can easily hang on the walls likety split), microphones, Adelphi voting stations, Excel mirroring from student computers, distance learning cameras, and more CAN BE excellent accelerators of learning facilitation. The key is to be so practiced that the transitions from one channel/mode to another are seamless and without stumbling. If the video won’t play, if the audio doesn’t work, if the cable isn’t connected properly, etc., the disruption destroys the “magic bubble” that I tried to create in every class—a situation in which everyone was enthralled with what was happening the room and paying attention 100%. Seamlessly moving from one mode to another provides variety, energy, and poignancy. AND technology may not be the right answer for any given element. I have taught worldwide the second chapter of Shaara’s book Killer Angels about the dilemma Joshua Chamberlain faced (https://faculty.darden.virginia.edu/clawsonj/General/PUBLIC/Chamberlain.pdf ) for 40 years. I told the story and recited Chamberlain’s speech to the deserters live (using some drama techniques). It was always, no matter what continent we were on, a very powerful class: Would you, given legal authority, shoot the deserters? When the film Gettysburg starring Jeff Daniel came out I was excited to load the clip onto my PowerPoint pages with menu of multiple video clips (so you could pick one at a moment’s notice depending on the discussion). I did so, used it 2–3 times and you could feel the energy leaking out of the room. So I went back to doing the episode live and in person—and the energy level went back up. Technology is not always the best channel. Technology is not the goal, it’s one tool for facilitating learning. I taught some on-line distance classes. Students were spread all over the world. Sometimes the connections weren’t that good, sometimes students were on commuter trains trying to listen, or in coffee shops getting breakfast. I had no way of knowing if they were prepared, had read the assignment, etc. For learning, it was a poor mode/channel. I taught some classes face-to-face in a Middle Eastern country. Not a classroom, rather a flat room with movable chairs, no desks. At first, there were 10–15 people there. By the first afternoon there were 50 people there. By the next day, 100. The culture was, a few will “check it out” and text whether it was worth while or not. No advance prep, no attendance guidelines—but the technology grew the class hour by hour. With technology we can listen to people speak worldwide and that's a plus. We can invite speakers to check into our classrooms. Having a meaningful discussion with eye contact over that medium is much more difficult--and ultimately unsatisfying. Can't do role plays. Can't scan and assess room energy and mood. etc. Technology is a tool not an end goal. If it helps, great. If it gets in the way, lose it. There are things we do in a F2F classroom that we just cannot do over technology linkages. ",
            "date": "Answered February 2, 2020",
            "views": "243",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Roberta King",
                    "user_href": "/profile/Roberta-King-11"
                }
            ]
        },
        {
            "author_info": {
                "name": "John Gerndt",
                "href": "/profile/John-Gerndt"
            },
            "answer_text": "Teaching is about people following along on an informational field trip. It’s hard to say what is going to inspire interest by the students but for sure, a lack of interest by the teacher in the trip is going to dampen everyone’s spirits. Technology is useful in as much as it can present an idea clearly. Sometimes it’s great. Sometimes it’s not necessarily at all. What is essential is a bond between teacher and student. It is essential that each feel an urgency and keen interest in developing insight into the topic. There is no technology for that. I can say from experience that the more regulated the classroom becomes the more difficult that spirit is to thrive. Technology is seen as a cure for a flat personal dynamic. It’s is unsustainable. Interest in tech is mostly about the novelty and novelty is of course short lived. If indeed all we needed was educational TV, interactive or not, we would have gone this route much earlier. It’s still about a human bond. Teachers long for it, students long for it. Unfortunately we’ve lost track of how to form it. Reaching for new tech is the latest hope for a shared excitement, but as I said, it won’t sustain. The best connection between student and teacher is talking. It needs to be dialogue. It needs to be based on truth and trust! There is an distinct lack of both these days and little room of ability to build it up. I like field trips for building this up but it requires more money and escorts than is ever allotted. About eight kids per chaperone with each chaperone highly informed and informative is ideal. Even one good one per semester is beneficial. Kids will seek out the class that has one of these by tradition. ",
            "date": "Answered February 15, 2020",
            "views": "55",
            "upvotes": " Answer requested by Czarek Plotczyk",
            "upvoters": [
                {
                    "user_id": "Yi Xiang Chong",
                    "user_href": "/profile/Yi-Xiang-Chong"
                }
            ]
        },
        {
            "author_info": {
                "name": "Kathleen Crader",
                "href": "/profile/Kathleen-Crader"
            },
            "answer_text": "For most of my career, I taught with limited technology. Even when teaching an ITV class, my notes were simply projected on the tv, there were no internet capabilities in the class. Then in my last few years teaching, things changed. Students were issued iPads, the internet (within reason) was opened up to them, and choices abounded. In Literature we were no longer bound to the excerpts included in the textbook, I was able to add the text of several MLK Jr. Speeches to the course showing the effectiveness of his repetitive rhythm in speaking. I was able to pull in current autobiographical works and many other resources. While I felt I did a good job teaching before this technology explosion, having the options technology gave me made teaching more exciting. I know there were teachers who had the class check on the wolves of Yellowstone or watch the baby animal feeds from various zoos, who used Shark tank episodes to learn what makes a product marketable, who looked at the universe through telescope feeds from the other side of the country or out of the earth. Why would anyone want to limit their resources like that? In addition, having this technology in the students hands meant reports became movies, PowerPoint presentations that were projected for all to see, and student stress often decreased because of the options available. Personally I believe technology in the classroom should only be limited enough to maintain control, use as much as allowed, connect with student brains any way you can! ",
            "date": "Answered February 10, 2020",
            "views": "129",
            "upvotes": " Answer requested by Czarek Plotczyk",
            "upvoters": [
                {
                    "user_id": "Roberta King",
                    "user_href": "/profile/Roberta-King-11"
                }
            ]
        },
        {
            "author_info": {
                "name": "Roberta King",
                "href": "/profile/Roberta-King-11"
            },
            "answer_text": "If students are willing to learn, it doesn’t matter what a teacher uses, as long as their lessons are well put together and interesting. Some schools claim to have technology, but when you get there to teach, there is little more than a white board and an overhead projector, if you’re lucky. Other schools have electronic whiteboards and students expect to be dazzled with fabulous technologically brilliant lessons. Often, they are subjected to death by power point. What is best is to have teachers taught how to use the technology at the school where they work and be encouraged to work together to create exciting student-friendly and accessible lessons. There are platforms such as Kahoot to name but one, where you can give your students quizzes to see if they’ve learned what they needed to in class. However, if the teacher is passionate about their subject and is able to teacher students who are interested in their subject, technology can be used as a tool to keep students’ interest when used properly. ",
            "date": "Answered February 15, 2020",
            "views": "133",
            "upvotes": " Answer requested by Czarek Plotczyk"
        },
        {
            "author_info": {
                "name": "Mairi Beaton",
                "href": "/profile/Mairi-Beaton-2"
            },
            "answer_text": "No. The whole point of having technology in the classroom is to make classes more interesting, to allow students to work at their own speed, and to help students participate more fully. Of course, that doesn’t mean we should have technology as the central point of the classroom - that’s where the students are. I’m a rather old fashioned teacher. I like ‘teaching from the front’ - giving whole class explanations and instructions. However, I also like to teach English as a foreign language by giving students a wide range of sources to work from: video, audio, and written sources are all useful. How can I, with only my variety of British English, prepare students for the richness of all the different accents and varieties of English that they might encounter? Online resources, and especially online dictionaries, are invaluable for language classes. If you have students with the self control to use their telephones effectively, they can really enhance learning. (I have a telephone table for those who have problems with that. Some students put their phones there at the start of every class.) If I have students with disabilities, using a social media is great, as being able to access what we are going to be doing in class in advance on the class Facebook page is useful. Dyslexic students sometimes use a reader to have an understanding of any text before the lesson, and students with a visual impairment can format documents in a way that suits them, for example. There are moments when it’s great to put away all technology, such as class discussions, but banishing it from the classroom would be a terrible mistake. ",
            "date": "Answered February 2, 2020",
            "views": "116",
            "upvotes": " View 1 Upvoter"
        },
        {
            "author_info": {
                "name": "Lauri Barber",
                "href": "/profile/Lauri-Barber"
            },
            "answer_text": "Understanding basics with one's own brain implants it there for life. And will most likely be used daily…in real-life. So I would say that the first 5–6 grades should not use calculators. My robotics engineer son says he's lost his ability, once he used a calculator. But, he can quickly improve it with brain use! However, using calculators and graphing calculators allows eighth grade students to do 10 problems in the same time it took 4th-year college students to do one. Thus, the student can see the PATTERN that a parabola looks like a “rounded V” when the leading coefficient is positive and like “an arch” when the leading coefficient is negative. They can see that the steepness or shallowness of the parabola matches a larger or smaller leading coefficient, respectively. They can see that the final Constant is Always the y-intercept of any equation. They can see how the slope-intercept form of linear equation is easier to graph but the Standard form Ax + By = C is easier to use in Systems of Equations. This allows more learning before 18 years old when the brain starts to prune back neurons to HALF as many! A win if we can teach more sooner. (Keeps me on my toes to keep up to middle schoolers, too.) ",
            "date": "Answered February 20, 2020",
            "views": "98",
            "upvotes": " View 1 Upvoter "
        },
        {
            "author_info": {
                "name": "James Bellanca",
                "href": "/profile/James-Bellanca-3"
            },
            "answer_text": "Obviously there are teachers who can teach better without technology. It depends upon what other skills they have. In addition, technology does not necessarily make anyone better or worse as a teacher. It would be best if today’s teachers acknowledged that digital skills are important for all students to learn and to do that they need to use technology in their every day learning tasks. The best teachers would include technology as an Intercal part of their tool kit helping students not only learn the course content but develop digital skills at the same time. In addition, I can’t imagine any teacher today rejecting the multiple tech tools which make management of their classroom duties easier and less time consuming. The more tech teachers master so they and their students are more productive, the better. ",
            "date": "Answered February 15, 2020",
            "views": "99",
            "upvotes": " Answer requested by Czarek Plotczyk"
        },
        {
            "author_info": {
                "name": "Laurence Cuffe",
                "href": "/profile/Laurence-Cuffe"
            },
            "answer_text": "Its a complex issue, without a binary answer. This is probably not because its a wicked problem, or at least I don’t think it it is, but is more likely to be because the question is ill framed. It’s a bit like asking if students learn better using blue or black ink. Technology is not the primary determinant of learning, other factors such as the quality of the teaching, the design of the curriculum, and the methods of assessment used have a much more significant impact than the use or absence of technology. I say this as someone who taught teachers how to use technology. ",
            "date": "Answered February 21, 2020",
            "views": "79",
            "upvotes": " Answer requested by Czarek Plotczyk"
        },
        {
            "author_info": {
                "name": "David Iosue",
                "href": "/profile/David-Iosue-1"
            },
            "answer_text": "If a teacher uses no technology whatsoever, they appear to be uneducated, and technophobic. A teacher must always appear to be the best student in the room. That includes mastering technologies from current sources. As a music teacher, I've used digital recording, laptop, computer compatible projectors, printers, scanners and digital music files in the classroom. (All mounted in a rolling cabinet/cart) I'd look awful silly with a clay tablet and stylus, or Edison Machines in a classroom setting today. (Although I've shown these to children, in the classroom, via computer/projector) ",
            "date": "Answered February 2, 2020",
            "views": "61",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Tim Haston",
                "href": "/profile/Tim-Haston-1"
            },
            "answer_text": "Technology is not a wonder drug. There is no secret formula of how much to use to ensure success. It is a tool, one to be harnessed, iaed and understood. But teachers and students all are diverse in knowledge, capability and modalities in learning. Some students will learn incredibly efficient from utilizing tech. Others won't. Certain things are paramount to learn… digital citizenship… knowing that disappearing snaps easily live forever…. What is best? Take down data. Observe your students, and find what learn from them. Do the same for the next group as they too are unique. ",
            "date": "Answered February 4, 2020",
            "views": "129",
            "upvotes": " Answer requested by Czarek Plotczyk"
        },
        {
            "author_info": {
                "name": "Patricia Brady",
                "href": "/profile/Patricia-Brady-7"
            },
            "answer_text": "First of all, each student learns in a way that is unique to them; whether it is auditorily, visually, or kinesthetically. Let's face it…technology is not going away, but it is a tool, just as books, 3d materials, or sound bytes are. Technology can be a great tool to access information while solving problems. I think good teachers make it a habit of offering a variety of ways for students to grasp concepts. To directly answer your question, i believe students will learn better if they have access to a variety of tools, and …technology is a great tool. ",
            "date": "Answered February 20, 2020",
            "views": "29",
            "upvotes": " Answer requested by Czarek Plotczyk"
        },
        {
            "author_info": {
                "name": "Robert Pattison",
                "href": "/profile/Robert-Pattison-4"
            },
            "answer_text": "When I was teaching on a Pacific island, we had no books, no technology, only a blackboard and chalk and keen student - 45 of them to a class. We did New Zealand exams, in English, which was the 2nd or third language for the students. When teaching trigonometry students had to share the few trig table books and do most of the multiplication long hand. So I went to an Indian friend's shop and negotiated a good price for calculators which I sold to the students on a weekly payment basis. Then the students were on a better footing to do maths and physics calculations. It made life for all much easier! When working in industry many years earlier I used 7 figure trig and log tables. A book about 10 cm thick. Mechanical calculators then cost three times my annual salary at that time and the company's computer had cost 150 times my annual salary. ",
            "date": "Answered February 2, 2020",
            "views": "152",
            "upvotes": " View 1 Upvoter"
        },
        {
            "author_info": {
                "name": "William Morris",
                "href": "/profile/William-Morris-23"
            },
            "answer_text": "Different teachers have different strengths. Some have little idea of how to use technology effectively and are uncomfortable with it. The best teachers like that will use the minimum. Others are completely at home and know just how to use it and do it will great success. Others think they know but make a mess of it and students learn less than if they’d abandon it altogether. It would be wrong to prescribe; better to just let teachers know what’s available to them. ",
            "date": "Answered February 9, 2020",
            "views": "122",
            "upvotes": " Answer requested by Czarek Plotczyk"
        },
        {
            "author_info": {
                "name": "Deirdre Bonnycastle",
                "href": "/profile/Deirdre-Bonnycastle"
            },
            "answer_text": "You asked the wrong person to answer! I am a supporter of educational technology. Some examples: Class blogs where news and upcoming events can be posted (also useful to keep parents up to date).Research has shown that students who take notes in class do better. Technology enabled note taking increases typing speed.Video and interactive lessons that students can watch several times when preparing for exams.Interactive web sites where students can post info for group projects.ETC ETC",
            "date": "Answered February 4, 2020",
            "views": "68",
            "upvotes": " Answer requested by Czarek Plotczyk"
        },
        {
            "author_info": {
                "name": "Daphne Porter",
                "href": "/profile/Daphne-Porter-2"
            },
            "answer_text": "Actually, the generation of students that is in school now require technology. They are unaccustomed to using paper and pencil or paper textbooks. They also find using their phones to find information to be fun. So they are much more excited and motivated about education.. ",
            "date": "Answered February 15, 2020",
            "views": "114",
            "upvotes": " Answer requested by Czarek Plotczyk"
        },
        {
            "author_info": {
                "name": "Alaxandr MacLochloinn",
                "href": "/profile/Alaxandr-MacLochloinn-1"
            },
            "answer_text": "Learning depends on the teacher. The technology is a tool; it’s very useful for certain things, no so much for other things. I personally feel that a blended class is the best: some work on Chromebooks (esp. DESMOS), some paper and pencil work. ",
            "date": "Answered February 15, 2020",
            "views": "53",
            "upvotes": " Answer requested by Czarek Plotczyk"
        },
        {
            "author_info": {
                "name": "Andrea Utzman",
                "href": "/profile/Andrea-Utzman-1"
            },
            "answer_text": "My theory on that is that Shakespeare has no technology, not did Newton, or even Einstein. What works best is a motivated, caring teacher who installs a passion for learning, using whatever sources are available. ",
            "date": "Answered February 9, 2020",
            "views": "35",
            "upvotes": " Answer requested by Czarek Plotczyk"
        },
        {
            "author_info": {
                "name": "Anthony Atkielski",
                "href": "/profile/Anthony-Atkielski"
            },
            "answer_text": "Good teachers use technologies that help, and avoid technologies that do not. A general avoidance of technology is a symptoms of technophobia, which only hinders teaching. Technophobia is unfortunately extremely common among teachers. ",
            "date": "Answered February 2, 2020",
            "views": "58",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Kim Ooi",
                "href": "/profile/Kim-Ooi-1"
            },
            "answer_text": "The importance/significance of technology is greatly overrated, especially in TEFL. No amount of technology is going to make you more fluent in English. The only way to improve your fluency is to open your mouth and start practicing the language. ",
            "date": "Answered February 16, 2020",
            "views": "110",
            "upvotes": " Answer requested by Czarek Plotczyk"
        },
        {
            "author_info": {
                "name": "Michael LeBoeuf",
                "href": "/profile/Michael-LeBoeuf-4"
            },
            "answer_text": "Students can be taught if a teacher can communicate and students want to learn regarless of technology. When the student is ready, the teacher will appear. ",
            "date": "Answered February 2, 2020",
            "views": "51",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Barbara Hughes",
                "href": "/profile/Barbara-Hughes-84"
            },
            "answer_text": "That would depend on the individual learning style of the students. It would be good for some, but not for others. ",
            "date": "Answered February 25, 2020",
            "views": "97",
            "upvotes": " Answer requested by Czarek Plotczyk"
        },
        {
            "author_info": {
                "name": "J. Jimenez",
                "href": "/profile/J-Jimenez"
            },
            "answer_text": "A technology savvy teacher can use both methods to maximize the the learning the students experience! ",
            "date": "Answered February 20, 2020",
            "views": "42",
            "upvotes": " Answer requested by Czarek Plotczyk"
        }
    ]
}