{
    "title": "Can you add USB-C to older computers? - Quora",
    "tags": [
        "Retrocomputing",
        "USB 3.0",
        "USB Type-C",
        "Universal Serial Bus (USB)",
        "Computer Hardware"
    ],
    "response": [
        {
            "author_info": {
                "name": "Charles Lasner",
                "href": "/profile/Charles-Lasner"
            },
            "answer_text": "Truly adding USB C capability requires an interface to a high-speed internal bus connection, otherwise you are only doing connector conversion with attendant low performance. For machines that have a spare 4-line or more PCI-E slot, there are add-in cards that do provide the fast 10GB/S transfers the full USB-C spec promises. [Actual throughput is a function of many factors,but at least the port itself won’t be the problem). Generally, the card requires active power, and the best cards require a SATA power connector, which is usually available in most compatible desktops, or some appropriate power splitting cable can be added; it all depends on the power supply’s existing connectors, etc. USB C’s charging rate will generally be somewhat low compared to other implementations, but the main thing is the good theoretical speed is at least plausible. Not that I am a shill for any company, but start by looking at this Startech offering. PEXUSB312C2 A plus for this model is dual rear bracket so it is also compatible with recent SFF machines such as a Dell Vostro. Note: All add-in cards cannot support boot devices. Many laptops only support native USB 2.0 speed while faster ports require a driver once the system boots up. Thus, on this point, many laptops are not a full unrestricted implementation either, thus an add-in card represents parity in reality. Expect full backward compatibility to eventually be built-in, but most are taking a slow approach, and many do not have the throughput, just the connectors. thus the need for both 2.0 and faster at the same time. Also, operating systems prior to Windows 8.1 do not support UASP. This requires certified BIOS as well as software, etc. But for many, the data transfer speed for a non-boot device such as an external hard drive is the reason for the upgrade, etc. ",
            "date": "Answered October 21, 2019",
            "views": "37",
            "upvotes": " View 22 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Robert A. Harmon",
                    "user_href": "/profile/Robert-A-Harmon"
                },
                {
                    "user_id": "Dragan Krnic",
                    "user_href": "/profile/Dragan-Krnic"
                },
                {
                    "user_id": "Răzvan Sandu",
                    "user_href": "/profile/Răzvan-Sandu"
                },
                {
                    "user_id": "Aaron Lothian",
                    "user_href": "/profile/Aaron-Lothian-1"
                },
                {
                    "user_id": "Orion Heller",
                    "user_href": "/profile/Orion-Heller-1"
                },
                {
                    "user_id": "William Jackson",
                    "user_href": "/profile/William-Jackson-94"
                },
                {
                    "user_id": "Raitis Nugumanovs",
                    "user_href": "/profile/Raitis-Nugumanovs"
                },
                {
                    "user_id": "Tony Heskett",
                    "user_href": "/profile/Tony-Heskett"
                },
                {
                    "user_id": "Jake Van Wagoner",
                    "user_href": "/profile/Jake-Van-Wagoner-1"
                },
                {
                    "user_id": "Kilian Hekhuis",
                    "user_href": "/profile/Kilian-Hekhuis"
                }
            ]
        },
        {
            "author_info": {
                "name": "Paul Grimshaw",
                "href": "/profile/Paul-Grimshaw-6"
            },
            "answer_text": "Can you add USB-C to older computers? USB-C itself is nothing more than a new connector. So to use USB-C with an older computer then you can simply buy a USB-A plug to USB-C socket adaptor. They’re not common as most people still want to go the other way, but you can find them:  Of course whilst providing USB-C connection, these are not going to provide any new functionality over and above the USB-A socket. In particular they’re not going to give you Thunderbolt 3, DisplayPort video output, or higher and/or bidirectional charging power. If you have a desktop that has spare PCIe and you’re comfortable opening it up and fitting cards then there are also USB-C PCIe cards. These can also provide additional functionality, but it varies from card to card, just as factory fitted USB-C ports vary in their capabilities. You’re also not going to get the ability to power your desktop via a USB-C port provided by an expansion card. In fact unless it’s Thunderbolt 3 that you’re after, USB-C ports are primarily of benefit with laptops, providing them with a single wire “docking” capability carrying power, display, and USB for keyboard & mouse. So desktop benefits are rather limited as yet. The bottom line is that USB-C ports are easy, but what you really need to be asking yourself is what additional capabilities you want as well. Remember in particular that at the time of writing (October 2019) you’re not going to get any USB version faster than USB 3.1, which you probably already have on USB-A anyway. USB 3.2 is still in the pipeline, as indeed is USB4. ",
            "date": "Answered October 15, 2019",
            "views": "52",
            "upvotes": " View 20 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Roke Beedell",
                    "user_href": "/profile/Roke-Beedell"
                },
                {
                    "user_id": "Muhammed Omer",
                    "user_href": "/profile/Muhammed-Omer-19"
                },
                {
                    "user_id": "Edgar Casas",
                    "user_href": "/profile/Edgar-Casas-1"
                },
                {
                    "user_id": "Tony Heskett",
                    "user_href": "/profile/Tony-Heskett"
                },
                {
                    "user_id": "Joe Smith",
                    "user_href": "/profile/Joe-Smith-1332"
                },
                {
                    "user_id": "Lauren Wu",
                    "user_href": "/profile/Lauren-Wu"
                },
                {
                    "user_id": "David Rutan",
                    "user_href": "/profile/David-Rutan"
                },
                {
                    "user_id": "Norton Karp",
                    "user_href": "/profile/Norton-Karp-1"
                },
                {
                    "user_id": "Thomas Robison",
                    "user_href": "/profile/Thomas-Robison-6"
                },
                {
                    "user_id": "Muhamed Mevic",
                    "user_href": "/profile/Muhamed-Mevic"
                }
            ]
        }
    ]
}