{
    "title": "Can you retrieve deleted text messages from a cell phone? - Quora",
    "tags": [
        "File Recovery",
        "Data Recovery Solutions",
        "Messaging",
        "Text Messaging"
    ],
    "response": [
        {
            "author_info": {
                "name": "Melissa Pauline",
                "href": "/profile/Melissa-Pauline"
            },
            "answer_text": "It’s not worth it, find something or someone better to do. If you do not trust him now you never will trust him. Even if you could get your eyes on his deleted messages you’d not be satisfied with the outcome. If he were being shady, you’d be distraught bc now you kinda have to break up OR you’d not find zero shady messages which would lead you to conclude he was one step ahead you. Which would not be satisfying to you either. You’ve already formed a conclusion, you are now looking for proof . Proof if found makes him guilty , you should leave. If not found , makes you insecure AF and now you look crazy, he should leave you. Do you have a plan set that you are ready to stick to no matter which out come? It’s really really really not cool of you to even WANT to breech his privacy but it’s not really abnormal for a distrusting partner to want to confirm their suspicions. Physically doing it is a whole other ball game. I hope for your sake he is guilty bc if he is not you SHOULD feel pretty crappy and you should tell him what you’ve done and then let him decide if he wants to be with someone who does not trust him. I deal with this kind of nonsense on a daily basis. It does not feel good to have the person you care for completely disregarding the basic human right we all deserve to have privacy . It does not feel good to know someone does not comprehend my core values. It does not feel good to be loyal and get zero credit for my loyalty. It does not feel good to be treated like I am a sneak, cheating liar. It does not feel good that my person truly thinks so little of me. It does not fell good that he does not give a shit if I like my privacy invaded, I have a 24 hour babysitter monitoring my phone at all times. It’s worse than parental control bc at least parents are looking out for their children . Hackers are looking out for themselves under the guise of being the innocent party. It’s disrespectful and just plain Inhumane to be honest. Stop while you are ahead, trust your gut it won’t lie to you. ",
            "date": "Answered March 5, 2020",
            "views": "14",
            "upvotes": " View 6 Upvoters",
            "upvoters": [
                {
                    "user_id": "Patsy Abraham",
                    "user_href": "/profile/Patsy-Abraham-3"
                },
                {
                    "user_id": "Russell Branham",
                    "user_href": "/profile/Russell-Branham"
                },
                {
                    "user_id": "Derrick Smith",
                    "user_href": "/profile/Derrick-Smith-310"
                },
                {
                    "user_id": "James",
                    "user_href": "/profile/James-6670"
                },
                {
                    "user_id": "Mark Martin",
                    "user_href": "/profile/Mark-Martin-193"
                },
                {
                    "user_id": "Arianna Kepa",
                    "user_href": "/profile/Arianna-Kepa-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Andrew Karam",
                "href": "/profile/Andrew-Karam-3"
            },
            "answer_text": "If you feel the need to try to retrieve messages from your boyfriend’s phone behind his back then either you have serious trust issues, or he has serious loyalty issues. Either way, as others have pointed out, it might be time to move on. Consider: If he simply cannot tame his impulses to stray now, how long are you willing to stick with him, hoping that you can rein him in? How many times are you going to go through the whole routine of wondering where he is, what he’s doing, who he’s doing it with?On the other hand, if he’s not fooling around on you, how long is he willing to put up with your constant suspicions, with the evident lack of trust, with feeling he has to justify to you where he is and what he’s doing every time he’s out of your sight? Speaking only for myself - it gets old and I would not put up with someone who refused to trust me.If he deserves your trust, then trust him and stop sneaking around behind his back trying to snoop into his phone. If he does not deserve your trust, then why in the world would you want to stick with him? Oh - and you can’t recover deleted text messages from the phone. It would take an order from a judge to the phone company to get at the deleted stuff. It’s a privacy thing. ",
            "date": "Answered March 9, 2020",
            "views": "454",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Russell Branham",
                    "user_href": "/profile/Russell-Branham"
                }
            ]
        }
    ]
}