{
    "title": "Can you connect an old DVD player to a new TV? - Quora",
    "tags": [
        "Blu-ray Players",
        "DVD Ripping",
        "DVD Players",
        "Blu-ray",
        "DVD",
        "Television Sets",
        "Television",
        "Electronics",
        "Technology"
    ],
    "response": [
        {
            "author_info": {
                "name": "William Kling",
                "href": "/profile/William-Kling-2"
            },
            "answer_text": "I assume you mean to play DVDs. There are too many possibilities depending on your available outputs and inputs, and tolerance for relatively low-quality video. Put simply, most modern TVs still have either coaxial (screw-on single large cable) and/or composite (red/white/yellow RCA plugs at each end) inputs, and older, going-back-to-the-’70’s players of all types (VCR anybody?) ditto. Coax is lowest quality but simple, R/W/Y is better, but still low by what most of us consider acceptable. Going up in quality, you might have on both units composite (R/W for audio, R/Blue/Green for video RCA plugs), S-video (3/8″ dia. plug with small pins, short-lived tech and requires separate R/W audio cable-unlikely on the TV), digital, either orange RCA plug called coaxial digital, sometimes PCM or Bitstream, or optical digital, a small square plug, also known by an abbreviation I’ve forgotten, but something like Philips Sony Digital Interface, both also requiring R/W audio. In my case my VCR (R/W/Y), old DVD (R/W/R/B/G), and newer (but still 10-yr-old) DVD recorder (R/W/optical digital) are all connected to a switcher, which goes to one TV input (R/W/Optical digital). But since I usually play optical discs on my BluRay player through the HDMI input which upconverts (improves) picture quality to near-HD, perhaps your best solution is to buy a BluRay player for a hundred bucks or so, use the HDMI input (assuming your TV has one available), and one simple cable does it all. Hope this helps! ",
            "date": "Answered February 13, 2020",
            "views": "31",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Barry Stanly",
                "href": "/profile/Barry-Stanly"
            },
            "answer_text": "Yes, but you will probably need an adapter. A lot depends on what kind of output the DVD has. The best is R-G-B (component out). For that use an adapter, such as: Amazon.com: Component to HDMI Converter,ZAMO 5RCA Component RGB YPbPr to HDMI Converter v1.3 HDCP Video Audio Converter Adapter for DVD, PSP, Xbox 360 to New HDTV or Monitor-1080P: Home Audio & Theater This would provide high quality Video, but only stereo sound. If the DVD has an optical sound output as well, then go for something like: Comprehensive RGB YPbPr to HDMI Converter with SPDIF Optical Toslink This provides high quality video and surround sound. If the DVD only has S-Video or RCA jacks, then try: Amazon.com: SVideo to HDMI Converter, RVA to HDMI Adapter Support 1080P, PAL/NTSC Compatible with WII, WII U, PS one, PS2, PS3, STB, Xbox, VHS, VCR, Blue-Ray DVD Players: Home Audio & Theater ",
            "date": "Answered December 22, 2019",
            "views": "11",
            "upvotes": "0"
        }
    ]
}