{
    "title": "Can you wash clothes without detergent? - Quora",
    "tags": [
        "Detergent",
        "Washing Machines"
    ],
    "response": [
        {
            "author_info": {
                "name": "Lori Swain",
                "href": "/profile/Lori-Swain-9"
            },
            "answer_text": "If your wants the scientific answer, I can’t help you. There are several detailed answers already explains molecules and magnets that are interesting to read. If you just rand out of laundry detergent and your wondering if your clothes will get clean without detergent, then yes. Detergent companies love to sell soap. The more they sell, the more money they make. I trick to making more money than you already do is to have consumers buy more. So, that big bottle of detergent says to use a cap full for a larg load. You don’t need a capful. You only need half that. In fact, if your clothes aren’t getting clean and they look dingy and smelly after you’ve finished the laundry, the problem is using too much detergent. Soap leaves a residue behind. It’s a trade off for removing dirt. Problem is, detergent doesn’t wash the left over detergent out. It builds up in your clothes. That’s why you can wash your clothes without detergent and get them clean. There’s enough buildup in your clothes for a few washes. You can test to see if your clothes have a soap build up. In fact,I recommend doing this with every load. Out clothes in the washer without adding any detergent. Let it fill and agitate a few minutes. If you have suds you have soap. The machine will also get a really nasty thick buildup of scum and junk left over from the detergent. Noticeable by removing the basket and looking at the outer tub. This build up can be prevented by using less detergant. When it comes to detergents, less is always best. Water is a great cleaner. In some cases it’s cleans better without detergent. If you wash 2 cars that are the same color etc, one is washer with a car wash soap , a sponge and by hand following the directions. The other is washed by hand with a sponge and only hot water, the car that got the hit water bathe with be cleaner and look shiny and cleaner than the other one. The soap wash will have spots that will show or have to be wiped off. That requires more work. The hot water wash removes the dirt and grim easier plus no extra wiping to remove those ugly spots the detergent leaves. ",
            "date": "Answered February 4, 2019",
            "views": "328",
            "upvotes": " View 24 Upvoters",
            "upvoters": [
                {
                    "user_id": "Rosie Gardenia",
                    "user_href": "/profile/Rosie-Gardenia"
                },
                {
                    "user_id": "Romain Blanchard",
                    "user_href": "/profile/Romain-Blanchard-5"
                },
                {
                    "user_id": "Trevon Cornell",
                    "user_href": "/profile/Trevon-Cornell-1"
                },
                {
                    "user_id": "Jat Sunil Patel",
                    "user_href": "/profile/Jat-Sunil-Patel"
                },
                {
                    "user_id": "Minh Anh",
                    "user_href": "/profile/Minh-Anh-2-1"
                },
                {
                    "user_id": "Arouq Gao",
                    "user_href": "/profile/Arouq-Gao"
                },
                {
                    "user_id": "Paula Palade",
                    "user_href": "/profile/Paula-Palade-2"
                },
                {
                    "user_id": "Maria Castle",
                    "user_href": "/profile/Maria-Castle-4"
                },
                {
                    "user_id": "Shiva Teja",
                    "user_href": "/profile/Shiva-Teja-60"
                },
                {
                    "user_id": "Cloud Nine",
                    "user_href": "/profile/Cloud-Nine-40"
                },
                {
                    "user_id": "Georgene Wickstrand",
                    "user_href": "/profile/Georgene-Wickstrand-1"
                },
                {
                    "user_id": "Jessica Montero",
                    "user_href": "/profile/Jessica-Montero-7"
                },
                {
                    "user_id": "Stephan Roemer",
                    "user_href": "/profile/Stephan-Roemer-1"
                },
                {
                    "user_id": "Tiffany Alexandria Ingle",
                    "user_href": "/profile/Tiffany-Alexandria-Ingle"
                },
                {
                    "user_id": "María R",
                    "user_href": "/profile/María-R-5"
                },
                {
                    "user_id": "Carol Ward",
                    "user_href": "/profile/Carol-Ward-123"
                },
                {
                    "user_id": "Aimee Patton",
                    "user_href": "/profile/Aimee-Patton-2"
                },
                {
                    "user_id": "Shweta Dhingra",
                    "user_href": "/profile/Shweta-Dhingra-17"
                },
                {
                    "user_id": "Fleur X",
                    "user_href": "/profile/Fleur-X-1"
                },
                {
                    "user_id": "Clay Babin",
                    "user_href": "/profile/Clay-Babin"
                },
                {
                    "user_id": "Maxwell Lim",
                    "user_href": "/profile/Maxwell-Lim-2"
                },
                {
                    "user_id": "Bruce Bryant",
                    "user_href": "/profile/Bruce-Bryant-2"
                },
                {
                    "user_id": "Sunil Kothari",
                    "user_href": "/profile/Sunil-Kothari-33"
                },
                {
                    "user_id": "Rachel Jane",
                    "user_href": "/profile/Rachel-Jane-7"
                }
            ]
        },
        {
            "author_info": {
                "name": "Paul Bristow",
                "href": "/profile/Paul-Bristow-4"
            },
            "answer_text": "Yes, you certainly can wash clothes without detergent. But the question really is whether you *should*… I’ve had to deal with this recently, because my washing machine broke down and I couldn’t immediately get a replacement. So I was hand-washing everything, and I wanted to avoid exposing my hands to the soap solution for longer or more often than necessary. First of all, “clean” is not a binary issue: It’s a scale from “perfectly clean” (which nothing is ever guaranteed to be, no matter how you wash it) to “disgustingly filthy”, which happens either when you let dirt/grease build up over time, or when you dive straight into a cess pit. The real questions are:1. What sort of dirt do the clothes have on them, and how much? Is it sweat and body oils from being against your skin, or dust from being exposed to the outside world, or stains from something spilt or smeared on them? 2. When were they last *thoroughly* washed (i.e., is there likely to be a build up grime caught within the fabric, where a superficial rinse can’t reach). And 3. Where are you planning to wear the clothes? Are they just for kicking back at home in, on your own, or are you going to be meeting others in a place where they’ll notice that tiny stain, or that faint whiff of “not the first day he’s worn that shirt”? Regular washing with detergent is advisable, to tackle the grime that sticks most firmly to fibres, and against which water-washing alone only has a slow eroding effect; Underwear especially should be washed “properly” every time, if at all possible; But for a loose shirt worn in cool weather for one day (and no unfortunate food drips!), just rinsing it through and hanging it up to dry is fine, as long as you haven’t worked up a sweat while wearing it (always check the armpits!). The water will carry away any loose dust from the outside and dead skin from the inside, although it’s important to make sure the collar, cuffs and armpits all get a thorough rinse through, as that’s where body oils and sweat tend to soak in. Certainly, anything that smells bad should be washed in detergent (bad smalls usually indicate biological activity, which means both that there are germs in there, and that they’ve found something - usually grease or body-oils - to feed on). But if you’ve run out of detergent and the shops are shut, then washing things without is better than not washing them at all. Just make sure they then go to the front of the queue for another wash once you *do* have detergent. If economy is your main concern, try just using *less* detergent in each wash. Bear in mind that the amounts recommended by manfacturers are a “CYA” measure, to *ensure* your clothes come out clean enough 99% of the time that you won’t go complaining to them, or bad-mouthing their product. You can usually get away with about a third of what they suggest, and still get a perfectly adequate wash. Just check each item as you take it out of the machine: If it doesn’t seem quite clean enough, then add it to the pile for the next load (a 2nd wash usually catches anything the first one missed, unless its a stubborn stain), or create a separate laundry pile for “things that need extra thorough washing”. ",
            "date": "Answered October 30, 2018",
            "views": "163",
            "upvotes": " View 7 Upvoters",
            "upvoters": [
                {
                    "user_id": "Blake Carpenter",
                    "user_href": "/profile/Blake-Carpenter-10"
                },
                {
                    "user_id": "Henry Froelich",
                    "user_href": "/profile/Henry-Froelich-1"
                },
                {
                    "user_id": "Maria Castle",
                    "user_href": "/profile/Maria-Castle-4"
                },
                {
                    "user_id": "Clay Babin",
                    "user_href": "/profile/Clay-Babin"
                },
                {
                    "user_id": "Ashwini Kumar",
                    "user_href": "/profile/Ashwini-Kumar-251"
                },
                {
                    "user_id": "Jack Tondo",
                    "user_href": "/profile/Jack-Tondo"
                },
                {
                    "user_id": "K Chand",
                    "user_href": "/profile/K-Chand-4"
                }
            ]
        },
        {
            "author_info": {
                "name": "Kathy Johnson",
                "href": "/profile/Kathy-Johnson-5"
            },
            "answer_text": "Yes. Absolutely. It is the WATER that actually cleans your clothes. Soap simply breaks the surface tension of the water so it can enter the fabric and lift away the grime. Saying it better: Soap helps the WATER clean better. That said: hot water or very warm water cleans best, as hot water loosens the fabric, and allows the water to enter the fibers. It also kills germs and dust mites which is VERY important. Contrary to what the EPA would like you to believe, cold water does not clean well. Why? Because cold water does exactly the opposite of hot or warm water. Cold water causes the fibers to contract, which prevents the water from really penetrating the fibers. There are supposedly “new cold water detergents” on the market which do have chemicals that can help your clothes clean better in cold water, but trust me on this: I am a retired biochemist and I have done 1000’s of personal tests on laundry cleaning effectiveness, and hands down, the OLD top loaders (not any machine made after the year 2000) clean exceptionally well. For machines made after 2000, it's a crap shoot, and none of them clean all that well, because they don't allow enough water to really wash the clothes, and they don't allow hot water washes. There are detergents that are exceptional such as Dreft and Tide and powdered ALL, as they contain enzymes which do help break down protein stains. BIZ is an enzyme laundry additive. If your detergent already has enzymes, you don't need to add BIZ. So, depending on the detergent, it can help get out stubborn stains. But aside from that, hot water alone will clean your clothes magnificently. My suggestion is to never wear anything twice, and use the hottest water your machine will allow (which you will find is actually only luke warm due to the EPA making the law that laundry machines can't allow hot water anymore.) If you want your clothes clean, the best thing you can do is to find a good top loader made BEFORE 2000. If you can't, then soaking them overnight in a 5 gallon bucket in hot water will do the trick. But yes…You can wash without detergent. But use the hottest setting on the machine. Hot water does not shrink clothes. The hot dryer does. Read this article: How Washington Ruined Your Washing Machine ",
            "date": "Answered June 26, 2020",
            "views": "17",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Justin Willoughby",
                    "user_href": "/profile/Justin-Willoughby"
                },
                {
                    "user_id": "Jonathon Cassell",
                    "user_href": "/profile/Jonathon-Cassell-1"
                },
                {
                    "user_id": "GjP",
                    "user_href": "/profile/GjP-4"
                }
            ]
        },
        {
            "author_info": {
                "name": "Betsy Megas",
                "href": "/profile/Betsy-Megas"
            },
            "answer_text": "You can if you want to, but without detergent, the process will not be as effective at removing skin oil and sweat, and it will definitely not be as effective at removing any oily food you may get on your clothes. Soaps and detergents help water to dissolve and remove oil. I encourage you to read more: How do detergents and soaps work? Since there seem to be several spam answers here, I urge you to ignore anything about “magnetic cleaning” or soap-free “laundry balls”. Using such products is no different than washing in plain water; at best, they may add a little friction and agitation. I suggest using just enough mild detergent or soap to make the water a little slippery or soapy feeling. If it’s getting the job done, it’s enough. If you wish, look for a fragrance and dye free or “free and clear” detergent. ",
            "date": "Updated January 2, 2019",
            "views": "138",
            "upvotes": " View 15 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Catherine Ramsey",
                    "user_href": "/profile/Catherine-Ramsey-3"
                },
                {
                    "user_id": "Jen Ho",
                    "user_href": "/profile/Jen-Ho-14"
                },
                {
                    "user_id": "Minh Anh",
                    "user_href": "/profile/Minh-Anh-2-1"
                },
                {
                    "user_id": "Maura Rudd",
                    "user_href": "/profile/Maura-Rudd"
                },
                {
                    "user_id": "Clay Babin",
                    "user_href": "/profile/Clay-Babin"
                },
                {
                    "user_id": "Damjan Cvetkov-Dimitrov",
                    "user_href": "/profile/Damjan-Cvetkov-Dimitrov"
                },
                {
                    "user_id": "Ken Graham",
                    "user_href": "/profile/Ken-Graham-22"
                },
                {
                    "user_id": "Paul Bristow",
                    "user_href": "/profile/Paul-Bristow-4"
                },
                {
                    "user_id": "Benjamin de Sassou",
                    "user_href": "/profile/Benjamin-de-Sassou"
                },
                {
                    "user_id": "Marie Halan",
                    "user_href": "/profile/Marie-Halan-1"
                },
                {
                    "user_id": "Annette Ford",
                    "user_href": "/profile/Annette-Ford-13"
                },
                {
                    "user_id": "Alan Wu",
                    "user_href": "/profile/Alan-Wu-13"
                },
                {
                    "user_id": "Mikael Bengtsson",
                    "user_href": "/profile/Mikael-Bengtsson"
                },
                {
                    "user_id": "Vincent Fregeac",
                    "user_href": "/profile/Vincent-Fregeac"
                },
                {
                    "user_id": "Mary Nelson",
                    "user_href": "/profile/Mary-Nelson-4"
                }
            ]
        },
        {
            "author_info": {
                "name": "Daniel Castillo",
                "href": "/profile/Daniel-Castillo-87"
            },
            "answer_text": "Sure You Can! You Can, but know that water alone, just as in washing dishes by hand, or a dishwasher, will only clean them so much without a soap, Can you cut a football field without a Riding Mower? Yes, you can use a darn Walking Lawnmower. Can you cut the Footbal Field without a Mower Blade(s)? No, but you Can cut it with Scissors. You have to be practical in anything you do, but you Can do what you, You prefer. So, if you wanna wash clothes, or even Towels & Bed Sheets, without a detergent then Go For It. As a sneaker company says, “Just Do It!” If you would rather be practical as possible, then find a good Detergent, add the right amount & do that. ",
            "date": "Answered June 3, 2019",
            "views": "53",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Joe Perez",
                    "user_href": "/profile/Joe-Perez-123"
                },
                {
                    "user_id": "Elsa Kristian",
                    "user_href": "/profile/Elsa-Kristian"
                }
            ]
        },
        {
            "author_info": {
                "name": "Katie Harvey",
                "href": "/profile/Katie-Harvey-5"
            },
            "answer_text": "Yes you can. You can use ammonia or regular all purpose cleaner for certain household items and can use baking soda to help clean the material. I have used body wash when desperate. These suggestions are for top loading washing machines. ",
            "date": "Answered September 27, 2016",
            "views": "44",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Kanchana Muralidhar",
                "href": "/profile/Queen-Kanchana-From-India-HEH-Muralidhar"
            },
            "answer_text": "Yes , one can wash with the help of anion ball.  It cleans better than detergents. ",
            "date": "Answered October 18, 2019",
            "views": "11",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Kaizad Mistry",
                    "user_href": "/profile/Kaìzad-M-Misty"
                }
            ]
        }
    ]
}