{
    "title": "Can we buy a new 4G smartphone to wait for 5G in India? - Quora",
    "tags": [
        "4G (wireless communication)",
        "Wireless Technology"
    ],
    "response": [
        {
            "author_info": {
                "name": "Neelmani Thakur",
                "href": "/profile/Neelmani-Thakur-1"
            },
            "answer_text": "Hey Don’t Wait For 5G! Read untill end you will Understand. The Most Cheapest Smartphone Was Launched Rs 4999  Amazon India has added another budget smartphone under the 10.or brand (Tenor is how this is pronounced). It is a part of ‘Crafted for Amazon’ program, an offering to guarantee support to select brands for their products throughout its life. The 10.or D is the third smartphone from the company, which had earlier released 10.or G and 10.or E. The 10.or D though, is a budget smartphone with a starting price tag of Rs 4,999 for the 2GB RAM and 16GB storage version. The 3GB RAM and 32GB storage version of 10.or D is priced at Rs 5,999. The under Rs 5000 pricing meaning it will compete with devices like Xiaomi’s Redmi 5A in the market. In terms of specifications, 10.or D has a 5.2-inch HD resolution display (720 x 1080 pixels) and is powered by Qualcomm Snapdragon 425 processor and 13MP rear camera and a 5MP front camera. 10.or D’s processor is clocked at 1.4GHz and this is a quad-core one coupled with Adreno 308 GPU. Battery is the other aspect of this phone that Amazon is highlighting as it comes with a 3500mAh one on board. It runs on Android 7.1.2 Nougat out-of-the-box. The smartphone has near stock Android powering it, though Amazon apps will be pre-loaded. There’s also a fingerprint sensor on board. Interestingly, Amazon is promising two days of battery life with the 10.or D smartphone, which at this price point could be a crucial feature. The 10.or D mobile also comes with OTG support and there’s FM Radio on board as well. The 10.or D mobile will go on sale on January 5, 2018. Users will have to register on Amazon India to get alerts about the sale, though the company does not call this a flash sale. Amazon is also giving Amazon Prime members who purchase this smartphone an year of additional warranty on the device. Read Full Specification/ Price/Offers/Overview Source: Amazon 10 or D Smartphone (Tenor) Price And Features ",
            "date": "Answered December 21, 2017",
            "views": "31",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Swastik Swarup Das",
                "href": "/profile/Swastik-Swarup-Das"
            },
            "answer_text": "I honestly disagree to all these answers, and would highly recommend you give mine a read. Technological and network growth has seen an exponential growth in India thanks to the IT sector, the government and our Space Organisation ISRO’s valuable work. Trend has taught us that 5G will set foot in India faster than all and any expectations. While majority of India’s population got used to 4G after JIO, while I read the news of JIO getting released on my 15mbps airtel network. Its only the network plans that changed after the arrival of JIO. The actual network had zero influence. Now things have changed and i have moved on to a faster broadband network for my house and going upto speeds of 100 mbps. Talking about facts, South Korea already has experimental 5G in use, commercial usage might start after the New Exynos Chip or the Qualcomm 855, whichever comes first. Mediatek P50 is also going to hit the markets at highly affordable prices but uncompromised technological prowess, different from its predecessor chips. India recently launched GSAT-10 specifically for 5G an another sat is going to be launched. Companies are trying to push 4G phones as fast as they can, so my opinion would be to go for a phone that has hardware that is going to hold its value over 3–4 years, and then you should exchange it at first glance of a 5G phone of your choice in 2019 or 2020 to get the first rate benefits. 5G will be faster than you can blink. Its about the people can afford it or not and wait 2000 years for JIO to bring 5G and claim that India had 5G so late. ",
            "date": "Answered December 14, 2018",
            "views": "25",
            "upvotes": "0"
        }
    ]
}