{
    "title": "Can ussd send text messages? - Quora",
    "tags": [
        "USSD"
    ],
    "response": [
        {
            "author_info": {
                "name": "Harald Naumann",
                "href": "/profile/Harald-Naumann"
            },
            "answer_text": "The IoT M2M Cookbook at:M2M IoT Cookbook - How to develop a device based on Wireless Wide Area Network modulesshows an opening at public toilet and and a ultra low power GSM / GPS tracker. A USSD a bearer to transmit ASCII text like SMS. Nevertheless USSD is much faster than SMS. You will maybe miss the store and forwarding like with SMS. Public Toilets 4.0 – Vending comes to the Bathroom     Vending at public toiletIn the Netherlands, a new billing system for public toilets which is  based on mobile wireless technology has been developed by “NeoNumus”.  The costs incurred for provision of the facilities, cleaning and  maintenance are paid quickly and simply by the customer by “mobile  phone” via a cashless system. This system reduces the waiting time for  service and maintenance and improves protection against break-ins.Which technology does this system use?Most people take their Smartphone with them wherever they go. What  could be easier than using your phone to open a door? The concept was  designed so that even ancient mobile phone models can do this. USSD is  used rather than SMS. A number of services in the GSM network are based  on USSD. The call, or the request to make a connection, is already a  USSD in itself. The round trip for the USSD out to the server and back  takes around 2 seconds. A text message needs 6 to 10 seconds in one  direction only. However, sometimes it can even take anywhere between 6  minutes to 6 days, or the SMS is not delivered at all. With USSD, the  acknowledgement arrives immediately as the door is opened. The service –  the opening of the door – must also be billed. The USSD is sent by the  network operator in two directions to a “NeoNumus” server. This means  that the SIM card must be billed somehow. There is also further access  to other servers for billing of the service via the network operator.  Inexpensive GSM modules are employed, however, inexpensive in this case  was not quite cheap enough. The most cost-effective GSM module was still  way too costly. The costs of the module have been balanced out by an  intelligent installation concept which uses an integrated antenna. 18  years ago, the author was a remote vending project manager for a service  provider of vending machines. This company covered everything, from  filling the vending machines to their installation. Back then, it was  established that over 90% of machines could be equipped with wireless  technology and this was also the case when the antennae were built into  the vending machines. Since then, the availability of wireless has  improved even further. If the antennae need to stay inside the machines,  there is no need to drill any holes. This practical experience has  undergone even further refinement.Why buy an antenna when you can build one yourself?  WWAN inverted F antennaThe GSM antenna, the GSM module and the remaining electronic  components are located on the same PCB. Standard enclosures generally  have four domes with a screw in each corner. These enclosures have now  been optimized to just three screws below the antenna. This eliminates  the influence of the screws on the antenna (even plastic screws can  affect the antenna). In addition, the antenna ground plane is adapted to  the required physical size at 45 mm x 90 mm. For systems without a  power supply, an antenna toggle switch to the external antenna socket is  available. The scan operation of the GSM module is launched twice when  the PCB is first put into service. Once with an external magnetic  antenna installed on a large metal plate, and a second time with the  internal antenna on the PCB. The result: the internal antenna was able  to receive more base stations than the external model. This concept  saves on external antennae and significantly reduces installation costs.  The savings versus the costs for the GSM module are neutral. Besides,  the PCBs were developed for vending machines, not for toilets.  Standardized interfaces can help with the use of these PCBs for vending  applications. - See more at:  http://www.gsm-modem.de/M2M/m2m-news/public-toilets-4-0-%e2%80%93-vending-comes-to-the-bathroom ",
            "date": "Answered November 9, 2014",
            "views": "34",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Vikrant Singh Chauhan",
                "href": "/profile/Vikrant-Singh-Chauhan"
            },
            "answer_text": "Yes, USSD can be used to send text messages but as it is GSM based service everything stays with operator. There are very few mobile solution companies which provide this service because they have contract with mobile operators. But here important thing is to understand how USSD works so what kind of text messages can be send. USSD works on two methods i.e. Pull and Push. and is supported by 99.9% mobiles.Pull is like service menu which was is still in use where user dial a short code starting with * and followed by #. In response to this user receieve a service menu on their mobile which allow interactive requests (send-receieve). Whereas Push messages is like notification on users mobile which can only be initiated by operators' server. USSD messages have limit of 180 characters and can not be stored, forwarded . Please do reply if you are looking for any specific information and please do mention your requirement so it would be easy for other users to address your question. ",
            "date": "Answered June 1, 2012",
            "views": "32",
            "upvotes": " View 6 Upvoters",
            "upvoters": [
                {
                    "user_id": "Axmed Nuur",
                    "user_href": "/profile/Axmed-Nuur"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/Paurothy-1"
                },
                {
                    "user_id": "Surajsingh Rajput",
                    "user_href": "/profile/Surajsingh-Rajput"
                },
                {
                    "user_id": "Paul Marsland",
                    "user_href": "/profile/Paul-Marsland"
                },
                {
                    "user_id": "Parvin Gasimzade",
                    "user_href": "/profile/Parvin-Gasimzade"
                },
                {
                    "user_id": "Akhil Singh",
                    "user_href": "/profile/Akhil-Singh"
                }
            ]
        }
    ]
}