{
    "title": "Can technology solve our environmental problems? - Quora",
    "tags": [
        "Environmental Problems Solving",
        "Environmental Science",
        "Environmentalism",
        "The Environment"
    ],
    "response": [
        {
            "author_info": {
                "name": "Thalbert McGinness",
                "href": "/profile/Thalbert-McGinness"
            },
            "answer_text": "Let’s put it this way. You are not going to solve them without technology. Thr needs may be as simple as providing input to someone’s habitat that will result in less need for generated energy or as complicated as window panes or exterior wall coverings created to act as solar panels. It could be as simple as inverting a liter soda bottle in a hole in the roof of a hut in Africa to provide better lighting inside. How to build a SOLAR BOTTLE BULB Or it might be the “largest environmental cleanup in history”. www.theoceancleanup.com Whatever it is, without tech, the job will never be finished. ",
            "date": "Answered February 28, 2017",
            "views": "17",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Jeff Hawkins",
                    "user_href": "/profile/Jeff-Hawkins-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "David Torrens",
                "href": "/profile/David-Torrens"
            },
            "answer_text": "We can get energy from solar, wind and tidal power but that only gets enough power for our needs rather than all our wants. To solve that we will need to learn to consume less and that requires millions of people to adjust their lifestyles; which is hard to achieve in a democracy where people are free to vote for leaders who don't believe there is any need for action on climate change or regulations to protect the environment. ",
            "date": "Answered February 28, 2017",
            "views": "654",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Robert Bernal",
                "href": "/profile/Robert-Bernal"
            },
            "answer_text": "It has to because we've already passed the sit down and do nothing tipping point, regarding global warming. Even if we all quit using fossil fuels today! Compounding feedback effects have already been put in motion… Eventually, we will use molten salt reactors, wind, solar and lots and lots of batteries to convert the remainder of the fossil fuel store into graphene cities that will almost scrape the edge of space. But first, we must use all these clean energy sources, in great abundance, to literally remove the excess CO2 from the air by material and mechanical means. And to power FUTUREWORLD. ",
            "date": "Answered October 31, 2018",
            "views": "15",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "BEI",
                    "user_href": "/profile/BEI-17"
                },
                {
                    "user_id": "Rod Samper",
                    "user_href": "/profile/Rod-Samper"
                }
            ]
        },
        {
            "author_info": {
                "name": "Svilen Fal",
                "href": "/profile/Svilen-Fal"
            },
            "answer_text": "One imagines that our environmental problems are caused by technology, and will also be solved by technology. That, and time. And money. And effort. Another way to look at it is there weren’t these issues (specifically) in 1850 or really even 1950, but especially in 1750. So a return to those sorts of population levels 1/2 or 1/8 or less now, or having the effect of some lower population created by increased technology, is the main way to remove the issues created as time has gone one. ",
            "date": "Answered October 31, 2018",
            "views": "833",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Jim Yushchyshyn",
                "href": "/profile/Jim-Yushchyshyn"
            },
            "answer_text": "To a large extent, yes. Some municipalities have been treating sewage for over a century. Cars have been equiped with catalytic converters for over 40 years. Even global warming can be fixed with new energy sources, such as solar, hydro and nuclear power. ",
            "date": "Answered October 31, 2018",
            "views": "162",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Steve Clark",
                "href": "/profile/Steve-Clark-17"
            },
            "answer_text": "If technology can help us to efficiently harvest food and energy, then yes. The technology exists today but there are very few products on the market. This is due mostly to big ag and the extraction industry having a stranglehold on the government of the country that consumes 25% of the world’s resources despite having only 5% of its population. ",
            "date": "Answered November 7, 2018",
            "views": "385",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "S Verma",
                "href": "/profile/S-Verma-73"
            },
            "answer_text": "First of all its clear that all Mostly environmental Problems was created technology and development specially after industrial revolution. for combating Environmental problems lots of Technology advancement required lots of Green Technologies is being used to reduce environmental problems, Biotechnology is the key solution for these type of environmental problems ",
            "date": "Answered March 25, 2019",
            "views": "347",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "John Dunn",
                "href": "/profile/John-Dunn-410"
            },
            "answer_text": "Getting rid of technology might help! By the way fyi I'm a practicing Luddite . . .!!   ",
            "date": "Answered July 4, 2020",
            "views": "86",
            "upvotes": "0"
        }
    ]
}