{
    "title": "Can we get the location of someone's cell phone? - Quora",
    "tags": [
        "Cell Phone Location",
        "Cell Phone Tracking",
        "Location Data",
        "Telephone Numbers"
    ],
    "response": [
        {
            "author_info": {
                "name": "Kit Kilgour",
                "href": "/profile/Kit-Kilgour"
            },
            "answer_text": "Not an arbitrary cellphone - unless you are an operator, law enforcement or a very good (& illegal) hacker. The question isn’t completely clear. In terms of physically determining the location, a cellphone can use GPS, Cell Identity etc, and the network can provide assisted means (e.g. trilateration between a number of base stations). If you are asking whether a 3rd party can locate a cell phone, then without application assistance you need to be an operator, or law enforcement with a warrant to go to the operator. The operator will be able to tell you the last known location of the phone (it may be switched off or out of coverage for instance). If you can put an application on the phone and it is on, then you can locate/track it (e.g Android manager, findmyphone apps), but this will normally require physical access to the phone and probably detectable unless a highly sophisticated app that is designed to have very limited detectability. Lastly, some sophisticated hackers have developed techniques to ask networks for the identity of the cell serving the phone by compromising use of the SS7 protocol between networks. Network operators are working to tighten up on this. ",
            "date": "Answered August 1, 2018",
            "views": "18",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Kashinath Paul",
                    "user_href": "/profile/Kashinath-Paul-3"
                }
            ]
        },
        {
            "author_info": {
                "name": "Shailesh Birajdar",
                "href": "/profile/Shailesh-Birajdar"
            },
            "answer_text": "Yes off course!!!!! There are multiple ways through which you can detect the location of a cell phone. The cell-phone user has to be a loose canon and a total fool in privacy matters.. You can accurately get the GPS location through Facebook Messenger for the person you are chatting with.You may install various “Fitness” apps that track nearly every activity like walking, driving, cycling etc. The same can transmit location to your PC in you have synced the ac.Google’s “My Tracks” also allows the same if you kept it running in background and the user didn't notice it.Hacking- Which is off course illegal…",
            "date": "Answered January 28, 2017",
            "views": "21",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Stonzy De Blaze Alfred",
                    "user_href": "/profile/Stonzy-De-Blaze-Alfred"
                },
                {
                    "user_id": "Nirmal Shah",
                    "user_href": "/profile/Nirmal-Shah-42"
                }
            ]
        }
    ]
}