{
    "title": "Can the US President override a Supreme Court decision? - Quora",
    "tags": [
        "United States Supreme Court Justices",
        "U.S. Supreme Court",
        "Law"
    ],
    "response": [
        {
            "author_info": {
                "name": "Rohit Pratapsingh",
                "href": "/profile/Rohit-Pratapsingh"
            },
            "answer_text": "It has been assumed that once the Supreme Court issues a decision, the other courts in this country are bound to follow the decision for all future cases that fall within the announced rule. However, it can be argued that in most circumstances, neither the Constitution nor federal law requires other courts to follow the Supreme Court. Indeed, it has been the Supreme Court itself that has demanded that their decision be binding on future cases. This seems to be the type of usurpation of power is the type our Founders detested and the Constitution was meant to prohibit. The traditional view has held that once the Supreme Court makes a decision, that decision becomes the law of the land and cannot be overturned, except through an act of Congress or constitutional amendment. Until Congress acts, lower courts are believed to lack the authority to rule counter to the Supreme Court’s decision. This can lead to poor decisions remaining the judicial law until either the Supreme Court or Congress overrules the decision. This happened in Plessy v. Ferguson, where the Supreme Court ruled “separate but equal” laws were constitutional under the Equal Protection Clause. This decision remained the law of the land for nearly 60 years before the Court ruled against “separate but equal” in Brown v. Board of Education. This mindset can also lead to the waiting game we have seen surrounding ObamaCare since the Court’s decision in NFIB v. Sebelius. Since that decision, upholding the Patient Protection and Affordable Care Act, we have seen plenty of activity trying to get the Court to overrule themselves and declare ObamaCare unconstitutional. However, we have seen little action from Congress or the lower courts on overturning ObamaCare. It is as if people are waiting, and hoping, the Supreme Court will do the dirty work themselves and overturn their previous decision. However, there is another way of looking at the judiciary’s role in deciding constitutional matters. This view holds that the Constitution does not require that lower federal courts follow past Supreme Court decisions in future cases. The use of the term “inferior” in Article III implies these courts are somehow smaller, either in the types of cases they can hear or the area they have jurisdiction over. The term “inferior” also means the courts can be overruled on appeal; however, it does not mean the courts must be subservient or deferential to the Supreme Court. This view further holds that the judicial power is the power to decide individual cases and controversies, not future cases. Article III grants this power to decide cases and controversies to the Supreme Court, but it does not grant the Court the power to determine the outcome of future cases. However, federal lower courts should be required to follow Supreme Court decisions in particular cases when they are issued the cases on remand. There must be a final decision in every case, and when a case is in the federal court system the Supreme Court has final decision making authority. Article III vests the judicial power in the Supreme Court and does not require any other federal courts. Therefore, the Supreme Court must have the power to have their decisions followed in each specific case. Courts should be permitted, but not required, to follow Supreme Court decisions. This fits with the Constitution’s structural principle of dividing power and preventing the centralization of power. It also helps ensure federal law remains the supreme law of the land by preventing the Supreme Court from equating itself with the law, and thus becoming a law unto itself. It is better to reach the right conclusion as to law, rather than follow previous decisions, even if it means there may be some discrepancies between the circuits. The Constitution is the supreme law of the land, not the Supreme Court, because of this judges take an oath and are bound to the Constitution, not the Supreme Court. ",
            "date": "Answered July 16, 2019",
            "views": "38",
            "upvotes": " View 6 Upvoters",
            "upvoters": [
                {
                    "user_id": "Stephen",
                    "user_href": "/profile/Stephen-187"
                },
                {
                    "user_id": "Andrew Collins",
                    "user_href": "/profile/Andrew-Collins-233"
                },
                {
                    "user_id": "Angela Warner",
                    "user_href": "/profile/Angela-Warner-3"
                },
                {
                    "user_id": "John Karoly",
                    "user_href": "/profile/John-Karoly-1"
                },
                {
                    "user_id": "George Karpel",
                    "user_href": "/profile/George-Karpel"
                },
                {
                    "user_id": "Richard Tast",
                    "user_href": "/profile/Richard-Tast"
                }
            ]
        },
        {
            "author_info": {
                "name": "Jeff Lewis",
                "href": "/profile/Jeff-Lewis-73"
            },
            "answer_text": "No, or Presidents would have already done it! The American system is set up as “checks and balances” and broken into three branches of government. Legislative, Executive, and Jydicial. If the Supreme Court rules a law passed by Congress and signed by the President is unconstitutional, then the only way around that is to pass a Constitutional Amendment There’s only been 27 Amebdments passed in the coubtry’s history, and for good reason. For an Amendmejt to the Constitution to pass it has to pass Congress but also be ratified by a two-thirds majority of the states. That’s virtualky impossible to obtain because of the strong political differences of the states. The Equal Rughts Amendnent which would give women the same rights as men failed every year for two decades to get the majority needed on an issue most people would think would pass easily. The Legislature can also change the way a bill is written to pass the law that the Supreme Court has shot down. In other words, it may just be one part of the law that the court has an issue with, so they just remove that portion and the remainder of the law is usually fine. So, regally only Congress has a way to make changes to get past a Supreme Court ruling, the President doesn’t have that kind of power, other than signing the bill into law. However, one thing to keep in mind is no matter how people present it, the Supreme Court is as political as the other two branches even though that was not the intention of the founding fathers. It’s why each party is desperate to be the ones to fill a vacancy because they know those positions will in most cases follow their political ideology. Where the way it is supposed to be, the Supreme Court is only supposed to interpret the law the way they believe it was written, not the way they believe it should be. Ubfirtunstejy, that’s not the case very often if it’s a hot button political issue. ",
            "date": "Answered June 21, 2018",
            "views": "8",
            "upvotes": " View 9 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Aaliyah Gomez",
                    "user_href": "/profile/Aaliyah-Gomez-1"
                },
                {
                    "user_id": "Angela Warner",
                    "user_href": "/profile/Angela-Warner-3"
                },
                {
                    "user_id": "Terri Geer",
                    "user_href": "/profile/Terri-Geer"
                },
                {
                    "user_id": "Kevin Connolly",
                    "user_href": "/profile/Kevin-Connolly-108"
                },
                {
                    "user_id": "Peter Tobin",
                    "user_href": "/profile/Peter-Tobin-9"
                },
                {
                    "user_id": "Diana Allmer",
                    "user_href": "/profile/Diana-Allmer"
                },
                {
                    "user_id": "Mark Noonan",
                    "user_href": "/profile/Mark-Noonan-3"
                },
                {
                    "user_id": "Jay Martin",
                    "user_href": "/profile/Jay-Martin-130"
                },
                {
                    "user_id": "Charlie Jacobs",
                    "user_href": "/profile/Charlie-Jacobs"
                }
            ]
        },
        {
            "author_info": {
                "name": "Jeremy Smith",
                "href": "/profile/Jeremy-Smith-395"
            },
            "answer_text": "It happened at least once. In 1832 president Andrew Jackson refused to obey the Supreme Court ruling in Worcester v. Georgia. Jackson famously said, ”John Marshall has made his decision; now let him enforce it!” Those were very shaky times for the Supreme Court. It was not even clear that it had the authority to review the constitutionality of federal and state laws. All that any court can do, then as now, is to render decisions and issue orders. The courts themselves do not have any means of enforcing their judgments. For this they must rely on the executive branch of government. If the executive branch refuses to enforce a court order or judgment the court is powerless to do anything about it. This is where both Congress and public opinion play a very significant role. Congress can exert a great deal of direct pressure on the president to compel him to obey the court’s judgment. President Nixon had been ordered to surrender White House tapes to the special prosecutor. He had failed to comply within a reasonable period of time, in this case just hours. Congressional leaders met with the president and threatened to impeach him if failed to surrender the tapes immediately. The tapes were promptly surrendered. The only other recourse to compel compliance would be a groundswell of public pressure on both the president and the Congress, demanding that Congress impeach the president if he should fail to comply with the order. Courts today are on much firmer ground than two hundred years ago. Their orders and judgements today carry more weight and prestige than in Chief Justice Marshall's day. The fact that they do is in no small part attributable to his legal and political genius. ",
            "date": "Answered December 18, 2019",
            "views": "13",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Angela Warner",
                    "user_href": "/profile/Angela-Warner-3"
                },
                {
                    "user_id": "Kelly Scaletta",
                    "user_href": "/profile/Kelly-Scaletta"
                }
            ]
        },
        {
            "author_info": {
                "name": "Richard Combs",
                "href": "/profile/Richard-Combs-7"
            },
            "answer_text": "Hello there OP, Certainly he can, he/she is free to act and take responsibility for his/her actions. As a result of overriding a Supreme Court decision he/she would either be impeached, tried and removed from office, or taken kindly and gently to Walter Reed Hospital because he, or she’d have had a breakdown. Then the 25th Amendment[1] would come into play and the Vice President would take over until the President is able to resume his/her duties. Edit: (Bob Trammell reminded me that I forgot to mention a key point.) If Congress agrees with the President’s action, there will be no impeachment and the court will be overridden. That is checks and balances in action. Of course, there is another issue to have to overcome, and that is finding someone to obey his/her orders to disregard a Supreme Court, or any Federal Court ruling for that matter. The Constitution is rooted in the Separation of powers that strikes a balance. The Executive cannot Constitutionally override the Judicial.[2] Ciao. Footnotes[1] The Constitution: Amendments 11-27[2] The Constitution of the United States: A Transcription",
            "date": "Answered November 29, 2018",
            "views": "15",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Ken Kennwisher",
                    "user_href": "/profile/Ken-Kennwisher"
                },
                {
                    "user_id": "Diana Allmer",
                    "user_href": "/profile/Diana-Allmer"
                }
            ]
        },
        {
            "author_info": {
                "name": "Jean Pierre Eddy",
                "href": "/profile/Jean-Pierre-Eddy"
            },
            "answer_text": "The US supreme court is known to be the court of last resort, the judicial branch of the government is the most influential. First , the justices have lifetime appointments and their decisions can affect future generations. There are three co-equal branches of government in the united states. The president cannot reverse a supreme court decision. On the contrary, a law enacted by the supreme court can be challenged in the future by either political party depending on the direction of the court ( liberal judges VS conservative judges). To my narrow understanding, the supreme court is a political institution, because the justices are appointed by either a Republican president or by Democratic president. At this present moment, in 2020, president Trump and the Republicans are trying to dismantle, step-by-step, all the 15 provisions of the Affordable care act, enacted by the supreme court, through a series of lawsuits. Since the court, now, is leaning towards the right, the nine justices will decide the faith of The Affordable care act. ",
            "date": "Updated June 29, 2020",
            "views": "345",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Tony Collins",
                "href": "/profile/Tony-Collins-44"
            },
            "answer_text": "Not at all. That is why there are three branches. If he or Congress disagree with a Supreme Court decision, the only way to override it would be with a constitutional amendment. For instance the Courts decision that legalized gay marriage. The United States Congress would have to pass a constitutional amendment stating that legal marriage in the United States can only be between a man and a woman. Then the amendment has to be ratified by the states before it becomes law. ",
            "date": "Answered June 21, 2018",
            "views": "11",
            "upvotes": " View 3 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Terri Geer",
                    "user_href": "/profile/Terri-Geer"
                },
                {
                    "user_id": "Bob Trammell",
                    "user_href": "/profile/Bob-Trammell-1"
                },
                {
                    "user_id": "Ivan Ruddock",
                    "user_href": "/profile/Ivan-Ruddock-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "James Michael",
                "href": "/profile/James-Michael-196"
            },
            "answer_text": "No. The way the US system of checks and balances works, the President can make policies which are aimed at enforcing the laws passed by Congress, and can direct the various functions of the Executive branch, but his actions still must comport with the Constitution, which is the highest law of the land. Questions about the President’s authority can be brought in the Federal Courts, the highest of which is the Supreme Court. The Supreme Court’s decisions are the final word on what the law is at the time of the decision. If the President doesn’t like the decision, he can ask Congress to change the law. ",
            "date": "Answered June 21, 2018",
            "views": "534",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Jacob Ningen",
                    "user_href": "/profile/Jacob-Ningen-1"
                },
                {
                    "user_id": "Bob Trammell",
                    "user_href": "/profile/Bob-Trammell-1"
                },
                {
                    "user_id": "Thomas P. Buehner",
                    "user_href": "/profile/Thomas-P-Buehner"
                }
            ]
        },
        {
            "author_info": {
                "name": "Stephen Bliss",
                "href": "/profile/Stephen-Bliss"
            },
            "answer_text": "No. The Supreme Court is the highest court in America. Once they make a decision everyone, including the president must abide by the decision. There is no way around it. Witness the county clerk in Kentucky who refused to issue marriage licenses to gay couples. Her protest did not last long. The president must abide by the decisions of the Supreme Court. That is why he did not issue an executive order to insert the citizenship question in the census. It would be a violation of the constitution if he did that. ",
            "date": "Answered July 13, 2019",
            "views": "336",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "John Freiler",
                "href": "/profile/John-Freiler"
            },
            "answer_text": "Sort of. A President can choose to not enforce a SCOTUS decision. This would be a violation of his oath and he could be removed by congress for it, so he’d better not do so without their support, but if POTUS has Congressional support, then the other two branches can effectively overrule the third. ",
            "date": "Answered March 30, 2020",
            "views": "233",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Jackie Zambrano",
                    "user_href": "/profile/Jackie-Zambrano-2"
                },
                {
                    "user_id": "Mindy Bee",
                    "user_href": "/profile/Mindy-Bee-2"
                }
            ]
        },
        {
            "author_info": {
                "name": "Cheryl Williams",
                "href": "/profile/Cheryl-Williams-41"
            },
            "answer_text": "No. The Supreme Court can rule against a President or Congress, but the President can’t do anything but obey their decision or ask Congress to pass a law. Sometimes passing a law won’t even fix the problem, it would take an Amendment to the Constitution. That’s really hard to get done so it’s probably easier to just accept defeat ",
            "date": "Answered June 21, 2018",
            "views": "213",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Bob Trammell",
                    "user_href": "/profile/Bob-Trammell-1"
                },
                {
                    "user_id": "Bion Michael Shelden",
                    "user_href": "/profile/Bion-Michael-Shelden"
                }
            ]
        },
        {
            "author_info": {
                "name": "Bob Trammell",
                "href": "/profile/Bob-Trammell-1"
            },
            "answer_text": "Can the US President override a Supreme Court decision? There are some very good answers here. All I can add is that a President can (and several have) ignore a Supreme Court decision. The decision still stands, but if Congress doesn’t impeach the President for the action, the Supreme Court is powerless. ",
            "date": "Answered December 17, 2018",
            "views": "283",
            "upvotes": " View 5 Upvoters",
            "upvoters": [
                {
                    "user_id": "Sharmake Farah",
                    "user_href": "/profile/Sharmake-Farah-4"
                },
                {
                    "user_id": "Robert Douglas",
                    "user_href": "/profile/Robert-Douglas-7"
                },
                {
                    "user_id": "Charles Vanderford",
                    "user_href": "/profile/Charles-Vanderford-2"
                },
                {
                    "user_id": "Jacob Ningen",
                    "user_href": "/profile/Jacob-Ningen-1"
                },
                {
                    "user_id": "Aditya Chhabra",
                    "user_href": "/profile/Aditya-Chhabra-45"
                }
            ]
        },
        {
            "author_info": {
                "name": "Dwight Looi",
                "href": "/profile/Dwight-Looi"
            },
            "answer_text": "No, but if he refuses to obey one there is NOTHING the courts can do about it. At that point, only congress has the power to impeach and remove the president. If they are on the President’s side, or if they simply cannot muster the two thirds senate majority to remove the president, then the courts lose and are powerless. It’s called the balance and separation of powers between the three branches of government. ",
            "date": "Answered September 23, 2019",
            "views": "208",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Robert Perez",
                "href": "/profile/Robert-Perez-73"
            },
            "answer_text": "No. The United States Supreme Court is the final arbiter of what the law is in this nation, and no man (or woman) is above the law. Not even Donald. Most especially not Donald. A President can try to defy the Court but that would almost certainly land her in Impeachment proceedings, and might even constitute contempt of court. ",
            "date": "Answered June 21, 2018",
            "views": "149",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Matthew Schutz",
                "href": "/profile/Matthew-Schutz-2"
            },
            "answer_text": "No. Depending on the nature of the decision. If it was constitutional in nature, one would have to amend the constitution. That has no Presidential input. If the decision was interpreting a statute, the statute can be amended, in which case congress would approve it and the president would have to sign it. ",
            "date": "Answered June 21, 2018",
            "views": "307",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Bob Trammell",
                    "user_href": "/profile/Bob-Trammell-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "John Linney",
                "href": "/profile/John-Linney-3"
            },
            "answer_text": "No. Congress and the President acting together can overrule certain Supreme Court cases that are not constitutionally based by passing a simple law. A constitutional decision can be reversed only by passing a Constitutional Amendment, which takes a super majority of Congress and a super majority of the States. ",
            "date": "Answered June 21, 2018",
            "views": "212",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Mark Shainblum",
                    "user_href": "/profile/Mark-Shainblum-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Rodrigo Silveira",
                "href": "/profile/Rodrigo-Silveira-22"
            },
            "answer_text": "Let’s start by establishing that the first 3 articles of our Constitution establish 3 independent branches, with mechanisms for them to balance each other. This is essential to understand what follows. The Congress. Article I, writes the Law. The President, a unitary President, executes the Law - their interpretations thereof, and the Judicial, Article III adjudicates disputes between the two and the States, according the Constitution. The SCOTUS issues opinions. Most of us choose to accept these opinions as the Law. I choose to interpret it as a recommend course of action. I’m not the only one! Many Americans choose to do the same and keep coming back to the SCOTUS with variations on their themes until they get an opinion they like, at which point they want to call it the Law! Give me a break. ",
            "date": "Answered July 16, 2019",
            "views": "126",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Richard Tast",
                    "user_href": "/profile/Richard-Tast"
                }
            ]
        },
        {
            "author_info": {
                "name": "Brian Charboneau",
                "href": "/profile/Brian-Charboneau"
            },
            "answer_text": "No. The Constitution and laws passed pursuant to it are the supreme laws of the US. The entire legislative power of the US is with the Congress. US Supreme Court decisions are authoritative statements of what the law is and what it is not. ",
            "date": "Answered July 16, 2019",
            "views": "72",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Richard Tast",
                    "user_href": "/profile/Richard-Tast"
                }
            ]
        },
        {
            "author_info": {
                "name": "Charlie Jacobs",
                "href": "/profile/Charlie-Jacobs"
            },
            "answer_text": "Read Jeff’s answer. The whole idea the Constitution establishes branches of government that can limit each other to a large degree. So, the President’s remedy to a court decision s/he opposes is to propose legislation. However, if the Supreme Court holds a right is personal, the right to marry, for example, the executive remedy is very limited. ",
            "date": "Answered June 21, 2018",
            "views": "355",
            "upvotes": " View 2 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Sharmake Farah",
                    "user_href": "/profile/Sharmake-Farah-4"
                },
                {
                    "user_id": "Bob Trammell",
                    "user_href": "/profile/Bob-Trammell-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Robert Douglas",
                "href": "/profile/Robert-Douglas-7"
            },
            "answer_text": "It's rare but not without precedent. A brief history of presidents telling ‘so-called’ judges to get lost The system largely depends on allowed players having respect for institutional integrity. There have been several instances where pundits and scholars have opined over the possibility of President Trump defying the courts. So far, it has been just so much hand wringing. ",
            "date": "Answered July 22, 2019",
            "views": "118",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "RJ Lamoreux",
                "href": "/profile/RJ-Lamoreux"
            },
            "answer_text": "The president can not override any decision made by the Supreme Court, the Supreme Court evaluates laws, Congress makes laws, and the president enforces laws. There is a loop-hole however, the president can choose to not enforce this ruling, however he may be impeached as a result of this decision. ",
            "date": "Answered January 1, 2019",
            "views": "119",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "James Feigenbaum",
                "href": "/profile/James-Feigenbaum-2"
            },
            "answer_text": "Not unless he wants to start a civil war. ",
            "date": "Answered June 27, 2020",
            "views": "73",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Patrick Khaw",
                    "user_href": "/profile/Patrick-Khaw"
                },
                {
                    "user_id": "Norm Fishler",
                    "user_href": "/profile/Norm-Fishler"
                },
                {
                    "user_id": "Deb Headley",
                    "user_href": "/profile/Deb-Headley"
                }
            ]
        },
        {
            "author_info": {
                "name": "Michail Kalman",
                "href": "/profile/Michail-Kalman-1"
            },
            "answer_text": "the people ( via the Congress) can by either writing, passing and having the states ratify an Constitutional Amendment or passing legislation that is in accord with the Constitution. ",
            "date": "Answered October 2, 2020",
            "views": "49",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Donald Cook",
                "href": "/profile/Donald-Cook-78"
            },
            "answer_text": "Certainly, there is no higher source of law. Although the Congress can write law which, if it does not violate the Court’s view of the Constitution, will overrule the Court’s decision. ",
            "date": "Answered July 17, 2019",
            "views": "40",
            "upvotes": " Answer requested by Charles Raisor",
            "upvoters": [
                {
                    "user_id": "Nancy Fitzgerald",
                    "user_href": "/profile/Nancy-Fitzgerald-47"
                }
            ]
        },
        {
            "author_info": {
                "name": "Sheila MacArthur",
                "href": "/profile/Sheila-MacArthur"
            },
            "answer_text": "No. Congress can make new law tho. The Court interprets the Constitution. If a law congress made is unconstitutional the court can deem the law illegal / cancelled. So congress can fix it and put it back in place. The president could create a new executive order if the Court shot down a law he wants. ",
            "date": "Answered June 22, 2018",
            "views": "125",
            "upvotes": " Answer requested by Ivan Ruddock",
            "upvoters": [
                {
                    "user_id": "Lisa Kinsler",
                    "user_href": "/profile/Lisa-Kinsler"
                }
            ]
        },
        {
            "author_info": {
                "name": "David Ramsey",
                "href": "/profile/David-Ramsey-33"
            },
            "answer_text": "No, the Supreme Court is the final decision. It takes either a constitutional amendment or another Supreme Court decision to change a decision the Supreme Court has handed down. ",
            "date": "Answered June 27, 2020",
            "views": "35",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Marcus Kwan",
                "href": "/profile/Marcus-Kwan-3"
            },
            "answer_text": "To put it simplistically, the Executive, Legislative, and Judicial branches are separate and co-equal branches of the government that have different, independent powers which let them act as checks and balances on each other. If the Supreme court makes a ruling, the executive branch must abide by it. ",
            "date": "Answered June 27, 2020",
            "views": "234",
            "upvotes": " View 1 Upvoter"
        },
        {
            "author_info": {
                "name": "Ralph Salier",
                "href": "/profile/Ralph-Salier"
            },
            "answer_text": "No. The law is the law and SCOTUS determines if the laws are Constitutional. If they are, they stand, if not they are vacated. Congress makes the laws. The President MUST abide by the law or being in violation (as DT is) he can (and should be) removed from office for his crimes. ",
            "date": "Answered July 17, 2019",
            "views": "61",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Bruce Byers",
                "href": "/profile/Bruce-Byers-2"
            },
            "answer_text": "No. ",
            "date": "Answered October 8, 2018",
            "views": "60",
            "upvotes": " View 1 Upvoter"
        },
        {
            "author_info": {
                "name": "James Geiser",
                "href": "/profile/James-Geiser-2"
            },
            "answer_text": "Uh, no. Only the Member’s of the Supreme Court can overturn an earlier decision ",
            "date": "Answered June 27, 2020",
            "views": "38",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Ron Combs",
                "href": "/profile/Ron-Combs-2"
            },
            "answer_text": "No. He can request legislation that will conform to the decision, but he can’t override it. ",
            "date": "Answered October 1, 2020",
            "views": "11",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Robert Gougou",
                "href": "/profile/Robert-Gougou"
            },
            "answer_text": "No, I used to answer this same question recently, are Supreme Court decisions, or any court, are jurisprudence and judgments only. ",
            "date": "Answered July 30, 2019",
            "views": "20",
            "upvotes": " Answer requested by Charles Raisor"
        },
        {
            "author_info": {
                "name": "Jose Starks",
                "href": "/profile/Jose-Starks"
            },
            "answer_text": "No but the Supreme Court can rule a Presidents order unconstitutional. ",
            "date": "Answered June 16, 2020",
            "views": "40",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Andalib Odulate",
                "href": "/profile/Andalib-Odulate"
            },
            "answer_text": "No but they define law. ",
            "date": "Answered July 16, 2019",
            "views": "164",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Gary Goodell",
                "href": "/profile/Gary-Goodell-1"
            },
            "answer_text": "Absolutely not. ",
            "date": "Answered October 7, 2019",
            "views": "54",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Jack Beach",
                "href": "/profile/Jack-Beach-6"
            },
            "answer_text": "No. ",
            "date": "Answered June 27, 2020",
            "views": "21",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Michael Depietro",
                "href": "/profile/Michael-Depietro"
            },
            "answer_text": "No ",
            "date": "Answered June 21, 2018",
            "views": "74",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "R. Kevin Hill",
                "href": "/profile/R-Kevin-Hill"
            },
            "answer_text": "No. ",
            "date": "Answered April 3, 2020",
            "views": "78",
            "upvotes": "0"
        }
    ]
}