{
    "title": "Can the current era be called a 'Digital Era'? Why or why not? - Quora",
    "tags": [
        "Historical Eras",
        "Technology Trends",
        "Technology"
    ],
    "response": [
        {
            "author_info": {
                "name": "Chinmay Kabi",
                "href": "/profile/Chinmay-Kabi-1"
            },
            "answer_text": "Thank you Gopalkrishna Vishwanath sir for the A2A! Today we won’t be surprised to hear something like this The world’s most valuable resource is no longer oil, but data There’s also this conspiracy theory doing rounds  Jio is the new Oil for Reliance, and the logo is just a mirror image of Oil. This can give a sense of validation to the statement that the current era can be called the Digital Era. But we need some more differentiators. In the past, we didn’t call it the era of the material or the metal age, because we knew that the era of metals was going to stretch very long for it to have any meaning on its own. Instead, we divided it into the stone age, copper age, bronze age, and iron age. We need a similar differentiation for the Digital era in question here. As rightly mentioned by another person here, we can roughly attribute the beginning of the digital era from the 70’s. It was all about bringing computers to the masses and into the homes.Come the 90’s, and it was the age of the Internet, where the only thing limiting its usage was human imagination. Would you have ever felt secure sending huge amounts of money by postal mail? No. But we do the same using the apps today in a jiffy. That’s the level of trust the people have on the internet.The first decade of the 21st century was the age of portability, not only because of the widespread adoption of mobile phones but also because of the development of smaller storage media, better cameras in smaller form factors, slimmer laptops, mobile processors, etc.The second decade of the century has been all about Machine Learning, Artificial Intelligence and the Cloud. The reason Amazon, Google, and Microsoft are tech behemoths is because of their timely investment in Cloud computing. This decade also saw the advent of Smartphones, but they’d still be dumb had ML and Cloud not existed. Heck, today we have services like Wolfram Alpha, which can run complex calculations for you on the cloud, which would have otherwise required you to own supercomputers. We have Google Stadia and Microsoft XCloud, which can emulate the wholesome performance of a gaming console in the cloud so that you don’t need to have a physical console.In the latter half of the 2nd decade, tech like AI, Blockchain, Virtual and Augmented Reality .and Internet of Things have shown great promise. As we step into the 3rd decade of this century, it can be anyone’s guess as to which tech will rule the roost. We should also remember one thing though, NOTHING LASTS FOREVER. Industrial Era never ended, its just that it has blended in our lives so innately that we can’t identify it as a separate identity, and the same will happen with Digital Era as well. Maybe it’ll give rise to another era, Interplanetary era anyone? KB ",
            "date": "Answered December 18, 2019",
            "views": "13",
            "upvotes": " View 10 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Chandan Bengapattana",
                    "user_href": "/profile/Chandan-Bengapattana"
                },
                {
                    "user_id": "Arpita Mohapatra",
                    "user_href": "/profile/Arpita-Mohapatra-35"
                },
                {
                    "user_id": "Anisha Mohapatra",
                    "user_href": "/profile/Anisha-Mohapatra-4"
                },
                {
                    "user_id": "Sanan Mohammed",
                    "user_href": "/profile/Sanan-Mohammed-1"
                },
                {
                    "user_id": "Sumanth Gururaj",
                    "user_href": "/profile/Sumanth-Gururaj-1"
                },
                {
                    "user_id": "Sonali Sahoo",
                    "user_href": "/profile/Sonali-Sahoo-16"
                },
                {
                    "user_id": "Finley Warman",
                    "user_href": "/profile/Finley-Warman"
                },
                {
                    "user_id": "Shubham Patra",
                    "user_href": "/profile/Shubham-Patra-3"
                },
                {
                    "user_id": "Manisha Jena",
                    "user_href": "/profile/Manisha-Jena-2"
                },
                {
                    "user_id": "Gopalkrishna Vishwanath",
                    "user_href": "/profile/Gopalkrishna-Vishwanath"
                }
            ]
        },
        {
            "author_info": {
                "name": "Agnij Mallick",
                "href": "/profile/অগ্নিজ-মল্লিক-Agnij-Mallick"
            },
            "answer_text": "I believe the best way to describe our current era would be Pre-Digital Era. We are in the process of adopting technology. We are yet to reach the point in history where everyone is connected to the internet at all times. Some people have yet not been assimilated into computers and smartphones, or they are still trying to figure out the most efficient way to use them. I had to visit a certain government office in June of 2019. I happen to be waiting for something, when I notice that two gentlemen are working on preparing a report. While one is reading out the data from a handwritten sheet, the other is entering the processed data into an Excel sheet. However, the data processing is being done on a commercial calculator, instead of using the inbuilt features of Excel. The person reading out the data also has a calculator to endure that the correct data is being entered. They have adopted technology, but only partially. We might need more time to reach that Digital Era, but we are on our way there. ",
            "date": "Answered August 31, 2019",
            "views": "31",
            "upvotes": " Answer requested by Gopalkrishna Vishwanath",
            "upvoters": [
                {
                    "user_id": "Dinesh Dave",
                    "user_href": "/profile/Dinesh-Dave-1"
                },
                {
                    "user_id": "Laughter Master",
                    "user_href": "/profile/Laughter-Master"
                },
                {
                    "user_id": "Gopalkrishna Vishwanath",
                    "user_href": "/profile/Gopalkrishna-Vishwanath"
                }
            ]
        },
        {
            "author_info": {
                "name": "Viv",
                "href": "/profile/Viv-Dave"
            },
            "answer_text": "Thank You Sir for requesting a answer. It can honestly be called as digital era. Reason's:- 1- People are bonded to technology. People used to stay in long queues some years back but now it's digitally possible to pay online. 2- People use internet on smartphone. People didn't had internet 20 years back, but when it came it was costly. Era of 4G arrived with Jio, almost every household in mumbai owns a Jio sim. 3- Advancement in technology. In olden times only DD was there. After Globalisation more tv channel companies entered India. Then set top box arrived. After that recently there is a trend of Amazon Firefox and many smart tv. 4- People make use of Technology in day to day life. Earlier phones were costly but then things change and it became possible for everyone to have a smartphone in their pocket. 5- The most important is AI( Artificial Intelligence). Phones such as iPhone and softwares such as Google have a personal assistant. It becomes quite easier to search on smartphones without typing a word. ",
            "date": "Answered December 18, 2019",
            "views": "197",
            "upvotes": " View 3 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Vikke Jokinen",
                    "user_href": "/profile/Vikke-Jokinen"
                },
                {
                    "user_id": "James Martin",
                    "user_href": "/profile/James-Martin-1245"
                },
                {
                    "user_id": "Nemanja Popovic",
                    "user_href": "/profile/Nemanja-Popovic-25"
                }
            ]
        },
        {
            "author_info": {
                "name": "Milan Rancic",
                "href": "/profile/Milan-Rancic-2"
            },
            "answer_text": "In some aspects of society yes, in some no. Most of the means of information or communication are in digital format, because of that we can say that digital era started several decades ago. On the other hand, humans are biological and also social beings so daily behavior and social interactions are still analogue and will remain like that until something changes in that area. ",
            "date": "Answered June 30, 2019",
            "views": "47",
            "upvotes": " View 3 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Gopalkrishna Vishwanath",
                    "user_href": "/profile/Gopalkrishna-Vishwanath"
                }
            ]
        },
        {
            "author_info": {
                "name": "Mark Weber",
                "href": "/profile/Mark-Weber-133"
            },
            "answer_text": "This is the Digital Era 1.0. Stay tuned for the Digital Era 2.0 which will come along soon enough with quantum computing and a mature artificial intelligence. When the history of that era is written it may not be called that. The machines may come up with another name entirely. ",
            "date": "Answered September 1, 2019",
            "views": "22",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Gopalkrishna Vishwanath",
                    "user_href": "/profile/Gopalkrishna-Vishwanath"
                }
            ]
        },
        {
            "author_info": {
                "name": "Aslam Mohammed",
                "href": "/profile/Aslam-Mohammed-45"
            },
            "answer_text": "Around 11.40 lakh transactions were settled in the first eight hours after widely-used National Electronic Funds Transfer (NEFT) was made operational on a 24X7 basis, the RBI said. The RBI operational NEFT System 24X7 from 12:00 am on Monday. Moreover the govt plans taking internet every nook and corner of India within 2020,it’s all only possible because of Digital Era..Good luck… ",
            "date": "Updated December 19, 2019",
            "views": "169",
            "upvotes": " View 1 Upvoter "
        }
    ]
}