{
    "title": "Can you track a phone without WiFi connection? - Quora",
    "tags": [
        "Wireless Technology",
        "Wi-Fi"
    ],
    "response": [
        {
            "author_info": {
                "name": "Dave Moore",
                "href": "/profile/Dave-Moore-29"
            },
            "answer_text": "Other than tracking via the cellular signal from the phone, you can also track via WiFi even when there is nothing connected to it. If you have WiFi enabled on your smart phone and you have previously defined, or “remembered” a WiFi network, your smart phone will continue to send packets out looking for an AP with the SSID, or SSIDs, that you have told it to connect to automatically. These packets, called probes, can be used to track the phone. Enterprise-grade APs will build a database of all client devices that they hear, whether they connect to the AP or not. Some of them can be configured to provide this information to a service along with information on the strength at which this signal is heard and the time when it was heard. If multiple APs report the MAC address of a device that is sending probes at different signal strengths, the service can then attempt to triangulate and make a best guess at where the device is from moment to moment. I have yet to see a system be precise. There are too many factors that will cause the signal strength to fluctuate to be able to guarantee better than about 3m accuracy. Still, you can get a good idea of the number of different devices, the time they spend in a particular area, how often they go to a general area, etc. It is pretty nice information for marketeers and retailers. For example, think of a large store who wants to know what routes people most often take through the store and where they tend to slow down or stop the longest. This will allow them to position impulsively purchased items along that route more efficiently. iOS introduced a method of randomly changing the MAC address of the WiFi NIC during these probes in order to provide more privacy to you. This also plays havoc with systems that are trying to determine how many devices are out there as they will look like 70 or 80 devices over time rather than one. I am not aware of anyone who has ever tried to correspond those MAC addresses with actual people, however. In fact, in many countries doing so is not legal. What they tend to do is to use the MAC address to identify a device as a unique instance, but will not report the MAC address information, deleting it once the data is correlated with position. Apple has, in my opinion, solved a problem that just does not exist and has, in doing so, created another problem without a good solution. You can also track a smart phone that has Bluetooth enabled in a very similar fashion. Accuracy using Bluetooth is much greater. However, the range is much less, so many more sensors are required to do this. I am not aware of any commercial grade systems that are doing this to track smart phones today. ",
            "date": "Answered October 20, 2017",
            "views": "164",
            "upvotes": " View 7 Upvoters",
            "upvoters": [
                {
                    "user_id": "Mohammed Abdulrhman",
                    "user_href": "/profile/Mohammed-Abdulrhman-5"
                },
                {
                    "user_id": "Kameshwar Jha",
                    "user_href": "/profile/Kameshwar-Jha-3"
                },
                {
                    "user_id": "Suzy Tony Delarosa",
                    "user_href": "/profile/Suzy-Tony-Delarosa"
                },
                {
                    "user_id": "Umesh Chandra Reddy",
                    "user_href": "/profile/Umesh-Chandra-Reddy-3"
                },
                {
                    "user_id": "Comet",
                    "user_href": "/profile/Comet-7"
                },
                {
                    "user_id": "Mark Allen",
                    "user_href": "/profile/Mark-Allen-15"
                },
                {
                    "user_id": "Mohammad Abdur Rahim",
                    "user_href": "/profile/Mohammad-Abdur-Rahim"
                }
            ]
        },
        {
            "author_info": {
                "name": "David Fred",
                "href": "/profile/David-Fred-3"
            },
            "answer_text": "You can’t, but the network provider can, and with a warrant, so can law enforcement. You can’t track a phone even with a WiFi connection, unless it has an app installed, and the phone owner enables location information on the app. Most phones have one available. Apple has “Find my iPhone”, I think Android has several, “Find my Tablet” I think, and others. You can look on the applicable App Store to see if there is an app your phone supports. The location isn’t as precise as that the network provider can give law enforcement, but if you want to track your kids, and you own the phone, and the account is in your name, it’s precise enough to tell you they are downtown not spending the night with her friend Susie from school. And with that app installed, you can do it with or without a WiFi connection, from another phone, or a PC, depending on the app, whether the phone is locked to WiFi or the cell network. The location is more precise if the target phone is locked to WiFi. ",
            "date": "Answered March 2, 2018",
            "views": "162",
            "upvotes": " View 10 Upvoters",
            "upvoters": [
                {
                    "user_id": "LeonF Rodriguez",
                    "user_href": "/profile/LeonF-Rodriguez"
                },
                {
                    "user_id": "Georgene Wickstrand",
                    "user_href": "/profile/Georgene-Wickstrand-1"
                },
                {
                    "user_id": "Leo Worshipper",
                    "user_href": "/profile/Leo-Worshipper"
                },
                {
                    "user_id": "Shruti Sharma",
                    "user_href": "/profile/Shruti-Sharma-42"
                },
                {
                    "user_id": "Hamza H",
                    "user_href": "/profile/Hamza-H-30"
                },
                {
                    "user_id": "Avs Bacha",
                    "user_href": "/profile/Avs-Bacha"
                },
                {
                    "user_id": "Nathaniel Smith",
                    "user_href": "/profile/Nathaniel-Smith-51"
                },
                {
                    "user_id": "Nicole Ballard",
                    "user_href": "/profile/Nicole-Ballard"
                },
                {
                    "user_id": "Davis Ahmad",
                    "user_href": "/profile/Davis-Ahmad"
                },
                {
                    "user_id": "Debbie Scott",
                    "user_href": "/profile/Debbie-Scott-210"
                }
            ]
        },
        {
            "author_info": {
                "name": "OKportal Technology",
                "href": "/profile/OKportal-Technology"
            },
            "answer_text": " Credit image: Technobezz This depends on what access you have. If you are trying to track another device from yours using a Wi-Fi connection, the chances are very slim, even almost to none. However, the network providers can, from the use of the cell towers and quite possibly, Google location. Ordinarily, other factors may affect your ability to trace a phone, for example, if the device is turned off, or the “location” is turned on, or if it’s off and this requires internet connection. The network providers, however, do not need an internet connection to place a trace with the internet, as they have this GPS on their own, called Assisted GPS, or A-GPS. The other options are installed applications that can grant location access which may or may not be activated on the device, so your chances with this are 50/50.  Hope you like the answer, OKportal Technology ",
            "date": "Answered May 26, 2019",
            "views": "27",
            "upvotes": " View 34 Upvoters",
            "upvoters": [
                {
                    "user_id": "W. Brink",
                    "user_href": "/profile/W-Brink"
                },
                {
                    "user_id": "Malik Dawood Usama",
                    "user_href": "/profile/Malik-Dawood-Usama"
                },
                {
                    "user_id": "Atif Shahzad",
                    "user_href": "/profile/Atif-Shahzad-66"
                },
                {
                    "user_id": "Imran Haneef",
                    "user_href": "/profile/Imran-Haneef-5"
                },
                {
                    "user_id": "Imran Malik",
                    "user_href": "/profile/Imran-Malik-505"
                },
                {
                    "user_id": "Epiphany Professional",
                    "user_href": "/profile/Epiphany-Professional"
                },
                {
                    "user_id": "Sumaira Nazim",
                    "user_href": "/profile/Sumaira-Nazim"
                },
                {
                    "user_id": "Aliya Saleem",
                    "user_href": "/profile/Aliya-Saleem-6"
                },
                {
                    "user_id": "Asif Zaheer",
                    "user_href": "/profile/Asif-Zaheer-9"
                },
                {
                    "user_id": "Arsal Jamshed",
                    "user_href": "/profile/Arsal-Jamshed"
                },
                {
                    "user_id": "Tom Lewis",
                    "user_href": "/profile/Tom-Lewis-271"
                },
                {
                    "user_id": "Evans Egyir",
                    "user_href": "/profile/Evans-Egyir"
                },
                {
                    "user_id": "Ast",
                    "user_href": "/profile/Ast-27"
                },
                {
                    "user_id": "Marsyella Tanudjaja",
                    "user_href": "/profile/Marsyella-Tanudjaja"
                },
                {
                    "user_id": "Melissa Stephanie",
                    "user_href": "/profile/Melissa-Stephanie-1-1"
                },
                {
                    "user_id": "Jalil Sir",
                    "user_href": "/profile/Jalil-Sir"
                },
                {
                    "user_id": "Projects Pakistan",
                    "user_href": "/profile/Projects-Pakistan"
                },
                {
                    "user_id": "Usman Saadat",
                    "user_href": "/profile/Usman-Saadat-1"
                },
                {
                    "user_id": "Sarfraz Rashid",
                    "user_href": "/profile/Sarfraz-Rashid-3"
                },
                {
                    "user_id": "Salman Riaz",
                    "user_href": "/profile/Salman-Riaz-30"
                },
                {
                    "user_id": "Maisie Nathania",
                    "user_href": "/profile/Maisie-Nathania-1"
                },
                {
                    "user_id": "Hassaan Riaz",
                    "user_href": "/profile/Hassaan-Riaz-3"
                },
                {
                    "user_id": "Ahmad Malik",
                    "user_href": "/profile/Ahmad-Malik-190"
                },
                {
                    "user_id": "Khush Bakht",
                    "user_href": "/profile/Khush-Bakht-46"
                },
                {
                    "user_id": "Fakhran Thoriq",
                    "user_href": "/profile/Fakhran-Thoriq-1"
                },
                {
                    "user_id": "Shikarun Shovon",
                    "user_href": "/profile/Shikarun-Shovon"
                },
                {
                    "user_id": "Suraiya Khanom",
                    "user_href": "/profile/Suraiya-Khanom-1"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/Shoikot-khan-Soikot-Khan12"
                },
                {
                    "user_id": "Sufi Nouman",
                    "user_href": "/profile/Sufi-Nouman"
                },
                {
                    "user_id": "Malik Riaz ud Din",
                    "user_href": "/profile/Malik-Riaz-ud-Din"
                },
                {
                    "user_id": "Ovinia Rustandy",
                    "user_href": "/profile/Ovinia-Rustandy"
                },
                {
                    "user_id": "Sharlen",
                    "user_href": "/profile/Sharlen"
                },
                {
                    "user_id": "Yosua Kevin",
                    "user_href": "/profile/Yosua-Kevin-1-1"
                },
                {
                    "user_id": "Steve Zhu",
                    "user_href": "/profile/Steve-Zhu-38"
                }
            ]
        },
        {
            "author_info": {
                "name": "Tyllis Xu",
                "href": "/profile/Tyllis-Xu"
            },
            "answer_text": "Yes, it is possible. Senario 1. You happen to be the network provider or happen to have the ability to triangulate onto the phones signals. Senario 2. You have something on your phone that lets you track it through other signals. Eg. chip wired inside the phone. Senario 3. You have apps that sent out your GPS cords through means other than wifi on your phone. Senario 4. GPS module has been compromised. To avoid tracking, 1. take it apart. look for loose stuff. Find someone experienced 2. Take out the batteries. Don't put em back in 3. Ditch the phone into the nearest dumpster. No 2. is most recommended cost-wise. No 3. is most secure. Hope I helped. ",
            "date": "Answered September 12, 2018",
            "views": "35",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Mark Grant",
                "href": "/profile/Mark-Grant-68"
            },
            "answer_text": "Dear all who have answered this and my similar question, really helpful. I am writing this just to reiterate that my reasons for asking are entirely legitimate, legal and to provide a helpful solution to a problem. However in researching this subject I have realised how my location has been discreetly monitored for years by businesses with whom I have had a fleeting (retail) relationship with but could potentially know more about me than I am comfortable with. Very concerning and know I know why they make their terms of use so protracted and difficult to read and understand. ",
            "date": "Answered May 14, 2019",
            "views": "19",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Jay Chappie",
                "href": "/profile/Jay-Chappie"
            },
            "answer_text": "Can my phone be tracked without my WiFi on? Yes. It’s a phone, not a tablet. Cellular (GSM or CDMA) is it’s primary communication means. Your data doesn’t need to be on, your WiFi doesn’t need to be on. In fact, even in airplane mode there is the potential to be tracked. The only sure way is powering off AND removing the battery. ",
            "date": "Answered March 23, 2018",
            "views": "38",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "David Hill",
                    "user_href": "/profile/David-Hill-1062"
                },
                {
                    "user_id": "Raghu Nandana",
                    "user_href": "/profile/Raghu-Nandana-12"
                }
            ]
        },
        {
            "author_info": {
                "name": "Pan Junfeng",
                "href": "/profile/Pan-Junfeng"
            },
            "answer_text": "In GSM/3G networks, the mobile will report its location at an Operator defined interval. In GSM network, this is called LAC. When someone calls this mobile phone, the network will page the called phone within this LAC. ",
            "date": "Answered October 19, 2017",
            "views": "11",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Mark Ringbell",
                "href": "/profile/Mark-Ringbell"
            },
            "answer_text": "Yes it is possible to do that . ",
            "date": "Answered February 22, 2018",
            "views": "466",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Khin Lin Kyi",
                "href": "/profile/Khin-Lin-Kyi"
            },
            "answer_text": "No ",
            "date": "Answered September 14, 2018",
            "views": "151",
            "upvotes": "0"
        }
    ]
}