{
    "title": "Can global warming (aka climate change) transform Earth into Venus? - Quora",
    "tags": [
        "Venus (planet)",
        "Environmental Science",
        "Climatology",
        "Climate Change",
        "The Environment"
    ],
    "response": [
        {
            "author_info": {
                "name": "Jeff Barry",
                "href": "/profile/Jeff-Barry-11"
            },
            "answer_text": "RE: Can global warming (aka climate change) transform Earth into Venus? Can global warming (aka climate change) transform Earth into Venus? Like Venus? No. Let’s stick with a worst case like one which has already happened on earth. About 250 million years ago there was a flood basalt eruption in what is now Siberia. See Siberian Traps - Wikipedia. Not only did CO2 come up with that magma, but a part of that magma came up through a huge coal bed and so altogether dumping a zillion tons of CO2 into the atmosphere. That caused massive Global Warming, including warming of the oceans. Once the oceans got warm enough the methyl hydrate on the ocean bottoms broke down releasing massive amounts of methane into the oceans, almost killing the oceans, and methane went into the air too. Methane is an even worse greenhouse gas than CO2, so the temperature rose even more. See: Clathrate gun hypothesis - Wikipedia (A weird name, I know.) This was Global Warming on steroids. It killed off almost all of the species in the oceans and a vast majority of land species. This whole episode in Earth’s history is known as the Permian Extinction. It is also known as “The Great Dying”. So, if you want to know how bad Global Warming could get (because it already has at least once before on this planet) then read this and watch the video: Permian–Triassic extinction event - Wikipedia Catastrophe - Episode 3 - Planet of Fire ",
            "date": "Answered March 20, 2017",
            "views": "423",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Francesco Lettich",
                    "user_href": "/profile/Francesco-Lettich"
                },
                {
                    "user_id": "Daniel James Berger",
                    "user_href": "/profile/Daniel-James-Berger"
                }
            ]
        },
        {
            "author_info": {
                "name": "Steve Maley",
                "href": "/profile/Steve-Maley-1"
            },
            "answer_text": "Short answer: No way. The worst case scenario is Global Cooling and a new ice age. In the context of earth’s history, global temperatures have been remarkably stable for the last 10,000 years, coinciding with the period of human civilization. In fact, temps were actually slightly higher than today up until 4,000 years ago. There has been a gradual cooling trend since that time. Maybe the Industrial Revolution & anthropogenic global warming postponed the next ice age? In any event the proportion of non-CO2 gases in the atmosphere has decreased from 99.97% to 99.96% over a century or so. Not the perspective you emphasize if you're trying to worry people. ",
            "date": "Answered March 20, 2017",
            "views": "73",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Vaughan Pratt",
                "href": "/profile/Vaughan-Pratt-1"
            },
            "answer_text": "SSince CO2 was at several thousand ppm a few million year ago and is way less now, I don’t see why we can’t go back up to those levels and fry a few chillibabies in the process and then get back down again to 180 ppm of CO2 with massive glaciers over Texas, do you? For planets envious of Venus’s copious warmth, it should be pointed out that Venus is closer to the Sun than all but one other planet. Mercury, that is. Unlike Venus’s atmosphere, whose mass is almost 100 times that of Earth’s, Mercury’s atmosphere has been blasted into outer space by its proximity to the Sun. So I wouldn’t worry too much about Earth’s surface temperature ever reaching that of Venus. We have the carbon, we just don’t have Venus’s proximity to the Sun. We (or our grandkids) have a lot else to worry about on our/their plate by 2100. ",
            "date": "Answered March 20, 2017",
            "views": "106",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Daniel James Berger",
                "href": "/profile/Daniel-James-Berger"
            },
            "answer_text": "No. See Jeff Barry's answer to Can global warming (aka climate change) transform Earth into Venus? for the worst-case scenario. There isn’t enough carbon on the Earth to get the temperature so high that we would become like Venus; at least that’s my understanding of things. The Sun has been getting gradually warmer (very gradually) since it formed, which is why the early Earth could get away with much higher CO2 levels than today. But the Sun would have to get a lot warmer for the oceans to evaporate, which is the precursor to a Venus-like runaway greenhouse. That’s not projected to happen for another billion years or so, even if all the stored carbon on Earth were in the atmosphere. ",
            "date": "Answered March 20, 2017",
            "views": "256",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Virinchi Acharlu Madanapalli",
                    "user_href": "/profile/Virinchi-Acharlu-Madanapalli"
                }
            ]
        },
        {
            "author_info": {
                "name": "David Johnson",
                "href": "/profile/David-Johnson-57"
            },
            "answer_text": "Possibly. It is hopefully a small possibility, but we know very little about the potential feedback loops that could release additional greenhouse gasses if it gets hotter, which then cause it to get even hotter, which then causes the release of more greenhouse gasses, which then… Hopefully such things are self-limiting at Earth's distance from the Sun - but shit happens. ",
            "date": "Answered January 10, 2020",
            "views": "18",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Art Mayo",
                "href": "/profile/Art-Mayo"
            },
            "answer_text": "First off it should be climate change (aka global warming) because if you ask any climatologist they will tell you that some spots on the earth will actually get colder. Secondly no, earth will never be anything like venus. And third the worst case scenario would be the end of life on earth. In a decade you will see several species extinct because of climate change. ",
            "date": "Answered March 19, 2017",
            "views": "66",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Vernon Max Nissley",
                "href": "/profile/Vernon-Max-Nissley"
            },
            "answer_text": "I see more of the potential that we will permanently lose our atmosphere, like mars. What is happening now is that we are becoming a hot planet with a lower veil of trapped gases. The problem is that we are losing the protective layers in the upper atmosphere and this makes for the chance that all the air will escape into space. ",
            "date": "Answered March 20, 2017",
            "views": "34",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Timothy Ellis",
                "href": "/profile/Timothy-Ellis-4"
            },
            "answer_text": "Everyone should watch the episode about this on the new Cosmos series. IMO, this should be required watching before any person makes any comment on this subject. The key word here is Permafrost. ",
            "date": "Answered March 20, 2017",
            "views": "31",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Chandramohan Panakkal",
                "href": "/profile/Chandramohan-Panakkal"
            },
            "answer_text": "Case of Venus is extreme..due to global warming the huge amount of ice in the polar caps will melt and raise the sea level..Many low lying areas will be sub,merged.. ",
            "date": "Answered March 19, 2017",
            "views": "42",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Mel Gilbert",
                "href": "/profile/Mel-Gilbert"
            },
            "answer_text": "Yes. ",
            "date": "Answered March 19, 2017",
            "views": "3",
            "upvotes": "0"
        }
    ]
}