{
    "title": "Can you give me a good thesis topic for information technology? - Quora",
    "tags": [],
    "response": [
        {
            "author_info": {
                "name": "Wendy Hardman",
                "href": "/profile/Wendy-Hardman"
            },
            "answer_text": "Hi Rochelle, I would suggest that if information technology is your field, rather than ask for a good thesis topic, look at the courses you’ve taken, the professors you’re worked with, the articles/current news and published research and ask yourself: where is there a hole, a gap, something that interests me? Where does something not make sense to me in this field? Maybe even look at past papers you’ve written - what questions did you raise or answer? Where is your interest peaked? Given the time and work involved in completing the research and a thesis, you want to be working on something that intrigues you, interests you a lot, causes you to ask why? What area can you talk about for hours, ask questions, and never get enough of. Choosing YOUR topic/area needs to be your first priority in my opinion and experience. It can start as early as your first course or be sparked by something you encounter in some of your course readings, assignments, conversations. I strongly recommend that YOU search out a topic or issue that matters to YOU. You might also look around your institution or do some research on areas of focus of the faculty who have taught you and other faculty as you will likely need an advisor/supervisor and you will get more useful help from someone who has some interest or background in some aspect of your research/thesis interest. Best wishes for an exciting thesis journey! ",
            "date": "Answered May 26, 2016",
            "views": "61",
            "upvotes": " View 6 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Meysa Putri",
                    "user_href": "/profile/Meysa-Putri"
                },
                {
                    "user_id": "Alvian Z Faturrahman",
                    "user_href": "/profile/Alvian-Z-Faturrahman"
                },
                {
                    "user_id": "Myla Gonzales",
                    "user_href": "/profile/Myla-Gonzales"
                },
                {
                    "user_id": "Esther Dada Abiodun",
                    "user_href": "/profile/Esther-Dada-Abiodun"
                },
                {
                    "user_id": "Rochelle Boado",
                    "user_href": "/profile/Rochelle-Boado-1"
                },
                {
                    "user_id": "Leo Lam",
                    "user_href": "/profile/Leo-Lam-5"
                }
            ]
        },
        {
            "author_info": {
                "name": "Amnesh Goel",
                "href": "/profile/Amnesh-Goel"
            },
            "answer_text": "Read here What is a good topic for thesis in computer science and engg. for MTech? I think you are having the similar question which I just answered. In short you can go for following topics. Image Encryption IoTCloud ComputingJavaScript Based Frameworks ",
            "date": "Answered April 2, 2016",
            "views": "27",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Perpetua Achi",
                    "user_href": "/profile/Perpetua-Achi"
                },
                {
                    "user_id": "Ahmed Al-Antari",
                    "user_href": "/profile/Ahmed-Al-Antari"
                }
            ]
        }
    ]
}