{
    "title": "Can external lights affect LIDAR performance? - Quora",
    "tags": [],
    "response": [
        {
            "author_info": {
                "name": "Jeff Brower",
                "href": "/profile/Jeff-Brower-7"
            },
            "answer_text": "Of course, as long as the external light is the same wavelength and of sufficient energy. Either saturation or spoofing is possible: Saturating and Spoofing LiDAR Attacks Cast Doubt on the Safety of Driverless Cars Saturation is conceptually similar to blinding night vision with very bright light. Spoofing to make the car AI think an obstacle is not really there, or a bogus obstacle is there, would require sophistication. Maybe a hacked Velodyne unit, if you could exactly align their spins, although I’m sure Velodyne has thought of that and has some type of random jitter in place to ensure it doesn’t happen between adjacent AVs. ",
            "date": "Answered August 30, 2018",
            "views": "154",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Luis Alvarado",
                    "user_href": "/profile/Luis-Alvarado-41"
                },
                {
                    "user_id": "Zhengyang Gong",
                    "user_href": "/profile/Zhengyang-Gong"
                }
            ]
        },
        {
            "author_info": {
                "name": "Zach Abass",
                "href": "/profile/Zach-Abass"
            },
            "answer_text": "It would have to be the same frequency (in the IR band) and pulse rate as the laser, or at least the same frequency and sufficiently strong enough to “blind” or “swamp” the LIDAR’s on return. An effective countermeasure (K40, Escort, etc etc) does just that!Doing it incidentally with something not purpose built for that is unlikely. ",
            "date": "Answered September 10, 2018",
            "views": "88",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Luis Alvarado",
                    "user_href": "/profile/Luis-Alvarado-41"
                }
            ]
        }
    ]
}