{
    "title": "Can wearing masks stop the spread of the coronavirus? - Quora",
    "tags": [
        "Spread of Coronaviruses",
        "Coronavirus Masks",
        "COVID-19 Protection",
        "Masks",
        "Infectious Diseases",
        "Medical Conditions and Diseases"
    ],
    "response": [
        {
            "author_info": {
                "name": "Thomas Talhelm",
                "href": "/profile/Thomas-Talhelm"
            },
            "answer_text": "With the outbreak of the coronavirus in China, masks are nowhere to be found in stores. Instead, they’re on almost everyone’s faces (like on the subway here in Beijing).  There’s solid scientific data demonstrating that masks do an incredible job at blocking particulate pollution, but what about the coronavirus particles? Viruses are tiny! Can masks get those?  Two other answers here say “no” (or mostly no), because they’re too small.  But where’s the data? Fortunately, scientists have already accumulated hard data on masks that can answer these questions. How Big Are Coronavirus Particles? Within a few weeks of the outbreak, scientists used electron microscopes to measure how big the corona virus is. They found that coronavirus particles (or “virions”) are spherical particles with diameters of approximately 0.125 microns. The smallest particles are 0.06 microns, and the largest are 0.14 microns.  This means coronavirus particles are smaller than the oft-mentioned PM2.5 standard, but bigger than some dust particles and gases.  Now that we know how big coronavirus particles are, we can compare that to data on filtration effectiveness of masks. Let’s break this down into two simpler questions. 1. Can air pollution masks capture coronavirus particles? Researchers from the University of Edinburgh tested different common masks by running a diesel generator (to mimic car exhaust) and piping the exhaust through different masks. They used a particle counter to see how many particles made it through the mask. Here’s my super scientific rendering of the setup:  One important detail: the particle counter they used measured particles as small as 0.007 microns. That’s over 10 times smaller than the coronavirus particle diameter. We’re talking about truly tiny particles here! They tested a whole range of masks and materials. Here’s the percentage of particles the different materials blocked:  3M N95 masks captured over 95% of particles down to 0.007 microns. That’s over 10 times smaller than the coronavirus. What might be surprising to some is that the surgical mask was able to capture 80% of the tiny particles. (I summarize more data that surgical masks are surprisingly effective here.)  But hang on. This was diesel exhaust, not virus particles. Is there something weird about viruses that makes them hard to capture? Scientists have tested that too! A different group of researchers shot virus particles at N95 masks and tested what percentage of particles the masks could capture.  N95 masks are rated to capture 95% of particles. In other words, they should let in 5% of particles. But the test found that the masks actually let in less than 5% of virus particles.  In another study, when scientists looked only at viable virus particles, they found that N95 masks performed even better, letting through 2% of virus particles. Conclusion: Masks – including surgical masks and N95 masks – can capture virus particles and even particles that are over 10 times smaller than the coronavirus. 2. OK, masks can capture particles even smaller than the coronavirus, but when you wear them, all the air just leaks in the side. To answer this question, you need a really expensive fit-test machine. Fortunately, I was able to get my hands on one, so I used it to test a range of masks.  The blue tube is sampling air outside the mask, while the white tube is sampling air from inside it (more details on mask fit-test methods ). Smart Air co-founder Anna Guo and Beijing-based Dr. Richard Saint Cyr also did some tests, so I combined all of our data. Here’s how well the masks worked on our faces:  (Check out the full test data.) Several 3M masks were able to capture over 99% of tiny 0.01 micron particles (10 times smaller than the coronavirus), even while on people’s face. What’s more, surgical masks were surprisingly effective, capturing 63% of the tiny virus-sized particles. Bottom line: Masks can capture even the smallest particles – those 10 times smaller than viruses. What’s more, they work surprisingly well even while people are wearing them. Breathe safe!  P.S. Is there any evidence mask usage actually prevents infection? Of course, saying “masks capture viruses” is NOT the same as “wearing a mask will reduce exposure to zero.” There are two potential problems: The filtration rate is not 100%, so some virus particles can still make it through.Masks need to be worn properly to reach full effectiveness.Fortunately, scientists have tested this question too! In one study, scientists randomly assigned people to wear surgical masks, N95 masks, or no mask while taking care of children that were sick with the flu. They found that people wearing masks had about 75% lower probability of getting sick.  But masks only worked for people who frequently wore their mask—not a shock there! ",
            "date": "Updated February 25, 2020",
            "views": "1126",
            "upvotes": " View 1.1K Upvoters ",
            "upvoters": [
                {
                    "user_id": "Kostas Kantounis",
                    "user_href": "/profile/Kostas-Kantounis"
                },
                {
                    "user_id": "Greg Jacka",
                    "user_href": "/profile/Greg-Jacka"
                },
                {
                    "user_id": "Aditya Chopra",
                    "user_href": "/profile/Aditya-Chopra-174"
                },
                {
                    "user_id": "Sashidharan S",
                    "user_href": "/profile/Sashidharan-S-1"
                },
                {
                    "user_id": "Berfie Tan",
                    "user_href": "/profile/Berfie-Tan"
                },
                {
                    "user_id": "Vicky van der Zee",
                    "user_href": "/profile/Vicky-van-der-Zee"
                },
                {
                    "user_id": "High School Teen 01",
                    "user_href": "/profile/High-School-Teen-01"
                },
                {
                    "user_id": "Alex Cio",
                    "user_href": "/profile/Alex-Cio"
                },
                {
                    "user_id": "Mayuresh Fulambrikar",
                    "user_href": "/profile/Mayuresh-Fulambrikar"
                },
                {
                    "user_id": "Harsh Harsh",
                    "user_href": "/profile/Harsh-Harsh-421"
                }
            ]
        },
        {
            "author_info": {
                "name": "Karen Keil",
                "href": "/profile/Karen-Keil-4"
            },
            "answer_text": "The effectiveness seems to depend on who you ask and - more importantly - on the reason for it use. It will not capture airborne particles. Some say it is 95–99% effective in preventing the transmission of the disease (if both parties are wearing them.) Some say it doesn’t do much to keep you from catching the disease, but it prevents you from giving it to someone else (as much.) I’m not sure that any of that is true, but it could be. What I know is that it makes functioning possible, because most places of business require them (supposedly because a governor said so, but the corporate head office probably said so, too. Blaming the governor makes it “not their fault.”) In addition, and possibly most importantly, wearing a mask is effective at reducing the level of anxiety of the people around you at least a little. It is an act of kindness and consideration. I won’t say that you must wear one, though that will make life easier for you. I will say that it is - at the moment - the better choice than not wearing one unless you have a medical condition that make it dangerous. ",
            "date": "Answered July 30, 2020",
            "views": "751",
            "upvotes": " Answer requested by Vijay Ram"
        }
    ]
}