{
    "title": "Can you see the difference from full HD to 4k without getting too close to the TV? - Quora",
    "tags": [
        "HDTVs (display device)",
        "HDTV (format)",
        "Ultra HD Television",
        "High Definition Video",
        "4K (format)",
        "LED TVs",
        "Television Sets",
        "Computer Monitors and Screens",
        "Television"
    ],
    "response": [
        {
            "author_info": {
                "name": "Graham Stephens",
                "href": "/profile/Graham-Stephens-3"
            },
            "answer_text": "It’s the human eyes ability to resolve detail (visual acuity) coupled with the pixel density of the screen that matters. Screen brightness is a secondary issue too. So its your definition of “too close” that is relevant. As a rule of thumb. optimum viewing distance at normal screen brightness is a function of screen dimensions. Screens are specified in terms of picture diagonal dimension but its picture height that is used to calculate optimum viewing distance. For standard definition, 6 times picture height is considered optimal For HDTV it drops to 3 times picture height For UHD (4K) its 1.5 times picture height. So UHD demands larger screens in order to increase optimum viewing distance to an acceptable value. In practice you need a 65″ screen if you want to view a 16:9 UHD picture at a distance of 4–5 feet. “Optimum” in this scenario is a distance that allows your eye to resolve the higher resolution of UHD while staying far enough away that you do not see the individual pixels. This is a rule of thumb. I have seen mathematical treatments on this topic, but they all arrive at roughly the same screen size vs viewing distance. So buying a small UHD screen is not recommended since the viewing distance decreases proportionately. You might as well buy an HDTV if a small screen is all you can afford or want. You also need to understand that human visual acuity degrades with age. What you can see at 50 years of age is very different from what a 15 year old can see. The above ratios apply to an average 30–40 year old viewer with “good eyesight”. ",
            "date": "Answered August 18, 2020",
            "views": "59",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Eric Mathew",
                    "user_href": "/profile/Eric-Mathew-2"
                }
            ]
        }
    ]
}