{
    "title": "Could smartphones become obsolete in the near future? - Quora",
    "tags": [
        "Obsolete Technologies",
        "Obsolescence",
        "Technology Trends",
        "Technology"
    ],
    "response": [
        {
            "author_info": {
                "name": "Jason Woltz",
                "href": "/profile/Jason-Woltz"
            },
            "answer_text": "Eventually they will likely morph into different solutions like wrist bands or Google Glass style devices. Their ability to perform without judgement on the end user will make it difficult for them to become obsolete though. Glasses and watches will both have fit factors but I will muse on this more below!! We may not see cell phone obsolescence until an even crazier solution comes like an implant or something. How and why wrist bands or glasses? Caveat: Technology will have to increase so these alternate solutions can compete with our consumer needs while fitting our weight and size needs etc. This is a hypothetical talk assuming we define the cell phone as a device that stays a flat black mirror going forward. Caveat 2: Virtual personal assistants will have to become much better so that alternate devices will have a similar or easier use without an input interface requiring our fingers, eyes, or both.  Caveat 3: air pods by Apple exist and they are amazing, they play audio, record your voice surprisingly well, while being mobile, rechargeable and simply a great product.  A similar product may need to be used to get the best experience out of our future alternate devices below.  Wrist watches are convenient, so is a personal assistant that can place calls, send messages, and write letters on your behalf while you dictate the message. The amount of screen that could fit onto your wrist could be just enough to allow a user to have a rather spartan alternate experience relying mostly on the digital assistant and the watch as a quick time/notification checker and miscellaneous status display interface. Also the wrist watch would be the backbone powerhouse that airpods connect to. Battery life, interface, and virtual assistant are the biggest issues I see here. If this future become more of a reality then some folks may become two watch consumer so they have no down time while one watch charges. Glasses are still bought worn and sold for various reasons despite LASERS! This futuristic device was already created by Google and it was a flop in the consumer market. It was before its time. The discussion about the product became a deeply tumultuous talk about privacy rights, and more. This style device has a lot of promise. The wrist watch style alternate described above takes a step away from cameras and screens being a big important and integral part of the device and use, thus described as a more spartan experience. The glasses can be more of a does it all solution, but glasses have a few concerns more over than the watch. They will be more susceptible to constraints regarding weight and size. They will also have more health and safety concerns. The glasses will eventually be able to provide a various degree of experiences though from a head up display to an alternate reality experience or possibly a full vr like experience, depending on retina projection technology advancements. BOTH? We could experience both of these alternates in the future with the wrist watch as a daily commuter style of device and the glasses being an entertainment style device, but who knows. This is something I have thought about as I like to tinker with end user products to better suit my needs, or discover products that perfectly fit my needs and this stuff is fun, but I need to move on from this question, for now. ",
            "date": "Answered June 5, 2019",
            "views": "731",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Justice Varner",
                    "user_href": "/profile/Justice-Varner-1"
                },
                {
                    "user_id": "Dakota Nelson",
                    "user_href": "/profile/Dakota-Nelson-15"
                }
            ]
        },
        {
            "author_info": {
                "name": "Allen Gibson",
                "href": "/profile/Allen-Gibson-4"
            },
            "answer_text": "The usage NO the method YES. We are just years away from having chips being able to be implanted into the brain. At first they will do simpler functions such as controlling seizure attacks. Or aid in muscle motor control. But as time goes on they will become more and more advance your PC, CELL PHONE, GPS, VIDEO GAMES, TV and VR will all be on one little chip smaller than a postage stamp inside your head. You will be physically linked to a network. Today the majority would not except this but tomorrow it would be so common that you would be considered an out cast to humanity without it. Just think no more down time cause your laptop or cell needs recharged. Down fall NO more privacy of any kind even in bed. No more lying or deception especially by politicians. Public knowledge of everything you know. Computer vireos could become fatal. KNOW what your partner is really thinking and if they cheated on you and with whom. Kids not being able to sneak out at night anymore And many more. The sad thing about it we would slowly wing into this so that to the people growing up with it. It would be normal. Say 10 or 20 generations later we become the BORG. ",
            "date": "Answered June 5, 2019",
            "views": "12",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Justice Varner",
                    "user_href": "/profile/Justice-Varner-1"
                },
                {
                    "user_id": "Tejanshu Khardekar",
                    "user_href": "/profile/Tejanshu-Khardekar"
                },
                {
                    "user_id": "Santosh Reddy",
                    "user_href": "/profile/Santosh-Reddy-87"
                }
            ]
        },
        {
            "author_info": {
                "name": "Jonathan Jilaxzone",
                "href": "/profile/Jonathan-Jilaxzone-1"
            },
            "answer_text": "Today, I don't think so. But a few years down the road, it may be. With technological advancements that is going at rapid pace, A.I, Machine Learning, the invention of bendable display and even smaller components that fits into tiny silicone, one day smartphone is going to be obsolete. Next time people doesn't even need to hold a thing (smartphone) to connect to internet and to get information. They can just ask, get the audio (think like AirPods, but smarter, better, perhaps smaller) and visualization directly (via smart glasses) or even smart soft lenses. I hope I can see that day coming! ",
            "date": "Answered February 11, 2019",
            "views": "252",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Dennis Jin",
                    "user_href": "/profile/Dennis-Jin-2"
                }
            ]
        },
        {
            "author_info": {
                "name": "Mark Wingo",
                "href": "/profile/Mark-Wingo-4"
            },
            "answer_text": "Honestly - this was a smartphone if you could find one that wasn't beat up. You put a quarter in and you could talk a long time. There were no monthly bills to put us all in debt, we didn't worry about the reception if you found one that wasn't beat up, it worked. They say on-line that the adults now, 30% have never seen or used one of these, so only 7 out of 10 people looking at this, this was our public phones for a very long time. At times they were a lifesaver. I know of one that saved my life. Bleeding from a car wreck, nothing was around but this phone and a closed down business. I was able to have the operator call for help and I never lost a signal. I wonder what all the operators are doing now? Retired by now I guess. I know theres been times my cell phone was dead this would have been a sight for sore eyes.  ",
            "date": "Answered July 20, 2020",
            "views": "283",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Chris Owen",
                "href": "/profile/Chris-Owen-53"
            },
            "answer_text": "Everything becomes obsolete. Laptops for the most have surcome to tablets. Pagers surcame to Textable cell phones. Blackberry is still a very strong company albeit misunderstood by the masses about its security that even the NSA has difficulty hacking today. People want the next best GAME machine Blackberry was not that it is a business device. Large screens disappeared in Cell phones and came back in Tablets. The next thing is a disposable film that can make calls like in the movie Ultraviolet.  That and the ability to change the color of your hair and clothes at will. or pull weapons and items from compressed space. ",
            "date": "Answered February 11, 2019",
            "views": "14",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Dennis Jin",
                    "user_href": "/profile/Dennis-Jin-2"
                }
            ]
        },
        {
            "author_info": {
                "name": "Ron Joe",
                "href": "/profile/Ron-Joe-4"
            },
            "answer_text": "It is hard to imagine smartphones becoming obsolete when they just keep getting better and better more apps faster better batteries. But then never say never. Google has been trying glasses now for several years. Display that's not handheld. Audio output closer to the ears. Then there are those that see the merging of biotech and infotech. Technology implants bypassing our eyes and ears directly connected to our neuro systems. Science fiction you say? my smartphone does more than Captain Kirks communicator!? ",
            "date": "Answered July 19, 2019",
            "views": "147",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Gary Barlich",
                    "user_href": "/profile/Gary-Barlich"
                }
            ]
        },
        {
            "author_info": {
                "name": "Jona Arkenson",
                "href": "/profile/Jona-Arkenson"
            },
            "answer_text": "Depends, Apple iPhones become obsolete simply because you can't install and update NEW apps because the older iPhones cannot get the software updates. It also depends on the battery.. when the battery dies, the phone is nearly obsolete unless you can get it replaced.. getting an iPhone X battery replaced by yourself is not easy nor cheap. Android phones last longer despite not getting new software updates, the app store will still allow the user to install new apps and update them, regardless of the OS version. As long as you take care of your phone, the phone will last decades. Phones nowadays are becoming “good enough” and many users are not buying new phones every year. ",
            "date": "Answered July 19, 2019",
            "views": "229",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Gary Barlich",
                    "user_href": "/profile/Gary-Barlich"
                }
            ]
        },
        {
            "author_info": {
                "name": "Beny Boi",
                "href": "/profile/Beny-Boi"
            },
            "answer_text": "With the way technology is heading, I wouldn't be surprised if smartphones become obsolete. But not any time in the near future. Many Sci-fi shows and movies have fiddled with the idea of implants (kinda like contacts) go into your brain or eyes that allow you to see AR (Augmented Reality). So pretty much projecting images and videos into the real world. ",
            "date": "Answered January 22, 2019",
            "views": "96",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Robert Mudry",
                "href": "/profile/Robert-Mudry"
            },
            "answer_text": "All of our current electronic technology, phones and everything else, will just become blended into our everyday environment. It will work just like how good ol’ Dr Strange controls space and time - just use magic words and hand waving. If you wanna talk to someone you just start speaking and the local environment will figure out who to connect you to. Same on the other end. Displays will be embedded in everything. If ya wanna watch a video you just have to say what ya want to see and the video will be displayed on the best available local screen. Ubiquitous computing - Wikipedia https://en.wikipedia.org/wiki/Ubiquitous_computing What is Pervasive Computing? - Definition from Techopedia https://www.techopedia.com/definition/667/pervasive-computing ",
            "date": "Answered March 6, 2019",
            "views": "541",
            "upvotes": " View 3 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Justice Varner",
                    "user_href": "/profile/Justice-Varner-1"
                },
                {
                    "user_id": "Shivram Swaminathan",
                    "user_href": "/profile/Shivram-Swaminathan"
                },
                {
                    "user_id": "John Collins",
                    "user_href": "/profile/John-Collins-242"
                }
            ]
        },
        {
            "author_info": {
                "name": "Andrew Santamauro",
                "href": "/profile/Andrew-Santamauro"
            },
            "answer_text": "I don’t think that smart phones will become obsolete and disappear all together. For instance, somewhere in my Box-O-Gadgets I have an iPhone 3g. It was my first iPhone and is pretty much useless; unless I want to use it as a funky paper weight. It is obsolete, it is no longer manufactured or supported with updates. I now have an iPhone 8 which is still being made and supported. So I don’t think that smart phones will become completely obsolete and disappear all together. I think that they will just keep being updated, improved, and redesigned. As always…In my opinion. ",
            "date": "Answered February 12, 2019",
            "views": "193",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Dennis Jin",
                    "user_href": "/profile/Dennis-Jin-2"
                }
            ]
        },
        {
            "author_info": {
                "name": "Ofer Sheinkin",
                "href": "/profile/Ofer-Sheinkin"
            },
            "answer_text": "This question is a good one, but a little imprecise. When talking about Smartphones you are actually talking about 3 distinct items packed together for the consumer. The Concept.The Technology.The Interface.Taking each item separately: The Concept - is probable going to keep being relevant for a long time.The Technology - has a built in 5–10 years obsolescence. So any smartphone bought today will probably be obsolete by 2030.The Interface - is a tricky question. Smartphones in the future may use4 the same form-factor 3–7″ color screen and single/dual finger interface, may use a hologram interface like in the “Minority Report” movie or be surgically implanted and use Direct-to-Mind interfaces. No way to tell.",
            "date": "Answered March 9, 2019",
            "views": "209",
            "upvotes": " Answer requested by Dennis Jin, Manny Rodriguez and 1 more"
        },
        {
            "author_info": {
                "name": "Srini R",
                "href": "/profile/Srini-R-1"
            },
            "answer_text": "Surely the form factor could vanish in some more years and I can imagine a display less chip containing all the functionality of a phone and is woven into a fabric (shirt, pant, etc). ",
            "date": "Answered April 11, 2016",
            "views": "202",
            "upvotes": "0"
        }
    ]
}