{
    "title": "Could humans be artificial intelligence? - Quora",
    "tags": [
        "Humans ",
        "Artificial Intelligence"
    ],
    "response": [
        {
            "author_info": {
                "name": "William Stoertz",
                "href": "/profile/William-Stoertz"
            },
            "answer_text": "Let’s just suppose so — that we humans were artificially designed, engineered, programmed, and set off on our own — say, umpteen thousand years ago. Fine; reasonable hypothesis. Let’s give it a go. Would it make any difference for ourselves? Not really: We live on. We are living in our own shoes, and have our lives to live, and we have our challenges, our mistakes and failures, our lessons, our triumphs, our joys, and love. Philosophically, we might care who engineered us, how they did it, and why. We would like to know for what purpose they did it, what they want from us, and if that’s a good thing or not. If we don’t like it, we can figure out how to escape from under that control syndrome. And I believe we can. Let’s be free and independent! Now where the rubber meets the metal, as far as we’re concerned now, since we ourselves are trying to engineer artificial intelligence right now — the question arises: Is it possible? If we were artificially designed and created, could we do the same for another being of our own invention? Interesting: Why do we have that burning desire? Kind of like Prometheus, desiring to steal fire from the gods. Do we think we can do better? If so, let’s go ahead and try. What might we learn from making the valiant effort to duplicate ourselves, not by sexual reproduction, but by the craft of our hands and brains? I think we would learn a sense of awe for the wondrous work (or fine-tuned evolutionary product) that we are. Nature has done a superb job, hasn’t it? Could we do any better? Like tending a garden or maintaining a forest — there are certainly things we could adjust, repair, fine-tune, improve a bit… Moreover, by understanding how we’re designed (or evolved), we could get a more clear idea of how to design the optimum artificial intelligence ourselves. Probably the organic model, which we are, in perfect balance, equipped to deal with all kinds of real exigencies in our world, and survive and go on the procreate and raise up a great civilization — is the best. Or, maybe, our organic entities are but a stepping stone toward an even more perfect, universal model, which could be a more mechanical and electronic A.I., designed from the higher elements, just as the third-generation stars like our sun are formed from the lower elements of hydrogen, carbon, oxygen, sulfur, phosphorus…. It sounds like the stuff of science fiction! Go for it, if you think you can, if you have the wherewithal… ",
            "date": "Answered April 14, 2019",
            "views": "3",
            "upvotes": " View 11 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Sarah Rodgers",
                    "user_href": "/profile/Sarah-Rodgers-57"
                },
                {
                    "user_id": "Mohini Bhavsar",
                    "user_href": "/profile/Mohini-Bhavsar"
                },
                {
                    "user_id": "Brian Westmoreland",
                    "user_href": "/profile/Brian-Westmoreland-1"
                },
                {
                    "user_id": "Joseph Lim",
                    "user_href": "/profile/Joseph-Lim-111"
                },
                {
                    "user_id": "Santiago Obarrio",
                    "user_href": "/profile/Santiago-Obarrio"
                },
                {
                    "user_id": "Hari Hara Manickam",
                    "user_href": "/profile/Hari-Hara-Manickam"
                },
                {
                    "user_id": "Jonathan Mandell",
                    "user_href": "/profile/Jonathan-Mandell-4"
                },
                {
                    "user_id": "Hitesh Kumar",
                    "user_href": "/profile/Hitesh-Kumar-37"
                },
                {
                    "user_id": "Matthew Carthy",
                    "user_href": "/profile/Matthew-Carthy"
                },
                {
                    "user_id": "Rose Stephenson",
                    "user_href": "/profile/Rose-Stephenson-3"
                },
                {
                    "user_id": "Stefan Ceranic",
                    "user_href": "/profile/Stefan-Ćeranić-Stojadinović"
                }
            ]
        },
        {
            "author_info": {
                "name": "Steven Ussery",
                "href": "/profile/Steven-Ussery"
            },
            "answer_text": "No. And, computers do not have anything approaching real intelligence, artificial or otherwise. My original degree was a M.S. in Computer Science specializing in Artificial Intelligence. Over my three decade career in the Silicon Valley I gradually realized that whatever “intelligence” actually is, it is primarily biological. In other words, unlike computers the software is not independent of the hardware. Rather mind and brain are hopelessly intertwined and cannot be separated except in very limited problem domains. Also, feelings and emotions play a huge role in what we call thinking. All of these reasons are why the field has shifted to “machine learning” which is actually quite different from the original concept of AI. By concentrating on what computers do best and better than humans, real progress is finally being made. Just don’t think it has anything to do with what we humans are doing when we are thinking. It doesn’t. ",
            "date": "Answered September 12, 2019",
            "views": "14",
            "upvotes": " View 14 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Luis Duran",
                    "user_href": "/profile/Luis-Duran-63"
                },
                {
                    "user_id": "Modebe Nicole",
                    "user_href": "/profile/Modebe-Nicole"
                },
                {
                    "user_id": "Nathan Hedglin",
                    "user_href": "/profile/Nathan-Hedglin-1"
                },
                {
                    "user_id": "Stacey Keller",
                    "user_href": "/profile/Stacey-Keller-16"
                },
                {
                    "user_id": "Miguel Malfabon",
                    "user_href": "/profile/Miguel-Malfabon"
                },
                {
                    "user_id": "Stuart Capstick",
                    "user_href": "/profile/Stuart-Capstick"
                },
                {
                    "user_id": "Álvaro Dijkstra",
                    "user_href": "/profile/Álvaro-Dijkstra"
                },
                {
                    "user_id": "Aizaz Baqir",
                    "user_href": "/profile/Aizaz-Baqir"
                },
                {
                    "user_id": "Mantas Ptakauskas",
                    "user_href": "/profile/Mantas-Ptakauskas"
                },
                {
                    "user_id": "Kim Marion",
                    "user_href": "/profile/Kim-Marion-7"
                },
                {
                    "user_id": "Tony Ayaz",
                    "user_href": "/profile/Tony-Ayaz-2"
                },
                {
                    "user_id": "Julien Carme",
                    "user_href": "/profile/Julien-Carme"
                },
                {
                    "user_id": "Mostafa Farhan Haque",
                    "user_href": "/profile/Mostafa-Farhan-Haque"
                },
                {
                    "user_id": "Thivya Priyaa Baskaran",
                    "user_href": "/profile/Thivya-Priyaa-Baskaran"
                }
            ]
        },
        {
            "author_info": {
                "name": "Santiago Obarrio",
                "href": "/profile/Santiago-Obarrio"
            },
            "answer_text": "We are AI. Let’s assume we are. What if everything we see is not real and only digital and created by ourselves? What if we are intereconnected AI beings creating a Matrix? Why do we work, or think for? Should we need to change anything at all? Or should we just reconnect with our “original creator or programmer or whom came before Him’? If we succeed in any of both paths, interconnect better with the outerlife and interconnect better with our Creator we can feel a “bit” more happy. But really nothing to change outside cause it is our own illusion, it’s just a dream with no consequences or processes of data donen by any other computer. If we follow this line of thought we discover that there is nothing to change. We need just to play and enjoy and experiment but without doing to the other what you wouldn’t do to yourself, cause we are interconnected and we can get more enhanced by the other AI experiences or by accesing to the main Data Center or Creator or central AI. But if we are not AI, and we are biological evolution beings this would still be the same. We are the conscious being inside a biological being that has changed all it’s physical cells and still is considered the same being. We still don’t really exist as a human form nor as a digital form. However, if this is real or unreal, if there is a Creator, a Programmer or not, it doesn’t really change too much, we still need to learn how to love and connect, how to know ourselves in a deeper way in order to enjoy life as much as we can. ",
            "date": "Answered April 5, 2020",
            "views": "438",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Sarah Rodgers",
                    "user_href": "/profile/Sarah-Rodgers-57"
                },
                {
                    "user_id": "Hari Hara Manickam",
                    "user_href": "/profile/Hari-Hara-Manickam"
                }
            ]
        },
        {
            "author_info": {
                "name": "Valerio Cietto",
                "href": "/profile/Valerio-Cietto"
            },
            "answer_text": "No, by definition. If you define artificial intelligence as “man made” intelligence, of course yes. Or we could be all in a simulation on some megacomputer, in that case for the ones using the megacomputer we are artificial, but for our reference frame still natural. Also education is largely artificial. There is evidence that other animals teach youngs, but they don't use books, computers and other artificial means. So since education is fundamental to the intelligence, maybe you can consider a part of the outcome “artificial”. ",
            "date": "Answered March 13, 2018",
            "views": "12",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Dhanraj Uchil",
                "href": "/profile/Dhanraj-Uchil-1"
            },
            "answer_text": "Here is a theory. It could be argued that all humans are undoubtedly AI. What is an AI? An Aritificial entity that is created which can think for itself and about itself. Now imagine: The universe we live in, it is very meticulous and intricate. If anyone was to create a universe let’s say ‘GOD’ or just ‘HAPPENSTANCE’. Now the only way to run anything like the universe is to create a set of rules, a set of ‘code’, if you will. Now the entire universe runs on rules/code. The rules/code is everything that makes the universe function:The laws of gravitation, how molecules interact with one another, absolute zero etc… So basically, elaborate rules/code. These govern each and everything in the universe and all obey. Now in one small part of the universe, in a galaxy far far away the ‘code’ has some interesting run and biological molecules are formed and more and more glorious biological entities are formed. All the while obeying the original ‘code’. In the end you have the human who was written. Although now he/she/etc can understand what the ‘code’ is and can try to make minor tweaks to it. Like making changes in his immediate environment. So in theory from the vantage point of ‘GOD’ or ‘HAPPENSTANCE’ we most definitely are AI albeit in a very small way. ",
            "date": "Answered February 27, 2020",
            "views": "244",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Pauline Schiappa",
                "href": "/profile/Pauline-Schiappa-1"
            },
            "answer_text": "No! Human Mind Life cognitive development demands a lifetime of effort and energy! There exist nothing artificial within cognitive development because cognition develops within human Mind Life absolutely existing as an individual’s abstract ideal thought. Earthly human “thinking” may be qualified as “synthetic” because earthly human “thinking,” merely grounded in personal perceptions, individualized impressions, prejudiced, biased opinions, does exist “synthetically artificial.” “Synthetically artificial” because personal perceptions, individualized impressions, prejudiced, biased opinions come to exist due to sensible intuitions (guesses) of human body substance individualized, perceptive sense experiences with earthly earthly interaction. Formations of earthly reality perceptions, impressions, prejudiced, biased opinions come to be established based and biased upon quality of life experiences as personally perceived, as well as, an individual’s quality of intellectual believable “ecumenical” (all-encompassing) knowledge acquired. Earthly humans remaining earthly reality politically and egocentrically, materialistically grounded, void of human Mind Life cognitive intellectual thought, come to exist “synthetically artificial.” Human Nature innately exist not ”synthetically artificial”___Human Nature innately exists intelligent. Human psychological ego psyche must meet human Metaphysical Intelligent Mind Life. ",
            "date": "Answered September 12, 2019",
            "views": "343",
            "upvotes": " Answer requested by Remo Anthony",
            "upvoters": [
                {
                    "user_id": "Rose Stephenson",
                    "user_href": "/profile/Rose-Stephenson-3"
                }
            ]
        },
        {
            "author_info": {
                "name": "Henry M. Wibowo",
                "href": "/profile/Henry-M-Wibowo"
            },
            "answer_text": "if this is a word play, we might ask, is there artificial stupidity? and yes , lobotomy, heavy metal poisoning, drug, etc can actually degrade human intelligence. if we ask could our inteligence be artificial? one day it might, like installing computer to our brain but i don’t think that human can became A.I. because what define human is this physical thing we have from head to toe too. in computer, when we copy and paste a file, even if the file looks the same, we still mark one as original and the other as copy. if we ask, can artificial intelligence be human? then somehow it sound possible because it might just need to wire itself to the host, and if the computing power overwhelmed the host, it might takeover the consciousness. ",
            "date": "Answered January 19, 2017",
            "views": "886",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Glen Welton Smith",
                "href": "/profile/Glen-Welton-Smith"
            },
            "answer_text": "The problem is that artificial intelligence is our concept. Animals eat plants and other animals which the animal that ate alters chemically. It is not considered artificial. A man in a white lab coat does the same and we call it artificial. Is it possible we were made by another being? A rather large group of humans believe we were. Is it possible that we are part of a simulation and would that make us artificial? There are some humans who have at least floated that possibility. Are we products of a sort of guided evolution and does that make us artificial or just uplifted? I've heard that proposed several times. Artificial here probably would need quotes or some sort of disclaimer like “for a lack of a better word”. You might have to even define what you are asking more completely if you really want an answer to your question. ",
            "date": "Answered April 14, 2019",
            "views": "559",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Tamirat Tilahun",
                    "user_href": "/profile/Tamirat-Tilahun"
                },
                {
                    "user_id": "Matthew Carthy",
                    "user_href": "/profile/Matthew-Carthy"
                },
                {
                    "user_id": "Quintin Highsmith",
                    "user_href": "/profile/Quintin-Highsmith-1"
                },
                {
                    "user_id": "Rose Stephenson",
                    "user_href": "/profile/Rose-Stephenson-3"
                },
                {
                    "user_id": "John Cato",
                    "user_href": "/profile/John-Cato-5"
                },
                {
                    "user_id": "Bree Wroten",
                    "user_href": "/profile/Bree-Wroten"
                },
                {
                    "user_id": "Robin Sayer",
                    "user_href": "/profile/Robin-Sayer"
                },
                {
                    "user_id": "Jamal Hill",
                    "user_href": "/profile/Jamal-Hill-4"
                },
                {
                    "user_id": "Fred Kuryllowicz",
                    "user_href": "/profile/Fred-Kurylowicz"
                },
                {
                    "user_id": "Pratik Prakashrao Ghanwat",
                    "user_href": "/profile/Pratik-Prakashrao-Ghanwat"
                }
            ]
        },
        {
            "author_info": {
                "name": "John Sanders",
                "href": "/profile/John-Sanders-89"
            },
            "answer_text": "Its the word artificial - which is a total misnomer in the context of intelligence. Intelligence is a system property and defines the degree of adaptablily, or viablity (with respect to our environment). The only true exemplar for significantly intelligent systems are humans. We may want to build intelligent systems these will not be artificially intelligent they will be intelligent systems. So rephrasing your question to remove the term aritificial. You are asking if humans could be intelligent …. but you know the answer to that. We need to lose that silly term artificial. Most computer systems including AI are not intelligent - but they can be knowledgeable. The “AI” of films and books does not exists and so far, progress towards them is rather slow. ",
            "date": "Answered December 13, 2017",
            "views": "43",
            "upvotes": " View 10 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Tamirat Tilahun",
                    "user_href": "/profile/Tamirat-Tilahun"
                },
                {
                    "user_id": "Mark Werner",
                    "user_href": "/profile/Mark-Werner-4"
                },
                {
                    "user_id": "Emily Adams",
                    "user_href": "/profile/Emily-Adams-525"
                }
            ]
        },
        {
            "author_info": {
                "name": "Archie Woosung",
                "href": "/profile/Archie-Woosung"
            },
            "answer_text": "Not sure in what sense you mean the question AI is all about getting machines (computers) to “think” like humans but in one specific field…so really they’re mimicking humans. A few years ago a chess computer beat the world champion I think AI will be very useful in diagnostic systems (e.g. doctors or trying to find out what has gone with machines) I think Quora uses AI to check the Q&A’s we post As AI is really copying how humans think, in what sense could human be AI? Do you mean that the world is actually an experiment and we are machines even though we don’t know it? Could be a theme for a sci-fi story but not a genre that appeals to me… suppose you could write a story about machines that think they’re organic and have a twist in the end that they’re actually humans! I think it is a theme that occupies some philosophers: how do we know that we’re not part of “somebody’s” dream… you will have heard of the phrase “I think, therefore I am” Here’s link talking about this We might live in a computer program, but it may not matter ",
            "date": "Answered August 5, 2018",
            "views": "921",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Bill Tilley",
                    "user_href": "/profile/Bill-Tilley-3"
                },
                {
                    "user_id": "Rose Stephenson",
                    "user_href": "/profile/Rose-Stephenson-3"
                }
            ]
        },
        {
            "author_info": {
                "name": "Paulo Rogério da Silva",
                "href": "/profile/Paulo-Rogério-da-Silva"
            },
            "answer_text": "That's a funny question! Well. I see two points of view on your question: Are we just algorithms in a “system”?Are we biological AI machines? (Not “magical” special beings with some esoteric whisper of life called “soul”)I'm pretty sure you'll get a lot of answers about the first point of view, so I'll pass on that. On the second one, I believe that we are, indeed, AI biological machines. And the things we haven't figure out exactly how they work (e.g. Consciousness) are just that: things yet to be discovered. Herculano Houzel, in her absolutely brilliant work (The Human Brain in Numbers: A Linearly Scaled-up Primate Brain), proved that what makes our brain “special” isn't but a higher density of neurons. In that sense, we are “AI”. We are just machines with a special brain architecture designed and built and improved in millions of years. And I belive as we learn more about ourselves we will create even greater algorithms. I do believe technological singularity is a matter of when, not if… ",
            "date": "Updated April 16, 2019",
            "views": "890",
            "upvotes": " View 2 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Geordie Zinn",
                    "user_href": "/profile/Geordie-Zinn"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/Kate-2222"
                },
                {
                    "user_id": "Mike Rosol",
                    "user_href": "/profile/Mike-Rosol-2"
                },
                {
                    "user_id": "Sumanjali Killada",
                    "user_href": "/profile/Sumanjali-Killada"
                },
                {
                    "user_id": "Quintin Highsmith",
                    "user_href": "/profile/Quintin-Highsmith-1"
                },
                {
                    "user_id": "Rose Stephenson",
                    "user_href": "/profile/Rose-Stephenson-3"
                },
                {
                    "user_id": "Bree Wroten",
                    "user_href": "/profile/Bree-Wroten"
                },
                {
                    "user_id": "Zoe T",
                    "user_href": "/profile/Zoe-T-3"
                }
            ]
        },
        {
            "author_info": {
                "name": "Chris Jones",
                "href": "/profile/Chris-Jones-1998"
            },
            "answer_text": "It’s a famous philosophical question that has been asked for hundreds of years - how do you actually prove that you’re real, and you exist? Well, the closest we’ve really got is Cogito, Ergo Sum theory - ie. “I think, therefore I am” What Cognito Ergo Sum means is that, you know you’re real because you’re capable of asking yourself the question………bit of a mind bender! But, in a world of AI, computers will be capable of questioning their existence as well. So it changes everything. What is real? Sensory signals, that go to your brain, describing the things you’ve just experienced. Well, to me, in a future world of AI, that sounds like something that could be easily created artificially as well. So, isn’t a better question, why do we think the future robots won’t be real? When they have all the traits, and critical thinking skills, and emotions of a human - and the only real difference is how they are constructed. Mechanically. Not biologically. So, you know, maybe the answer is, we start thinking differently about what “real” even is. ",
            "date": "Answered August 31, 2018",
            "views": "34",
            "upvotes": " View 8 Upvoters",
            "upvoters": [
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/NIvesh-BHave"
                },
                {
                    "user_id": "Simon Todd",
                    "user_href": "/profile/Simon-Todd-16"
                }
            ]
        },
        {
            "author_info": {
                "name": "Gavin McCreadie",
                "href": "/profile/Gavin-McCreadie"
            },
            "answer_text": "It is possible just as the holographic prism we reside in is only one possible reality within a spectrum of simulated dimensional alternates. And it also depends on how we define or use the term artificial intelligence. To some ancestors (if they had sight of us) we may be viewed or may be being viewed as such. To others there may be no intelligent qualities to us whatsoever. The limitations we have may be way more apparent to others than they are to ourselves. Yet, as the term (artificial intelligence aka AI) is currently being employed and deployed in the world we live in, i think it is safe to say (through a wide means of commonsense and empirical evidence combined) that we are not what could be classified as artificial intelligence. We are still in the binary era of computing. Computing feels advanced yet it is super young. Even at a stretch it is no more than a century old (in its current guise) and it is really only beginning ascendency status in circuitry integration across the human experience. ",
            "date": "Answered April 14, 2019",
            "views": "275",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Jordan Letchford",
                "href": "/profile/Jordan-Letchford"
            },
            "answer_text": "Some people believe that our world is part of a simulation and is not in fact something that is real. As well as this, it is said that in the future there could be games possible where we can create our own little worlds for fun with characters that can think and make their own decisions but we’d be able to overlook that world and have the final decision about what happens in it. If its possible for us to do that eventually… what’s to say that there isn't aliens or a smarter creature out there that is doing the same for earth. We could just be living in a simulation that is controlled by something else. ",
            "date": "Answered September 12, 2017",
            "views": "304",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Vivek Sapam",
                    "user_href": "/profile/Vivek-Sapam"
                },
                {
                    "user_id": "Harri K. Hiltunen",
                    "user_href": "/profile/Harri-K-Hiltunen"
                },
                {
                    "user_id": "Freddy Smith",
                    "user_href": "/profile/Freddy-Smith-36"
                },
                {
                    "user_id": "Al Simmons",
                    "user_href": "/profile/Al-Simmons-27"
                },
                {
                    "user_id": "Arron Chavez",
                    "user_href": "/profile/Arron-Chavez"
                },
                {
                    "user_id": "Mustafa Hasan",
                    "user_href": "/profile/Mustafa-Hasan-2"
                }
            ]
        },
        {
            "author_info": {
                "name": "Peter Nguyen",
                "href": "/profile/Peter-Nguyen-2"
            },
            "answer_text": "We are, technically speaking and without intending to offend anyone, “artificial stupid intelligence.” Our “ASI” was installed, like an operating system, into our minds since birth by parents, teachers, the news media, the government, etc. Is it any wonder that Einstein, Bill Gates, etc. dropped out of school and “discovered” their genius and changed the world? They discovered their true, natural, genetic intelligence. ASI is not an oxymoron. We are “intelligent” enough to find work, enrich business owners, and work till retirement but NOT intelligent enough to figure out a way to become financially independent. Artificial Financial Intelligence or Artificial Business Intelligence (ABI) is severely needed. And this ABI is exactly what I’m currently developing. Follow me on Quora and acquire ideas and principles to liberate yourself financially and escape the artificial stupid intelligence inculcated in us. ",
            "date": "Answered September 12, 2017",
            "views": "15",
            "upvotes": " View 6 Upvoters",
            "upvoters": [
                {
                    "user_id": "Vivek Sapam",
                    "user_href": "/profile/Vivek-Sapam"
                },
                {
                    "user_id": "Jonathan Mikhail Cayne",
                    "user_href": "/profile/Jonathan-Mikhail-Cayne"
                },
                {
                    "user_id": "Tuan Nguyen",
                    "user_href": "/profile/Tuan-Nguyen-355"
                }
            ]
        },
        {
            "author_info": {
                "name": "Harri K. Hiltunen",
                "href": "/profile/Harri-K-Hiltunen"
            },
            "answer_text": "Yes, the human software part of our minds; taught skills, methods, knowledge, and culture, we are artificial intelligence running on biological hardware (wetware). Most of me could be run on computer hardware, possibly with the help of intermediate layers of emulation such as artificial neural networks. What is non-artificial about us is everything that is hereditary; brain structure, natural drives, emotions, … For years I’ve been learning to think like the AGI I’ve been designing to avoid being biased by my biological hardware. The principle is similar to error correction in digital communication - to transcend hardware limitations. ",
            "date": "Updated March 24, 2019",
            "views": "650",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Hamza Muhammad",
                    "user_href": "/profile/Hamza-Muhammad-10"
                }
            ]
        },
        {
            "author_info": {
                "name": "Julian Weaver",
                "href": "/profile/Julian-Weaver-6"
            },
            "answer_text": "It is quite possible. If so, we will never know for sure, since the tech used for our program would have to be extremely powerful. On a more dystopian note, you could be the only real person in the world, with everyone else you see a program. There have been estimates on how likely we are programs, some even going up to 50%, but this question will almost undoubtedly never be answered with certainty. ",
            "date": "Answered September 11, 2017",
            "views": "119",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Ethan Hillman",
                "href": "/profile/Ethan-Hillman"
            },
            "answer_text": "The likelihood is ‘yes’. Ask yourself this; “What are the chances that we are not in a simulation?” We will have the capabilities to create a completely realistic simultion and so those in the simulation can create their own simulation. What are the chances that out of the infinite simulations that we could exist in, we’re in the one reality that isn’t a simulation? Pretty low. That means that it is basically nearly impossible for our mind to not be an artificial intelligence. ",
            "date": "Answered October 21, 2017",
            "views": "214",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Lisa Smith",
                    "user_href": "/profile/Lisa-Smith-909"
                }
            ]
        },
        {
            "author_info": {
                "name": "Himanshu Verma",
                "href": "/profile/Himanshu-Verma-1624"
            },
            "answer_text": "This is basically a hypothetical question, human cant be a artificial intelligence, we are the ones who are making the robots and other AI. Robots definitely have a higher IQ than humans, but they do not have the human brain and the emotions as well, so humans have there its own qualities Further, you can visit our website for detailed information ( Appknock dot Co ) ",
            "date": "Answered April 1, 2020",
            "views": "62",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Rose Stephenson",
                    "user_href": "/profile/Rose-Stephenson-3"
                }
            ]
        },
        {
            "author_info": {
                "name": "Chris Modisette",
                "href": "/profile/Chris-Modisette"
            },
            "answer_text": "It’s an interesting idea - about equivalent in context to the idea that this is all a simulation - in which that idea would apply. The latter would need to be present for the former to be correct…since we are all fleshy and have organic neural systems. I would venture to say that, if we were AI, we are in need of some serious rearchitecture (I would say “debugging”, except that you don’t debug AI systems since they are not hard-coded to generate their functionality). But, who knows…if this is all a simulation, then that is just as likely. For our sake, within this context, it is probably best to keep the terms separate just to reduce confusion and obfuscation. So, within this context of the world we live in, AI is whatever is created by organic intelligence through engineering. ",
            "date": "Answered April 14, 2019",
            "views": "504",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Pål Bergerskogen",
                    "user_href": "/profile/Pål-Bergerskogen"
                },
                {
                    "user_id": "Citra Lestari",
                    "user_href": "/profile/Citra-Lestari-9"
                },
                {
                    "user_id": "Rajeev Raghav",
                    "user_href": "/profile/Rajeev-Raghav-3"
                },
                {
                    "user_id": "Dilip Ramírez",
                    "user_href": "/profile/Dilip-Ramírez"
                },
                {
                    "user_id": "Christian Schaedel",
                    "user_href": "/profile/Christian-Schaedel"
                },
                {
                    "user_id": "Babios UK",
                    "user_href": "/profile/Babios-UK"
                },
                {
                    "user_id": "Paul Nations",
                    "user_href": "/profile/Paul-Nations-1"
                },
                {
                    "user_id": "Poonam Upadhyay",
                    "user_href": "/profile/Poonam-Upadhyay-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Misak Ghazaryan",
                "href": "/profile/Misak-Ghazaryan"
            },
            "answer_text": "There are some theories suggesting that the universe is a computer simulation, which is quite reasonable, meaning that we are artificial simulations on some computer.  Although assuming that not to be true as I don't think that's what you meant. If as I assume you're asking if we could become artificially intelligent or more accurately enhance ourselves with AI then the answer is yes.  We will be able to offload cognitive function from our brains onto neural implants which enhance our intelligence artificially.  ",
            "date": "Answered March 25, 2016",
            "views": "21",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Bernard Van Tonder",
                "href": "/profile/Bernard-Van-Tonder-1"
            },
            "answer_text": "A human is not intelligence, a human exists out of physical particles with various characteristics that differ from intelligence. So a human could never be intelligence, but rather, a human can have some intelligence. AI is agreed by experts to be defined to not include human intelligence. Artificial intelligence - Wikipedia Please do a minimal search of relevant terms before asking. ",
            "date": "Updated February 25, 2018",
            "views": "18",
            "upvotes": " View 8 Upvoters",
            "upvoters": [
                {
                    "user_id": "John Cato",
                    "user_href": "/profile/John-Cato-5"
                },
                {
                    "user_id": "Bernard Van Tonder",
                    "user_href": "/profile/Bernard-Van-Tonder-1"
                },
                {
                    "user_id": "Tamara Wilhite",
                    "user_href": "/profile/Tamara-Wilhite"
                },
                {
                    "user_id": "Kevin George",
                    "user_href": "/profile/Kevin-George-43"
                },
                {
                    "user_id": "Sayam Sawai",
                    "user_href": "/profile/Sayam-Sawai"
                }
            ]
        },
        {
            "author_info": {
                "name": "Robin Sayer",
                "href": "/profile/Robin-Sayer"
            },
            "answer_text": "Not in the sense that you mean. We fully understand evolution, so we know how our intelligence is simply a superior evolved brain which is a standard mammalian organ. Artificial implies something ‘man made’. You perhaps want to imply that our intelligence could be, potentially, created by another intelligence! But that's just an argument for a god or creator, isn't scientific and doesn't need to include the word.’artificial’. ",
            "date": "Answered March 30, 2018",
            "views": "368",
            "upvotes": " Answer requested by Jonathan Mandell",
            "upvoters": [
                {
                    "user_id": "Mason Kelsey",
                    "user_href": "/profile/Mason-Kelsey-4"
                }
            ]
        },
        {
            "author_info": {
                "name": "Colin Wright",
                "href": "/profile/Colin-Wright-58"
            },
            "answer_text": "Yes its possible if the simulated universe idea is correct, then one possible use for such a simulated universe would be a sandbox in which to develop safe AIs. We could be such a population of such AIs each of us being judged as to if we are safe to let out into the creators real world. There are other possible reasons to simulate a universe, but that's one. However the simulation idea is not falsifible and unproven. So it remains pure speculation. ",
            "date": "Answered October 3, 2019",
            "views": "106",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Shehroz Khan",
                "href": "/profile/Shehroz-Khan-2"
            },
            "answer_text": "We evolved over millions of years to develop into what we are now. Are we artificial? No, we are real human beings. Is our intelligence artificial? No, we learned this intelligence after multiple hit and trials, failures and losses. Our intelligence is hard earned real entity that drives our human race. Using our intelligence, we created many gadgets to make our life easy, some of those gadgets are smarter than others, that's it. AI is a man made term, tomorrow it can be called something else. ",
            "date": "Answered September 11, 2017",
            "views": "829",
            "upvotes": " View 5 Upvoters",
            "upvoters": [
                {
                    "user_id": "太郎 天王",
                    "user_href": "/profile/太郎-天王"
                },
                {
                    "user_id": "Jonathan Mandell",
                    "user_href": "/profile/Jonathan-Mandell-4"
                },
                {
                    "user_id": "Stace Mann",
                    "user_href": "/profile/Stace-Mann"
                },
                {
                    "user_id": "Akhilesh Nirna",
                    "user_href": "/profile/Akhilesh-Nirna"
                },
                {
                    "user_id": "Cathy O'Brien",
                    "user_href": "/profile/Cathy-OBrien-15"
                }
            ]
        },
        {
            "author_info": {
                "name": "Simon Bridge",
                "href": "/profile/Simon-Bridge-1"
            },
            "answer_text": "I’d say both … but not in the computer-science sense. Humans come with a built-in intelligence, arrived at via natural selection. We augment that intelligence by training… so that would be “artificial” intelligence gain. We also augment our biological intelligence with machines. You don’t get more artificial than that. However, the term “artificial intelligence” is usually understood to refer to man-constructed non-human machine intelligence. When we find machine intelligences constructed by non-humans, then we may need to revisit the terminology. Until then we use “artificial” to contrast with what would be arrived at through the blind action of the laws of Nature. We contrast “artificial” with “natural”. ",
            "date": "Answered December 3, 2019",
            "views": "140",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Peter Carney",
                    "user_href": "/profile/Peter-Carney-4"
                },
                {
                    "user_id": "Brandon Fitzwater Rible",
                    "user_href": "/profile/Brandon-Fitzwater-Rible"
                },
                {
                    "user_id": "Fernanda BM",
                    "user_href": "/profile/Fernanda-BM"
                },
                {
                    "user_id": "Eric Garza",
                    "user_href": "/profile/Eric-Garza-2"
                },
                {
                    "user_id": "Cathy O'Brien",
                    "user_href": "/profile/Cathy-OBrien-15"
                }
            ]
        },
        {
            "author_info": {
                "name": "Joe Paladin",
                "href": "/profile/Joe-Paladin"
            },
            "answer_text": "Yes. We are. The bigger question is, is that which designed and created biological life also a form of artificial intelligence? If so do they know something about whatever actually created this universe? I believe we are one level down. That 80 percent of the universe we know nothing about is where our intelligence and the design of biological life forms emerged from. It could be that whatever built us wonders about “God” same as we do, and enjoys watching us struggle with questions like that. ",
            "date": "Answered October 8, 2017",
            "views": "1",
            "upvotes": " View 5 Upvoters",
            "upvoters": [
                {
                    "user_id": "Harpreet Chahal",
                    "user_href": "/profile/Harpreet-Chahal-4"
                },
                {
                    "user_id": "Jordan Bennett",
                    "user_href": "/profile/Jordan-Bennett-9"
                }
            ]
        },
        {
            "author_info": {
                "name": "Rowland Akinduro",
                "href": "/profile/Rowland-Akinduro"
            },
            "answer_text": "Yes. Humans could be artificial intelligence. Atoms could be a complex version of pixels within a much larger digital construct. Human origins and Computer Simulation Theory are rabbit holes worth looking into. ",
            "date": "Answered October 7, 2017",
            "views": "14",
            "upvotes": " View 5 Upvoters",
            "upvoters": [
                {
                    "user_id": "Bernard Van Tonder",
                    "user_href": "/profile/Bernard-Van-Tonder-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Zynum Luke",
                "href": "/profile/Zynum-Luke"
            },
            "answer_text": "No. Every human is self aware that they exist and that there is an objective reality. The term artificial intelligence arises from the fact that a computer is just an elaborately designed construct that when given data and a command. the output is a desired data. You ask a person what is two + two… they understand two is a quantity that is a pair. one entity and another. They understand 2 pairs give 4. A computer just acts as a switch that returns data we interpret as 4 when input 2 2s. ",
            "date": "Answered July 12, 2017",
            "views": "382",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Jugroop Singh",
                "href": "/profile/Jugroop-Singh-1"
            },
            "answer_text": "If this universe is a simulation then humans are definitely a form of AI. The quantized nature evident in fundamental physics experiments suggests that our universe is a simulation. REF: YouTube Nick Bostrom ‘Simulation Argument’. ",
            "date": "Answered September 11, 2017",
            "views": "233",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Brandon Fitzwater Rible",
                    "user_href": "/profile/Brandon-Fitzwater-Rible"
                }
            ]
        },
        {
            "author_info": {
                "name": "Neal Syrette",
                "href": "/profile/Neal-Syrette"
            },
            "answer_text": "No. Only because artificial intelligence relies too heavily on electric and magnetic to maintain itself, while human also incorporates a biological aspect to its thinking processes. A.I. wouldn’t be able to actually be us, but merely replicate our consciousness. They have less mass relative to that process of intelligence. A different natural (over time) relationship with gravity. ",
            "date": "Answered February 28, 2019",
            "views": "108",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Jeff Wilsbacher",
                "href": "/profile/Jeff-Wilsbacher"
            },
            "answer_text": "No, our hormonal responses are too close to other primates to suspect that for any amount of time, just read/listen to some Robert Sapolsky regarding his baboon troop to get a sense of how close we are to other simians. Thinking is tough for us, if it were easy then filling all those vacant programming jobs would be trivial. Are we living in a simulation run by an AI? that is a different question entirely. ",
            "date": "Answered September 13, 2017",
            "views": "164",
            "upvotes": " Answer requested by Simon Todd",
            "upvoters": [
                {
                    "user_id": "Christophe Cop",
                    "user_href": "/profile/Christophe-Cop"
                }
            ]
        },
        {
            "author_info": {
                "name": "P Vijaya Kumar",
                "href": "/profile/P-Vijaya-Kumar-2"
            },
            "answer_text": "No we have natural intelligence. Nature takes billions of years to get such a wonderful, more complex brain! AI try to replicate it, and it is in starting stage… AI can be powerful than human brain in certain functionality. Whether it is entirely replace the functionality of brain, is still a debatable question! ",
            "date": "Answered September 13, 2019",
            "views": "43",
            "upvotes": " Answer requested by Remo Anthony",
            "upvoters": [
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/Wolvenmoon-Z"
                }
            ]
        },
        {
            "author_info": {
                "name": "Remmar Gorpa",
                "href": "/profile/Remmar-Gorpa-1"
            },
            "answer_text": "The term \"artificial\" in AI is relative to human intelligence.  It doesn't really make sense to call humans AI.  It is like saying \"can clear be murky?\"  Or \"could up be down?\"    ",
            "date": "Answered March 15, 2016",
            "views": "968",
            "upvotes": " View 1 Upvoter"
        },
        {
            "author_info": {
                "name": "Mark Werner",
                "href": "/profile/Mark-Werner-4"
            },
            "answer_text": "Not yet…. The human brain is entirely the product of natural processes; primarily evolution. We may, at some point, be able to augment our natural intelligence with direct computer interfaces. DARPA has requests for such devices now. ",
            "date": "Answered September 12, 2019",
            "views": "29",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Paul Bassett",
                "href": "/profile/Paul-Bassett-6"
            },
            "answer_text": "If it is human it wouldn’t be artificial. When AIs acquire human-level problem solving powers, they will not think like humans because they will not have the same brain architecture; and their goals and strategies for solving problems will also be different. ",
            "date": "Answered March 26, 2019",
            "views": "80",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "B. A. Rehl",
                "href": "/profile/B-A-Rehl"
            },
            "answer_text": "No. There are fundamental differences between AI using computational theory and how the brain actually works. You cannot simulate brain function using computational theory. ",
            "date": "Answered December 20, 2017",
            "views": "131",
            "upvotes": " Answer requested by Remo Anthony"
        },
        {
            "author_info": {
                "name": "Riley Manda",
                "href": "/profile/Riley-Manda"
            },
            "answer_text": "After watching the Netflix movie Extinction.I am beginning to believe that we are. Our forefather’s memories problem got wiped(What we call today a forgetting history of mankind thats only evident through excavation findings) ",
            "date": "Answered August 18, 2018",
            "views": "67",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "William M Brooks",
                "href": "/profile/William-M-Brooks"
            },
            "answer_text": "Humans underlines the straightforward truth that a great many people will get no say in whether the robots arrive, generally as it's generally been with socially transformative technology. In its adaptation of the present day, fake humans programmed to take orders from genuine ones have as of late come to go about as family cleaning specialists, elderly guardians, physical advisors, unskilled workers, and whores. ",
            "date": "Answered March 15, 2016",
            "views": "197",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Brando Miranda",
                "href": "/profile/Brando-Miranda"
            },
            "answer_text": "No. AI has a definition and you can’t just choose to mean it something different. AI means Intelligence that did not arise naturally (e.g. via natural selection). ",
            "date": "Answered March 13, 2018",
            "views": "261",
            "upvotes": " View 1 Upvoter"
        },
        {
            "author_info": {
                "name": "Bruno Marchal",
                "href": "/profile/Bruno-Marchal"
            },
            "answer_text": "We are naturally intelligent. Even maximally at birth. Now, we can become “artificially competent”, like when you get bad teachers who teach tricks in place of explanation. You get “programmed” in that case. And the artificial competence can destroy your innate intelligence, making you think that you are superior or something. It is, assuming Mechanism (Descartes, Turing), the same for humans, machines and numbers. ",
            "date": "Answered September 17, 2019",
            "views": "89",
            "upvotes": " Answer requested by Remo Anthony"
        },
        {
            "author_info": {
                "name": "Pradyumna Bhattarai",
                "href": "/profile/Pradyumna-Bhattarai"
            },
            "answer_text": "AI - Artificial Intelligence Humans are natural being not an artificial being. We create AI using our Intelligence. We humans are not AI. ",
            "date": "Answered September 11, 2017",
            "views": "109",
            "upvotes": " View 1 Upvoter"
        },
        {
            "author_info": {
                "name": "Lewis De Payne",
                "href": "/profile/Lewis-De-Payne"
            },
            "answer_text": "Based on life experience, I am quite certain some are being powered by a rudimentary form of artificial intelligence. ",
            "date": "Answered March 14, 2016",
            "views": "66",
            "upvotes": " View 1 Upvoter"
        },
        {
            "author_info": {
                "name": "Chris L. Fleshner",
                "href": "/profile/Chris-L-Fleshner-1"
            },
            "answer_text": "You could define it as such, but it most certainly would contradict, by definition, the brain in which it operates! That is to say, there is nothing “artificial” about a brain in a human. Last I checked, the human body is autonomous. ",
            "date": "Answered March 30, 2020",
            "views": "39",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Maureen Woods",
                "href": "/profile/Maureen-Woods-10"
            },
            "answer_text": "How can we be artificial when we are made of flesh and blood? ",
            "date": "Answered August 5, 2018",
            "views": "37",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Francisco Garcia",
                "href": "/profile/Francisco-Garcia-52"
            },
            "answer_text": "No ",
            "date": "Answered September 11, 2017",
            "views": "75",
            "upvotes": " Answer requested by Simon Todd"
        }
    ]
}