{
    "title": "Could the Earth have been formed before the Sun? - Quora",
    "tags": [
        "Earth-Sun Relationship",
        "The Sun",
        "Cosmology",
        "Earth (planet)",
        "Planetary Science"
    ],
    "response": [
        {
            "author_info": {
                "name": "Keith Allpress",
                "href": "/profile/Keith-Allpress"
            },
            "answer_text": "The sun was not formed in its present location but as a young star in a star forming region. The cluster M67 is about the same age as our sun,  and it was thought our sun might have drifted away from there. But drift is the operative word, we are a bit too far away and violent moves might dislodge the planets. So the jury is still out.  As a young star the sun would have developed a protoplanetary disk (not a nebula! ) by picking up dust grains as residual material from previous generations of stars. Here is a Hubble view of the young star Beta Pictoris, and it contains a planet being formed from the dust. ​  ​​http://hubblesite.org/newscenter/archive/releases/star/protoplanetary%20disk/2015/06/image/a/ Presolar material contains silicon carbide,  nanodiamonds, and shocked minerals that indicate it derives from earlier stars. But it cannot reform into planets unless it is collected around a newly forming star.  It is very unlikely that a young star could capture a extremely rare rogue planet, avoid collision forming planets, with  let alone place it in same position and orbit as they would have been formed by the natural route of aggregation. It would be much more likey to be deflected or captured by Jupiter. The alternative that the earth formed naturally from dust grains is more reasonable, by Punch's razor. The simplest explanation is most likely correct.  The location of earth fits the generally expected location of inner rocky planets inside the ice line and isotopic ratios of many elements confirm it is a natural planet. Gold and heavy elements migrated to the core initially, so gold in the crust and other crustal heavy metals, along with water were brought again later to the crust by asteroid bombardments. Isotopic tests have confirmed the asteroidal origins of earth's oceanic water.  It also had a collision with a large body that increased the iron core, and formed the moon, which sets a firm limit on its age in the present location.  So the earth is at least as old in our system as the LHB the late heavy bombardment about 3.9 billion years ago that was also suffered by the other planets in our solar system. You can clearly see the cratering still.  Impact bombardment in the first billion years of solar system history determined their subsequent evolution. The LHB melted about 2% of the upper 20 km of Earth's crust, but not all at once, so about 2% at any one time. About 10% covered in molten rock 1km deep. Not very habitable. Zircon minerals formed containing radioactive lead have lead loss when formed from impact events as opposed to other sources. Indeed studies indicate those zircons found on earth are mainly from the collision ejecta. ",
            "date": "Updated August 9, 2015",
            "views": "13",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Bob Wyatt",
                    "user_href": "/profile/Bob-Wyatt-13"
                },
                {
                    "user_id": "C Stuart Hardwick",
                    "user_href": "/profile/C-Stuart-Hardwick"
                },
                {
                    "user_id": "Dragi Raos",
                    "user_href": "/profile/Dragi-Raos"
                }
            ]
        },
        {
            "author_info": {
                "name": "Tim Kaye",
                "href": "/profile/Tim-Kaye-1"
            },
            "answer_text": "There are several ways in which the Earth could be older than the sun. First, it could be a captured planet. Its fairly normal for planets to get flung out their star systems, and for some of them to get captured by other star systems. A larger planet within the same system or passing star can do the flinging. Young star systems are so unstable that they not only do a lot of planet flinging, they're really good at capturing planets and setting them down neatly in near-circular orbits, with obliquity aligned with the rest of the star system. That happens when the star system is still surrounded by a disk of dusk and gas, and by a rotating sphere of gas. On the other hand, the planets most likely to be captured are those flung off by nearby star systems. That's because star systems are usually not born one at a time, but in litters like puppies. Just as puppies in the same litter can trade fleas, star systems in the same stellar nursery can trade planets. Another way in which the Earth can be older than the sun is because planet formation can begin before the protostar begins to form. Also, a planet can be fully developed while still orbiting a protostar. There are some indications that the rocky inner planets (Mercury, Venus, Earth, and Mars) may have gotten off to a late start. Although Mars finished developing in only 10 million years, Earth took a bit longer. Thus, there is no indication that Earth is substantially older than the sun, although many other planets in our galaxy are older than the stars they orbit. ",
            "date": "Answered May 1, 2016",
            "views": "11",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "James Foulds",
                "href": "/profile/James-Foulds"
            },
            "answer_text": "I suppose there isn't any reason why the Earth couldn't have been formed before the Sun, but it's pretty unlikely & it'd be difficult to imagine a practical mechanism that could allow this. Also, as mentioned in other answers, the Proto-earth didn't reach its final form (as the earth-Moon system) until after a Mars-sized planet (Theia) collided with it.   That collision happened a few hundred million years after the Proto-earth first formed. The Earth has been dated pretty accurately at 4.7 billion years old.   That's very similar to the age of the Sun.  (The collision with Theia occurred around 4.5 billion years ago). Speculating massively, one vaguely practical mechanism could be the Earth being formed elsewhere.  Then, thrown out of it's original parent star's orbit to wander as a rogue planet, before it was eventually captured by our Sun?   However, the Earth (or proto-earth) would need to be considerably older to allow time for this (unlikely!) scenario to play out. ",
            "date": "Answered August 11, 2015",
            "views": "628",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Cesar A. K. Grossmann",
                    "user_href": "/profile/Cesar-A-K-Grossmann"
                }
            ]
        },
        {
            "author_info": {
                "name": "Dragi Raos",
                "href": "/profile/Dragi-Raos"
            },
            "answer_text": "I believe we are able to date rocks by their content of certain isotopes (like C-14 we use for organic material, but using longer living isotopes), and that together with other geological properties, like intensity of radioactive decay heating, firmly puts  Earth age at about 4.5 billion years. According to History of Earth the oldest rocks are about 4 billion years, and the oldest crystals in them 4.4. billion. Our Sun also fits that timeframe (astrophysicists have pretty good ideas about Stellar evolution). So, no, our Earth was born from planetary nebula surrounding a young star - Sun. It is, in principle, possible that a planet gets kicked out of one solar system by gravitational perturbations caused by larger siblings, and be captured by another star. It is just that this has not happened with our planet. ",
            "date": "Answered August 7, 2015",
            "views": "17",
            "upvotes": " Answer requested by Matteo Pellegrini",
            "upvoters": [
                {
                    "user_id": "Bob Wyatt",
                    "user_href": "/profile/Bob-Wyatt-13"
                },
                {
                    "user_id": "Michael Soso",
                    "user_href": "/profile/Michael-Soso"
                },
                {
                    "user_id": "Eron Silva",
                    "user_href": "/profile/Eron-Silva"
                }
            ]
        },
        {
            "author_info": {
                "name": "Robert Reiland",
                "href": "/profile/Robert-Reiland"
            },
            "answer_text": "We don't know absolutely for sure, but the best evidence is that the current inner planets, including Earth, formed after the outer planets and also after the sun formed: Wandering Jupiter accounts for our unusual solar system The typical planetary system that has been discovered in recent decades isn't like ours.  It either has gas giants close to the star or \"super Earths.\"  It seems to have taken an unusual set of events to form our solar system.  The article in the link indicates that our system can be explained if super Earths did form early with Jupiter forming farther out.  Then Jupiter migrated inward and gravitationally destroyed the inner planets.  After that, Saturn and Neptune may have slowly brought Jupiter beyond the inner solar system, and the debris left over from the destruction of the super Earths formed the inner planets. Earth was probably formed after the sun. ",
            "date": "Answered August 16, 2015",
            "views": "15",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Angel Moreno",
                    "user_href": "/profile/Angel-Moreno-67"
                },
                {
                    "user_id": "Matthew Jacobus",
                    "user_href": "/profile/Matthew-Jacobus-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Gwydion Madawc Williams",
                "href": "/profile/Gwydion-Madawc-Williams"
            },
            "answer_text": "No.  First, the proto-Earth suffered a major collision that resulted in the creation of the EarthMoon and a much-changed Earth.  So it is probably the youngest planet. Second, until the sun starts generating power, the Inner Solar System would not be cleared of volatiles, the stuff that went to major planets above the 'snow line'. Someone cited an article, Much of Earth's Water Is Older Than the Sun. But that would be water that was in the original cloud of gas and dust that formed the sun and planets.  It might ahve arrived on Earth relatively late. ",
            "date": "Answered August 8, 2015",
            "views": "578",
            "upvotes": " View 2 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Richard Stratford",
                    "user_href": "/profile/Richard-Stratford-2"
                }
            ]
        },
        {
            "author_info": {
                "name": "Troy J Carpenter",
                "href": "/profile/Troy-J-Carpenter"
            },
            "answer_text": "No; study of forming planetary systems in H2 regions across the galaxy reveal that a star and its planets accrete rapidly at roughly the same time, but that the baby protostar gets a slight head start by virtue of being in the center. It is possible to go from collapsing solar nebula to full-fledged solar system in less than 20 million years; the star and planets are essentially siblings of the same age. In our own solar system, meteorite lead-isotope dating has revealed that the Earth is the same age as everything else in our solar system, including the Sun. ",
            "date": "Answered August 18, 2019",
            "views": "138",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Sheri Fresonke Harper",
                    "user_href": "/profile/Sheri-Fresonke-Harper"
                },
                {
                    "user_id": "Chris Kelly",
                    "user_href": "/profile/Chris-Kelly-59"
                },
                {
                    "user_id": "Dragi Raos",
                    "user_href": "/profile/Dragi-Raos"
                }
            ]
        },
        {
            "author_info": {
                "name": "John Rodrigues",
                "href": "/profile/John-Rodrigues"
            },
            "answer_text": "There was an announcement about a year ago that Much of Earth's Water Is Older Than the Sun.  Kant's nebular theory from 1775 stated that the solar system formed around the star within the dust cloud's protoplanetary disk. ",
            "date": "Answered August 7, 2015",
            "views": "577",
            "upvotes": " View 3 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Angel Moreno",
                    "user_href": "/profile/Angel-Moreno-67"
                },
                {
                    "user_id": "Michael Soso",
                    "user_href": "/profile/Michael-Soso"
                },
                {
                    "user_id": "Yuval Jacoby",
                    "user_href": "/profile/Yuval-Jacoby-2"
                },
                {
                    "user_id": "Naraina Damle",
                    "user_href": "/profile/नारायण-दामले-Naraina-Damle"
                },
                {
                    "user_id": "Daniel Super",
                    "user_href": "/profile/Daniel-Super"
                },
                {
                    "user_id": "Rogelio Lorenzo",
                    "user_href": "/profile/Rogelio-Lorenzo"
                }
            ]
        },
        {
            "author_info": {
                "name": "Malcolm Sargeant",
                "href": "/profile/Malcolm-Sargeant"
            },
            "answer_text": "Everything was forming at about the same time from a vast cloud of dust and gas. The final blob of material that we call earth was formed when a small protoplanet called Theia collide with the  protoplanet earth and the collision resulted in the earth moon pair. ",
            "date": "Answered August 8, 2015",
            "views": "691",
            "upvotes": " View 6 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Richard Stratford",
                    "user_href": "/profile/Richard-Stratford-2"
                },
                {
                    "user_id": "Peter Aleff",
                    "user_href": "/profile/Peter-Aleff-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Sara Baker",
                "href": "/profile/Sara-Baker-5"
            },
            "answer_text": "No. Stars always form before planets. Stars can sometimes capture rogue planets but rogue planets don't form all by themselves. ",
            "date": "Answered August 10, 2015",
            "views": "210",
            "upvotes": " Answer requested by Matteo Pellegrini",
            "upvoters": [
                {
                    "user_id": "Richard Stratford",
                    "user_href": "/profile/Richard-Stratford-2"
                }
            ]
        },
        {
            "author_info": {
                "name": "Ariful Hoque",
                "href": "/profile/Ariful-Hoque-11"
            },
            "answer_text": "No, Sun is formed first before any any planets (including Earth) Planets are thought to formed from solar nebula (protoplanetary disk). The remaining dust after the formation of sun, made planets.  Protoplanetery disk, image sourse: Wikipedia ",
            "date": "Answered August 18, 2019",
            "views": "133",
            "upvotes": " View 2 Upvoters"
        },
        {
            "author_info": {
                "name": "John Palo",
                "href": "/profile/John-Palo-5"
            },
            "answer_text": "No ",
            "date": "Answered August 18, 2019",
            "views": "48",
            "upvotes": " View 1 Upvoter"
        },
        {
            "author_info": {
                "name": "Erza Radifan Rahmat",
                "href": "/profile/Erza-Radifan-Rahmat"
            },
            "answer_text": "No ",
            "date": "Answered August 7, 2015",
            "views": "123",
            "upvotes": "0"
        }
    ]
}