{
    "title": "Could 5G WiFi really replace cable internet? - Quora",
    "tags": [
        "Wireless Internet",
        "Cables",
        "5G (wireless communication)",
        "Wi-Fi"
    ],
    "response": [
        {
            "author_info": {
                "name": "Scott King Walker",
                "href": "/profile/Scott-King-Walker"
            },
            "answer_text": "Yes, it could. I have been using 4G LTE as my primary home internet without too many issues since last year. With a bit more speed, a reasonably priced plan, and even slightly lower latency it would be an excellent solution. My current solution is giving me 35–45 Mbps down (sometimes way more), 16–17 Mbps up, and latency in the 50’s of ms. Latency is a bit worse than cable (at our previous house), but the speeds are gotten higher than the old cable plan we had. I could have purchased a higher plan via cable, but about 25 Mbps was fine. We didn’t have a 4K TV at the old house, so Streaming HD from Amazon Prime was the most demanding thing we did. My son preferred the lower latency, but this is playable. Equipment was under $500, and we are paying $150 per month for an unlimited data plan from a local MVNO who has been giving great customer service. I have a cellular gateway with external antennas. It is wired direct to my home network which feeds wireless access points where I need them to be. The 5G Home Internet plans would be great for me if I could qualify for them. They are currently running $50-$70/month with no long term commitment, equipment included. They are also unlimited data for home use. Honestly, I would upgrade to that plan in a heartbeat just to save $80 to $100 a month. Some of the issues with 5G are also solved by using it for fixed point rather than mobile use. A home connection can use large externally mounted antennas. The view will either be obstructed, or not. You shouldn’t bop back and forth between 4G and 5G like many of the reviewers discuss with 5G phones. Big, fixed antennas DO make a difference. So yes, some people will switch. I even have a friend who switched to T-mobile Home Internet from Verizon FIOS! For him the savings was more important than the speed, and 50 Mbps up/down for $50/month fits his needs. I can’t get that plan out here, yet, because our tower won’t support those speeds. The T-mobile infrastructure out here has been grossly overloaded since COVID hit. Many people got T-mobile data plans because they were cheap, and the county school system was even giving out hotspots. Unfortunately, Verizon and AT&T are focused on super high speed mmWave for a tiny fraction of the people who can already get Fiber and Cable. Only T-mobile seems to actually be trying to solve Broadband for people without those options. (I love to kid my friend about not being rural, since he can get fiber if he wants it, but it is very hit and miss. His street has it because a Verizon executive lived on his street and got extended to them.) T-mobile has made some missteps, but they are at least working on the right problem. It will be interesting to see who gets to my rural area first, T-mobile 5G or StarLink, and who has the better offering. (I could likely buy both for less than the cost of my current plan!) ",
            "date": "Answered June 20, 2020",
            "views": "115",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "OKportal Technology",
                "href": "/profile/OKportal-Technology"
            },
            "answer_text": "YES, It could be. With a high degree of probability, 5G will replace the cable Internet in major cities. The technology offers a high data transfer rate - up to 10K Mbps. This is ten times faster than a wired connection, but it does not have to solve the problems associated with laying cables in a dense metropolis infrastructure. There is a known situation when an English company laid fibre optic cables in a sewer system. So it was faster than the classical methods (80%). 5G, obviously, completely eliminates the need to separate the wires \"on the ground\".  Credit image: Your Guide to Getting Rid And the war with cable internet has already begun. The 5G services of Verizon and T-Mobile operators are the biggest threat to cable Internet. T-Mobile said that by 2024 about 10 million users are going to \"win back\" from the cable TV and Internet industry (this is the majority of them).The company Verizon will \"lure\" users with free access to YouTube TV and Apple TV. Verizon CEO Hans Vestberg, in an interview, said that soon everything will be wireless and 5G networks will push cables out of the market.Note that for the implementation of 5G in metropolitan areas still have to solve a number of difficulties, in particular, the problem with coverage. Since 5G uses high frequencies - 28 GHz and higher - the signal is not transmitted over long distances and does not pass well through obstacles in the form of walls (this is the price for a high data transfer rate). But to solve this problem, for example, special distributed antenna systems (DAS) are being created.  Hope this explanation helps! OKportal Technology ",
            "date": "Answered June 25, 2019",
            "views": "2",
            "upvotes": " View 50 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Brandon Griffiths",
                    "user_href": "/profile/Brandon-Griffiths-25"
                },
                {
                    "user_id": "Atif Shahzad",
                    "user_href": "/profile/Atif-Shahzad-66"
                },
                {
                    "user_id": "Malik Dawood Usama",
                    "user_href": "/profile/Malik-Dawood-Usama"
                },
                {
                    "user_id": "Imran Haneef",
                    "user_href": "/profile/Imran-Haneef-5"
                },
                {
                    "user_id": "Imran Malik",
                    "user_href": "/profile/Imran-Malik-505"
                },
                {
                    "user_id": "Epiphany Professional",
                    "user_href": "/profile/Epiphany-Professional"
                },
                {
                    "user_id": "Sumaira Nazim",
                    "user_href": "/profile/Sumaira-Nazim"
                },
                {
                    "user_id": "Dawood Usama",
                    "user_href": "/profile/Dawood-Usama"
                },
                {
                    "user_id": "Asif Zaheer",
                    "user_href": "/profile/Asif-Zaheer-9"
                },
                {
                    "user_id": "Aliya Saleem",
                    "user_href": "/profile/Aliya-Saleem-6"
                },
                {
                    "user_id": "Tom Lewis",
                    "user_href": "/profile/Tom-Lewis-271"
                },
                {
                    "user_id": "Arsal Jamshed",
                    "user_href": "/profile/Arsal-Jamshed"
                },
                {
                    "user_id": "Peter Mensah",
                    "user_href": "/profile/Peter-Mensah-32"
                },
                {
                    "user_id": "Evans Egyir",
                    "user_href": "/profile/Evans-Egyir"
                },
                {
                    "user_id": "Clara Michelle",
                    "user_href": "/profile/Clara-Michelle-6"
                },
                {
                    "user_id": "Melissa Stephanie",
                    "user_href": "/profile/Melissa-Stephanie-1-1"
                },
                {
                    "user_id": "Marsyella Tanudjaja",
                    "user_href": "/profile/Marsyella-Tanudjaja"
                },
                {
                    "user_id": "Jack Sparaw",
                    "user_href": "/profile/Jack-Sparaw"
                },
                {
                    "user_id": "Kanwal Hamid",
                    "user_href": "/profile/Kanwal-Hamid-2"
                },
                {
                    "user_id": "Naseem Riaz",
                    "user_href": "/profile/Naseem-Riaz-2"
                },
                {
                    "user_id": "Projects Pakistan",
                    "user_href": "/profile/Projects-Pakistan"
                },
                {
                    "user_id": "Usman Saadat",
                    "user_href": "/profile/Usman-Saadat-1"
                },
                {
                    "user_id": "Soikot Khan",
                    "user_href": "/profile/Soikot-Khan-2"
                },
                {
                    "user_id": "Sarfraz Rashid",
                    "user_href": "/profile/Sarfraz-Rashid-3"
                },
                {
                    "user_id": "Cristine Puspa",
                    "user_href": "/profile/Cristine-Puspa"
                },
                {
                    "user_id": "Maisie Nathania",
                    "user_href": "/profile/Maisie-Nathania-1"
                },
                {
                    "user_id": "Ahmad Malik",
                    "user_href": "/profile/Ahmad-Malik-190"
                },
                {
                    "user_id": "Hassaan Riaz",
                    "user_href": "/profile/Hassaan-Riaz-3"
                },
                {
                    "user_id": "Shikarun Shovon",
                    "user_href": "/profile/Shikarun-Shovon"
                },
                {
                    "user_id": "Suraiya Khanom",
                    "user_href": "/profile/Suraiya-Khanom-1"
                },
                {
                    "user_id": "Fakhran Thoriq",
                    "user_href": "/profile/Fakhran-Thoriq-1"
                },
                {
                    "user_id": "Khush Bakht",
                    "user_href": "/profile/Khush-Bakht-46"
                },
                {
                    "user_id": "Rihu Khan",
                    "user_href": "/profile/Rihu-Khan"
                },
                {
                    "user_id": "Ranzu Khan",
                    "user_href": "/profile/Ranzu-Khan"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/Shoikot-khan-Soikot-Khan12"
                },
                {
                    "user_id": "Sufi Nouman",
                    "user_href": "/profile/Sufi-Nouman"
                },
                {
                    "user_id": "Salman Riaz",
                    "user_href": "/profile/Salman-Riaz-30"
                },
                {
                    "user_id": "Jalil Sir",
                    "user_href": "/profile/Jalil-Sir"
                },
                {
                    "user_id": "Malik Riaz ud Din",
                    "user_href": "/profile/Malik-Riaz-ud-Din"
                },
                {
                    "user_id": "Md Mahbubur Rahman Hamim",
                    "user_href": "/profile/Md-Mahbubur-Rahman-Hamim"
                },
                {
                    "user_id": "Ast",
                    "user_href": "/profile/Ast-27"
                },
                {
                    "user_id": "Andre Camp",
                    "user_href": "/profile/Andre-Camp-1"
                },
                {
                    "user_id": "Sharlen",
                    "user_href": "/profile/Sharlen"
                },
                {
                    "user_id": "Ivan Laksono",
                    "user_href": "/profile/Ivan-Laksono"
                },
                {
                    "user_id": "Yosua Kevin",
                    "user_href": "/profile/Yosua-Kevin-1-1"
                },
                {
                    "user_id": "Kiliative Kenya",
                    "user_href": "/profile/Kiliative-Kenya"
                },
                {
                    "user_id": "Florence Widjaya",
                    "user_href": "/profile/Florence-Widjaya"
                },
                {
                    "user_id": "Kiran Kumar",
                    "user_href": "/profile/Kiran-Kumar-105"
                },
                {
                    "user_id": "Ovinia Rustandy",
                    "user_href": "/profile/Ovinia-Rustandy"
                },
                {
                    "user_id": "Steve Zhu",
                    "user_href": "/profile/Steve-Zhu-38"
                }
            ]
        },
        {
            "author_info": {
                "name": "Jeremy Johnson",
                "href": "/profile/Jeremy-Johnson-318"
            },
            "answer_text": "So first and foremost you have mixed two completley different things. 5G is a form of internet connection, WiFi is a communication protocal to go between a device and a router. 5g is not WiFi, nor is WiFi the same thing as the internet. You can have internet and no wifi, and you can have wifi and no internet. I dont see 5g replacing cable internet, but it will give them competition.There are a few problems with 5g as a home ineterent service: 5G is highly succeptable to trees, buildings, and any other solid objects. So yes in a lab it is amazingly fast and has low ping …… in real world though the results wont be quite so good.For gaming, or live video or any other type of data connection where ping/latency is more important than mbps …. then your cable connection will be superior to real world 5G5G provides great speed to the device but still uses the same intenret backbone in place …… so everyone having 1gbps connection speed to the 5g cell tower is irrelevent if the thousands of customers are sharing 10 gbps of intenret backbone.5G home plans will have to be very different from 4G cell plans because 20 GB of data before you get throttled is not going to cut it.Now 5G will add comptetition, espically in medium sized cities where there is only 2–3 ISPs (I said medium because if it is too small then odds are they wont get 5G until 2030). Between 5g and low-orbit satellite setups like starlink, I do see the traditional ISPs really stepping up their game though. They will have actual high speed competition in more then just multi-million dollar cities. Currently can get gigabit internet for under $100 in many large cities, but $100 in a low population area may barley get you above 20 mbps. ",
            "date": "Answered August 27, 2019",
            "views": "270",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Rene Le'Tellier",
                "href": "/profile/Rene-LeTellier"
            },
            "answer_text": "Yes it could. 5G will permeate every part of modern life allowing low latency machine to machine communication along with high-speed data access (ie download a movie in seconds) and communications. Where it doesn't replace cable/fibre is that at some point the 5G transmitter connects to a fibre backbone network. Businesses/corp etc. will still want to connect to a backbone fibre network for reasons of scale.  For the home/small office etc. Dlink’s new router allows you to connect to a 5G wireless network and then feed out data access through your home or business via wifi. Kinda like making a hotspot with your mobile phone expect with greater range and capacity. The beauty here is that you can connect to the new 5G network, and yes do away with cable connections, and there's no need to update any of your current devices to 5G capability. ",
            "date": "Answered January 7, 2019",
            "views": "13",
            "upvotes": " View 9 Upvoters",
            "upvoters": [
                {
                    "user_id": "Jahmal Abbott",
                    "user_href": "/profile/Jahmal-Abbott"
                },
                {
                    "user_id": "Ovinia Rustandy",
                    "user_href": "/profile/Ovinia-Rustandy"
                },
                {
                    "user_id": "Florence Widjaya",
                    "user_href": "/profile/Florence-Widjaya"
                },
                {
                    "user_id": "Andre Camp",
                    "user_href": "/profile/Andre-Camp-1"
                },
                {
                    "user_id": "Sharlen",
                    "user_href": "/profile/Sharlen"
                },
                {
                    "user_id": "Ivan Laksono",
                    "user_href": "/profile/Ivan-Laksono"
                },
                {
                    "user_id": "F Gerard Lelieveld",
                    "user_href": "/profile/F-Gerard-Lelieveld"
                },
                {
                    "user_id": "Zen Ong",
                    "user_href": "/profile/Zen-Ong-3"
                },
                {
                    "user_id": "Ryan Smith",
                    "user_href": "/profile/Ryan-Smith-711"
                }
            ]
        },
        {
            "author_info": {
                "name": "Greg Lehey",
                "href": "/profile/Greg-Lehey"
            },
            "answer_text": "That’s a very confusing article. 5G is a mobile telephony standard. “WiFi” is a (in my opinion silly) name for IEEE 802.11 - Wikipedia, a set of local wireless networking protocols. This box does both. And yes, it will be possible to use 5G for Internet access. I haven’t seen a pricing comparison to fibre, but my assumption is that it will be slower, not as reliable, and use more power. I’m currently connected to the Internet by a 4G connection (25 Mb/s down, 5 Mb/s up), and 5G will manage much higher rates. ",
            "date": "Answered January 4, 2019",
            "views": "354",
            "upvotes": " View 7 Upvoters",
            "upvoters": [
                {
                    "user_id": "Michael Dickens",
                    "user_href": "/profile/Michael-Dickens-5"
                },
                {
                    "user_id": "Ovinia Rustandy",
                    "user_href": "/profile/Ovinia-Rustandy"
                },
                {
                    "user_id": "Florence Widjaya",
                    "user_href": "/profile/Florence-Widjaya"
                },
                {
                    "user_id": "Andre Camp",
                    "user_href": "/profile/Andre-Camp-1"
                },
                {
                    "user_id": "Sharlen",
                    "user_href": "/profile/Sharlen"
                },
                {
                    "user_id": "Ivan Laksono",
                    "user_href": "/profile/Ivan-Laksono"
                },
                {
                    "user_id": "Richard Taylor",
                    "user_href": "/profile/Richard-Taylor-147"
                }
            ]
        },
        {
            "author_info": {
                "name": "Jonathan Jilaxzone",
                "href": "/profile/Jonathan-Jilaxzone-1"
            },
            "answer_text": "Well it could eventually be able to replace cable internet, if it's affordable, reliable and mainstream (availability at any places). ",
            "date": "Answered January 4, 2019",
            "views": "70",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Richard Taylor",
                    "user_href": "/profile/Richard-Taylor-147"
                }
            ]
        },
        {
            "author_info": {
                "name": "Ian Beyer",
                "href": "/profile/Ian-Beyer-1"
            },
            "answer_text": "5G is not Wi-Fi technology. It is cellular. ",
            "date": "Answered January 4, 2019",
            "views": "28",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Richard Taylor",
                    "user_href": "/profile/Richard-Taylor-147"
                }
            ]
        }
    ]
}