{
    "title": "Could humanity move the Earth out of the path of an oncoming asteroid? - Quora",
    "tags": [
        "Asteroids (astronomy) ",
        "Space Exploration",
        "Outer Space",
        "Earth (planet)",
        "Astrophysics",
        "Planetary Science",
        "The Human Race and Condition",
        "Astronomy",
        "Hypothetical Scenarios"
    ],
    "response": [
        {
            "author_info": {
                "name": "Daniel Quedenfeld",
                "href": "/profile/Daniel-Quedenfeld"
            },
            "answer_text": "I dislike this question because at its core, it’s asking whether or not humanity has the technology to alter the trajectory of a massive object in order to save humanity. Fundamentally, an asteroid must be smaller than a planet (otherwise the asteroid IS a planet) and therefore less massive. So in essence, this asks: Can we alter the trajectory of a massive objectIf yes, can we move the MORE massive object out of the way of the smaller object?If the asker was concerned about the welfare of humanity, this question should read- “Can we alter the path of an asteroid headed for collision with the Earth?” That aside, the answer is most likely no- but not certainly. Depending on how far it is away, even a small objects gravitational attraction over a long enough period could alter the trajectory sufficiently to cause avoidance. There is also the option of weaponry, in which nuclear warheads or similar could create a large enough impulse if detonated close to the surface of the asteroid to alter the trajectory as well. Ultimately though, humanity would do nothing until it is too late. Look at climate change! Doom lurks on the horizon for humanity and we do nothing because of “cost” (as though cost is relevant when the alternative is literal extinction). In reality, if scientists detected an oncoming asteroid and proposed a plan to avert it, humanity would go thru the following: It’s a hoaxMaybe it’s real, but it’s too expensive to deal withThe window of opportunity has passed so we can’t avert it in time anymore anywayEveryone Dies™",
            "date": "Answered February 14, 2020",
            "views": "49",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Charles Weyandt",
                "href": "/profile/Charles-Weyandt"
            },
            "answer_text": "Right now? No way. In the not so distant future? Not the Earth, its not only way too massive, you would also risk completely screwing up the delicate balance related to our orbit, the Sun and Moon, causing ecological disaster. And even if we could control that, it would take a huge amount of accessible material (Earth’s crust) to create enough “equal but opposite” force to move it, even though the material you might use could be going very fast. The better option is to detect potential asteroids ahead of time, get a moderate propulsion system (which would work better anyway, becausem you dont have to deal with any noticeable atmosphere), and slightly deflect its path from a long distance away, whete a small amount of acceleration amounts to a big position differenc over time. And, you wouldn't have to worry about ecological issues, up to and including possible radiation. ",
            "date": "Answered February 11, 2020",
            "views": "62",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Randy Radcliff",
                "href": "/profile/Randy-Radcliff"
            },
            "answer_text": "Not with our current technology, and, I imagine, never. But the question itself is backward: as asteroids are vastly smaller and less massive than the Earth, we'd try to deflect the asteroid, even were we able to move our whole planet. Also, moving the world would likely have severe effects on our climate and geological stability. ",
            "date": "Answered February 14, 2020",
            "views": "48",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Jonathan Bishop",
                "href": "/profile/Jonathan-Bishop-4"
            },
            "answer_text": "Many governments have specialist teams monitoring ’near-earth objects’. One would hope that by the time a very near one like 1950DA due in 2880 comes along that if it posed a risk it would be possible to land a device on it and thrust it away from the earth. ",
            "date": "Answered February 8, 2020",
            "views": "11",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Mark Kent",
                    "user_href": "/profile/Mark-Kent-51"
                }
            ]
        },
        {
            "author_info": {
                "name": "John Stockwell",
                "href": "/profile/John-Stockwell-3"
            },
            "answer_text": "It would be easier to try to deflect the asteroid, because that would, at least that is possible for smaller asteroids to have their orbits altered, if discovered soon enough. ",
            "date": "Answered February 13, 2020",
            "views": "14",
            "upvotes": "0"
        }
    ]
}