{
    "title": "Could web swinging be possible in real life the way Peter Parker does it in the comics or movies? - Quora",
    "tags": [
        "Peter Parker (Marvel Character)",
        "Spider-Man (creative franchise)"
    ],
    "response": [
        {
            "author_info": {
                "name": "Ken Hughes",
                "href": "/profile/Ken-Hughes-10"
            },
            "answer_text": "No, not with any technology that’s at all similar to what we have now. For three reasons: Step 1, the grapnel would have to stick. But there’s no real-world device you can attach to a rope to make it easily spike into or hook onto or glue onto what it’s shot against, so reliably that you could shoot the line and then risk your life swinging from it in the next second. Mythbusters tested this and completely busted it. (Real grapnels often have to be launched several times before they hook onto something, and carefully tested that they won’t come loose. Spidey’s weblines work because they automatically stick.)Step 2, you’d need to swing and keep swinging. Even if the line stuck and you swung out from a building, can you carry enough cable to shoot another line and keep swinging, and then another and another? Without the miracle chemistry that makes a whole swing-line out of a couple of drops of web fluid, you’d be stranded in midair.Step 3, you’d need to land. But swinging anything more than a short distance builds up the kind of momentum that would smash a person all over a wall, unless they had spider-strength to catch themselves with. (And it helps if you could land anywhere on a wall and just stick there, and not worry about grabbing a ledge.)Proper web swinging would require shooting dozens of webs, that could stick to any part of the wall and never slip, to let the hero move in the right arcs to actually swing between buildings and keep going—and still have the raw muscle to land. Note that the live-action Batman stories (unlike the comics and animation) mostly don’t try to show Batman swinging. He only uses that “Step 1 grapnel” to zip up or down a wall but not out into the air, because that’s just too unsafe for a stunt man to film… and even that always-quick-sticks grapnel shouldn’t work. What you really could do is to shoot a line and take a minute to be sure it’s secure, then swing from one building to the side of the next (or just maybe crash through its window), and stop there to climb up or down it. That’s what a real Batman could do, and what soldiers actually do. Spider-Man swings freely among buildings, because his webs (and his muscles) are better than anything we can do with real technology. Hundreds of years from now it might be possible, but that would be science we can’t even imagine now. ",
            "date": "Updated April 27, 2019",
            "views": "24",
            "upvotes": " View 7 Upvoters",
            "upvoters": [
                {
                    "user_id": "Drew Fernandez",
                    "user_href": "/profile/Drew-Fernandez-7"
                },
                {
                    "user_id": "Anita Bath",
                    "user_href": "/profile/Anita-Bath-12"
                },
                {
                    "user_id": "Karl Kovaciny",
                    "user_href": "/profile/Karl-Kovaciny"
                },
                {
                    "user_id": "Saksham Sneh",
                    "user_href": "/profile/Saksham-Sneh"
                },
                {
                    "user_id": "Dylan Trott",
                    "user_href": "/profile/Dylan-Trott-4"
                },
                {
                    "user_id": "M. Fariz Akbar",
                    "user_href": "/profile/M-Fariz-Akbar"
                },
                {
                    "user_id": "Jack Shaw",
                    "user_href": "/profile/Jack-Shaw-11"
                }
            ]
        },
        {
            "author_info": {
                "name": "Jerel Minter",
                "href": "/profile/Jerel-Minter"
            },
            "answer_text": "No in order for that to happen, one has to create mechanical web shooters on the wrists with web fluid in them and until that happens, no it's not possible. ",
            "date": "Answered November 20, 2018",
            "views": "58",
            "upvotes": "0"
        }
    ]
}