{
    "title": "Currently, what technologies could be easily hacked? - Quora",
    "tags": [
        "Hackers",
        "Computer Hacking (security)",
        "Computer Security"
    ],
    "response": [
        {
            "author_info": {
                "name": "Victor Pole",
                "href": "/profile/Victor-Pole"
            },
            "answer_text": "Currently general purpose systems such as your daily use devices are the easiest to hack and most commonly hacked because many people use them. The second most easiest to hack and highest in number is Web Applications. Easily Hack able Techs Now Network Cameras: They are simply abundant and not secure. Many people configure it with default credentials which makes them easy to be hacked. You can find new network cameras using the http://Shadan.io . Get the API key through login and then you can use it on Linux using shodan terminal script. After that you can start brute forcing each IP on shadan search. Making a simple bash or python script will come handy.Operating Systems: By far the best things to be hacked because so much can be done. Data can be seen, pictures and videos can be taken, files can be opened, other malware can be downloaded on victims systems etc.. Metasploit is the tool to go for because it is easy to use and has a big database of exploits with usage.Web Applications: You may have heard about the news saying ‘something got hacked’ or seen defaced pages. They all are web application attacks. Many are there.. SQL Injections, XSS, CSRF, LFI, RFI etc.. There is a lot to learn here and the results are very instant if you’re able to exploit something. There are also many interrelated ‘tricks’ you can do to ‘expose’ a new vulnerability and exploit it. I’ve an old toolkit here which has some noob stuff to start with: Bhavesh Virus Maker SKW Please read the description before downloading!I don’t know if I should already say.. The first option above is type of Network attack.. Other network attack which is famous is DDoS attack where junk is sent to a server from many devices and amplified by sending to specific IP. Another network attack is hacking WiFi routers, bluetooth exploits etc.. Basics on hacking Hacking is broad term! Networks, web/mobile/desktop applications, kernel systems, hardware etc can be all hacked. All the hackers have to know the basics of what they do. Here are some tools you can use to hack specific system(s): Network Hacking: Wireshark, Ettercap, AngryIpScanner(ip scanning), Metasploit Framework etc.Privilege Escalation: Metsaploit, Armitage, NMap etc.Web Hacking: SQLMap, Metasploit Framework, Browser Exploitation Framework(beef), XSSTrike, BurpSuite etc etc..Reverse Engineering: OllyDbg, PEiD, Hiew, ILSpy(only windows) etc etc.There are a lot of more tools out there. Many are open source and free. If you payed attention, you must have seen Metapsloit mentioned most places except re. Hope this helps. ",
            "date": "Answered June 6, 2018",
            "views": "61",
            "upvotes": "0"
        }
    ]
}