{
    "title": "Did the ancient Mesopotamians look more like modern-day Mediterranean peoples than modern-day Arabs? - Quora",
    "tags": [
        "Ancient Mesopotamians",
        "Mediterranean People",
        "Mesopotamia"
    ],
    "response": [
        {
            "author_info": {
                "name": "Viktor Zalesak",
                "href": "/profile/Viktor-Zalesak"
            },
            "answer_text": "Neither of them, ancient Mesopotamia was home to several people and ancient civilizations such as the Assyrians, Syriacs / aramaics, Chaldeans, Sumerians, Hurrians, Akkadians, Elamites, Persians, Medes , Kurds, ancient Mesopotamia wasn’t a country but a region which consisted several states, kingdoms,, etc. It was located in modern day Syria , southeastern Turkey, modern day Iraq and Kuwait and Northweatern Iran. In fact the only people which were Mediterranean looking would be levantines as they were closer to the Mediterranean, however Mesopotamians ranged in appareance, some where tanned, olive skinned, many brown skinned, many of them even had light (white) skin such as the ancient Sumerians, who depicted themselves with even blue eyes (in fact blue eyes) even originated in northern Iraq . So many of them had light skin but also some of them were darker. Many Iraqis are of mixed descend and many Christians in Iraq are lighter skinned , or Kurds as they have less Arabian admixture. But ancient Mesopotamians themselves were NOT one race or people as they spoke several languages such Elamitic and Sumerian (which according to linguistic) isn’t related to Semitic languages. Akkadian, Aramaic, Assyrian, Chaldean is semitic, The Medes and Kurds spoke Indo-European languages such as the Hittites in modern day Turkey who wrote in cuneiform . Arabs moved in later from hejaz mainly after the 7th century (Islamic expansion), levantines such as Jews (Ashkenazim, sephardics, Mizraim) , Phoenican, Samaritans, Ugaritic people and Syriacs were light skinned but still due to their semitic roots closer to ancient Mesopotamian and levantine populations but also to the Mediterranean and it’s population. ",
            "date": "Updated September 5, 2020",
            "views": "907",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Benjamin Peterson",
                "href": "/profile/Benjamin-Peterson-2"
            },
            "answer_text": "The short answer would be ‘neither’. The long answer would involve pointing out that ‘Ancient Mesopotamia’ spans thousands of years, during which not only states but races and ethnicities rose, merged and vanished. The Sumerians were an ethnicity (not a state; states such as Ur were of Sumerian ethnicity) which was the earliest and perhaps most notable ancient mesopotamian ethnic group. They eventually merged with the completely unrelated Akkadians, who were also a major ancient Mesopotamian ethnic group. Akkadians spoke a Semitic language — the oldest Semitic language — which would suggest (insofar as language is a pretty good approximator of ethnicity) that they were more similar to Arabs or Jews than to Europeans. The Akkadians left some pretty advanced images of themselves which look vaguely Semitic if anything:  But that’s just the Akkadians. The Sumerian language itself was not related to any modern language group at all, and their images of themselves are quite consistent but don’t really remind me of any modern population:  Of course, if you look at more recent ancient Mesopotamia, you start to find more familiar groups, such as the Babylonians. It’s a bit misleading to say that the Babylonians were ‘like Arabs’, though — it’s more accurate to say that our modern impression of what the ‘Arab’ ethnicity is like has been influenced by the absorbtion of the Babylonians and many others into that identity. So, it’s a tricky one, but it’s certainly fair to say that Semitic languages dominated the area from the end of the dominance of the Sumerian language onwards, so by that measure, you’d have to say ancient Mesopotamia was mostly more Afro-Asiatic than Indo-European. ",
            "date": "Answered October 1, 2017",
            "views": "85",
            "upvotes": " View 29 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Alice Becket",
                    "user_href": "/profile/Alice-Becket-1"
                },
                {
                    "user_id": "Carlos Baez",
                    "user_href": "/profile/Carlos-Baez-94"
                },
                {
                    "user_id": "Harold Lebo",
                    "user_href": "/profile/Harold-Lebo-1"
                },
                {
                    "user_id": "A Johnson",
                    "user_href": "/profile/A-Johnson-18"
                },
                {
                    "user_id": "Braw Rasul",
                    "user_href": "/profile/Braw-Rasul"
                },
                {
                    "user_id": "Alex Rahbany",
                    "user_href": "/profile/Alex-Rahbany"
                },
                {
                    "user_id": "Kari Bradley",
                    "user_href": "/profile/Kari-Bradley-16"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/Drad-D-Vinotn"
                },
                {
                    "user_id": "Gabriel Freitas",
                    "user_href": "/profile/Gabriel-Freitas-15"
                },
                {
                    "user_id": "Ahmed Ammar",
                    "user_href": "/profile/Ahmed-Ammar-43"
                },
                {
                    "user_id": "Trevor White",
                    "user_href": "/profile/Trevor-White-68"
                },
                {
                    "user_id": "Silvia Elena",
                    "user_href": "/profile/Silvia-Elena-4"
                },
                {
                    "user_id": "Mandy Tran",
                    "user_href": "/profile/Mandy-Tran-2"
                },
                {
                    "user_id": "Jethro Beub",
                    "user_href": "/profile/Jethro-Beub"
                },
                {
                    "user_id": "Alan Tullio",
                    "user_href": "/profile/Alan-Tullio"
                },
                {
                    "user_id": "Leyla Babayev",
                    "user_href": "/profile/Leyla-Babayev"
                },
                {
                    "user_id": "Robert C Chenoweth",
                    "user_href": "/profile/Robert-C-Chenoweth"
                },
                {
                    "user_id": "José Pineda",
                    "user_href": "/profile/José-Pineda"
                },
                {
                    "user_id": "Advcal Mark",
                    "user_href": "/profile/Advcal-Mark"
                },
                {
                    "user_id": "Gwydion Madawc Williams",
                    "user_href": "/profile/Gwydion-Madawc-Williams"
                },
                {
                    "user_id": "Adriana Barcajova",
                    "user_href": "/profile/Adriana-Barcajova"
                },
                {
                    "user_id": "Joseph Bryant",
                    "user_href": "/profile/Joseph-Bryant-35"
                },
                {
                    "user_id": "Mohammad Hasan",
                    "user_href": "/profile/Mohammad-Hasan-416"
                },
                {
                    "user_id": "Dimitris Almyrantis",
                    "user_href": "/profile/Dimitris-Almyrantis"
                },
                {
                    "user_id": "Elspeth Cowie",
                    "user_href": "/profile/Elspeth-Cowie"
                },
                {
                    "user_id": "Yassine Daoudi",
                    "user_href": "/profile/Yassine-Daoudi"
                },
                {
                    "user_id": "Jonathan Shaltz",
                    "user_href": "/profile/Jonathan-Shaltz-1"
                },
                {
                    "user_id": "Daan Peranovic",
                    "user_href": "/profile/Daan-Peranovic"
                },
                {
                    "user_id": "Michael Williams",
                    "user_href": "/profile/Michael-Williams-553"
                }
            ]
        },
        {
            "author_info": {
                "name": "Kimberly Keith",
                "href": "/profile/Kimberly-Keith-10"
            },
            "answer_text": "Arab is a nationality, not an ethnic or racial group. Why? There are Caucasian Arabs, there are African Negro Arabs, there are Asiatic Arabs etc. The term “Arab,” is like the term “American.” Ancient Mesopotamians included Africans and Asians, some of whom were the elites in society. There are so many different ethnicities, I would not group them all in one, with the term “Arab.” For example, Lebanese people are not the same ethnic group as Saudi Arabians, but they both speak Arabic. Also, I do not believe that ancient Mesopotamians look more like modern day Mediterranean peoples. You also did not include a time period, which is pivotal, due to Imperialism and conquests in both regions. You need a time period in order to identify them better. Ancient is a broad term. ",
            "date": "Answered May 14, 2018",
            "views": "25",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/Baske-1"
                },
                {
                    "user_id": "Melissa Wickersham",
                    "user_href": "/profile/Melissa-Wickersham-3"
                }
            ]
        },
        {
            "author_info": {
                "name": "Walter Smyth",
                "href": "/profile/Walter-Smyth"
            },
            "answer_text": "Arabs are not a race or ethnicity. Modern day Arabs of the Middle East, especially those in the Arabian Peninsula, are very mixed through massive migration because of the discovery of oil and recent slavery. Ancient Mesopotamians would have looked like modern day Assyrians, Chaldeans who are the ancient peoples of Mesopotamia. Assyrian people - Wikipedia Chaldea - Wikipedia Ancient Mesopotamian people would have looked like this:   Ancient Assyrians: Assyrians during the early Christian period:  King Jehu of Israel bowing to the Assyrians after they conquered Israel:   Ancient art from Ur of the Chaldeans:  ",
            "date": "Answered October 6, 2017",
            "views": "61",
            "upvotes": " View 26 Upvoters",
            "upvoters": [
                {
                    "user_id": "Braw Rasul",
                    "user_href": "/profile/Braw-Rasul"
                },
                {
                    "user_id": "Taylor Smith",
                    "user_href": "/profile/Taylor-Smith-420"
                },
                {
                    "user_id": "Orem Frien",
                    "user_href": "/profile/Orem-Frien"
                },
                {
                    "user_id": "Gabriel Freitas",
                    "user_href": "/profile/Gabriel-Freitas-15"
                },
                {
                    "user_id": "E. Groeg",
                    "user_href": "/profile/E-Groeg"
                },
                {
                    "user_id": "Mandy Tran",
                    "user_href": "/profile/Mandy-Tran-2"
                },
                {
                    "user_id": "Sol Güdguy",
                    "user_href": "/profile/Sol-Güdguy"
                },
                {
                    "user_id": "Yash Gaikwad",
                    "user_href": "/profile/Yash-Gaikwad-40"
                },
                {
                    "user_id": "Utkarsh Rai",
                    "user_href": "/profile/Utkarsh-Rai-26"
                },
                {
                    "user_id": "Melissa Wickersham",
                    "user_href": "/profile/Melissa-Wickersham-3"
                },
                {
                    "user_id": "Tri Rumekso Anggie Wibowo",
                    "user_href": "/profile/Tri-Rumekso-Anggie-Wibowo-1"
                },
                {
                    "user_id": "David Zarzar",
                    "user_href": "/profile/David-Zarzar"
                },
                {
                    "user_id": "Abdigani Sugal",
                    "user_href": "/profile/Abdigani-Sugal"
                },
                {
                    "user_id": "Reza Shirazi",
                    "user_href": "/profile/Reza-Shirazi-4"
                },
                {
                    "user_id": "Joseph Bryant",
                    "user_href": "/profile/Joseph-Bryant-35"
                },
                {
                    "user_id": "Phillip Arieff",
                    "user_href": "/profile/Phillip-Arieff"
                },
                {
                    "user_id": "Yeshayahu Cohen",
                    "user_href": "/profile/Yeshayahu-Cohen"
                },
                {
                    "user_id": "Faye Pichard",
                    "user_href": "/profile/Faye-Pichard"
                },
                {
                    "user_id": "Stanley Quint",
                    "user_href": "/profile/Stanley-Quint"
                },
                {
                    "user_id": "Joe Abasa",
                    "user_href": "/profile/Joe-Abasa"
                },
                {
                    "user_id": "Peter Zaper",
                    "user_href": "/profile/Peter-Zaper"
                },
                {
                    "user_id": "Ygor Coelho",
                    "user_href": "/profile/Ygor-Coelho"
                },
                {
                    "user_id": "Mikhail Faustin",
                    "user_href": "/profile/Mikhail-Faustin-1"
                },
                {
                    "user_id": "Steve Theodore",
                    "user_href": "/profile/Steve-Theodore"
                },
                {
                    "user_id": "Hatim Ghadhban Abood",
                    "user_href": "/profile/Hatim-Ghadhban-Abood"
                },
                {
                    "user_id": "James Berthold",
                    "user_href": "/profile/James-Berthold"
                }
            ]
        },
        {
            "author_info": {
                "name": "Joseph Bryant",
                "href": "/profile/Joseph-Bryant-35"
            },
            "answer_text": "I would not answer this, as it is a question for me as well, however, when you refer to “mediterranean” people, you should consider that they are very very diverse, these days and in fact for ever. If you look at the Mediterranean Sea and then around it’s shores, you see countries like Syria, Turkey, Lebanon, Israel, Egypt, Libia, Algeria, Tunisia, Morrocco, Spain, France, Italy, Croatia, Albania, Grece. Which one of those are you refering to, as they are quite different looking people, with different genetic heritage? The so called “mediterranean” genes seem to be the Y-Dna E1B1B found in southern Europe, West side of Middle East and Northern Africa. Usually the facial features follow the genetic heritage, so you may want to have a look at the maps showing Y-Dna and MtDna distribution in Europe, as an example: Maps of Y-DNA haplogroups in and around Europe Maps of mtDNA haplogroups in and around Europe ",
            "date": "Answered April 25, 2018",
            "views": "3",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Sol Güdguy",
                    "user_href": "/profile/Sol-Güdguy"
                }
            ]
        },
        {
            "author_info": {
                "name": "Jan Olsen",
                "href": "/profile/Jan-Olsen-5"
            },
            "answer_text": "Arabs are not representatives of how any ancient people looked like. I would say that the Mesopotamians looked more like any other ‘race’ on the earth than the Arabs. Even though the Chinese think they are the oldest people, a lot older species has been found in Africa. But. they did not look like any modern Africans. We have all got traces in our DNA from early homo ‘something’. But, that was way before Mesopotamia. I guess if you have got a scull, modern technologi could recreate how the different ancient people looked like. ",
            "date": "Answered April 12, 2020",
            "views": "599",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Braw Rasul",
                    "user_href": "/profile/Braw-Rasul"
                }
            ]
        }
    ]
}