{
    "title": "Do 'tech people' hate Bill Gates? - Quora",
    "tags": [
        "Bill Gates"
    ],
    "response": [
        {
            "author_info": {
                "name": "John Cate",
                "href": "/profile/John-Cate-2"
            },
            "answer_text": "I've been building my own computers for 17 years, along with building and fixing them for others. I don't know if that qualifies me as a \"tech\" person or not. You can decide that. Anyway, I don't hate Bill Gates. I use a smartphone made by his company, and I've installed and run Windows on more computers than I could ever count. (I'm a Linux user at home, but not because I hate Bill Gates; I just think it's a better OS than Windows 10.) I think Bill Gates is a very good businessman, who also happened to have a lot of technical knowledge, and he leveraged that combination to make his fledgling company, Micro-Soft, into a technical giant right when the personal computer industry took off in the early 1980s. You can call the man ruthless, you can say he killed off technologies that could have progressed into something better than what he was offering, and you can dislike that he had a de facto monopoly on the industry for years (although I would argue that those days are long over). But that's just good business, just capitalism at work. Bill Gates may have not had the best software all of the time, but he was smarter than everyone else at the things that mattered. I actually respect the man a great deal, because he's the richest man in the world and is using his money to try to help others. Whether you like his business practices or not, he played an enormous role in bringing PC's to the masses, and the money he made doing this is now being used to make the world a better place in other ways. Only dogmatic ideologues hate Bill Gates. ",
            "date": "Answered May 3, 2016",
            "views": "13",
            "upvotes": " View 8 Upvoters",
            "upvoters": [
                {
                    "user_id": "Vanessa L. Yan",
                    "user_href": "/profile/Vanessa-L-Yan"
                },
                {
                    "user_id": "Mark Owsiany",
                    "user_href": "/profile/Mark-Owsiany"
                },
                {
                    "user_id": " Prasad",
                    "user_href": "/profile/Prasad-746"
                },
                {
                    "user_id": "Christophe Samuel",
                    "user_href": "/profile/Christophe-Samuel"
                },
                {
                    "user_id": "Bernardo Marcial",
                    "user_href": "/profile/Bernardo-Marcial"
                },
                {
                    "user_id": "Bin Jack",
                    "user_href": "/profile/Bin-Jack"
                },
                {
                    "user_id": "Rajeev Singh",
                    "user_href": "/profile/Rajeev-Singh-128"
                },
                {
                    "user_id": "Narayana",
                    "user_href": "/profile/Narayana-29"
                }
            ]
        },
        {
            "author_info": {
                "name": "Neel Kumar",
                "href": "/profile/Neel-Kumar"
            },
            "answer_text": "I guess I \"hate\" Bill Gates to some extent.  His business policies hobbled the adoption of Linux for many years.MS OSes, for the longest time, had more security holes than shotgunned swiss cheese.Internet Explorer sucked for the longest possible time.  Bill bought the entire market segment by giving away IE but once adoption reached 90%, there was no need to fix even the stupidest of security holes (ActiveX, WTF?)Excel and Word are pretty good products but there is no effort to make them faster than a pregnant Yak on the latest CPUs.  That is SUCKY!After years of battling shitty OS and of course crapware loaded by vendors, I abandoned the MS world completely and went back to Mac.  Yes, I have problems with Steve Jobs' walled garden as well but at least things are far more intuitive.But what I hate is not that Bill is a douchebag (he sure is to some extent but no one gets to be a CEO without some douche in him/her) but that he could have had mind-blowing awesome products and he took a pass on that aspect.  IE, with its 95% adoption rate, could have made HTML wonderful but didn't.  Word and Excel could have been out of this world but no.  Windows XP could have had a few iterations where security got progressively better, but nah, we are going to make a whole new OS. Of course, Bill's post-MS career is to be lauded for its audacity and for its vision.  Bravo! ",
            "date": "Answered March 1, 2015",
            "views": "22",
            "upvotes": " View 6 Upvoters",
            "upvoters": [
                {
                    "user_id": "Vanessa L. Yan",
                    "user_href": "/profile/Vanessa-L-Yan"
                },
                {
                    "user_id": "Utkarsh Mishra",
                    "user_href": "/profile/Utkarsh-Mishra-38"
                },
                {
                    "user_id": "Bin Jack",
                    "user_href": "/profile/Bin-Jack"
                },
                {
                    "user_id": "Linchuan Zhang",
                    "user_href": "/profile/Linchuan-Zhang"
                },
                {
                    "user_id": "Leigh Christie",
                    "user_href": "/profile/Leigh-Christie"
                },
                {
                    "user_id": "Benjamin Richy",
                    "user_href": "/profile/Benjamin-Richy"
                }
            ]
        },
        {
            "author_info": {
                "name": "S. Patrick Maiorca",
                "href": "/profile/S-Patrick-Maiorca"
            },
            "answer_text": "yes a lot of us do as we think he is an overrated billonair who got his fortune due to luck. Microsoft's biggest break was the IBM contract. Their first choice was Digital Reserch's CP/M   . Negotiations broke down between IBM and D.R's CEO Gary Kildall. Legend has it he just skipped the meeting to fly his plane. Then when Microsoft got their chance they didn't sell IBM an operating system that was better than CPM they sold them a clone of CPM. Some go as far to say it was stolen.    The Man Who Could Have Been Bill Gates Who Made America? | Innovators | Gary Kildall Was Microsoft’s Empire Built on Stolen Code? We May Never Know     ",
            "date": "Answered March 31, 2016",
            "views": "606",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Nikita Sharma",
                    "user_href": "/profile/Nikita-Sharma-53"
                }
            ]
        }
    ]
}