{
    "title": "Do Apple and certain Samsung devices have non-removeable batteries as a means of planned obsolescence? - Quora",
    "tags": [
        "Samsung Devices",
        "Smartphone Batteries",
        "Batteries",
        "Apple (company)",
        "iPhones (product)"
    ],
    "response": [
        {
            "author_info": {
                "name": "Michael Vogel",
                "href": "/profile/Michael-Vogel-5"
            },
            "answer_text": "No, and claims of any planned obsolescence in smartphones is absolutely ridiculous. Apple products far outlast their competitors and they hold their resale value so well that Apple has started buying them back and reselling them. If Apple has any kind of planned obsolescence, they are terrible at it. Not just terribly, utterly failing. There are still functional iPhone 4’s out there, which came out in 2010. Most iPhones ever made are still in use to this day. Think about that. The reasons for non-removable batteries are quite simple and not at all sinister: it’s hard to engineer a removable battery without adding additional bulk to the phone. By making the battery non-removable, you can better use all available space for batteries and it doesn’t need a separate enclosure to hold it in. It’s easier to make products water and dust resistant as well. Finally, in spite of all the moaning and crying that tech people do about removable batteries and expansion slots, the bottom line is that most people never replace their batteries or expand their phones when the option does exist. Look at the Samsung Galaxy S6, which didn’t have either feature and the press[1] and thousands of fans swearing that Samsung had lost them as customers. Guess what happened? The Galaxy S6 outsold the S5 by far and revived Samsung’s fortunes in the smartphone market. Bottom line is, while the very vocal and technical people want these features, the average consumer doesn’t, even if they say they do. You ask a customer if they prefer a user replaceable battery and they will likely say yes. Find out how many phones with user replaceable batteries actually got replaced by the user and the number is so small as to be negligible. Companies don’t make products for their fans; they make products for their customers and the two are usually not the same. Finally, if you’re looking for sinister plots, take a look at a company’s financials and see where they make their money. Neither Apple or Samsung makes enough money on repairs to even move the needle on the financials (repairs cost more because you lose the economies of scale that you get at factories and have to pay skilled workers on location). To dramatically change their product that in no way helps their bottom line makes no sense. And since these phones tend to outlive their life expectancy, if they are using planned obsolescence, they’re doing a terrible job. Finally, keep in mind that the original iPhone didn’t have a replaceable battery and Apple has never made an iPhone where you could replace the battery yourself. Samsung saw the advantages and saw that Apple was doing it without losing customers and followed suit, as did many other smartphone makers. Footnotes[1] The Samsung Galaxy S6 just killed two of my favorite Android features",
            "date": "Answered August 22, 2016",
            "views": "943",
            "upvotes": " View 11 Upvoters",
            "upvoters": [
                {
                    "user_id": "Gaurav Tailor",
                    "user_href": "/profile/Gaurav-Tailor"
                },
                {
                    "user_id": "Razeen Hossain",
                    "user_href": "/profile/Razeen-Hossain"
                },
                {
                    "user_id": "Vladislav Zorov",
                    "user_href": "/profile/Vladislav-Zorov"
                },
                {
                    "user_id": "Michael Barnard",
                    "user_href": "/profile/Michael-Barnard-14"
                },
                {
                    "user_id": "Mats Lindholm",
                    "user_href": "/profile/Mats-Lindholm-1"
                },
                {
                    "user_id": "Chuck Rogers",
                    "user_href": "/profile/Chuck-Rogers-1"
                },
                {
                    "user_id": "Joshua Engel",
                    "user_href": "/profile/Joshua-Engel"
                },
                {
                    "user_id": "Karthik Iyer",
                    "user_href": "/profile/Karthik-Iyer-88"
                },
                {
                    "user_id": "Cole Johnson",
                    "user_href": "/profile/Cole-Johnson-13"
                },
                {
                    "user_id": "Lexa Michaelides",
                    "user_href": "/profile/Lexa-Michaelides"
                },
                {
                    "user_id": "Stan Hanks",
                    "user_href": "/profile/Stan-Hanks"
                }
            ]
        },
        {
            "author_info": {
                "name": "Stan Hanks",
                "href": "/profile/Stan-Hanks"
            },
            "answer_text": "OK, let’s think about this: phones are a personal device, and for the vast majority of users, they buy their phones new. A modern litium ion battery has an expected life of at least 1000 cycles. That’s complete charge to complete zero. 1000 times. If you do that every day, your phone is going to last two years and nine months (roughly). Nearly three years. If you’re like most people and run your phone down to 30–50% every day, it’s more. So, you’re likely looking at about five years of useful life in the normative situation. How likely are you to actually WANT to be using the phone you have in your hand right now, five years from now? Think there might be something better? Faster? Bigger screen? Small screen with more pixels? Faster CPU? Massively more storage? Any of that resonate with you? I know personally there’s zero chance I’m going to be rocking my current phone five years from now. Software bloat on the apps alone insures that I’ll be looking for more cycles and storage long before that point hits. So to me, I’ll NEVER hit that cliff. It’s a non-issue. Even for the person buying a used phone, it’s a low-probability event. You’re probably going to buy something that’s a year or so old, meaning that you’ll have three years or so in which to use it without issue. And if you’re a person buying a much older phone, you’re probably NOT the kind of person who’s actually using apps that eat power. You’re probably, you know, making voice calls and sending text messages. Phone stuff. Not app stuff. ",
            "date": "Answered August 22, 2016",
            "views": "12",
            "upvotes": " View 22 Upvoters",
            "upvoters": [
                {
                    "user_id": "Erik Fair",
                    "user_href": "/profile/Erik-Fair"
                },
                {
                    "user_id": "Gaurav Tailor",
                    "user_href": "/profile/Gaurav-Tailor"
                },
                {
                    "user_id": "Sankaranarayanan Iyer",
                    "user_href": "/profile/Sankaranarayanan-Iyer-1"
                },
                {
                    "user_id": "Karen Marie Shelton",
                    "user_href": "/profile/Karen-Marie-Shelton"
                },
                {
                    "user_id": "Razeen Hossain",
                    "user_href": "/profile/Razeen-Hossain"
                },
                {
                    "user_id": "Shane Ryoo",
                    "user_href": "/profile/Shane-Ryoo"
                },
                {
                    "user_id": "Abir Chawla",
                    "user_href": "/profile/Abir-Chawla"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/Kess-Efski"
                },
                {
                    "user_id": "Brady Sheehan",
                    "user_href": "/profile/Brady-Sheehan-1"
                },
                {
                    "user_id": "Larry Dixon",
                    "user_href": "/profile/Larry-Dixon-1"
                },
                {
                    "user_id": "Krunal Varshikar",
                    "user_href": "/profile/Krunal-Varshikar"
                },
                {
                    "user_id": "Chuck Rogers",
                    "user_href": "/profile/Chuck-Rogers-1"
                },
                {
                    "user_id": "Massih Swift",
                    "user_href": "/profile/Massih-Swift"
                },
                {
                    "user_id": "Paul Cohn",
                    "user_href": "/profile/Paul-Cohn"
                },
                {
                    "user_id": "Shakil Sami",
                    "user_href": "/profile/Shakil-Sami"
                },
                {
                    "user_id": "Aaron Schoots",
                    "user_href": "/profile/Aaron-Schoots"
                },
                {
                    "user_id": "Calvin Chik",
                    "user_href": "/profile/Calvin-Chik"
                },
                {
                    "user_id": "Johnny Zavala",
                    "user_href": "/profile/Johnny-Zavala"
                },
                {
                    "user_id": "Michael Facey",
                    "user_href": "/profile/Michael-Facey-3"
                },
                {
                    "user_id": "Farzad Vazirnia",
                    "user_href": "/profile/Farzad-Vazirnia"
                },
                {
                    "user_id": "Archie D’Cruz",
                    "user_href": "/profile/Archie-D’Cruz"
                },
                {
                    "user_id": "Alfonso Rodríguez",
                    "user_href": "/profile/Alfonso-Rodríguez-5"
                }
            ]
        },
        {
            "author_info": {
                "name": "Glyn Williams",
                "href": "/profile/Glyn-Williams"
            },
            "answer_text": "No. Of the 1.4 billion iOS devices made. Some 0.9 billion are still in active use. If Apple had planned obsolesence, the plan is not working. Non-removable batteries are better for consumers. The design result in less fragile devices and means larger batteries can be used. For most users, the lithium ion batteries last for the full lifetime of the product. Removable batteries encourage third party products which are often low quality or damage the device. ",
            "date": "Answered August 22, 2016",
            "views": "11",
            "upvotes": " View 23 Upvoters",
            "upvoters": [
                {
                    "user_id": "Michael Vogel",
                    "user_href": "/profile/Michael-Vogel-5"
                },
                {
                    "user_id": "Gaurav Tailor",
                    "user_href": "/profile/Gaurav-Tailor"
                },
                {
                    "user_id": "Sitki Cagdas Inam",
                    "user_href": "/profile/Sitki-Cagdas-Inam"
                },
                {
                    "user_id": "Trausti Thor Johannsson",
                    "user_href": "/profile/Trausti-Thor-Johannsson"
                },
                {
                    "user_id": "Shane Ryoo",
                    "user_href": "/profile/Shane-Ryoo"
                },
                {
                    "user_id": "Razeen Hossain",
                    "user_href": "/profile/Razeen-Hossain"
                },
                {
                    "user_id": "Ayman Shahbad",
                    "user_href": "/profile/Ayman-Shahbad"
                },
                {
                    "user_id": "Sachin Soni",
                    "user_href": "/profile/Sachin-Soni-27"
                },
                {
                    "user_id": "Michael Barnard",
                    "user_href": "/profile/Michael-Barnard-14"
                },
                {
                    "user_id": "Chuck Rogers",
                    "user_href": "/profile/Chuck-Rogers-1"
                },
                {
                    "user_id": "Sam William",
                    "user_href": "/profile/Sam-William-1"
                },
                {
                    "user_id": "Joshua Engel",
                    "user_href": "/profile/Joshua-Engel"
                },
                {
                    "user_id": "Lim Zhenghong",
                    "user_href": "/profile/Lim-Zhenghong"
                },
                {
                    "user_id": "Sina Taghva",
                    "user_href": "/profile/Sina-Taghva"
                },
                {
                    "user_id": "Sherwin Xiang",
                    "user_href": "/profile/Sherwin-Xiang"
                },
                {
                    "user_id": "Stan Hanks",
                    "user_href": "/profile/Stan-Hanks"
                },
                {
                    "user_id": "Michael MacCallum",
                    "user_href": "/profile/Michael-MacCallum-1"
                },
                {
                    "user_id": "Soumendu Majee",
                    "user_href": "/profile/সৌমেন্দু-মাজী-Soumendu-Majee"
                },
                {
                    "user_id": "Sameer Gupta",
                    "user_href": "/profile/Sameer-Gupta"
                },
                {
                    "user_id": "Avi",
                    "user_href": "/profile/Avi-655"
                },
                {
                    "user_id": "Sam Parker",
                    "user_href": "/profile/Sam-Parker-416"
                },
                {
                    "user_id": "Mariano Olivea Fedi",
                    "user_href": "/profile/Mariano-Olivea-Fedi"
                },
                {
                    "user_id": "Oscar Bouwmans",
                    "user_href": "/profile/Oscar-Bouwmans"
                }
            ]
        },
        {
            "author_info": {
                "name": "Malcolm Teas",
                "href": "/profile/Malcolm-Teas"
            },
            "answer_text": "Nope. Batteries these days are designed and built to be used for very many charge-discharge cycles so user-replicable batteries aren’t needed for the life of a phone. If you have to design a phone for a replaceable battery, then you have to design a good and reliable way to remove the cover and battery, and to replace them. Given the number of Android phones with replaceable batteries with poor quality or broken covers, this isn’t an easy thing to do well. It’s easier (cheaper and more reliable) to design a phone with a non-user removable battery. ",
            "date": "Answered October 29, 2016",
            "views": "294",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Praveen Kumar",
                    "user_href": "/profile/Praveen-Kumar-5837"
                },
                {
                    "user_id": "Ravi Nallappan",
                    "user_href": "/profile/Ravi-Nallappan"
                }
            ]
        },
        {
            "author_info": {
                "name": "Mel Burslan",
                "href": "/profile/Mel-Burslan"
            },
            "answer_text": "If your Samsung phone is a prominent model like s5/s6/s7, I am pretty sure there already are aftermarket spare parts for them. I have successfully purchased batteries for almost all of my cell phones which I used more than 2 years, on Amazon & eBay, for less than 10 bucks. Planned obsolescence by non-removable battery ? Naaaah… I don’t think so. Your applications’ CPU demand will be the driving force for you to replace that phone before the price of battery replacement getting too high, in m y opinion. ",
            "date": "Answered August 22, 2016",
            "views": "147",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Gaurav Tailor",
                    "user_href": "/profile/Gaurav-Tailor"
                },
                {
                    "user_id": "Stan Hanks",
                    "user_href": "/profile/Stan-Hanks"
                }
            ]
        },
        {
            "author_info": {
                "name": "Klaus Schneider",
                "href": "/profile/Klaus-Schneider-4"
            },
            "answer_text": "I do believe so. I’m personally not comfortable with non-removable batteries because they make replacing battery more difficult than removable battery. A device may be needed right now to fulfill everyday tasks. And shops aren’t open all the time - at least in Germany where almost no shops work at sundays and some holidays. And what about poor people? Even in such rich country as Germany poverty is common - and there are lots of poorer countries too. ",
            "date": "Answered August 22, 2016",
            "views": "32",
            "upvotes": "0"
        }
    ]
}