{
    "title": "Do cell phone 'Brain Training' games really improve brain function? - Quora",
    "tags": [
        "Brain Games",
        "Brain Training",
        "Human Memory",
        "Human Brain",
        "Neuroscience",
        "Self-Improvement"
    ],
    "response": [
        {
            "author_info": {
                "name": "Brian White",
                "href": "/profile/Brian-White-722"
            },
            "answer_text": "Brain training games do not improve intelligence. We have, so far, not found any practical means of boosting intelligence. See Haier, R. J. (2017). The Neuroscience of Intelligence, Cambridge University Press for a full discussion. Some businesses have marketed brain training games with the claim that they improve mental performance. Lumosity is one example of a game that was sold for this purpose. The FTC's alleged that Lumos Ads misled customers with false or deceptive advertising, and that the company had failed to disclose that many of its testimonials had been solicited as part of a contest that offered winners prizes such as iPads, lifetime subscriptions to Lumosity, or a free trip to San Francisco. As part of the settlement, Lumos Labs agreed to pay the FTC $50 million but a district court suspended all but $2 million of that amount because the company couldn’t actually afford it. ",
            "date": "Answered April 24, 2020",
            "views": "87",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Rakesh Debnath",
                    "user_href": "/profile/Rakesh-Debnath-96"
                }
            ]
        },
        {
            "author_info": {
                "name": "Vashi Chandi",
                "href": "/profile/Vashi-Chandi"
            },
            "answer_text": "Let’s look at it from another angle-the point being of not over relying upon only the games by themselves to stimulate, but also to review the overall sets of practices that one’s self is usually observing. Since if there is far too much of something-then there is an imbalance of sorts that is ensuing. That is why, rather than over expecting-first learn to earnestly accept the actuality/reality of what’s already being and how that could be further strengthened ever more remarkably………for then from that/those gradual sets of self awareness will emerge far more unique sets of insights to appropriate identify ever more commendable ways to meritoriously evolve. ",
            "date": "Answered April 22, 2020",
            "views": "32",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Roksana Parvin Yasmin",
                    "user_href": "/profile/Roksana-Parvin-Yasmin"
                }
            ]
        },
        {
            "author_info": {
                "name": "Sohail Ahmed",
                "href": "/profile/Sohail-Ahmed-7"
            },
            "answer_text": "Thanks RKS for A2A. In a crude way, I think it may improve brain efficiency. These brain exercises draw more blood and in the process nutrients and oxygen is brought to the active brain areas. In addition, pathways that otherwise impede signals get partially cleared of garbage and toxins. I personally do not these games but have seen a few on internet. I have my own ways to achieve the above objectives through recitation and memorization of verses. These are very helpful for me. Despite ‘sagging intelligence’ I am trying to retain a satisfactory level. Thanks for reading. ",
            "date": "Answered April 24, 2020",
            "views": "43",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Rakesh Debnath",
                    "user_href": "/profile/Rakesh-Debnath-96"
                }
            ]
        },
        {
            "author_info": {
                "name": "Aleksandr Golovatyi",
                "href": "/profile/Aleksandr-Golovatyi"
            },
            "answer_text": "they improve only your game flow for the special game, that’s why I cancel my Lumosity subscription and start to develop own brain training exesisers ",
            "date": "Answered March 5, 2019",
            "views": "31",
            "upvotes": " Answer requested by Rakesh Debnath and Patrika Cheston"
        },
        {
            "author_info": {
                "name": "Giorgi Giorgi",
                "href": "/profile/Giorgi-Giorgi-35"
            },
            "answer_text": "There is a website Lumosity which offers users some games for improving attention and other cognitive functions. But U think chess is the best for that purpose. ",
            "date": "Answered April 22, 2020",
            "views": "28",
            "upvotes": "0"
        }
    ]
}