{
    "title": "Do cell phones emit radiation when using WiFi? - Quora",
    "tags": [
        "Cell Phone Radiation",
        "Electromagnetic Radiation",
        "Radiation",
        "Wireless Technology",
        "Cellular Service Providers",
        "Wi-Fi",
        "Mobile Technology",
        "Technology"
    ],
    "response": [
        {
            "author_info": {
                "name": "Dennis Eichenlaub",
                "href": "/profile/Dennis-Eichenlaub"
            },
            "answer_text": "Yes. The emit the same radiation as any other WiFi router, computer, or other device. If the phone is configured to automatically connect to some WiFi networks, the phone emits WiFi radiation even when not using WiFi, so it tell if there is a network to connect. In addition cell phones also continuously transmit on the cellular network, The cellular network has to know where all phones are at all times, so if you get a call they can rout the call to the best tower. Our best experts believe there is no danger from these transmissions. Of course, anybody can point out many times where experts were wrong in the past. I’m not concerned, but if you are, here’s what you need to know. The energy your body sees goes down as the square of the distance. If the distance doubles, the energy goes down by 4. If the distance increases by 4, the energy goes down by 16. If you keep your cell phone next to your bed, you will be exposed the entire time you are sleeping. People who are concerned are often most concerned by radiation to their brain. I’m not, because I think the energy is low and my skull blocks most of that. But if you are, holding the phone to your ear exposes your brain much more than using ear buds. Here’s some things to be more concerned about. A microwave oven pumps out huge amounts of power (probably a million times more power than your phone). This power is very close to the 2.4 GHz WiFi frequency band, and it is purposely chosen to do the best job of heating water. Keep your microwave seals clean and supple. Don’t lean your forehead against the microwave door watching your food cook. Keeping phones in the bedroom is a proven health hazard if you get into the habit of texting and emailing while in bed. This causes sleep deprivation which is known to be a long term health problem. I put my phone in another room and use my time in bed for sleeping. ",
            "date": "Answered April 9, 2020",
            "views": "461",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Dave Voorhis",
                "href": "/profile/Dave-Voorhis"
            },
            "answer_text": "Cell phones using WiFi emit low-energy electromagnetic waves in the microwave region, typically 2.4 or 5 gigahertz. They’re roughly as powerful as a dim light bulb, which emits low-energy electromagnetic waves in the visible light region, typically around 430 to 770 terahertz. They’re both harmless. ",
            "date": "Answered April 9, 2020",
            "views": "446",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Jonathan Elder",
                    "user_href": "/profile/Jonathan-Elder"
                },
                {
                    "user_id": "Roger Fentiman",
                    "user_href": "/profile/Roger-Fentiman"
                },
                {
                    "user_id": "Asil Acar",
                    "user_href": "/profile/Asil-Acar"
                },
                {
                    "user_id": "Moray Taylor",
                    "user_href": "/profile/Moray-Taylor"
                }
            ]
        }
    ]
}