{
    "title": "Do HP printers come with ink? - Quora",
    "tags": [
        "Inkjet Printers",
        "Ink Cartridges",
        "HP Printers",
        "Ink",
        "Hewlett-Packard (company)"
    ],
    "response": [
        {
            "author_info": {
                "name": "Ace Haskill",
                "href": "/profile/Ace-Haskill"
            },
            "answer_text": "I recently purchased an HP ENVY Photo 7155 and it came with ink. 1 Black cartridge and 1 Tri-color cartridge. Since I had been told that the ink cartridges that come with HP printers and others are really just sample type cartridges and not full, I went ahead and purchased more HP ink at the same time I bought my printer. To my surprise the ink cartridges that came with my HP lasted a long while leading me to believe that they were full cartridges after all. So yes most HP printers come with ink. Just in case always read what comes in the box before you purchase…. Hope this helps. ",
            "date": "Answered October 21, 2019",
            "views": "21",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "David Sandoz",
                    "user_href": "/profile/David-Sandoz-1"
                },
                {
                    "user_id": "Mike Rogan",
                    "user_href": "/profile/Mike-Rogan-11"
                }
            ]
        },
        {
            "author_info": {
                "name": "Bill Wright",
                "href": "/profile/Bill-Wright-6"
            },
            "answer_text": "Over the years, I’ve purchased a fair number of HP printers. All were solid machines, major reason for the purchase…I needed different features or I did something goofy and broke the thing. Each one came with a low-volume cartridge or cartridge set; this included both laser and InkJet. Two final points: Off-brand cartridges for HP are not worth the headaches they cause.The HP cartridge subscription program is worth investigating…convenience and the cartridges are larger capacity than the XL commonly available.",
            "date": "Answered October 26, 2019",
            "views": "14",
            "upvotes": " View 2 Upvoters ",
            "upvoters": [
                {
                    "user_id": "David Sandoz",
                    "user_href": "/profile/David-Sandoz-1"
                },
                {
                    "user_id": "Heather Pierson",
                    "user_href": "/profile/Heather-Pierson-2"
                }
            ]
        },
        {
            "author_info": {
                "name": "Mark Carbaugh",
                "href": "/profile/Mark-Carbaugh"
            },
            "answer_text": "HP printers come with “starter cartridges”. How long they actually last depends on your printing needs and habits. As a rule of thumb, they generally will last for 400 to 600 impressions, again depending upon what you print. You then have your choice of regular quantity cartridges or XL cartridges. The XL size gives you just under twice the amount of ink and is a significant savings. Print ON! ",
            "date": "Answered October 21, 2019",
            "views": "28",
            "upvotes": " Answer requested by Sun Zumwalt"
        },
        {
            "author_info": {
                "name": "Jim Lyons",
                "href": "/profile/Jim-Lyons"
            },
            "answer_text": "Yes, but not always a normal-sized cartridge, i.e. a starter cartridge. That’s how it used to be anyway. ",
            "date": "Answered October 29, 2019",
            "views": "432",
            "upvotes": " Answer requested by Sun Zumwalt"
        }
    ]
}