{
    "title": "Do I have a condition if I remember numbers, say 9411380505 as 4911830505, after given maybe 3 seconds to remember it? Do I have dyslexia or memory skips or something else? I am 26 years old and have an honours degree in economics. - Quora",
    "tags": [
        "Photographic Memory",
        "Amnesia",
        "Dyslexia",
        "Learning Disabilities",
        "Forgetting",
        "Memory (information storage)",
        "Human Memory",
        "Human Brain",
        "Neuroscience"
    ],
    "response": [
        {
            "author_info": {
                "name": "Leon Hulett",
                "href": "/profile/Leon-Hulett"
            },
            "answer_text": "A2A: “Do I have a condition if I remember numbers, say 9411380505 as 4911830505, after given maybe 3 seconds to remember it? Do I have dyslexia or memory skips or something else? I am 26 years old and have an honours degree in economics.” I would not start off by assuming this is something that can not be fixed. Let’s assume you want this, and this can be done. When I was in 7th Grade I was making a little money and I began to buy books that I chose to buy. One of the first books I bought was, “Rapid Reading - Made Simple.” I kind of worked my way through that book. One of the things it talked about was this idea of looking at a number and then recalling it, then using larger and larger numbers. That idea, or that skill, was supposed to help one learn how to read faster, by being able to confidently recall larger and larger, arbitrary numbers like that. I don’t think that is true. I don’t have that standard for myself. But let’s assume you do want to have that ability, to recall arbitrary 10 digit numbers. These days that might be phone a number or a pass code or something. So, here are 4 ideas, 4 examples, that might give you that ability. As a tutor I would just work with you to help you attain a study goal you have - to acquire such an ability. I wanted to teach some students some abilities. Actually, these were parents, parents that wanted to teach their children how to acquire abilities. I first defined the word ability so they could use it to acquire an ability. I found an odd thing. Here is the definition of ability, see if you notice it too. The word ability means the quality of being able to do something. This is a completed thing. This describes something at a point in time when it has already been learned, it does not say how to acquire this something. I thought one might observe the ability, a completed ability in another or in one’s imagination, or in a text book, and decide to acquire it, then do the actions oneself, to demonstrate the actions for oneself, to see if they now have the ability to their own personal standard (which might be higher than what they are observing). In thinking this through I came up with Observe, Decide, Act. One had to observe a skill one way or the other, even if just in one’s own imagination, decide to acquire it, then act on that decision. That is how one acquires a completed ability or skill. A skill is an ability one can learn. Now, in working with this I also found this is true of any ability one is using, one observes, one decides, one acts. This can actually be done all in the present moment by an individual, but one nearly always then assigns these actions to his or her mind, and learns something as a so-called skill or ability where it is a thing that exists or it is a quality that exists and then one can say “the quality of being able to do something.” Do you see this, this is the perfected skill. So, per your question you would like to have the perfected ability to look at a 10 digit number and bring it back to mind accurately with confidence, later or 3 seconds later. I did something this one day with a second-grade student. He was supposed to do an assignment from his regular teacher in 20 minutes. It was simple addition. In 10 minutes, he had not started. I started to encourage him to start and then suddenly realized that he might not have the skills to do it at all. He had to add, 4 + 9 =. So, I quickly thought that I used to have the ability to just scan down a column of numbers and know the sum as a I was scanning and know the answer as I got to the bottom of the column of numbers. I kept this in mind. So, I glanced around and saw a basket of little one-inch square tiles and put the basket on this boy’s desk. I asked him to count out 4 tiles on one side of his desk, and 9 tiles on the other side. He could do this, he could count the tiles. I then had him push them all altogether and at the same time I asked, “Now, how many do you have? Count them up.” He did and said, “13.” He glanced back at his assignment, with 20 problems on the page and he scanned down the page like a speed reader pointing with his fingers at each problem as he went from left to right, down the page, in 2 or 3 seconds. At first he mumbled the answer for each, then kind of sub-vocalized after that. I then handed him his pencil and said, “Now, all you have to do is write down the answers.” He had learned to add. Let’s assume you now know how to acquire a skill in this way. Example 2: One mom asked me to tutor her daughter. She told me, she thought she herself, was “dumb at math.” She was not confident she could help her daughter. The daughter said, “I’m dumb at math.” Daughter was in 8th grade, and had been failing for 7 years. I helped her by just helping her locate and clarify math words, she had not understood when she was doing her assignments. I had her read an assignment, she looked around and found her toughest assignment. I had her start at the top and read out loud. When she showed any sign of stress, I had her stop and locate a word she did not know. “Is there any word there you do not understand?” Each time she found one, and I had her re-read that line and I observed she could now do this stress free. Then I noticed she was confused about “multiplication.” So we defined that concept, but had some confusion, so I traced this down to the word “unit.” or unit of measure. If one counts tiles, that would be one tile, if one were counting apples, that would be apples. If one were dong a cake recipe, that might be “one cup” of sugar. When this basic word in the subject of math was clarified in her mind, the whole subject of math now became clear. She now had the ability to learn math. So this was a huge win for her. But I point out, up to that point in time, she had been ‘doing well’ in math. That one word, the lack of understanding that one basic word in math, had caused her to crash the subject of math, and fail for 7 years after that. Her grades now went up to A-level work. That is what I would like you to do, find a basic word in math or any subject, that returns to your your ability to learn math, to your personal standards. You might need a tutor to do this, but you just recall the last time you were ‘doing well’ in math, locate this quite exactly, then locate a word right there that when clarified returns you to doing well - in the entire subject of math. That also returns your ability to learn math. By ‘doing well’ I mean that one is flying along, feeling brilliant, enthusiastic or exhilarated, and fully understanding what one is learning. This can be done for all subjects, including Economics. Now, it may be that you are ‘doing well’ already in Economics. Then one would not find a moment in the past, that would be now. Let’s assume you now have the ability to learn all the subjects you have studied, and you are doing well in all subjects. Example 3: Done with a tutor, or fellow student or study partner. One way to learn things, to learn skills, is by something called, “gradient scales,” where one starts with something one can do. Then demonstrates that level of skill successfully. Then one increases the difficulty level a little at a time, so that one retains the ability to learn at each step, and can do each step successfully, with certainty and confidence. This builds certainty and confidence. Let’s say one can recall a one-digit number like, the number 7. One can read it, or hear it. Then do something else, then come back to that idea, and recall that exact bit of information, the number “7”. A tutor could help you do this. Okay, one digit is super easy. This is the idea, to start with something that is super easy, and get tougher, and tougher, until one is at the level one has established as a standard, or above it. Let’s assume we have established 10 digits as too high a gradient, for now, you are not happy with not being able to recall such numbers without error. Using this idea of Gradient Scales we back off down gradient to a point where we know you are successful. Your tutor could try the examples you gave, where you had trouble with “9” and “4” and “8” and “3”. He could say or write down “9” and see if you can recall just that confidently, without error, with certainty. If there are hesitations, he could have you use one-inch square tiles or any object and have you demo counting to each of those numbers, for example. Let’s assume you can demo each of these numbers, confidently, quickly and with great ease. Or, possibly we found that you did not understand one of these numbers, and that is now clarified and now you are ready to move on up the gradient from a start point. Now, the tutor could have you read 94 and recall it later, looking for any hesitation at that gradient. Also, 49. Basically, we are just looking for this point, where were you doing well on the gradient and where are you are doing well, and cutting back a little and finding where you were last doing well, and fixing that, so you are actually doing well there, at that level of the gradient. Let’s assume you can now demo doing 9 digit numbers in any combination with no difficulties. Now, let’s do 10 digits in any combination. Practice that till you can do that comfortably and easily, you have confidence at this level. This is your standard. Now let’s do 11 just for fun. When that is fun for you, then we can end off with Gradient Scales on this. The reason for this higher level is that one can be confident, and still not be able to move up the gradient from there, from 10. But successfully doing the next higher level, we are validating your ability to do that level and that you do have ability to learn at that level of the gradient, at the 10 level, and above. Example 4. Returning. There is a technique of using the mind in a little different way than normal memory, called Returning. It is the optimum way to bring back to mind detail information like very large numbers, or large amounts of data. A person experiences something in life. She or he records that original experience in the mind in an original recording that contains all the detail of the original experience including the perception of time. Let’s say you read a 10 digit number, at exactly 9:00.00. This is nine o’clock, zero minutes, zero seconds. Now the mind actually makes from 15 to 150 frames of memory per second. Mine, I think, is about 18 frames per second, like a movie film. So if a tutor showed me a number, any number, the number 7, let’s say in 1/18th of a second I might have the capability to recall it no problem. But if he uses a machine and only shows it to me for 1/500th of a second, I probably would not be able to recall it all. I would not actually have any record of it whatsoever. So time is a factor. So, let’s say the tutor is going to show us a number for at least one second. The tutor could show you the number “7” for a second. Let’s say it is written with a little line on it somewhere. Then he says, recall the time you saw the number “7”. You recall it, the number 7, but do not notice the little line. You are confident this is the memory record of that experience. But now let’s say he says, “When did you see this number?” You say, “When it was exactly, 9:00.00.” He says, “Move to that time, and tell me what you see?” You do this and see the room as it was at 9:00.00, he is located where he was then, you are locate where you were then, you see the table, you hear the sounds in the room that you experienced at that exact time, you can smell the smells that were in the room at that instant, and you see the number 7 with the little line and the whole page of paper. This is the original mental record of your experience at that time, 9:00.00. This is an ability any mind has. It is called, returning. This is not a memory. It has a special name. It is called a “facsimile.” Memory is when you access information in a general way from this present moment. Like when a tutor says, “Can you recall the number 7?” and you say, “Yes.” Your mind accesses the facsimile, and gives you the data you or your tutor requested. So, you have the ability to examine this record in any level of detail you wish. With this “returning ability”. I once had a man recall a time he was happy. He could do this. That was memory. I asked for more detail. He described a forest about 6 miles away. I asked if he could see any trees, and he said yes. I asked if he could see the bark on one of those trees. Yes, he could. I asked if there were any insects on that bark. He described what he saw. All the detail is there. He was examining the original facsimile at that moment. So, I am saying to access a 10 digit number or any number, any amount of data, one could use this ability to return to the facsimile, and just read off the exact number at that time. So instead of recalling from present time, one would return to the time when they saw such a number and simply read it, or hear it again. They would then return their attention to the present moment. You can learn more about this ability in book called, “Self Analysis” by Hubbard. I would anticipate no real difficulty in your competing any of these 4 examples, or lessons. Best regards, Leon ",
            "date": "Answered October 18, 2020",
            "views": "39",
            "upvotes": " Answer requested by Alan Nightfall",
            "upvoters": [
                {
                    "user_id": "Mels Bells",
                    "user_href": "/profile/Mels-Bells-3"
                }
            ]
        },
        {
            "author_info": {
                "name": "Fleur Robert",
                "href": "/profile/Fleur-Robert"
            },
            "answer_text": "Hello Alan IF you notice this as a regular event, it is possible that a form of memory interference is occurring. Only qualified health professionals could give you definite answers. For maintaining accuracy in employment situations, you shall need to have a system to check for accidental errors in order to not make fundamental mistakes which could lead to less than favourable reports. Blessings ",
            "date": "Answered October 14, 2020",
            "views": "49",
            "upvotes": " View 1 Upvoter"
        },
        {
            "author_info": {
                "name": "Giles Elrington",
                "href": "/profile/Giles-Elrington"
            },
            "answer_text": "Do I have a condition if I remember numbers, say 9411380505 as 4911830505, after given maybe 3 seconds to remember it? Do I have dyslexia or memory skips or something else? I am 26 years old and have an honours degree in economics. Normal people can usually recall a 7 digit string forwards and a 5 digit string backwards. So your minor error with this 10 digit string is not abnormal. ",
            "date": "Answered October 15, 2020",
            "views": "47",
            "upvotes": " Answer requested by Alan Nightfall"
        },
        {
            "author_info": {
                "name": "Kari Bell",
                "href": "/profile/Kari-Bell-15"
            },
            "answer_text": "I wonder. I do not have true dyslexia, but the doctor says I have a dyslexic like condition. When I was tested for learning disabilities, I failed this part of the test. I did what you did, got the numbers backwards. ",
            "date": "Answered October 21, 2020",
            "views": "8",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Patrick Hurley",
                "href": "/profile/Patrick-Hurley-76"
            },
            "answer_text": "You are pretty exceptional of you can correctly get 8 out of 10 numbers in order. You are above average in this skill. Number recall has no contribution to dyslexia. ",
            "date": "Answered October 14, 2020",
            "views": "19",
            "upvotes": " Answer requested by Alan Nightfall"
        },
        {
            "author_info": {
                "name": "Gary Hein",
                "href": "/profile/Gary-Hein-1"
            },
            "answer_text": "Transposition of numbers, particularly the first two of a sequence is common. Unfortunately, I don’t know why that is. ",
            "date": "Answered October 14, 2020",
            "views": "18",
            "upvotes": " Answer requested by Alan Nightfall"
        }
    ]
}