{
    "title": "Do I need to buy an iPhone 11 or an iPhone 12 in 2020? - Quora",
    "tags": [
        "iPhone 7",
        "Smartphone Shopping",
        "2020 (year)",
        "Apple (company)",
        "iPhones (product)",
        "Apple Products and Services"
    ],
    "response": [
        {
            "author_info": {
                "name": "Nick Contreras",
                "href": "/profile/Nick-Contreras-12"
            },
            "answer_text": "If you are a modernist who wants every phone every year, you would wait to get the iPhone in 2020, however, you should wait until 2021 for the new iPhone. Even though 2021 may seem like a long time from now, it will be worth the wait because there will be a huge redesign in terms of having no notch, and the possibility of a fourth camera. The use of 5G will already be implemented and there will be no charging port which means you will have to spend more money on a wireless charger. (Rumors say that we can have no charging port as soon as 2020) If you are someone who needs a charging port on your phone and a lightning-to-earphone spot, then you should take the iPhone 11 models. Otherwise if you want something completely new, then go and wait for the iPhone in 2021 since it will be newly designed. ",
            "date": "Answered December 31, 2019",
            "views": "84",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Rayhaan Mohammed",
                    "user_href": "/profile/Rayhaan-Mohammed-1"
                },
                {
                    "user_id": "Roberto Santocho",
                    "user_href": "/profile/Roberto-Santocho"
                },
                {
                    "user_id": "Shakeel Jutt",
                    "user_href": "/profile/Shakeel-Jutt-11"
                }
            ]
        },
        {
            "author_info": {
                "name": "Chuck Rogers",
                "href": "/profile/Chuck-Rogers-1"
            },
            "answer_text": "You need to buy the phone you want. If you want to buy a phone before the fall of 2020, you will have to buy an iPhone 11. If you can wait until fall, you can buy the next model (whatever it is called) instead. Apple will always be coming out with new models. Always. If you can wait, wait. When you decide to get a new phone, buy the newest model with the fastest CPU and most RAM — that’s the model that will last the longest in terms of productive use and system updates. ",
            "date": "Answered December 31, 2019",
            "views": "19",
            "upvotes": " View 5 Upvoters",
            "upvoters": [
                {
                    "user_id": "Jamar Wright",
                    "user_href": "/profile/Jamar-Wright-1"
                },
                {
                    "user_id": "Samuli Horjanheimo",
                    "user_href": "/profile/Samuli-Horjanheimo"
                },
                {
                    "user_id": "Rayhaan Mohammed",
                    "user_href": "/profile/Rayhaan-Mohammed-1"
                },
                {
                    "user_id": "Dean Mackenzie",
                    "user_href": "/profile/Dean-Mackenzie"
                },
                {
                    "user_id": "Roberto Santocho",
                    "user_href": "/profile/Roberto-Santocho"
                }
            ]
        }
    ]
}