{
    "title": "Do Instagram stalker apps really work? - Quora",
    "tags": [
        "Stalking",
        "Instagram (company)",
        "Instagram Account Services",
        "Instagram (product)",
        "Social Media"
    ],
    "response": [
        {
            "author_info": {
                "name": "Emily Cardoso",
                "href": "/profile/Emily-Cardoso-4"
            },
            "answer_text": "Do these apps actually work? We asked Instagram directly if it “was possible for a third-party app or plugin to offer people a way of seeing exactly who looks at their profile pages.” A spokesperson replied to the Huffington Post UK saying that while they “don’t comment on specific apps. Our terms of conditions make it clear we don’t support this third party use case.” As these third-party plugins do not actually receive information from Instagram or Facebook directly, it means they are promising customers something that the platforms won’t actually ever share with them. In short, these limitations mean they are going to be pretty useless at giving accurate data on who is checking you out. One of the most popular spy apps, ‘Who Stalks - Super Spy Pro’, which is available on the iTunes store, even issued its own disclaimer, saying: “Super Spy Pro are not associated with Instagram in any way. This is a unofficial product and is intended for entertainment purposes only. This app calculates the interaction to your profile, and tries to identify.” But it isn’t just their questionable functionality that users should be worried about.  ",
            "date": "Answered October 27, 2020",
            "views": "522",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Mike Smith",
                    "user_href": "/profile/Mike-Smith-6609"
                }
            ]
        },
        {
            "author_info": {
                "name": "Melee Lee",
                "href": "/profile/Melee-Lee"
            },
            "answer_text": "I really would like to know that myself. I really don’t care about Instagram. If someone posts selfies of themselves up on Instagram all day…they really shouldn’t be upset if SOMEONE they don’t know see’s the pictures too. Most people on Instagram enjoy the attention of having strangers like the pics. I have an account and I hardly post anything. When I do it is decent, generic, pictures. No one is going to stalk mine that is for sure. I think it is slightly on the boring side but hey…I don’t post anything “controversial.” The internet is creepy at times and while there are stalkers out there…if they are in a foreign country (like Europe) who really cares? The only way it would become scary is if I get phone calls, or letters. That is pretty scary. I have heard about “Instagram Stalker Apps” but they are there to get attention. If they tell you “you have a stalker!” Then what? Big deal? What would you do to the person who is looking at your pictures? Remember, you posted them yourself. Just delete some of the pics if they are too private for random strangers to see. ",
            "date": "Answered May 6, 2019",
            "views": "424",
            "upvotes": " View 4 Upvoters ",
            "upvoters": [
                {
                    "user_id": "How to Know Nothing",
                    "user_href": "/profile/How-to-Know-Nothing"
                },
                {
                    "user_id": "Riya Laxmi",
                    "user_href": "/profile/Riya-Laxmi-1"
                },
                {
                    "user_id": "Alex Mawdsley",
                    "user_href": "/profile/Alex-Mawdsley-1"
                },
                {
                    "user_id": "Előd Récsán",
                    "user_href": "/profile/Előd-Récsán"
                }
            ]
        },
        {
            "author_info": {
                "name": "Vince Smith",
                "href": "/profile/Vince-Smith-81"
            },
            "answer_text": "Instagram never shares information like who have been visiting your profile, it only shares the number of profile visits for business pages and thus it is very unlikely for a 3rd party app or “stalker” app to be able to access such information in a legal way so I don’t think such apps actually work. Some apps can only tell you who are your “top fans” maybe, based on the number of likes and comments they make on your posts but definitely not who have been stalking you. ",
            "date": "Answered May 18, 2019",
            "views": "398",
            "upvotes": " View 8 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Jennifer Stadig",
                    "user_href": "/profile/Jennifer-Stadig-1"
                },
                {
                    "user_id": "Saif Hasan",
                    "user_href": "/profile/Saif-Hasan-62"
                },
                {
                    "user_id": "Ravi Prakash Mishra",
                    "user_href": "/profile/Ravi-Prakash-Mishra-31"
                },
                {
                    "user_id": "Adam Daagh",
                    "user_href": "/profile/Adam-Daagh"
                },
                {
                    "user_id": "Kaitlyn Kocovski",
                    "user_href": "/profile/Kaitlyn-Kocovski"
                },
                {
                    "user_id": "Sampriti Gogoi",
                    "user_href": "/profile/Sampriti-Gogoi-3"
                },
                {
                    "user_id": "Jayakrishna Shenoy",
                    "user_href": "/profile/Jayakrishna-Shenoy-2"
                },
                {
                    "user_id": "Bruce Gilbert",
                    "user_href": "/profile/Bruce-Gilbert-2"
                }
            ]
        },
        {
            "author_info": {
                "name": "Charlotte Ellis",
                "href": "/profile/Charlotte-Ellis-93"
            },
            "answer_text": "Hi there, To be honest, features like “Who viewed your profile”, “Who watched your story how many times” are totally fake. Instagram does not share this kind of data. But it is possible to find out who hides their stories from you and also you can watch others’ stories anonymously, if you are interested in these features, I can recommend you one of our businesses (Check out our website or Android App). In order to prove, you can easily ask the person who hide his/her story from you and check if this information is true. Also you can find out story, profile, media insights by using the app. Stay safe! ",
            "date": "Answered August 25, 2020",
            "views": "115",
            "upvotes": " View 5 Upvoters",
            "upvoters": [
                {
                    "user_id": "Param Kaur",
                    "user_href": "/profile/Param-Kaur-163"
                },
                {
                    "user_id": "Neriob Sarkar",
                    "user_href": "/profile/Neriob-Sarkar"
                },
                {
                    "user_id": "Jay Nals",
                    "user_href": "/profile/Jay-Nals"
                },
                {
                    "user_id": "John McCarthy",
                    "user_href": "/profile/John-McCarthy-610"
                },
                {
                    "user_id": "Sonay Yarayici",
                    "user_href": "/profile/Sonay-Yarayici-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Daniel Ferrigon",
                "href": "/profile/Daniel-Ferrigon-2"
            },
            "answer_text": "Don’t waste your time downloading any of these Instagram Stalker apps. The majority of them rely on in-app ad revenue. Use caution with any app that requires you to login to your Instagram account. If the stalker apps work as claimed they may be in violation of Instagram's Terms and Conditions.[1]As with any app check the reviews before downloading. Footnotes[1] Platform Policy • Instagram",
            "date": "Answered May 27, 2020",
            "views": "99",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Kawaii Cake",
                    "user_href": "/profile/Kawaii-Cake-7"
                }
            ]
        },
        {
            "author_info": {
                "name": "Malik Habib",
                "href": "/profile/Malik-Habib-35"
            },
            "answer_text": "These Instagram stalker apps are fake and show you any random profile as an Insta Stalker. Never pay money to see these fake Instagram stalkers. You can read user reviews of these apps before installing them on your phone. Most of these apps are earning through ads and don't work when you try to check an Insta stalker ",
            "date": "Answered July 9, 2020",
            "views": "41",
            "upvotes": " View 2 Upvoters ",
            "upvoters": [
                {
                    "user_id": "David Alexander",
                    "user_href": "/profile/David-Alexander-14"
                },
                {
                    "user_id": "Kawaii Cake",
                    "user_href": "/profile/Kawaii-Cake-7"
                }
            ]
        },
        {
            "author_info": {
                "name": "Mikail Gurbuz",
                "href": "/profile/Mikail-Gurbuz"
            },
            "answer_text": "yeah sure, with Instagram Story Stalker & Notifier Android app you can stalk any Instagram user’s story without being recognised and get notified whenever she/he shares a story. ",
            "date": "Answered February 3, 2020",
            "views": "12",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Jahmari Erskine",
                "href": "/profile/Jahmari-Erskine"
            },
            "answer_text": "No you can get arrested for using that app ",
            "date": "Answered April 3, 2018",
            "views": "31",
            "upvotes": "0"
        }
    ]
}