{
    "title": "Do most women still love men? - Quora",
    "tags": [
        "Understanding Love",
        "Love"
    ],
    "response": [
        {
            "author_info": {
                "name": "Silver Lee",
                "href": "/profile/Silver-Lee-15"
            },
            "answer_text": "This is an awesome question and it is yes, and no let me tell you why. Some women in life has experience terrible, frightening, deep hearted heart break relationships. My first child’s father is a racist and he called instigated names along with his girlfriend referring to our child’s racist name trust me hundreds of thousands of women go through that. My second child was a set up with high school mates a girl I thought was my friend did a love connection just for me to find out that they both just wanted to kidnap the baby. Third, by the same so called high school friend she practically forced me to be with her guy friend when I didn’t want to and if that guy was man enough he would have said that’s ok after what she yelled at me. Fourth, you probably have problems with a family member going behind the brothers back threatening you. Saying “ I don’t want you with my brother, you will never turn my brother against me. Talking cra cra. Fifth, if you known the man you actually figure out the entire time you was in love with like on a serious tip and he has been with people you know, doesn’t respect you, belittle you, always get upset when you try to stir up a conversation, never thinks he’s wrong for what he did and, thinks he is God’s gift. On top of that never does anything for you whatsoever whatsoever. Always thinks your lying. Wants to be with you however, acts totally the opposite ignores your calls, hair is never perfect and refer to you as weird and a big nobody yet he brags about knowing “ Top Nocth” females just to down grade you. However, he stays around just to make sure your at rock bottom. Or whatever the F@&$ the case maybe some men in so called caring as they say or love is just letting the unfortunate lady know. “Oh I love banging you but, I will never help you out because, I am way to busy with that yuckki woman over there” If a woman been through that she will NEVER! let me repeat that NEVER! EVER! Be desperate for a man ever again just in anxiety that she will bump into a demon that will most likely emotionally kill her knowing she is not strong enough to go through putting up with that type of man again. What’s Like got to do with it? What’s Love got to do with it? Why are some women like that? Their is an answer to all of that however, others will never, let me repeat that never understand. ",
            "date": "Answered October 2, 2018",
            "views": "411",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Angel Summers",
                    "user_href": "/profile/Angel-Summers-2"
                }
            ]
        },
        {
            "author_info": {
                "name": "Kathrine Smiths",
                "href": "/profile/Kathrine-Smiths"
            },
            "answer_text": "Yes, even thought women are completely (and sometimes better off) being independent women can still feel a true connection with a man. I would say women who love and can better themselves can still love and better a man. If women do not love men it could come from terrible past relationships with past boyfriends, or even with their own father causing a distrust in men. Sometimes the hookup culture can leave a women feeling burned out and never a true satisfaction. ",
            "date": "Answered March 1, 2018",
            "views": "291",
            "upvotes": " View 7 Upvoters",
            "upvoters": [
                {
                    "user_id": "James Wayne",
                    "user_href": "/profile/James-Wayne-103"
                },
                {
                    "user_id": "Silver Lee",
                    "user_href": "/profile/Silver-Lee-15"
                },
                {
                    "user_id": "Addison Hughes",
                    "user_href": "/profile/Addison-Hughes-1"
                },
                {
                    "user_id": "John Sadler Sr.",
                    "user_href": "/profile/John-Sadler-Sr"
                },
                {
                    "user_id": "Astha Sinha",
                    "user_href": "/profile/Astha-Sinha-7"
                },
                {
                    "user_id": "Harshit Madan",
                    "user_href": "/profile/Harshit-Madan-9"
                },
                {
                    "user_id": "Mary Short",
                    "user_href": "/profile/Mary-Short-2"
                }
            ]
        },
        {
            "author_info": {
                "name": "Sai Hareesh",
                "href": "/profile/Sai-Hareesh"
            },
            "answer_text": "Given that most of the humans don't care or love other humans, it really doesn't matter. :) ",
            "date": "Answered March 1, 2018",
            "views": "191",
            "upvotes": "0"
        }
    ]
}