{
    "title": "Do modern humans eat any food which has not been genetically modified in some way by our production of it? - Quora",
    "tags": [
        "Genetically Modified Foods",
        "Genetically Modified Organisms (GMO)",
        "Genetic Engineering",
        "Agriculture",
        "Genetics and Heredity",
        "Eating",
        "The Human Race and Condition"
    ],
    "response": [
        {
            "author_info": {
                "name": "Richard Knutson",
                "href": "/profile/Richard-Knutson-7"
            },
            "answer_text": "Yes, but it is getting less and less every year. NGMOs (Natural Genetic Modified Organisms) are the norm. GMOs are man made. Gene modification is a standard operating procedure for Mother Nature. It has been being done since the beginning by what science calls exosomes. Although they weren’t discovered until 1986, they have been doing their job the whole time they were unknown. A special case of the exosome is what science calls a virus. Although it was discovered first and has been around just as long as the exosome, it has RNA in it that causes the cell it penetrates to replicate the virus. Science hasn’t examined why as it assumes the virus is a thing in itself totally separate from an exosome. Science refuses to consider it even though the two are essentially identical.  The message (in case you missed it) is that exosomes are the way cells communicate in order to modify the genes of the nucleus in real time. Genes are not once and done. Modern doctors will tell you it is one of the “3 Gs” when you ask them about the disease you have been diagnosed with. It was caused by a germ, your genes or God. What they fail to account for is a germ (bad bacteria) can only take up residence in your body if you have done something to provide a place and a source of nourishment. Germs are opportunistic, they only go where there is an opportunity for food and shelter. The assumption is your genes are the same since you were born. The reality is your genetic make up is changing on a day to day, minute to minute basis over your entire life. If it isn’t germs and it isn’t genes, the only thing left is God and science only recognizes His existence when there is no other choice. The correct answer should be, “We don’t know.” Our problem is these people are convinced they know what they are doing and they have most of the population of the planet convinced as well. We are going downhill in a full bus with no brakes and a bozo at the wheel. If you are thinking we are all going to die, you are right, it is just going to be sooner than anyone figured. Tesla’s Lab Fire and COVID-19 ",
            "date": "Answered September 13, 2020",
            "views": "89",
            "upvotes": " Answer requested by Lucas Cosolo",
            "upvoters": [
                {
                    "user_id": "Jaime Alonso Rodríguez",
                    "user_href": "/profile/Jaime-Alonso-Rodríguez"
                },
                {
                    "user_id": "Vincent Maldia",
                    "user_href": "/profile/Vincent-Maldia"
                },
                {
                    "user_id": "Kennedy Kight",
                    "user_href": "/profile/Kennedy-Kight"
                },
                {
                    "user_id": "Frederick J Newmeyer",
                    "user_href": "/profile/Frederick-J-Newmeyer"
                },
                {
                    "user_id": "Lucas Cosolo",
                    "user_href": "/profile/Lucas-Cosolo-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Phil Hutton",
                "href": "/profile/Phil-Hutton"
            },
            "answer_text": "The question specifically stipulates that the modification has to come from human production. If we grow it, then it has been modified due to human intervention by the selection of desirable traits. Compare corn to teosinte or the modern beef cow to an auroch and you will quickly get a grasp of what we have been up to. As other answers suggest, anything wild caught or harvested has probably undergone only slight modification due to the harvesting techniques. These would be primarily behavioral adaptations. Whether it is a wild persimmon, field cress, pawpaw, perch, catfish, crab, deer, turkey or wild duck it is basically the same organism that existed prior to human hunting and gathering…..which by the way really isn’t considered production. ",
            "date": "Answered September 16, 2020",
            "views": "42",
            "upvotes": " Answer requested by Lucas Cosolo"
        },
        {
            "author_info": {
                "name": "Jim Foxvog",
                "href": "/profile/Jim-Foxvog"
            },
            "answer_text": "“Genetically modified” referring to food generally has the specific meaning of things like gene splicing. Many foods are not GMOs in this sense. People who use “genetically modified” to include normal selection of the best plant to replant are usually trying to defend artificial gene manipulation. Selection and hybridization have probably been used on most crops grown on a large scale. Many foods are still wild-harvested, animals, plants, and fungi. Some people then cultivate these wild-harvested foods. ",
            "date": "Answered September 18, 2020",
            "views": "50",
            "upvotes": " Answer requested by Lucas Cosolo"
        },
        {
            "author_info": {
                "name": "Todd Elliot",
                "href": "/profile/Todd-Elliot-3"
            },
            "answer_text": "My wife turned me on to pine nuts. We eat them raw, from the shell. They aren’t grown as a crop as far as I know, but are harvested in the wild. We’ve even found them ourselves and eaten them fresh out of the cone. There are some natural kinds of fish that humans consume. Some are even havested in industrial quantities. Natural salmon, tuna, halibut, and others. ",
            "date": "Answered September 16, 2020",
            "views": "44",
            "upvotes": " Answer requested by Lucas Cosolo"
        },
        {
            "author_info": {
                "name": "Davis Appleton",
                "href": "/profile/Davis-Appleton"
            },
            "answer_text": "Wild-caught seafood comes to mind. They’ve neither been bred nor genetically modified. It is possible that human fishing has caused them to adapt, however. For example, the Japanese used to toss back Heike crabs that seemed to look like a samurai, due to the legend that one was turned into a crab. Now they all look like samurai:  source - The Heike Crab ",
            "date": "Answered September 13, 2020",
            "views": "188",
            "upvotes": " View 5 Upvoters"
        },
        {
            "author_info": {
                "name": "Garry Wall",
                "href": "/profile/Garry-Wall-1"
            },
            "answer_text": "I don't think there's very much that hasn't been modified in some way. Possibly wildgames, birds and fish. ",
            "date": "Answered September 13, 2020",
            "views": "16",
            "upvotes": " Answer requested by Lucas Cosolo"
        },
        {
            "author_info": {
                "name": "David Johnson",
                "href": "/profile/David-Johnson-57"
            },
            "answer_text": "Most seafood at the moment - though that'll have to change if we want any seafood left. Almost every plant food has been through centuries to millennia of modifications, though. Meat and poultry, not as much, but considerable. ",
            "date": "Answered September 14, 2020",
            "views": "36",
            "upvotes": " Answer requested by Lucas Cosolo"
        }
    ]
}