{
    "title": "Do phones really need to go 'bezel-less'? - Quora",
    "tags": [
        "Bezel-less Phones",
        "Bezel"
    ],
    "response": [
        {
            "author_info": {
                "name": "Messach Kandou",
                "href": "/profile/Messach-Kandou"
            },
            "answer_text": "Definitely not… I believe it’s more of matter of style / fashion and a trend… To be clear, let’s go through some of the pros and cons of bezel-less phones Pros : The phone looks greatBezel-less phone would have a ‘slimmer’ size when compared to phones with a bezel that has the same screen sizeIsn’t it beautiful? (I’m being a bit sarcastic here)Cons : Bezel-less phone’s screen are likely less than 2 mm away from the sides of the phone, holding it casually may lead to accidental touchesLess protection, as any impact to the sides would most likely have a stronger effect to the display assembly rather than phones with bezels due to the nearly non existent space between the sides of the phone to the display assemblySide buttons would also have a chance to break the display assemblyCapacitive buttons (the ones at the bottom / chin of the phone are no more and replaced with on screen buttons which would take up screen real estate although arguably they can be hidden when not neededYou wouldn’t want to accidentally drop your phone on any hard surface like… the floor…Protective accessories like bumper cases, silicon cases, and a whole lot of other cases are either too thin to be protective or too thick which would defeat the purpose of having a bezel-less phoneAll of the above are however, just an opinion, based on my own preferences… If you want to swing that way, feel free to do so…. ",
            "date": "Answered July 31, 2018",
            "views": "909",
            "upvotes": " View 3 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Nitin Pai",
                    "user_href": "/profile/Nitin-Pai-30"
                },
                {
                    "user_id": "Ramachandran Povara",
                    "user_href": "/profile/Ramachandran-Povara"
                },
                {
                    "user_id": "Manish Kori",
                    "user_href": "/profile/Manish-Kori-12"
                }
            ]
        },
        {
            "author_info": {
                "name": "Alan Santillan",
                "href": "/profile/Alan-Santillan-1"
            },
            "answer_text": "The smartphone industry is maturing to the point where the variety in the current options on the market is closing. The cheaper phones are going to start to get closer and closer to what the highest end iPhone is capable of and there’s no stopping that. Smartphone manufacturers have to figure out new ways to push the envelope in terms of new features because of this. Bezel-less phones are one of the products of this pressure on the industry. It’s a feature that some have expressed interest, but will push all manufacturers into following in the same way that the notch has come (and hopefully will go soon). So, they don’t really need to be bezel-less, but they definitely will be because that’s the way that the mobile smartphone industry is currently trending towards. ",
            "date": "Answered July 31, 2018",
            "views": "551",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Noah Dimas",
                    "user_href": "/profile/Noah-Dimas-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Holland James Phillips",
                "href": "/profile/Holland-James-Phillips"
            },
            "answer_text": "Did skirts really need to go mini? Of course not. Phones have become fashion statements as much as their technology has advanced. As far as I'm concerned, I'm only interested in actual advances in technology where phones are concerned, but many people are more interested in making a fashion statement. To notch or not to notch, bezel or bezeless? Whatever floats your boat. ",
            "date": "Answered July 31, 2018",
            "views": "293",
            "upvotes": " Answer requested by Ivan Patrick",
            "upvoters": [
                {
                    "user_id": "Jacky Huynh",
                    "user_href": "/profile/Jacky-Huynh"
                }
            ]
        },
        {
            "author_info": {
                "name": "Jeff Obunga",
                "href": "/profile/Jeff-Obunga"
            },
            "answer_text": "I don’t think soBezels offer at least some protection to the screen at some angles during dropsThinner bezels look aesthetically pleasing, offering placement for key sensors as well as the camera, as the technology to place these underneath the screen is not available to the consumer marketGoing fully bezeless may look nice, but offer no real practical use. I think most people would prefer at least some bezelsIt’s interesting to see where display technology will head in the next 5 - 10 years….Meanwhile, here is what I think is the biggest breakthrough so far with regards to pushing towards bezel-less vivo NEX S Hope this helps. ",
            "date": "Answered August 8, 2018",
            "views": "16",
            "upvotes": " Answer requested by Ivan Patrick"
        },
        {
            "author_info": {
                "name": "Amith Shikder",
                "href": "/profile/Amith-Shikder"
            },
            "answer_text": "Phones these days do a lot compared to the previous generations. Producers hold the interest of consumers by adding new functions. Bezel-less screen is one of such features for the moment. Phones need to be more durable and shatterproof with greater battery life but as phones get changed every 2 years, manufacturers are focusing on looks rather durability. Phones look cool with this new trend of bezel less screen (I am using S8 myself) but it is unfortunate that durability and battery life did not end up in their (producers) priority list. Yesterday a gentleman at work accidentally dropped his S8+ from an average height and the screen shattered. They don’t need to go bezel less before durability according to me. ",
            "date": "Answered August 1, 2018",
            "views": "280",
            "upvotes": " Answer requested by Ivan Patrick"
        },
        {
            "author_info": {
                "name": "Minnie Stumph",
                "href": "/profile/Minnie-Stumph-1"
            },
            "answer_text": "No phones do not really need to go bezel-less, but once they do then all competitors need to follow suit to keep up and not be left behind losing sales on those who prefer this new trend. I have said this countless times on here and am saying it again “It’s all about bottom line profits” That’s just good business-sense. ",
            "date": "Answered August 22, 2018",
            "views": "77",
            "upvotes": " View 1 Upvoter "
        }
    ]
}