{
    "title": "Do people with autism spectrum disorders experience the uncanny Valley? - Quora",
    "tags": [
        "Uncanny Valley (robotics)",
        "Autism Spectrum Disorders",
        "Asperger Syndrome"
    ],
    "response": [
        {
            "author_info": {
                "name": "Peter Howell",
                "href": "/profile/Peter-Howell-19"
            },
            "answer_text": "That’s a really good question. The important thing to understand about the uncanny valley is that it’s a concept that has never really been tested. It’s just generally accepted because it “feels about right.” A lot of questions haven’t been answered. Does everyone have it?Is the “geography” of the valley the same for everyone?Can it change over time for a given person?I’m going to guess that everyone on the spectrum has at least a bit of uncanny valley. It’s going to vary a lot from person to person, but it does seem to be much much smaller (perhaps an uncanny ditch) for autistic folks on average. I think we’re also more prone to normalizing the things that other people find uncanny. What we find uncanny at first just becomes a quirky feature later. I think this partly explains the observation that certain fandoms contain a higher than average percentage of people on the spectrum. These are fandoms with anthropomorphized or exaggerated human characters, like anime, furry, brony, etc. The fact that these characters “look weird” is much less likely to bother us. ",
            "date": "Answered March 12, 2020",
            "views": "382",
            "upvotes": " View 5 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Steve Jones",
                    "user_href": "/profile/Steve-Jones-235"
                },
                {
                    "user_id": "Emma Skinner",
                    "user_href": "/profile/Emma-Skinner-5"
                },
                {
                    "user_id": "Diego Mendoza",
                    "user_href": "/profile/Diego-Mendoza-34-1"
                },
                {
                    "user_id": "Simon Janevic",
                    "user_href": "/profile/Simon-Janevic"
                },
                {
                    "user_id": "Oleg Volkov",
                    "user_href": "/profile/Oleg-Volkov-29"
                }
            ]
        },
        {
            "author_info": {
                "name": "Saleh Abdel Motaal",
                "href": "/profile/Saleh-Abdel-Motaal"
            },
            "answer_text": "So, maybe it’s just me, but siri (ie iris written backwards) never really felt uncanny, but being one of the few segments of the population that have experienced first-hand the level of realism of the racism, I found human behaviour uncanny… ie “call Mohammed” who happens to be my brother based on the semantically linked contact cards at the disposal of the robot, somehow mistaken phobically as a cry for spiritual guidance that siri would urge me to find that kind of spirituality elsewhere?! But, no I did not want to try asking further to call out the systematic prejudices that are clearly being intentionally fed into their learning by humans. Yes, I guess that completely is secondary to your ask, and that is because personally I wanted to share something interesting because the answer to this question is likely disappointing… Depends on the individual, just like with neurotypicals, but we can run a study if the robot lobby complains or dishes out the dollars :) Hope this helps — Thanks Diego! ",
            "date": "Answered March 11, 2020",
            "views": "205",
            "upvotes": " View 7 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Jelena Iden",
                    "user_href": "/profile/Jelena-Iden"
                },
                {
                    "user_id": "Corina Okechukwu",
                    "user_href": "/profile/Corina-Okechukwu"
                },
                {
                    "user_id": "Corinne Preis",
                    "user_href": "/profile/Corinne-Preis"
                },
                {
                    "user_id": "Emma Skinner",
                    "user_href": "/profile/Emma-Skinner-5"
                },
                {
                    "user_id": "Brooke Matthews",
                    "user_href": "/profile/Brooke-Matthews-19"
                },
                {
                    "user_id": "Jenna Todas",
                    "user_href": "/profile/Jenna-Todas"
                },
                {
                    "user_id": "John Rippen",
                    "user_href": "/profile/John-Rippen"
                }
            ]
        },
        {
            "author_info": {
                "name": "Loren Daemon",
                "href": "/profile/Loren-Daemon"
            },
            "answer_text": "…you know, I just realized I basically don't? And this isn't something I hear discussed so I don't actually know? I suspect it varies like everything else to do with autistic people, but as autistic people are often the subjects of uncanny valley type feelings we're more likely on average to sympathize with or find innocuous things that others find creepy. They already say we're like mannequins, after all. Why wouldn't we be given to sympathy for them? ",
            "date": "Answered March 11, 2020",
            "views": "139",
            "upvotes": " View 5 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Diego Mendoza",
                    "user_href": "/profile/Diego-Mendoza-34-1"
                },
                {
                    "user_id": "Emma Skinner",
                    "user_href": "/profile/Emma-Skinner-5"
                },
                {
                    "user_id": "Carl Illingworth",
                    "user_href": "/profile/Carl-Illingworth"
                },
                {
                    "user_id": "Clare Anne Del Mundo",
                    "user_href": "/profile/Clare-Anne-Del-Mundo"
                },
                {
                    "user_id": "Saleh Abdel Motaal",
                    "user_href": "/profile/Saleh-Abdel-Motaal"
                }
            ]
        },
        {
            "author_info": {
                "name": "Carl Illingworth",
                "href": "/profile/Carl-Illingworth"
            },
            "answer_text": "This is a great question. I don't think the answer is black and white. Many of us on the autism spectrum suffer from alexithymia and this can make it difficult or cause feelings to fluctuate. I do believe heightened curiosity is a common autistic trait and we tend to not be judgemental because we know how unpleasant it feels. We tend to like to take the time to learn and understand something but can become easily overwhelmed too. This can make us less likely to fear what we don't understand and we may not be bothered by how lifelike a robotic may appear - we may in fact be quite fascinated by it. Some of us have sensory processing issues though and may feel that something so lifelike is quite discomforting. For me I feel a mixture of both due to alexithymia. Sometimes I'm deeply fascinated by anything unusual or out of the ordinary, but can at times feel quite uncomfortable, overloaded or even confused. ",
            "date": "Answered March 12, 2020",
            "views": "71",
            "upvotes": " Answer requested by Diego Mendoza",
            "upvoters": [
                {
                    "user_id": "Adam Sanford",
                    "user_href": "/profile/Adam-Sanford-3"
                },
                {
                    "user_id": "Saleh Abdel Motaal",
                    "user_href": "/profile/Saleh-Abdel-Motaal"
                }
            ]
        },
        {
            "author_info": {
                "name": "Anne Martin",
                "href": "/profile/Anne-Martin-145"
            },
            "answer_text": "I’m not sure what your question means. Are you asking if autists experience people as humanoid but not entirely human? As an autist, l am prone to view non autistic behavior as undesirable. But they probably can’t help themselves and this is just the “human condition” that we all have to live with, no matter how dysfunctional and destructive it might be. ",
            "date": "Updated March 21, 2020",
            "views": "52",
            "upvotes": " Answer requested by Diego Mendoza",
            "upvoters": [
                {
                    "user_id": "Adam Sanford",
                    "user_href": "/profile/Adam-Sanford-3"
                },
                {
                    "user_id": "Carl Illingworth",
                    "user_href": "/profile/Carl-Illingworth"
                }
            ]
        },
        {
            "author_info": {
                "name": "Caroline James",
                "href": "/profile/Caroline-James-47"
            },
            "answer_text": "I do. Unlike some others I'm unable to respond with certainty about robots because I have no personal experience of them, but I'm fairly confident that I would experience it with them. I do experience it with clowns and certain other ‘masked' types of characters. It's not the mask itself, since not all masks set off the reaction. But wherever the ‘mask' isn't to conceal identity, but to conceal thoughts, emotions, personality, and so forth it really creeps me the f*ck out. Anything could be hidden beneath such a mask. ",
            "date": "Answered March 11, 2020",
            "views": "42",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Jacobina Bondess",
                "href": "/profile/Jacobina-Bondess"
            },
            "answer_text": "Yes I think so. I’m fascinated by human-looking robots but indeed, ‘creeped out’ at the same time.They could serve me dinner but I wouldn’t like one staying in my house while I’m asleep. But some people think I’m freaky so who am I to talk,lol. MWA HA HA. I’ve had too many sweets,sorry… ",
            "date": "Answered March 11, 2020",
            "views": "63",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Oleg Volkov",
                    "user_href": "/profile/Oleg-Volkov-29"
                },
                {
                    "user_id": "Diego Mendoza",
                    "user_href": "/profile/Diego-Mendoza-34-1"
                },
                {
                    "user_id": "Saleh Abdel Motaal",
                    "user_href": "/profile/Saleh-Abdel-Motaal"
                }
            ]
        },
        {
            "author_info": {
                "name": "Ilya Taytslin",
                "href": "/profile/Ilya-Taytslin"
            },
            "answer_text": "Do people with autism spectrum disorders experience the uncanny Valley? I do not. I do not find near-human androids and CGI images scary or off-putting. I find them beautiful, or fascinating, or both. For a long time I thought that “Uncanny Valley” is just a nonsense someone made up and it went viral, like “people use 10% of their brain”. Eventually I learned it is very real, but apparently not for me. ",
            "date": "Answered March 11, 2020",
            "views": "112",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Adam Sanford",
                    "user_href": "/profile/Adam-Sanford-3"
                }
            ]
        },
        {
            "author_info": {
                "name": "James Smith",
                "href": "/profile/James-Smith-4601"
            },
            "answer_text": "Oh man, big time. Not with robots though. Humans with facial plastic surgery. Not the reconstructive surgeries, but the cosmetic ones. They set off my ancient instinctual alarms big time. What is called The Uncanny Valley. My experience only. Be well. ",
            "date": "Answered March 14, 2020",
            "views": "50",
            "upvotes": " View 3 Upvoters"
        },
        {
            "author_info": {
                "name": "Megan Touchton",
                "href": "/profile/Megan-Touchton-1"
            },
            "answer_text": "For me, it's not so much with entertainment (let's face it, Moff Tarkin was pretty spot on 🤤)--it's in real life. People get very strange looking when they're lying. Not so much the “get out of trouble” lies that most people tell (when the emergency calls for it), but the polite, “pretending to like someone/something s/he hates”, or when going through the motions of “saying things you have to say because it's polite rather than accurate”. Seriously. It's both creepy and unsettling to witness people lying to each other. ",
            "date": "Answered March 11, 2020",
            "views": "88",
            "upvotes": " View 1 Upvoter"
        }
    ]
}