{
    "title": "Do phones with LCD display tend to be more durable than smartphones with OLED display (lifespan)? - Quora",
    "tags": [
        "OLED Displays",
        "Liquid-Crystal Display (LCD)",
        "Product Reviews"
    ],
    "response": [
        {
            "author_info": {
                "name": "Mark Penrice",
                "href": "/profile/Mark-Penrice"
            },
            "answer_text": "I can only give an anecdotal example here, but my current phone is a Samsung S5 Mini that I’ve had for more than five years now… it has an AMOLED display, and I haven’t noticed any problems with it at all. It’s still bright, no burn in, no colour cast, no missing pixels, and the flickering problem it had at low brightness settings when I first bought it was cured by an OS update. It’s also proven to be an exceptionally rugged phone, especially in a slimline rubberised case, shrugging off the kind of impacts that led to my previous phone’s (HTC Desire S) screen becoming noticeably cracked in short order. Until spring last year it was pristine, and it took an accident I then suffered, where I slipped and fell between the step onto a train and the station platform, landing very heavily against the train floor with the phone in my hand and the case open, to cause even the slightest of hairline fractures, that you can only really see or feel if you’re trying to find it, and a slight crack to the cosmetic rear case. So if modern LCD based models can improve on that, then they must be essentially indestructible. ",
            "date": "Answered November 9, 2019",
            "views": "34",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Charles Heinz",
                "href": "/profile/Charles-Heinz-1"
            },
            "answer_text": "I have never heard of an LCD display such as IPS burning in. I did however hear numerous horror stories of OLED displays such as Samsung’s Super AMOLED displays being burned in. There are some people who say that it takes a really long time to notice it. I never bought a phone or any other device with any kind of OLED or AMOLED display. I want one I can hold onto for as long as I want to without worrying about my phone’s display self deteriorating. If you look on eBay for any Samsung phone it is mentioned in many listings that the display is burned in. That is something you may want to consider if you would prefer a device that is not prone to this built in defect. Any and all phones that come with OLED, AMOLED or Super AMOLED displays are technically defective as soon as they are manufactured just because of the inherent burn in issues with those display technologies. Samsung phones would be the best if they did not burn in. Burn in is the only real problem with them that I know of. ",
            "date": "Answered December 4, 2017",
            "views": "105",
            "upvotes": " View 11 Upvoters",
            "upvoters": [
                {
                    "user_id": "Saptarshi Chatterjee",
                    "user_href": "/profile/Saptarshi-Chatterjee-20"
                },
                {
                    "user_id": "Den Dent",
                    "user_href": "/profile/Den-Dent"
                },
                {
                    "user_id": "Joseph Costa",
                    "user_href": "/profile/Joseph-Costa-19"
                },
                {
                    "user_id": "Giear Yaldua",
                    "user_href": "/profile/Giear-Yaldua"
                },
                {
                    "user_id": "Tuấn Minh Vũ",
                    "user_href": "/profile/Tuấn-Minh-Vũ-3"
                },
                {
                    "user_id": "Jerry McGuire",
                    "user_href": "/profile/Jerry-McGuire-12"
                },
                {
                    "user_id": "Mohnish Dutta",
                    "user_href": "/profile/Mohnish-Dutta"
                }
            ]
        },
        {
            "author_info": {
                "name": "David Vanderschel",
                "href": "/profile/David-Vanderschel"
            },
            "answer_text": "Given that it is an active technology with light being emitted at the pixel level, you can expect such displays will not last as long. (LCD screens are just filters with the light coming from a separate backlight.) However, it is also reasonable to expect that they will last long enough that their lifetime consideration does not deserve a great deal of weight in a purchase choice. You may also wish to take into consideration that the backlight for an LCD screen can also fail. ",
            "date": "Answered September 4, 2019",
            "views": "25",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Giulio Moro",
                "href": "/profile/Giulio-Moro-1"
            },
            "answer_text": "That's a biased and debatable question by many scientists and consumers. In my opinion, OLEDs are still in their infancy and have a few more years to become a more stable and reliable product than LCD. Some older LCDs were very poorly made, similar to early OLEDs, but LCDs quickly became more and more stable and better designed. Eventually OLEDs will completely replace LCDs. ",
            "date": "Answered December 4, 2017",
            "views": "26",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Active Learning",
                    "user_href": "/profile/Active-Learning-1"
                },
                {
                    "user_id": "Ankita Sharma",
                    "user_href": "/profile/Ankita-Sharma-2266"
                },
                {
                    "user_id": "Nico Bellice",
                    "user_href": "/profile/Nico-Bellice"
                },
                {
                    "user_id": "Subho Chowdhury",
                    "user_href": "/profile/Subho-Chowdhury-20"
                },
                {
                    "user_id": "Adel Al Jammal",
                    "user_href": "/profile/Adel-Al-Jammal-1"
                },
                {
                    "user_id": "David Agung Immanuel",
                    "user_href": "/profile/David-Agung-Immanuel"
                },
                {
                    "user_id": "Abhimanyu Singh",
                    "user_href": "/profile/Abhimanyu-Singh-378"
                },
                {
                    "user_id": "Jerry McGuire",
                    "user_href": "/profile/Jerry-McGuire-12"
                },
                {
                    "user_id": "Zoran Tasić",
                    "user_href": "/profile/Zoran-Tasić"
                },
                {
                    "user_id": "Mani Eswar",
                    "user_href": "/profile/Mani-Eswar-1"
                },
                {
                    "user_id": "Alexito Pro",
                    "user_href": "/profile/Alexito-Pro"
                }
            ]
        },
        {
            "author_info": {
                "name": "Mark Alan",
                "href": "/profile/Mark-Alan-61"
            },
            "answer_text": "They are more prone to burn in, if the display has the same image on it for too long. I think both technologies last longer than you would care to use them. I had an LCD monitor that was 12yrs old and it died… but a capacitor on the board blew, nothing to do with the panel ",
            "date": "Answered July 28, 2018",
            "views": "16",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Big Red",
                    "user_href": "/profile/Big-Red-75"
                },
                {
                    "user_id": "Thien Nguyen",
                    "user_href": "/profile/Thien-Nguyen-229"
                },
                {
                    "user_id": "Alexito Pro",
                    "user_href": "/profile/Alexito-Pro"
                }
            ]
        }
    ]
}