{
    "title": "Do phone cameras need that protective glass on top of them in order to focus clearly? Can they take pictures without it? - Quora",
    "tags": [
        "Smartphone Cameras",
        "Digital Cameras",
        "Cameras",
        "Photography"
    ],
    "response": [
        {
            "author_info": {
                "name": "Dave Haynie",
                "href": "/profile/Dave-Haynie"
            },
            "answer_text": "The protective bit of glass (often sapphire glass or higher-hardness Gorilla Glass than the rest of the phone) is there to, well, protect the phone’s lens. It has absolutely nothing to do with focusing. Why? Well, two big reasons. The first one is that many phone cameras use very soft plastic lenses. So rather than expose a front lens element that would be scratched after your phone’s first week of pocket life and the occasional lens-wipe-on-the-shirttail, it’s behind a piece of glass that can only be scratched by diamonds and otherwise takes any likely abuse. The second reason is that just about any phone camera with image stabilization has a floating camera assembly. The front of the sensor assembly isn’t fixed to the body of the phone at all. Without that protective cover, the area around the camera module would fill with all kinds of schmutz. Eventually, it wouldn’t just fuzz out your shot, but get caught up in the works of the camera itself. So I know what you’re thinking — maybe you know how image stabilization works in “real” cameras, eh? Well, maybe… there are actually three methods. The first is optical image stabilization (OIS), in which an element group in the lens is magnetically “floating”. Motion detectors feed to the magnets controlling the float, causing the element to pivot and, within reason, to correct for that motion. And there’s also in-body image stabilization (IBIS). This makes the sensor subassembly magnetically suspended. Motion detectors detect camera movement and offset that motion by tilting the sensor in various ways. But we can also stabilize a camera by moving the whole camera against motion. This is what gimbal mounts like Steadicams do.  Some tiny phone cameras have used OIS methods, but with such a small lens it’s quite difficult. And it would be similarly difficult to move just the sensor. So why not move the whole camera: sensor, lens, and all. And so that’s what the best image stabilization systems on phones do: they move the camera. But in order for that to work, the camera compartment has to be sealed from the outside. Thus the protective glass. The snippet of patent here, by the way, is from Apple. Plenty of companies had this sort of phone stabilization prior to Apple, but they have their own ideas about it, of course. ",
            "date": "Answered September 25, 2018",
            "views": "92",
            "upvotes": " View 27 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Kevin Huberty",
                    "user_href": "/profile/Kevin-Huberty-3"
                },
                {
                    "user_id": "Saikumar Benal",
                    "user_href": "/profile/Saikumar-Benal-2"
                },
                {
                    "user_id": "Sachin Upadhyay",
                    "user_href": "/profile/Sachin-Upadhyay-153"
                },
                {
                    "user_id": "Yash Sharma",
                    "user_href": "/profile/Yash-Sharma-1070"
                },
                {
                    "user_id": "Andre Leong",
                    "user_href": "/profile/Andre-Leong"
                },
                {
                    "user_id": "Jason Li",
                    "user_href": "/profile/Jason-Li-181"
                },
                {
                    "user_id": "Joran Brensdal",
                    "user_href": "/profile/Joran-Brensdal"
                },
                {
                    "user_id": "Iain Garden",
                    "user_href": "/profile/Iain-Garden"
                },
                {
                    "user_id": "Alan Lee",
                    "user_href": "/profile/Alan-Lee-307"
                },
                {
                    "user_id": "Micheal Maxwell",
                    "user_href": "/profile/Micheal-Maxwell-7"
                },
                {
                    "user_id": "Andrew Lindsey",
                    "user_href": "/profile/Andrew-Lindsey-3"
                },
                {
                    "user_id": "Niven A. Nolte",
                    "user_href": "/profile/Niven-A-Nolte-1"
                },
                {
                    "user_id": "Jenna Watkins",
                    "user_href": "/profile/Jenna-Watkins-4"
                },
                {
                    "user_id": "Nic Wong",
                    "user_href": "/profile/Nic-Wong-16"
                },
                {
                    "user_id": "Moray Taylor",
                    "user_href": "/profile/Moray-Taylor"
                },
                {
                    "user_id": "David Schwartz",
                    "user_href": "/profile/David-Schwartz-15"
                },
                {
                    "user_id": "Jobst von Steinsdorff",
                    "user_href": "/profile/Jobst-von-Steinsdorff"
                },
                {
                    "user_id": "Luv Kapur",
                    "user_href": "/profile/Luv-Kapur"
                },
                {
                    "user_id": "Rob Lion",
                    "user_href": "/profile/Rob-Lion"
                },
                {
                    "user_id": "Timothy Shek",
                    "user_href": "/profile/Timothy-Shek"
                },
                {
                    "user_id": "Vladislav Zorov",
                    "user_href": "/profile/Vladislav-Zorov"
                },
                {
                    "user_id": "Gordon Plant",
                    "user_href": "/profile/Gordon-Plant"
                },
                {
                    "user_id": "Niels Peter Rasmussen",
                    "user_href": "/profile/Niels-Peter-Rasmussen"
                },
                {
                    "user_id": "David Menéndez Hurtado",
                    "user_href": "/profile/David-Menéndez-Hurtado"
                },
                {
                    "user_id": "Yaaseen Bodhanya",
                    "user_href": "/profile/Yaaseen-Bodhanya"
                },
                {
                    "user_id": "Sagar Ramchandani",
                    "user_href": "/profile/Sagar-Ramchandani-5"
                },
                {
                    "user_id": "Kavitha Davay",
                    "user_href": "/profile/Kavitha-Davay"
                }
            ]
        },
        {
            "author_info": {
                "name": "Moshe Shegal",
                "href": "/profile/Moshe-Shegal"
            },
            "answer_text": "By “protective glass” are you referring to the gorilla glass covering phone’s camera lenses. If so, then yes. You wouldn’t need it if you put you’re phone on a flat surface with no foreign particles. Otherwise, you do. Think about it, you carry your phone with you and your pocket and it’s usually not there alone. Usually you have keys or something metallic like a lighter. The point is without glass your lenses are extremely vulnerable to the environment. Don’t worry too much about the glass itself being damaged. Most high-end smartphones use gorilla glass or sapphire to prevent any scratches (visible ones at least). Your keys are usually made of a softer brass so even then the likelyhood of scratch marks appearing on the lenses are rare. I hope i answered your question :) ",
            "date": "Answered September 25, 2018",
            "views": "11",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Swapnaneel Bhattacharjee",
                    "user_href": "/profile/Swapnaneel-Bhattacharjee"
                },
                {
                    "user_id": "Kevin Huberty",
                    "user_href": "/profile/Kevin-Huberty-3"
                },
                {
                    "user_id": "Jay Kenn Morales",
                    "user_href": "/profile/Jay-Kenn-Morales"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/Ana-Johnson-60"
                }
            ]
        },
        {
            "author_info": {
                "name": "Martin Sol",
                "href": "/profile/Martin-Sol-1"
            },
            "answer_text": "The protective glass is not meant to be involved optically. In an ideal case, it shoul be just a hard planparallel glass meant to protect the lenses and internals against scratches, dust and moisture. So the camera should be able to focus and take images clearly without the protective glass. However, it will probably be damaged or dead soon. ",
            "date": "Answered September 26, 2018",
            "views": "239",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Kevin Huberty",
                    "user_href": "/profile/Kevin-Huberty-3"
                }
            ]
        }
    ]
}