{
    "title": "Do people hunt down FBI's most Wanted for a living? If so, what are some tips on catching a fugitive? - Quora",
    "tags": [
        "Most Wanted",
        "Federal Bureau of Investigation"
    ],
    "response": [
        {
            "author_info": {
                "name": "Jon Mixon",
                "href": "/profile/Jon-Mixon-1"
            },
            "answer_text": "There are some people who for a hobby hunt the FBI's Ten Most Wanted using available tools on the Internet and a network of people who they know to do so. If history is any indication, the overwhelming majority of these amateur sleuthing contests are miserable failures. Why?  Of the current FBI 2013 Top Ten at least one is in Cuba - Víctor Manuel Gerena, A supporter of Puerto Rican independence and a former armored car guard has been in Cuba for more than 20 years. Until Cuba decides to arrest and extradite him,he's likely not going anywhere.At least four are in Mexico - Again, without the cooperation of Mexican authorities, it is unlikely that even the FBI would be able to capture and extradite them.One is in Moscow,Russia and is living rather openly - Semion Yudkovich Mogilevich is a Russian national who is a multi-billionaire and has supporters in the Russian government and military. Given his connections and his wealth, it unlikely that even the FBI will be able to extradite this person without the cooperation of the Russian authorities.Two are possibly deceased - Without investing significant resources, it is unlikely that their whereabouts will be determined by even the FBI, much less private parties.Two have been recently captured - They are now off of the list and will be replaced by other fugitives.That leaves a single fugitive, Jason Derek Brown, who is on the loose and who would could be hunted by both amateurs and the by law enforcement. However, Brown (who is wanted for  the murder of an armed guard during a robbery) is armed and should be considered extremely dangerous. Going after him could be dangerous for law enforcement and would likely be exceptionally so for civilians. Frankly, anyone who makes it to FBIs Ten Most Wanted are likely so dangerous or have access to so many assets that a search for them would likely require the resources of a state-level actor. And, even then, chances of catching them would be exceptionally low. If you see, or you believe that you have seen, a member of FBI's Ten Most you should contact the FBI in your area and the local police. You should give them as many details as possible about what you have seen and where you saw it.   UPDATED 9/3/2013 http://www.fbi.gov/wanted/topten ",
            "date": "Updated September 3, 2013",
            "views": "78",
            "upvotes": " View 17 Upvoters",
            "upvoters": [
                {
                    "user_id": "Kyle Sheq",
                    "user_href": "/profile/Kyle-Sheq"
                },
                {
                    "user_id": "Kendra Mowry",
                    "user_href": "/profile/Kendra-Mowry"
                },
                {
                    "user_id": "Michael Roehm",
                    "user_href": "/profile/Michael-Roehm-1"
                },
                {
                    "user_id": "James Lingren",
                    "user_href": "/profile/James-Lingren-1"
                },
                {
                    "user_id": "Charles Jenkins",
                    "user_href": "/profile/Charles-Jenkins-128"
                },
                {
                    "user_id": "Andy Trump",
                    "user_href": "/profile/Andy-Trump-1"
                },
                {
                    "user_id": "Rajkumar Singh",
                    "user_href": "/profile/Rajkumar-Singh-617"
                },
                {
                    "user_id": "Kyle Wilson",
                    "user_href": "/profile/Kyle-Wilson-36"
                },
                {
                    "user_id": "Jayson Dougherty",
                    "user_href": "/profile/Jayson-Dougherty-1"
                },
                {
                    "user_id": "William Lim",
                    "user_href": "/profile/William-Lim-47"
                },
                {
                    "user_id": "Al Su",
                    "user_href": "/profile/Al-Su-17"
                },
                {
                    "user_id": "Robert Martel",
                    "user_href": "/profile/Robert-Martel-9"
                },
                {
                    "user_id": "Tim White",
                    "user_href": "/profile/Tim-White-30"
                },
                {
                    "user_id": "Carolyn Nasuti",
                    "user_href": "/profile/Carolyn-Nasuti"
                },
                {
                    "user_id": "Paul Unterberg",
                    "user_href": "/profile/Paul-Unterberg"
                },
                {
                    "user_id": "Mike Farkas",
                    "user_href": "/profile/Mike-Farkas"
                },
                {
                    "user_id": "Dharav Solanki",
                    "user_href": "/profile/Dharav-Solanki"
                }
            ]
        },
        {
            "author_info": {
                "name": "Albert Neal",
                "href": "/profile/Albert-Neal-5"
            },
            "answer_text": "There are what are typically called “Bounty Hunters “…more active in busier jurisdictions than others. But they usually pursue fugitives from various courts, etc…not just the FBI's. ",
            "date": "Answered January 29, 2020",
            "views": "284",
            "upvotes": "0"
        }
    ]
}