{
    "title": "Do students learn better in co-education schools or single sex schools? - School Experiences - Quora",
    "tags": [
        "Elementary School and Elementary Schools",
        "The High School Experience"
    ],
    "response": [
        {
            "author_info": {
                "name": "Katherine Whelchel",
                "href": "/profile/Katherine-Whelchel"
            },
            "answer_text": "I want to talk about the value of single sex education in middle school because it was really good experience for me as a female All my teachers were women, there were no boys to distract or put me down for being smart, and I was put in classes where all of us were focused on learning. I had a college type schedule, not the same routine every day, which gets really boring in public school. I took French, Latin, and Greek which also helped my college science studies. I attended the Bryn Mawr School for Girls in Baltimore MD and it was a fantastic education. ",
            "date": "October 7, 2020",
            "views": "529",
            "upvotes": " View 5 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Zayed Ahmed",
                    "user_href": "/profile/Zayed-Ahmed-11"
                },
                {
                    "user_id": "Aika Aika",
                    "user_href": "/profile/Aika-Aika-2"
                },
                {
                    "user_id": "Larenne Taylor",
                    "user_href": "/profile/Larenne-Taylor"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/Fruitsbasket-Rocks"
                },
                {
                    "user_id": "Abu Khan",
                    "user_href": "/profile/Abu-Khan-153"
                }
            ]
        },
        {
            "author_info": {
                "name": "Steven McGlinn",
                "href": "/profile/Steven-McGlinn"
            },
            "answer_text": "If you look at the research, Girls do better in single sex schools and Boys do worse. There are reasons but to say why tends to cause offense to one sex or the other, so i will leave it there. the trouble is, most people arguing in this issue try to say look at both groups and treat the issue as if it is better for both gender or worse for both gender as they will not accept that the answer tends to be gender specific in this case, but may not for other issues. . ",
            "date": "October 16, 2020",
            "views": "582",
            "upvotes": " View 2 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Ghaid S",
                    "user_href": "/profile/Ghaid-S"
                },
                {
                    "user_id": "Abu Khan",
                    "user_href": "/profile/Abu-Khan-153"
                }
            ]
        },
        {
            "author_info": {
                "name": "Hannah Nicetin",
                "href": "/profile/Hannah-Nicetin"
            },
            "answer_text": "It probably depends on the students and their desire to learn. I’m in highschool and in my experience discussions are much more in depth when there are both girls and boys in the class, because they often have different perspectives. However, some girls act up when there are boys in the class, and vice-versa, which would make it more difficult to learn. ",
            "date": "September 30, 2020",
            "views": "644",
            "upvotes": " View 4 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Thiago Winters",
                    "user_href": "/profile/Thiago-Winters-1"
                },
                {
                    "user_id": "Keshauma Adams",
                    "user_href": "/profile/Keshauma-Adams"
                },
                {
                    "user_id": "Jana Hekal",
                    "user_href": "/profile/Jana-Hekal"
                },
                {
                    "user_id": "Manar Hassan",
                    "user_href": "/profile/Manar-Hassan-33"
                }
            ]
        }
    ]
}