{
    "title": "Do shorter phone charger cables charge faster? - Quora",
    "tags": [
        "Battery Charging",
        "Mobile Phone Chargers",
        "Battery Chargers",
        "Batteries",
        "Electronics"
    ],
    "response": [
        {
            "author_info": {
                "name": "Mark Sin",
                "href": "/profile/Mark-Sin-1"
            },
            "answer_text": "It depends. The following analysis is for a common case of using a USB cable to power a device such as a phone such that the device’s battery can be charged by the device’s charger. They may. If you compare two cables built from the same wire or cable material, one short and one long, the shorter one should charge faster. That’s because the resistance of the cable is proportional to its length. The shorter cable will have less resistance. The result will be the voltage drop across the cable due to the resistance is lower. Say the USB port gives 5.0 V on the output. The device draws say 2A. A short cable may have a drop of 0.1 V but a long could be 0.2V. So less power will be delivered to the end device over the cable, more will be dissipated (lost) from the cable. Also some devices need a minimum voltage to charge. This can apply to some types of chargers (the circuit in the device doing the charging) when charging a nearly full battery. They may even have to back off on charging speed to reduce current to get the voltage back to where it is sufficiently above the battery voltage to progress and the added resistance of a long cable could also make a difference there. ",
            "date": "Answered June 25, 2019",
            "views": "2",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Brian Nebeker",
                "href": "/profile/Brian-Nebeker-2"
            },
            "answer_text": "The phone charging controllers determines the battery charge rate. However, the (phone charger) has limits to how much power it can provide, as long as the charger can provide enough power it will charge as fast as the charger circuit wants. The battery control circuit also monitors the temperature of the battery and will reduce the charge current if the temperature gets to high. The temperature of the phone circuitry may also be monitored as well. This ensures that heat from the power connector does not damage the phone. The longer a cable is the more power is converted to heat, so a long cable may limit the charge rate due to excess losses in the cable. However, if you use a quality cable the length of the cable should not become a problem for lengths up to around 6 feet or so. However many charging cables use very small wires and cheap connectors which can result in problems even with shorter length cables. If you have a phone that supports fast charging and a phone charger than supports fast charger you best bet is to use a shorter cable to ensure the best performance. ",
            "date": "Answered August 4, 2020",
            "views": "278",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Richard Taylor",
                "href": "/profile/Richard-Taylor-147"
            },
            "answer_text": "It depends on the specific circumstances. In general, there should be very little difference. The bigger factor is the current output capability of the charger. Most USB phone chargers deliver between 4.75 and 5.25 volts, while a phone battery might be only 3.6 volts. Providing the phone requires less current than the charger can supply, then the phone’s charging circuits will limit the average current to the phone’s requirements, which will diminish rapidly when the phone reaches full charge. If the charger cannot deliver the current the phone requires, then the voltage will to fall to the point where the current the phone receives matches what the charger can deliver. Unless you have a poor quality cable, the length of the cable should make only a few millivolts difference to what the phone receives. Providing there is sufficient current, then the phone will still draw only what it needs. If there is insufficient current from the charger, then the voltage at the phone will drop to a level where the charger can supply the current. It makes no difference whether the voltage drop occurs at the charger’s port or some of the drop is in the cable. The phone still gets the same voltage and it gets the full current the charger can provide. If there is a voltage drop in the cable, the charger output voltage will be higher to compensate for the loss in the cable. In either case, the voltage from the charger in this overloaded situation will be somewhere between 3.6 and 4.75 volts. Only if the cable has such a stupendous resistance that the voltage in the cable is somewhere over a volt will the cable length become significant. ",
            "date": "Answered March 4, 2019",
            "views": "41",
            "upvotes": " View 6 Upvoters",
            "upvoters": [
                {
                    "user_id": "Jose David Marulanda",
                    "user_href": "/profile/Jose-David-Marulanda"
                },
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/Biogenic-RSA"
                },
                {
                    "user_id": "Roberto Santocho",
                    "user_href": "/profile/Roberto-Santocho"
                },
                {
                    "user_id": "Sapphire Jones",
                    "user_href": "/profile/Sapphire-Jones-15"
                },
                {
                    "user_id": "Chibogu Evanson",
                    "user_href": "/profile/Chibogu-Evanson"
                },
                {
                    "user_id": "Mike Whitman",
                    "user_href": "/profile/Mike-Whitman"
                }
            ]
        },
        {
            "author_info": {
                "name": "Sean McKiernan",
                "href": "/profile/Sean-McKiernan"
            },
            "answer_text": "I’d assume you’re talking about cables when you say “shorter”, not chargers. Resistance of a wire increases with length. If you were to compare the current flow at a set voltage between a 20 foot cable and a 3 foot cable, you would find that the long cable allows less current to flow. But if you’re comparing a 3 foot to a 6 foot cable, the difference would be negligible. ",
            "date": "Answered March 1, 2019",
            "views": "796",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Ahmet Açıkyıldız",
                    "user_href": "/profile/Ahmet-Açıkyıldız"
                }
            ]
        }
    ]
}