{
    "title": "Do smartphones produce radiation all the time? - Quora",
    "tags": [
        "Electromagnetic Radiation",
        "Radiation",
        "Mobile Phones",
        "Physics of Everyday Life",
        "Technology"
    ],
    "response": [
        {
            "author_info": {
                "name": "Stanley Hutchinson",
                "href": "/profile/Stanley-Hutchinson"
            },
            "answer_text": "I have to qualify this answer. What do you mean by Radiation??? if you mean RF (Radio Frequency), you can shut that off with one easy step. put it in “airplane” and it will stop pinging the nearest “Cell Tower” to provide it’s (the cell’s) location and to establish and maintain a constant on connectionif you just put it in a “aluminum” cover without putting the cell phone in “airplane mode” it will quickly run down the battery BECAUSE it will keep “pinging” the nearest tower to try to establish it’s location. But since it cannot because the aluminum is shielding (blocking) the signal it will keep trying the ping and run down the battery in a few hours: I know I tried it.If you have an LG or older model Samsung you can put it in Airplane mode, then open the back cover and remove the battery and voila, no radiation and no signal to the nearest tower.If you’re concerned about the N.S.A listening to your device or law enforcement tracking your where abouts, (using a device and program called “STINGRAY”) just putting the phone in airplane mode (the cell will NOT PING and not give it’s location) will defeat that because where it cannot ping it provides no location, metadata or eaves dropping on your conversation or text. That said, you will “NOT” be RECEIVING any TEXT or PHONE CALLS while it’s in this ‘airplane’ mode. I will be held by your providers system and as soon as you take the phone out of ‘airplane mode’ and put it back on to the cell tower connection, a flood of text that you received and voice mails will be coming through bing-bing-bing-bing-bing while you were away.- Watch this program (“STELLAR WIND” on the NSA spying and “STINGRAY”) they can listen in on your “cell phone call” even when the phone is “off” and track everywhere you went and metadata (“Stingray” via Triangulation of the three nearest cell towers); the exception is if it is in “airplane mode” and / or the battery is removed. YOUR CELL PHONE IS ALWAYS ON AND TRANSMITTING (this is also true for you home land line using it’s Cat3 wires - it is ALWAYS TRANSMITTING EVEN WITH NO DIAL TONE AND THE RECEIVER HANDLE DOWN, as long as that Cat3 has a low voltage it is always transmitting-the dial tone just tells it to listen for the dial numbers) (you have to disconnect the RJ-11 wire from the phone land line for it to not listen) when ever it’s on with the exception of “Airplane mode” so you don’t interfere with your flight while on the flight it blocks your cell signal. So whether you are on the flight or not “airplane mode” will block all call signal and pings to report your location and metadata. William (Bill) Binney was America’s top code breakers.The man with the white hair in the video at about the 1:50 minute mark in the Stellar Wind video is the famous Danny Ellsberg from the Rand Think Tank Corporation in Santa Monica, CA. Ellsberg was the “Whistleblower” who outed the “Pentagon Papers” during the Vietnam War that the whole VN war was bogus and the “Gulf of Tonkin” incident never happened. LBJ & Nixon & McNamara all KNEW “Gulf of Tonkin” incident never happened and the U.S. Pentagon manufactured that incident to start VN war and get U.S. into that war to attack the North VNese. Nixon was going to have Ellsberg tried for Treason under the “Espionage Spy Act” but right then “Watergate” break-in happened and Nixon ran for his life and resigned so no charges were ever filed U.S. vs. Ellsberg. Unlike Edward Snowden who’s wanted under the same Spy Act for whistleblowing on the NSA. NSA Whistle-Blower Tells All: The Program | Op-Docs | The New York Times - Is Stingray Technology Illegal or Unethical? ('Truth and Power': Episode 3 Clip) if you are concerned about “EMF” Electrical Magnetic Field ‘radiation’ that all electrical devices give out. Once the phone is on it will always produce this whether in airplane mode or not. Just being on it generates this EMF field. You can test that with the right tester. The only way to stop the EMF is to either remove the battery or shield it in an aluminum wrapper. Then it’s pretty safe from EMF radiation.On EMF, I once worked right next to this software programmer / developer and he had these two HUGE 24″ old TV style monitors RIGHT in FRONT of him just a few inches from his face and chest: (not the LCD/LED flat screens most people have now). And I casually mentioned to him, “you know your cooking yourself and Irradiating yourself with those two monitors right???” And he whipped out his EMF tester and turned it on and tested the EMF to show me his tester showed no signal and he was ‘getting nothing’ in ‘radiation’. I laughed and said wait until I bring in my tester tomorrow. The next day when I turned on my tester, it went “EEEEEEEEEEEEE” with the SOLID & CONSTANT audio signal and the LED went solid all the way to the RED. His face lost all color. I said you should be getting nothing, it should read ZERO with no Audio signal. Not a solid constant “E” beep. I said, your tester is “lame” because it’s testing the “wrong” frequency so nothing will show up. Mine tests the right frequency.",
            "date": "Answered June 4, 2016",
            "views": "584",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Tsvetan Borisov",
                    "user_href": "/profile/Tsvetan-Borisov"
                },
                {
                    "user_id": "Andrew Daviel",
                    "user_href": "/profile/Andrew-Daviel"
                },
                {
                    "user_id": "Anand Bhardwaj",
                    "user_href": "/profile/Anand-Bhardwaj-11"
                }
            ]
        },
        {
            "author_info": {
                "name": "Andrew Daviel",
                "href": "/profile/Andrew-Daviel"
            },
            "answer_text": "Cellphones do not emit ionizing radiation, at all (X-rays etc, that give you cancer). They emit visible light (from the screen), thermal infrared radiation (unless they are cooled to absolute zero) and radio waves (cellular, wifi and bluetooth). None of that is dangerous; it’s at much too low a power to cook your eyeballs. As Stanley says, when the phone is on (not in airplane mode) it transmits every 10 minutes or so to stay in contact with a tower. The closer the tower, the less power it uses (it adapts to the cell size to save battery and to minimize interference with more distant cells). It’s not at all dangerous - there is no physical basis for any biological effect - though if you think it is, the nocebo effect can perhaps make you sick, and worrying can cause stress and physical symptoms. ",
            "date": "Answered June 5, 2016",
            "views": "380",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Ozgun Jim",
                    "user_href": "/profile/Ozgun-Jim"
                }
            ]
        },
        {
            "author_info": {
                "name": "Jarrett Embry",
                "href": "/profile/Jarrett-Embry"
            },
            "answer_text": "Of course there is radiations coming from your cell phone and from wifi at all times. Connectivity requires this radiation to continuously be coming to and from your device. However, this radiation is not harmful in any way to people, and that’s why our life expectancy hasn’t suddenly dropped off in the past couple decades as now everyone is exposed to these kinds of radiation, because they are harmless radiation. ",
            "date": "Answered June 4, 2016",
            "views": "279",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Anjan Kailash",
                    "user_href": "/profile/Anjan-Kailash"
                },
                {
                    "user_id": "Akash Kashyap",
                    "user_href": "/profile/Akash-Kashyap-5"
                }
            ]
        },
        {
            "author_info": {
                "name": "Alfred Dominic Vella",
                "href": "/profile/Alfred-Dominic-Vella"
            },
            "answer_text": "Anything that has to keep in touch constantly with the wireless phone system needs to say were it is so there is some communication almost all the time. This does not need to be a strong signal but it is there. ",
            "date": "Answered June 4, 2016",
            "views": "128",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Jarrett Embry",
                    "user_href": "/profile/Jarrett-Embry"
                }
            ]
        }
    ]
}