{
    "title": "Do satellite dishes use electricity? - Quora",
    "tags": [
        "Satellite Dishes",
        "Satellite Communications"
    ],
    "response": [
        {
            "author_info": {
                "name": "Martin Oakes",
                "href": "/profile/Martin-Oakes-1"
            },
            "answer_text": "As has been mentioned, the low noise amplifiers associated with the dish require power. Sometimes these are located indoors rather than at the focus of the parabolic reflector, and in this case there might be no electricity on the dish itself. Dishes meant to track satellites which are not geo-stationary use electric motors to keep them pointed at the satellites as they sweep across the sky. The greater the diameter of the dish, the narrower its beam angle, making it harder to keep it precisely pointed at the satellite. Dishes larger than 20 feet in diameter usually have positioning motors, even when they are aimed at geo-stationary satellites. The largest dishes and all shipboard dishes will have full time computer assisted tracking systems. Locations near airports, on top of buildings, or on terrain outcrops usually require electric obstruction lighting. And finally, snow and ice removal is sometimes accomplished with electric heat tape elements on the back of the dish, or with fuel fired heaters incorporating shrouds and electric blowers. ",
            "date": "Answered September 19, 2019",
            "views": "11",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Fenn Vector",
                    "user_href": "/profile/Fenn-Vector"
                }
            ]
        },
        {
            "author_info": {
                "name": "Janãrdhan TS",
                "href": "/profile/Janãrdhan-TS"
            },
            "answer_text": "Dish(antenna) never use power. Its just like a mirror which reflects the EM waves to desired direction. The electrical peripherals like LNB required power. Whether it is satellite or earth station, The power is required only to drive LNB not for antenna. LNB is not part of antenna(?), if so, just an Antenna will not use power but LNB which is actually converting the EM Waves into Electrical signal does require power. ~Janãrdhan TS ",
            "date": "Updated September 21, 2019",
            "views": "19",
            "upvotes": " View 2 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Astrid Howard",
                    "user_href": "/profile/Astrid-Howard"
                },
                {
                    "user_id": "Vijay Londhe",
                    "user_href": "/profile/Vijay-Londhe"
                }
            ]
        },
        {
            "author_info": {
                "name": "Sanjay Gupta",
                "href": "/profile/Sanjay-Gupta-231"
            },
            "answer_text": "Every electrical and electronic device need energy and energy in space is available in form of solar energy that is converted into electricity using solar cells placed on solar panels. Yes, dishes also need to convert data into microwaves and microwaves into data so require energy in form of electricity. ",
            "date": "Answered June 4, 2019",
            "views": "545",
            "upvotes": " Answer requested by Vijay Londhe"
        }
    ]
}