{
    "title": "Do technological developments trigger turning points in history? - Quora",
    "tags": [
        "Technological Development",
        "Turning Points",
        "History of Technology",
        "Developments",
        "Technological Innovation",
        "Innovation",
        "Technology Trends",
        "World History",
        "Technology"
    ],
    "response": [
        {
            "author_info": {
                "name": "Carlos Torres",
                "href": "/profile/Carlos-Torres-931"
            },
            "answer_text": "Long answer short, yes. Short answer long, humanity will always depend on the technology because that was the way of humanity’s improvement on society since the beginning. Comparing to other living beings on Earth, humans have the unique ability to build things in a creative way. Although there are others like birds that build nests, but in the way that birds do it seems to never change, and it is also applied to other animals as well. In each section, I’ll have an image as an example of how it caused a turning point: Agriculture  Neolithic Revolution Science  Vaccines, specially the first one invented in 1796 to cure smallpox. Astronomy  The heliocentric model, created by Nikolaus Kopernicus, is used today as the main model to study the solar system. Mathematics  The Pythagoream Theorem, discovered by Pythagoras and named after, is one of the many important math equations used today. Warfare  The atomic bombs developed by te US to use to end WWII with Japan. Psychology  The discovery of many disorders and how to deal with them. ",
            "date": "Answered October 23, 2020",
            "views": "232",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "John Hopkins",
                    "user_href": "/profile/John-Hopkins-473"
                },
                {
                    "user_id": "Indrajeet",
                    "user_href": "/profile/Indrajeet-32"
                }
            ]
        }
    ]
}