{
    "title": "Do tech giants innovate devices because society needs them, or do the devices create the need? - Quora",
    "tags": [
        "Technology Companies",
        "Innovation"
    ],
    "response": [
        {
            "author_info": {
                "name": "Charles Reimers",
                "href": "/profile/Charles-Reimers"
            },
            "answer_text": "You're looking at this with a false dichotomy. Truth is, you don't need an iPhone. People got along just fine for millions of years without any iPhones. The real issue here is relative value. Let's back up a moment and walk through the process of creating a new tech marvel from scratch. Companies exist to make money. If they don’t make money, they die. That’s all there is to it. Innovation has very little to do with society. It has to do with relative value and how much money it can bring to the company. First, someone has an idea. Most ideas are relatively boring and have little relative value. The average person wouldn’t pay what it costs to manufacture and sell them. If you have any doubts, take a look at the worthless karp that wind up on your cell phone’s app store. A lot of things on there for really cheap or free that you wouldn’t bother with because it’s not worth the storage it would take up. Okay. So the person has an idea that might be marketable. Now you need someone smart to figure out how much it will cost to produce and someone else that is clever to figure out how you will convince millions of people to buy it and how much they are likely willing to pay for it, otherwise known as the price point. You then need to figure out how to make your own cost lower than the price point otherwise you’ll be paying people to take your invention and you can only do that as long as you have money. It runs out really fast. So, that part about how much they are willing to pay for it is the sticking point. There are lots of alternatives. What makes your solution worth enough that someone would give you money, a representation of work hours, to get it? This is where personal relative value comes in. Lets look at the introduction of cell phones. At first, cell phones were quite expensive and as big as bricks!  You needed a backpack or a holster to carry one. They were ugly, functional at best, had poor sound quality, etc. When they first came out, they were in direct competition with these things that you almost never see anymore.  The market niche for cell phones was people that valued being able to be contacted at a moment’s notice. Doctors, executives, etc. Anyone who could expect needing to do something at any time, day or night, 24x7x52. People who needed to be able to send or take instructions even on days off. The pager is a much cheaper alternative. Cell phones were expensive. Cell phone calling plans even more so. And, with a cell phone, depending on where you are, it could cost way more to talk to someone right next to you than using a pay phone. There was no such thing as free long distance and roaming or unlimited minutes. But a pager required you to find a phone so you could call back. The convenience of having it right there with you made the cell phone a viable product for people who’s time was worth more than the cost of phone, calling plan, and calling charges. Once a market was established, those same companies began working on cell phones that cost less so that more people could afford to buy them. Calling plans and service charges were lucrative enough that carriers could take a page from the razor business plan and sell the phones themselves at a loss, but make up for it with income from locking the customer into a long term service contract. Over time, cell phones shrank in size. A typical flip phone could be put in a pocket. And the cost came way down as electronics improved. Soon, it wasn’t unusual to see someone carrying a cell phone just for convenience. Competition between manufacturers was getting hot, too. Not only did they need to work well, but they needed to look attractive, too so they would catch the eye of the buyers. Manufacturers started putting additional features into the phones as a way of increasing the relative value of their phone; contact lists, cameras, messaging (yes, early cell phones couldn’t even send text messages), games, etc. Service plans got cheap enough that everyone could afford one. In fact, the service companies really needed millions of people on their plans to make them cost effective. And, with the lower financial cost, nearly everyone has gotten one (or two or three in some extreme cases). It’s gotten to the point where particular brands are status symbols (come on and admit it, iPhone fanatics, you run out and buy the newest iPhone not because it’s that much better but because it’s the thing to do). Now, cell phones are still not a necessity. I know several people who refuse to get one. They don’t want the intrusion into their lives. They like not being able to be contacted at any given moment. They weigh the value of convenience against the cost of intrusion into their life and find it lacking. Relative value is the key. If you can come up with something that someone will value more than your cost to provide it, they will give you money and you can use that money to make more. That is what is called entrepreneurship. ",
            "date": "Answered October 25, 2020",
            "views": "108",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Dan Vasii",
                    "user_href": "/profile/Dan-Vasii"
                }
            ]
        },
        {
            "author_info": {
                "name": "David Fitzsimmons",
                "href": "/profile/David-Fitzsimmons"
            },
            "answer_text": "Yes, No, not really. Google - remember Lycos, or Altavista ? Nineties, best-of-breed ‘search engines’, just not that good. When Google showed up, it was the best. [there’s a ‘Yes’] Did cell phones, long a dream, first realized in the Eighties (ever seen them, size of a shoebox, visible antenna.. ?) really need to include a CCD ‘camera’ ? Well that did develop a ‘use case’; and ultimately a ’need’ [that’s a ‘NO’]. Now back to the Sixties (technically), XEROX PARC. Originators of viewing multiple running programs, each in their own ‘windowpane’.. the ‘mouse’.. early functioning ‘networking’ too IIRC. It did go bankrupt as a corporate structure eventually. [how does that fit ??] None of that is why the giants are giants. Different question. ",
            "date": "Answered October 23, 2020",
            "views": "51",
            "upvotes": "0"
        }
    ]
}