{
    "title": "Do those car diagnostic tools really give you correct readings? - Quora",
    "tags": [
        "Car Engine Diagnostics",
        "Diagnostic Tools",
        "On Board Diagnostics for Automobiles",
        "Auto Repair",
        "Car Care"
    ],
    "response": [
        {
            "author_info": {
                "name": "Adam Webster",
                "href": "/profile/Adam-Webster-37"
            },
            "answer_text": "There’s a couple of answers for this, but in short, it depends if the diagnostic equipment is manfucturers own, often costing thousands, or a generic scanner that is considerably cheaper and readily available. Generic OBD2 (On-Board Diagnostic2) scanners such as those found on eBay will generally read all DTCs (Diagnostic Trouble Codes) that a vehicle (of any manufacturer) will have stored in the various control modules dotted around the vehicle. These DTCs, also known as “fault codes”, will often provide basic direction for anyone attempting to diagnose a fault with the vehicle. The cheap generic scanner will then match the fault code generated by the vehicle to a pre-defined list of sometimes vague, non-specific faults that essentially point you in the right direction, but rarely provide you with a conclusive answer on what the fault actually is. In contrast, manufacturers own systems such as Ford IDS, Jaguar/LR WDS, VAG’s ODIS et al not only communicate with the vehicle to establish which DTCs are stored, but they also provide a far greater level of interpretation as to what the fault actually is. This is why so many times main-dealers have to get involved with complex auto-electrical faults as they hold the very expensive brand-specific kit that will tell them things the generic kit won’t. It’s like having a builder come round your house and give you a general diagnosis of where he thinks an electrical fault may be lurking in your house, and then having a qualified electrician come round afterwards and do the same. Both guys know what they’re talking about, but the electrician will have the better understanding of the whole system and will have the edge over the builder when it comes to the diagnosis. ",
            "date": "Answered November 2, 2018",
            "views": "374",
            "upvotes": " View 2 Upvoters ",
            "upvoters": [
                {
                    "user_id": "CH Howell",
                    "user_href": "/profile/CH-Howell-1"
                },
                {
                    "user_id": "Kay Rovik",
                    "user_href": "/profile/Kay-Rovik"
                }
            ]
        },
        {
            "author_info": {
                "name": "Nathan Bradshaw",
                "href": "/profile/Nathan-Bradshaw"
            },
            "answer_text": "Short answer is yes. The general range of codes are all well defined and there is no reason a tool would somehow misinterpret what it reads short of some kind of programming error when the tool was made. Longer version is they’ll recognize whatever they can correctly but different tools will have different levels of capability and different manufacturers will have a mix of standard and custom codes so not all tools will necessarily have all codes. Also, most tools can read ECM codes but not all can read codes from other modules such as the body control module, electronic braking control module, transmission CM etc etc so some will not report back errors that are stored on those modules or might report back a generic error code the ECM has stored that basically just means its been notified of an error in a different module, one that particular tool might not be able to read. Best bet for any particular application is to go to the forums / fb pages for that make/model and see what is popular in those communities, they’ll usually have a good idea of which models of scan toll work better or worse with their particular car of choice. Or shell out the big money for a tool from snap on or the like which will come with a broad range of capabilities out of the box ",
            "date": "Answered November 2, 2018",
            "views": "484",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "CH Howell",
                    "user_href": "/profile/CH-Howell-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Joel Osborne",
                "href": "/profile/Joel-Osborne-3"
            },
            "answer_text": "Yes, if you use them correctly. You must have read my post saying I’m not sure about the codes. A reliable tool sold at a reputable business should get you a diagnostic tool that produces the correct codes, you just have to have the manual to read them correctly. It outputs p codes, which are written in some language beyond my intelligence. The p codes are universal. It only produces the p codes, and nothing else. So, for example if you have a p code of 1301, it reads that code only, it’s up to you to decide how to interpret that. That’s my apps fault to think that it knows what that means. That 1301 code is a random misfire on the number one cylinder, that’s pretty standard. , but what is the real fault? Bad coil pack? Bad spark plug? Bad distribution center? it just thinks it knows. ",
            "date": "Answered November 2, 2018",
            "views": "185",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Kay Rovik",
                    "user_href": "/profile/Kay-Rovik"
                }
            ]
        },
        {
            "author_info": {
                "name": "Kai Herrmann",
                "href": "/profile/Kai-Herrmann"
            },
            "answer_text": "Yes. All the tool does is give you a “window” into the control modules in the vehicle. What those modules see from their sensors is then seen by the diagnostic tool. It simply allows us to know what the control modules are seeing which enables us to diagnose and repair them. There is no reason the tools would be inaccurate unless they are made as ripoffs of the real tool or made using extremely low quality parts. I’ve never seen such a tool so I’m just throwing that out there as a possibility. ",
            "date": "Answered November 2, 2018",
            "views": "150",
            "upvotes": " View 2 Upvoters ",
            "upvoters": [
                {
                    "user_id": "William Hood",
                    "user_href": "/profile/William-Hood-23"
                },
                {
                    "user_id": "Robert Stephen Campbell",
                    "user_href": "/profile/Robert-Stephen-Campbell"
                }
            ]
        },
        {
            "author_info": {
                "name": "Tom Varga",
                "href": "/profile/Tom-Varga-3"
            },
            "answer_text": "Yes most of the time when it comes to diagnostics it will absolutely give you a correct starting point for diagnosing the problem of said vehicle But my advice is to get into the vehicle and if you have a scan tool erase all the codes drive the vehicle, see what comes back and obviously that’s where you’re gonna have a problem - The diagnostic tool will obviously your lead you closer to the causes of whatever problem your car is having . Thus making it easier to diagnose ",
            "date": "Answered November 2, 2018",
            "views": "63",
            "upvotes": " Answer requested by Kay Rovik",
            "upvoters": [
                {
                    "user_id": "Kay Rovik",
                    "user_href": "/profile/Kay-Rovik"
                }
            ]
        },
        {
            "author_info": {
                "name": "Bill Boyd",
                "href": "/profile/Bill-Boyd-65"
            },
            "answer_text": "the only scanner sthat can read all makes of cars are the really expensive ones If you consider buying one from say e-bay then go to the product description and you will see what makes of cars it will read the codes on for insyance scanners that will read asian built cars will raed all of the aisan cars but will not read GM, Ford or dodge so whne you plug it in knowing full that the engine is missing really bad and it says no codes found , then you have the wrong scanner for that car ",
            "date": "Answered November 2, 2018",
            "views": "64",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Joe La Garbo",
                "href": "/profile/Joe-La-Garbo"
            },
            "answer_text": "You mean the scanner techncians use everyday? Very accurate but they can and do need calibration from time to time. The code reader/scanners Snap-On, Mac and Matco tools sells are near the best on the market. While the Made in China types, not so much. Good luck and hope this helps. ",
            "date": "Answered November 3, 2018",
            "views": "63",
            "upvotes": " View 1 Upvoter "
        },
        {
            "author_info": {
                "name": "Doyle Durham",
                "href": "/profile/Doyle-Durham"
            },
            "answer_text": "In most cases, yes… but you need to have some mechanical aptitude & be familiar with your vehicle in order to benefit. OBD-II is a blessing on the newer vehicles (1996 & newer) & prevents an individual from throwing parts at a car to repair something you know nothing about. (It also gives you information so a crooked repair person can’t deceive you by being dishonest with your repairs) ",
            "date": "Answered November 2, 2018",
            "views": "87",
            "upvotes": " Answer requested by Kay Rovik"
        },
        {
            "author_info": {
                "name": "Steve Taylor",
                "href": "/profile/Steve-Taylor-231"
            },
            "answer_text": "Code readers can be very vague. The causes of a code usually requires more diagnostic work. For example: engine misfire. It could be ignition, fuel, valvetrain etc. ",
            "date": "Answered January 9, 2019",
            "views": "38",
            "upvotes": " Answer requested by Kay Rovik"
        }
    ]
}