{
    "title": "Do you sometimes hate modern day technology? - Quora",
    "tags": [
        "Modern Technology",
        "Hate",
        "Technology"
    ],
    "response": [
        {
            "author_info": {
                "name": "Jessica Wiggins",
                "href": "/profile/Jessica-Wiggins-16"
            },
            "answer_text": "Sometimes, yes. Whenever I’m trying to find someone to chat with, but all I get are people hunched over screens, I want to destroy all smartphones. Whenever I see a story about how another teen committed suicide due to bullying on social media, I want to shut down every single social media platform. Whenever I look outside and see the streets deserted, with neighbors not even talking to each other, I want to turn off everyone’s Wi-Fi for a while. Whenever I see couples arguing about (and sometimes divorcing over) ‘Netflix cheating’, I want to obliterate all streaming capabilities. Whenever I browse through the hundreds of channels and can’t find anything decent to watch, I want to snap my fingers and bring back the TVs with 3–4 channels my parents grew up on. Whenever I see family-owned, brick-and-mortar stores going under because too many people shop online now, I want to erase online shopping back to eBay. Whenever I see the havoc wrought by some hackers, I want to push the Internet back to when it was ARPANET, and the only people who had knowledge of it outside of the government were uber-computer people.  However… When I’m able to connect to people from all over the worldWhen a kid is saved from suicide by Google or people on social mediaWhen old friends are able to reconnect on social media after so many years apartWhen shows and movies help bring families back togetherWhen I find wonderful shows and movies that teach history and knowledgeWhen I can get spices from all over the worldWhen I see the positive repercussions of a good deed someone did on the InternetThen I am glad of modern technology, and I wouldn’t trade it for the world. Again, it all depends on how you look at it, and how you use it. Cheers (and use technology wisely), Jess ",
            "date": "Answered August 5, 2017",
            "views": "2",
            "upvotes": " View 12 Upvoters",
            "upvoters": [
                {
                    "user_id": "Zohaa Mateen",
                    "user_href": "/profile/Zohaa-Mateen"
                },
                {
                    "user_id": "Thuận Nguyễn",
                    "user_href": "/profile/Thuận-Nguyễn-51"
                },
                {
                    "user_id": "Edmund Choi",
                    "user_href": "/profile/Edmund-Choi"
                },
                {
                    "user_id": "Alexander Straub",
                    "user_href": "/profile/Alexander-Straub-1"
                },
                {
                    "user_id": "Samuel Rosenberg",
                    "user_href": "/profile/Samuel-Rosenberg-10"
                },
                {
                    "user_id": "Bill Mitchelson",
                    "user_href": "/profile/Bill-Mitchelson"
                },
                {
                    "user_id": "Heidi Jo Smith",
                    "user_href": "/profile/Heidi-Jo-Smith"
                },
                {
                    "user_id": "Zain Zaidi",
                    "user_href": "/profile/Zain-Zaidi-34"
                },
                {
                    "user_id": "Jerry Sorrell",
                    "user_href": "/profile/Jerry-Sorrell"
                },
                {
                    "user_id": "Iu Fernandez",
                    "user_href": "/profile/Iu-Fernandez"
                },
                {
                    "user_id": "Claire Parker",
                    "user_href": "/profile/Claire-Parker-37"
                },
                {
                    "user_id": "David Williams",
                    "user_href": "/profile/David-Williams-328"
                }
            ]
        },
        {
            "author_info": {
                "name": "Larry Morgan",
                "href": "/profile/Larry-Morgan-41"
            },
            "answer_text": "Yes, sometimes. Mostly technology that has Microsoft as part of its name. I am joking a little bit, but what really bothers me is technology that makes something harder than it needs to be. Let me give just one example from Windows. I like to have Task Manager running in the background on my old Windows 7 computer. Sometimes a process is consuming too much CPU, and I want to be able to identify it. The irritation comes when I try to shut down my computer. Windows won’t do it because Task Manager is running! It doesn’t even have the ability to identify Task Manager as the “offending” process. So I have to force a shutdown every single time. Good technology disappears. Its purpose is to make whatever task you want to do easier, not to call attention to itself. ",
            "date": "Answered January 1, 2019",
            "views": "441",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Randall R Schulz",
                "href": "/profile/Randall-R-Schulz"
            },
            "answer_text": "Contemporary technology is both impressive and exasperating. In day-to-day life, we use smart phones, desktop / laptop computers, on-line / “cloud” computing systems etc. Most of these information technologies are highly, incredibly and quite frustratingly flawed. I cannot get through a day without encountering literally dozens of manifestations of software defects. And yes, it is mostly software that brings us this daily onslaught of malfunction. So no, I do not hate it, but I hold it in very low regard. And I say this as someone who has been a professional purveyor of software for several decades. The bottom line is that my profession exhibits a mind-boggling degree of amateurism and it shows in our products. ",
            "date": "Answered August 4, 2017",
            "views": "614",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Larry Morgan",
                    "user_href": "/profile/Larry-Morgan-41"
                },
                {
                    "user_id": "John Skelly",
                    "user_href": "/profile/John-Skelly-3"
                }
            ]
        }
    ]
}