{
    "title": "Do you think the future really will have flying cars? If not, what will it have? - Quora",
    "tags": [
        "Flying Cars",
        "Futurism",
        "Future of Technology",
        "Future Scenarios",
        "Flying",
        "Technology",
        "Cars and Automobiles"
    ],
    "response": [
        {
            "author_info": {
                "name": "William Mook",
                "href": "/profile/William-Mook"
            },
            "answer_text": "Energy would have to be far cheaper and more abundant than it is today.  A 3600 pound vehicle would require 900 to 1800 hp to lift off vertically and would ideally use that extra power to climb and accelerate to high speed. It ideally would also transition to ballistic travel above the atmosphere to travel anywhere in minutes pulling a constant 2 g. We need of course abundant fusion power. Not in the car but captured from the source converted to laser energy and beamed to where needed.    https://arxiv.org/pdf/physics/9811009.pdf Introduction to Zero-Point Energy Beyond near term solutions some have proposed tapping zero point energy of the vacuum to produce collimated beams of neutrinos to produce constant one gravity boost on a ship and in this way hop from star to star in a single human life time. Of course the same technology takes you anywhere on Earth in 30 minutes or less at 2 g. You can get to the moon in 3.5 hours. Get to Mars or Venus in a few days. Cross the solar system in a few weeks. Such drives could be adapted to use in a personal vehicle that would float when not in use, and maintain a fixed height above any surface, but fly freely to wherever you wished. These would replace motorcycles and automobiles, and permit travel in space. ",
            "date": "Answered March 25, 2020",
            "views": "212",
            "upvotes": " View Sharers",
            "upvoters": [
                {
                    "user_id": "Florence Patterson",
                    "user_href": "/profile/Florence-Patterson-5"
                },
                {
                    "user_id": "Walter J. Tingle",
                    "user_href": "/profile/Walter-J-Tingle"
                }
            ]
        },
        {
            "author_info": {
                "name": "David Taylor",
                "href": "/profile/David-Taylor-446"
            },
            "answer_text": "No. Totally impractical. A breakdown will have a catastrophic consequence, things that fly cannot coast to a gentle stop. Traffic control will he virtually impossible let alone finding landing, parking, and take off spaces. And collisions of almost any sort would be deadly. The future is in mass transit with high speed trains and buses. ",
            "date": "Answered March 3, 2020",
            "views": "39",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Johnni Mills",
                    "user_href": "/profile/Johnni-Mills"
                }
            ]
        },
        {
            "author_info": {
                "name": "John Tringali",
                "href": "/profile/John-Tringali"
            },
            "answer_text": "That’s a fantasy, there will be ZERO chance of flying cars. None. However we will have autonomous electric cars for sure. It’s just a matter of when, not if. City planners are already designing induction based rechargers under parking lots, solar panels on buildings, tunnels without CO fans, etc. That is coming, but they’ll all stay on the ground. ",
            "date": "Answered March 7, 2020",
            "views": "75",
            "upvotes": " View 1 Upvoter"
        },
        {
            "author_info": {
                "name": "Walter J. Tingle",
                "href": "/profile/Walter-J-Tingle"
            },
            "answer_text": "The “Real Future (c)\" will still have Saturday nights, beer & teenaged males. This is WHY they won't have flying cars. Hopefully, self-driving electric taxis. That way you can read or sleep on the way. ",
            "date": "Answered March 5, 2020",
            "views": "25",
            "upvotes": "0"
        }
    ]
}