{
    "title": "Do you need a special camera to make recordings for virtual reality? - Quora",
    "tags": [
        "Virtual Reality Hardware",
        "Virtual Reality Startups",
        "Home Recording",
        "Virtual Worlds",
        "Video Cameras",
        "Augmented Reality",
        "Virtual Reality (VR)",
        "Digital Cameras",
        "Cameras"
    ],
    "response": [
        {
            "author_info": {
                "name": "Ayden Ye",
                "href": "/profile/Ayden-Ye"
            },
            "answer_text": "Here is my answer to “Where can I create 360 product video?” and “How do you make a VR 3D animation/image for Google Cardboard?” which I think could be highly relevant here. Besides that, one of the easiest ways to make VR video would use a 360 camera. I’ve recently done some research on 360-degree cameras, and I’d list out here the best cameras among those at the same price level in my opinion. They all have high performance-price ratios, and you can pick out your best based on your budget and what unique points attract you the most. First off, here’s the top 10 affordable 360-degrees VR cameras under $100: SOONPAM 360 Mobile Camera - the cheapest way to get started!FSTgo VR 360 - for sports and action based sports, it’s pretty ideal.Gear Pro 360 - you can sync the VR camera with your phone by Wi-fi.Andoer 360 - it has a built-in app with your phone.Zision 360 4K - fair quality, and you can share your photos & videos via Wifi as well.Samsung Gear 360 - 4k resolution and 30 megapixels.Zetronix 360 Camera - clear and detailed 360 video footage.OUTERDO 3D VR Camera - very wide angle lens.360fly 360 HD Video Camera - dustproof, shockproof, and water-resistant.MADV Mini- cost-effective, easy-to-operate and -carry!For more detailed review and Amazon link to each and every one of the cameras listed above, check here. Moving up a little on the price range, there are also quite a lot of great options out there at several hundred dollars. Ion360 is available at $299.99 with seamless, fast stitching and saving functions. What is interesting about it is its multi-functionality - it’s basically a phone case, an external battery, AND a good 360 camera. Madventure, $309.99, has a large IOS range which makes it outperform under many other 360 degrees cameras at a similar level under low-light conditions. It’s water- and dust-proof, with eye-catching features such as bullet time and invisible selfie stick. It’s also featured by its shakiness reduction functionality and its own app. Cute orange look Mijia Mi sphere camera by Xiaomi is available at roughly $289. This one also boasts high-quality 6-axis stabilization system and extreme compatibility. As many other good options are, it’s waterproof and dust-proof. The Insta360 One, one that’s been quite a big hit since launched. With a very reasonable price of $299, it provides 360-degree photo and video lovers with almost all the functions they might be interested in bullet time, little planet mode, beauty cam, free capture, invisible selfie-stick, etc. Moving a little bit more toward the professional end, Samsung 360 Round at $10499 is quite a star among its peers as it’s both 360-degree and 3D. There are also many professional cameras at 10k+ or dozens of thousands of dollars, which are usually used to shoot commercial VR movies. If you are a 360 VR creator, feel free to follow and request me any 360 or/and VR relevant questions! :) ",
            "date": "Answered August 30, 2018",
            "views": "154",
            "upvotes": " Answer requested by Jared Busby",
            "upvoters": [
                {
                    "user_id": "Jared Busby",
                    "user_href": "/profile/Jared-Busby-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Nate Girard",
                "href": "/profile/Nate-Girard"
            },
            "answer_text": "Making video recordings FOR virtual reality is a little different than making recordings OF virtual reality (which Christopher Steele answered). FOR VR implies I’m putting a video into my VR experience. For that it must be able to be seen from multiple angles since the user’s perspective cannot be controlled.  If you are thinking about the recordings that the Microsoft Mixed Reality headsets have in their home space of people introducing products and what not, those are called volumetric videos[1]. Those DO take a special camera setup to capture. There is a company called Volograms[2] that specializes in creating these types of videos. They are actually 3D video holograms that are captured from multiple video cameras surrounding the subject as seen on their website[3]. This same technology was used in the most recent Ghost in the Shell movie to capture the live performances of actors and place them as giant holograms within the shots in the movie.  With volumetric videos the video can be placed anywhere in your VR world and seen from any angle. It truly is a video made FOR VR. If only it wasn’t so difficult to capture.  Intel Studios recently announced[4] they had built a volumetric video stage in LA so that Hollywood could begin to take advantage of this technology and use it to push the boundaries of VR videos. Footnotes[1] Volumetric Video - Wikipedia[2] Volograms[3] Volograms[4] Intel Opens Los Angeles Studio for Volumetric VR/AR Video Productions",
            "date": "Answered August 30, 2018",
            "views": "120",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Vicky Montogomery",
                    "user_href": "/profile/Vicky-Montogomery"
                },
                {
                    "user_id": "Trevor Wilkerson",
                    "user_href": "/profile/Trevor-Wilkerson-9"
                },
                {
                    "user_id": "Stella Rodrigez",
                    "user_href": "/profile/Stella-Rodrigez"
                },
                {
                    "user_id": "Rafael Cohen",
                    "user_href": "/profile/Rafael-Cohen-13"
                },
                {
                    "user_id": "Natasha Sanders",
                    "user_href": "/profile/Natasha-Sanders-45"
                }
            ]
        },
        {
            "author_info": {
                "name": "Mike Hudson",
                "href": "/profile/Mike-Hudson-175"
            },
            "answer_text": "With the rise of Virtual Reality (VR) one of the most frequent questions, besides how much does it cost, is the creation of VR content. It implies ways and tools to make virtual reality content and the cost of building VR apps. Although VR technology still hasn’t made its grand breakthrough to every household, it continues to develop and finds more and more practical uses by consumers, marketers, and manufacturers. VR today is in dire need of high-quality content, being the key factor in user adoption of virtual reality. People expect new fascinating experiences. Any VR experience starts with a headset, or head-mounted display (HMD) and Volumetric video capture. It is a device that brings a computer-simulated content in front of your eyes, imitating presence in real environments. Most popular headsets so far are Google Cardboard, HTC Vive, Oculus Rift, Sony PlayStation VR, Samsung Gear. Two major types of VR content are 360-degree videos & 3D animations. VR content: making 360 videos The first one is certainly way cheaper, though it does not mean it is bad or inferior. A 360-degree video is a perfect way to create immersive experiences out from any event or location in the world. It requires certain equipment, though. For basics, you’d need a spherical camera with 360-degree lens and tripods (plus Steadicams). Using a drone is also a viable option. For post-production, you will need special editing software, Videostitch for example, to bring all the footage in one piece and ensure high quality of visuals. Just like any other video, your footage must be entertaining in the first place. You shouldn’t be afraid to experiment, use multiple entry points and bold angles. Also, bear in mind that you’re creating content for viewers that have different levels of familiarity with VR. Also don’t forget about clear instructions, choices, and hints for navigation. Make sure that your VR content looks good on every device possible: desktops, smartphones, tablets, headsets. Viewing 360-degree images on a computer with a mouse must be as smooth as moving or sliding a tablet for the same purpose, and vice versa. 3D animation in VR With 3D animation, it’s all about your fantasy and creativity. Unlike in 360-degree videos, where users are limited to viewing, in virtual 3D space, they can move and interact with certain objects. 3D, be it a simple animation, a game, virtual shopping rooms, etc., is a complex trade, but the payoff is worth the effort. In such digital environments, users are free to move, look closely at objects around, interact with them as they would in real life. Take “Clash of Clans 360” game for example. There are plenty of tools and platforms to create simple virtual 3D environments, such as Maya, Structure Sensor, 3dsMax, LightWave, Modo, Cinema 4D, Houdini, etc. If you want to produce something bigger and more complex, like 3D VR games, you can use game engines like Unity or Unreal, and you would also need Google VR SDK, a headset and an Android phone. With the Unity engine, you can also build 3D models, animations, interior designs. ",
            "date": "Answered August 23, 2020",
            "views": "45",
            "upvotes": " View 5 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Jared Busby",
                    "user_href": "/profile/Jared-Busby-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Antony Vitillo",
                "href": "/profile/Antony-Vitillo"
            },
            "answer_text": "Depends on how you want these contents to be seen. If you want to record 360 videos, 180 VR videos or such, yes, you need a special camera. There are a lot of cameras that you can choose from, depending on the money that you wish to spend, the purpose that you have (if you are a hobbist or a professional) and the kind of movie that you want to shoot.  For instance the above is the Lenovo Mirage Camera, that is affordable and lets you shoot easily 180 VR videos. While the one below is Jaunt Camera: a professional rig that costs dozens of thousands of dollars and lets you record professional 360° 3D videos for virtual reality.  So, in short: yes, you need a special camera. ",
            "date": "Answered September 5, 2018",
            "views": "112",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Jared Busby",
                    "user_href": "/profile/Jared-Busby-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Christopher Steele",
                "href": "/profile/Christopher-Steele-31"
            },
            "answer_text": "No, but a mixed reality setup helps. I stream my HTC Vive gameplay using a regular webcam pointed at my playspace, but it’s not perfect. Some others use what’s called “mixed reality streaming,” which basically means you stand in front of a giant greenscreen, and you use special programs to place your recording inside of the different layers of the gameplay. You then synchronize the in-game controllers to your real world controllers, and it makes it look like you the player are superimposed into the game. Me? I intend to try a different sort of mixed reality streaming - I want to get one of those sport cameras that edit out the pole they’re on automatically, and then affix that to a vest that I would wear while playing VR. Then, using a suspended cable system and a 360 degree greenscreen, I could play any game (not just forward facing) in VR with mixed reality streaming, and you’d always have the camera placed firmly behind me. ",
            "date": "Answered August 30, 2018",
            "views": "100",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Apex Kai Mertz",
                    "user_href": "/profile/Apex-Kai-Mertz"
                },
                {
                    "user_id": "Jared Busby",
                    "user_href": "/profile/Jared-Busby-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Atul Salgaonkar",
                "href": "/profile/Atul-Salgaonkar"
            },
            "answer_text": "Thank you for the a2a: “Do you need a special camera to make recordings for virtual reality?” My answer is Yes, but let me explain that it depends on your definition of Virtual Reality: To me, reality is innately 3-dimensional - and hence, my definition of VR requires that the experience is depth-enabled. In order for the viewer to have a 3-d, depth sensing experience, the viewer’s two eyes have to be presented with 2 images that are slightly different from each other. When these images are simultaneously viewed, then the human brain will create the composite 3d effect, similar to what we see in real life. Thus, a VR camera must have stereo image capture capabilities; If the camera does not have 2 lenses facing the same side, then you can quickly dismiss that it is not a true VR camera. Hope this has helped; ",
            "date": "Answered August 30, 2018",
            "views": "92",
            "upvotes": " View 2 Upvoters "
        },
        {
            "author_info": {
                "name": "Jim Noord",
                "href": "/profile/Jim-Noord"
            },
            "answer_text": "If you mean photospheres, try a theta Camera, or to get started google cardboard camera. You can take great cardboard 360 pics with that. The theta gives you the same thing albeit better resolution and true spherical photo. Certainly other options but those are best entry level(particularly either getting a used or refurbished theta. ",
            "date": "Answered August 30, 2018",
            "views": "39",
            "upvotes": " Answer requested by Jared Busby"
        }
    ]
}