{
    "title": "Do you need special HDMI cables for a 4K TV? - Quora",
    "tags": [
        "A/V Cables",
        "HDMI",
        "Ultra HD Television",
        "4K (format)"
    ],
    "response": [
        {
            "author_info": {
                "name": "Dave Haynie",
                "href": "/profile/Dave-Haynie"
            },
            "answer_text": "There are two HDMI cable speeds, Category 1 (Standard) and Category 2 (High Speed). These are available with or without Ethernet, but you don’t care about that.  If you have HD video sources, like regular Blu-ray, HD satellite or cable, HD network player, etc. any old HDMI cable will be fine.  If you have UltraHD (aka 4K) video sources, like UltraHD Blu-ray, you will probably want a high speed cable. Now, if you grab any old cable and try it out, it might just work between your 4K source and your television. Most standard cables made for HDMI 1.3 and under 5m in length will support common 4K speeds, even though they’re not specifically designed for it. The HDMI category 2 cable can support higher refresh rates and color depths than you’re likely to use, and those are where your older HDMI cable probably fails. But all category 2 cables support all HDMI 2.0/2.0a. This isn’t a situation like a computer connection, where you’re going to worry about data dropping. It’s a picture, and you can see if the picture looks good or if it’s weird. Or just not there. Just check that you’re actually getting 4K/UltraHD output. Sources (your player) and sinks (your monitor) negotiate for resolutions they can both support. Pretty much all 4K devices can drop back to HD if they find a reason to do so. It’s pretty much going to be “yes” or “no”. If your cable doesn’t work, try another. But it’s not like the analog days, where the properties of a cable could affect the functional quality of your on-screen image. ",
            "date": "Answered November 29, 2018",
            "views": "28",
            "upvotes": " View 8 Upvoters",
            "upvoters": [
                {
                    "user_id": "Odin Collins",
                    "user_href": "/profile/Odin-Collins-1"
                },
                {
                    "user_id": "Alex Mashianov",
                    "user_href": "/profile/Alex-Mashianov"
                },
                {
                    "user_id": "Graham Moddle",
                    "user_href": "/profile/Graham-Moddle"
                },
                {
                    "user_id": "Thomas Pringle",
                    "user_href": "/profile/Thomas-Pringle-3"
                },
                {
                    "user_id": "Chuck Cooper",
                    "user_href": "/profile/Chuck-Cooper-5"
                },
                {
                    "user_id": "David Caune",
                    "user_href": "/profile/David-Caune"
                },
                {
                    "user_id": "Darryl Johnson",
                    "user_href": "/profile/Darryl-Johnson-162"
                },
                {
                    "user_id": "Saer Gardum",
                    "user_href": "/profile/Saer-Gardum"
                }
            ]
        },
        {
            "author_info": {
                "name": "Prasanna Bhalerao",
                "href": "/profile/Prasanna-Bhalerao"
            },
            "answer_text": "Before you rush to the nearest Best Buy or Fry’s or your local shop or Amazon to buy that fancy, gold plated, extra shielded, thick, elegant looking, and super expensive cable that claims that it will do a better job … BEWARE … DON’T FALL FOR EXPENSIVE CABLES. First of all, HDMI is a digital signal. So, an HDMI cable will either work or not work. It is not like an expensive, shielded cable with gold plating will provide better signal. BIG MYTH. Second, we are being led to believe that we need HDMI 2.0 for 4K. That is also NOT TRUE. Check your current cable. Most likely existing cable will work for 4K. At least that is true for short distance of up to 6 feet. HDMI 2.0 is new standard that supports higher speeds including ethernet. A v1.4 cable is very likely to work. If your existing cable is not working for 4K, then shop for the cheapest 4K compatible cable in the shop. The shop assistant will try to dump the more expensive cable on you stating buzz words like ‘best quality’, ‘peace of mind’, ‘will not damage your TV’ etc. Ignore this. ",
            "date": "Answered May 19, 2019",
            "views": "489",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Rad Adiga",
                    "user_href": "/profile/Rad-Adiga-1"
                },
                {
                    "user_id": "Tom Chase",
                    "user_href": "/profile/Tom-Chase-2"
                }
            ]
        },
        {
            "author_info": {
                "name": "Kevin Fellows",
                "href": "/profile/Kevin-Fellows-2"
            },
            "answer_text": "No, as long as they are high speed HDMI cables you should be fine for at least modest HDMI cable runs. The package may say they are 4K certified or such, but often the same cables that carried your 1080P signal can carry the 4K signal just as well. In the future I can’t say that will still be true when HDMI 2.1 is up and running, taking advantage of it’s greater bandwith capability. For now, just make sure the HDMI cable says it is 18 gigs or 2.0 capable for 4K. ",
            "date": "Answered November 25, 2018",
            "views": "466",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Cornelius Butler",
                    "user_href": "/profile/Cornelius-Butler-3"
                },
                {
                    "user_id": "Deanna Muse",
                    "user_href": "/profile/Deanna-Muse"
                }
            ]
        },
        {
            "author_info": {
                "name": "Alexander Mowry",
                "href": "/profile/Alexander-Mowry"
            },
            "answer_text": "To output at 4K, you need a device that has either a HDMI 1.4 or 2.0 port on it, which all 4K streaming devices do and so does the PS4 Slim, PS4 Pro, Xbox One S and Xbox One X. For the actual cable, the cable that came with the device will work fine but if you need a replacement, any new, name brand cable should work fine. A cheap option is the High-Speed branded Amazon Basics HDMI cables. ",
            "date": "Answered November 29, 2018",
            "views": "272",
            "upvotes": " Answer requested by Louie S. Lalic",
            "upvoters": [
                {
                    "user_id": "Prasanna Bhalerao",
                    "user_href": "/profile/Prasanna-Bhalerao"
                }
            ]
        },
        {
            "author_info": {
                "name": "Sam Brasher",
                "href": "/profile/Sam-Brasher"
            },
            "answer_text": "I’m surprised by these answers! Yes, you need a HDMI 2.0 cable. The thicker the cable, the better the shielding (and the more it will hold up to bending the wire). Don’t bother with special noise-reducing elements, like gold or silver connectors. Digital signal cleanup is good enough now-a-days to not worry about that. ",
            "date": "Answered May 16, 2019",
            "views": "202",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Ryan Toyota",
                    "user_href": "/profile/Ryan-Toyota"
                }
            ]
        },
        {
            "author_info": {
                "name": "Jennifer Truong",
                "href": "/profile/Jennifer-Truong-32"
            },
            "answer_text": "When you buy an HDMI cable, make sure that it is High Speed rated and has 3D and 4K internet sharing capacity. Long cables might have issues maintaining functionality under certain circumstances. This is because long cables have high electrical resistance and it lowers the available bandwidth. In case you’re using long cables, you would need high quality cables for the bandwidth to be maintained. HDMI has become the most accepted and universal standard of connecting HD devices. It has been embraced by people because of its potential to change with evolving technologies, user-friendliness. It also offers High Bandwidth Digital Content Protection. Buy Best Quality HDMI Cables at https://www.sfcable.com/hdmi-cables.html ",
            "date": "Answered December 5, 2018",
            "views": "300",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Paul Stregevsky",
                "href": "/profile/Paul-Stregevsky"
            },
            "answer_text": "Yes and no. To display 4K at a refresh rate of only 30 Hz, you can use any cable that’s rated for HDMI 1.4. To display 4K at 60 Hz, you need a cable that’s rated for HDMI 2.0. Either way, I would invest in a cable that has been certified as a Premium HDMI Cable. If your signal won’t display, or won’t display at the full resolution or refresh rate, you’ll be able to rule out the cable. ",
            "date": "Answered December 9, 2019",
            "views": "154",
            "upvotes": " View 1 Upvoter"
        },
        {
            "author_info": {
                "name": "Shubham Goyal",
                "href": "/profile/Shubham-Goyal-720"
            },
            "answer_text": "Nope. But just make sure that your hdmi cable supports 4k and has a speed of 18gbps. ",
            "date": "Answered November 28, 2018",
            "views": "171",
            "upvotes": " Answer requested by Louie S. Lalic"
        },
        {
            "author_info": {
                "name": "Utkarsh Chaube",
                "href": "/profile/Utkarsh-Chaube"
            },
            "answer_text": "No, its a standard HDMI cable. Just check if its a normal HDMI cable and not the one which has mini HDMI or MHL or something like that. ",
            "date": "Answered December 9, 2019",
            "views": "83",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Reginald Johnson",
                "href": "/profile/Reginald-Johnson-55"
            },
            "answer_text": "No ",
            "date": "Answered November 30, 2018",
            "views": "46",
            "upvotes": "0"
        }
    ]
}