{
    "title": "Do you know which steps to take to safely jailbreak an iPhone? - Quora",
    "tags": [
        "iPhone 4",
        "Jailbreaking",
        "iOS Jailbreaking",
        "iPhones (product)"
    ],
    "response": [
        {
            "author_info": {
                "name": "Alex Trinidad",
                "href": "/profile/Alex-Trinidad-13"
            },
            "answer_text": "A jailbreak is basically a mod of iOS. It’s like rooting a phone on Android, only on iOS. Like they say (IDK if it’s a good comparison), “with great power comes great responsibility”, you need to take safety precautions while jailbreaking. First and most importantly, back up your iPhone before anything. Let’s say during the jailbreak process you do something you weren’t supposed to, like unplug your phone while it’s rebooting. You would probably enter a bootloop (when the Apple logo stays on the screen forever), in which case you would have to do a factory reset.  If you are on an older version of iOS which is not signed by Apple, you would be in even bigger trouble. You would no longer be on that version since factory resetting updates your software to the latest version of iOS, which would most likely not have a jailbreak released at that time, and when it does, a new update would release, with no jailbreak. If you have an older device which doesn’t get new software updates, this wouldn’t affect you. In my case, the iPhone 4 can run up to iOS 7.1.2, the 4s on 9.3.5 (actually 9.3.6, which is most likely jailbreakable), and the iPod on 12.4.1 (which I’m sure has a jailbreak). So it’s very important you back up all your data, or you’ll lose everything, and that doesn’t sound good, unless you don’t put anything on your phone. Still, your contacts, photos, messages, etc. are very important so it would be a good idea to back up your iPhone. Other than that, just follow all the instructions on the computer or watch a tutorial and follow everything thoroughly, just to make sure everything is OK. If nothing wrong happens, you’ve done it. You now have more freedom on your iPhone. Now all you have to do is be careful on what you install. Some could lead to a possible bootloop or glitch in the system… ",
            "date": "Answered October 9, 2019",
            "views": "440",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Ruslan Babura",
                    "user_href": "/profile/Ruslan-Babura"
                }
            ]
        },
        {
            "author_info": {
                "name": "John Clane",
                "href": "/profile/John-Clane"
            },
            "answer_text": "The answer may vary depending on which iPhone you have but the method that I would consider very safe to use and also easiest, is unc0ver. https://github.com/pwn20wndstuff/Undecimus/releases/download/v3.3.7/Undecimus-v3.3.7.ipa simply download and launch the jailbreak. Once downloaded you will need to force the security to accept apps downloaded from online in the security part of settings. Then, you will have a fully functioning jailbroken iPhone. It may take a few tries but it is completely normal, have fun LOL. A program named “Cydia” will be installed. In the app, you will be able to download add-ons to upgrade the operating system in ways you couldn’t on a ‘sober’ phone as I would call it. you’ll be able to remove stupid system apps like news and ibooks, customize your home screen with changing the animation when you swipe, or taking away the swipe and giving access to all your apps on one page. you aren’t limited to home screen customization though. You can unlock system features that android has, I’m not going to go into it but just have a look through cydia and you can find heaps of add-ons that pretty much make ios ultimately superior to android. eh, I’m done writing. Again, have fun. ",
            "date": "Answered July 21, 2019",
            "views": "147",
            "upvotes": " View 6 Upvoters",
            "upvoters": [
                {
                    "user_id": "Debra Bailey",
                    "user_href": "/profile/Debra-Bailey-62"
                },
                {
                    "user_id": "Olivia Lowe",
                    "user_href": "/profile/Olivia-Lowe-29"
                },
                {
                    "user_id": "Willie Collins",
                    "user_href": "/profile/Willie-Collins-23"
                },
                {
                    "user_id": "Dylan Shelton",
                    "user_href": "/profile/Dylan-Shelton-30"
                },
                {
                    "user_id": "Dolores Gonzales",
                    "user_href": "/profile/Dolores-Gonzales-19"
                },
                {
                    "user_id": "Luke Pring",
                    "user_href": "/profile/Luke-Pring"
                }
            ]
        }
    ]
}