{
    "title": "Do you collect anything? What got you started? - Quora",
    "tags": [
        "Book Collecting",
        "Art Collecting",
        "Collecting",
        "Collector's Items ",
        "Hobbies",
        "Personal Experiences",
        "Life and Living"
    ],
    "response": [
        {
            "author_info": {
                "name": "Madeleine Burnside",
                "href": "/profile/Madeleine-Burnside"
            },
            "answer_text": "I’ve always been a collector. When I was a child, I collected stamps (it was the 1950s in Britain) and rocks. At one point I thought I would grow up to be a geologist (I didn’t). When I was about twelve I began collecting coins, but they were really too high for my budget, even though I was collecting very basic ones. I did stumble on one amazing find: An anti-slavery token from the 1790s. I purchased in a saucer of pennies that took my whole allowance for the week. I remember protesting to the antique shop owner that it wasn’t even a real coin and what was it doing there, but he just shrugged and told me there would be no discounts. I think he just wanted kids out of his store. Anyway, today it’s a prize possession.  In my 20s I moved to the U.S. and became a citizen. When, in 2001, George W. Bush became president despite the fact that Al Gore had won the popular vote, I was incensed. To add insult to injury, I was living in Florida and it was all Florida’s fault—the whole hanging chad thing, if you remember. I felt personally responsible in some weird way. I was looking on eBay for something completely different and came across a 1920s figure of an American WWI officer. He’s about 3 inches high, made of iron, and he has a clipboard in his hand. He looks worried. I identified with him. He was going to write a letter of complaint, or he was checking to make sure all his people were okay, or he was going to have to live with some repugnant order that he was reading. I liked him. I think I paid $8. Then I started looking at other American vintage toy soldiers. A lot of them were just regular guys doing mundane support tasks, like peeling potatoes or frying eggs, or they were radio operators, or trench-diggers, or banjo players. I thought they were charming. I decided I would only collect the peaceful ones. Then 9/11 happened and all the madness and horror around that, which has expanded outwards from the destruction of the Twin Towers. I began collecting fighting soldiers and nurses—all made of lead or iron (I’m too much of a snob for the plastic ones.) This phase went on for a long time—I collected hundreds of them—and then we began to see and meet soldiers wounded in Afghanistan and I began to feel differently about them again. The soldiers I have (due to the restriction to vintage only) were WWI-Korea/Vietnam, none later, but they seemed emblematic of everyone since then too. I decided, no more fighting. I put together a victory parade of marchers and bystanders that was actually based on various YouTube videos of the WWII victory parade held in London in 1946. As far as I can tell, there were parades in small towns across the US at that time, and a tickertape parade in New York, but nothing on the scale of the British one. So this is the parade that should have but never really happened. It honors all the people who fought a good fight for the Allies and wounded soldiers are among the onlookers. Nurses are marching as boldly as the men (as they did in London). It honors everyone’s courage, the hideous waste of life, and the people everyone was marching for—the fallen comrades as well as the hopeful children waving flags. Every period has a marching band, the Legionnaires are there, marines of all vintages, and WWI mounted cavalry. I don’t have jeeps or other equipment—the people are the point for me. It’s poignant—almost all those who would have marched as living people are dead now anyway. They worked and fought and died for their ideals. They had hideous experiences, they did terrible things, heroic things, mundane things. They forged life-long friendships. They were my parents or my friends. They had their limbs blown off or they had no visible injuries but debilitating PTSD. Each of my little figures stands for thousands of real people. It makes me love them all. They are marching all around my office as I write. I made a not-great video of them that is available on You Tube if you are curious.  ",
            "date": "Answered March 1, 2020",
            "views": "94",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Ken And Phyl Osterhaus",
                    "user_href": "/profile/Ken-And-Phyl-Osterhaus"
                }
            ]
        },
        {
            "author_info": {
                "name": "Deborah Brady",
                "href": "/profile/Deborah-Brady-15"
            },
            "answer_text": "I’ve answered a similar question on Quora, but I’ll talk about a different collection than the ones I listed in that answer. When I was a child, I collected angel figurines. None of them were pricey, but I would often receive these figurines as gifts. Fast forward to my newlywed period. On our first Christmas together, my husband gave me a large M.I. Hummel angel figurine named “Heavenly Angel.” I had never seen such a beautiful angel figurine! When my birthday came around one week later, he gave me three small Hummel angels. These angels were the beginning of an all Hummel angel collection, which I never stop enjoying. They come in many sizes and motifs, but they are all beautiful, in all of their handcrafted wonderfulness! One of them is a clock tower which is also a real clock. Little childlike angels blow their trumpets as they lean out of the upper windows. The clock chimes on the hour, and I can choose the tune it plays should I wish to hear one. Now that many years have passed, I don’t see Hummel figurines for sale very often anymore. That is OK, as my collection doesn’t really need to get any larger. ",
            "date": "Answered March 3, 2020",
            "views": "50",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Andrea Weisbard",
                "href": "/profile/Andrea-Weisbard-1"
            },
            "answer_text": "I have 4 collections, I collect elephants, turtles, Hard Rock Cafe pins and refrigerator magnets I started collecting elephants when I was about 20 years old and learned that they were dying and a rapid rate because of their ivory tusks. I have over 300 in my collection. I have nothing ivory in my collection. My turle collection started about a year after I started to collect elephants. I mostly collect, sea turtle items of the 7 species of sea turtles, which like the elephant, ate extremely endangered. My 3rd collection is my Hard Rock Cafe pins, When I go on vacation, I look on line to see if there is a Hard Rock Cafe and I must go. If someone goes somewhere and the is a HRC*, I ask the for a pin. For example, my oldest sister's husband went to Germany for work and found the HRC and got me a pin. I started my collection with a pin from the HRCZ in TIMES SQUARE in New York City. I have close to 200 My last collection is refrigerator magnets, like the HRC pins, I get at least one magnet from the place I go to. That is what I collect. *- HRC is short for Hard Rock Cafe ",
            "date": "Answered March 9, 2020",
            "views": "35",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Mike Lewis",
                "href": "/profile/Mike-Lewis-20"
            },
            "answer_text": "Podcasts. I have 30,899 to listen to and 2,058 that I’ve heard and decided to keep. I started my collection in 1992. I was listening to my radio when I came across some programs I wanted to keep. I bought a radio with digital tuning that could be left on and not drift then connected it to my VCR to record the radio programs at specific times. When the tape was full after recording six hours at half speed, I copied it onto cassettes. I went digital about twenty years later, downloading podcasts and listening to them first on my Palm Pilot then later on my phone. ",
            "date": "Answered March 22, 2019",
            "views": "45",
            "upvotes": " Answer requested by Marilyn James",
            "upvoters": [
                {
                    "user_id": "Deborah Brady",
                    "user_href": "/profile/Deborah-Brady-15"
                }
            ]
        },
        {
            "author_info": {
                "name": "James Beattie",
                "href": "/profile/James-Beattie-2"
            },
            "answer_text": "Lego, Transformers, GI Joe, Marvel Legends and wrestling figures. Started with Lego. It was something I didn't grow out of and continued with throughout high school and adulthood. And the the Masters of the Universe 200x series and Joe Vs Cobra line happened and I got swept up in them. From there Marvel Legends came out and the draw for me was the articulation. I pick up the odd Mattel WWE figure. Depends on the wrestler. If GI Joe continued with the 25th anniversary style, that would be my collecting priority. ",
            "date": "Answered March 21, 2019",
            "views": "44",
            "upvotes": " Answer requested by Marilyn James",
            "upvoters": [
                {
                    "user_id": "Adhitya Thirumala",
                    "user_href": "/profile/Adhitya-Thirumala"
                },
                {
                    "user_id": "Joey Hensley",
                    "user_href": "/profile/Joey-Hensley-4"
                }
            ]
        },
        {
            "author_info": {
                "name": "Joseph Young",
                "href": "/profile/Joseph-Young-106"
            },
            "answer_text": "Yes. Art, watches, stamps, rugs, hand-crafted furniture, books, music, pipes, marbles, etc…It’s a small collection. Stamps, originally. The post office ruined it for stamp collectors when they began to offer unlickables and forever stamps. U.S. postage stamps have given us a record of American culture. Nowhere else has shown such a detailed view of what we’ve all seen in our lives. It’s a good thing and I’m glad the post office is helping businesses today and will do so in the future. ",
            "date": "Updated July 8, 2020",
            "views": "196",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Quora User",
                    "user_href": "/profile/Marya-Sholevar"
                }
            ]
        },
        {
            "author_info": {
                "name": "Brett Bergan",
                "href": "/profile/Brett-Bergan"
            },
            "answer_text": "About the only thing I have that could be considered a “collection” is probably my various graphics cards including GT730, GT1030, GTX1050, GTX1050Ti, GTX1060 3GB, GTX1060 6GB, and GTX 1070. I also have a few older Radeon cards as well as a RX550, RX460, RX560, and RX570. I like overclocking and benchmarking them and seeing how they perform with various older systems and some of the new hardware. ",
            "date": "Answered April 30, 2019",
            "views": "44",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Deborah Brady",
                    "user_href": "/profile/Deborah-Brady-15"
                },
                {
                    "user_id": "Sohail Ahmed",
                    "user_href": "/profile/Sohail-Ahmed-7"
                },
                {
                    "user_id": "Gerry Glauser",
                    "user_href": "/profile/Gerry-Glauser"
                },
                {
                    "user_id": "Matt Fanslow",
                    "user_href": "/profile/Matt-Fanslow"
                },
                {
                    "user_id": "Jonathan Sullivan",
                    "user_href": "/profile/Jonathan-Sullivan-10"
                }
            ]
        },
        {
            "author_info": {
                "name": "Robert Mucci",
                "href": "/profile/Robert-Mucci-1"
            },
            "answer_text": "Since I was a child I have collected interesting bits and piece like old coins, fossils, stamps etc. But when I got a post in Africa I became interested in artefacts that were used by the tribal groups and have gone on to collect quite a big collection of things from all around the world used by these groups. Its not really of any great value but has hundreds of items of interest in it. ",
            "date": "Answered March 23, 2019",
            "views": "19",
            "upvotes": " Answer requested by Marilyn James"
        },
        {
            "author_info": {
                "name": "Imogen Howard",
                "href": "/profile/Imogen-Howard-4"
            },
            "answer_text": "I've collected jellycats since I was 7. These are jellycats:  This is a picture of three of my own, Spitfire, Coco and Blackberry. When I was seven, my family spent Easter in France. My mum decided that it was too much hassle to take chocolate, so she brought me my first jellycat (named Chocolate in honour of Easter). After that, the tradition grew. When I was younger, I received a jellycat every Easter and started getting them at Christmas as well. When we went on holiday to Norfolk my mum would buy me one. Eventually, I started buying my own. ",
            "date": "Answered April 16, 2019",
            "views": "350",
            "upvotes": " View 1 Upvoter"
        },
        {
            "author_info": {
                "name": "Jess H. Brewer",
                "href": "/profile/Jess-H-Brewer-3"
            },
            "answer_text": "Memories. Since birth. ",
            "date": "Answered March 23, 2019",
            "views": "63",
            "upvotes": " View 5 Upvoters "
        }
    ]
}