{
    "title": "Do you ever turn your computer off? Why or why not? - Quora",
    "tags": [
        "Computers"
    ],
    "response": [
        {
            "author_info": {
                "name": "Eric Farmer",
                "href": "/profile/Eric-Farmer-37"
            },
            "answer_text": "I turn my computer off when I leave the house and when I go to sleep. I don't see a reason to leave it running all the time. I think my modern computer turns on fast enough that I am not worried about waiting for it to boot. The only time I leave my computer on is when I am downloading something huge or doing a big update. ",
            "date": "Answered August 17, 2019",
            "views": "41",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Suzanne Reiter",
                    "user_href": "/profile/Suzanne-Reiter-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Robert Mudry",
                "href": "/profile/Robert-Mudry"
            },
            "answer_text": "Back in the day, the standard view of component reliability was the number of on-off cycles it would last. That had a lot to do with the fact that chips were attached to PCBs. Having the temperature go up and down was bad for solder joints. I don’t know if this is still true but I never turn anything off. Old habits… ",
            "date": "Answered August 19, 2019",
            "views": "40",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Mike Lewis",
                "href": "/profile/Mike-Lewis-20"
            },
            "answer_text": "I turn my PC off when I’m not uploading or downloading files as I can see no point in leaving it on. It saves energy and reduces the risk of a fire. I turn off my netbook before I put it in its case so it doesn’t overheat. ",
            "date": "Answered August 18, 2019",
            "views": "23",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "David Simpson",
                "href": "/profile/David-Simpson-275"
            },
            "answer_text": "Yes I do… I turn mine off when I go to bed, or when I’m out of the house for more than a few minutes. No point leaving it on, wasting power - when it’s not being used ! ",
            "date": "Answered August 16, 2019",
            "views": "3",
            "upvotes": "0"
        }
    ]
}