{
    "title": "Do you still have a landline telephone at home? If so, why? - Quora",
    "tags": [
        "Landline Telephone",
        "Eavesdropping",
        "Landline Phones",
        "Wireless Internet",
        "Telephones",
        "Telecommunications",
        "Wireless Technology",
        "Cellular Service Providers",
        "Wi-Fi"
    ],
    "response": [
        {
            "author_info": {
                "name": "Dan Birchall",
                "href": "/profile/Daniel-J-Birchall-1"
            },
            "answer_text": "I’m a tiny bit amused that the person who knows the most reasons to still have a landline phone is the guy who spent 30 years working for the phone company, in sales… ;-) I read Matt Snavely’s excellent list of reasons to formulate why I did, until recently, have one. Of course, I grew up in a house with a landline phone. Actually, two, one at each end of the house, but with the same number. After we got a modem, my parents eventually got a second line. They’ve had the same phone number for probably 55 years now! I moved out before everybody had cell phones, and over the course of about six or seven years, lived in 5 apartments in 4 towns in 3 counties in 2 states. So every time I moved, I had to get a new landline number. While living in the last of those apartments, my employer decided they wanted me to be reachable “on call,” so they got me my first mobile phone. Then I got an actual house in a different town in the state I was living in, so that was one more new landline number… which turned out to have been given up by a ball-bearing company so recently that it was still listed in the current yellow pages. Calls about ball-bearings early in the morning aren’t my cup of tea, so I complained and got another new one… and I stayed in that house for about 14 years! But eventually, I think I got rid of the landline number and just had DSL internet and a mobile phone, since I wasn’t really home very much… and didn’t want to give people an easy way to deduce whether I was home or not. When I moved to where I now live and work, it was back to apartment living. The cable and phone companies all offered “triple plays” so I opted for one with a fiber-optic connection and internet speeds that not so long ago I would’ve thought of as the sole purview of large universities. Ooh, shiny. I went out and got a corded wall phone with line-powered speakerphone, which worked great. Of course, since it was fiber-based, power outages meant phone outages unless I sprung for a battery backup… but my cell phone would still work, so I didn’t mind. I had this “triple play” until late last year or early this year, then decided it just wasn’t worth it. The only people I really wanted calls from on that line were my parents, but 99% of the calls that actually came in were scammers and caller-ID spoofers. Not cool, and it was a waste of my valuable time to even go through the voicemail and clean it out. So ultimately, I traded the triple-play for just internet, 10x faster. I could have kept my mobile number from where I used to live, but it was pretty far away and the time-zone difference could make for calls at awkward hours. So I got a new mobile number in a local area code here… with a prefix that geolocates to a rate center one county away from where I actually live and work, just in case the ninja assassins get hold of my number. (My work-issue mobile phone does the same in the other direction, and even my desk phone shows as a town about 20 miles from my desk.) So… no, no landline at home at present. Hoping to be able to afford a house again in the next several years, and will certainly entertain the idea again at that point… although exactly what form it will take remains to be seen. I now live in a world where an incoming call on my mobile might also ring on a laptop or tablet, and where all these devices also have video capabilities. My future “wall phone” might be a tablet or large-screened mobile phone with WiFi+LTE, mounted on the wall, with apps for “phone,” Skype, WhatsApp, Google Hangouts, FaceTime, or whatever else. And it might ring for a lot of the same things my mobile phone rings for. ",
            "date": "Answered August 4, 2019",
            "views": "655",
            "upvotes": " View 5 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Rory Andrews",
                    "user_href": "/profile/Rory-Andrews-15"
                },
                {
                    "user_id": "Geo Jose",
                    "user_href": "/profile/Geo-Jose-40"
                },
                {
                    "user_id": "Elsie Pearson",
                    "user_href": "/profile/Elsie-Pearson-3"
                },
                {
                    "user_id": "Sean Fernandes",
                    "user_href": "/profile/Sean-Fernandes-3"
                },
                {
                    "user_id": "Matt Snavely",
                    "user_href": "/profile/Matt-Snavely"
                }
            ]
        },
        {
            "author_info": {
                "name": "Matt Snavely",
                "href": "/profile/Matt-Snavely"
            },
            "answer_text": "I do, and here are a few reasons why. You can argue against each of my reasons (and so could I), and my kids are fine without having one, but for me the benefits still outweigh the cost. I’ve had the number for more than twenty years and have used it as the required “reach” number on hundreds of forms where I don’t really want them to reach me.It is a phone number for people I don’t really want to talk to.It has better quality for interactive conversations (business) and conference calls, plus on conference calls both hands are free, I can trust the mute function and I can still speak and hear clearly.It isn’t really very expensive as part of a triple play bundle from my cable provider.My phone stores messages so they aren’t out there somewhere “in the cloud”.I can call someone with the security of knowing they aren’t capturing my cell phone number.When I call 911, they know immediately where I am physically located.Using a handset on long calls is comfortable and I don’t have to monitor battery life.I can put it on speaker and write or take notes while I listen.During certain weather related power outages it is more likely to still have dial tone.If the cost spiked I would get rid of it, but for now, it is something I’ve always had and I like it. I wish I could still have the WSJ and local paper delivered everyday but they got too expensive and I miss them. I would miss this too, and nostalgia has value as much as tangible benefits sometimes. ",
            "date": "Answered April 12, 2019",
            "views": "18",
            "upvotes": " View 10 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Laura Adams",
                    "user_href": "/profile/Laura-Adams-364"
                },
                {
                    "user_id": "Sushant Mittal",
                    "user_href": "/profile/Sushant-Mittal-1"
                },
                {
                    "user_id": "Joshua Onkoba",
                    "user_href": "/profile/Joshua-Onkoba"
                },
                {
                    "user_id": "Barbara White Borden",
                    "user_href": "/profile/Barbara-White-Borden"
                },
                {
                    "user_id": "Mary R",
                    "user_href": "/profile/Mary-R-180"
                },
                {
                    "user_id": "Carly Aquino",
                    "user_href": "/profile/Carly-Aquino-3"
                },
                {
                    "user_id": "Cynthia Norman",
                    "user_href": "/profile/Cynthia-Lynn-Norman"
                },
                {
                    "user_id": "Laurence Taylor",
                    "user_href": "/profile/Laurence-Taylor-6"
                },
                {
                    "user_id": "Steven Gotz",
                    "user_href": "/profile/Steven-Gotz-1"
                },
                {
                    "user_id": "Randy Creighton",
                    "user_href": "/profile/Randy-Creighton-5"
                }
            ]
        },
        {
            "author_info": {
                "name": "Christine Sorenson",
                "href": "/profile/Christine-Sorenson"
            },
            "answer_text": "Do I still have a landline at my home? Yes, I do, but some years ago I converted it so the technology supporting the service is Voice over IP. So it is the same number I always had, I use the same phones, it works the same way (except I have a cool feature where I can get my voicemail messages on my phone via an app) and basically is a landline. I don’t remember if it costs $10/month or is free, but I have it probably from force of habit. I have had this number for a long time. Every doctor’s office, credit card company, etc., has the number. It would be very annoying to have to change my number with all those entities. The “landline” also functions well as a “spam catcher.” Despite being on the do not call list, I get several calls per day that are probably spam, as well as calls from non-profits to whom I’ve donated, political calls etc. I don’t answer any of them. It’s very useful to have that number to catch the junk calls. ",
            "date": "Answered March 1, 2019",
            "views": "161",
            "upvotes": " View 2 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Sushant Mittal",
                    "user_href": "/profile/Sushant-Mittal-1"
                },
                {
                    "user_id": "Barbara White Borden",
                    "user_href": "/profile/Barbara-White-Borden"
                }
            ]
        },
        {
            "author_info": {
                "name": "Barbara White Borden",
                "href": "/profile/Barbara-White-Borden"
            },
            "answer_text": "Yes, and I have had the same number for almost fifty years. My landline is reliable and I still have an old rotary dial phone in storage, which hopefully will work in case of catastrophic communication failure, although I probably wouldn’t be able to contact anyone except another rotary phone owner. (?) I only use my cell in the car and have started saying “no” when asked for my cell # because people get mad if they can’t get in touch with you in an instant. I am not attached to my cell—half the time I don’t know where it is at or it has a dead battery. I have never understood the attraction. I have a desk top and internet thru my phone line. I also appreciate the phone books that go with landlines. I can find addresses for people. Wonderful. ",
            "date": "Answered November 17, 2019",
            "views": "106",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Mark Thomason",
                    "user_href": "/profile/Mark-Thomason-29"
                }
            ]
        },
        {
            "author_info": {
                "name": "Ronald Kovacs",
                "href": "/profile/Ronald-Kovacs-1"
            },
            "answer_text": "Yes. POTS or plain old telephone service. After years of unreliable voip from a cable television system and modems that continuously needed to be reset and took 10 minutes to come back on line, really great for emergencies, I switched back to POTS copper wire phone service, and I use 60 year old rotary dial type phones in my house. No voice mail. No call waiting. No speed dial. My wife and I have this on our cell phones and all business related calls are on those. The phone number is unlisted we get no telemarketing, scams or what ever. 60 year old telephones with real brass bells. Rugged, reliable and do not require an external source of electrical power to work. All power is supplied by the phone utility. ",
            "date": "Answered August 15, 2020",
            "views": "51",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Sana Khan",
                "href": "/profile/Sana-Khan-4642"
            },
            "answer_text": "Yes, I do. I don’t use it much and I definitely use my mobile phone a lot more though. I live at my grandparents house and I think the landline phone was mainly installed just in case the mobile phones were lost or not working as a sort of back up second phone. It also looks rather old fashioned and cute. It’s a black 1980s landline telephone. The hearing quality of the voice of the person at the other end of the line is sometimes OK, but not so great at other times. My parents still have a landline phone too. It’s useful to be able to phone that number in case I can’t get hold of them on their mobile phones. ",
            "date": "Answered October 21, 2020",
            "views": "27",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Marc Bohets",
                "href": "/profile/Marc-Bohets"
            },
            "answer_text": "I just converted my landline to a VoIP account, as Only my mother calls me on that number, and I don’t use it for anything else.As I worked for the phone company, I did not have to pay for it, so I just left it as is, but now that I am retired, they will start billing my landline, so why pay for something you don’t use. I converted it to VoIP, so I will be able to call with national tarifs instead of international tarifs, while on holidays in other countries.The VoIP provider only charges conversation time, and no monthly subscription fee, so I can keep my landline number at nearly no cost Also VoIP and the SIP protocol was my specialty at work, so I still stay in touch with the VoIP technology while being retired. ",
            "date": "Answered February 19, 2019",
            "views": "447",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Sushant Mittal",
                    "user_href": "/profile/Sushant-Mittal-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Greg Lehey",
                "href": "/profile/Greg-Lehey"
            },
            "answer_text": "Yes, for some definition of “landline”. Years ago I converted to VoIP and transferred my phone number. Why? Connection quality is better.It’s easier to use.It’s at least one, maybe two orders of magnitude cheaper. I pay $8.33 per month with all calls anywhere in Australia. Calls to “landlines” in other countries (USA, Europe) typically run round 1.5¢ per minute. Only calls to mobile phones cost round 15¢ per minute, though I use my mobile phone for that to get prices round “only” 12¢ per minute.",
            "date": "Answered May 5, 2019",
            "views": "115",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Marcus Reeves",
                    "user_href": "/profile/Marcus-Reeves"
                }
            ]
        },
        {
            "author_info": {
                "name": "Cameron Anu",
                "href": "/profile/Cameron-Anu"
            },
            "answer_text": "I do not, and in my adult life, I have never had one. I have never seen the point and have only used cell. My parents and other older adults I know will never get rid of them because they’ve had them for so long, they don’t see a reason to not have them. Especially since they’ve had the same phone number for literal decades, lots of people they know contact them on these old numbers. ",
            "date": "Answered April 24, 2019",
            "views": "90",
            "upvotes": " Answer requested by Marcus Reeves and James Daniel Garza",
            "upvoters": [
                {
                    "user_id": "Mark Thomason",
                    "user_href": "/profile/Mark-Thomason-29"
                },
                {
                    "user_id": "Barbara White Borden",
                    "user_href": "/profile/Barbara-White-Borden"
                },
                {
                    "user_id": "Mary R",
                    "user_href": "/profile/Mary-R-180"
                },
                {
                    "user_id": "Marcus Reeves",
                    "user_href": "/profile/Marcus-Reeves"
                }
            ]
        },
        {
            "author_info": {
                "name": "Larry Larmer",
                "href": "/profile/Larry-Larmer"
            },
            "answer_text": "Yes ,i like the quality of voice on a land line, i like the security,i like a phone that i can use to keep in touch with my friends and family during a major, lengthly hydro outage or disaster. Because i have a package deal tv, internet and telephone i don’t save much by removing my telephone. So i have to decide what is most important to me? As for the cellphone when i’m not travelling i have it on emergency only. When i get in my are and turn on my radio I enjoy peace and Quiet .I make a point of remembering all important telephone numbers.( I strongly recommend all those with cellphones do the same thing) ",
            "date": "Answered May 7, 2019",
            "views": "128",
            "upvotes": " View 4 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Mark Thomason",
                    "user_href": "/profile/Mark-Thomason-29"
                },
                {
                    "user_id": "Barbara White Borden",
                    "user_href": "/profile/Barbara-White-Borden"
                },
                {
                    "user_id": "Mary R",
                    "user_href": "/profile/Mary-R-180"
                }
            ]
        },
        {
            "author_info": {
                "name": "Laurence Taylor",
                "href": "/profile/Laurence-Taylor-6"
            },
            "answer_text": "I do. And it’s not a VOIP line, either, it’s a standard copper pair from the exchange. Why? Several reasons. It’s not susceptible to power cuts, bad weather, &c.It is cheaper than a mobile, and cheaper to call as well. I can have extensions in every room.I don’t have to worry about the battery running down.I can never lose it.I need it for the internet.I can use a proper answerphone.I can use handsfree or a headset.It’s not dependant of the vaguaries of reception or if the local base station is working.If I want a new one, they’re cheap to buy and I don’t have to put up with the hard sell from the sales droid. That will do to be going on with! ",
            "date": "Answered May 13, 2019",
            "views": "172",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Barbara White Borden",
                    "user_href": "/profile/Barbara-White-Borden"
                }
            ]
        },
        {
            "author_info": {
                "name": "Robbin Schill",
                "href": "/profile/Robbin-Schill"
            },
            "answer_text": "We have a landline primarily to support our alarm service. In today’s day and age, a lot of alarm services use cellular communication and provide IP video. That’s cool but we live in a low coverage area and like that it is separate from our wireless service. We also occasionally use it for a telephone. It’s actually kinda of nice that we have a backup communication method for those times that cell service isn’t working well. ",
            "date": "Answered February 18, 2019",
            "views": "103",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Barbara White Borden",
                    "user_href": "/profile/Barbara-White-Borden"
                },
                {
                    "user_id": "Laurence Taylor",
                    "user_href": "/profile/Laurence-Taylor-6"
                }
            ]
        },
        {
            "author_info": {
                "name": "Khairul Islam",
                "href": "/profile/Khairul-Islam-2"
            },
            "answer_text": "Yes, people do. It’s very commonplace. Here in the UK, it’s usually (but not always) cheaper to have a landline along with internet service, compared to standalone broadband. Often the landline service comes with some free calls as well. Until recently, most cellphone carriers would not even let you call “freephone” numbers for free, whereas landlines have always allowed you to call them for free. ",
            "date": "Answered January 1, 2020",
            "views": "121",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Steve Whipp",
                "href": "/profile/Steve-Whipp"
            },
            "answer_text": "I live in rural Somerset in the UK. My mobile reception is dire, there are parts of the house that don’t get any signal at all, let alone any data. So a landline is essential. ",
            "date": "Answered April 22, 2019",
            "views": "70",
            "upvotes": " View 2 Upvoters ",
            "upvoters": [
                {
                    "user_id": "James Daniel Garza",
                    "user_href": "/profile/James-Daniel-Garza"
                }
            ]
        },
        {
            "author_info": {
                "name": "Bill Wing",
                "href": "/profile/Bill-Wing-9"
            },
            "answer_text": "Sort of. We have a VOIP phone with the old AT&T number. It is SIGNIFICANTLY cheaper than what AT&T wanted to charge, and it serves all the people who still want to use that old number to call us. ",
            "date": "Answered July 30, 2019",
            "views": "79",
            "upvotes": " View 1 Upvoter "
        },
        {
            "author_info": {
                "name": "Gayle Friedman",
                "href": "/profile/Gayle-Friedman-3"
            },
            "answer_text": "Last Forever. No beeps to replace on cradle to charge. Why would batteries need replacing when being charged on a cradle of phone. My question seems not on sight. Q: Why would a Landline Telephone Cord loose the connection to place to headphone? The Cord falls out from handset. Can this be fixed, or is my Landline is unable to use? ",
            "date": "Answered January 7, 2020",
            "views": "31",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Khan Abdul Aziz",
                "href": "/profile/Khan-Abdul-Aziz"
            },
            "answer_text": "In Pakistan we have only one major landline operator and there are some good calling packages even for the mobile network as well, also the service provider is a triple play provider and providers phone, internet and TV on the same copper cable so I use this connection for both Phone and Internet. ",
            "date": "Answered July 31, 2019",
            "views": "49",
            "upvotes": " Answer requested by James Daniel Garza"
        }
    ]
}