{
    "title": "Do you think that the uncanny valley will ever be overcome? - Quora",
    "tags": [
        "Uncanny Valley (robotics)"
    ],
    "response": [
        {
            "author_info": {
                "name": "Emily Hetzler",
                "href": "/profile/Emily-Hetzler"
            },
            "answer_text": "To answer that question, we need to know exactly why the uncanny valley is triggered to begin with. Are we biologically programmed to be suspicious and fearful of something that is almost, but not quite, human? Is our perception of the ‘other’ more of a cultural mindset? As an autistic person, I very rarely experience the uncanny valley. Most things that trigger it in normal people do not trigger it in me. I do not experience the sense of unease or discomfort that others might when viewing the very same subject. When speaking to or looking at an android or a CGI emulation of a person, I am most likely to notice and enjoy good artistry or fine craftsmanship, rather than being weirded out that it’s not quite human. If everyone else could be like I am, perhaps it would be possible to overcome or eliminate the uncanny valley. Except with Funko Pop! figures. Those are of the devil and they give me the heebie-jeebies unlike anything else I’ve found thus far. ",
            "date": "Answered June 9, 2018",
            "views": "566",
            "upvotes": " View 8 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Gail Anderson",
                    "user_href": "/profile/Gail-Anderson-9"
                },
                {
                    "user_id": "Monse Flores",
                    "user_href": "/profile/Monse-Flores-1"
                },
                {
                    "user_id": "Ryan Backus",
                    "user_href": "/profile/Ryan-Backus-2"
                },
                {
                    "user_id": "Pavlos Daskalakis (Παύλος Δασκαλάκης)",
                    "user_href": "/profile/Pavlos-Daskalakis-Παύλος-Δασκαλάκης"
                },
                {
                    "user_id": "Anders Ernest",
                    "user_href": "/profile/Anders-Ernest"
                },
                {
                    "user_id": "Dipyaman Ghosh",
                    "user_href": "/profile/Dipyaman-Ghosh"
                },
                {
                    "user_id": "Emily Fisher",
                    "user_href": "/profile/Emily-Fisher-32"
                },
                {
                    "user_id": "Sara Erickson",
                    "user_href": "/profile/Sara-Erickson-5"
                }
            ]
        },
        {
            "author_info": {
                "name": "Craig Weiler",
                "href": "/profile/Craig-Weiler"
            },
            "answer_text": "Yes, but the devil is in the details. Human motion is really hard to duplicate, but it can be done. These are the main issues currently holding back animation: Micro eye movements. The eyes never quite stop moving and in fact, if they don’t move, you can’t see anything. In animation the eyes are too still, creating a “dead eye” look.Micro body movements. our bodies are never completely still. They are always moving ever so slightly even when we are still. Not just breathing, but twitches, minor posture corrections, etc.Walking and running. Again, there are minor movements which give away the game. Each human is slightly different in how they move and animation doesn’t accurately reflect this.And of course, the minor imperfections of human anatomy. Too perfect will land you in the uncanny valley. These are all details to be worked out and algorithms to be written. it’s just a matter of time. ",
            "date": "Answered June 17, 2018",
            "views": "413",
            "upvotes": " View 4 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Aicha Raji",
                    "user_href": "/profile/Aicha-Raji-1"
                },
                {
                    "user_id": "João Vitor Lopes",
                    "user_href": "/profile/João-Vitor-Lopes-1"
                },
                {
                    "user_id": "Jim Franz",
                    "user_href": "/profile/Jim-Franz"
                },
                {
                    "user_id": "Moid Hasan",
                    "user_href": "/profile/Moid-Hasan-2"
                }
            ]
        },
        {
            "author_info": {
                "name": "Scott D. Feldstein",
                "href": "/profile/Scott-D-Feldstein"
            },
            "answer_text": "Of course it will. It’s called a “valley” precisely because it is a large dip in comfort between “not too human-like” and “accept as human.” Robots who don’t look too human are acceptable. Robots who look not-quite-human creep us out. And robots who look fully human leave us feeling pretty ok. There will likely always be this dip in comfort, but once you make your robot look really, really human, we’re fine. ",
            "date": "Answered June 6, 2018",
            "views": "115",
            "upvotes": " Answer requested by Sven Perlberg"
        }
    ]
}