{
    "title": "Do you need WiFi to play Nintendo Switch? - Quora",
    "tags": [
        "Nintendo Switch Announcement (October 2016)",
        "Nintendo Switch"
    ],
    "response": [
        {
            "author_info": {
                "name": "Kara Soylular",
                "href": "/profile/Kara-Soylular-3"
            },
            "answer_text": "Only for certain games. If you are going to play an online based game like Fortnite or the online portion of a game like Super Smash Ultimate or MineCraft, yes. (Which you’ll also need to buy the online subscription in order to play those).. Ofherwise, no. But you will need WiFi to update games and you may not be able to play a game until you update it.. Some games update more frequently than others.. Animal Crossjng hasn’t yet come out, but I’d say that would be an example of a game that updates a lot because they’ll most likely be adding new items and whatnot.. Smash Ultimate updates a lot.. ",
            "date": "Answered July 20, 2019",
            "views": "135",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "James McLean",
                    "user_href": "/profile/James-McLean-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Sergio Obando",
                "href": "/profile/Sergio-Obando-1"
            },
            "answer_text": "No, the Nintendo Switch does not NEED WiFi except for in the beginning when you set it up and create/link a Nintendo account to the Nintendo Store. After that you don’t necessarily NEED WiFi, but it’s highly recommended as it will keep your experience optimal. You also need software updates from time to time so you’ll need WiFi for that to keep up to date. ",
            "date": "Answered April 3, 2018",
            "views": "478",
            "upvotes": " View 11 Upvoters",
            "upvoters": [
                {
                    "user_id": "Marcus Ahmed",
                    "user_href": "/profile/Marcus-Ahmed"
                },
                {
                    "user_id": "Nadya S",
                    "user_href": "/profile/Nadya-S-17"
                },
                {
                    "user_id": "James McLean",
                    "user_href": "/profile/James-McLean-1"
                },
                {
                    "user_id": "Azan Khan",
                    "user_href": "/profile/Azan-Khan-8"
                },
                {
                    "user_id": "Vanilla Arts",
                    "user_href": "/profile/Vanilla-Arts"
                },
                {
                    "user_id": "Trey Hallmark",
                    "user_href": "/profile/Trey-Hallmark"
                },
                {
                    "user_id": "Blake Stone-Banks",
                    "user_href": "/profile/Blake-Stone-Banks"
                },
                {
                    "user_id": "David Rutter",
                    "user_href": "/profile/David-Rutter-2"
                },
                {
                    "user_id": "Catherine Hall",
                    "user_href": "/profile/Catherine-Hall-59"
                },
                {
                    "user_id": "Janet Hurtado",
                    "user_href": "/profile/Janet-Hurtado"
                },
                {
                    "user_id": "Bill Robet",
                    "user_href": "/profile/Bill-Robet"
                }
            ]
        },
        {
            "author_info": {
                "name": "Nicolas Le Gland",
                "href": "/profile/Nicolas-Le-Gland"
            },
            "answer_text": "No, it does not. You can play your physical games without ever connecting to the Internet, as Game Cards come with the required update. Pokkén Tournament DX is bundled with the 3.0.0 firmware, for example. During initial setup of your Nintendo Switch, you will be asked to establish a Wi-Fi connection to the Internet. If this is a concern, it can be skipped and set later. If you still expect to play online, the Nintendo Switch system supports the Wii USB-LAN Adapter (RVL-015) while docked, or any other officially licensed LAN adapters. You obviously can't update a game without an Internet connection, though. ",
            "date": "Answered April 3, 2018",
            "views": "365",
            "upvotes": " View 13 Upvoters",
            "upvoters": [
                {
                    "user_id": "Arjun Ajith",
                    "user_href": "/profile/Arjun-Ajith-3"
                },
                {
                    "user_id": "Tanner Albright",
                    "user_href": "/profile/Tanner-Albright"
                },
                {
                    "user_id": "Blake Stone-Banks",
                    "user_href": "/profile/Blake-Stone-Banks"
                },
                {
                    "user_id": "Elliot Algase",
                    "user_href": "/profile/Elliot-Algase-1"
                },
                {
                    "user_id": "Tom Householder",
                    "user_href": "/profile/Tom-Householder"
                },
                {
                    "user_id": "Derrik Pates",
                    "user_href": "/profile/Derrik-Pates"
                },
                {
                    "user_id": "Andrew Yao",
                    "user_href": "/profile/Andrew-Yao-4"
                },
                {
                    "user_id": "Colby Chua",
                    "user_href": "/profile/Colby-Chua"
                },
                {
                    "user_id": "Dustin Rausch",
                    "user_href": "/profile/Dustin-Rausch"
                },
                {
                    "user_id": "Mauro Flores",
                    "user_href": "/profile/Mauro-Flores"
                },
                {
                    "user_id": "David Ji",
                    "user_href": "/profile/David-Ji-21"
                },
                {
                    "user_id": "Joseph Cooper",
                    "user_href": "/profile/Joseph-Cooper-55"
                },
                {
                    "user_id": "Andrew Lindsey",
                    "user_href": "/profile/Andrew-Lindsey-3"
                }
            ]
        },
        {
            "author_info": {
                "name": "Andrew Lindsey",
                "href": "/profile/Andrew-Lindsey-3"
            },
            "answer_text": "Absolutely, provided that those games don’t need online connection, and are already either downloaded or present on the cartridge inserted into your Switch. I routinely take my Switch on trips and don’t bother connecting it to the hotel WiFi as I’m only playing single-player games I already have installed. Of course, any online component such as playing multi-player with people online won’t work. And you won’t be able to get any software updates, or buy digital download games from the online store. ",
            "date": "Answered January 10, 2019",
            "views": "58",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Kim Martinez",
                "href": "/profile/Kim-Martinez-39"
            },
            "answer_text": "So long as you don’t want to play online, you’re okay. Major firmware updates come on the game cards as needed, and if you don’t have WiFi you’re probably not intending to play stuff online anyway. While it would be kind of sad to miss out on stuff like the old NES games, so long as you can get somewhere with WiFi during the initial setup to make things a little easier, you can live without the internet. ",
            "date": "Answered July 1, 2019",
            "views": "23",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Robert Miller",
                "href": "/profile/Robert-Miller-231"
            },
            "answer_text": "Technically it will run without it. But it needs to download updates — in some cases, a newly-released game won't run without the latest system version. And of course, it downloads updates for the games themselves, including in some cases free additional content. Without WiFi, you'd also be limited to cartridge games, and there's lots of download-only releases on the e-shop. In practical terms, it really is necessary to connect it to the internet at least some of the time. ",
            "date": "Answered June 19, 2019",
            "views": "62",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Mauro Flores",
                    "user_href": "/profile/Mauro-Flores"
                }
            ]
        },
        {
            "author_info": {
                "name": "Connor Kobriger",
                "href": "/profile/Connor-Kobriger"
            },
            "answer_text": "You only need an internet connection to play online games. This is optional. If you don't have a Wi-Fi connection at home, you can purchase an official Ethernet adapter if you want to play online games or buy digital ones. Many games are plenty of fun without an internet connection! Some of these include Super Mario Odyssey, Breath of the Wild, Animal Crossing: New Horizons, etc. ",
            "date": "Answered May 19, 2020",
            "views": "917",
            "upvotes": " Answer requested by Lee German",
            "upvoters": [
                {
                    "user_id": "Patrick Chojnacki",
                    "user_href": "/profile/Patrick-Chojnacki"
                },
                {
                    "user_id": "Rafael Olivera",
                    "user_href": "/profile/Rafael-Olivera-5"
                },
                {
                    "user_id": "Thomas Jones",
                    "user_href": "/profile/Thomas-Jones-138"
                }
            ]
        },
        {
            "author_info": {
                "name": "Alfredo Sanchez",
                "href": "/profile/Alfredo-Sanchez-72"
            },
            "answer_text": "As everyone has already said here, you don’t NEED wifi to play games. Once in a while though you really should take it to a friends house that has wifi or a coffee shop or SOMEWHERE so you can download the newest firmware and game updates though. Having a Switch without wifi feels super pointless though. ",
            "date": "Answered October 18, 2018",
            "views": "17",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Norman Dicer",
                "href": "/profile/Norman-Dicer"
            },
            "answer_text": "It depends. For the most part, it doesn’t need wifi, but it’s a good idea to have wifi, because it’s required for system and game updates. Plus if you wanted to play a game like splatoon 2, you would need internet for online play. ",
            "date": "Answered April 5, 2018",
            "views": "61",
            "upvotes": " View 3 Upvoters",
            "upvoters": [
                {
                    "user_id": "Angel Manuel Rivera",
                    "user_href": "/profile/Angel-Manuel-Rivera-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Steven Forget",
                "href": "/profile/Steven-Forget-1"
            },
            "answer_text": "Only if using online services. Obviously in order to access anything online, the switch must be connected to the internet. If just playing offline games, no internet connection is required. I would just make sure that my system and games are all up to date before going offline ",
            "date": "Answered November 22, 2018",
            "views": "595",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Brian Ciesicki",
                "href": "/profile/Brian-Ciesicki"
            },
            "answer_text": "It COULD use Wifi on the roiad. The problem is all cellular devices limit “wifi tethering” so even though you may have unlimited data with an iPhone or an Android Phone, you cannot transfer it to your Switch when on the road. It’s because Apple and Google subsidizes the 4 cellular networks. Hence the cell phone companies are stingy with other brands of products. Unless Nintendo decides to make a Nintendo Switch Road Net Pak. ",
            "date": "Answered June 7, 2019",
            "views": "36",
            "upvotes": " Answer requested by Lee German",
            "upvoters": [
                {
                    "user_id": "Patrick Chojnacki",
                    "user_href": "/profile/Patrick-Chojnacki"
                },
                {
                    "user_id": "Rafael Olivera",
                    "user_href": "/profile/Rafael-Olivera-5"
                }
            ]
        },
        {
            "author_info": {
                "name": "Greg Wilcox",
                "href": "/profile/Greg-Wilcox-2"
            },
            "answer_text": "YES. Out of the box, there will likely be a firmware update that's required. If you don't have access to home wifi, consider taking the system to a friend's place who does or going to a library or other spot that has free wifi in order to get updates and download game demos. ",
            "date": "Answered November 25, 2018",
            "views": "312",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Chad Warden",
                "href": "/profile/Chad-Warden-3"
            },
            "answer_text": "To update the system to use most functionalities, yes. In order to play certain games such as LA Noire you need to perform an update before starting, so you would need Wi-Fi for that as well. Otherwise, no. ",
            "date": "Updated April 4, 2018",
            "views": "32",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Benard Quek",
                "href": "/profile/Benard-Quek"
            },
            "answer_text": "Only if you play online games. There are many offline games that you can play without having a connection to the Internet. The concept of the Switch is to take your gaming where you go, and this includes places that don’t have Internet access. ",
            "date": "Answered June 29, 2019",
            "views": "258",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Javier Mandry",
                    "user_href": "/profile/Javier-Mandry"
                }
            ]
        },
        {
            "author_info": {
                "name": "Angel Diaz",
                "href": "/profile/Angel-Diaz-96"
            },
            "answer_text": "Most Nintendo Switch games do not require an internet connection. And rightly so, since it’s a handheld system when you’re playing it on the go. If you don’t have wifi at home, then set your Switch up in a public place with wifi , so that you can download the latest system updates (and possibly game updates for the games that you bought with it) right away. ",
            "date": "Answered May 27, 2019",
            "views": "13",
            "upvotes": " Answer requested by Will Crigler",
            "upvoters": [
                {
                    "user_id": "Ishan Rawat",
                    "user_href": "/profile/Ishan-Rawat-18"
                }
            ]
        },
        {
            "author_info": {
                "name": "Joseph Darvish",
                "href": "/profile/Joseph-Darvish"
            },
            "answer_text": " If your playing Multiplayer Splatoon, or online MARIO Kart 8 Deluxe, or any other game that needs it. But you don’t need it for Zelda ",
            "date": "Updated August 29, 2018",
            "views": "43",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Mauro Flores",
                    "user_href": "/profile/Mauro-Flores"
                }
            ]
        },
        {
            "author_info": {
                "name": "Kj Mumme Wells",
                "href": "/profile/Kj-Mumme-Wells"
            },
            "answer_text": "Most games, yes, some of them, like Mario kart local multiplayer and smash local multiplayer, do not require internet, but most of the big games have to have internet to have full access to the game. ",
            "date": "Answered December 21, 2019",
            "views": "134",
            "upvotes": " View 1 Upvoter "
        },
        {
            "author_info": {
                "name": "Aiden Taylor",
                "href": "/profile/Aiden-Taylor-44"
            },
            "answer_text": "Depends on what you’re doing on it. If you bought a game with it, you can play it, but if you want to update it, buy a game on the eshop, or play a game with multiplayer, you will need an internet connection. ",
            "date": "Answered December 2, 2019",
            "views": "526",
            "upvotes": " View 1 Upvoter "
        },
        {
            "author_info": {
                "name": "Ava Farrugia",
                "href": "/profile/Ava-Farrugia-2"
            },
            "answer_text": "You do not need Wifi to play a Nintendo Switch game on the go or on the plane, however you will need Wifi to set up your account and shop for items on the Nintendo Switch Eshop. Obviously, wifi is also needed for the Nintendo Switch Online service to set it up and to use it with other players. ",
            "date": "Answered January 2, 2020",
            "views": "404",
            "upvotes": " Answer requested by Kalee Rabens, Javier Mandry and 5 more"
        },
        {
            "author_info": {
                "name": "Vince Sell",
                "href": "/profile/Vince-Sell-1"
            },
            "answer_text": "No, not necessarily there are loads of games that do offline campaigns/stories and the like. Grinding solo for gear, weapons etc. WiFi is an added optional feature for multiplayer online. ",
            "date": "Answered September 21, 2019",
            "views": "126",
            "upvotes": " View 1 Upvoter "
        },
        {
            "author_info": {
                "name": "Nathaniel Avila",
                "href": "/profile/Nathaniel-Avila-11"
            },
            "answer_text": "If you are playing FREE games on the Nintendo eShop, it needs Wi-Fi. but… If you bought a game, then it could either be played whether offline or online. ",
            "date": "Answered August 23, 2020",
            "views": "63",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Robert Wahlström",
                "href": "/profile/Robert-Wahlström"
            },
            "answer_text": "You don’t, you need Wifi or an USB lan addapter to play online.That’s all. But yeah if you don’t play online you don’t really need either. ",
            "date": "Answered January 22, 2019",
            "views": "667",
            "upvotes": " Answer requested by Anthony Bissell"
        },
        {
            "author_info": {
                "name": "Kane Schlichting",
                "href": "/profile/Kane-Schlichting"
            },
            "answer_text": "Not for offline physical games or any features that aren’t related to the Internet, or any games that need an update. ",
            "date": "Answered November 30, 2019",
            "views": "103",
            "upvotes": " Answer requested by Ozzie Sims"
        }
    ]
}