{
    "title": "Does a smart phone replace a laptop? - Quora",
    "tags": [
        "Smartphones Vs. Laptops",
        "Laptops",
        "Computers",
        "Technology"
    ],
    "response": [
        {
            "author_info": {
                "name": "Arihant Bharadwaj",
                "href": "/profile/Arihant-Bharadwaj-2"
            },
            "answer_text": "In short, yes they can. Now lets jump into the specifics and details. Why do people use a laptop nowadays? There are mainly 2 main reasons: Laptops generally have a bigger screen which makes them easier to work on for long hours. Smartphones and their small screens on the other hand aren’t practical to use for 9 hours a day. Also typing on a physical keyboard is much better than typing on a touchscreen.Laptops are more powerful and many provide more ways and lesser limitations to how a tool would be used. Ex. Using excel on a laptop provides more features than excel on a phone, coding and debugging huge programs on a phone right now is unimaginable.How could smartphones tackle this problem: Tablets which are essentially large screen smartphones can solve the size issue. We are now seeing the birth of foldable phones. these make a device both compact and sufficient in size. Attachable keyboards and accessories will give it a laptopy feel.SoC’s or smartphone chips are becoming increasingly powerful. If we take the case of the iPad, it is extremely powerful but is limited by the software. Companies are trying to ensure that performance benchmarks of phones be on par with that of computers.So, in conclusion the general idea of smartphone will replace laptops but the looks and feels of a laptop will still exist. ",
            "date": "Answered September 8, 2019",
            "views": "796",
            "upvotes": " View 8 Upvoters",
            "upvoters": [
                {
                    "user_id": "Jubayer Ahmed Jissan",
                    "user_href": "/profile/Jubayer-Ahmed-Jissan"
                },
                {
                    "user_id": "Michael Thompson",
                    "user_href": "/profile/Michael-Thompson-1553"
                },
                {
                    "user_id": "Shashwat Goyal",
                    "user_href": "/profile/Shashwat-Goyal-10"
                },
                {
                    "user_id": "Anupama Bharadwaj",
                    "user_href": "/profile/Anupama-Bharadwaj-2"
                },
                {
                    "user_id": "Aadit Nadkarni",
                    "user_href": "/profile/Aadit-Nadkarni"
                },
                {
                    "user_id": "Vishal Suthar",
                    "user_href": "/profile/Vishal-Suthar-46"
                },
                {
                    "user_id": "Anuraag Bharadwaj",
                    "user_href": "/profile/Anuraag-Bharadwaj-1"
                },
                {
                    "user_id": "Arihant B",
                    "user_href": "/profile/Arihant-B-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Ram Vignesh",
                "href": "/profile/Ram-Vignesh-4"
            },
            "answer_text": "Yes. And No! It depends on the aspects you’re focussing on. If you think in terms of screen size, then no. But again, the screen resolutions of modern smartphones are a bit higher than that of a wide range of laptops, even though the screen ratio differs by a huge margin. If you think in terms of processing power, then YES. Nowadays, most of the smartphones have 8-cores (four times more than an average laptop) operating at a frequency around 2 GHz. High-end flagship phones like Black Shark 2, can clock a frequency up to 2.8Ghz on all eight of its cores. Also, it has beat most of the premium laptops by having a whopping 12 GB of RAM! Other aspects would be performing day-to-day activities like working on presentations, composing an email, tallying sheet etc., in which the smartphones would come way more handier than a laptop would. Needless to say, a lot of apps are on the shelves to make life easier. P.S: I wouldn’t consider gaming to be one of the main aspects, as a lot of games are platform-exclusive. However, there are a lot of high-end games for smartphones which can provide similar graphics quality along with lag-free experience. ",
            "date": "Answered August 1, 2019",
            "views": "497",
            "upvotes": " Answer requested by Devaraj Nagamayya Subramanian"
        }
    ]
}