{
    "title": "Does technology shape society, or does society shape technology? - Quora",
    "tags": [
        "Social Dynamics",
        "Impact",
        "Technology Trends",
        "Society"
    ],
    "response": [
        {
            "author_info": {
                "name": "Jamal Mosley",
                "href": "/profile/Jamal-Mosley-1"
            },
            "answer_text": "Both. Society creates needs, these needs have to be met. Innovative people then meet the challenge because society says “we’ll compensate you if you can figure this out” and so the race begins. When that technology is developed, and the need is met, the technology inspires society to develop new wants and needs and so the cycle begins anew. Consider the biggest technologies in Human history: The wheel, created ancient civilization because it allowed for transport; The clock and calendar, allowing societies to develop schedules for all of their activities; Writing, allowing information to be passed down accurately from generation to generation; Farming, eliminating the need for civilization to be nomadic; Education systems, allowing for the standards of professionalism to be raised and specialized people to be created; fast-forward to the Industrial Age with the Steam Engine and Coal power plant; fast-forward again to the development of flight; fast-forward again to the atomic bomb and the first computer; etc. Each new major technological breakthrough truly revolutionizes how societies function and interact with each other, which in turn creates the catalyst for new challenges which require new technologies. Artists have a huge responsibility for this. Consider the ancient story of Icarus or Da Vinci’s flying machine. These ideas predated flight by centuries and yet the influenced flight development. Consider that the concept of a “robot” was first developed by a Sci-fi writer in the 1920’s. Almost 100 years later, we already have robots, and that author’s vision of a true Artificial Intelligence draws ever nearer. Its a good question you asked, I hope I was able to answer it. ",
            "date": "Answered July 5, 2019",
            "views": "14",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Ellyza Capin",
                    "user_href": "/profile/Ellyza-Capin"
                }
            ]
        },
        {
            "author_info": {
                "name": "Abu Sanu",
                "href": "/profile/Abu-Sanu"
            },
            "answer_text": "Well without humans technology doesnt exist so technology is an integral part of human civilisationBut simply we could look it from two frames of reference I.e, Time , Sociocultural sides.Since the very first discovery of fire to the arrows and bows to wheels to the metal to the plastic during the first part of ancient civilisation technology eased workload .A simple example back in my hometown was that they used mortar and pestle to grind the coconut but now the entire process is automated within a single click.. 3 hours job reduced to 3 minute job without having any human intervention.This gave families more time to stay together and happier.. people started transportation. After the beginning of aviation 20 days ship travel reduced to a 4 hours cargo flight…people had got enough time to go for a family enjoyment downtown..Now from the aspect of sociocultural aspectEarlier during my childhood days life used to be in a colony where there 8-10 members in the family now that's a big family during those days we had no phones but trunk calling system wherein we had to wait for couple of hours to get the other user on the line..though technology was a miniature during those days the feeling of togetherness made us even more happier.But later on phones were introduced which made communication seamless but the trend of small families began which by the way was another big change in sociocultural aspects of how technology changed the structure of society ",
            "date": "Answered July 8, 2019",
            "views": "11",
            "upvotes": "0"
        }
    ]
}