{
    "title": "Does the government spy in your cell phones? - Quora",
    "tags": [
        "Spies",
        "Espionage and Spying",
        "Government"
    ],
    "response": [
        {
            "author_info": {
                "name": "Nick Cohen",
                "href": "/profile/Nick-Cohen-15"
            },
            "answer_text": "It is widely believed that it is possible to “hack” into your cell phone, gaining access to the data, microphone, camera even if it is locked. It is certainly possible to take any information that leaves your phone for transmission, e.g. voice calls, texts, web sites visited (if it wasn’t possible, then how would the information get out?) There is also good evidence, a lot of which began to come out from leaks by Edward Snowden, that the government collects an enormous amount of the data of this type. Maybe all of it. In theory, they are only using it at a very broad level, looking at statistics over millions of calls and website visits. There is no person at the CIA, NSA or whatever looking at your personal phone logs. But, if they are collecting the data, they always could look at you individually; the data is there. In proper hands, you are fairly safe, the government needs a warrant to look into you personally. But, first, there are some courts that will grant warrants on demand. Second, an administration that - for instance - cared more about punishing it’s critics than the rule of law could probably get away with spying on your phone for a long time, if not forever. Have a nice evening! ",
            "date": "Answered February 4, 2017",
            "views": "61",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "James Whelchel",
                    "user_href": "/profile/James-Whelchel-3"
                },
                {
                    "user_id": "Huy Chau",
                    "user_href": "/profile/Huy-Chau-9"
                },
                {
                    "user_id": "Tamim Iqbal Fysal",
                    "user_href": "/profile/Tamim-Iqbal-Fysal"
                },
                {
                    "user_id": "Karen Fuentes",
                    "user_href": "/profile/Karen-Fuentes-6"
                }
            ]
        },
        {
            "author_info": {
                "name": "Tim Van",
                "href": "/profile/Tim-Van-7"
            },
            "answer_text": "Not on purpose, but never assume you electronic communications are completely secure, I don’t. Cellphones, landlines and computer based messaging can all be intercepted. If you use PGP or other encryption systems they may afford you some semblance of privacy from the local amateurs or police, but also know that using them might draw unwanted attention to exactly what you’re doing. The FBI or NSA algorithms identify such activity and earmark it for further analysis. It’s all relative depending on your level of paranoia. If I was involved in nefarious activities I’d certainly be more careful about what I say or type when communicating with others. ",
            "date": "Answered July 27, 2019",
            "views": "14",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Lisa Kinsler",
                    "user_href": "/profile/Lisa-Kinsler"
                }
            ]
        }
    ]
}