{
    "title": "Does the TV antenna work with a smart TV? - Quora",
    "tags": [
        "HDTVs (display device)",
        "Antennas",
        "Smart TVs",
        "LED TVs",
        "Television Sets",
        "Wireless Technology",
        "Television",
        "Electronics",
        "Technology"
    ],
    "response": [
        {
            "author_info": {
                "name": "David Newberry",
                "href": "/profile/David-Newberry-8"
            },
            "answer_text": "Hi.. If you have a smart Antenna… you got it made..or is it to install the antenna smartly.. I get those 2 mixed up a lot… BUT, a smart TV, has some software and some app’s you can program and use to make life simple for you. if you can get a signal over the antenna, your TV should be able to lock on and show you what it sees. Just select something (remote input selection) that says antenna or TV input, might even say something like “Analog” …which is kinda old school, signals over the air are all digital now.. Maybe a look at the Amazon web, to see the various antennas on the market. The page should give specs on how it work….Good Luck… Ya know, this is old school technology…But if you pick up “I Love Lucy” and it looks way clear…everything is working fine… Good Luck Dave ",
            "date": "Answered January 10, 2020",
            "views": "37",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Jalima Nodarse",
                    "user_href": "/profile/Jalima-Nodarse"
                }
            ]
        },
        {
            "author_info": {
                "name": "Greg Lovern",
                "href": "/profile/Greg-Lovern-1"
            },
            "answer_text": "“Smart TV” means one that streams content over the internet. An antenna tunes in to content broadcast on radio waves. Your smart TV doesn’t ONLY get content over the internet. It can also get content from your blu-ray player, your DVR, and your gaming console. It can get content from your camcorder. And it has an antenna that can tune in to broadcasts. So, yes and no, depending on what you mean. Do you mean does the smart TV’s streaming content come in over the antenna? No, it does not. But do you mean that your smart TV has an antenna that can tune into television broadcasts? Yes, it does, unless maybe it’s a super cheap model. ",
            "date": "Answered January 4, 2020",
            "views": "73",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Melissa Lozano",
                    "user_href": "/profile/Melissa-Lozano-2"
                },
                {
                    "user_id": "William Hobba",
                    "user_href": "/profile/William-Hobba"
                }
            ]
        }
    ]
}