{
    "title": "Does a smart TV work like a computer? - Quora",
    "tags": [
        "Smart TVs",
        "Television Sets",
        "Personal Computers",
        "Technology Trends",
        "Television",
        "Computers",
        "Technology",
        "Television Series",
        "Jobs and Careers"
    ],
    "response": [
        {
            "author_info": {
                "name": "Jim Grupé",
                "href": "/profile/Jim-Grupé"
            },
            "answer_text": "Does a smart TV work like a computer? Only to a very limited extent. For the most part, no. A computer has a general purpose processor, memory, long term storage, and a processor to drive a display that *looks* similar to a TV screen and has many similar physical attributes. But the display is actually what’s called a “peripheral”, like a printer, of fax machine, or modem. The computer is constructed to perform a wide variety of tasks, and to allow the user to load and execute programs of his choice. Only one minor function is output to a display device. That is why it is often necessary to add a separate “graphics processor” if you want better graphics performance. In the case of a TV, the display of streaming broadcast/cable media is the purpose. The display and a tuner are the primary components. A “smart TV” adds a digital processor that can interpret digital data streams from the internet. The digital processor is the “peripheral”. It is a special purpose device with limited capability. It can execute programs coded for it by the manufacturer, but it doesn’t have an operating system or RAM that will allow you to upload additional programs that you found or wrote yourself. The smarts of a “smart TV” are pre-packaged in firmware and you cannot expand them beyond what the manufacturer included. ",
            "date": "Answered October 22, 2020",
            "views": "67",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Andy White",
                "href": "/profile/Andy-White-341"
            },
            "answer_text": "Yep it does - if we are nit picking - possibly more like a tablet. Almost certainly it will be sitting on a linux kernel of some flavour - it might even be android if you dig deep. It’ll maybe use the chrome browser or happen chromium (the open source version). And of course some brands will use none of the above but its a fair bet in most cases. You can even run apps or extensions if you have chrome browser - nothing too adventurous - mostly it’s links to youtube (in UK) BBC iPlayer, and other specific station apps - but mine also includes a few basic games for good luck. You’ll also maybe have a USB or sd card reader and the option to plug a drive of some sort in and play music and video files from your PC (usually a restricted number of formats). ",
            "date": "Answered October 22, 2020",
            "views": "43",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Al Klein",
                    "user_href": "/profile/Al-Klein"
                }
            ]
        }
    ]
}