{
    "title": "Does Nintendo Switch need to be charged to use TV mode? - Quora",
    "tags": [
        "Nintendo Switch Announcement (October 2016)",
        "Nintendo Switch",
        "Nintendo (company)"
    ],
    "response": [
        {
            "author_info": {
                "name": "Kieron Nelson",
                "href": "/profile/Kieron-Nelson-2"
            },
            "answer_text": "Depends on what you mean by “charged\". In order to have a signal, the Switch needs power. That can come from the Switch itself (I've forgotten to turn on the power supply before now) or it can come from the power supply from the plug. If it's coming from the power supply, the Switch itself doesn't need to be charged; otherwise, the power must come from the Switch itself, necessitating that it be charged. So if you mean, does the battery have to be charged to use it in TV mode? Then no, it can (and usually does) come from the plugged in power supply. If you mean, do you need to have a power supply outside of the TV, whether that be the Swotch battery or plugged power supply? Then yes, without either battery charge or power supply, the Switch will not work full stop. ",
            "date": "Answered July 20, 2019",
            "views": "146",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Darren Dommett",
                    "user_href": "/profile/Darren-Dommett"
                },
                {
                    "user_id": "Meesquee Go Ree",
                    "user_href": "/profile/Meesquee-Go-Ree"
                }
            ]
        },
        {
            "author_info": {
                "name": "Artem Olsen",
                "href": "/profile/Artem-Olsen"
            },
            "answer_text": "The dock charges the Switch when it is plugged in. So no. Plus, you need another dock if you want to plug it into your second TV. The Switch uses a micro SD charging cord. The same one any non Apple made phone. So if you have an extra one, just plug it into the wall, or where ever you usually plug your phone into. even if there was a way to connect it to your TV without a dock, if it was connected with a cord, it would be connected to the TV, which is plugged in 24/7 So it would not run out of power. ",
            "date": "Answered April 13, 2017",
            "views": "121",
            "upvotes": "0"
        }
    ]
}