{
    "title": "Does China own 70% of all Bitcoin? - Quora",
    "tags": [
        "Virtual Currencies",
        "Bitcoin"
    ],
    "response": [
        {
            "author_info": {
                "name": "Hasry Jasmi",
                "href": "/profile/Hasry-Jasmi-1"
            },
            "answer_text": "More than 60% of Hash power lies in China, but that doesn’t mean it is owned by the Chinese Government. A large chunk of ASIC miners are built by Chinese corporations, who also operate large mining farms in and out of China. Individuals and corporations own these mining farms, not governments. This demographic shift of hashpower towards China is likely due to its relatively cheap seasonal hydro-electricity rates, but the Chinese Government is irked that electricity is being used for Bitcoin mining and taking steps to regulate it. To end on a positive note, there are reportedly more mining farms with significant hashpower being setup to run in the West. ",
            "date": "Answered June 4, 2020",
            "views": "159",
            "upvotes": " View Sharers ",
            "upvoters": [
                {
                    "user_id": "Hasry Jasmi",
                    "user_href": "/profile/Hasry-Jasmi-1"
                },
                {
                    "user_id": "John Chin",
                    "user_href": "/profile/John-Chin-53"
                },
                {
                    "user_id": "Eric John",
                    "user_href": "/profile/Eric-John-98"
                }
            ]
        },
        {
            "author_info": {
                "name": "Stephan Loese",
                "href": "/profile/Stephan-Loese"
            },
            "answer_text": "That wouldn't surprise me. Almost all ASIC miners are made in China. The company I work for is owned by Chinese. The way I see it no country as a whole owns the BTC. Individual people and corporations own the coin. The whole thing doesn't bother me. I think the Chinese government actually made it harder for people in it's populated regions to mine so we can safely say their government is not behind the mining. I was told that many of the big mining operations are in areas that are very sparsely populated with the machines running on self produced renewable energy. ",
            "date": "Answered May 31, 2020",
            "views": "206",
            "upvotes": " View 3 Upvoters "
        }
    ]
}