{
    "title": "Does the release of Apple's MagSafe mean they are going to get rid of the port on iPhones? - Quora",
    "tags": [
        "MagSafe",
        "iOS",
        "Apple (company)",
        "iPhones (product)",
        "Apple Products and Services"
    ],
    "response": [
        {
            "author_info": {
                "name": "David Rogers",
                "href": "/profile/David-Rogers-26"
            },
            "answer_text": "It doesn’t. MagSafe only deals with charging, and doesn’t deal with data. If you want to quickly import (or export) lots of data, like moving video and photo files or syncing your phone to your computer, then you’ll still need to plug a cable into your phone. And even though MagSafe charging makes wireless charging more efficient, cables are still the fastest way to charge your phone. (See: iPhone 12 MagSafe wireless charging: Everything you need to know.) I believe it’s much more likely that Apple will eventually switch from the Lightning plug to USB-C for iPhones - perhaps in the next generation - than get rid of the cable. They’ve been slowly moving in that direction over the last few years, including their MacBook lines, the iPad Pro line, and even the upcoming iPad Air. And the Lightning cable that comes with iPhone 12 models will have a USB-C plug on the other end. By the end of this year, the only Apple products left that will still use Lightning will be the base-model iPad and, for some reason, the entire iPhone line. Perhaps that’s because Lightning has become so engrained with the user experience that they felt it would be uncomfortable for users to abandon it now, but Apple probably could have replaced Lightning with USB-C on all of their new iPhone and iPad models without too much controversy. ",
            "date": "Answered October 23, 2020",
            "views": "142",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Abhishek Duvvuri",
                "href": "/profile/Abhishek-Duvvuri"
            },
            "answer_text": "Probably. See, recently there was a ruling somewhere in Europe about having a standard for charging wires or something of the sort (I don’t remember exactly). Now, this would either force Apple to create a USB-C variant of their phones or just move their devices to USB-C entirely. But this is Apple, and they aren’t going to do that on the iPhones. So, it appears that they are aiming to get a portless phone out. MagSafe could be a part of that, as soon as they are reliably able to transfer power and data wirelessly to their Apple standards. It would make that easier with the magnets forcing the connection into the ideal alignment. ",
            "date": "Answered October 23, 2020",
            "views": "324",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Jay Vasinton",
                    "user_href": "/profile/Jay-Vasinton"
                },
                {
                    "user_id": "Roberto Santocho",
                    "user_href": "/profile/Roberto-Santocho"
                },
                {
                    "user_id": "Shane Gallagher",
                    "user_href": "/profile/Shane-Gallagher-7"
                },
                {
                    "user_id": "Miguel Paraz",
                    "user_href": "/profile/Miguel-Paraz"
                }
            ]
        }
    ]
}