{
    "title": "Does a medical student need an iPad? - Quora",
    "tags": [
        "Medical Students",
        "iPad"
    ],
    "response": [
        {
            "author_info": {
                "name": "Vinay Suresh",
                "href": "/profile/Vinay-Suresh-13"
            },
            "answer_text": "The iPad comes handy in medical studies. I use the iPad pro 12.9 inch (3rd gen) I use it for… Making notes during lectures in class Here are a few snaps of my notes [I use Microsoft OneNote with the apple pencil gen 2]    To read ebooks     To watch videos (like najeeb lectures) and make notes.      I also use a 3D atlas by Elsevier (it is a VERY helpful tool to develop visual memory and understanding) It's especially effective due to the flexibility and maneuverability it offers     Some of the advantages I'd like to brief The iPad saves you stacking towers of notebooks and textbooks, keeping all of them in one accessible place. If you worry that you might loose them all, remember that there is backing up and syncing of every single note online onto cloud (OneDrive in case of OneNote). You can also access those notes on your phone if you need them instantly.Note making on the iPad is an interesting experience. The tools at your disposal drives you to make good notes. It's quite useful for revision as well.After the release of iPad os, I feel apple has ticked most if not all the unchecked boxes to use it instead of a laptop. You can use an external hard drive, which solves the internal storage expansion problem.It is definitely useful if you utilise it the right way. It is a worthy future-proof investment. I preferred the 12.9 inch one as it feels as big as a notebook. But any model would do the job. Edit: Seriously didn't expect this answer to trend. Surprisingly this also made me the most viewed writer on iPad applications.  Thanks a lot for the response! ",
            "date": "Updated August 1, 2020",
            "views": "443",
            "upvotes": " View 1K Upvoters ",
            "upvoters": [
                {
                    "user_id": "Kalika Puri",
                    "user_href": "/profile/Kalika-Puri-1"
                },
                {
                    "user_id": "Swapnil Singh",
                    "user_href": "/profile/Swapnil-Singh-591"
                },
                {
                    "user_id": "Ritul Pargaie",
                    "user_href": "/profile/Ritul-Pargaie-14"
                },
                {
                    "user_id": "Aryan Rana",
                    "user_href": "/profile/Aryan-Rana-28"
                },
                {
                    "user_id": "Abhishek Deshmukh",
                    "user_href": "/profile/Abhishek-Deshmukh-128"
                },
                {
                    "user_id": "Deepooh",
                    "user_href": "/profile/Deepooh"
                },
                {
                    "user_id": "Abhinav Kumar",
                    "user_href": "/profile/Abhinav-Kumar-836"
                },
                {
                    "user_id": "Bharath Nagarajan",
                    "user_href": "/profile/Bharath-Nagarajan-13"
                },
                {
                    "user_id": "Abhinav Tiwari",
                    "user_href": "/profile/Abhinav-Tiwari-444"
                },
                {
                    "user_id": "Satyam Wahi",
                    "user_href": "/profile/Satyam-Wahi-2"
                }
            ]
        },
        {
            "author_info": {
                "name": "Archit Pathak",
                "href": "/profile/Archit-Pathak-2"
            },
            "answer_text": "To make things clear , Medical Students don't usually make notes from a textbook. This might not be true for some. In my 1st year , I made notes for Anatomy and Physiology on paper but when I started to read them , I couldn't. So I just highlight the important things on the textbook itself and use sticky notes if I have to write something extra in textbook. I do scribble on a rough notebook while reading but never read that scribble again. How I actually use my iPad : Read some reference books. I can't study my 1st line books on screen. I need a hardcopy .Using Apple pencil , I write down my important schedules or sometimes , scribble on the notes app while studying. Or draw a few diagrams.For Histology/Pathology slides and other organ pictures. I mark and label them up so that they are easy to revise before exams.Watch online lectures for PG entrance on iPad and make notes on a notebook. Yes , you can't make notes digitally and study them on screen later. You would need to print them for studying. So write them with flexibility on a real paper . Writing experience is never the same with iPad. Nothing can beat real pen and paper. The benefit of digital notes is that you never lose them. I'm thinking for scanning all my handwritten notes for safety as MBBS is 5.5 years long course , can't risk my precious notes.Play Games/ watch moviesThat's all I do! Archit Pathak MBBS Student ",
            "date": "Answered April 25, 2020",
            "views": "52",
            "upvotes": " View 41 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Abhishek Deshmukh",
                    "user_href": "/profile/Abhishek-Deshmukh-128"
                },
                {
                    "user_id": "Kopal",
                    "user_href": "/profile/Kopal-5"
                },
                {
                    "user_id": "Pratham Bahirat",
                    "user_href": "/profile/Pratham-Bahirat"
                },
                {
                    "user_id": "Ishika Gupta",
                    "user_href": "/profile/Ishika-Gupta-24"
                },
                {
                    "user_id": "Mitsu",
                    "user_href": "/profile/Mitsu-35"
                },
                {
                    "user_id": "Moses Srikanth",
                    "user_href": "/profile/Moses-Srikanth"
                },
                {
                    "user_id": "Vishwajeet Gupta",
                    "user_href": "/profile/Vishwajeet-Gupta-40"
                },
                {
                    "user_id": "Saniya Khan",
                    "user_href": "/profile/Saniya-Khan-518"
                },
                {
                    "user_id": "priyanshu",
                    "user_href": "/profile/priyanshu-18"
                },
                {
                    "user_id": "Shyamal Patel",
                    "user_href": "/profile/Shyamal-Patel-14"
                }
            ]
        }
    ]
}