{
    "title": "Does a 4G SIM smartphone support 5G SIM cards? - Quora",
    "tags": [
        "4G (wireless communication)",
        "SIM Cards"
    ],
    "response": [
        {
            "author_info": {
                "name": "Abisha Zaki Ar-Rafi",
                "href": "/profile/Abisha-Zaki-Ar-Rafi"
            },
            "answer_text": "Most 5G smartphones will support 4G. Backwards compatibility like this has been happening for generations down to 2G. Your 4G phone would probably support 2G along with 3G and 4G LTE. 5G phones will follow suit by allowing you to use 4G on a 5G phone since 5G itself isn't really widespread worldwide. It should also support 3G and 2G networks since a lot of providers still make use of 2G and 3G’s wider signal ranges to make sure call coverages are always available. For example, in my home town of Semarang, Indonesia. Providers like TELKOMSEL and Indosat Ooredoo still uses a lot of 2G towers. Even though 4G is mostly widespread in the country. So until SpaceX's Starlink constellation is used fully by providers around the world, I doubt backwards compatibility of network generations will die out soon. tl:dr yes it will cause lots of providers still use older network generations and due to the fact that 5G isn't widespread yet. ",
            "date": "Answered November 28, 2019",
            "views": "68",
            "upvotes": " View 2 Upvoters ",
            "upvoters": [
                {
                    "user_id": "SaRo ZuMs",
                    "user_href": "/profile/SaRo-ZuMs-1"
                },
                {
                    "user_id": "Aaditeya Rawat",
                    "user_href": "/profile/Aaditeya-Rawat"
                }
            ]
        },
        {
            "author_info": {
                "name": "Paul Chitescu",
                "href": "/profile/Paul-Chitescu"
            },
            "answer_text": "Currently all commercial 5G networks use a Non-Standalone mode where the initial access and authentication is done over 4G LTE and then switched to 5G access when available. The core network and all the logic remains 4G. The NSA mode doesn’t benefit of a new type of SIM card, an USIM card (that’s been used since 3G) would work just fine. However, the mobile operator may want to limit the 5G service to just some types of subscriptions. They may need to replace the card if it’s old and some files are not implemented on it (OTA can update files on SIM but for most cards not create new ones). 5G Standalone mode is now experimental (only two networks in the world are testing it pre-commercially at this time). It may use 5G SIM cards to provide IMSI Concealement and stronger security but can also use USIM if these features are not needed. ",
            "date": "Answered March 23, 2020",
            "views": "62",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Kit Kilgour",
                    "user_href": "/profile/Kit-Kilgour"
                }
            ]
        }
    ]
}