{
    "title": "Does a smartwatch make you look smarter? - Quora",
    "tags": [
        "Getting Smarter",
        "Smart Watches",
        "Wearable Technology",
        "Watches",
        "Smart People",
        "Intelligence"
    ],
    "response": [
        {
            "author_info": {
                "name": "John Gerard",
                "href": "/profile/John-Gerard-7"
            },
            "answer_text": "Well in Australia an Apple watch costs under or over $1000. The prices are around $1,500 for a fancy one A regular branded watch from popular firms are well under $300. So if you want the modern obsession with your own self it like an extension of Facebook or whatever right on your wrist. Do you look smarter because your pulse is being monitored. The contraption scores your sleep for you and the accelerators call your emergency number if you fall over and stop moving. So far you just spent way to much money on a gadget. If your calls and messages are so precious to you but you can’t pull you electronic pacifier out of your pocket then you will love it being available at arms length. Truly these things just magnify the worst parts of our increasingly narcissistic lives.The last thing big brand wearables make you look is smart. For the people who can still think clearly you are ridiculous. So anyone who’s about to get all bent out of shape should turn on their toes and let the silly little chip count all those steps you take away from me. ",
            "date": "Answered August 13, 2020",
            "views": "62",
            "upvotes": " Answer requested by Nikam Yangfo",
            "upvoters": [
                {
                    "user_id": "Nikam Yangfo",
                    "user_href": "/profile/Nikam-Yangfo"
                }
            ]
        },
        {
            "author_info": {
                "name": "Stephen Bazley",
                "href": "/profile/Stephen-Bazley-1"
            },
            "answer_text": "Yes, as most people are smart these days, and prefer not to use their intelligence, myself included!  For the record, a smartwatch is a dumb watch just like when we had dumb terminals spitting out the output of mainframes. Now we have dumb watches and dumb phones, spitting out the output of server farms. Remember, while we are looking down at our phones and watches trying to be more stylish, efficient and connected, we are actually missing out on the real world and the smiles from one another. That is not smart and it certainly isn’t sexy. ",
            "date": "Answered August 16, 2020",
            "views": "67",
            "upvotes": " View 1 Upvoter "
        }
    ]
}