{
    "title": "Does Germany or Japan manufacture better products? - Quora",
    "tags": [
        "Manufacturing",
        "Japan"
    ],
    "response": [
        {
            "author_info": {
                "name": "Brigitte Meier",
                "href": "/profile/Brigitte-Meier"
            },
            "answer_text": "You will find a different approach for different products. Take cars, German cars introduce a high percentage of new technology with a new generation of a model, so you have some interesting new gadgets, some are even useful and they like to tinker with engines and gearboxes to no end. German engineering looks for the most advanced solution, not the cheapest solution which works. The manufacturing process is supposed to flawless so malfunctions were fixed after the car was finished. The Japanese did not invent a lot regarding industrial products, they improve existing products and to get better they are willing to learn from others, see quality control and quality management. The Japanese improve their productions process to get large quantities of high-value products and as new technology has some inherent problems, they limit the amount. The results are very reliable products with a long life-span. If you need a high-tech production machine or an integrated production line go to Germany, they will manufacture the possible best device with far more functionality than you can use outside Germany and it will be a fair price. Germans enjoy finding new and better solutions and the famous master watchmaker ingenuity and the care is present in every member of the workforce, from top to bottom. This attitude seems to be more common in Japanese artisans than in the industry. Germans invent things but find no application for the new thing and they tend to over-engineer. They have a problem with customers who need a low-budget solution. The Japanese are not that creative and inventive or just do not use the full potential of their people, especially young men and women. ",
            "date": "Answered September 2, 2019",
            "views": "524",
            "upvotes": " View 2 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Gokulakannan Illayappan",
                    "user_href": "/profile/Gokulakannan-Illayappan-1"
                },
                {
                    "user_id": "Ian McCormick",
                    "user_href": "/profile/Ian-McCormick-34"
                }
            ]
        },
        {
            "author_info": {
                "name": "Marshall Gittler",
                "href": "/profile/Marshall-Gittler"
            },
            "answer_text": "It certainly depends on the product. But overall, I would expect Japan (at least in the auto industry). That’s because in Germany, they make the car and then inspect it closely. If they find any problems, they fix them before the car goes out, so you rarely get a car with any problems. In Japan, they inspect the car before it goes out, and if they find any problems, they go back to the assembly line and fix the source of the problem so that it doesn’t occur again. (From the book The Machine that Changed the World.) I think they follow this procedure in a lot of industries. However, this doesn’t apply to everything, and furthermore, as we all known, even the much-vaunted Japanese quality control has been slipping in recent years — just ask people at Takata, the airbag manufacturer that had to recall millions of airbags, or Kobe Steel, which admitted to falsifying data for over a decade, or even Toyota, which had to recall about 1mn cars recently for some problem, or…dare I point to the nuclear industry? Ask the people who live around Fukushima about Japanese quality control. ",
            "date": "Updated September 2, 2019",
            "views": "11",
            "upvotes": " View 5 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Jiva Krishna",
                    "user_href": "/profile/Jiva-Krishna"
                },
                {
                    "user_id": "Monte Marino",
                    "user_href": "/profile/Monte-Marino-1"
                },
                {
                    "user_id": "Takumi Santo",
                    "user_href": "/profile/山藤-卓実-Takumi-Santo"
                },
                {
                    "user_id": "Vatsal Dwivedi",
                    "user_href": "/profile/Vatsal-Dwivedi-3"
                },
                {
                    "user_id": "Steve Stevens",
                    "user_href": "/profile/Steve-Stevens-9"
                }
            ]
        },
        {
            "author_info": {
                "name": "Monte Marino",
                "href": "/profile/Monte-Marino-1"
            },
            "answer_text": "It’s close, but generally Japan. Especially in areas like automobiles, motorbikes, digital technology, power tools, batteries etc. Funnily enough, Germany would be #2 in most of those areas (meaning Germany is generally ahead of most other countries that aren’t Japan in those fields). Germans are pretty good at making automobiles and power tools for example, better than any other European country anyway. ",
            "date": "Answered September 2, 2019",
            "views": "360",
            "upvotes": " Answer requested by Steven Shu",
            "upvoters": [
                {
                    "user_id": "Gokulakannan Illayappan",
                    "user_href": "/profile/Gokulakannan-Illayappan-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Nicky Sekino",
                "href": "/profile/Nicky-Sekino"
            },
            "answer_text": "I do not know about the Germans but in case of the Japanese, I think the country’s high manufacturing standard comes from the people’s particular pride in craftsmanship. I mean most Japanese care about the fine finishings to the mili-meter. I am not kidding. I often think their perfection to minute details is a bit too much, which, by the say, makes me an exception. ",
            "date": "Answered January 14, 2020",
            "views": "223",
            "upvotes": " View 1 Upvoter "
        },
        {
            "author_info": {
                "name": "Ted Faraone",
                "href": "/profile/Ted-Faraone-1"
            },
            "answer_text": "I am not sure that they do. I think American and Canadian standards are far better over far larger production runs over far greater number of products. ",
            "date": "Answered January 13, 2020",
            "views": "121",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Himadri Pathak",
                "href": "/profile/Himadri-Pathak-1"
            },
            "answer_text": "Statista - The Statistics Portal ",
            "date": "Answered September 2, 2019",
            "views": "225",
            "upvotes": " Answer requested by Steven Shu"
        }
    ]
}