{
    "title": "Does Snapdeal sell original products? - Quora",
    "tags": [
        "Snapdeal.com (product)"
    ],
    "response": [
        {
            "author_info": {
                "name": "David S",
                "href": "/profile/David-S-564"
            },
            "answer_text": "No. Most of the Snapdeal Products are Duplicate. Recently I have ordered a Reebok running shoe which I got it in a good deal of 40% OFF. I was ordered and happily awaiting for the delivery. There were no update for first 4 days and on 5th day got a sms saying that your product got dispatched. Surprisingly it reached me on the same day and i found the seller is from the same city (Delhi) The moment I opened the packing got a big shock. It was cheap rated duplicate product which I could make out from the first look. The finishing Logo printing etc.. Immediately I called Snapdeal Call center. Their call flow is a MAZE which will never lead you to reach a executive. I logged IN into the snapdeal website and cancel the order. From that day onwards, even I’m unable to login to their website also. I never get the OTP to login. I tried hundreds of times and got pissed OFF and wrote a mail to their support center. Got the reply next day about the return request and they have organized a pickup agent. He came and picked up the duplicate shoe and disappeared. I was getting sms and mails from their support center to update my bank details for refund. But those stupid guys doesn’t gave me any clues how to upload my bank details into my account. I was unable to login to my account as I was not getting the OTP.I was unable to reach their call center as it is configured as a MAZE.No reply for my mails also from their customer support.Finally after couple of days i got a mail to update my bank details to my account, surprisingly I got OTP to login and I have updated. So all the Snapdeal bugs are a known traps and did intentionally by their team. Govt. should ban this website. ",
            "date": "Answered February 19, 2019",
            "views": "496",
            "upvotes": " View 191 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Jishnu RS",
                    "user_href": "/profile/Jishnu-RS"
                },
                {
                    "user_id": "Reuben John",
                    "user_href": "/profile/Reuben-John-20"
                },
                {
                    "user_id": "Anand JK",
                    "user_href": "/profile/Anand-JK-4"
                },
                {
                    "user_id": "Aishwarya Soni",
                    "user_href": "/profile/Aishwarya-Soni-65"
                },
                {
                    "user_id": "Ludhiya Sunny",
                    "user_href": "/profile/Ludhiya-Sunny"
                },
                {
                    "user_id": "Ruchit Moradiya",
                    "user_href": "/profile/Ruchit-Moradiya"
                },
                {
                    "user_id": "Jeffin Jacob Paul",
                    "user_href": "/profile/Jeffin-Jacob-Paul"
                },
                {
                    "user_id": "Shubham Kapil",
                    "user_href": "/profile/Shubham-Kapil-12"
                },
                {
                    "user_id": "Biswajit Choudhury",
                    "user_href": "/profile/Biswajit-Choudhury-11"
                },
                {
                    "user_id": "Virang Jain",
                    "user_href": "/profile/Virang-Jain-1"
                }
            ]
        },
        {
            "author_info": {
                "name": "Jade Thomas",
                "href": "/profile/Jade-Thomas-22"
            },
            "answer_text": "Yes they do..!!! FAKE MAC make-up, FAKE Victoria Secret, even FAKE Puma I’m in India at the moment, I was tempted to stock up on my make-up after seeing some of their cheap prices for “original MAC” Thankfully, being the smart and cynical buyer that I am I decided to buy just one unit in each item. I purchased one each in the MAC face & body, MAC compact powder, MAC prep & prime BB cream. All three items came from 3 different sellers and all 3 items were fake. The Victoria Secret spray was priced at the same price as in the USA, I was so disappointed when I received it… it barely had a scent… not the strong original scent of an original body spray by Victoria Secret. The packaging looks identical to the real thing.. so it’s either like a 10 yr old product or a Fake. Now the thing that really gets me is that they are not even “usable” fake MAC, the product is such a low quality that it’s completely unstable because it’s so cheaply made that it barely rests on the skin for minutes before breaking down. The liquid and powder has ZERO… I said ZERO resistance to just a drop of sweat. Couldn’t they even sell a Fake that we can actually use? I wont waste my time trying to fight for a refund, but i’m furious that none of my reviews I wrote were posted. People should know that this item is a FAKE. Shame on SnapDeal. ",
            "date": "Answered July 7, 2017",
            "views": "64",
            "upvotes": " View 182 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Mohd Ariz",
                    "user_href": "/profile/Mohd-Ariz-9"
                },
                {
                    "user_id": "Ruchit Moradiya",
                    "user_href": "/profile/Ruchit-Moradiya"
                },
                {
                    "user_id": "Biswajit Choudhury",
                    "user_href": "/profile/Biswajit-Choudhury-11"
                },
                {
                    "user_id": "Fake ID",
                    "user_href": "/profile/Fake-ID-202"
                },
                {
                    "user_id": "Bhaskar Suthar",
                    "user_href": "/profile/Bhaskar-Suthar"
                },
                {
                    "user_id": "Srinivasa Char",
                    "user_href": "/profile/Srinivasa-Char-1"
                },
                {
                    "user_id": "Rashmikiran Pandit",
                    "user_href": "/profile/Rashmikiran-Pandit"
                },
                {
                    "user_id": "Rishi .Raj",
                    "user_href": "/profile/Rishi-Raj-361"
                },
                {
                    "user_id": "Ishani Santra",
                    "user_href": "/profile/Ishani-Santra"
                },
                {
                    "user_id": "Prakashika G",
                    "user_href": "/profile/Prakashika-G"
                }
            ]
        }
    ]
}