{
    "title": "Does each wireless carrier own their own cell towers or do they share them? - Quora",
    "tags": [
        "Cell Towers",
        "Wireless Communication",
        "Mobile Computing"
    ],
    "response": [
        {
            "author_info": {
                "name": "Alistair Urie",
                "href": "/profile/Alistair-Urie"
            },
            "answer_text": "It's a bit of both and it depends a lot on which country you are referring to. There are a number of different models: An operator might acquire cell sites, build the towers and install their own gear and use their own spectrum.An operator might choose an area for a cell site and see if there is a special tower owner in the area that they can rent space and then install their gear and use their own soectrum. This also works for building roof tops in cities. It also works for whole regions if the tower company has lots of sites.An operator might form a strategic partnership with another operator and agree to share each other's towers and install their own gear and use their own spwctrum. This is called Mobile Operator Radio Access Network (MORAN) sharing.Two or more operators might agree to share their radio networks and for a given market or region they might use one of the partner operator's gear and so they share their spectrum. This is a trick called Multi-Operate Core Network (MOCN) sharing.An operator might decide to buy capacity for another operator and so go into business as a mobile virtual network operator (MVNO). In this case they are using the other operator's tower, gear and spectrum.There are lots of options and a given operator is likely to use some mixture of above. ",
            "date": "Updated June 22, 2019",
            "views": "122",
            "upvotes": " View 6 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Peter Michael",
                    "user_href": "/profile/Peter-Michael-91"
                },
                {
                    "user_id": "Ahmed Hamid",
                    "user_href": "/profile/Ahmed-Hamid-2"
                },
                {
                    "user_id": "Aaron Quandt",
                    "user_href": "/profile/Aaron-Quandt"
                },
                {
                    "user_id": "Adam Kneitz",
                    "user_href": "/profile/Adam-Kneitz"
                },
                {
                    "user_id": "Anush",
                    "user_href": "/profile/Anush-13"
                },
                {
                    "user_id": "Rupert Baines",
                    "user_href": "/profile/Rupert-Baines"
                }
            ]
        },
        {
            "author_info": {
                "name": "Kurt Behnke",
                "href": "/profile/Kurt-Behnke"
            },
            "answer_text": "It is a mix. First of all: the majority of base stations are not on cell towers. They sit on rooftops in urban areas. And there everybody has their own rented space. Although on a large building you can find multiple base stations from different operators. When it comes to more rural areas: originally operators insisted to have their own — in the very early days it was even a regulatory requirement. The, driven by increasing cost and the push for lower tariffs, operators started to share. Today in many countries there is even a requirement to check with your competitors if you can join in on an existing tower, or build a new one jointly. The last move (in recent years) is now to outsource the tower business to dedicated cell tower companies like Crown or American Tower. They buy towers from multiple operators, and their business is sharing among as many as you can. The end-game will probably not see any site location owned or rented directly by an operator. The tower business is real estate (meaning: low risk, low revenue, long term perspective) while the core business of mobile operators is on the opposite side of the business spectrum (be fast, take risks, go for high profits). ",
            "date": "Answered August 27, 2020",
            "views": "351",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Victor Zwinklis",
                    "user_href": "/profile/Victor-Zwinklis"
                }
            ]
        }
    ]
}