{
    "title": "Does Apple's new 'iPhone 12' have a 5G problem? - Quora",
    "tags": [
        "5G (wireless communication)",
        "Wireless Technology",
        "Technology Trends",
        "Mobile Technology",
        "Apple (company)",
        "iPhones (product)",
        "Apple Products and Services",
        "Technology"
    ],
    "response": [
        {
            "author_info": {
                "name": "Josh Osborne",
                "href": "/profile/Josh-Osborne-6"
            },
            "answer_text": "The iPhone 12 hasn’t been announced, and while it is widely believed that it will be announced tomorrow that means we know basically nothing about it. We don’t know if it will be called the iPhone 12. We don’t know if it will support 5G. We don’t know which of the many different kinds of 5G it supports (if any!). We don’t know if Apple will make a big deal out of 5G, or downplay it (“it has 5G so it’ll still be a great phone years from now when 4G goes away”) In my opinion 5G itself has a manor problem. Several actually: 5G comes in many flavors and people think they get all the advantages of all of them all the time. They don’t.Some 5G is faster the 4G, but the “fast kind” has extremely limited range and penetration…”why is 5G fast in my kitchen, but slow in the living room?”Some 5G uses super low power and can let you build a cellular tracker that runs 5x as long as a 4G tracker…but that 5G is also dog slowsome 5G has super long range, but again is slowsome has super short range which is ideal to solve the “last 100ft” problem for a fixed wireless provider…but it doesn’t work well for phonesPeople think it will be “faster” like LTE/4G was faster then 3G & 3G was faster then 2G and edge…and 5G can be faster (see above). People also forget why that use to matter. Pre 3G cell data networks were basically the dancing bear. It was amazing that it worked, because you never expected it to. It was really too slow to use for much of anything though. When 3G showed up it was useable, mostly. As long as a website didn’t have too many pictures. Video was right out nopety nope. With 4G video is just fine. You can stream movies and it is great. So where do you go from there? What is actually slow on hit cellular network? When you switch between WiFi and cellular do you notice? If WiFi doesn’t wow you with speed on something you care about you won’t get that feeling from 5G even if you are lucky and get “the fast kind”. That is 5G’s 5G problem. I expect if Apple launches a phone with 5G that they won’t step in it and actually rely on 5G to be a big deal. Marketing will be pushing something else in the new phones. A new look of it has one would be a far bigger deal! Amendum: ok, this answer didn’t exactly age well. The technical parts are all ok, but as it turns out Apple did lean into 5G on its advertising. Go figure. ",
            "date": "Updated October 17, 2020",
            "views": "208",
            "upvotes": " View 3 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Elle Hayes",
                    "user_href": "/profile/Elle-Hayes-2"
                },
                {
                    "user_id": "Ferenc Valenta",
                    "user_href": "/profile/Ferenc-Valenta"
                },
                {
                    "user_id": "Bastien Koert",
                    "user_href": "/profile/Bastien-Koert"
                }
            ]
        },
        {
            "author_info": {
                "name": "Kirn Gill",
                "href": "/profile/Kirn-Gill"
            },
            "answer_text": "What sort of “5G problem\"? The one a bunch of tech pundits are bitching about? These people are fucking incompetents that get paid to sound smart. Most of them barely have a clue. Quit reading the tech news, most of it is bullshit. ",
            "date": "Answered October 17, 2020",
            "views": "199",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Mauro Flores",
                    "user_href": "/profile/Mauro-Flores"
                }
            ]
        },
        {
            "author_info": {
                "name": "Dimitar-Esperanto Berberu",
                "href": "/profile/Dimitar-Esperanto-Berberu"
            },
            "answer_text": "IT has 2x 5G problems.- About 2 years late & maybe not all bands- The older phones less valuable without 5G (5 year support is useless with missing features) ",
            "date": "Answered October 12, 2020",
            "views": "62",
            "upvotes": " Answer requested by Chuck Bluestein"
        }
    ]
}