{
    "title": "Facebook bans QAnon. They immediately pop up on Parler. Are the media giants just giving away market share? - Quora",
    "tags": [
        "QAnon (conspiracy theory)",
        "Market Share",
        "Markets (economics) ",
        "Media",
        "Bans and Banning",
        "Facebook (company)",
        "Facebook (product)",
        "Marketing"
    ],
    "response": [
        {
            "author_info": {
                "name": "Yingzi Li",
                "href": "/profile/Yingzi-Li-7"
            },
            "answer_text": "According to the dictionary, QAnon is the name of a convoluted, far-right, pro-Trump conspiracy believing that there is a deep state plot that is against President Donald Trump. The deep state refers to any unelected “shadow government” - military, intelligence, and government officials who try to secretly manipulate government. QAnon believes that Hollywood A-listers, leading philanthropists, Jewish financiers, Democrat politicians, and some other elite cabals covertly kidnap children, drain their blood, and cannibalizes them to gain mystical power. Only President Trump can bring the deep state down which is referred to as “The Storm” or “The Great Awakening” by QAnon’s disciples. QAnon is on a par with the Nazi cult rebranded, promoting racist, genocide, anti-Jewish Nazi terrorism. Jews kidnapped and slaughtered Christian children and drained their blood to mix in the dough for matzos consumed on Jewish holidays. QAnon considers that there is a secret cabal that controls high positions in government, banks, international finance, the news media, and the church and disarms the police, promotes homosexuality, and pedophilia. Even this pandemic and lockdown is due to the control behind by the evil child-trafficking cabal. Since its emergence in the US in 2017, QAnon is now spreading like California’s wildfires across the internet. It was reported that the membership of QAnon groups on Facebook increased by 120% in March, engagement rates increased by 91%, and 487,310 Facebook posts and 281,554 Instagram posts mentioning QAnon-related hashtags and phrases appeared. It all started on 4chan, a digital drain of hate speech and conspiracy theory. The adherents to it derive their beliefs from the cryptic postings of Q, an anonymous commenter who they believe to assist Donald Trump in his heroic fight against the Satanic pedophile Democrats. In 2019, the FBI labeled QAnon a domestic terror threat, observing that conspiracy theories have the potential to encourage “both groups and individual extremists to carry out criminal or violent acts”. Facebook and Twitter banned QAnon due to its violent content and political disinformation about the unfounded claims about the Democrats running a child-trafficking ring or presidential candidate Joe Biden abusing children to US voters. Facebook says QAnon content, represents an “identified Militarized Social Movement,” which is prohibited under its current rules. In other words, Facebook is reclassifying QAnon as no different than an extremist militia group, but not quite on the level of a terrorist organization or full-fledged hate group. Facebook writes. “We’ve been vigilant in enforcing our policy and studying its impact on the platform but we’ve seen several issues that led to today’s update. For example, while we’ve removed QAnon content that celebrates and supports violence, we’ve seen other QAnon content tied to different forms of real-world harm, including recent claims that the west coast wildfires were started by certain groups, which diverted the attention of local officials from fighting the fires and protecting the public.” Disseminating hate speech and violence on Facebook disobeys their community standards and is disallowed. It is not a matter of giving away of market share, but a rule, a regulation that must be followed.  Twitter and Facebook’s crackdown angered QAnon followers and they created accounts on the new right-wing oriented platform Parler. Parler, a free speech site, is an American social networking service that often posts far-right content, antisemitism, and conspiracy theories, having a significant user base of Trump supporters. It is popular among people who have been banned from mainstream social media networks. Thanks for reading. Sources: Deep State | Dictionary.comDeep state in the United States - WikipediaFacebook bans QAnon conspiracy theory accounts across all platformsQAnon is a Nazi Cult, RebrandedFacebook bans QAnon conspiracy theory accounts across all platformsFacebook completely bans QAnon and labels it a ‘militarized social movement’",
            "date": "Answered October 18, 2020",
            "views": "56",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Martha M. Wood",
                    "user_href": "/profile/Martha-M-Wood"
                }
            ]
        },
        {
            "author_info": {
                "name": "Harry Hancox",
                "href": "/profile/Harry-Hancox"
            },
            "answer_text": "Yes. But it is shares of something that is outside their narrative. So evolution, suggests there will be an MSM & Social Media as equally divided as the people, split and separate social media. Do not overlook, greater markets exist outside the US, FB is already trying to be accepted in other countries. That is of course if the GOP do not direct the DOJ to bring them to heal or break them all up. I did tell them to do that way back in late 2016, though I pointed to Anti-Trust Laws q.v. The Sherman act & also The Federal Trade Commission Act., along with Section 230 for the tech giants, in particular, Google, Twitter & FB. I have written much on this, so unusually for me, I shall be brief, in my expected outcome. Conservative sites are less than 10% of the total, and that was including Sky & Fox, before liberal Comcast acquired Sky TV News etc, and I think woke-a-joke Liberal Disney, Fox. At best over time, it could grow to 40%.Changes to Section 230 are vital, Frankly had not the too civil GOP, taken a leaf out of the uncivil ‘by hook or by crook’, Democrat power grab, book, long ago, the election would not be seeing an orchestrated, in lock-step, powerful onslaught by liberal, tech valley, etc MSM & Social media, as we see now. Frankly, if Trump loses, sane Democrats should be asking, who do they come for next.I also outlined the US needs to add a rider to the Constitution, or painstakingly draft a Bill, to become Law, that amends your currently ‘too liberal’, tortious law on Libel, Slander & Defamation. Free speech is protected, it should remain so, but one cannot litigate & hope to win, when say defamation, in the expression of opinion made, fails unless it is intentionally malicious. Even then the Constitutional judge will favor the wrong do-er, the defendant. I opined it was as simple as removing the operative offender ‘malicious’, thus allowing actions, and allowing the less well off, to sue too.To be blunt I would already be indicting Mark Zuckerberg for lying to senators (5–10 years) and repeating those lies. Moreover, Dorsey should be indicted now for interfering with an election. My only surprise is Bill Barr has not done that, the case is clear against him. But then I have always believed US Law, UK Law & EU law is for the soi-disant elites & the real criminals white collar.",
            "date": "Answered October 21, 2020",
            "views": "41",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Michael Wayne Box",
                    "user_href": "/profile/Michael-Wayne-Box"
                }
            ]
        }
    ]
}