{
    "title": "For those who own a 4K television, how do DVDs and Blu-rays look on the screen? - Quora",
    "tags": [
        "Blu-ray",
        "Ultra HD Television",
        "4K (format)",
        "DVD",
        "Film and Television",
        "Television",
        "Technology"
    ],
    "response": [
        {
            "author_info": {
                "name": "Ryan Toyota",
                "href": "/profile/Ryan-Toyota"
            },
            "answer_text": "In some ways they look better than they did on my previous television. In other ways they look worse. Here is my honest experience, which is quite detailed so if you don’t care about my home theatre setup or experience context, you can skip down to the bolded points that most interest you.  I recently upgraded to a 4K TV (a 65″ Vizio P65-E1 with 4K HDR & Dolby Vision) and have had it now for about a month. My previous TV was an entry-level 49″ Sony 1080p panel, which I can’t remember the model number of. I paid almost four times as much for my new TV as I did for my old one, so there’s an expected quality jump in that factor alone. I made the upgrade because I’m really into movies and it was the last piece of my home theatre system that would really take it to the next level. I’ve always invested in sound quality before picture quality, and over the past few years I’ve built my home theatre up to the point where it sounds better than my local cinema (which is in a small town, so that’s not a huge feat). The last addition to that sound quality improvement was an Oppo 203 Blu-ray player, which I bought mostly for the sound quality but it also happened to have 4K capabilities. I bought a few 4K Blu-rays to play on it, knowing that eventually I was going to be upgrading my TV screen and I didn’t want to be re-buying too many discs in the future. Then Apple announced the 4K Apple TV and I was bombarded with ads for 4K movies every time I browsed iTunes on my Apple TV, so it didn’t take long for curiosity to get the best of me. There was a growing itch that I was playing content that wasn’t being displayed in all of its available detail that eventually got big enough for me to really consider taking the plunge. My wife’s comment one day that she would like a bigger screen in our home theatre was just the push I needed. We sit about 7 feet away from our TV. At that distance, a 49″ TV isn’t small, but it doesn’t feel like you’re in a movie theatre, which for us would be the ideal. I measured out the size of I screen I thought felt perfect based on our room size and viewing distance, and I settled on 65 inches. The new TV feels about equivalent in viewing angle to sitting about half-way back in a standard movie theatre. Our home theatre now sounds and looks better than our local cinema… with the right content of course.  So how do DVDs and Blu-rays look on the new screen? Both better and worse. First off, they look better than they did on my old screen because the quality of this new screen is so much better than my old one. It has a much wider 10-bit color gamut instead of 8-bit (which means it has the ability to display one billion different colors instead of just 16.7 million), and that results in more vibrant and/or more accurate colors, and depending on the content quality, can also result in less color banding and much more detail in highlights and shadows. The new display is also both brighter and darker than my old one, which is to say it has a brighter panel and higher contrast ratio which really makes a movie look great with the lights off. The whites are brighter, the blacks are darker. So in that sense, I find that older Blu-rays come alive in terms of color much more than they did on my old screen. As for perceived sharpness and detail, the Oppo 203 has excellent upscaling (computer algorithms that determine how a lower resolution image is converted to a higher resolution one), and as a result of that, many of my old Blu-rays look more detailed than they did on my old TV. Of course a lot of that perceived detail is because the screen is a fair bit bigger than my old one, so in the same way that you’re able to see more detail in a painting by moving closer to it, I’m able to see more details in many of my movies than I was able to with my old screen because the new screen is presenting those images much bigger. In fact I’m finding that Blu-rays on my new screen can look as good as a movie theatre. Blu-ray resolution is 1080p, which is roughly the same as 2K, and 2K happens to be the resolution that many movie theatres still project in and many modern films are still finished and distributed in. Not just low-budget films either. In the past year, Guardians of the Galaxy 2, Wonder Woman, Spiderman: Homecoming, Beauty and the Beast, It, Cars 3 and many more were all finished and distributed at a resolution of 2K. Most 35mm film prints equate to a resolution around 2K when projected in theatres (See Dave Martindale's answer to Does 4K resolution approach the resolution of a 35mm film print?). So while 4K is sharper, and 4K video is becoming more mainstream, 2K still seems to be the sweet spot where a film is sharp enough (or detailed enough) that it looks theatrical. I mean, I haven’t heard anyone complaining that Pixar films don’t look sharp enough in theatres or Wonder Woman was crap because the image didn’t have enough detail. Now, standard Blu-ray doesn’t have the color depth that a good movie theatre does, but for many movies that actually doesn’t make a huge difference. So that covers standard Blu-rays, but what about DVDs? While Blu-rays on my new screen can look as good as a movie theatre, DVDs do not. With DVD, we have a technology that was a massive improvement from VHS, but still falls quite short of the quality of images we see in a movie theatre. When DVDs first came out, they looked amazing on my 27″ tube TV. They looked even better on my 37″ 720p flat panel TV, however when I started buying Blu-rays I realized that a higher-quality picture was achievable, and the more I started to collect and watch Blu-rays instead of DVD, the more DVDs looked inferior. This was emphasized further when I upgraded again to a 49″ 1080p screen, and the larger screen size and higher resolution panel made the detail differences that much easier to see, similar to how shockingly blurry a billboard ad can look if you’re able to see one up close. Take this a generation further, and I’m now starting to notice the same thing happening with standard Blu-rays and 1080p movie streams, although the amount varies from movie to movie and for most movies it’s much more subtle than the difference from DVD. As I said, Blu-rays can look movie theatre quality in my home which is absolutely nothing to complain about, but the new discovery is that 4K Blu-rays can look better than a movie theatre in my home. As I view more and more 4K HDR content on my new TV, my mind is becoming used to a new high standard of detail and color, which standard Blu-rays and even many movie theatres can’t match. (Keep in mind that I live in a small town and the local cinema isn’t very advanced, the best cinemas will of course look better than my home theatre setup.) So it’s not that DVDs or Blu-rays are lower quality than they were before. But I do sometimes perceive them as being worse quality than I did before. The quality is technically the same, but because of the larger screen I’m able to see the lack of detail in DVDs that much more easily. In addition to that, new 4K HDR content has adjusted my standard of maximum picture quality, and so a great-quality 1080p image isn’t quite as impressive as it used to be. Not only that but I’m also able to now notice the difference between a great-quality 1080p image and a mediocre one.  Now, this doesn’t mean I’m going to go out and sell all of my standard Blu-rays to re-buy new 4K UHD copies. There are many instances where it’s not worth it. First of all, not a lot is available in 4K at this point. More importantly though, I’ve noticed that some of the 4K resolution content is barely distinguishable from a 1080p stream, as many movies just don’t have that extra detail available in their 35mm film prints or their 2K digital intermediates. Second, while I mentioned that 1080p isn’t as impressive, this doesn’t mean it doesn’t still look good. In some cases, it looks really good. I also happen to find that once you’re a few minutes into a good film, you don’t notice a lack of resolution nearly as much, as your mind gets used to what you’re seeing being the standard of sharpness. Sometimes the image being too sharp can even be a distraction from the film. This brings me to my third point, which is that some older movies with low resolution CGI special effects become even worse looking when shown side-by-side with sharper scenes that were scanned from the best 35mm prints of the film. Since your mind gets used to the sharpness of the new 4K scan while watching the film, when a special effects scene happens it looks that much worse because you’re comparing its detail level to what you’ve just seen in the previous scene. So there are a number of movies and TV shows I own where I would prefer to watch the 1080p version (in which all of the scenes would be close to the same level of detail) over a new 4K version. Don’t get me wrong, I still think there is a point to restoring older movies and releasing newer movies in 4K HDR, as the quality will technically always be better than 1080p, even if it’s just for the enhanced color and not an improvement in detail. Some jumps will be more noticeable than others, but even the least noticable ones I’d consider upgrading to if it’s one of my favourite films and I want to be able to soak up every conceivable detail. But for me it’s not worth the upgrade cost for most films.  To conclude, with this new 4K HDR television, I feel that my home theatre has reached the point where it can display the maximum level of detail available in most movies. It looks and sounds better than my local theatre. It makes me very happy to be able to watch movies that I didn’t have the chance to see in a cinema and no longer feel like I missed out on that experience. I can have it at home, which is even more comfortable! That being said, as is evidenced from this detailed answer, I’m the type of person that tends to notice these details. Many people may not perceive any improvement in the level of detail on a 4K screen. What will probably make the biggest change is simply the increase in the size of the screen. I would guess that if I had upgraded to a 4K 49″ display (keeping the screen the same size as my previous TV), I would have noticed the color improvement if it was a better panel than my previous TV (as most 4K TVs are), but I probably wouldn’t have noticed any difference in detail for a standard Blu-ray or DVD. Even the increased detail of a 4K image would have been very difficult to see at that size. Detail levels will also be dependent on the quality of the upscaling in your TV or Blu-ray player. As I mentioned earlier, my Blu-ray player is known for its excellent upscaling, so that helps make standard Blu-rays look their best, whereas some TVs or Blu-ray players could look worse if the upscaling algorithm isn’t doing a good job or if the TV settings aren’t right. So while that wasn’t a straight and simple answer to the question, I hope it was helpful. This is the type of question that I don’t believe can have a straight and simple answer, as there are so many different variables that play into it (and I didn’t even get into how tweaking your display settings can change things). ",
            "date": "Updated January 10, 2018",
            "views": "462",
            "upvotes": " View 48 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Martin Lothman",
                    "user_href": "/profile/Martin-Lothman-1"
                },
                {
                    "user_id": "Eric Johnson",
                    "user_href": "/profile/Eric-Johnson-588"
                },
                {
                    "user_id": "Gene Kuya",
                    "user_href": "/profile/Gene-Kuya"
                },
                {
                    "user_id": "Christian Jones",
                    "user_href": "/profile/Christian-Jones-206"
                },
                {
                    "user_id": "Louise Kelly",
                    "user_href": "/profile/Louise-Kelly-190"
                },
                {
                    "user_id": "Korey Sop",
                    "user_href": "/profile/Korey-Sop"
                },
                {
                    "user_id": "Tegan Caldwell",
                    "user_href": "/profile/Tegan-Caldwell"
                },
                {
                    "user_id": "Dawne Anderson",
                    "user_href": "/profile/Dawne-Anderson-5"
                },
                {
                    "user_id": "Indra Rosalia",
                    "user_href": "/profile/Indra-Rosalia"
                },
                {
                    "user_id": "Birgit Fischer",
                    "user_href": "/profile/Birgit-Fischer-2"
                }
            ]
        },
        {
            "author_info": {
                "name": "Greg Lovern",
                "href": "/profile/Greg-Lovern-1"
            },
            "answer_text": "We just got our first 4K TV a couple weeks ago. It’s a 65″ Sanyo FW65R70F. Only $380, Black Friday sale from Walmart. We don’t have a 4K disk player yet, and our Tivo is still HD not 4K, but the TV is a Roku smart TV and we’ve seen some 4K content via streaming. Not that you asked, but for reference, the 4K content is absolutely stunning. It really pops and is so, so clear and detailed. First, blu-ray and other HD content. It looks GREAT. So good that it’s not obvious that it isn’t full resolution. If I think about it I can see that it isn’t as detailed as 4K, but there are no jaggies, lines are smooth even in animation such as Pixar’s Cars movies. I’m fully satisfied with how blu-ray looks on it. I’d only bother buying 4K disks to replace blu-ray disks for my top favorite titles. DVD is a different story. The upscaling from DVD to 4K is 24x so we shouldn’t expect miracles, but honestly I’d hoped for a little better than this. I’ve only watched a few, but the best I’ve seen so far is the 1997 DVD of The Fifth Element. At the time it was widely considered a reference DVD for showing how good DVD could look. It looks soft on this TV, but there are no jaggies or artifacts. Another DVD I sampled on it is Pixar’s Cars (2006 DVD). In places the upscaling was impressive. In other places it’s swimming in artifacts. But no jaggies. The worst I’ve seen is the 2000 DVD of Pee-wee Herman’s Big Adventure. Like Cars, in places the upscaling was impressive. But there was less of that than in Cars. More of it was swimming in artifacts. The end of the bike race scene at the beginning of the film, where the finish line is visible, was really awful. No doubt some of that is compression artifacts in the early DVD. Even so, the DVDs were all satisfying enough to watch. And since I hadn’t seen Pee-wee Herman’s Big Adventure in a while, I sat through the whole thing and enjoyed it as usual. But for favorite titles, I’ll definitely be looking to replace DVDs with 4K or at least blu-ray disks. But upscaling DVDs might work better on better equipment. I tried turning off upscaling on the blu-ray player to get the TV to do it, but that was even worse. My blu-ray player is an old, cheap one from 2009 — the cheapest well-reviewed model you could buy in 2009 as I recall; a Sony BDP-S360 — and later, better models, especially 4k players — might upscale much better. I’d be interested in hearing from people who have better players. Especially a Samsung K8500. Our old blu-ray player made DVDs look okay on our old 62″ 1080p TV set. But I guess displaying DVD on 4K is a harder job. UPDATE: I have a Sony 4K blu-ray player now. It makes DVDs look MUCH better than when using the TV’s upscaling. They’re still soft of course, and I can still see some artifacting in the worst ones. But it’s vastly improved. If you want to watch DVDs on a 4K TV, I recommend getting a 4K blu-ray player with excellent upscaling. ",
            "date": "Updated October 13, 2020",
            "views": "27",
            "upvotes": "0"
        }
    ]
}