{
    "title": "For how much longer will the Earth be able to sustain human beings? - Quora",
    "tags": [
        "Earth (planet)"
    ],
    "response": [
        {
            "author_info": {
                "name": "Richard Muller",
                "href": "/profile/Richard-Muller-3"
            },
            "answer_text": "Forever. The United States has improved its efficient use of energy at a rate of about 1% per year over the past century. During the Mideast Oil Crisis, we improved it at a rate of 4% per year.  China is now aiming at a 4% per year improvement, and there are indications that they are succeeding. The key fact is that if the world averages a 2% per year improvement, then in the year 2100, the entire world population can be living at the current European standard of living, and we will be using less energy than we are now. What about population growth? Every serious projection, including those of the United Nations, projects that world population will peak around 2050, at about 9 billion. That's higher than today's 7 billion, but sustainable.  What about resources other than energy?  Human civilization has shown a great resilience, and ability to find substitutes. Moreover, we are getting very good at recycling. Nobody tears down a building without reusing the steel. In a famous bet with Paul Erlich, Julian Simon bet that over a ten year period the cost of natural resources would drop for a majority of materials, and he let Erlich pick the materials.  Ten years later, Erlich paid off the bet. It turned out that the cost, in constant dollars, of every one  of the natural resources Erlich had picked had done down. Simon offered to renew the bet, but Erlich refused, at least under the same conditions. He wanted to change the bet to be about how people felt about the world; did they think it was getting better. I suspect that our general feeling that the world is getting worse is what drives us to make it better.  So please don't read what I am writing and become complacent!  But there is realism in optimism. Global warming? The key is energy conservation and reduced use of coal. Much of the CO2 remains in the atmosphere, so we will not easily undo the warming we have created so far (about 1.5 °C in the last 250 years), but we can limit it to another 1.5 °C by profitable means (conservation, efficiency, and new approaches to nuclear power) and I am convinced that it will be brought under control. We will adapt to the additional 1.5 °C rise. Of course, we could have a thermonuclear war and wipe ourselves out. One can be pessimistic. But pessimism is not a consequence of the facts and our history and experience.  There is good reason to think that civilization is nowhere near an end, and that things are getting better. I am a student of history, and I like to ask the question: if you look back over known history, and pick a date when you could be reborn, what date would you pick. You must assume that you would be a random person, unlikely to be a king or super-wealthy person.  What is the best year so far?  I think the answer is obvious. 2016. ",
            "date": "Updated March 24, 2016",
            "views": "32",
            "upvotes": " View 57 Upvoters",
            "upvoters": [
                {
                    "user_id": "David Dennis",
                    "user_href": "/profile/David-Dennis-12"
                },
                {
                    "user_id": "Rick Merdart",
                    "user_href": "/profile/Rick-Merdart"
                },
                {
                    "user_id": "Craig Tullis",
                    "user_href": "/profile/Craig-Tullis-2"
                },
                {
                    "user_id": "Gary Ansorge",
                    "user_href": "/profile/Gary-Ansorge"
                },
                {
                    "user_id": "Donna Dealing",
                    "user_href": "/profile/Donna-Dealing"
                },
                {
                    "user_id": "Johann Kurt Altmann",
                    "user_href": "/profile/Johann-Kurt-Altmann"
                },
                {
                    "user_id": "Rohan Mehere",
                    "user_href": "/profile/Rohan-Mehere"
                },
                {
                    "user_id": "Ben Bittner",
                    "user_href": "/profile/Ben-Bittner-1"
                },
                {
                    "user_id": "Andriy Obayev",
                    "user_href": "/profile/Andriy-Obayev"
                },
                {
                    "user_id": "Mahdi Ghiasi",
                    "user_href": "/profile/Mahdi-Ghiasi"
                }
            ]
        },
        {
            "author_info": {
                "name": "Garvin H Boyle",
                "href": "/profile/Garvin-H-Boyle"
            },
            "answer_text": "You ask “How long will the earth be sustainable for human life?” I am not an expert in such questions, but I have given it a lot of thought, and I have opinions. The earth has only sustained modern society for a mere 250 years, or so. This is a once-in-a-planet’s-lifetime experience. We have consumed most of the easily accessible matter that we found near the surface of the Earth, and there is little for any follow-on people (or species) to work with. So I would like to address the question, “How long can our current global civilization continue to be sustained?” I personally believe that it is much less than 250 years, because over the past 250 years we have pretty well depleted the inheritance we received. It is pretty well all gone! But let me put a few more points behind that logic. WE NEED ENERGY FOR FOOD: Currently about 90% of the edible energy in our global food supply comes from fossil fuels, indirectly, through the chemical or artificial fertilizers we put on our crops. These fertilizers are produced using energy-intensive processes. Only about 10% of the global food supply comes directly from Sunlight. It used to be the case that close to 100% came directly from Sunlight. Without fossil fuels there will be a massive shortage of food. Add to that, the food needs to be harvested, processed, transported, stored and sold to us. There is a large energy cost in operating the global food systems, apart from the edible energy content. ENERGY FROM FOSSIL FUELS IS TIME-LIMITED: The phenomenon of “peak oil” is a real hurdle that humankind must get past. Our stock of recoverable fossil fuels is dwindling. In addition, the energy return on energy invested (EROI) of our remaining stock of economically recoverable fossil fuels is slowly declining. We have less, and it has lower quality. We currently use about 90 million barrels of oil per day, and we cannot possibly find alternate sources of energy to fuel the global community at that rate. And yet, we continue to urge our governments to grow our economies. That is an idea that cannot possibly succeed. When wishes are contrary to physics, physics usually wins. POLLUTION FROM FOSSIL FUELS IS KILLING THE PLANET: We are experiencing a massive die-off of species and a period of rapid climate change driven by our use of fossil fuels. And the plastics derived from them are proving unmanageable. THE DILEMMA: To support a growing population we must increase the amount of food produced, which means we must extract, process and burn more fossil fuels. However, this puts more carbon into the atmosphere causing climate change. If we consume less fossil fuels, we cannot continue to feed the planet. But, we may not have a choice as the recoverable energy from fossil fuels dwindles. We are caught between Scylla and Charybdis. THE ANSWER TO YOUR QUESTION: The scientists who worry about such things do not like to make public predictions. [There are a lot of people who attack them rather viciously when when they make any of the points I am trying to make above.] But, over a beer in the pub, they are not optimistic. It seems to them that our modern global civilization is going to come to a spectacular crash in the near future (say in the next 100 years). Setting aside nuclear war or other old-style nasty ends, civilization can come to an end in a number of ways: - we run out of economically recoverable fossil fuels (or alternatives), and starve. - we produce too much waste, and kill off much of the biosphere, including ourselves. - we cause catastrophic climate change, and kill off much of the biosphere, including ourselves. It seems that the modern world is in a mad race to do all three. It is difficult to decide which is more likely, or which will come more quickly. But I would give us 250 years at the absolute most. MY OPINION - AMONG OTHER SOLUTIONS, WE NEED A FUNDAMENTALLY DIFFERENT CONCEPT OF ECONOMICS: Our modern economic theories are laced with quasi-religious dogma that ignores modern systems science and drives us towards a bad doom. They were developed starting in the late 1800s at a time when energy was increasingly available but little understood. Those conditions no longer exist. Those economic theories are now obsolete. We need to develop a new theory of economic activity that is evidence-based, consistent with modern system theory, and designed to address the current global crises. This, of course, would not solve all of our problems, but, at the very least, it might provide a new well-spring of inspiration and policy advice for the coming generations so they know how to solve problems in a world of declining resource availability. ",
            "date": "Answered January 12, 2019",
            "views": "427",
            "upvotes": " View 5 Upvoters",
            "upvoters": [
                {
                    "user_id": "Missy Peterson",
                    "user_href": "/profile/Missy-Peterson-1"
                },
                {
                    "user_id": "Daniel Palacios",
                    "user_href": "/profile/Daniel-Palacios-5"
                },
                {
                    "user_id": "Hennie De Ruyter",
                    "user_href": "/profile/Hennie-De-Ruyter"
                },
                {
                    "user_id": "Russell Swan",
                    "user_href": "/profile/Russell-Swan"
                },
                {
                    "user_id": "Donna Dealing",
                    "user_href": "/profile/Donna-Dealing"
                }
            ]
        }
    ]
}