{
    "title": "For online teaching, which is better, a laptop, or a tablet or an iPad? - Quora",
    "tags": [
        "Android Tablets",
        "Tablet Devices",
        "iPad"
    ],
    "response": [
        {
            "author_info": {
                "name": "Adi Shetty",
                "href": "/profile/Adi-Shetty-4"
            },
            "answer_text": "Laptop Laptops are one of the most important tech tools for online teaching as they act as a substitute for your class presence. Therefore, they should provide maximum support in conducting an effective online class. If you don’t want to lug big laptops around, a smaller display (11” to 14”) is advisable. 15.6” is the mid-sized option and if you are looking for a relatively bigger screen, go for a 17” display. A brighter display is required if you are teaching outside. The resolution should be more than 720 pixels to get the desired output. Data storage is a key concern of online educators. A Solid State Drive (SSD) is preferable over a Hard Disk Drive (HDD) as it drastically reduces boot speed, is less prone to damage and doesn’t need defragmentation (Although, it might increase your budget). The size of your drive can range anywhere between 250GB to 1TB. Use a cloud storage system to safeguard your crucial data from accidental damages. Real-time online teaching requires high-speed processing hence compromising on the processor may not be the best idea for you. Look out for processors among Intel i3, i5 or i7 or AMD A-series for a decent processing speed. It is the short-term memory of your computer and helps it perform real-time functions. To conduct seamless online teaching sessions, you should have a 4+ GB RAM. Tablet Tablets make computing an easy affair. In the long list of tech tools for online teaching, tablets have worked their way up the hierarchy. Easy to carry and use, tablets come in all shapes and sizes. All you have got to do is figure out the one which fits best. Tablet screen size typically ranges from 7” to 13”. A 7-inch screen could fit in your pocket but will be a compromise in terms of output. While 10” to 13” inches bracket is for those who want relatively bigger screens, 8” to 10” is the average screen size. A resolution greater than 720p is ideal for eLearning sessions. Right now, the highest resolution you can get is 2,732 x 2,048 pixels in Apple’s iPad Pro (12.9”). If you’re looking for a 10-inch Android tablet, go for a display with at least 1,280 x 800 resolution. A tablet with 2+ GB RAM and 16+ GB internal storage will ideally meet your online teaching requirements. Windows and Android tablets come with expandable storage options as well. (Credits : wiziq) ",
            "date": "Answered June 6, 2017",
            "views": "89",
            "upvotes": " View 9 Upvoters",
            "upvoters": [
                {
                    "user_id": "Rupa Pathak",
                    "user_href": "/profile/Rupa-Pathak-11"
                },
                {
                    "user_id": "ROHIT NAIR",
                    "user_href": "/profile/ROHIT-NAIR-352"
                },
                {
                    "user_id": "MN Prasad",
                    "user_href": "/profile/MN-Prasad-9"
                },
                {
                    "user_id": "Divyansh Singhal",
                    "user_href": "/profile/Divyansh-Singhal-21"
                },
                {
                    "user_id": "RATNA SARMA",
                    "user_href": "/profile/RATNA-SARMA-2"
                },
                {
                    "user_id": "Mohan Kanakatla",
                    "user_href": "/profile/Mohan-Kanakatla"
                },
                {
                    "user_id": "Khondoker Moyeen",
                    "user_href": "/profile/Khondoker-Moyeen"
                },
                {
                    "user_id": "Abhishek Pandey",
                    "user_href": "/profile/Abhishek-Pandey-359"
                },
                {
                    "user_id": "Dhruv Shaswat",
                    "user_href": "/profile/Dhruv-Shaswat"
                }
            ]
        },
        {
            "author_info": {
                "name": "Ansh Shrivastava",
                "href": "/profile/Ansh-Shrivastava-7"
            },
            "answer_text": "A laptop is much better choice when it comes to teaching.As on a laptop there are keyboard and mouse which are inbuilt in the laptop and they are quite handy when it comes to use. A child who is not having much more knowledge about computers can be easily taught about how to use a keyboard and a mouse for this reason the laptop give an advantage over the iPad if you want the both experience is combined you can go for a hybrid laptop or you can say convertible laptop which can be used as a laptop or as a Tablet. Also when it comes to prepare a presentation for using the also when it comes to preparing presentation for using the Microsoft Word it is very good if you are using a laptop as it is containing of a keyboard which can be used to type easily anything on the word or if you are preparing a presentation the mouse at can be used to easily operate things but when it comes on iPad you cannot do it so easily also it is a bit complicated as it is iOS. ",
            "date": "Answered June 6, 2017",
            "views": "46",
            "upvotes": " Answer requested by Riyaz Khan"
        }
    ]
}