{
    "title": "From your viewpoint, what does the future of mankind look like? - THE FUTURE OF MANKIND - Quora",
    "tags": [
        "Viewpoints",
        "Future of Humanity",
        "The Future (time)",
        "Futurism",
        "Perspective",
        "Future Scenarios",
        "Human Evolution",
        "The Human Race and Condition",
        "Technology"
    ],
    "response": [
        {
            "author_info": {
                "name": "Michele Puzzolante",
                "href": "/profile/Michele-Puzzolante"
            },
            "answer_text": "THE UNITED NATIONS’ 17 SUSTAINABLE DEVELOPMENT GOALS (SDGs). The United Nations’ 17 Sustainable Development Goals (SDGs) aim to achieve decent lives for all on a healthy planet by 2030. As things stand, most of them are likely to be missed. This is partly because they fail to address human population growth. Positive, empowering population solutions are key to meeting the SDGs. Read on to learn about the links between population and each of the 17 goals.   GOAL 1: NO POVERTY High fertility rates can trap countries in poverty. The World Bank has warned that extreme poverty will not decrease in 2021 due to population growth eclipsing economic growth in the poorest nations. Large family size and poverty often go hand-in-hand. People living in deprived areas are usually not empowered to choose the number of children they have and in some cases feel the need to have many so they can be provided for in their old age. When people are poor and have many children, they cannot invest enough in each child which often leads to kids not being able to attend school and girls getting married off as child brides. Women are also less able to gain financial independence when they have many children to look after at home. Ensuring everyone is empowered to choose small families is key to eradicating poverty. In June 2020, the World Bank forecasts that the three countries which between them have a third of the world’s poor – Nigeria, India and the Democratic Republic of Congo – will not grow their economies faster than their populations.  GOAL 2: ZERO HUNGER Feeding the world without destroying more nature will become increasingly difficult and eventually impossible under sustained population growth. According to the World Resources Institute, the calorie requirements of a population of 10 billion are 56% higher than current total crop production. Agriculture is already a leading cause of environmental degradation and further conversion of land for farming purposes will have devastating consequences for biodiversity and our climate. A landmark 2019 report by the EAT-Lancet Commission states \"Healthy diets from sustainable food systems are possible for up to 10 billion people but become increasingly unlikely past this population threshold.\" Our population is projected to exceed 10 billion in the second half of the century. When population growth exceeds development progress, past achievements are quickly undone - the number of people suffering from hunger has increased again over the past three years. Experts have warned that vulnerable areas like the Sahel face catastrophe unless action is taken to reduce fertility rates.  GOAL 3: GOOD HEALTH AND WELL-BEING Insufficient funding for healthcare systems can cause them to buckle under the pressure of growing populations. Lack of access to quality reproductive healthcare including modern contraception and medically safe abortion leads to high unwanted pregnancy rates and preventable maternal deaths. Worldwide, still almost half of all pregnancies are unintended and more than 800 women die from pregnancy-related complications every day. Because of population growth, the absolute number of women with an unmet need for contraception is still increasing. Very high population densities facilitate disease transmission and hurt public health, especially in areas where health services are already overburdened. Investing in quality health care for all, including easy access to family planning, helps slow population growth and improves lives.  GOAL 4: QUALITY EDUCATION Greater investment in quality education is key to alleviating poverty and ending population growth. Due to gender inequality, girls are disproportionately affected by lack of access to education — still one in four girls does not attend secondary school and in sub-Saharan Africa, the number of girls out of secondary school has increased by 7 million since 2007 due to the region’s population growth. Generally, the more years a woman spends in education, the smaller her family size. When women are able to delay childbirth and have fewer children, this also empowers them to pursue educational opportunities, such as advanced degrees, which would be difficult or impossible with many dependents. In sub-Saharan Africa, the number of girls out of secondary school has increased by 7 million due to the region’s population growth.  GOAL 5: GENDER EQUALITY Empowering women and girls to take control of their bodies and lives is crucial for solving our biggest social and environmental crises. Gender inequality is one of the main drivers of high fertility rates. Not a single country has yet achieved full equality, and the worst gender-based injustices and crimes continue to be common and widespread. According to the UN, ending gender-based violence, harmful practices (including child marriage and FGM), preventable maternal deaths, and unmet family planning needs is affordable and within reach, but still suffers from a severe funding shortage. In the meantime, the number of women and girls subjected to harmful practices is increasing due to slow progress and population growth. “The proportion of women and girls subjected to FGM is decreasing overall, but the number of women and girls subjected to it is growing because of population growth. That number could grow from 4.1 million in 2020 to 4.6 million a year by 2030, since the cohort of girls in many high-prevalence countries is growing.” - UNFPA, 2020  GOAL 6: CLEAN WATER AND SANITATION The combination of climate change and population growth is fuelling a global water crisis. As our numbers grow, aquifers get overdrawn, pollution increases, and the capacity to safely dispose of wastewater is increasingly compromised. Currently, a staggering 2.2 billion people around the world do not have safe drinking water and 4.2 billion lack safe sanitation services. In the UK, overexploitation and drought could lead to severe water shortage by mid-century. The UK population is expected to reach 73 million by 2041, with the fastest growth occurring in areas that are already the most water-stressed. Experts estimate that by 2050, 5 billion people – more than half the global population – will live in water stressed regions.  GOAL 7: AFFORDABLE AND CLEAN ENERGY The number of people using dirty fuels is still increasing due to population growth and slow progress in rolling out renewable energy. Global energy demand is expected to increase by 50% over the next 30 years as a result of population growth and economic development. High-income countries must lead the way in transitioning to clean fuels and support low-income countries to do the same. Ending population growth will make a global switch to affordable and clean energy a lot more achievable. The absolute number of people relying on polluting fuels and technologies for cooking has actually increased, reaching an estimated 3 billion people.  GOAL 8: DECENT WORK AND ECONOMIC GROWTH A high number of young dependents makes economic prosperity almost impossible and is also a recipe for social unrest. \"The high population is exerting a lot of pressure on our economy. As a country we have made tremendous gains over the years but the impact is not reflected on our economy because the gains have been dissipated by population growth.” – Goodall Gondwe, minister of Finance, Malawi, 2017 In high-income nations, the pursuit of economic growth is in direct conflict with other SDGs, in particular in regard to environmental impact. Infinite economic and population growth can never be sustainable on a finite planet. As a global community, we must strive towards a healthy environment and well-being for all, not endless growth.  GOAL 9: INDUSTRY, INNOVATION AND INFRASTRUCTURE The larger the population, the harder it is to provide access to modern infrastructure and technologies to everyone, and the more nature we will destroy in the process. Conversion of land to human infrastructure is a key driver of biodiversity loss and construction is a major source of greenhouse gases. The expansion of roads in South Asia, for example, is increasingly threatening the survival of tigers. Only 4,000 remain in the wild today and 40% of tiger habitat has been lost over the last 15 years alone. In the UK, the controversial HS2 rail network is thought to threaten more than 30 ancient woodlands.  GOAL 10: REDUCED INEQUALITIES Vast disparities exist between the rich world and the Global South, and within countries themselves. A more just global system, in which resources are distributed more equitably, is essential. Whilst we must limit the number of new consumers everywhere, choosing a small family is particularly impactful among the wealthiest of us.  GOAL 11: SUSTAINABLE CITIES AND COMMUNITIES More than half the world's population lives in urban areas today. By 2050, this proportion is expected to rise to 68%. Rapid urban population growth can outstrip the pace at which infrastructure such as clean water, sanitation, health, jobs and education can be offered. According to the WWF, one of the main causes of habitat loss is land for human habitation with urban areas doubling since 1992. Access to green spaces is important for physical and mental health, but natural and semi-natural areas are increasingly falling victim to housing demands. In the UK, population growth is expected to lead to a 7.6% decline in the amount of green space available per person by 2040. The number of people living in slums has grown: from an estimated 792 million in 2000, to over 1 billion in 2016.  GOAL 12: RESPONSIBLE CONSUMPTION AND PRODUCTION According to the UN, material footprint per capita in high-income countries is 60% higher than in upper-middle-income countries and more than 13 times the level of low-income countries. Responsible consumption and production of food and goods must go hand-in-hand with measures to end our population growth. The very high number of people escaping poverty is the main reason that average resource use per person in 2050 is projected to be 71% higher than today. We are already using resources 1.75 times faster than they can regenerate - unless things change, we will require three Earths to supply our needs by 2050.  GOAL 13: CLIMATE ACTION Unsustainable consumption patterns in high-income countries are largely responsible for the climate crisis but every additional person on our planet adds more emissions. A comprehensive review of available climate solutions by Project Drawdown found that slowing population growth through the combination of educating girls and providing family planning would be one of the most powerful ways to reduce atmospheric CO2 by 2050. The 2019 Scientists’ Warning of a Climate Emergency, endorsed by more than 11,000 scientists, called for ending and ultimately reversing human population growth, among other transformative actions, to avert the worst effects of climate change.  GOAL 14: LIFE BELOW WATER Pollution (plastic and runoff), overfishing, coral bleaching, and coastal ecosystem destruction all exacerbated by population growth. Two-third of marine areas have been damaged by human activity and a third of sharks and rays and a third of reef corals are threatened with extinction. Tackling the loss of life under water has to include a commitment to reducing population growth and runaway consumption. Family planning, women's education and empowerment together can also enable more women to participate in marine resources management; enhance food security and mitigate the impacts of climate change.  GOAL 15: LIFE ON LAND Human population growth is one of the main causes of biodiversity loss. According to WWF, we have lost 60% of all vertebrate wildlife populations since 1970. During that time, our population has more than doubled. A landmark 2019 UN assessment explicitly noted that human population growth is an indirect driver of biodiversity loss and stated: “changes to the direct drivers of nature deterioration cannot be achieved without transformative change that simultaneously addresses the indirect drivers.” To be truly effective in the long-term, conservation efforts must incorporate population solutions.  GOAL 16: PEACE, JUSTICE AND STRONG INSTITUTIONS In the absence of prosperity and strong institutions, population growth contributes to conflicts related to scarce resources. Educating and empowering women and communities, including ensuring access to voluntary family planning services, can help support peace and stability goals by increasing the foundation for stability. And where families can choose the number and timing of their children, women may have more opportunity to take part in civil society and peacebuilding.  GOAL 17: PARTNERSHIPS FOR THE GOALS Cross-sectoral partnerships that recognise the crucial links between social and environmental issues are key to a better future. COVID-19 has presented unprecedented challenges, reversing decades of development and causing a deep global recession. Never has there been a more critical time for strengthening partnerships and securing the next ten years of collaboration for sustainable development. The international community must foster recognition of the urgent need to end human population growth as soon as is ethically possible, and promote greater investment in empowering solutions. CONCLUSIONS: Every single Human Being is responsible for the future of Mankind.The United Nations’ 17 Sustainable Development Goals give us the map road to follow in order to preserve all Life Forms, Mankind and Planet Earth.The idea that we are living only one lifetime and that the future of Mankind is not our responsibility is a lie.What we create today is what we will find in the next Lifetime.If you are interested in the Future of Mankind, please join our Quora Space here: THE FUTURE OF MANKIND Thank you for your support and understanding. Copyright 2020 – Michele Puzzolante – All rights reserved ",
            "date": "October 23, 2020",
            "views": "1",
            "upvotes": " View 6 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Nandan N",
                    "user_href": "/profile/Nandan-N-16"
                },
                {
                    "user_id": "Thelma Owunna",
                    "user_href": "/profile/Thelma-Owunna"
                },
                {
                    "user_id": "Divyesh Raj",
                    "user_href": "/profile/Divyesh-Raj-2"
                },
                {
                    "user_id": "David Gwartney",
                    "user_href": "/profile/David-Gwartney-1"
                },
                {
                    "user_id": "Dileep Kumar",
                    "user_href": "/profile/Dileep-Kumar-5184"
                },
                {
                    "user_id": "Saiva Chaitanya",
                    "user_href": "/profile/Saiva-Chaitanya"
                }
            ]
        },
        {
            "author_info": {
                "name": "Keith H. Burgess",
                "href": "/profile/Keith-H-Burgess"
            },
            "answer_text": "Michele, I honestly don’t think the human race is going to survive the next 100 years. IF the world were to stop burning fossil fuels completely by the end of 2020, then I would say that those that have prepared & are living off grid, may stand a chance of surviving. But as it is, corrupt governments & corporatism are still prioritising fossil fuels over alternate energy & the welfare of the people. The wealthy, including government officials have a place in their plush survival bunkers. How long this will keep their children alive I have no idea.'Uninhabitable hell': Climate change and disease threaten millions  Welcome to the Anthropocene Age. Will it be the end of us?  ‘High likelihood of human civilisation coming to end’ by 2050, report finds  Human society has 90% chance of collapsing in the next few decades. But why?  Inquiry hears natural disasters likely to become more intense and frequent in future | Sky News Australia  Anthropogenic climate change accelerating faster than earlier, natural analogs - Advanced Science News  Climate change is only going to make health crises like coronavirus more frequent and worse  'My home is touched by the sea': Climate change displacing one person every two seconds, Oxfam says  'Uninhabitable Hell:' UN Report Warns of Planet's Future for Millions Without Climate Action  All we have to do to save the human race from extinction is to stop burning fossil fuels, but it seems that this is too much to ask. The people prefer death over changing society & their environmentally damaging city lifestyles!!! Keith. ",
            "date": "October 23, 2020",
            "views": "86",
            "upvotes": " View 3 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Don Sagar",
                    "user_href": "/profile/Don-Sagar-1"
                },
                {
                    "user_id": "Divyesh Raj",
                    "user_href": "/profile/Divyesh-Raj-2"
                },
                {
                    "user_id": "Michele Puzzolante",
                    "user_href": "/profile/Michele-Puzzolante"
                }
            ]
        },
        {
            "author_info": {
                "name": "Vernon Huffman",
                "href": "/profile/Vernon-Huffman-2"
            },
            "answer_text": "As human population grows and consumption rates rise, we are testing the limits of many natural systems. If our behavior doesn’t change, it is a distinct possibility that humanity will be swept up in the Sixth Great Extinction. It doesn’t have to be like that. We have the ability to stabilize human population at sustainable levels. We could plant food forests. Instead of exploiting resources faster than the planet replaces them, we could assure that everybody gets enough but nobody consumes wastefully. We could reduce, reuse, recycle everything. Each of us could grow our own food, pedal our own bikes, and care for our neighbors. A world without war is not only possible, but it is a necessity for our survival. Military wastes more fossil fuel and pollutes more than anybody else. Killing people and blowing things up is an obsolete form of conflict resolution that never did work that well for anybody but a few war profiteers. We could have locally appropriate democratic institutions if we could stem exploitation and corruption. We’ve certainly got a lot of work to do, organizing to live for the better world we all know is possible. ",
            "date": "October 24, 2020",
            "views": "27",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Michele Puzzolante",
                    "user_href": "/profile/Michele-Puzzolante"
                }
            ]
        }
    ]
}