{
    "title": "From the 5 eras of IT infrastructure, what are your visualization for the next 10 years? What will be your title of that era? - Quora",
    "tags": [
        "IT Infrastructure",
        "Historical Eras",
        "Visualization",
        "Infrastructure",
        "Data Visualization",
        "Information Technology",
        "Technology Trends"
    ],
    "response": [
        {
            "author_info": {
                "name": "Kiryl Persianov",
                "href": "/profile/Kiryl-Persianov"
            },
            "answer_text": "The mainframe era, the personal computer era, the client/server era, the enterprise computing era, the cloud and mobile computing era. Artificial Intelligence of Things (AIoT), AI Internet of Minds, Agents, Processes and Things.  Understanding AIoT - The Artificial Intelligence of Things | Mind Commerce AI technologies within Internet of Things (IoT) infrastructure (platforms, servers, devices, chipsets, software, etc.) to improve IoT operations, improve human-machine interactions, and enhance data management, analytics and decision-making capabilities. Embedded into ICT infrastructure (programs, chipsets, edge computing, etc.) and human brains, interacting with IoT networks/systems at the device level (such as chipsets), software level (operating systems and programs), and platform level, AI is emerging as a Global Digital Superintelligence Human Platform. ",
            "date": "Answered October 24, 2020",
            "views": "134",
            "upvotes": " View Sharers "
        },
        {
            "author_info": {
                "name": "Jørgen Pallesen",
                "href": "/profile/Jørgen-Pallesen"
            },
            "answer_text": "Age of Enlightenment! the educational system will be heavily expanded and improvedall education can be both in text and video formit will be free and on demandtaylor made for different people with different needsadults will also get a educationthe basic education will be greatly relevant, and all bloat cut awaymid school most will be boiled down to principles, only gifted students will have mid to high lvl education",
            "date": "Answered October 24, 2020",
            "views": "77",
            "upvotes": " Answer requested by Janeth Bambalan"
        }
    ]
}