{
    "title": "Given that robots are better than humans at mechanical and computational task, why did Evolution fail to design living organisms that have the same or better capabilities? Is it possible in the future for a robot to become alive? - Quora",
    "tags": [
        "Robots",
        "Robotics",
        "Evolutionary Biology",
        "Artificial Intelligence",
        "Biology"
    ],
    "response": [
        {
            "author_info": {
                "name": "Martin Pollard",
                "href": "/profile/Martin-Pollard-12"
            },
            "answer_text": "Because robots and other machines are only better at some mechanical tasks and computers are only better in some, more narrow, computational tasks. Humans make great use of technology but the vast majority of human activities, both physical and mental, remain unautomated. Why? I used to tell my engineering staff and customers that just because you can automate something doesn’t mean you should automate something. In most cases it just doesn’t make economic sense and often takes too much time. Evolution didn’t fail at anything. Evolution just is. It is a process of biological organisms. It has no goals or problems to solve. Humans are surviving and reproducing just fine and we develop technology as part of that survival. Robots are machines controlled by computers. There are not alive by any biological definition. However, you could imagine building a robot or software program that successfully mimic humans actions and thinking. That is the idea behind the Turing test. Turing test - Wikipedia We have never come close to developing software that passes a general Turing test. We have developed impressive AI software the can excel at playing some complex games and to answer factual questions among others narrow applications. ",
            "date": "Answered October 22, 2020",
            "views": "89",
            "upvotes": "0"
        },
        {
            "author_info": {
                "name": "Nev Anderson",
                "href": "/profile/Nev-Anderson"
            },
            "answer_text": "“Given that robots are better than humans at mechanical and computational task, why did Evolution fail to design living organisms that have the same or better capabilities? Is it possible in the future for a robot to become alive?” Evolution doesn’t “design” anything, Evolution actually doesn’t do anything, it is the passive consequence of Natural Selection persistently removing the least adept individuals from a species population. Thus leaving a more adept pool of genetic characteristics to form the next generation. Evolution occurs at the instant that conception takes place. That is when the DNA of the parents mixes, setting the attributes of the offspring. Thinking that includes designing and goals, is god substitution thinking. Evolution is encompassed within those that survive easiest, breed the most, so their DNA will dominate the species population. If you get eaten, because you were too slow, or too easily confused, your genetic signature is gone, and will not produce offspring, thus improving the average ability of the species. Constant improvement in a species, unavoidably results in physical changes. Accumulating over thousands of years, they become significant. ",
            "date": "Answered October 22, 2020",
            "views": "87",
            "upvotes": " View 2 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Jim Brown",
                    "user_href": "/profile/Jim-Brown-437"
                },
                {
                    "user_id": "Keith Robison",
                    "user_href": "/profile/Keith-Robison"
                }
            ]
        }
    ]
}