{
    "title": "Had any person done time travel? - Quora",
    "tags": [
        "Time Travel Scenarios",
        "Time (physics)",
        "Visiting and Travel"
    ],
    "response": [
        {
            "author_info": {
                "name": "Sampurna Dasgupta",
                "href": "/profile/Sampurna-Dasgupta-1"
            },
            "answer_text": "Yup! Meet Sergei Krikalev. Earth’s first time traveller.  He has spent 803 days, 9 hours and 39 minutes in space. And during his stay, he time travelled into his own future by 0.02 seconds. In fact, it’s not just this guy, every astronaut on the ISS who’s stayed for more than 6 months, has time travelled. How you ask? Time Dilation. Now before you move on understand that special relativity is notoriously unintuitive. Astronauts on the ISS are affected by both types of time dilation. Gravitational and Velocity Time Dilation. Velocity time dilation occurs when another reference frame is moving relative to you. I cannot explain time dilation in any other way except with the train analogy because I find it horribly confusing. So here you go. Let’s say your friend Bob is inside a moving train with a mirror 5m away from him. And you’re looking at him on the platform. He shines a flashlight towards it and of course, the light reflects back.  From Bob’s point of view, he sees the light travel go back and forth, covering a distance of 10m. But you see something entirely different  Since the train is moving and you’re standing still on the platform, you see the light cover a greater distance, because Bob and the mirror are moving sideways from your perspective. Hence, light must’ve travelled a greater distance from your point of view. But, remember the speed of light is always constant. So, if with the same speed, light travelled different distances, what needs to change here? Time! From your perspective, light took a longer time to reflect on the train, since it travelled a greater distance. So, time has slowed down for Bob, relative to you. Now, gravitational time dilation is easy, gravity can slow down time. For a why? You can read this Sampurna Dasgupta's answer to How do black holes impact time? So what happens to astronauts on ISS is a combination of the two. The ISS is orbiting at massive speeds, compared to people on earth. Here, velocity time dilation slows down time for them. But at the same time, since they are further away from the center of the earth, the effects of gravity are less on them making their clocks run faster than on earth. But both the effects are not equally strong, and velocity time dilation wins here, slowing down time for them. That’s the closest you can get to time travel. ",
            "date": "Answered June 19, 2017",
            "views": "46",
            "upvotes": " View 26 Upvoters ",
            "upvoters": [
                {
                    "user_id": "Teja Saagiraju",
                    "user_href": "/profile/Teja-Saagiraju"
                },
                {
                    "user_id": "Sunny Kumar",
                    "user_href": "/profile/Sunny-Kumar-1956"
                },
                {
                    "user_id": "Ayush",
                    "user_href": "/profile/Ayush-959"
                },
                {
                    "user_id": "Kartik Kumar",
                    "user_href": "/profile/Kartik-Kumar-107"
                },
                {
                    "user_id": "Bruno Pal",
                    "user_href": "/profile/Bruno-Pal"
                },
                {
                    "user_id": "Laughter Master",
                    "user_href": "/profile/Laughter-Master"
                },
                {
                    "user_id": "Antigone Peristera",
                    "user_href": "/profile/Antigone-Peristera"
                },
                {
                    "user_id": "Spider Wings",
                    "user_href": "/profile/Spider-Wings"
                },
                {
                    "user_id": "Scott Gandara",
                    "user_href": "/profile/Scott-Gandara"
                },
                {
                    "user_id": "Sophia C",
                    "user_href": "/profile/Sophia-C-13"
                }
            ]
        },
        {
            "author_info": {
                "name": "Nicholas Lee",
                "href": "/profile/Nicholas-Lee-140"
            },
            "answer_text": "If you have a time machine, you need to be able to lock up the time period you left from causality effects, effecting it. Imagine if the time machine you had could move things from the past, from the future. Move a quark out of place in an atom in a grain of sand, on a beach 1000 years ago. Something as little as this, is enough to change the whole history of the earth from that point on.  If you watch videos on the grandfather paradox it is a misconception that you can have enough time to stand in front of him to pull the trigger, let alone have a conversation with him.  You cannot go back in time and get the winning lottery numbers, you cannot kill Hitler, stop Pearl Harbor attack, you cannot save JFK, or stop September 11th. You can only change these things if the time machine can lock up causality effects (keep the time period you came from from causality effects effecting it) But the changes would never count in reality you came from, just the other dimension you went back into, and messed around in. If a machine can do something as amazing as recreate the past, then locking up causality should be no problem for the time machine to do. Maybe people from the future go into the past in the technique I described above, or have the technology to view the past from the future on a television monitor, without causing any causality effects. These are the only two ways I can think of that do not effect causality. In another causality experiment I thought if its the interactions with people, and other things which cause causality, then what if you went back in time into a solid thick steel container, that was buried ten miles deep down in the in moons crust, it would be one mile thick in every direction up, down, left, right, forwards, and backwards. So if you go back in time into the container on the moon, it should not create any causality effects, because you do not interact with anything. The ripple effects of causality have been subdued. There would be dampening systems in the container to stop your vibrations, but it may not be enough, and not work at all. Just interacting with the air molecules could be enough to cause causality, even the space in the container. Dark matter, and energy is still not understood, and time travel into the past into the steel container could have an effect on the way dark matter, and dark energy effect other objects, to maybe cause causality.  Unless the aliens have a time machine, but they are not going to share, because we are about money, greed, exciting our neurotransmitters, and power, and cannot be trusted, even if we can understand the time machine technology they created, if explained to us by them. Aliens explaining how their time machine works to us, It might be like explaining calculus to a ape. Maybe we are just not smart enough to understand it. The most visited place by a time traveler if possible would be the bookstore depository where Lee Harvey Oswald shot JFK, or the Dinosaur period.   Maybe there is some clues around there of future time travelers, especially in the Zapruder film of JFK being assassinated.  Look at Ronald Mallet time machine on YouTube, but it can only send information back to the point when it was switched on. ",
            "date": "Answered August 24, 2016",
            "views": "21",
            "upvotes": " View 6 Upvoters",
            "upvoters": [
                {
                    "user_id": "Kartik Kumar",
                    "user_href": "/profile/Kartik-Kumar-107"
                },
                {
                    "user_id": "Gaurav Kumar",
                    "user_href": "/profile/Gaurav-Kumar-1440"
                },
                {
                    "user_id": "Laughter Master",
                    "user_href": "/profile/Laughter-Master"
                },
                {
                    "user_id": "Antigone Peristera",
                    "user_href": "/profile/Antigone-Peristera"
                },
                {
                    "user_id": "Chuck Rogers",
                    "user_href": "/profile/Chuck-Rogers-1"
                },
                {
                    "user_id": "Fahad Yusuf",
                    "user_href": "/profile/Fahad-Yusuf-4"
                }
            ]
        }
    ]
}