{
    "title": "Has ubiquitous computing arrived? - Quora",
    "tags": [
        "Ubiquitous Computing",
        "The Future",
        "User Experience",
        "Cloud Computing"
    ],
    "response": [
        {
            "author_info": {
                "name": "David Urquhart",
                "href": "/profile/David-Urquhart"
            },
            "answer_text": " I think we're getting close.  Some of the user experiences that I would consider representative are listed below, with examples of current technology in parenthesis: - You start to use a brand new computer and it already knows who you are.(I have a Google login that works everywhere and my personal devices are set to automatically log in.  Technologies exist for proximity based authentication although they are not popular.) - Whatever device I use, I have the same preferences, style, desktop etc.(Workplace computers already offer floating profiles and desktops.  Some integration with mobile devices is available.  Security currently errs on the side of keeping employer and personal contexts separate.) - At an overseas conference mixer I want a faster link in order to show someone my holiday movie.  I see a network port on the wall.  I plug into it and that is all I have to do to get bandwidth, even though I'm in a location I've never been to before.(Mobile phones work a lot like this.  A lot of network complexity is already managed for ad hoc users, such as obtaining an IP via DHCP, but that is not always permitted.  Some urban spaces provide free Internet wirelessly.) - I wake up and my phone tells me that my workstation is offline.  It says the problem is the motherboard and that a guy is coming to fix it before 10am, which fits with my appointments.(Vendors often do bundle support with computers, and the computers use their own model number to help locate updated drivers.  While we use e-commerce and are happy for our calendar to suggest an available time for a new appointment, we aren't quite ready for our computers to shop for us.  Operating systems can fire network events when computer faults are detected and some workplaces have proactive IT support that could respond to such events.) - My kids have never heard of a system update.  For as long as they know, computers sometimes announce that a new feature is available but there's nothing to do - its already done.(Many systems automatically download updates and unattended updating already happens.  It is rare to have to reboot but we've all done it this year.  Often we are prompted to approve system actions. Some support providers will make a remote connection to my computer to fix an issue, but I have to be present.) - Rather than me going to Yahoo for what I want, Yahoo is one of a number of relationships that contribute to my computing experience.  Similarly, I have a subscription with Adobe which means Photoshop appears in my application menu, but I've never had to go looking for a software vendor's support.  It's like there's a real live little Adobe help dude who appears when it's likely I need help or when I explicitly ask for help.  And have you ever wished two support people would talk to one another instead of asking you technical questions?  There's 11 support people who manage my computers and they all know about each other and what's been going on.  In fact the Honda girl and the Apple girl worked out why the Foo Fighters was skipping when I went over a bump.(The current vendor relationship model is that my computing relationships are managed by the providers.  I rely on them to properly protect my information.  I go to them.  Currently we explicitly authorize and manage software purchase, installation and requesting support.) ",
            "date": "Updated November 7, 2014",
            "views": "535",
            "upvotes": " View 4 Upvoters",
            "upvoters": [
                {
                    "user_id": "Sebin Sabu",
                    "user_href": "/profile/Sebin-Sabu"
                },
                {
                    "user_id": "Saurabh Sanyal",
                    "user_href": "/profile/Saurabh-Sanyal-1"
                },
                {
                    "user_id": "Pooja Singh",
                    "user_href": "/profile/Pooja-Singh-50"
                },
                {
                    "user_id": "Jay Rathod",
                    "user_href": "/profile/Jay-Rathod-13"
                }
            ]
        }
    ]
}