{
    "title": "Has technology reduced crime? - Quora",
    "tags": [
        "Crime Prevention",
        "Crime Statistics",
        "Criminology",
        "Criminal Law",
        "Technology Trends",
        "Crime",
        "Police and Law Enforcement",
        "Legal Issues and Law in Everyday Life",
        "Technology"
    ],
    "response": [
        {
            "author_info": {
                "name": "Blaine Pond",
                "href": "/profile/Blaine-Pond"
            },
            "answer_text": "I want to say no. Crime itself seems to linger around the same numbers given your location, but; there are a whole new array of crimes specifically related to technology alone, not to mention the crimes that have been made easier die to the Advent of technology ie sex crime, murder, robbery, extortion, human and drug trafficking, etc. My hypothesis is this; any reduction in crime pre technology would be made up for with the new types of crimes that you can commit and the crimes that have been made easier through technology had to either maintain similar levels to that of the past or surpassed it. But we all know that it's very difficult to put statistics on crime because it fluctuates not only throughout the years in the seasons but throughout different political situations and social situations as well. Thank you. ",
            "date": "Answered June 28, 2020",
            "views": "213",
            "upvotes": " View 1 Upvoter",
            "upvoters": [
                {
                    "user_id": "Mart Seugling",
                    "user_href": "/profile/Mart-Seugling"
                }
            ]
        },
        {
            "author_info": {
                "name": "David Simpson",
                "href": "/profile/David-Simpson-275"
            },
            "answer_text": "Yes… and no… Online crime has soared - with people having their identities stolen, cards hijacked etc. However - crime detection is a lot quicker, thanks to various advances in technology. ",
            "date": "Answered June 30, 2020",
            "views": "72",
            "upvotes": "0"
        }
    ]
}