{
    "title": "Has a teacher changed your life. How? - Quora",
    "tags": [
        "Life Changing Events",
        "Teachers",
        "Teaching",
        "Important Life Lessons",
        "Life and Living"
    ],
    "response": [
        {
            "author_info": {
                "name": "Vincent Fong",
                "href": "/profile/Vincent-Fong-25"
            },
            "answer_text": "Yes. I would say three teachers made a big difference in my life. The first teacher that made a difference was back when I was either in elementary school and my grades were dropping. Basically, I was doing poorly and as a result, my parents decided to place me in a summer school program to better prepare myself for school. At this program was when I met the English teacher that made a big difference. I remember his classes being overbearing and exhausting. We ended the year with a notebook full of post it notes with inferences to what Holden Caufield is thinking, etc. One thing that he said during those struggles is something I think I will never forget. He said, “Look, I don’t care if you guys hate me for giving you all this work. As long as I put the knowledge into you effectively, then that’s fine by me.”. This quote made me realize that the struggles I was facing was going towards a greater goal. After that, I began enjoying reading up until the end of middle school and put more effort into my work. The second teacher that made a difference in my life was in the 7th grade if I remember correctly. He was my project-based math(self-explanatory course name ) teacher. On the first day of school, my teacher had all of us introducing ourselves to the person next to us. To give some background, up until this point, I was an extremely shy person. In fact, I could barely talk to people and this was an uncomfortable moment for me at the time. When my teacher saw that there were some of us, me being one of them, that weren’t really talking. My teacher then made a class announcement saying something along the lines of, “If you are a shy person, I get that, but in the long run, it won’t help you in the future, it will actually negatively impact your future if you don’t go past your shyness.”. This announcement helped motivate me to not be shy to other people. Now, I am still introverted and barely talk to people, but the reason for not talking would no longer be from shyness. Now, I still don’t talk to others much, but not from shyness, but from not knowing how to start a conversation or end it. Finally, jumping the timeline to 11th grade, high school. My 11th grade intro to gaming teacher. My teacher didn’t say anything in particular to make a difference but being in the class itself while fully aware that it was not a class of games and instead, coding, made me want to pursue coding even more. This became prominent the following year with me joining the robotics club with the same teacher and observing other aspects that are incorporated with coding. All in all, about to start my new journey to college, I would say the three teachers I listed have created a big impact on me. I may add others in the future for the new adventure lying ahead. Thank you for reading up to this point. ",
            "date": "Answered August 11, 2018",
            "views": "16",
            "upvotes": " View 2 Upvoters",
            "upvoters": [
                {
                    "user_id": "Yoki Qian",
                    "user_href": "/profile/Yoki-Qian"
                },
                {
                    "user_id": "Geordan Christian",
                    "user_href": "/profile/Geordan-Christian"
                }
            ]
        },
        {
            "author_info": {
                "name": "Rael Picot",
                "href": "/profile/Rael-Picot"
            },
            "answer_text": "When I was in Grade 5 (10–11 years old) the school decided to have a hobby afternoon each week. All the girls in my class plus another class were put together to learn how to sew. Nowadays students would have a choice but not when I was young. Anyway, I was happy to learn knitting. We were told that we would be knitting a tea cosy and a jumper! Thank goodness I had a younger brother and wouldn’t have to knit a really big one! The teacher was very crabby. I only ever had her for this one afternoon, but she was very short with us. She had no help teaching twenty to thirty of us every week. She drew a picture of the needles and wool on the blackboard. We practised casting on and knitting with old wool for a couple of weeks and then told that we should finish our ribbed rea cosy over the holidays. I remember the feel of taking the label off my first ever ball of wool. Mum did help me with the casting on, but then I went to stay with my aunt for the holidays and she was no help! I started knitting: knit 2, pearl two, knit 2, pearl two, knit 2, pearl two, … you get the idea. I persevered without help but became rather stressed because my tea cosy looked more like a scouter than a cosy. I did improve when I could see the pattern forming and could work out where to knit and when to pearl. Still, it looked awful at the bottom! I ended up with a longer rectangle that was the right length but was convinced I’d be in trouble when I got back to school. I couldn’t sleep well. I was really afraid of the wrath of this crabby teacher. I got home from my aunt’s and Mum was the only person who could help me. She said there wasn’t time to do it again and I worried until the day came to go back to school after a completely wrecked holiday. Thursday, knitting day, came around and I was frankly panicking. When it was my turn to go up (we all went up one by one) and the teacher was checking our knitting. My name was called and my knees were knocking. Up I went. She looked at me. Then she folded my cosy over in half so that it was a double sided cosy that needed sewing up. Then she called the class to attention and showed the class the good side of my tea cosy and said, “I want you to look at a Rael’s knitting. I want everyone to make their knitting as well as Rael’s neat rows”. Well! I went back to my desk with my head held high and set myself to the task of sewing up my masterpiece. I remembered this episode all my life. I shaped my teaching on hers (without the crabbiness). She looked for the good in my work. I believe she noted my fear and overlooked the poor start. I could see nothing but the poor start. I looked back on that incident to analyse it in depth. I asked myself, why would she set such a difficult class? How did she even know my name? Who wanted to teach twenty or more girls how to cast on, knit and pearl? How did she do it without help? Where were the boys and what were they doing? Did the other girls even start or finish their homework? That teacher, Miss Poulson, obviously had a passion for it. She was a spinster (so called then) with no children. I realised how self-centred I was at that age. I also realised that I’d taken Mum for granted when I realised my aunt couldn’t knit at all. I am convinced that I’d never have picked up my knitting needles again if my teacher hadn’t praised me. She gave me a love of crafts that I’ve had until this day. I realised, on analysis that I’d followed in her footsteps. I always tried to look at the effort of a student, I allowed students to get to the point between frustration and learning - the Zone of Proximal Development where the best learning occurs. I didn’t want them to get past that point and not succeed because they’d given up. I learned never to do it for them either - maybe an option if I’d sweet talked Mum. Most of all move past the errors and acknowledge the achievements that came from the situation. When I taught adults I always got them to write a 500 word incident from their school years for all of us to analyse. Unfortunately few were positive and some highlighted some very bad practice. It was amazing when we looked at each anecdote - we did a PMI on each - Plus, Minus, Interesting. What I wanted them to take out of that exercise, as I did, was that every thing, every little interaction that they had with a student had the potential to be remembered by a young student - whether good or bad. That’s what Miss Poulson gave me was Rael’s Way of Looking. What a gift. What a shame I never thanked her for it. P.S. I still enjoy taking the label off a new ball of wool. ",
            "date": "Answered January 11, 2019",
            "views": "15",
            "upvotes": " View 1 Upvoter ",
            "upvoters": [
                {
                    "user_id": "Troyanne Schram",
                    "user_href": "/profile/Troyanne-Schram-1"
                }
            ]
        }
    ]
}